{
    "remaining_requests": 1079,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Kind-Worth-Killing-Novel/dp/B084QBL1JY",
    "body": {
        "name": "The Kind Worth Killing: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Kind-Worth-Killing-Novel/dp/B084QBL1JY",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/514azEVQ6JL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Peter Swanson",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Peter+Swanson"
        },
        "brand": "Peter Swanson",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 29711,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A devious tale of psychological suspense so irresistible that it prompts Entertainment Weekly to ask, “Is The Kind Worth Killing the next Gone Girl?” From one of the hottest new thriller writers, Peter Swanson, a name you may not know yet (but soon will), this is his breakout novel in the best-selling tradition of Paula Hawkins’ The Girl on the Train - now a major movie directed by Agnieszka Holland. In a tantalizing set-up reminiscent of Patricia Highsmith’s classic Strangers on a Train.... On a night flight from London to Boston, Ted Severson meets the stunning and mysterious Lily Kintner. Sharing one too many martinis, the strangers begin to play a game of truth, revealing very intimate details about themselves. Ted talks about his marriage that’s going stale and his wife, Miranda, who he’s sure is cheating on him. Ted and his wife were a mismatch from the start - he the rich businessman, she the artistic free spirit - a contrast that once inflamed their passion but has now become a cliché. But their game turns a little darker when Ted jokes that he could kill Miranda for what she’s done. Lily, without missing a beat, says calmly, “I’d like to help.” After all, some people are the kind worth killing, like a lying, stinking, cheating spouse....Back in Boston, Ted and Lily’s twisted bond grows stronger as they begin to plot Miranda's demise. But there are a few things about Lily’s past that she hasn’t shared with Ted, namely her experience in the art and craft of murder, a journey that began in her very precocious youth. Suddenly these co-conspirators are embroiled in a chilling game of cat and mouse, one they both cannot survive...with a shrewd and very determined detective on their tail. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Psychological Thrillers",
                "link": "https://www.amazon.com/Psychological-Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10491"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 17 minutes"
            },
            {
                "name": "Author",
                "value": "Peter Swanson"
            },
            {
                "name": "Narrator",
                "value": "Johnny Heller, Karen White, Kathleen Early, Keith Szarabajka"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 15, 2020"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B084QBL1JY"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,087 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #100 in Crime Thrillers (Audible Books & Originals) #131 in Psychological Thrillers (Audible Books & Originals) #343 in Suspense (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Austin Petersen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERWWO4Q2MFIPEII7DO6EV4HGUFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KSFIZ1VAJ4G0?ASIN=B084QBL1JY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Could not stop reading!!",
                "reviewText": "With way the viewpoints were depicted and well chosen details, I felt as though I was a part of each event in the book. Very twisty and dark at times, but kept me guessing what was next.New favorite book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sonya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDXB7KE7XBXUZLNTDJKWVUP2JGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CWMD2BQTKG76?ASIN=B084QBL1JY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "4.0 out of 5 stars The kind worth reading",
                "reviewText": "Completely unexpected thrilling ride!! Really enjoyed this one despite figuring out the plot twist early on. Don't trust any of the characters!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shaye Swiatek",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3BNZMDQ27LTPLTOITIKZNK2JUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R209QV0W8G3G51?ASIN=B084QBL1JY",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "3.0 out of 5 stars 3.5⭐️",
                "reviewText": "I found this book to be plausible but also unbelievable. Not sure how to explain that without giving away spoilers. I enjoyed it but also at about 70% I wasn’t as hooked. I wanted to see where it went as I felt the book had ended at this point and was curious where the author was taking it. The last page was interesting though and I want to see where it leads into the second book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Regina Niesen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHMYXYQC5SOFLGTBHMDPADIIJWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBFDPI157JN6H?ASIN=B084QBL1JY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2015",
                "reviewTitle": "5.0 out of 5 stars Compelling read of psychological suspese that was an absolute thrill ride to read. An absolute must read!",
                "reviewText": "The story is about Ted Severson and Lily Kitner, who meet on a flight back to the US from London. Ted is distraught because he had recently caught his gorgeous wife, Miranda, cheating on him with their general contractor, Brad. Ted and Miranda live in Boston but are building a luxury home on the coast of southern Maine. Ted was going to surprise Miranda for a visit because she spends a great deal of time in Maine supervising the building of the house while it is being built. On his surprise visit, as he is approaching the home, he sees Miranda and Brad through the windows having sex in the kitchen. On the flight, Ted is drunkenly telling the story to Lily, a complete stranger (he thinks-which adds so much suspense to the story later) and in his inebriated state says he is so mad that he wants to kill Miranda. To his utter surprise, Lily responds by saying something along the lines of \"Well why don't you just kill her then?\" At first Ted is shocked but as Lily talks openly about her thoughts of people with morals like Miranda and of murdering people, Ted becomes convinced that he should kill Miranda. He doesn't want to divorce her and let her have half of his fortune after what she has done to him and Lily has put forth a pretty solid plan on murdering both Miranda and Brad to make it look like Brad is the killer. Lily would be Ted's alibi and, to Ted, it looks like all should go as planned.Ted and Lily meet a few times to make plans and then the plan should be put into action. However, things go awry. And I mean they ago crazy and the story goes all over the place, but not in a way that the reader can't follow the story. The author just does an excellent job of taking the storyline and flipping it on its head. This story goes everywhere. I can honestly say I had no idea what was going to happen next. I was compelled to keep listening because I had to know what was going to happen. I couldn't believe what I was reading! I kept saying to myself \"Is this really happening?\" and \"Are they nuts?\" I was all over the place with my feelings. It really got in my head because I just couldn't stop thinking about it. When I started this book, I really didn't have time to read it so I listened in pieces and then had to start over, but when I re-started it again a few days ago, I got hooked and listened to it pretty much straight through and got to a point where I just couldn't listen to it in my car anymore. So I brought it inside and listened until very late into the evening to the very end and had everything figured out.The chapters switch voices between Ted and Lily at first and then some major twists and turns take place and in the following two parts of the book, Lily and two other voices take over in the telling of the story. I don't want to say whose voices take over because that may lead into spoiler land. It was very well written and the major characters; Ted, Lily, and Miranda; were very well developed and I felt like I knew everything about them and what made each of them tick. The storyline flowed well but like I said, there were a few times that it was literally flipped on it's head. However, the twists and turns didn't make the story confusing, it added more suspense. This was a pure thrill ride that got into your head like an earworm and made you keep thinking about it over and over until you just couldn't stop and you had to know what was happening and just finish the darn story.This was one of the most thrilling/suspenseful novels that I have read in awhile! And I read a lot of mysteries! For a mystery to get 5 stars from me it really has to stand out. The author, Peter Swanson, is literally killing it in this novel of psychological suspense! I highly recommend it to any fan of this genre. In fact it is up for a Goodreads Choice Award. Definitely 5 stars!! READ THIS BOOK!",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heather N Dean",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMVZ4UJ7HAD5CBI4HIKEAUOCSGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XGH7YTGCBPNX?ASIN=B084QBL1JY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "4.0 out of 5 stars my first read from Peter Swanson",
                "reviewText": "His imagery is so wonderful I really enjoy the way he writes. This book kept me wanting to read more. This book is unlike any others with things I have never read or seen in a movie happen. Pretty cool. Only thing I will say that didn’t make me give it 5 stars is the characters are all pretty unlikable terrible people lol",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura's Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZ7VUXZEQRQ7SZB4YC73IWMRUBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KL7RN5VIMB0V?ASIN=B084QBL1JY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Riveting Thriller!!",
                "reviewText": "I have been meaning to read The Kind Worth Killing for years and was glad to get to it this month as I got ready to read the new Peter Swanson book, The Kind Worth Saving. I read his novel Eight Perfect Murders in the past and really enjoyed it.Ted Severson is flying back to the United States from London when he meets the beautiful Lily Kintner on the plane. He finds himself opening up to her about his problems. His wife, Miranda, is cheating on him with the contractor that is building their new home. Ted says he would like to kill his wife, and Lily agrees that she would like to help. Will they go through with it?This starts the wild and crazy ride this book is. I did not guess the ending of this book and was completely surprised by it so I don’t want to ruin it for others. The first part of the book alternates chapters in the present with Ted and in the past with Lily to lead up to current events. The second part of the book brings in different narrators to complete the story. The Kind Worth Killing was a great suspense thriller that kept me up too late at night reading as I wanted to see what would happen next. The twists were great. I felt like just when I would think I knew where the story was heading a new twist would come in and change the direction of the story. The twists all made sense in the story. I loved it!The Kind Worth Killing reminded me of the classic Hitchcock movie Strangers on a Train (I still need to read the classic Patricia Highsmith novel). I love Hitchcock movies and would so love to see this book made into a movie.I really want to talk about the ending of this book with someone. It was open ended and has definitely kept me thinking about it.Favorite Quote:”Truthfully, I don’t think murder is necessarily as bad as people make it out to be. Everyone dies. What difference does it make if a few bad apples get pushed along a little sooner than God intended? And your wife, for example, seems like the kind worth killing.”Book Source: Purchased from Amazon.com",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 22, 2023",
                "reviewTitle": "Amazing story",
                "reviewText": "you won’t be disappointed with this one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TusharTushar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 30, 2023",
                "reviewTitle": "Great Novel",
                "reviewText": "Perfect Condition and Timely Delivery",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71UXQ8VyaOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ueVS54+8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71j3pmuXjzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dominik Ziller",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 7, 2023",
                "reviewTitle": "Zeug zum Klassiker",
                "reviewText": "Die Idee erinnert ein wenig an die Strangers on a Train von Patricia Highsmith. Die Fremde in der Businesslounge am Flughafen bietet dem Protagonisten an, seine ihn betrügende Frau zu töten. Danach nimmt die Geschichte aber deutlich mehr Fahrt auf als ein Highsmith-Buch. Zahllose Volten und unerwartete Wendungen. Swansons erster großer Erfolg, der irgendwann einmal als Klassiker gelten dürfte. Für Krimifans ein muss, das ist kreativ, temporeich, boshaft und sehr gut geschrieben.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alicia Q.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 6, 2023",
                "reviewTitle": "Great fun",
                "reviewText": "An easy and enjoyable read about twisted characters",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 30, 2017",
                "reviewTitle": "Excelente",
                "reviewText": "The kind worth killing definitivamente sobrepasa las cinco estrellas! Es una grata sorpresa encontrarse con un thriller contemporáneo que vale la pena leer. Lo recomiendo bastante!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}