{
    "remaining_requests": 1063,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Everyone-This-Train-Suspect-Novel/dp/B0CKWKC3DT",
    "body": {
        "name": "Everyone on This Train Is a Suspect: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Everyone-This-Train-Suspect-Novel/dp/B0CKWKC3DT",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41KJhgoktkL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Benjamin Stevenson",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Benjamin+Stevenson"
        },
        "brand": "Benjamin Stevenson",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 662,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the bestselling author of Everyone in My Family Has Killed Someone, a fiendishly fun locked room (train) murder mystery that \"offers a tip of the hat to the great Agatha Christie novel while at the same time being a modern reinvention of it\" (Nita Prose) -- perfect for fans of Richard Osman and Anthony HorowitzWhen the Australian Mystery Writers’ Society invited me to their crime-writing festival aboard the Ghan, the famous train between Darwin and Adelaide, I was hoping for some inspiration for my second book. Fiction, this time: I needed a break from real people killing each other. Obviously, that didn’t pan out.The program is a who’s who of crime writing royalty:the debut writer (me!)the forensic science writerthe blockbuster writerthe legal thriller writerthe literary writerthe psychological suspense writerBut when one of us is murdered, the remaining authors quickly turn into five detectives. Together, we should know how to solve a crime.Of course, we should also know how to commit one.How can you find a killer when all the suspects know how to get away with murder? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Humor & Satire",
                "link": "https://www.amazon.com/Comic-Literature-Fiction-Books/b?ie=UTF8&node=4465"
            },
            {
                "name": "Dark Humor",
                "link": "https://www.amazon.com/Dark-Humor/b?ie=UTF8&node=10159381011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "8 hours and 27 minutes"
            },
            {
                "name": "Author",
                "value": "Benjamin Stevenson"
            },
            {
                "name": "Narrator",
                "value": "Barton Welch, Megan Smart"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 30, 2024"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0CKWKC3DT"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#830 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3 in Dark Humor #3 in Dark Humor Literature & Fiction #34 in Crime Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Edward J. Cunningham",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6KJ6CIUG7OD4H2FCFGC6UDZ4NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WBGO2UKHILCJ?ASIN=B0CKWKC3DT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Another brilliant mystery solved by E. Cunningham!",
                "reviewText": "Seriously, Anthony Horowitz has competition. It's not easy writing these old school mysteries with lots of clues, revelations, and interesting suspects. I also see that in my near namesake, we have the potential for something that never really happened to Poirot, Ms. Marple, Ellery Queen, Nero Wolfe, or Archie Goodwin----character growth. I look forward to reading the next mystery with Ernie and Juliette.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "hanna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE73DPJBBKU3FGZXZ65YLL4RGY3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VWBX443GA9PH?ASIN=B0CKWKC3DT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars It's a great ride!",
                "reviewText": "Train travels are romantic. Sure, there are overcrowded trains people board through the open window, as there is no way to fight the crowds of passengers trying to enter using the doorway, and those can hardly be called \"romantic.\" But there are other trains, seen in luxury travel ads, with people sipping champagne and contemplating the beautiful landscape.Such a train is \"The Ghan,\" the Australian train that passes through the desert wilderness, traveling four days to Adelaide and offering unforgettable views. However, in \"Everyone On This Train Is A Suspect\" by Benjamin Stevenson, passengers experience something they wish to never encounter – a murder.Six writers are invited to participate in an unusual writers' conference on the train. Ernest Cunningham, who wrote just one book, \"Everyone in My Family Has Killed Someone\" (the first installment of the Ernest Cunningham series), has also been invited, or at least he thinks so, not suspecting other reasons for him being there. When the most obnoxious writer is murdered, other writers try to solve the puzzle before the train arrives at its destination. They all have good reasons and skills how to commit murder. Ernest turns out to be a great amateur detective, and, as the mystery is written as a personal narrative, we follow his adventures sprinkled with humorous commentaries and unexpected turns.I'm a big fan of such mysteries. Ernest's character is young, a bit goofy, but very observant and intelligent. Like other amateur detectives, he has a knack for getting into trouble. I wish the rest of the characters were better developed. Still, perhaps there needed to be more time to go into the secondary characters' depth: as I mentioned, there are six writers, a literary agent, a fan, and Ernest's girlfriend. Lots of characters! The novel is primarily action-driven, but eventually, we get the taste of psychological twists when we gradually learn more about the characters. The author references – often in a humorous way – the rules of a good mystery, especially the cozy kind, and we see how it was influenced by other \"train mysteries,\" especially Agatha Christie's \"Murder on the Orient Express.\" I hope it will be made into a movie, with all the visual advantages of pictures. It's a great ride!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shawna Losing For LifeShawna Losing For Life",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEOI5Z3DKB2R5KTJ3M5U4OSO7UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CG47M582U9LR?ASIN=B0CKWKC3DT",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "3.0 out of 5 stars Fun whodunnit but a LOT of characters to keep track of.",
                "reviewText": "Everyone on This Train Is a Suspect by Benjamin Stevenson⭐️⭐️⭐️💫 (3 1/2 stars out of 5)This book releases January 30! Thanks to netgalley I was able to take this Agatha Christie-like whodunnit mystery on vacation with me! I powered through the first book in this series on audio, but I enjoyed this ebook format much more!What I liked:•the narrator’s sense of humor and sarcasm. I definitely laughed out loud a few times. Murder, mystery and comedy?•the narrator hinted often at who the suspect(s?) might be. So gets you thinking.•the opening 1/3 and closing 1/3 of the book were the best parts for me and kept my attention.•the setting on The Ghan Train in Australia. Google it!What I didn’t like:•way too many characters for me to keep track of. I had to take notes and use the kindle lookup feature often.•I never really could guess who did it, because I didn’t really get to know all the characters well enough.•Again with this book much like his last, it was a novel about the process of writing a book, but the book was the story we were reading. Again…the broken 4th wall, and occasional “this isn’t fiction, it’s real life” comments rub me the wrong way.If you’re a fan of Agatha Christie or big cast mysteries, then read both this author’s books!Book 4 of 2024Read January 17-27",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Z-IpWUBkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Munno",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBI2YVQZWDAYZSQFV4L2P3IVDNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29EGJIDN5X27E?ASIN=B0CKWKC3DT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Very clever",
                "reviewText": "An amateur detective and professional writer solves murders Poirot-like. I liked this better than his last book.So many times, a book is great until the murderer is revealed and then it’s downhill. In this book, the motive isn’t an unbelievable stretch, and the book continues to entertain to the last page.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E.Snurd",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ26WGWJ3EOQ4KWSHG77HJAG4EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7VYB198ZHKOI?ASIN=B0CKWKC3DT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Fun Whodunnit - Mystery on an Australian Train!",
                "reviewText": "This is a fun book. I did not read the first book in the series, \"Everyone in my Family has Killed Someone:\" and I plan to. I have been an avid mystery reader from a very young age and think often about form and plot. So one engaging aspect of this book is Ernest Cunningham's checklist about what features in a fair mystery. Ernest has written one book (Everyone in my Family) but it was a true crime story. Here he is also present for one or more crimes when attending a writer's conference as a panelist/speaker. It is the fiftieth anniversary of the organization and so the conference is being held on a luxury old Australian train, the Ghan. Ernest's girlfriend, Juliette, also a writer, is with him. The other invited speakers range from a wildly famous Scottish mystery writer to, well, Ernest. He is supposed to be writing a novel but nothing at all has come to him. No plot, no paragraphs, no nothing. Just a checklist showing at what point in a mystery various things should have occurred.Thanks to enmity among some of the passengers with a history and the personality of some of the passengers there is unease, a bit of nastiness amongst those at the bar, and eventually a murder. Ernest recognizes fairly quickly that he has a potential book afoot and he starts doing his research, i.e., questioning people, looking about in places that may not be public and comparing notes with one of the other writers who is also hot on the trail. The book flows nicely. Nobody is particularly deep but the characters are amusing, the formula is followed, I probably missed a dozen hidden puzzles but the clues were also there. Yes. I missed some key ones and the red herrings worked on me this time. Definitely a recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ShazBoo BookOwl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 2, 2024",
                "reviewTitle": "Trains 🚂🚃 and Murder Mysteries",
                "reviewText": "You might think, it's all been done before, and I guess it has. But I'm loving Benjamin Stevenson's style of writing. He's right, a book is not a thing without both a writer and a reader, or hopefully loads of readers, you get my point. I really enjoy reading a book where the end result makes sense, and a reader should be given a fair chance to \"work it out\" for themselves. Another entertaining read, and I learnws a few things. Like, I've always taught the kids a \"Blurb\" let's you know what a book is about, I never knew that another author's review is also called a blurb. Am looking forward to Benjamin's next book. 😁",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meredith Whitford",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 11, 2024",
                "reviewTitle": "Well, the Ghan sounds fun.",
                "reviewText": "I was furious with myself for not getting a blindingly obvious anagram in this novel. I was being distracted by noise, but even so, damn. This is a funny book, sometimes genuinely witty, often clever, sometimes a bit too clever-clever and wordy. I love a good murder mystery, and I did my Master's thesis on \"Golden Age\" crime fiction, so I enjoy seeing the genre gently sent up, even if a bit over-explained. As a writer, yes, a published one (not self-published) with 2 awards, I also adore seeing the publishing world and a lot of writers/agents/ writing fashions/etc sent up too. All good clean sometimes laugh-aloud fun. But yes, a bit too wordy in places and the hero/detective/narrator is not as engaging as I would have liked. But worth 4 stars on the whole. (But if I may drop a hint to the author: stop your publisher copying Richard Osman's cover style.)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaitlyn Steinhardt",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 30, 2023",
                "reviewTitle": "Another Fantastic Book",
                "reviewText": "I first read Everyone in my family has killed someone and finished it within a few hours because of how gripping it was. B.Stevenson's next installment was just as gripping as his first and after diving into the story it only took another plane ride for me to get absolutely stuck in this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 22, 2023",
                "reviewTitle": "Mystery/Murder",
                "reviewText": "I did enjoy this novel, but I felt that'd it took time to actually delve into the murders. All in all, a good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}