{
    "remaining_requests": 1044,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tides-Fire-Novel-Sigma-Novels-ebook/dp/B0BFX4ZMP7",
    "body": {
        "name": "Tides of Fire: A Sigma Force Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tides-Fire-Novel-Sigma-Novels-ebook/dp/B0BFX4ZMP7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/819OEGKPaTL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "James Rollins",
            "link": "https://www.amazon.com/James-Rollins/e/B001H6U9DE/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3682,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BFX4ZMP7"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ William Morrow (August 15, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ August 15, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 15967 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 461 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0062893149"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,109 in Kindle Store (See Top 100 in Kindle Store) #39 in Suspense Action Fiction #77 in Mystery Action Fiction (Kindle Store) #87 in Historical Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,682 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Sandstorm Map of Bones Black Order Crucible The Last Odyssey Kingdom of Bones Sigma Force 1 Sigma Force 2 Sigma Force 3 Sigma Force 14 Sigma Force 15 Sigma Force 16",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d11087d1-d745-4d33-b93b-95995074b7bd.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/89dbfe2a-31ef-4ee7-ba33-4abe5b9f993b.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d567c162-f600-4677-8917-700f5bf811bf.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b3997bb5-cd77-44ba-b2ad-ab9c69c5d342.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/97acaef4-f1ea-4291-b84a-f9585402b263.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ae9994af-ff5b-4bea-9539-7c1f72a81746.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/47b9a468-472b-4e31-ba7a-fa3a3bd65d73.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/22a2e983-74ca-4e9d-97dd-a68359aa9eca.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/90d910e3-243a-4b61-b4e6-14de75afaaaa.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7bfd089d-969b-432e-9c60-85a5ad31ee25.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joseph Harris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKH6B2GKSERMBFVMLHKHWTNP57A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NBVRBXJ6VI9X?ASIN=B0BFX4ZMP7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars How does the author come up with these stories !!!!",
                "reviewText": "James Rollins delivers a tour de force in his latest addition in his acclaimed Sigma Force series and this times an old foe shows up, determined to get revenge, the world is on the brink yet again and Sigma Force is forced to join forces with an enemy that will kill any of them if it comes to it. With new faces and some very familiar faces joining the hunt into history and more, Sigma Force is on deck with action from start to end in TIDES OF FIRE. With every book in this series James Rollins creates, he ramps up the action, mystery and more within the pages. TIDES OF FIRE is definitely an edge of your seat ride from start to finish and I can honestly see how nerve wracking this book was. Every time I pick up this author’s books, I know I am in for a ride of my life as the reader is drawn into a historical mystery that threatens the modern/present day with a calamity of epic proportions. The twists alone had me gasping in disbelief and wonder as I kept flipping the pages as I read, eager to see what else this author maestro had in store for his readers.TIDES OF FIRE will keep the reader glued to the very end and I can attest that ending alone has me wondering just what is going to happen next for Sigma Force, Paint and the crew that helm it as this past enemy has them in its sight. This is a fast-paced story that delivered science in a way that I could understand, with mysteries of the deep sea as the center of it all. With each book, I feel this author just delivers more and more goodness to his readers because I don’t know where he gets his ideas, but TIDES OF FIRE deliver a walloping of a wild ride that left me eager to see what is next for this group as a whole doesn’t get old or stale. Each new book delivers something even more intriguing and entertaining to the series and to the main characters as a whole. I cant wait for the next Sigma book Arkangel to come out next year.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Eppenstein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJODPM5BCWZVNCV4PIIG7GDAAFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18CPJ89478PY1?ASIN=B0BFX4ZMP7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2023",
                "reviewTitle": "4.0 out of 5 stars More Excitement a reader could not ask for.",
                "reviewText": "Last year Rollins published <u>Kingdom of Bones</u> which I read and gave 4 stars to but a grudging 4 stars. I criticized the book for being exhausting and too much of a good thing. The actions scenes in the book were non-stop and over-the-top to the point of compromising the reader's ability to suspend belief properly due any work of fiction...up to a limit. Apparently Rollins didn't get the message or just differs in opinion on this issue because this book is no less exhausting than last year's addition to this series. Nevertheless I will still give it 4 stars as it is a page turner that will have the reader reading long passed their bedtime. Isn't that what a thriller is supposed to do? Of course the story will also tire the reader out which should result in a good night's sleep but after reading what happens in this book I doubt the reader will sleep well but for all the worry and wonder this book will cause. So what's the book about?To begin with the reader will be exposed to a lot of information on geology, biology, oceanography, deep sea exploration and the associated vehicles for that activity, as well as the history and culture of Western Pacific native peoples and I've probably forgotten about some of the other covered subjects. Let's just say there's a lot packed into this story so you will be learning as well as be entertained. Basically, the area in the Southwest Pacific in the Indonesia area becomes geologically unstable and its numerous volcanoes begin to erupt. The cause of the instability may have something to do with the Chinese who become very interested in what is happening for reasons known and unknown. A multi-billionaire and his enormous and fully equipped research vessel and its related components is in the area and pressed into service as are some of the Sigma Force who happen to be in Hong Kong for a birthday party and family gathering for Seichen and her mother. The story is non-stop excitement with catastrophe on top of catastrophe complicated by shoot-outs with mercenaries and Chinese military and did I mention the intelligent but deadly coral? It's a fun read but HEY JIM some of your readers (ME) are elderly. We like a good book but there is a limit to how much excitement we can handle in one sitting. Please dial the excitement level down before one of your books gives me a heart attack and my wife sues you. Ha, you laugh but she is will. LOL. Enjoy the book.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 7, 2023",
                "reviewTitle": "Rollins at his best",
                "reviewText": "Wow Rollins does it again! Lots of well thought out action scene's plus a great dose of scientific possibilities which considenring the climate changing environmental storms occurring now makes one think about what may down the road. Money well invested",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lgb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 6, 2023",
                "reviewTitle": "love these books!",
                "reviewText": "As always, the book ends too fast and I am eagerly waiting for the next one. This Sigma Force series is the best!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arkesh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 2, 2023",
                "reviewTitle": "History+mystery+science+adventure+action. Can anyone ask for more?",
                "reviewText": "It is not only the way the author spins the storyline that is captivating to the reader, but the amount of research being done to bring out certain facts Or history of our mother earth which a normal person would not have known. Love the author! Can't wait for the next book!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arno Gündisch",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 6, 2023",
                "reviewTitle": "Apokalypse und kein Ende",
                "reviewText": "James Rollins ist für seine Over the Top-Art bekannt. Mit jedem Sigma-Roman wird die Welt aufs Neue gerettet, so dass wir alle ungestört seinem nächsten Thriller entgegenfiebern können. Was er sich aber hier leistet, sprengt alle Grenzen. Im australisch-indonesischem Raum jagt ein Erdbeben das nächste, ausserdem spielen die Korallen verrückt. Menschen werden mit einem unbekannten Gift infiziert, das sie buchstäblich versteinern läßt. Gibt es einen Zusammenhang zwischen den beiden Phänomenen? Commander Grayson Pierce ist sich da absolut sicher. Die Antwort liegt für ihn in der prähistorischen und geologischen Geschichte der Region verborgen. Leider sind auch andere an den ungewöhnlichen Vorkommnissen interessiert-man könnte daraus ja eine Waffe basteln. Und ein alter Feind von Sigma mischt wieder an vorderster Front mit.Als dann auch noch Vulkane in Serie ausbrechen und die Zukunft ganz Südostasiens und auch der Welt auf dem Spiel steht, muss Sigma aufs Ganze gehen und sich dorthin begeben, wo noch kein Mensch sich hintraute..Matthew Reilly und Clive Cussler standen bei der Entstehung dieses Thrillers sicherlich Pate. Leider ist der Grat zwischen Cliffhanger-Sequenzen, wissenschaftlichem Exkurs und lächerlich wirkenden Lösungsansätzen streckenweise recht schmal. Das überraschende Finale eröffnet uns einen Ausblick auf die \"Mutter aller Sigma-Thriller\", die vom Autor am Ende des Buches angekündigt wird. Da sind wir aber gespannt..drei Sterne wären hier adäquat gewesen, da der Thriller jedoch keine Langeweile beim Lesen aufkommen läßt, gebe ich gerne einen Stern aus Vulkanasche dazu.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pete Barlow",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 25, 2023",
                "reviewTitle": "Rollins block busters!",
                "reviewText": "Eagerly awaited and not to disappoint James has crafted another of his masterpieces. Only downside to his creations is the agonising wait for the next one. Jim - as i said way back when you answered my email - you are a true master and can’t wait for you work to hit the big screen.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}