{
    "remaining_requests": 1244,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/No-Strangers-Here-Riveting-Mystery/dp/1496737539",
    "body": {
        "name": "No Strangers Here: A Riveting Irish Thriller (A County Kerry Novel)",
        "price": "$10.89$10.89",
        "originalPrice": "",
        "rawPrice": 10.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/No-Strangers-Here-Riveting-Mystery/dp/1496737539",
        "soldBy": {
            "sellerID": "A2XF5HY28Z1YOG",
            "name": "Goodwill of Colorado",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2XF5HY28Z1YOG&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91RfqnfA5hL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Carlene O'Connor",
            "link": "https://www.amazon.com/Carlene-OConnor/e/B01BJ1KOFY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Goodwill of Colorado",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2052,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for No Strangers Here\"This solid series launch from O'Connor takes a more somber approach to crime solving than her Irish Village mysteries...O'Connor adds plot twists that many won't anticipate. Judicious use of Irishisms (\"I swear to ye\") adds color. Readers will eagerly await what happens next in County Kerry.\" --Publishers Weekly \"Exciting, convoluted, and rich with compelling characters, this is the best of O'Connor's Irish mysteries to date.\" --Kirkus Reviews STARRED REVIEW \"Known for her cozies, O'Connor moves into darker territory here. For fans of Louise Penny.\" --Library JournalPraise for Carlene O'Connor\"Outstanding...O'Connor reinforces her place as the queen of the cozy police procedural.\" --Publishers Weekly STARRED REVIEW for Murder in An Irish Bookshop\"Murder at an Irish Christmas has elements of a police procedural that add more detail, atmosphere, and humor than are often found in the cozy subgenre.\" --Christian Science Monitor on Murder at An Irish Christmas\"Fully realized characters enhance this skillfully plotted tale as it builds to a twist ending.\" --Publishers Weekly on Murder at An Irish Christmas\"Exceptional... readers will have a hard time putting this one down.\" --Publishers Weekly STARRED REVIEW for Murder in An Irish Cottage\"[An] atmospheric story filled with Irish superstitions, legends, and colorful characters. Vivid descriptions of the countryside will appeal to lovers of Ireland.\" --Library Journal on Murder in An Irish Cottage\"The intricate puzzle and continuing Irish atmosphere make this the series' best to date.\" --Kirkus Reviews on Murder in An Irish Pub\"A delightful read that put me right into the atmosphere and locale.\" --Criminal Element on Murder in An Irish Pub\"Carlene O'Connor is a wonderful storyteller.\" --Newport Plain Talk on Murder in An Irish Pub About the Author Carlene O’Connor is the USA Today bestselling author of the acclaimed Irish Village Mysteries, the County Kerry Novels, and the Home to Ireland Mysteries. Born into a long line of Irish storytellers, her great-grandmother emigrated from Ireland filled with tales in 1897 and the stories have been flowing ever since. Of all the places she’s wandered across the pond, she fell most in love with a walled town in County Limerick and was inspired to create the town of Kilbane, County Cork, the setting of her Irish Village Mystery series. She is a member of Mystery Writers of America and Sisters in Crime, and currently divides her time between New Mexico and the Emerald Isle. Please visit her online at CarleneOConnor.net."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 15 hrs 31 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 9 hrs 16 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Readers of Tana French, Lucy Foley, and Dervla McTiernan will be spellbound by the USA Today bestselling author’s unsettling, atmospheric suspense novel set in Ireland’s rugged countryside. Combining an eerie and atmospheric backdrop with compulsively taut plotting, a twisty mystery unfolds as an Irish veterinarian contends with life, death, and the fatal secrets at the heart of her small oceanside community... BookBub Best Mysteries and Thrillers of FallOn a rocky beach in the southwest of Ireland, the body of a wealthy racehorse owner Johnny O’Reilly has been discovered. In a town like Dingle, everyone knows a little something about everyone else. But dig a bit deeper, and there’s always much more to find. And when Detective Inspector Cormac O'Brien is dispatched out of Killarney to lead the murder inquiry, he's determined to unearth every last buried secret.Dimpna Wilde hasn’t been home in years. But faced with a triple bombshell—her mother is rumored to have been in a relationship with Johnny, her father’s dementia is escalating, and her brother is avoiding her calls—Dimpna moves back to Dingle to clear her family of suspicion. And as she takes over the family practice, she finds herself in a race with the detective inspector to uncover the dark, twisting truth behind murder, no matter how close to home it strikes...“Compelling... this is the best of O’Connor’s Irish mysteries to date.”—Kirkus STARRED REVIEW",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Kensington; Reissue edition (August 29, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1496737539"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1496737533"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.48 x 1.01 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,479 in Books (See Top 100 in Books) #138 in International Mystery & Crime (Books) #645 in Murder Thrillers #810 in Police Procedurals (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,052 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Avonna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLBJFLJSM4DQN2CIXQYO3VYJMQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SEK24VRB8NGE?ASIN=1496737539",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Highly Recommend!",
                "reviewText": "NO STRANGERS HERE (County Kerry Mystery Book #1) by Carlene O’Connor is an intricately plotted and captivating murder mystery/police procedural set in County Kerry, Ireland. This is the first book in a new series from a new-to-me author that kept me completely immersed in the story.Detective Inspector Cormac O’Brien is dispatched from Killarney to head the murder investigation of a prominent and wealthy landowner, Jimmy O’Reilly. In Dingle, everyone knows something about everyone and there are secrets that have been kept for decades. DI O’Brien is determined to unearth all of them to catch a murderer.Veterinarian Dimpna Wilde has lost everything she built in Dublin through no fault of her own. Even though she has not been home to Dingle in decades, she returns home to decide what she will do with her life now. She is shocked when she returns to find her family are the prime suspects in the O’Reilly murder. Dimpna is determined to clear her family members, but her return is digging up secrets from her own past and the terrible secrets that made her leave Dingle. Besides dealing with old friends and enemies, she has a very astute DI uncovering dark secrets right along with her.This is a fantastic murder mystery story with realistic characters, a twisted plot with not only a murder, but also decades of secrets filled with lies, theft, extortion, greed and sexual assault all set in the scenic and beautiful coastal tourist town of Dingle in Ireland. Ms. O’Connor brought it all to life for me while I was also trying to uncover the clues to a murderer. The plot weaves effortlessly between the present and Dimpna’s revelations throughout the story of her past and her present with plenty of plot twists and red herrings that continually had me guessing. I am anxiously looking forward to the next book in this series to see how all the characters land and go forward since the resolution of this murder case.I highly recommend this exceptional murder mystery/police procedural set in Ireland and I am very glad it is going to be a series!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colorado Cowgirl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5T2AGLL72DAN5KZF5FMOFUYGAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LM673QMS3OCE?ASIN=1496737539",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "4.0 out of 5 stars Mixed feelings",
                "reviewText": "I have enjoyed the Constable Siobhan series of cozy mysteries by Carlene, even though I don't prefer cozies. The new series of more intense and serious mysteries is very different. I have mixed feelings about this book and it is a bit of a mess. It starts with a murder but the first half of the book puts the murder on the back burner and focuses on the veterinarians and their family and friends, who have tangled relationships. These characters are good and well fleshed-out but I found myself wanting to get on with the murder investigation which was rather weak. The character of DI Cormac was not very well developed and he remains a mystery. There were lots of suspects and many links to past events here. There was a rich family that you will love to hate. I am not sure whether I will continue with this series",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BobJac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF46TULLJIRIMWUYKYJU4MDKHASQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN62DH7SVTHWD?ASIN=1496737539",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Intriguing",
                "reviewText": "Carlene O’Connor is in the top 5 of my list of favorite authors. She knows how to put nice twists in her books, giving leading and misleading hints along the way. She also makes me want to travel to Ireland to visit the locations of her novels.Dingle in Country Kerry appears to be a beautiful town on the Atlantic that is attractive to locals and tourists alike. It isn’t a town where you would expect the super rich and powerful local racehorse owner, Johnny O’Reilly, to be murdered.Local vet Eamon Wilde is the main suspect because the cause of death appeared to be a poison used by vets. What was his motive? And Eamon Wilde was suffering from early dementia. His daughter Dimpna was raped by Sean O’Reilly, Johnny’s son. She had a son, Ben, as a result of the rape.Dimpna had left Dingle 27 years ago to become a vet in Dublin, and had married Niall. She had never been back to Dingle. Ben was totally unaware that he was really Sean O’Reilly’s son. Dimpna’s father’s predicament brought her back to Dingle. Was Eamon in a right mind to kill Johnny? And why wait 27 years?Confused? I’m sure you will enjoy how the author takes the reader down various paths to solve the murder.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH45DZIXASISSPBOA2T2IERU7OQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAY2BTXO2VSQB?ASIN=1496737539",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "4.0 out of 5 stars great mystery",
                "reviewText": "The book kept me up reading late at night. I just couldn’t figure out who did what there was so much going on.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathleen Shannon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYQP34WCN2L7ZPODP4J4LAOV4ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CUGJ9Q4JVFD0?ASIN=1496737539",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Cozy or not?",
                "reviewText": "Did I just finish a cozy mystery? Is that what books like this are called? Well then I’m hooked! I loved it! The book first intrigued me because of the location. I’ve never been to Ireland so I imagined a nice escape. I couldn’t put this book down! I love the diversity of the characters. There were so many real life situations. Dysfunctional families, heart breaking dementia and ALS, along with friends that just do dumb things. It’s a very relatable story and quickly paced. Maybe someday I’ll be able to actually visit the Dingle peninsula.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mimi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHATSJTOZ6R5LPFXKBPU5JRR2A2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UI244H2QXOKU?ASIN=1496737539",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "3.0 out of 5 stars Wowza!",
                "reviewText": "Excellent writing and keeps you guessing until the end! Enjoyed having a little background of several characters, not just the main ones.4 stars but too many f-bombs.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "linda M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQIALMDCDEKVGCKFDRWNHAPDOAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R368QS1XQ62SJ3?ASIN=1496737539",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars kept me guessing",
                "reviewText": "A good page turner full of who done its. Not just one murder to solve but several . Well written, fun characters and you gotta love the Irish.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gwenn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBCKTHWIMJQMLHS2AXMZJAFIQRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10VNB6IB95OEP?ASIN=1496737539",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "4.0 out of 5 stars What a tangled web",
                "reviewText": "This one kept me guessing till the end. Good strong characters the supported a good story. I enjoyed the mystery of it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 2, 2024",
                "reviewTitle": "Horribly American, in spite of token Irishness",
                "reviewText": "Review: No Strangers HereIntriguing and imaginative plot, well told but this reader was seriously irritated and disappointed by two issues to do with the writing:1. The story could have been set anywhere. Attempts to set it in Dingle were contrived and tokenistic. A casual cruise past a few items from the local tourist brochure does not capture a sense of place and authenticity. This is just lazy writing and, in choosing this book, I expected better.2. The unrelenting American spelling and language were jarring and a real turn-off. These are Irish people, speaking to each other, in Ireland. They do not say – just two examples – “the dog had not been to the bathroom” or “she pressed the gas pedal”!I will not be reading any more of this author’s series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edward Elly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 7, 2023",
                "reviewTitle": "An ex Pat view",
                "reviewText": "Fine writing style with lots of Irish background and norms. Strategically designed plot which keeps the reader turning pages.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}