{
    "remaining_requests": 33593,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/PowerXL-SmartSynx-Different-Functions-including/dp/B0CQMHBTG5",
    "body": {
        "name": "PowerXL SmartSynx Dual Door Air Fryer Oven, Cook Different Food at the Same Time, 10 Cooking Functions including Bake, Broil, Toast, Roast & More, Great for Family Meals, Stainless Steel",
        "price": "$194.33",
        "originalPrice": "",
        "rawPrice": 194.33,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/PowerXL-SmartSynx-Different-Functions-including/dp/B0CQMHBTG5",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31JCf2AfEEL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the PowerXL Store",
            "link": "https://www.amazon.com/stores/PowerXL/page/8427F195-EB67-460F-86CB-CAB6577264CC?ref_=ast_bln"
        },
        "brand": "PowerXL",
        "merchantInfo": "",
        "customerReview": "3.4 out of 5 stars",
        "customerReviewCount": 11,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 1 hr 24 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "PowerXL SmartSynx Dual Door Air Fryer Oven boasts three upper oven rack locations with ten functions, and two lower oven rack locations with seven functions. Perfect your baking, air frying, and more with precision!",
            "Effortlessly navigate cooking with the intuitive Control Knob, Start/Stop Buttons, and SmartSynx feature. Display cooking time and temperature for precise results, and enjoy the synergy of upper and lower ovens working seamlessly together.",
            "Indulge in exclusive functions like Grill, Toast, and Pizza in the Upper Oven for perfect crusts and succulent results. Unlock a world of culinary possibilities with an array of cooking options right at your fingertips",
            "Elevate your cooking experience with the SmartSynx feature, allowing you to finish cooking in both ovens simultaneously. Ideal for multitasking chefs, it ensures no compromise on taste or texture. Efficiency meets gourmet perfection!",
            "Elevate your culinary prowess with the PowerXL SmartSynx Dual Door Air Fryer Oven. Unleash the perfect balance of convenience and gourmet results, transforming every meal into a masterpiece of flavor and innovation."
        ],
        "description": "Introducing the PowerXL SmartSynx Dual Door Air Fryer Oven, a culinary powerhouse designed to redefine your cooking experience. With three rack locations and ten functions in the upper oven, and two rack locations with seven functions in the lower oven, this appliance opens up a world of possibilities for perfecting your favorite dishes. Whether you're baking desserts, pastries, and pizza or air frying crispy delights, the upper oven is your go-to chamber. The lower oven, equipped with functions like broil, roast, and warm, excels in cooking sides while your main course takes center stage. The SmartSynx feature allows you to finish cooking in both ovens simultaneously, providing unparalleled convenience for multitasking chefs. Explore exclusive functions in the Upper Oven, such as Grill, Toast, and Pizza, delivering gourmet results with a golden crust and juicy texture. Effortlessly navigate through cooking settings with the Control Knob, Start/Stop Buttons, and oven-specific buttons, while the Time and Temperature Display ensures precision in every dish. The SmartSynx Button guarantees synchronized cooking in both ovens, offering a time-saving solution without compromising on flavor. The PowerXL SmartSynx Dual Door Air Fryer Oven is not just an appliance; it's a culinary companion, striking the perfect balance between convenience and gourmet excellence. Elevate your cooking and make every meal a masterpiece with this innovative kitchen essential.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "PowerXL"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "16.09\"D x 18.54\"W x 12.38\"H"
            },
            {
                "name": "Special Feature",
                "value": "Dual Zone Features"
            },
            {
                "name": "Control Type",
                "value": "Touch Control"
            },
            {
                "name": "Door Style",
                "value": "Side Swing"
            },
            {
                "name": "Included Components",
                "value": "Oven Rack"
            },
            {
                "name": "Model Name",
                "value": "SmartSynx"
            },
            {
                "name": "Door Material Type",
                "value": "Stainless Steel"
            },
            {
                "name": "Power Source",
                "value": "Electric"
            },
            {
                "name": "Manufacture Year",
                "value": "2023"
            },
            {
                "name": "Item Weight",
                "value": "27.4 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "PowerXL"
            },
            {
                "name": "ASIN",
                "value": "B0CQMHBTG5"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "TO67D5-6SPTV"
            },
            {
                "name": "Customer Reviews",
                "value": "3.4 3.4 out of 5 stars 11 ratings 3.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#567,249 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #1,620 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "December 19, 2023"
            },
            {
                "name": "Capacity 2 Quarts",
                "value": "Wattage 1750"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Finish Type Painted"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "zanypoetzanypoet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLRM6N2TGMLDUQHBYMOTR2VXEIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FZB9W6H3TZFH?ASIN=B0CQMHBTG5",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "3.0 out of 5 stars PowerXL SmartSynx Dual Door Air Fryer Oven ....",
                "reviewText": "Dual temperature air fryer oven in one appliance is a neat concept but I have issues with this oven design.The upper oven is slightly bigger than the bottom oven but it is still too small for its overall size.What they should have done is to make the upper oven bigger and make the lower oven smaller.It would eliminate some of the current problems with this set up.On the upper part, the heating elements are infrared quartz elements while the bottom is moreconventional steel element. Upper part has heating elements on top and bottom of the oven,similar to a regular oven, while the bottom part has the heating element only on the top like mostbasket type air fryers. The main problem with this air fryer is that on the upper oven, no matter whatsetting is chosen, both upper and lower elements get turned on. And because the space inside the ovenis fairly confined, the heating elements can be too close to food being heated. In a regular oven, whenbake setting is selected, only the lower heating element is turned on. You would not want the broilerelement to turn on while baking or else your cake would be toast. In its defense, with includedseparate grill plate, this does a better job of broiling meats than other air fryer designs as long as it is nota big roast or a whole chicken. As for baking anything, forget about it with this device since upperheating element cannot be turned off. For most smaller amounts of food, this will do a decent job inboth upper and lower ovens. Also, the top of the oven gets very hot when the upper oven is used.Therefore, you would not want to set anything on the top in general, unless you want to use it as awarming plate.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Wkrzlb22L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7106IkeX-6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719gLmxJ-HL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71JF3VuOa-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Pcsj8BJjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Vx0WidrUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81ujb5AxYIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patrick CalderazPatrick Calderaz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3ZH4JOXZRVU2ID2YW2VFQYDN6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27TS8FEB103KL?ASIN=B0CQMHBTG5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Really nice Air Fryer Oven that Does A lot",
                "reviewText": "WHAT’S INCLUDED:-PowerXL Air fryer Oven-User Manual-2 Crisper Trays-1 Grilling Tray That doubles as a Pizza Stone-Oven Rack-2 Drip Pans-Cooking Sheet/Baking PanPRODUCT/THOUGHTS:So, something to understand with this is since it's a dual setup and it's not a super large unit, you do have some cutbacks. Each chamber isn’t massively huge. It's not going to be the same size as a large toaster oven for example. You CAN get those units if you want, that are large enough to do a small game hen..etc but this is not one of those.However, if you are coming from a regular-size toaster oven like I was, this is an excellent upgrade and this is probably more for you. You can do all the things you were doing with your toaster oven (providing it was a regular-sized unit), plus WAY more now, and it’ll cook your food much more evenly.Even things like toasted bread products will cook SO much better in this vs a regular toaster oven because it uses both the heating elements and the heated air to circulate that around your food from what I understand. I might be wrong about that, but either way, the results are way better than anything I had before and I could hear the fans running even when I did just toasted items.I love that it has 2 chambers so you can put a small pizza in the top one and something else in the bottom for example. Different foods and trays are used in specific upper or lower ovens. The grilling plate for example you use in the upper only. So just pay attention to the manual that way you cook the right food you want in the right oven. You get all the features you see in the images. Baking, Airfrying, Broiling, Reheating, Grilling, Roasting, Warming. Toast and Pizza have their own dedicated buttons.When you do something like toast, you will see a number option from 1-7. That means the “Shade” or darkness of the toast. You can use your temps on baking and other things all the way up to 475 If I remember correctly. That's pretty cool in my opinion.Is this the largest airfryer you can get? No, but does it have 2 ovens you can use and sync at the same time? It sure does. Can you still do a lot of different kinds of cooking in this? You sure can. My opinion is, if you are coming from a toaster oven, then this is for you. If you are someone that is serious about cooking then you’ll probably want to explore other options so you have a bigger unit, or maybe just 1 oven instead of 2 so you can maximize the size, but I think for MOST people this will work very well for them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51AYGt+uwqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randy DAmore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFW4Q2NNNQDFJIHXNKKMMTYBLGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CWWYMFWLLXZB?ASIN=B0CQMHBTG5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Larger than a typical toaster oven but also has a lot more features.",
                "reviewText": "This is larger than a toaster oven, but not large enough to replace your standard oven. If you have the counter space and are looking for something like that, this works well. The top oven is where you will do most of your baking. The lower oven does work very similar to the top oven, but less space. So the lower oven will be for items that have a low profile but you don't have time to wait for the top oven to finish baking.Because there are two ovens, and this is a countertop oven, the upper oven does not have a lot of room. It takes a little experimenting to avoid burning what you're cooking. The oven does get hot on the outside. The manufacturer recommends you use protection under it if your countertop cannot handle high heat. That means get a heat-resistant silicon mat, or maybe find a rack to raise it for better circulation under the oven. IT would be nice if the manufacturer included that mat. I have it on a Formica countertop and that did get pretty warm. Not enough to burn the formica, but maybe if you are using the lower oven with the highest heat (450#) for a long period, it might. I put a mat under it so I don't need to even think about that.The handles seem to get hotter than I anticipated so use your oven mitts. It might be I had both ovens working at the same time. Considering how many features they have going on in such a compact space, be aware of what you are working with. If you are just making toast or heating leftovers there wouldn't be much concern.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zack",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKGWATRNGKEENALBIIS5L37HUAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TB5QWNO6EWBN?ASIN=B0CQMHBTG5",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "1.0 out of 5 stars Poor performance",
                "reviewText": "Regrettably, this unit falls short of expectations. The temperature accuracy is noticeably distant from the desired levels, and the overall build quality pales in comparison to similar models, exhibiting signs of previous use. The unit's overall quality is insufficient to warrant a detailed discussion about its capabilities as an oven.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}