{
    "remaining_requests": 33795,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GoWISE-USA-14-7-Quart-Rotisserie-Accessories/dp/B084HMJJ3B",
    "body": {
        "name": "GoWISE USA 14.7-Quart Air Fryer Grill with Dual Heating Elements & Oven with Rotisserie, Dehydrator, Preheat and Broil Functions + 11 Accessories with 2 Recipe Books (Stainless Steel/Black), Ultimate",
        "price": "$131.74",
        "originalPrice": "",
        "rawPrice": 131.74,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GoWISE-USA-14-7-Quart-Rotisserie-Accessories/dp/B084HMJJ3B",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07YVYRT2K"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41y-gNDbTnL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black/Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ce7OOdcCL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/119HPzAB8PL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51atzmAYq-L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/11clX42B0dL._SS36_.jpg"
            },
            {
                "asin": "B084HMJJ3B",
                "variationName": "Color",
                "variationValue": "Stainless Steel",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41xzO3D9MhL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "84",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51WOazKQyXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Eu9NSMfEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gTFpCdrvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JUjnaWJrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JcVGbB3QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5102DxkW7oL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/614K71dnJxL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the GoWISE USA Store",
            "link": "https://www.amazon.com/stores/GoWISEUSA/page/E12522BC-145B-4AEF-AB11-A0CAFA309C2E?ref_=ast_bln"
        },
        "brand": "GoWISEUSA",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 11463,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 2 hrs 58 mins",
            "FREE delivery Monday, February 19. Order within 2 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Why settle for 1 when you can have 2. The GoWISE ultimate air fryer grill is built with dual heating elements designed to heat faster, evenly and cut your cooking time. It combines the design of an oven with air fryer technology to give you everything you need in the kitchen. Take full control of heating with manual mode that allows you to choose between bottom, top or dual heating. With dual heating and rapid air technology, this air fryer allows you to air fry, grill, sear, dehydrate, roast, toast, bake, and more in one appliance.",
            "This air fryer comes with a heavy duty cast aluminum nonstick grill plate featured with one-of-a-kind design to sit right on top of the bottom heating element for faster and even heating, so you can bring the grilling indoors any day of the week. Its nonstick surface makes cleaning up easy and gets rid of the elbow work needed to scrub and scrap residue from a regular outdoor grill.",
            "The ultimate air fryer grill’s cooking interior and exterior are built with stainless steel designed to heat up quickly and withstand high cooking temperatures up to 450°F, so you can sit at dinner table faster. Designed to take a permanent spot on your countertop, it features a glass touch control panel and white lit display to look sophisticated and match any kitchen.",
            "Check for doneness easily with the interior oven light and the see-through glass door. The heavy-duty glass door is designed with safety hinges designed to allow the user to open the door at 2 levels.",
            "At GoWISE, we believe that less is more, the Ultimate Air fryer grill comes with the grill plate and 10 extra accessories, so you can do more with one appliance. It comes with stainless steel silicone-tipped tongs, 2 mesh racks, shallow mesh basket, rotisserie rod and forks, rotisserie cage, rotisserie skewers, and a drip pan. It also features 11 presets, such as grill, broil, fries, chicken, pizza and more along 3 cooking functions, rotisserie, keep warm, and preheat.",
            "The new preheat function heats the air fryer grill to the optimal temperature for a desired setting and lets you know when its time to put your food in. It is also designed to go into standby mode as a safety feature if you forget to put your food in.",
            "Dehydrate too. The ultimate air fryer grill comes with a dehydrating preset with a temperature range between 90°F to 130°F and up to 8 hours cooking time, so you can make jerky, fruit leather, dried herbs or tasty treats for your furry friends",
            "The Ultimate air fryer grill comes with not 1, but 2 recipe books to get you started on exploring all that your new kitchen gadget has to offer. Choose from a variety of meals to make for breakfast, lunch, dinner, or dessert or get started on dehydrating with 20 step by step recipes and a guide on how to dehydrate. Need more inspiration. GoWISE is constantly sharing new video recipes, blogs and seasonal recipe books. We also have a whole community of influencers and everyday users sharing their recipes in social media",
            "All GoWISE USA products come with a 30-day money back guarantee, 1-year warranty and forever support from GoWISE customer care. Registered products receive an additional warranty coverage within 14 days of purchase.",
            "Outer dimensions: 15” H x 13” W x 12.5” D; Inner dimensions: 8” H x 10.25” W x 9.75” D; 1700 Watts; Temperature range: 120°F to 450°F; Timer: 60 minutes; Top, bottom, and dual heating; ETL listed"
        ],
        "description": "Introducing the 14. 7 Quart Ultimate Air Fryer Oven Grill. It was designed with a high-quality stainless steel interior AND body and comes with 11 accessories to maximize your cooking potential. Air Fry, roast, rotisserie, bake, dehydrate, and even grill! Enjoy new dual heating elements, cutting your cook time heating from all sides. Use the included heavy-duty cast aluminum grill plate to grill meats and veggies to perfection from the comfort of your kitchen.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Product Dimensions",
                "value": "12.75\"D x 13\"W x 14\"H"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Capacity",
                "value": "14.7 Quarts"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Roast, Broil, Bake, Dehydrate"
            },
            {
                "name": "Output Wattage",
                "value": "1700 Watts"
            },
            {
                "name": "Item Weight",
                "value": "28.5 pounds"
            },
            {
                "name": "Brand",
                "value": "GoWISE USA"
            },
            {
                "name": "Wattage",
                "value": "1700"
            },
            {
                "name": "Voltage",
                "value": "110 Volts"
            },
            {
                "name": "Model Name",
                "value": "Ultimate"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Min Temperature Setting",
                "value": "90 Degrees Fahrenheit"
            },
            {
                "name": "Controller Type",
                "value": "Touch control"
            },
            {
                "name": "Max Temperature Setting",
                "value": "450 Degrees Fahrenheit"
            },
            {
                "name": "Manufacturer",
                "value": "GoWISE USA"
            },
            {
                "name": "ASIN",
                "value": "B084HMJJ3B"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "GW44805"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 11,463 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,377 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #83 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "February 5, 2020"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Air Fryer Oven, Vibe Air Fryer Oven Deluxe Air Fryer Oven Ultra Air Fryer Oven Grill, Ultimate Air Fryer Dehydrator Mojave Capacity 11.6-Quart 12.7-Quart 12.7-Quart 14.7-Quart 17-Quart Timer 60 Minutes 60 Minutes 60 Minutes 60 Minutes 60 Minutes Temperature Range 90°F - 400°F 120°F - 430°F 120°F - 430°F 120°F - 450°F 90°F - 400°F Presets 8 15 11 11 8 Dehydrate ✓ ✓ ✓ ✓ ✓ Rotisserie ✓ ✓ ✓ ✓ ✓ Interior Metal Stainless Steel Stainless Steel Stainless Steel Metal Included 3 mesh trays, rotisserie rod & forks, rotisserie cage, skewer rotisserie, drip pan, rotisserie tongs and Recipe Book Includes a rotisserie tong, rotisserie rod, oven rack, drip pan, skewer rotisserie, rotisserie Cage, rotisserie steak Cage, shallow mesh basket, two mesh trays, and Recipe Book Includes a rotisserie tong, rotisserie rod, drip pan, skewer rotisserie, rotisserie cage, 2 mesh trays, 1 shallow mesh basket, 2 oven racks, mini silicone mitts and recipe book. Includes the grill plate, 2 mesh racks, a shallow mesh basket, rotisserie rod and forks, rotisserie cage, rotisserie skewers, tongs, a drip pan, and 2 recipe books. Includes 5 dehydrator racks, a shallow mesh basket, rotisserie rod and forks, rotisserie cage, rotisserie skewers, tongs, a drip pan, and 2 recipe books Watts 1700 1600 1600 1700 1800",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/e09a0a4b-9e18-4e57-9645-05fb4d4e253f.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/87b62a23-eba1-49a3-84be-0e49554faa76.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e1c066c2-4a60-47ed-99b3-9a92e3a4570c.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9ede06ac-058e-42b3-a9e7-cb79c25be752.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3e0d1333-d8eb-412c-9011-b2d4298a0561.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c6276a24-6d9d-4bd7-9f3e-4508c1d3160f.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/30dcbc1f-d41b-4fae-8670-d990fa7c7593.__CR0,0,625,1250_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/676430fc-41d4-4664-a3d9-5a732ad17f85.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f4c2afc0-f2b3-4b96-9c47-09fdc8bfb54d.__CR0,0,313,625_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Hula",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOJGPSP3SAOBZIHHGDMF6DSNXWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36LC6R2TMKPY3?ASIN=B084HMJJ3B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Absolutely great!",
                "reviewText": "One week ago, I bought another brand of air fryer. Everything seemed perfect about it when it arrived but the second time I used it it had an electrical shortage and was dead. I was so disappointed after doing all the research.!!! my sister and I bought the same air fryer and she ended up returning hers too afraid that it would have an electrical short like mine. When the gowise arrived, the delivery person left it on the stairs 2/3 of the way from the front door. The box and unit weighed 32 pounds. It was a challenge to roll that box up the stairs, but I was determined because I had no choice -the other air fryer was so light, I could carry it up the stairs in the box by myself. So I approached this air fryer with much trepidation I like the gowise brand. I'm actually replacing a Gowise air fryer that I really loved for three years. When I finally had the energy to unbox the air fryer and install it I felt hopeful. First it's a solid machine well-made and impressive. It comes with a generous amount of accessories. I've read reviews criticizing the beeping and it's true. There is a lot of beeping when selecting the correct time and temperature. A knob to control the digital temperature and timer would be an improvement. Other than that it's a spectacular machine. I was surprised to find that the first thing that we fell in love with was lightly toasting tortillas to eat them as chips they were so light and so perfectly toasted. It was amazing, I was able to note the time and temperature to be created again and again 360° for three minutes! We made onion rings and apple crisp pie and heated up meat pies. Everything was delicious and perfectly heated. I'm excited to discover what else I will be making , I've had an air fryer for the last four years and normally use it just for quick heat ups and fries and finishing ribs out of the oven. But I assure you that the options this model will give you will expand the things I will be able to create in the kitchen , I'm looking forward to having my cousin over for dinner for kebabs and roasted potatoes. I know it's going to be wonderful but my favorite thing to make in the air fryer is hashbrowns. I zap whole potatoes in the microwave for four minutes. Then I cut and toss them with oil and seasonings air fry them on french fry setting and it's perfect every time you have to try it!",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "keohinani",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNFK4424V5HK64KPBB7ZWFWLDGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXBCIYMYI803V?ASIN=B084HMJJ3B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 10, 2019",
                "reviewTitle": "5.0 out of 5 stars Fantastic Machine, Colors Limited by Shipping Availability",
                "reviewText": "I bought this to replace my Philips XL Air Fryer that I accidentally killed by making a terrible mistake: I put it on the stove under the hood, and bumped the burner knob. The bottom was melted and the machine had to be taken out of service. But this GoWise was everything beyond my wildest dreams!I first saw the oven style GoWise used by Lori Shaw, whom I follow because of RP Strength. She highly recommended this Air fryer and the GoWise brand. What caught my eye was that it was like an oven. With my Philips Air Fryer, I hated fiddling with the basket drawer to take food in and out. I had a hard time cleaning the parts. I felt limited by the design.With this GoWise unit, I get the convenience of the oven door. I don’t have uneven heating as indicated by another reviewer. I love that there are multiple shelves and accessories that come with this unit so I can cook more food at one time, as well as cook them more evenly with the rotisserie feature and rotating accessories.The operation is pretty easy. We use the presets sometimes, but if there are “conventional oven” directions for the frozen food we are cooking, we will adjust the presets to the recommended time and temperature. The beeping of the unit doesn’t bother me; I think the presets are great if you don’t have instructions for a food item and I like that I have a way to know I pressed the buttons properly.This unit is the perfect size for my family of four. I love that we can cook corn on the cob for all of us at once, get evenly cooked tater tots and fries, and have so many ways to cook our favorite foods. I love that the unit turns itself off and has a fan built in to dissipate the heat.I think the only thing I don’t like is the light. The light source is only on one side and only comes on when the unit is on. I can see the food okay when the light is on and the door window is clean, but when the window is dirty or I’m cooking a lot of food, the light isn’t enough to know how the food is cooking. It’s not a big deal since I tend to open the door and check / flip food when I’m not using the rotisserie feature. Another minor thing is finding space to store all the accessories. I use them all, but there are a lot of them. I put them in my electric oven which is pretty much only used for storage or large volume baking these days, anyway.The instruction manual is pretty straightforward and the unit came with a cookbook. I was saddened that I couldn’t purchase directly from the GoWise website and was directed to Amazon due to shipping. I originally wanted a white unit and it was not available to ship to me in that color from GoWise and some vendors on Amazon. I settled for black. I don’t understand why only one color is available to purchase based on where I live. Aside from the oven light, I think this aspect was the most disappointing part of my purchase experience. I love my machine enough to overlook its color; the performance is outstanding. I just can’t overlook the shipping restrictions as a limitation to my options. If you can get it to me, you should be able to get me the color I want. I was willing to pay for shipping despite being a Prime Member to get the color I want but it was not an option from GoWise directly nor some of the vendors here on Amazon.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dougdoug",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBHKVM5LO4EMRM42YRVW7OUQOJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IUH1PQFVULEE?ASIN=B084HMJJ3B",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "4.0 out of 5 stars Works great! Excited to see the other functions",
                "reviewText": "The packaging was well protected and arrived with no damage. It came with all the accessories, air fryer and dehydrator cook books. I skimmed through the cook books and they seem great. Super simple, feverish ingredients and easy to follow. Definitely got some inspirations from them with my own ideas. I got this air fryer because of the rotisserie and dehydrator functions. I only used it once to reheat leftovers. Worked great with equal temperature all around and done in 5 minutes. Will give updates on the other functionsUpdate 1/19/24- air fryer still works great. But finding some of the quirks. The beeping is obnoxiously loud. I couldn’t find a way to turn off the beeping without taking it apart ( doing this will probably void any “warranty” ) I found a video on how to take the top off and found the buzzer on a circuit board. I took electrical tape and covered the top of the buzzer. This lowered the volume to a very comfortable level. When cooking with multiple trays, the top one will cook much, much faster than the bottom tray. The tumbler is great for roasting veggies and potatoes. But it very difficult to clean. The last thing I would bring up is the dehydrator setting. You cannot change the temperature ( it stays at 130) but you can change the duration. I got this air fryer to try my hand at dehydrating. And not all my recipes have a temp of 130. You could set it manual and change the temperature but the longest duration is a hour while the process can take anywhere to 4-10 hours. Depending on what you are dehydrating.I would still give this a great rating considering the price. But this company makes a newer version of this airfryer with a second heating unit at the bottom. That probably helps to evenly heat multiple trays. If I didn’t buy this one, I probably would have got the newer one.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71QHzw497eL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denis Boulet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2024",
                "reviewTitle": "Satisfaction",
                "reviewText": "Tablettes un peu lousse, le reste très bien.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vivian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 24, 2023",
                "reviewTitle": "Not worth the price",
                "reviewText": "Bought Nov. 16, 2021. 2 months after warranty product does not work well. Set to fry at 400, after 10 minutes unit shuts down. Not usable for what we bought it for.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jetson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 3, 2021",
                "reviewTitle": "Excellent Air Fryer",
                "reviewText": "This is our second Air Fryer and we are as pleased with this one as the previous one. The controls are easy to use, the unit is not too loud and the food cooks well for everything we have tried, including but not limited to, Rotisserie Chicken, Chicken Breasts and Wings, Roast Pork and Rotisserie Pork, Egg Rolls and other snack and Garlic Cheese Bread. The cavity is slightly larger than other Manufacturer Makes, which allows for a better rotisserie sized chichen, (apprx 4 lb). The Red is quite nice and adds a nice accent colour to thekitchen. The interior cooking space dimensions: 10 1/4 \" Wide x 9 1/2 \" Deep x 7 1/4 high with the tray in place and 7 1/2 without the tray. I recommend this product.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "YiselYisel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 9, 2020",
                "reviewTitle": "Excelente producto, calidad y practicidad",
                "reviewText": "El producto es de excelente calidad, todos los acabados y los aditamentos son excelentes, los recetarios son fáciles de seguir y el producto en si es muy versátil. Te ofrece muy buenos resultados, te permite ampliar el menú de su cocina diaria, ya que funciona como horno, tostador, rostizador, deshidratador, 0ero tienes que seguir las instrucciones del fabricante para optener los resultados que deseas, ya que vimos comentarios de que no eran fáciles o prácticos los aditamentos y realmente lo son, simplemente hay qeu seguir los pasos como el amarre del pollo, el peso, la colocación entre otras observacionesLe pongo 10/10 definitivamente, estamos encantados con Go Wise",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71aLIMoQaxL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sylvain Arbour",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 16, 2023",
                "reviewTitle": "Bon",
                "reviewText": "Je l'aime bien beau look mais pas meilleur la vrais friture",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}