{
    "remaining_requests": 33866,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cuisinart-Airfryer-Basket-Roasts-Broils/dp/B0BYF8PT3L",
    "body": {
        "name": "Cuisinart Airfryer, 6-Qt Basket Air Fryer Oven that Roasts, Bakes, Broils & Air Frys Quick & Easy Meals - Digital Display with 5 Presets, Non Stick & Dishwasher Safe, AIR-200",
        "price": "$119.95",
        "originalPrice": "$149.95",
        "rawPrice": 119.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cuisinart-Airfryer-Basket-Roasts-Broils/dp/B0BYF8PT3L",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $17.96 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/416xZOBpxzL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/412kpBmshxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yLWd4lAPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51S1fJxAYpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61X0WmnB4uL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51c3XdrrvXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71qVXYNaWJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Cuisinart Store",
            "link": "https://www.amazon.com/stores/Cuisinart/page/9EA87106-FA2E-4134-BB4D-18194A61B989?ref_=ast_bln"
        },
        "brand": "Cuisinart",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 318,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 3 hrs 11 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "FAMILY SIZE CAPACITY: The 6-quart internal capacity of the basket air fryer provides ample space to cook larger batches of food, making it suitable for families or gatherings",
            "MULTIPLE COOKING FUNCTIONS: With 5 cooking functions including Air Fry, Roast, Bake, Broil, and Keep Warm, this basket air fryer offers versatility and allows you to prepare a wide range of dishes",
            "5 EASY PRESETS: The digital display with 5 Air Fry presets simplifies the cooking process, providing easy-to-use options for achieving optimal results with just a few button presses",
            "WIDE TEMPERATURE RANGE: With 1800 watts of power and the adjustable temperature control with a maximum temperature of 450°F, it gives you precise control over the cooking process, allowing you to achieve the desired level of crispiness and browning",
            "AUTOMATIC WARMER: The up to 60-minute timer with automatic keep warm function ensures your food stays warm until you're ready to serve, providing convenience and flexibility",
            "EASY TO CLEAN: The nonstick, dishwasher-safe easy-clean crisper basket simplifies cleanup, making it effortless to maintain the appliance's cleanliness"
        ],
        "description": "Cook everything from simple snacks to main meals with the versatile Cuisinart® Basket Air Fryer. This countertop cooker lightens up fried foods with fast and even hot-air-powered cooking — using little or no oil — for making healthy meals with the crispy crunch you love. Five popular pre-programmed settings, a toss notification to flip food mid-way through cooking, and convenient viewing window make it easy to air fry, roast, bake, broil, and warm food with delicious results every time. Lighten up your menu with the convenient air fryer that does more for mealtime!",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Temperature Control"
            },
            {
                "name": "Product Dimensions",
                "value": "12\"D x 16.5\"W x 12.25\"H"
            },
            {
                "name": "Color",
                "value": "Stainless Steel & Black"
            },
            {
                "name": "Capacity",
                "value": "6 Quarts"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Roast, Bake, Reheat"
            },
            {
                "name": "Output Wattage",
                "value": "1800 Watts"
            },
            {
                "name": "Item Weight",
                "value": "1 pounds"
            },
            {
                "name": "Brand",
                "value": "Cuisinart"
            },
            {
                "name": "Wattage",
                "value": "1800 watts"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Model Name",
                "value": "Basket Air Fryer"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "No"
            },
            {
                "name": "Max Temperature Setting",
                "value": "450 Degrees Fahrenheit"
            },
            {
                "name": "Manufacturer",
                "value": "Cuisinart"
            },
            {
                "name": "ASIN",
                "value": "B0BYF8PT3L"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "AIR-200"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 318 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,150 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #13 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "March 10, 2023"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page 1 Wings 2 French Fries 3 Chicken 4 Brussels Sprouts 5 Cinnamon Rolls",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c34a36f2-d85d-4372-94d9-ed3585ad2d70.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a8e4f9f-b2d1-48fb-983d-a55df812c378.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/00b349fa-9916-4556-81ed-867c5530a362.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/496d5942-3837-40b8-8dda-13ad16d46a16.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2088069c-25ba-43c5-a304-72d0da54df45.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a816ba24-ef2e-4471-9e87-0d78a99ce8db.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ec7b0d3d-efb7-4a6d-958d-fd2c8fff8e4c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0db096a8-b730-40f0-8907-6c6a807980c9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAU5TILFU4UURHYD2OY5KZUEAHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M1BO1PJVQK9Y?ASIN=B0BYF8PT3L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Quiet, effective, easy to use and clean",
                "reviewText": "Not a lot of reviews on this one but almost all are 5 star with very positive comments. I was looking for a simple and reliable air fryer that didn't smell like burning plastic (like so many others). Before this unit I tried an instant vortex pro. It worked fine but the plastic smell was terrible and didn't go away after several washings and 10 hours of running the unit empty or with vinegar and water in it. Couldn't stand the smell so I returned it.A couple of reviews said no or minimal odor from the cuisinart air fryer so I gave it a shot. Washed it and ran 2 dry cycles for an hour each and 2 wet cycles with water and vinegar for an hour. A little smell at first but not as bad as the vortex. After the last prep cycle the smell was almost gone. I cooked a test batch of potato slices with a bit of olive oil. They crisped up to a perfect golden brown top and bottom in 15 minutes on airfry setting without even shaking them. I could not tell the top from bottom. Impressive.After that no plastic smell and surprisingly only minimal cooking smell. It washed up easily and has been amazing for roasting veggies and reheating leftovers. The controls are simple and easy to use and look classy, not flashy. It's also very quiet, you can barely hear it from 10 feet away. No pre-heat for airfryer setting (there is for bake/roast) and the basket slides in and out easily. The light only stays on for 10 seconds at a time but that's fine. The glass is easy to see through, though be careful because water can get on it if you spray the underside of the basket. The glass front gets hot while cooking but it's an oven, what do you expect? The sides don't get too hot and the air coming from the vent in the back is warm but not hot.This is definitely the one to buy - a little more pricey but absolutely worth it.",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcia Lynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT6SC4GZR3V4WOETHTZACLNWAUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3587JHDEXHDRI?ASIN=B0BYF8PT3L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Such A Well Thought Out, Versatile Kitchen Appliance",
                "reviewText": "I was on the fence, about buying this Cuisinart 6 QT Air Fryer, wondering if I would use it enough, to justify the price.Well, I am so glad that I purchased it! It has so many options with the pre-sets, but with enough versatility, for your own recipes.This Cuisinart 6 QT Air Fryer is larger than I thought it would be, and a bit heavier too. That's a good thing! This isn't a flimsy appliance! It being a Cuisinart product, I knew I would be getting a quality product! I also have a Cuisinart Convection Toaster Oven.The larger size, and all of the options, it makes this a much more versatile product. Since it's just me, it definitely has plenty of room, for whatever I want to cook.It does have a lot of beeps when you set something, and to me it's a bit loud with my excellent hearing, but that means I can hear it in my bedroom, when the timer goes off.Thanks to some wonderful reviews on Amazon for this product, particularly the person who said that you have to set the Time & Temp first, I didn't even need to read the product manual, before using it for the first time.This Cuisinart 6 QT Air Fryer comes with a non-stick cooking rack, to place in the Air Fryer Basket. I also bought a Box of 110 - 9\" Brown Square Parchment Liners, which makes clean up pretty non-existent. They fit this Air Fryer perfectly! I bought them on Amazon, plus a Set Of 2 Pull Out Mats - 12\" X 14\". They kind of look like a cutting board, but they are felt & silicone. Makes pulling the Air Fryer out from the wall to use it, then pushing it back effortless.The Product Manual is wonderful. Lots of recipes, and it comes with a 3 Year Limited Product Warranty, plus a registration sheet. Make sure to register your product. You can do it online.So far, I've made Spring Rolls, and Chicken Wings. Both came out excellent! I've only had it since yesterday.I can definitely see using this Cuisinart 6 QT Air Fryer, a lot more than my toaster oven, and microwave.It doesn't heat up my kitchen. I also feel safer using it, since it has a pull out drawer, level with my kitchen counter. I don't use oil when I cook, so for me using it is a healthier way to cook.I love the light on this Air Fryer, so you can choose to see your food while it's cooking. The light does not stay on. I also love the Keep Warm, & Toss Feature, so that whatever you are cooking comes out evenly cooked. I also love that it has no knobs.This is such a wonderful Air Fryer, whether you are just using it for yourself, or for a family.It looks so nice sitting out on your kitchen counter too.A wise, smart, wonderful purchase!",
                "reviewVotes": "121 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "smits108smits108",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIDAXWK4LIUAD5OFK73S3F2UK4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IUQF9LPEQCDP?ASIN=B0BYF8PT3L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for carnivore diet and cooking meat.",
                "reviewText": "I have been using it constantly for 6 weeks. It cooks the best tasting bacon. I really like the way the bottom tray has rubber feet that hold it inside the basket. It allows you to dump the grease out between batches. The rubber feet holds the tray in so it doesn’t fall out. It cooks chicken and the skin is crispy, I was using my outdoor gas grill for everything. Now I cook everything in the air fryer. It heats up to 450 degrees so it does a nice job at browning your meat. Bacon, sausage, hamburgers, chicken drumsticks, steak, shrimp. The only thing I use my gas grill for when it’s not raining is steak. It’s hard to beat the open flame flavor. But if you don’t have a gas grill this works good for steak. The controls are very thought out and easy to use. I like the flip beeper that tells you when to flip your meat over. It comes with a useful cooking chart that gives you times and what settings to use for various things. It has a light inside so you can see your food cooking without opening the door. The whole thing is nonstick so its easy to clean up. Its also very quiet. If your cooking meat the 450 degrees is the way to go.",
                "reviewVotes": "83 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/618RHhJJ3hL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61AG4EGaAyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "North Shore Gal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERLT3ZFO4B7MP6TK4VOVWJXUPJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VVREIYHXAVMQ?ASIN=B0BYF8PT3L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Great everyday kitchen helper",
                "reviewText": "I looked at other air fryers, and landed with the Cuisinart 6-Quart. It's dimensions fit well on a small counter space, it looks good compared to some others. I've tried several recipes, including chicken wings, air fried proteins, and myriad roasted vegetables. Quick, easy, and consistent! It's also a snap to clean.One small caveat, the viewing window provided in the basket is constructed in such a way that water can slip between front and interior material. This sometimes leaves water marks on the viewing window as I'm unable to manually dry it.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tom F.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWC75IMNT3SFRZN5CUJ7QF3WVIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Q34UEDJXO65R?ASIN=B0BYF8PT3L",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Love it, most of the time.",
                "reviewText": "Works great. I'm in love with air frying. Chops, steaks, fries all come out greatDon't really see much difference between the different modes, air fried bake, broil.More instructions would have been nice.Once in awhile the temperature and timing buttons don't respond.. Occasionally the fryer will shut down in the middle of a program. That worries me for possible future problems. Presets not near what normal cook times are for most foods",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}