{
    "remaining_requests": 33833,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GoWISE-USA-3-7-Quart-Programmable-GW22638/dp/B01LX9T6HF",
    "body": {
        "name": "GoWISE USA 3.7-Quart Programmable Air Fryer with 8 Cook Presets, GW22638 - Black",
        "price": "$56.96",
        "originalPrice": "$95.99",
        "rawPrice": 56.96,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GoWISE-USA-3-7-Quart-Programmable-GW22638/dp/B01LX9T6HF",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08VV3MY1B"
        ],
        "asinVariationValues": [
            {
                "asin": "B01LX9T6HF",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$56.96",
                "variationImageURL": "https://m.media-amazon.com/images/I/41sqsH+chsL._SS36_.jpg"
            },
            {
                "asin": "B07553KM1Q",
                "variationName": "Color",
                "variationValue": "Plum",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41M+Jc9OJoL._SS36_.jpg"
            },
            {
                "asin": "B01M06ATV8",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "$60.36",
                "variationImageURL": "https://m.media-amazon.com/images/I/41YU72iW8mL._SS36_.jpg"
            },
            {
                "asin": "B01K8A4T5I",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/415aiCCvlHL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41sqsH chsL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31UCx2HK2GL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41N8DNiHYGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31HAZ04BmtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51B4xu-WeEL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the GoWISE USA Store",
            "link": "https://www.amazon.com/stores/GoWISEUSA/page/E12522BC-145B-4AEF-AB11-A0CAFA309C2E?ref_=ast_bln"
        },
        "brand": "GoWISEUSA",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 15543,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 2 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "This air fryer lets you cook your favorite foods with little to no oil. Thanks to rapid air technology there is no need to add oil to prepare fried foods. This technique uses the hot air circulating within to make healthier versions of your favorite fried foods.",
            "Comes with presets to make cooking easier. There are a total of 8 presets featuring: Warm, fries/chips, chicken, steak, shrimp, pork, cake, and fish. Just press one and you're done.",
            "The digital screen allows you to set temperature from 170F to 400F and cook from 1-30 minutes. This option is perfect for those who tend to cook their own recipes or from recipes found online.",
            "Indicator lets you know when cooking time has been reached. The timer will beep 5 times to let you know when your food is ready. The air fryer fan will stop after approx. 20 seconds.",
            "Includes recipe book: This recipe book is filled with 50 recipes specifically made for GoWISE USA Air Fryers. Choose from a variety of meals to make for breakfast, lunch, dinner, or dessert."
        ],
        "description": "The GoWISE USA Electric Air Fryer is a new, healthy and easy way to fry food using rapid air circulation. Air frying gives you the option of frying, grilling, roasting, or baking your favorite foods; everything from cakes to French fries. It includes a dishwasher safe removable pan with a cool-to-touch handgrip and detachable basket making the transition from the fryer to your place quick and easy. The fryer also features temperature control from 176⁰F - 392⁰F with cooking timer up to 30 minutes, and 8 different cooking presets: Warm-Up, Chips, Chicken, Steak, Shrimp, Meat, Cake, & Fish. Safety features include overheat protection, automatic switch off, and automatic standby mode. The GoWISE USA Air Fryer is ETL certified and complies with all standards regarding electro-magnetic fields. Power supply: 120V, 60Hz.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Manual, Programmable"
            },
            {
                "name": "Product Dimensions",
                "value": "8\"D x 12\"W x 8\"H"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Capacity",
                "value": "3.7 Quarts"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Roast, Bake"
            },
            {
                "name": "Output Wattage",
                "value": "1400 Watts"
            },
            {
                "name": "Item Weight",
                "value": "13 pounds"
            },
            {
                "name": "Brand",
                "value": "GoWISE USA"
            },
            {
                "name": "Wattage",
                "value": "1400 watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Model Name",
                "value": "GW22638"
            },
            {
                "name": "Controller Type",
                "value": "Touch control"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "No"
            },
            {
                "name": "Max Temperature Setting",
                "value": "400 Degrees Fahrenheit"
            },
            {
                "name": "Manufacturer",
                "value": "GoWISE USA"
            },
            {
                "name": "ASIN",
                "value": "B01LX9T6HF"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "GW22638"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 15,543 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32,425 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #132 in Air Fryers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "August 11, 2016"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Digital Retro Air Fryer 7-in-1 Air Fryer Digital Air Fryer with 8 Cook Presets Digital Air Fryer with Duo Display Air Fryer with Premium Accessory Set Air Fryer Oven Ultra Capacity 2.75-Quart 3.7-Quart 3.7-Quart 5.0-Quart 5.3-Quart 12.7-Quart Temperature Range 175°F-400°F 175°F-400°F 170°F-180°F 180°F-400°F 180°F-400°F 120°F-430°F Timer Range 30 Minutes 30 Minutes 30 Minutes 30 Minutes 60 Minutes 60 Minutes/Dehydrate up to 8 hours Assorted Colors ✓ Black ✓ Black ✓ ✓ Presets - 7 8 8 8 11 Detachable Basket ✓ ✓ ✓ Basket w/ Crisper Tray ✓ - Included Recipe Book Recipe Book Recipe Book Recipe Book + Basket Divider Recipe Book + 10 Piece Accessory Set Recipe Book + 11 Piece Accessory Set Watts 1350 1500 1400 1500 1700 1600",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/c01ace19-19b5-452b-b354-ebc9ac8796d5.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/36aace1b-a815-4ebe-b03e-7a562eb3164d.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/008fda46-b167-4a9a-839d-066c013d96cc.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0937c1f0-d0cc-44eb-a4d9-e1a55fe64747.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7ecbb40d-2a93-4d25-b15a-30438a11f7eb.__CR44,52,569,1137_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/09c28c7c-a436-4ec3-99c0-dfd5b87d32e3.__CR29,62,569,1137_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5f02e651-ce6d-4360-964e-3ceae3b32ba1.__CR29,51,569,1137_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d6ece206-164b-42d1-b97f-96b029a49ec8.__CR39,57,569,1137_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cdc021b8-54d7-4f13-a9e5-826730372706.__CR17,18,285,569_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b04b866c-e586-4f36-b88f-bc845f77ad55.__CR29,5,568,1136_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Carol olson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMKKWT6ZHITNYTHKQI32LRCQKJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YAK1EN410BZ4?ASIN=B01LX9T6HF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2019",
                "reviewTitle": "5.0 out of 5 stars This appliance does so much so easily I can’t believe it !!",
                "reviewText": "OMGosh. The only regret I have is that I didn’t buy this sooner. I bought the 3.7 qtBecause I’m just one person however if I had a guest or two for dinner or snacks it is plenty big enough. I just got it today and of course had to use it so I will follow up later on after I’ve used it for more than one mealI used it tonight for a breaded pork chop and roasted broccoli ( made together ). Listen, this is the best invention since the mouse trap !! My pork chop was browned and crisp and juicy inside. The broccoli was slightly roasted brown on the tips and both were absolutely delish. I never knew the variety of foods and meals you can fix in an air fryer !! I’m a baby boomer and when I first saw these advertised I thought just another new fangled gadget. How can it fry with air and nearly no oil ?? I’m here to testify folks !! I spent the afternoon reading the cook book that comes with it and I’m blown away by the meals and items you can cook in this. Nearly anything you can fry or cook in your oven or stove top ! At first when I saw them on TV I thought so what! Why not just use my stove and oven! I’m here to tell you whyFirst, of course, is the health issue, less fatsBut, other than that is your time. Dinner is cooked in half the time. Also, it’s cleaner. No spattered grease on your stove or yourself which makes it safer. Your meats, I will testify to my pork chop, are not dried out as sometimes in an oven or frying pan. Since food cooks faster, there must be vitamins that are preserved and flavor is preservedMy chop was delishishly browned and crispy on the outside and juicy with a great flavor on the inside. Can’t wait to make French toast in the morning and buttermilk biscuits and I crave fried chicken and roast chickenYes, this fryer is big enough for a whole small chicken and there are recipes for all this in the booklet that comes with the air fryer. Like I said. I can’t give a review on the durability yet and I just cooked one meal but I will follow up in a few weeks. I followed all instructions to wash the pot and basket before use and to run it for 5 minutes at 350 to rid any odor ( left from manufacturer) and it worked perfectly. No smells and operated easily and quietly. I’m very impressed!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Legs820",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVZ5ECDLBERQI5I6PDVRZWVALPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV7BCTMHTICE6?ASIN=B01LX9T6HF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2019",
                "reviewTitle": "5.0 out of 5 stars Life just got easier and healthier",
                "reviewText": "I just got mine yesterday, so I am not sure about durability yet. The fryer was very well packed and there was nothing to do but put it on the counter and wash the basket parts and read the directions. I decided since it was my first use to make something I wouldn't care about much if I screwed up; so I cut up some potatoes added salt, skipped the oil entirely and went for it. Came out beautifully! I didn't use any foil or parchment and the clean up was 3 minutes. I work a long day and when I get home, the last thing I want to do is deal with pots and pans, cleaning a stove and standing in the kitchen to cook a meal. This is GREAT! I put the potatoes in, turned it on and went about my other drudgery, only returning after 10 minutes to shake the basket and then 10 minutes later when they fries were done. I had a leftover chicken cutlet (cooked the day before, the old fashioned way) and tossed that in for 5 minutes to crispy it up and I had a great meal! The 3.7 was larger than I expected. I estimate I can comfortably fit 3 chicken legs and thighs or 2-3 nice sized pieces of fish. Can't wait to go shopping today after work as I plan to try out a few of the recipes in the cook book GoWise provided. All the recipes look super easy, require very few ingredients and look yummy. My next is going to be the apple chips for snacks at work and I'm going to try a few other recipes over the weekend. I'll update as I try new things.Update: So now after a few weeks I can say this is the best thing I have ever purchased, I have made several different chicken dishes, steaks, many different vegetables, including cauliflower, asparagus, carrots and zucchini fries. Made pita chips a few times, apple chips and mini pizzas. I am an air-frying maniac. Everything came out really crispy and delicious. The only thing I used oil on was the pita chips and asparagus, and even then it was a light spray of olive oil. Today alone I made spicy chicken cutlets with panko, brussel sprouts with garlic, 2 bags of pita chips with onion and garlic powder, and roasted carrots. Going to make roasted baby eggplant later and crushed them into tomatoes, cilantro and jalapeno for the pita chips. All came out really nicely and I have lunch for work for the next few days! I am eating healthier, saving money and enjoying the creative process. Thinking of getting another so I won't have to work in so many batches. We'll see. One other thing: I bought the parchment paper. Not necessary for anything I have made so far. Don't think it's necessary.At 2 months now of almost daily use. Still my best friend. Have had no adverse situations. I actually dropped the basket on a very hard floor expecting it to be dented...but nope...was still fine!",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "johnrsenior",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKK3K6GRWYGPSMASVWAHCK6D3YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OVW3WYLRUT87?ASIN=B01LX9T6HF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2019",
                "reviewTitle": "5.0 out of 5 stars Had it less than a week, cooked 5 meals, SUPERB device and value!",
                "reviewText": "Returned a 5qt other brand then found this 3.7qt, ideal for two. The size *seems* large until it finds its place. Really @12\" wide, not the 8.25\" pan diameter. So far, eggplant parmesan, buffalo wings, breaded shrimp, breaded bone/skinless chicken thighs, all super successes on first tries, and one unsuccessful attempt at potato chips. Super easy to clean; soak, wipe with sponge, rinse, dry with soft towel. Quite a few have reported problems with coated cooking surfaces chipping or flaking, but reason should suggest using non-metal utensils. On general principles, bought a roll of parchment (our grocery didn't stock round sheets) and, using a medium plate, marked numerous round sheets which I would cut and punch w/hand hole punch as needed. Operation is *REALLY SIMPLE* and uncomplicated, even for me, and cooking times seem less than traditional frying. A really nice, 50-item accompanying cookbook has some beautiful and interesting ideas! I'm beginning to feel really comfortable with fat-free cooking! The natural flavors are retained, and the crisp coatings are a delight. The outer surface does not get hot, barely warm, except at the back where a @2.5\"x2.5\" vent exhausts heated air. Only by holding your hand 2\" away for secs could you get burned. No heat seems to emanate from the bottom, although I do place a cutting mat underneath it. Would seem to be a *REALLY ECONOMICAL* appliance as it can cook entrees for 4, has a heating element substantially smaller than an electric oven, and a lot smaller than a convection toaster oven. Would I buy this neat air fryer again ??? In a New York minute !!! Really looking forward to some creative cooking!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jayne L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 3, 2024",
                "reviewTitle": "Cannot plug in air fryer",
                "reviewText": "Cannot use this product as cannot even plug in as American connection",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rant_s",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 18, 2020",
                "reviewTitle": "excelente para freir y hornear",
                "reviewText": "ya tengo mas de un mes que recibi la freidora, la he probado con diferentes alimentos y las papas, quedan muy bien, solo es cuestion de revisar la lista de guias e irle dando el punto segun el tipo de corte de las papas, yo he probado, ya criscut, thick, y cubos. todas quedan muy bien. especialmente si usas aceite de oliva en spray. ocupa muy poquito. en pescado y camarones, tambien lo he usado, en cortes de carne, queda muy bien, jugosa y como si fuera al horno, en pan tambien se hacen unos sandwich crocantes, para cocinar pan, solo he probado con los bisquet congelados y quedaron muy bien, lo mejor, es que a diferencia de usar el horno convencional es menos calor , en consumo de electricidad no vi gran cambio y si que la he usado. se ensucia mucho menos la cocina una gran ventaja y salen muchos menos trastos..yo la recomiendo .. todo tiene buen sabor y textura, es de los mejores productos que he adquirido en amazon.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leonardo Madera Lira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 21, 2019",
                "reviewTitle": "Opcion saludable a freir",
                "reviewText": "Recibí después de algunos días el pedido ya que era enviado por Amazon USA, en general fue bastante rapida la entrega con PRIME, venia solo en su propia caja, ninguna caja con el emblema de amazon o algo que cubriera la misma, sin embargo, llego bastante bien el producto en cuanto al empaque.Una vez desempacado el producto estaba totalmente nuevo, incluye un recetario y la freidora en sí.Al probarlo con papas a la francesa delgadas el programa base de \"Fries\" alcanzó a quemarlas, esto no fue un fallo del producto, más bien un fallo de planeación, después de leer el manual con mayor detenimiento te menciona un cantidad mínima de papas para papas específicas, delgadas, gruesas, en gajos, etc.Una vez adquirido este conocimiento puse la cantidad correcta y el tiempo fue mas que perfecto para dar un buen acabado en las papas.La freidora puede ser operada en programas básicos o de manera totalmente manual pudiendo ajustar el tiempo de cocinado y la temperatura.En general, una excelente compra a un excelente precio.Muy recomendado",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gravelpit",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 5, 2019",
                "reviewTitle": "Best deal.",
                "reviewText": "Love this unit. Healthy way to enjoy foods I used to deep fry. Great price and fast shipping. It is a high quality item that is really well made. Very easy to clean. I use this a lot more than I thought I would. The 2 bone prime rib roast turned out a perfect medium rare restaurant quality meal. Chicken, baby back ribs and a perfect porterhouse steak has me using this for most of my cooking needs.UPDATE:After 3 years of use I finally tried my first air fried hot dog. Why did it take me this long ? It was delicious ! I warmed up the bun for 2 minutes and did the standard 5 minute warm function button for the weiner. Best hotdog I have ever eaten. It still is holding up like new. I use it 5 + times a week. It has never let me down. I highly endorse this item.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cony Bravo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 12, 2021",
                "reviewTitle": "Fácil de usar, fácil de limpiar y los alimentos se cocinan correctamente. 100% recomendable",
                "reviewText": "Los tiempos de cocción son muy cortos y los alimentos se cocinan super bien. No hay que usar aceite forzosamente, puedes usar un poco de mantequilla o aceite en spray",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}