{
    "remaining_requests": 33827,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ninja-FD401-Fryer-Stainless-Pressure-8-Quart/dp/B07S85TPLG",
    "body": {
        "name": "Ninja FD401 Foodi 12-in-1 Deluxe XL 8 qt. Pressure Cooker & Air Fryer that Steams, Slow Cooks, Sears, Sautés, Dehydrates & More, with 5 qt. Crisper Basket, Reversible Rack & Recipe Book, Silver",
        "price": "$169.99",
        "originalPrice": "$249.99",
        "rawPrice": 169.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ninja-FD401-Fryer-Stainless-Pressure-8-Quart/dp/B07S85TPLG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B5YB87T8"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Stainless Steel",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41qKlDoTF7L._SS36_.jpg"
            },
            {
                "asin": "B07S85TPLG",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41hLUQwvoaL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41hLUQwvoaL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51dgdxGnFqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HjKwXzNQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OekPJ7KjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51klcRH23AL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515p9ixLhoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81I0DAtygrL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ninja Store",
            "link": "https://www.amazon.com/stores/Ninja/page/4D837C13-1334-44EE-AD50-9586EE0F3873?ref_=ast_bln"
        },
        "brand": "Ninja",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 34629,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Saturday, February 17. Order within 3 hrs 4 mins",
            "FREE delivery Monday, February 19. Order within 3 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "THE NINJA FOODI DELUXE XL: The deluxe pressure cooker that also crisps.",
            "TENDERCRISP TECHNOLOGY: Quickly pressure cook ingredients to lock in juices, then give them a crispy, golden air-fryer finish.",
            "COOK FOR THE WHOLE FAMILY: With an extra-large capacity 8-quart ceramic-coated pot that is nonstick, PTFE PFOA free, and easy to hand-wash.",
            "XL AIR FRYING CAPACITY: With a family-sized 5-quart cook & crisp ceramic-coated basket that holds up to a 7-lb. chicken to feed your whole family. Basket is PTFE PFOA-free, nonstick, and dishwasher safe.",
            "DELUXE REVERSIBLE RACK: Steam and broil, as well as TenderCrisp up to 8 chicken breasts at once or add servings to layered 360.",
            "12-IN-1 VERSATILITY: Utilize 12 programmable cooking functions to Pressure Cook, Air Fry/Air Crisp, Steam, Slow Cook, Yogurt, Sear/Sauté, Bake, Roast, Broil, Dehydrate, Sous Vide & Keep Warm.",
            "45 RECIPES: Inspiration guide featuring delicious recipes to get you started in your Ninja Foodi Deluxe.",
            "14 SAFETY FEATURES: Rigorous safety testing to give you peace of mind while you cook.",
            "WHAT'S INCLUDED: Ninja Foodi Pressure Cooker, Crisping Lid, Pressure Lid, 8 qt. Ceramic Coated Pot, 5 qt. Ceramic Coated Cook & Crisp Basket, Stainless Steel Deluxe Reversible Rack & 45 Recipe Chef-Inspired Cookbook."
        ],
        "description": "Meet the Ninja Foodi Deluxe Pressure Cooker. The 8-qt. deluxe pressure cooker that crisps. TenderCrisp Technology lets you quickly go from frozen to crispy in as little as 20 minutes. The 8-qt. cooking pot and 5-qt. Cook & Crisp Basket make it easy to cook and air fry delicious treats and meals in an instant. The stainless steel finish and enhanced user interface provide the most premium Foodi experience yet.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Ninja"
            },
            {
                "name": "Capacity",
                "value": "8 Quarts"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Finish Type",
                "value": "Chrome"
            },
            {
                "name": "Product Dimensions",
                "value": "14.57\"D x 16.1\"W x 14.2\"H"
            },
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Wattage",
                "value": "1760 watts"
            },
            {
                "name": "Item Weight",
                "value": "26.04 Pounds"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Controller Type",
                "value": "Hand Control"
            },
            {
                "name": "Operation Mode",
                "value": "Automatic"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Closure Type",
                "value": "Outer Lid, Inner Lid"
            },
            {
                "name": "Manufacturer",
                "value": "SharkNinja"
            },
            {
                "name": "ASIN",
                "value": "B07S85TPLG"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "FD401"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 34,629 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,477 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #15 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "July 26, 2019"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The deluxe pressure cooker that crisps With an 8-qt pot and a Deluxe Reversible Rack, the Ninja Foodi Deluxe Pressure Cooker offers more cooking capacity than ever before.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f8334f7e-3eb7-4cf0-bed6-d26530215da5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "XL Cooking Capacity The Ninja Foodi Deluxe Pressure Cooker makes it easy to cook delicious roasts and meals for large families and guests.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/38a60bd8-3839-4b8f-bc75-318d63ef82be.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Pressure Cooker Cook up to 70% faster than traditional cooking methods* and make dinner in an instant. *Versus slow-cooked, braised, or low-simmer recipes. Air Fryer Air fry to make guilt-free food with up to 75% less fat than traditional frying methods*. *Tested against deep-fried, hand-cut French fries. Frozen to Crispy Pressure cook frozen meats to quickly defrost and cook them at the same time. Then drop the crisping lid to give your meal a crispy finish. One-Pot Wonders Elevate your favorite casseroles, soups, and stews by finishing them off with a crispy, bubbly topping.",
                "media_link": []
            },
            {
                "media_text": "Deluxe Reversible Rack Steam, broil, or TenderCrisp up to 8 chicken breasts at once.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/353dbdb2-4fa4-415d-8ae1-d71bf767cbe0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Compare Ninja Foodi Pressure Cookers FD401 Add to Cart OS101 Add to Cart OP301 See Details OS301 Add to Cart OP401 See Details Customer Reviews 4.8 out of 5 stars 34,629 4.8 out of 5 stars 34,629 4.7 out of 5 stars 9,828 4.8 out of 5 stars 34,629 4.7 out of 5 stars 2,557 Price $169.99$169.99 $129.95$129.95 — $119.95$119.95 — TenderCrisp Technology ✔ ✔ ✔ ✔ ✔ Number of manual programs 9 8 9 10 9 Nonstick ceramic coating ✔ ✔ ✔ ✔ ✔ Capacity (qts.) 8 5 6.5 6.5 8 Wattage 1760 1460 1460 1460 1700 Color Stainless Steel/Black Stainless Steel/Black Black Stainless Steel/Black Black Product dimensions (in.) 16.1 L x 14.57 W x 14.29 H 15.95 L x 13.9 W x 13.19 H 14.25 L x 16.75 W x 13.1 H 13.35 L x 13.19 W x 13.15 H 14.25 L x 16.75 W x 14.1 H",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/f8334f7e-3eb7-4cf0-bed6-d26530215da5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/38a60bd8-3839-4b8f-bc75-318d63ef82be.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ce4d6e59-8f63-433d-ae56-04aa85a41195.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0870e38b-93d7-4a93-a451-087ba3aa8e22.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9ee3b3ce-0748-41bf-9047-345019f78783.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/54a711fb-4c00-43d4-baa9-ede1ca10588d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/348d8eda-a365-4c25-bc8c-536fd93e15ae.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/353dbdb2-4fa4-415d-8ae1-d71bf767cbe0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bf675f1a-da00-4566-af46-282adc1a2f9b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2f0b6f3f-6a09-40d5-aa02-314217c96c48.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/eb8eac3c-c0f2-4836-b97d-66b0a6df4a71.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ab8c06fb-dcb1-4f04-8b95-0f6eed8b2faa.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ba605b9d-e5d2-4d96-9d66-0cd6c2959ae6.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/54b66614-92d1-42c5-a12f-614ab0d5becf.__CR0,0,200,225_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Judy L.Judy L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHL7BB7GOOWFA773QUOELKNUIQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3O1HD4K2UPUJT?ASIN=B07S85TPLG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2021",
                "reviewTitle": "5.0 out of 5 stars Easy to clean, multiple functions, easy to use, I use it almost daily.",
                "reviewText": "I have had a number of electric pressure cook brands over the years, and the Ninja Foodi pressure cookers with the air crisp lid is my favorite. First of all, to me, it doesn't make sense to buy a 6 quart pressure cooker since the quantity you cook is limited to the capacity of the cook. With an 8 quart pressure cooker, you can as easily cook smaller quantities as larger ones. I always opt for the larger size since cookers I have had in smaller sizes were never used.I also have had the Ninja OP301 pressure cooker with the air crisp lid for over two years. I use it almost every day and it still works and looks like new. I like it so much, when I saw the Ninja FD401 unit on sale during the Amazon Prime days, I jumped on it. I wanted an extra in case the one I have fails. From experience, I have learned this usually happens in the middle of making dinner.I have looked into the differences between the two units, and I'm not sure whether I prefer the OP301 unit to the DP401 unit. The OP301 is describes as a 9-in-one and the FD401 is described as a 12-in-1. The OP301 actually has 7 cooking functions to choose from and the FD401 has 8 functions to choose from. Some functions are combined to come up to the 9-in-1 for the OP301 and 12-in-1 for the FD401. The following is the differences between the two units. - Cooking functions - The FD401 added Yogurt to the Slow Cook function. OP301 - Pressure, Steam, Slow Cook, Sear/Sauté, Air Crisp, Bake/Roast, Broil, Dehydrate FD401 - Pressure, Steam, Slow Cook/Yogurt, Sear/Sauté, Air Crisp, Bake/Roast, Broil, Dehydrate - Cooking function selection - The FD401 uses the Start/Stop knob to scroll through the functions for selection and to increase or decrease time and temperature. The OP301 has buttons that can be pressed for each function. Personally, I prefer the selection buttons on the OP301 to the dial used for selection on the FD401. - Time and Temperature - On both units there are default settings for both, but time and temperature can be easily changed on both by pressing the up/down buttons on the OP301 or using the dial on the FD401. - Accessories - Both come with the same accessories: reversible rack, cook/crisp basket, etc.I use my Ninja Foodi almost every day, and bought a couple accessories to increase the uses . Since I grow a number of veggie greens in my basement, I bought a steamer basket from Amazon for an 8 quart pressure cooker that I use to steam the veggies. The thicker leaves require 8-10 minutes of steaming, and the thinner leaves, like spinach, require only 2-3 minutes of steaming. I also bought the Ninja Foodi Skewer set that works wonderfully for cooking and browning BBQ'ed chicken wings, chicken thighs, and brochettes using chicken, fish, shrimp, or beef. The air crisping lid is used for the chicken wings and thighs after cooking them with the baking function.As a pressure cooker, this Ninja Foodi saves so much time, and the results are always wonderful. For example, a pork shoulder roast needs to be pressure cooked for only 55 minutes, and the liquids left make a wonderful gravy. To do this, put 2 cups of beef broth in the bottom of the cooking pot, add 1 large onion cut into wedges, 5-6 garlic cloves (or to taste), and seasonings. After the pork shoulder is done, remove it and cover with tin foil to keep warm. Set the cooker to sauté low, use in immersion blender to blend the onion and garlic, add a mixture of 1/4 cup water and 2 tbsp. corn starch, and cook until the gravy thickens. Using the pressure cooking function, I have also made pot roast with potatoes and carrots, corned beef and cabbage, short ribs, beef stew, and more. All have come out perfect, and all were done in 1 hour or less.In conclusion, both units supply basically the same cooking functions, and both are excellent cooking appliances with multiple cooking functions that will enhance the cooking abilities of anyone using them. Personally, I prefer the button selection of the OP302 over the FD401 unit simply because pushing a button for the desired function is much easier and faster than scrolling to the desired function with a dial.As for storage of the Air Crisp lid, there is an option available on Amazon to store this lid on top of the pressure cooker. I have this, and now store my Air Crisp lid on top of the pressure cooker.Another important point to mention is that many of the newer appliances use wattages from 1500 to 1800 watts. This unit is rated at 1760 units. We have a 40 year old home and most of the circuit breakers were 15 amps. This could handle 1 appliance if nothing else was running at the time of the appliance. I was having a problem with circuit breakers popping when using two appliances at the same time and sometimes when I was using only one. This made cooking dinners very frustrating as the cook times were lost when the breaker popped. We finally had an electrician come to the house to upgrade our circuit breakers to 20 amp and many of the outlets in my kitchen were wired to separate circuit breakers. This made dinner cooking a lot easier for me, but it came at a cost of over $3000. If you have only a couple of the newer appliances, including this one, you may have a problem if you have 15 amp circuits and anything else is running on the same circuit at the same time.I hope this review was helpful for you. I will update my review if my opinion changes or I can add more information.",
                "reviewVotes": "346 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/11uywY+eNPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/21M7TGKCoZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/21uo2Enm4WL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/21uxGBrUi2L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "@ChrisCruzGood",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVVGI6MSD4AQ6Z2CYO2XMKSQ7RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17N38Y3H3BIET?ASIN=B07S85TPLG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Ninja FD401 Foodi - The Ultimate 12-in-1 Deluxe Kitchen Appliance",
                "reviewText": "The Ninja FD401 Foodi is a true marvel of modern cooking. As a food enthusiast, I was eager to try out this 12-in-1 appliance that combines a pressure cooker, air fryer, and steaming function. And what can I say is that it exceeded all my expectations.The 8-quart capacity is a significant advantage. It's perfect for larger families or for cooking in bulk. The Ninja FD401 has saved me time in the kitchen, and now I can easily prepare large quantities of food.The versatility of this appliance is incredible. From achieving crispy air frying to slow-cooking succulent dishes, it does it all. The steaming function is one of my favorites because it allows foods to retain their flavors and nutrients. You can cook a full meal without worrying about mixing flavors.The build quality is outstanding. The appliance is sturdy and well-designed. It looks durable and ready to withstand the test of time. The touchscreen is intuitive and easy to use, and cleaning is hassle-free.What makes the Ninja FD401 even more special is the TenderCrisp technology. This allows you to pressure cook foods to keep them tender and juicy and then use the air fryer function to brown them and make them crispy. It's like having the best of both culinary worlds in one appliance.The only caveat I have is that, due to its capacity and versatility, the Ninja FD401 is a bit large. You'll need kitchen space to accommodate it. However, considering everything this appliance can do, it's worth every inch of space it occupies.In summary, the Ninja FD401 Foodi is a dream come true for any culinary enthusiast. Its capacity, versatility, and build quality make it a valuable addition to any kitchen. If you value convenience and quality in meal preparation, this appliance is a worthwhile investment. I couldn't be more pleased with my Ninja FD401.@ChrisCruzBolsonaro",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sommy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 9, 2024",
                "reviewTitle": "Excellent Product",
                "reviewText": "I love my Ninja Pressure cooker & Air fryer. It does more than just air frying and pressure cooking; it also has other functions. Instructions are unambiguous, and I have not had any issues in almost 3months of use. Do not get intimidated by its size, keep it in a corner where you will not have to move it. Overall, this is a great product that cuts down my cooking time and makes me want to try out recipes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Bojorquez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 17, 2024",
                "reviewTitle": "Super practica!",
                "reviewText": "La recomiendo mil!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mmo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 3, 2023",
                "reviewTitle": "Muy buen producto",
                "reviewText": "Wooooo... nunca habia concinado en una olla express pero con esta es muy sencillo y la verdad muy practico... ya llevo varias semanas y la verdad es que sorprendido gratamente. Buena inversión.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RVDRVD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 5, 2021",
                "reviewTitle": "This is a multi use appliance.",
                "reviewText": "Very pleased with cooking results using this item. Very user friendly, even for an old fart like me. Temperature settings are very accurate and easy to control. Cleaning around the outer rim at top of removable pot is a bit of a challenge, but after a few times, with a bit of creativity, it only takes one minute. The way of the design is near impossible to ever have to clean inside. BUT !!! , the air crisp lid is more of a challenge. I will separate the frame to make it easier when necessary to clean. I’m guessing after 6 months of use. Pressure cooker feature works great. Overall, I am pleased with this product.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81J1h9-UA9L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Derek PlatasDerek Platas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 29, 2022",
                "reviewTitle": "Increíble",
                "reviewText": "Desde que me llego lo he usado 2 veces las instrucciones no están en español pero en YouTube hay videos del funcionamiento fáciles de entender y con muchas recetas prepare papás fritas y arroz con leche me sorprendí con la rapidez que cocina y la verdad super fácil de lavar . Excelente compra 👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71suqTbL-+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pwSwu-5BL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$218.99",
                "sellerName": "Trends Goods",
                "sellerRating": "5"
            }
        ]
    }
}