{
    "remaining_requests": 33802,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Chefman-TurboTouch-Easy-View-Air-Fryer/dp/B09JGVVRCN",
    "body": {
        "name": "Chefman TurboTouch Easy View Air Fryer, The Most Convenient And Healthy Way To Cook Oil-Free, Watch Food Cook To Crispy And Low-Calorie Finish Through Convenient Window, 5 Qt",
        "price": "$59.00$50.15",
        "originalPrice": "$89.99",
        "rawPrice": 59.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Chefman-TurboTouch-Easy-View-Air-Fryer/dp/B09JGVVRCN",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CFD6CGKH"
        ],
        "asinVariationValues": [
            {
                "asin": "B08GY96RL7",
                "variationName": "Size",
                "variationValue": "4.5 QT - Black",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08HJKN7DR",
                "variationName": "Size",
                "variationValue": "4.5 QT - Stainless",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09JL1HC4F",
                "variationName": "Size",
                "variationValue": "5 QT",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09JGVVRCN",
                "variationName": "Size",
                "variationValue": "5 QT - Easy View",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09BZXLSSR",
                "variationName": "Size",
                "variationValue": "7 QT - Air Fryer Grill",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B9NY1C9X",
                "variationName": "Size",
                "variationValue": "8 QT",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09JGSVHZC",
                "variationName": "Size",
                "variationValue": "8 QT - Easy View",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08JH8C69P",
                "variationName": "Size",
                "variationValue": "8 QT - Window",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09JGVVRCN",
                "variationName": "PatternName",
                "variationValue": "Air Fryer",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "PatternName",
                "variationValue": "Air Fryer + Liners",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "Available to ship in 1-2 days",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41CpW6D-HkL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41pH11u9t9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WvnQh2IfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31 rB3H65hL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31dojQCmg5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XxHIIUblL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Chefman Store",
            "link": "https://www.amazon.com/stores/Chefman/page/91E18252-ACE3-4B71-AB0D-D43DCB84F22D?ref_=ast_bln"
        },
        "brand": "Chefman",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 6182,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23. Order within 18 hrs 45 mins",
            "FREE delivery Sunday, February 18. Order within 3 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "WATCH YOUR FOOD FRY: Looking for the perfect countertop air fryer. You ve found it. The Chefman TurboTouch Air Fryer is the world s fastest, healthiest, and most convenient way to cook. With a convenient easy-view window, you can watch your food fry to your ideal finish. With four built-in cooking functions, you can air fry crispy chicken, fresh fish, succulent steak, and golden French fries to a flawless finish with little to no oil. Adjustable temperature control of 200 F to 400 F makes it easier than ever to achieve absolute perfection.",
            "TAKE CONTROL OF YOUR COOKING: The search for simple one-touch cooking has come to an end. With intuitive digital control, you can seamlessly select your preset, program your time and temperature, and start air frying in seconds. It gets even better—a built-in LED reminder lets you know when it s time to give your food a shake.",
            "COOK FOR A CROWD: Compact footprint with a family-sized capacity—what more could you ask for. The 5-quart basket capacity maintains a small footprint on your countertop, while still allowing you to cook comfort food favorites and mouthwatering meals for the entire family.",
            "CARE-FREE CLEANUP: The TurboFry Touch Easy View Air Fryer has the full package—powerful cooking and striking presentation. The matte black exterior displays beautifully on your countertop, but is also extremely simple to stow away. When you re done cooking your dish, wipe down the exterior with a damp cloth. All accessories are dishwasher-safe, and the nonstick basket is incredibly easy to clean.",
            "RESOURCES: cETL approved with advanced safety technology for long lasting durability, and 1-year warranty provided by Chefman, so you can purchase worry-free - we've got your back. For information on how to use your product, scroll down for a PDF User Guide. 1300 Watts/120 Volts – RJ38-SQPF-5TW"
        ],
        "description": "Finally—an air fryer that has it all. The Chefman TurboFry Touch Easy View Air Fryer makes mastering weeknight meals easier than ever. Watch your food air fry to ultimate crispiness through the convenient front window. With effortless one-touch digital control and four built-in cooking functions, you can cook your favorite foods to the perfect fried finish, every time. No matter if you’re in the mood for crispy chicken, a medium-rare ribeye, or golden fries, this appliance helps you cook with confidence. The adjustable temperature of 200°F to 400°F and the ability to add or subtract time allow you to tailor your air frying. Worried about overcooking? An LED reminder tells you exactly when it’s time to give your food a shake to ensure even cooking, every time. Air frying for the family has never been so convenient. The nonstick 5-quart basket capacity allows you to feed a whole crowd, while still maintaining a compact footprint on your countertop. The matte black exterior wipes down simply with a damp cloth, and the accessories can be tossed right in the dishwasher. Chefman has you covered. With a 1-year assurance, you can purchase and cook worry-free. This product is UL- approved with advanced safety technology for long-lasting durability. For information on how to use your product, scroll down for a PDF User Guide. 120 Volts/1300 Watts – RJ38-SQPF-5TW",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Product Dimensions",
                "value": "14.8\"D x 12.2\"W x 15\"H"
            },
            {
                "name": "Color",
                "value": "5 Quart"
            },
            {
                "name": "Capacity",
                "value": "5 Quarts"
            },
            {
                "name": "Material",
                "value": "Iron + Non Stick Coating, Plastic"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Bake"
            },
            {
                "name": "Output Wattage",
                "value": "1300 Watts"
            },
            {
                "name": "Item Weight",
                "value": "9.35 pounds"
            },
            {
                "name": "Brand",
                "value": "Chefman"
            },
            {
                "name": "Wattage",
                "value": "1300 watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Model Name",
                "value": "TurboTouch Easy View Air Fryer,"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Controller Type",
                "value": "program"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Max Temperature Setting",
                "value": "400 Degrees Fahrenheit"
            },
            {
                "name": "Manufacturer",
                "value": "Chefman"
            },
            {
                "name": "ASIN",
                "value": "B09JGVVRCN"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "TurboTouch Easy View Air Fryer,"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 6,182 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25,345 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #104 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "October 14, 2021"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mrs. EdgingMrs. Edging",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIO3K3DDRUCYNQEQY7XIDD3W65A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X1B3A9TMMB34?ASIN=B09JGVVRCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2021",
                "reviewTitle": "5.0 out of 5 stars Awesomeness!!!",
                "reviewText": "Okay, had to come write a review because I know I would have appreciated reading it! Haha!I specifically chose this air fryer because of the window, and I’m so glad I did. It is literally the bomb! I did a lot of research and read tons of reviews. I didn’t go for the XL drawer style because I heard they were a challenge to clean, and I honestly didn’t need that much space. But I wanted something bigger than a 5qt. So I got this 8qt. Honestly, I thought it would be bigger? But it’s still a good size and DEF wouldn't go smaller. Basically all the reviews I read had lovers and haters. But overall I decided to give it a try. Some said it smelled like plastic. But another reviewer mentioned after cleaning the basket per instructions, they took it outside and ran it through a few cycles. I did the same. It had a slight smell, but nothing crazy. After I brought it in and it cooled, I tried my first experiment of frozen pretzels with pepperoni and cheese. It said 400 for 15 on the box. I have watched so many videos by now I knew to decrease everything. So I chose 350 for 5 mins and that was ‘just’ perfect’!!! I probably could have done 4 mins! WATCHING THROUGH THE WINDOW WAS GOLDENNNNNN!!!! My word!!!! Get this one!!! I love it! I can’t wait to try something else in it!!! The other common complaint was chipping of the coating. 🤷🏽‍♀️Instructions say…no aerosol oil sprays!!! So yeah, I see people on YT using Pam? 🤷🏽‍♀️🤦🏽‍♀️So, yeah, don’t do that and maybe it won’t chip! Walmart and TJ’s has a Avocado non-aerosol spray high smoke point. Bam! Get it! This seems super well made, considering. I know it’s not a super expensive appliance…but it does the job. It will pay for itself, not having to run my oven. The digital pad is quiet. The noise of the fryer is very quiet. It was pretty hot after running it a few times at 400 for 10-15 mins. So put it in a good place. I had to wait for it to cool down before I could move it. It has the 4 preset settings, which I think will basically be a short cut to the temp you want and easily adjusted with the buttons. I barely had to press them, was great! I’m super excited about the possibilities and can’t wait to try some more stuff. I’ll come back and update later with how it’s going after awhile. I think after all my research…this is a good one! The window…seriously guys, it’s the best! ✅🙌🏼🎉 Oh, btw, pretzel was awesome and totally cooked through and soft…in 5 mins from frozen! This is gonna be amazing!!🙌🏼🙌🏼🙌🏼Update-Almost two months in, and still loving it. Now I KNOW the window is a must! Like, how do other Air Fryers not do this, if it’s possible? Working great, easy to clean. Use it all the time! Would absolutely buy it again. Only thing wrong so far…the Logo is rubbing off right where I use my thumb to pull the drawer out. Not a big deal, I actually tried to just rub the whole thing off, will have to work at it. But maybe the Manufacturer can put it somewhere else? Other than that…awesomeness continues! 🙌🏼 One other note, I was worried that since this model doesn’t have the ‘basket’ type you couldn’t ‘pour it out’ because the bottom tray would come out? That was wrong. You can pour it out just like the basket ones. The silicone stoppers hold the tray down snug enough for you to pour your fries into a bowl. Just FYI, if you were worried about it. :) No need to worry, works great, less stuff to clean!✅Almost a year now! Use it…I’d say pretty much every week for something! Window is still my favorite. Touch screen on top is another thing I do like.Unfortunately, the rubber stoppers have been breaking off one by one. Poor design. The little spikes that hold them in place just end up getting cut over time with all the in and out, and thus…break off. So now I have two spots in the basket where the nonstick has come off…and I’m sure will start to rust. Technically it’s not touching the food. But overall, if they came up with a new design for those tabs, it’d work better. Now I always have to hold the bottom in with a spoon or something when I dump the basket, so I’d doesn’t fall out.Still love it. Maybe I can get new rubber stoppers?",
                "reviewVotes": "121 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/6121IWOur-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61O19oDEm5L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Q4Q2KiiIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/B1olfZ5kLLS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/B1wqRFbeVWS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Southern Gentleman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHB65POT77J76FD2C7A753EWOKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1STOYC2M042VW?ASIN=B09JGVVRCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2022",
                "reviewTitle": "5.0 out of 5 stars Air Fryer, where have you been all my life?",
                "reviewText": "Every aspect of this machine is extraordinary. You Set It and Forget It. Everything turns out perfectly cooked. Whether it be frozen solid chicken or fresh chicken it always comes out crispy on the outside and completely cooked & juicy on the inside. Vegetables, whether frozen or fresh come out done exactly right, every time. It's cooks so fast that you start making multi-dish meals just to show off. And Clean Up? LOL ... seriously, it almost makes dish washing fun, it's so easy.The only drawback is that everything is done so quickly, easily and perfectly, that I started making so many different things just to see how they would turn out, I couldn't possibly eat it all. I love this machine.By the way, I'm a 73 single guy who had given up cooking for Subs, Fast Food Burgers, Pizza and frozen dinners because of the hassles of clean up and cooking for myself. BUT, now I'm back in the cooking game and loving it",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMGMIJNFEJZBJBLKXKOOONIMHJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W1U5XG7BCMK1?ASIN=B09JGVVRCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2021",
                "reviewTitle": "5.0 out of 5 stars Hands down! Best air fryer and I will tell you why",
                "reviewText": "I’m 59, old school and like to keep it simple but I also enjoy having the latest and greatest. After 40 years of cooking three meals a day for my family now it’s just me and my husband. We also have a small daycare….this thing is a game changer!! Its stupid easy to use, so easy to clean and the quality is top notch. The highest temperature is 400 but trust me that’s as high as you need it to be. The controls could not be easier they are simple straightforward. I cooked frozen french fries in this thing. Amazing! in the oven I think it takes 20 minutes it was 10 minutes and halfway through it has this shake alert so you can pull it out shake it around and I know it says one layer but when I cooked the fries it was more than one layer and they turned out perfect. But you have to remember this you can’t use any aerosol cooking spray….get a pump sprayer on Amazon and use avocado oil. Do your research on oils…vegetable and canola oils….you should get that crap out of your diet ASAP. Spray it lightly on the removable rack and brush it around or toss your food in a little oil. I mean a little. You will be surprised just how little oil you need. Clean up is a breeze….pull the basket, remove the rack and wash. But you can’t use drippy batters like tempura or a batter like for onion rings. Also remember it’s not going to be like deep frying but honestly I’m from the south, I grew up on fried foods in the cast iron skillet and fried chicken in this thing comes in at a very close second. I cooked red potatoes and a pork tenderloin and it was better than in my cast-iron skillet. Thin chicken breasts dipped in egg then a seasoned flour mixture…soooo good! And seriously! Check out this price! What’s not to love about this thing! Nothing. Absolutely nothing! Get yourself an air fryer cook book to really get a lot of use out of this. Healthier than frying, great price, easy to clean. This is the one you want.",
                "reviewVotes": "59 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FAYE MCILVEEN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2024",
                "reviewTitle": "WORKS GREAT ONLY USED THE AIR FRY SO FAR",
                "reviewText": "WORKS GREAT",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda Gyselle Hernández Gómez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 25, 2024",
                "reviewTitle": "Me encanta",
                "reviewText": "De las mejores compras que he hecho",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RealThing",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 1, 2024",
                "reviewTitle": "My 1st air fryer chosen carefully and I love it",
                "reviewText": "This model was a little bigger and taller than I expected, and it can suit 1-2 people, maybe 3 if you want a portable model. I'm using it practically every day for a variety of foods. If you have soups or greasy foods I suggest you get a tinfoil container (from any dollar store) to fit inside the basket. I also bought a backup pack of the little rubber grips that hold the inside panel. This model is easy to use with a knob controlling temperature and time. Just make sure to unplug the air fryer when not in use! I also recommend that if you have shelves above the air fryer to angle it away from the shelves (when cooking) as it does blow out hot air through the back. However, using the air fryer definitely creates less heat in the room compared to an oven or gas stove. So far, I've cooked vegan meats, samosas, potatoes, veggies (in tin foil), soup (in tin foil, toast, pakoras, frozen meals, dumplings in water in a tin, and corn cobs. I especially love making toast so easily using the air fryer. It's easy to wipe down the fryer, and to wash the basket and inside panel. As additional information, I researched before I bought as I needed a good quality but lower wattage fryer for an old house with old wiring and so far so good!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tonio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 15, 2023",
                "reviewTitle": "Muy útil",
                "reviewText": "Lo obsequié a un familiar pero se que lo usa bastante y está muy contento, pues le permite hacer variantes en la forma de preparar muchos alimentos, muy práctica y sencilla.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rob Nelson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 23, 2023",
                "reviewTitle": "Chefman Operates for a Long Time",
                "reviewText": "This appliance is worth the money I paid; cooking with it twice, sometimes three times a day. Convenience.After 15 months, I notice it is taking longer durations to cook the food Items I used to cook successfully by half the time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}