{
    "remaining_requests": 33743,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ninja-SFP701-Multicooker-Functions-Accessories/dp/B0C8WN349L",
    "body": {
        "name": "Ninja 14-in-1 Multicooker, Oven & Air Fryer, 15-Min Meals, 3 Accessories, Auto Menu, Timer, Shut-Off, Grey",
        "price": "$229.99",
        "originalPrice": "$229.99",
        "rawPrice": 229.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ninja-SFP701-Multicooker-Functions-Accessories/dp/B0C8WN349L",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $34.50 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Fv7R5VoHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/615917yu7xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AjVspcnRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BcznSU CL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61SHo3HQhVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wkGL6OgkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/715nLY5FqRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ninja Store",
            "link": "https://www.amazon.com/stores/Ninja/page/4D837C13-1334-44EE-AD50-9586EE0F3873?ref_=ast_bln"
        },
        "brand": "Ninja",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 354,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 2 hrs 48 mins",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "14-in-1 VERSATILITY: Combi Meals, Combi Crisp, Combi Bake, Rice/Pasta, Sear/Sauté, Steam, Bake, Toast, Pizza, Slow Cook, Proof, Sous Vide, Air Fry, Broil.",
            "COMPLETE MEALS THAT COOK IN 15 MINS: Cook your proteins, veggies, and pasta or grains all at the same time and make a meal 50% faster than in a wall oven.",
            "ONE STOP SHOP IN YOUR KITCHEN: With its all-in-one functionality and included accessories, the Ninja Combi is the only appliance you will ever need—no more cluttered countertops and endless piles of dishes to clean afterward.",
            "EASY CLEANUP: The Combi Cooker Pan doubles as a serving dish and all accessories are dishwasher safe to make cleanup a breeze.",
            "NINJA COMBI COOKER TECHNOLOGY: HyperSteam and Air Fry combine to create juicy insides and deliciously crispy outsides all at once; super-heated steam evenly cooks and locks in juices while rapid cyclonic air crisps food to perfection.",
            "FROZEN TO TABLE IN UNDER 30 MINUTES: No need to defrost—super-heated steam will quickly thaw frozen ingredients and cook them to a safe temperature in under 30 minutes.",
            "FAMILY-SIZED CAPACITY: Perfect for large families or entertaining—feeds up to 8 people and fits 1.5 boxes (24 oz) of pasta, 4 cups of dry rice, a 6-lb roast chicken, 2 lbs of fries, a 10-inch pizza, or a 5-lb top round roast.",
            "WHAT’S INCLUDED: A countertop multicooker, Combi Cooker Pan, bake tray, crisper tray, and recipe book with 20 chef-created recipes and cooking charts."
        ],
        "description": "Meet the Ninja Combi—the only all-in-one multicooker, oven, air fryer and so much more that perfectly cooks complete meals for your whole family in just 15 minutes. With 14 functions and 3 included accessories, it’s so easy to use you will never have to turn on your kitchen again. A complete pasta dinner made from scratch in an oven without having to boil water? A full taco spread, including rice and beans in one single appliance? The Ninja Combi makes it all possible with our revolutionary Ninja Combi Cooker Technology that defies limits with a simultaneous combination of HyperSteam and Air Fry. Every ingredient is perfectly cooked in minutes—juicy on the inside, crispy on the outside. It’s the most effortless way to cook—the Combi Way.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Ninja"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Product Dimensions",
                "value": "14.92\"D x 15.43\"W x 13.11\"H"
            },
            {
                "name": "Special Feature",
                "value": "Auto Cook Menu, Timer, Automatic Shut-Off"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Combi pan, Ninja Multicooker, Bake tray, Crisper tray"
            },
            {
                "name": "Model Name",
                "value": "Ninja SFP701"
            },
            {
                "name": "Finish Type",
                "value": "Painted"
            },
            {
                "name": "Item Weight",
                "value": "20.2 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Ninja"
            },
            {
                "name": "ASIN",
                "value": "B0C8WN349L"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "SFP701"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 354 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,107 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #55 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "September 17, 2023"
            },
            {
                "name": "Capacity 10 Cubic Inches",
                "value": "Wattage 1760 watts"
            },
            {
                "name": "Material Plastic",
                "value": "Item Weight 20.2 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page 1 14-in-1 Functionality 2 Combi Meals 3 Combi Crisp 4 Combi Bake 5 Air Fry & More",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page 1 How it Works 2 Never Defrost Again",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page 1 XL Capacity 2 Families & Entertaining",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8871dad4-7822-451d-a762-4a729b901c4c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ff794cb-5fed-42d5-b262-5b8fa1d35ee3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7d5b1da0-695a-4461-90db-5a9c29545f2d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c269dd0-1740-4c60-9130-0e5faee41369.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/801388b1-1ab0-4b63-bf58-965cee8135b8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8dc8d8a1-fbe2-41aa-9f16-9cab5fe05dca.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a868587-a592-4c0f-92e2-bc6e554a6dc5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ec6891b5-1f21-4adf-8069-63ea070a82e0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b152f23-1332-4949-ae28-303174b275bd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/54e8b828-1f0b-4158-8663-4cc21c6ef964.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9d3dc595-5795-47b0-a605-ec77bded28cc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a6845ab-7e22-4d6b-873e-3e3525b0def9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Scott F",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE34PQGTDQXFUGK46G4YUNEJAA4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QR6CINLI0LKX?ASIN=B0C8WN349L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Pretty easy to use, but limited recipes.",
                "reviewText": "So far 5/6 meals made have been good. Probably the best rice I've ever seen a machine make. Plus the steam setting makes it easy to clean after preparing a meal. This doesn't replace a seasoned toaster oven. But if your in a 500sqft S'Box apartment, with limited space, it can help you save space. It's an air fryer, toaster, toaster oven, rice maker, sous vide, and broiler all in one.As a side note: There's another combo cooker we'll call the Suvie. Which wants to charge you $500 plus a forced meal plan. This unit is far less expensive and has the same functionality. With the exception of being a refrigerator. Plus you get to choose your quality ingredients. Instead of getting mystery food in a bag. Since the Combi is new there's limited recipes out there. BUT the booklet does give you some clues on how to do things. You can go to a Suvie blog and kinda guess how to do them with the Combi. So expect a learning curve.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike Vande Ven Jr.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE44V2YPE5L3744VKGQLYXRFIZTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LHIY0T40MOGR?ASIN=B0C8WN349L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars A great tool for my kitchen to save electricity and time",
                "reviewText": "I cook a lot of things in the oven. I would rather take 30 minutes to get something that tastes good with better texture than a couple minutes in the microwave. This means that on a nearly daily basis I’m dealing with long preheat times, and a running fan after the oven is off to disperse the heat. I wanted something that could take the place of the oven for many meals, and also I wanted to dip my toes into the air fryer world.Happy to report that after using this for about a month, the Combi has done just that. I use it to bake things more often than I air fry, and I rarely use the combi bake/crisp features. But here are my thoughts on each.Baking is super nice because the preheat is around 2-3 minutes. Compare that to 10+ minutes for the oven. I do find that I need to decrease the temp about 25F from what is indicated on the recipe/box of the food. This is probably because of the small space. If I don’t do that, the food has a tendency to get a bit overdone.Also, for food capacity while baking, it’s pretty good. I am at home with myself and three kids, and I can often make all the food we need. Plus, if you ever get those Detroit style frozen pizzas, they fit perfectly in the back tray!Air frying is so fantastic! I love the crispiness. I love the taste. Best at home chicken wings I have ever made. And I love to use it for seafood, nuggets, etc.The combi bake and crisp continues to confuse me. I have used it, but I’m always guessing at temperature and time. I did make some sausages recently on the combi crisp. The insides were juicy and tender while the skin had a very slight crisp to is. So that was cool. But when I tried veggies and chicken in the combi bake, the chicken was awesome, but the veggies were soggy. The combi features are going to need a while to get used to.Overall, this is a really great purchase, and had made meal time more efficient and sometimes tastier.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Judy L.Judy L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHL7BB7GOOWFA773QUOELKNUIQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QIUHYSB3KVLS?ASIN=B0C8WN349L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "5.0 out of 5 stars A great upgrade from the Ninja Speedi. More versatile and easier to use.",
                "reviewText": "I am a Ninja fan and have, or have had the majority of their products. I also tend to research their products before I buy them in an effort to avoid duplication of functionality. I did buy the Ninja Speedi thinking it would be nice to cook a couple of foods at one time. I did use the Speedi a couple of times. Once to steam and crisp a whole chicken and once to air fry French fries. Both came out very well. The problem I had with the Speedi was that cooking two foods required one to be below the other and there was no way to monitor each food being cooked, and there was too much trial and error.This Combi oven is basically an upgraded Speedi cooker that is much more versatile and, in my opinion, easier to use. It has the same functions and settings as the Speedi, but the ability to open a door on the front presents a whole new world of possibilities. I have used this cooker a few times since I got it and have not yet explored all the possibilities.So, what do I love about this cooker/oven.1) It opens from the front and has a window to view food as it cooks.2) The steam and crisp function should be called a steam and brown function. I have used this function to reheat meats, such as leftover roast, chicken, etc. that had been frozen and thawed. The steam keeps the meat moist, and an external thermometer keep it from being over cooked.3) It works great as an air fryer as did the Speedi.4) The steam and crisp works as well as my more expensive Anova oven to cook leftover meats and fish filets. For this, I use a Meater thermometer to monitor internal temperature.5) This oven is large enough to cook a 5 lb. chicken using the steam and crisp. For this purpose, an external thermometer should be used as the suggested times in the manual tend to overcook the chicken.6) Other than taking 7 minutes to build steam for the steam and crisp function, this oven does not require preheating.7) What I have cooked in this oven so far is done surprisingly faster than in my other ovens.8) The ability to reheat proteins, full meals, and casseroles without drying them out or changing the texture of the food is worth it's weight in gold.As with most new cooking appliances, there is a learning curve. Getting recipe ideas from the provided recipe book is a good way to get familiar with the capabilities of the Combi Oven. It should also be noted that recipes for the Speedi will work as well in this oven. Once you become familiar with this oven, it becomes easier to plan your own dual level meals.Overall, I very much like this cooker over the Speedi and would recommend it if it supplies the functions you need. I will update this review if my opinion changes, and hope this review was helpful for you.",
                "reviewVotes": "168 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/616HnpEf10L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61eySZArTjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61o3mw5a-qL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71TqIZj9qlL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "KathyKathy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVENBJCB4ZK2ZV4QZOR6U3IDLXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO6YAFNMKF92A?ASIN=B0C8WN349L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect kitchen tool",
                "reviewText": "This Ninja Combi Cooker is amazing! This is definitely the best kitchen tool I’ve ever bought. It is so versatile and you can do so many different foods. I love that I can have an oven, toaster over, slow cooker and airfryer all in one. I really like it’s compact size because I can easily place it on any corner on my kitchen cabinets. It is easy to clean and use. Definitely a great inversion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71okB2OLSJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zprfubyHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Simón zetina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 11, 2024",
                "reviewTitle": "Perfecto para cualquier familia",
                "reviewText": "Tiene un tamaño perfecto para cualquier cocina además de ser preparar comidas deliciosas en muy poco tiempo, un punto en cronta es que al ser un producto que aún no llega al mercado mexicano las recetas suelen ser escasas, fuera de eso sin duda de los mejores dispositivos de cocina que he tenido la oportunidad de poseer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Enrique",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 1, 2023",
                "reviewTitle": "Buen producto, maltratado en el envío",
                "reviewText": "Calidad, es un ninja ! Respecto el envío llegó en caja muy maltratada y el ninja estrellado de una esquina",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$227.95",
                "sellerName": "ARAS Mart",
                "sellerRating": "4.5"
            }
        ]
    }
}