{
    "remaining_requests": 33584,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Kalorik%C2%AE-Countertop-Combo-21-Accessories-Cookbook/dp/B0872DQV7Z",
    "body": {
        "name": "Kalorik MAXX® Digital Air Fryer Oven, 26 Quart, 10-in-1 Countertop Toaster Oven & Air Fryer Combo-21 Presets up to 500 degrees, Includes 9 Accessories & Cookbook",
        "price": "$220.00$198.00",
        "originalPrice": "$220.00",
        "rawPrice": 220.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Kalorik%C2%AE-Countertop-Combo-21-Accessories-Cookbook/dp/B0872DQV7Z",
        "soldBy": {
            "sellerID": "AARE9XK4E62SZ",
            "name": "Simple Works",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AARE9XK4E62SZ&asin=B0872DQV7Z&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "15",
        "stockDetail": "Only 15 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41rEqHsjqbS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/519q31jBJ6S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415zQdzoavL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qgOzdXOMS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A124qV0e9gL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1JYgCabsDL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91CVsflY0FL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Kalorik Store",
            "link": "https://www.amazon.com/stores/Kalorik/page/C21CA04A-A07B-49FC-83BB-784BD382703D?ref_=ast_bln"
        },
        "brand": "Kalorik",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 11768,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 21 - 23.",
            "FREE delivery Sunday, February 18. Order within 2 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "COOK MEALS FASTER WHILE SAVING ENERGY — Experience ultra-fast cooking performance and prepare full meals in just a fraction of the time! New Powerful Turbo MAXX Technology cooks French fries up to 22% faster, steak up to 37% faster, and chicken up to 27% faster, and saves consumers over 77% in energy than traditional ovens",
            "ONE APPLIANCE TO REPLACE THE REST — This 10-in-1 meal-making powerhouse can air fry, bake, toast, roast, rotisserie, braise, sear, dehydrate, broil, and warm meals at the touch of a button — giving you everything you need in a single appliance",
            "CHOOSE FROM 21 SMART PRESETS — Ready-to-cook meals, at the touch of a button. The intuitive digital interface offers 21 presets for a wide variety of menu options, delivering flawless results every time for deliciously crispy French fries, onion rings, chicken wings, shrimp, steak, wings, vegetables, and much more",
            "PREPARE FAMILY-SIZED MEALS — Great for families and multi-person households, the MAXX features an extra-large 26-quart capacity and multiple rack levels which let you cook several different foods at a time, and prepare large, family-sized meals. The MAXX can fit a 14-pound turkey, 12-inch pizza, or up to 9 slices of toast in its cavity. Oven is 17.2 lbs",
            "ENJOY 9 DO-IT-ALL ACCESSORIES — MAXX-IMIZE your cooking possibilities! A versatile collection of accessories includes an air frying basket, baking tray, air rack, crumb tray, bacon tray, steak tray, rotisserie spit & forks, rack handle, and rotisserie handle. Plus, a bonus cookbook featuring a diverse assortment of easy-to-follow, chef-inspired recipes"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Kalorik"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "12.5\"D x 15.75\"W x 14\"H"
            },
            {
                "name": "Special Feature",
                "value": "Temperature Control, Timer, Automatic Shut-Off"
            },
            {
                "name": "Control Type",
                "value": "Button Control"
            },
            {
                "name": "Door Style",
                "value": "French Door"
            },
            {
                "name": "Included Components",
                "value": "1 x Rotisserie spit and forks, 1 x Rack handle, 1 x Air Fryer Oven, 1 x Air frying basket, 1 x Baking tray, 1 x Air rack, 1 x Crumb tray, 1 x Rotisserie handle, 1 x Bacon Tray x 1 x User Manual"
            },
            {
                "name": "Model Name",
                "value": "Kalorik MAXX® Digital Air Fryer Oven"
            },
            {
                "name": "Finish Type",
                "value": "Stainless Steel"
            },
            {
                "name": "Item Weight",
                "value": "17.2 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Kalorik"
            },
            {
                "name": "ASIN",
                "value": "B0872DQV7Z"
            },
            {
                "name": "Item model number",
                "value": "AFO 46045 SS"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 11,768 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#58,191 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #208 in Air Fryers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "April 7, 2020"
            },
            {
                "name": "Capacity 26 Quarts",
                "value": "Wattage 1700 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 17.2 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Easy to Use Whether your culinary skills are advanced or novice, the MAXX is intuitive for all home cooks to use. It boasts a bright, easy-to-read LED display with intuitive digital controls that let you quickly adjust time and temperature, or choose from 21 smart presets which take the guesswork out of cooking. MAXX - Made Meals in Minutes With superior Turbo MAXX Technology and 1700 watts of power, the Kalorik MAXX 26 Quart Digital Air Fryer Oven makes gourmet home cooking fast and effortless, preparing hearty, home-made meals in a matter of minutes. Modern French Doors The MAXX features sleek glass French doors with a single-hand opening system. This modern and functional design helps to prevent dripping or scalding, keeping your oven doors clean and protecting you from heat hazard.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02dae260-d374-45d5-ac1d-dcbeb91762f4.__CR0,0,2100,2100_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b38bf9a1-6b4c-47de-94c8-5b52032a8b35.__CR0,0,2000,2000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2820af57-2a95-4b87-85d8-f71991783ff0.__CR1165,364,3636,3636_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Transform Yesterday’s Leftovers Skip the microwave, and reheat last night’s dinner in your MAXX. Whether it’s fresh, frozen, or simply takeout or leftovers you’re reheating, the MAXX cooks’ food to crispy, golden perfection in minutes, transforming soggy leftovers and frozen foods to restore freshness and crunch, far better than a microwave. Golden Caramelization Create a perfectly brown finish on your meat, fish, and vegetables, and prepare juicy, succulent steaks that sizzle, as the MAXX reaches up to 500°F, allowing you to achieve pan sear-style caramelization with restaurant-quality results. Indulgent Fried Food, Guilt-Free Enjoy the same crispy texture and rich flavor of deep-fried food, without the guilt! The MAXX crisps food with hot air instead of oil, so you can enjoy healthier versions of your favorite fried classics, without the added fat and unwanted grease.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4143aa79-0378-441c-bdf3-c27c89c96c2f.__CR0,0,800,800_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca395722-e345-44cd-9660-1db8bbda5afa.__CR0,0,2100,2100_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8f2c6c4f-6b9f-4c24-8ca4-af44a6055d8f.__CR312,435,1429,1429_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/356439b3-4bc5-4683-b739-39fc49932085.__CR36,632,4000,1237_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96fa80c6-b9a5-4242-8cbb-1a0bdcbd7f4f.__CR209,0,1688,1044_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02dae260-d374-45d5-ac1d-dcbeb91762f4.__CR0,0,2100,2100_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b38bf9a1-6b4c-47de-94c8-5b52032a8b35.__CR0,0,2000,2000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2820af57-2a95-4b87-85d8-f71991783ff0.__CR1165,364,3636,3636_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4143aa79-0378-441c-bdf3-c27c89c96c2f.__CR0,0,800,800_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca395722-e345-44cd-9660-1db8bbda5afa.__CR0,0,2100,2100_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8f2c6c4f-6b9f-4c24-8ca4-af44a6055d8f.__CR312,435,1429,1429_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8139939e-28d9-4a9d-aca6-0c3a247e7eb4.__CR0,0,1500,464_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/70d2172a-5df1-4b3e-94ae-c82803d6a8da.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jiri HerrmannJiri Herrmann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCCEDPICMFLTTA6JH37KU7T6T6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R335W1MVEV117O?ASIN=B0872DQV7Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 29, 2021",
                "reviewTitle": "5.0 out of 5 stars One of our best pandemic purchases, even with its flaws, it is amazing!",
                "reviewText": "The media could not be loaded. I promised myself if it lasted 6 months I would write a 5 star review and if it lasted less than 6 months I would write a 3 star review (less review). The thing is; the doors don't close completely due to what looks like bad fit and finish, one of the trays is a little too big - keeping the doors open even more. Had it not been for the pandemic I would have probably returned it without even plugging it in, but... we are so happy with how it works, how it cooks and the results. It has lasted 9 months to date with little sign that it won’t go for several years or more.This is my first air-fryer, but it completely checks the boxes of being able to make fries, onion rings, chicken wings the best. So good that fast food fries directly from the take out window taste sad and soggy compared to the crisp clean fries I get from this thing. That’s no exaggeration; after about 6 months with no fast food and cooking all meals at home due to some issue in 2020 I finally had my first big Mac and fries and the big Mac was ok and the fries just seemed soggy. I went back a week later and found similar results. I think I just expect more from fires now.I bought the largest air fryer I could find, for the rotisserie and it checks that box (it has flaws, more about that below). But the three hidden gems are, cheese toast, hot dogs / sausages and reheating bread from the refrigerator. It cooks these three things so much better than any other device that it is worth having just for those three things.So... I'm writing a five star review for a contraption that has flaws. You want to know the flaws and decide for yourself if it is worth your money. That’s why you are reading this super long review:1. The selector dial is super sloppy (I saw this in other reviews and I am reiterating they used a super cheap part for the dial). I waited over 6 months to write this review as I assumed it would break and I did not want to write a good review for a piece of junk. It has not broken and it has not gotten worse. I therefore concluded it is not a piece of junk, just a flowed device.2. It gets very hot and moves a lot of air. Hey, that is why you are looking at this one in the first place.! But the sides get too hot for me to put it near a wall and it blows so much hot air out the top back area I did not feel it was safe to run it under a cabinet.As a side note, much of the casing is cool to the touch, but some of it does get hot. My concern was trapping hot air. With nothing to cool my walls and 15 minutes of hot air, I was worried. I thought it would heat up the shelf above and with hot air rising and this thing producing a lot of hot air I worried it would damage the paint or even catch the kitchen on fire. I ended up moving it to an island location with nothing above it.3. The doors are very sloppy and do not really close all the way. Like the dial this is an unforced error that could be avoided by better build quality. But... this thing moves a lot of air and has louvers to draw air into it. The gaps on the front just contribute to the louver area and therefore do not detract from its actual function. Also, like the dial issue, I wanted to wait before writing this review to see if the door hardware would get worse. It did not.4. Two of the trays came with dents and the protective coating was damaged. This annoyed me, but not as much as the fact that one of the trays (the drip tray / baking tray) also does not completely fit inside the oven. It holds the doors open. How this sort of oversight is even possible is just really odd. I know from reviews other people have received ones with poor workmanship and many received them with no issues. I have to overlook this issue because I like the rest of what this does. You may feel otherwise.5. The loud beeping. It beeps, you will notice the beeping.6. The rotisserie setup has two design annoyances. The spit has a square end instead of a pointy end. good luck getting it to go through a chicken. I have a rotisserie rod from a broken machine that I use to pre-drill my food because this one is just too blunt. The end caps are tricky to get onto the spit. They hold very well, but these two flaws make the rotisserie process cumbersome.7. One more item of note regarding the rotisserie, unless you perfectly balance your chicken and tie it up really well, this machine does not fit a large frying chicken and only a small one will fit using the drip tray. Some tinfoil magic will need to be done at the bottom otherwise you will have chicken schmaltz leaking out the bottom of the machine. This happened once and it was not so fun to clean up. On the plus side, the rotisserie is strong enough to move unbalanced food and has good controls for stopping and reversing and the oven light works well to see inside.As I said at the top, this is my first air fryer so I don't really know if it is the best one or the worst one. It is a vegetable monster making tasty (and healthy) side dishes really easy, it does the frying thing super well and with the glass front lets you really dial in the browning on things like chicken wings. For making things like cheese toast or garlic bread this thing is just perfect. On the rotisserie I have done a tri-tip roast, a turkey breast and many chickens. For quick indulgence, this thing will cook a tray of fries directly from a frozen bag, a hot dog and then warm a hot-dog bun when placed in the last minute all at once. That's a whole meal with every item being cooked better than any other method I have ever used. Did I mention how well it cooks cheese toast?I begrudgingly give this thing five stars and would willingly pay about 50% more for one that has a build quality of a high end appliance and real stainless steel. And that is the story, I find the $199 a good value for this product as it sits today. We have purchased a number of cooking items and gadgets over the last year just to keep the mailman employed and to balance our own sanity. This thing gets used nearly every day for some task or another and deserves a good review despite itself.",
                "reviewVotes": "232 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71ahHpqCDIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71cTLQZoV9L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71k2vZ-mX2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/819dJxcp2RL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4fe6f91-bb15-4ef9-880a-8bc0857b8e7c/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Alex BAlex B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7DF25AWQT4AFIEJUYYVPIHWX6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1URF7QUKV1R0D?ASIN=B0872DQV7Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2020",
                "reviewTitle": "5.0 out of 5 stars Tasty air frying and easy cleanup!",
                "reviewText": "I had a smaller air fryer and it lost its interest to me after a few uses because it was so small. This air fryer has been used for several meals in the two days I've had it!I made some awesome pork chops and on the air fryer function it only took about 12 minutes. They came out moist and delicious and fast! I also used the air fryer for some asparagus, and the best part was I was able to get a little char on the asparagus like if I had done it on an outdoor grill.I have some thick cut bacon in there right now. I adjusted the time on the bacon air fry setting to go two extra minutes because the bacon is thick (and I like bacon crispy anyway!) I was surprised at how easy it is to adjust the time and temp on the cooking presets. The instruction manual is very clear and easy to follow.I'm really pleased with how easy cleanup is. After the pork chops, there were drippings that charred and burned to the bottom of the drip pan. I thought I was going to have to get out some oven cleaner or something, but the charred residue just slid right off! And cleaning the inside of the oven after cooking was really easy, all the surfaces are flat and easy to reach (aside from the coils, obviously) so I'll be able to keep the oven looking good!I'm excited to try onion rings and chicken wings this weekend (The oven came with a recipe book and the recipes look pretty good!!)Pros:- Easy cleanup - dirty parts are dishwasher safe (save for the crumb tray, hand wash only according to the manual)- Presets are very handy and accurate! Also easily adjustable.- Instruction manual is easy to read and follow, with pictures and tips- The whole unit is a lot smaller than I expected, and that's a good thing! Its capacity is pretty large, and the whole fryer fits on my countertop under the upper cabinets. I was worried it might not fit, but it does!Cons:- The handle that comes with the fryer to handle the pans is a little difficult to handle at first, but it's useful for pulling the trays out of the fryer.- Not really a con, some things can cause a little smoke in the oven, like drippings left in the drippings tray, so be prepared for some quickly dissipating smoke in some cases.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41Xxg7uO+FL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71weF5AeJcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jess",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 3, 2023",
                "reviewTitle": "Bonito práctico muy util",
                "reviewText": "Me encanto , Justo lo que necesitaba para facilitar la vida en la cocina .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DanielDaniel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 19, 2020",
                "reviewTitle": "Exceptional Air Fryer!",
                "reviewText": "I just got this air fryer and I’ll say I’m very impressed. The setup took 10 minutes to wash the parts, dry, and then plug it in and ready to go. It does require about 20 minutes “burn-in” to clean the inside on the steak setting, but the instructions were very clear as to what to do.This Air Fryer worked exceptionally well I baked trout and air fried brussels sprouts that came out so good my kids cleaned their plates!The fish setting had the ideal timing. The trout was cooked perfectly, it was cooked through but very moist and flavourful.. it’s easy to overcook fish so this was a welcome surprise as it didn’t require the normal attention to make sure the fish isn’t dry, just turn it on and go do something else until it’s done.For the Brussels sprouts I used the air fry setting and a little olive oil and the sprouts came out perfectly caramelized they were light, with much less oil than sauteeing, yet had great flavour. Again this was a set it and forget it scenario.All the parts came out of the machine easily and washed off perfectly no fuss or mess it was easier than using a pan.The only part I would warn about is that the glass doors and metal shielding get very hot. Make sure to keep little hands or big hands away from it. It is very clearly labeled where the hot parts are but kids and many adults don’t read labels so be aware of that.",
                "reviewVotes": "207 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71tE6bRVE9L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71E5WETyTsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71htxhuT2-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/816WRqHZwCL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debbie Kinney",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 11, 2024",
                "reviewTitle": "Love it!!!",
                "reviewText": "Very impressed, works fantastic and cleans easy. Everything cooked perfectly, it's amazing how much I use this in place of my conventional oven and toaster. Great value, highly recommended!!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerardo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 9, 2023",
                "reviewTitle": "Horno kalorikmaxx",
                "reviewText": "Llevo poco mas de un mes de uso y funciona muy bien, eso si hay que aprender a utilizarlo en ensayos de prueba y error pero dominado es muy buen articulo para librarte de las grasas.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eunice Gandara Iglesias",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 17, 2023",
                "reviewTitle": "Freidora maxx kalorik",
                "reviewText": "Es muy completa hace todo para cocinar facilidad de uso de buena capacidad",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$228.95",
                "sellerName": "617Sellz",
                "sellerRating": "4.5"
            },
            {
                "price": "$229.99",
                "sellerName": "Bomb Brands ✔",
                "sellerRating": "4.5"
            }
        ]
    }
}