{
    "remaining_requests": 33782,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ninja-Dehydrate-Indoor-Electric-AG301/dp/B07S76WBGF",
    "body": {
        "name": "Ninja AG301 Foodi 5-in-1 Indoor Electric Grill with Air Fry, Roast, Bake & Dehydrate - Programmable, Black/Silver",
        "price": "$149.99",
        "originalPrice": "$169.99",
        "rawPrice": 149.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ninja-Dehydrate-Indoor-Electric-AG301/dp/B07S76WBGF",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09Y9NRH9X"
        ],
        "asinVariationValues": [
            {
                "asin": "B07S76WBGF",
                "variationName": "Color",
                "variationValue": "Black/Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41jpMWN5tuL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Stainless",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41BqotCu4BL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41jpMWN5tuL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51OaB0TjmQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51p7rXwg9bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OZAqAkibL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DKNU7sCuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51aM99TremL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/611w3P3bLRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ninja Store",
            "link": "https://www.amazon.com/stores/Ninja/page/4D837C13-1334-44EE-AD50-9586EE0F3873?ref_=ast_bln"
        },
        "brand": "Ninja",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 31236,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 2 hrs 55 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "THE ORIGINAL NINJA FOODI GRILL: The grill that sears, sizzles, and air fry crisps. Indoor grill and air fryer.",
            "CYCLONIC GRILLING TECHNOLOGY: Uses 500°F cyclonic air to perfectly cook or char grill your food to your desired doneness on the grill grate for delicious, char-grilled marks and flavors.",
            "OUTDOOR GRILLING POWER ON YOUR COUNTERTOP: With the BTU cooking power of an outdoor grill, it brings outdoor grill flavors conveniently to your countertop any day of the year.",
            "FORGET ABOUT DEFROSTING: Transform foods from frozen to perfectly char grilled in under 25 minutes.",
            "UP TO 75% LESS FAT: Air fry crisp with up to 75% less fat than deep frying (tested against hand-cut, deep-fried French fries), using the included 4-qt crisper basket.",
            "EASY TO CLEAN: PTFE/PFOA-free, nonstick ceramic-coated grill grate, crisper basket, and cooking pot are dishwasher safe.",
            "WHAT’S INCLUDED: Ninja Foodi Grill, 10\" x 10\" Grill Grate, 4-qt. Crisper Basket, 6-qt. Cooking Pot, Chef-Created 15-Recipe Book & Cleaning brush. Unplug the unit from the wall outlet before cleaning. Keep the hood open after removing your food so the unit will cool down more quickly"
        ],
        "description": "Meet the Ninja Foodi Indoor Grill. The grill that sears, sizzles, and air fry crisps. With unique Cyclonic Grilling Technology, 500F rapid cyclonic air circulates around food for amazing Surround Searing, while the 500F high-density grill grate gives you delicious char-grilled marks and flavor virtually smoke-free. It's also an air fry crisper, allowing you to enjoy guilt-free fried food.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Indoor Grills & Griddles",
                "link": "https://www.amazon.com/Electric-Cookware/b?ie=UTF8&node=289919"
            },
            {
                "name": "Electric Grills",
                "link": "https://www.amazon.com/contact-grills/b?ie=UTF8&node=289925"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Ninja"
            },
            {
                "name": "Product Dimensions",
                "value": "14.9\"D x 14.9\"W x 11.02\"H"
            },
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Color",
                "value": "Black/Silver"
            },
            {
                "name": "Fuel Type",
                "value": "Electric"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Roast, Bake"
            },
            {
                "name": "Finish Type",
                "value": "Non-Stick"
            },
            {
                "name": "Included Components",
                "value": "1760-watt unit, Chef-created 15-recipe book, 4-qt PTFE/PFOA-free, nonstick, ceramic-coated crisper basket, 6-qt PTFE/PFOA-free, nonstick, ceramic-coated cooking pot, Cleaning brush, 10 x 10 PTFE/PFOA-free, nonstick, ceramic-coated grill grate"
            },
            {
                "name": "Assembly Required",
                "value": "No"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Item Weight",
                "value": "14.5 pounds"
            },
            {
                "name": "Model Name",
                "value": "Ninja AG301"
            },
            {
                "name": "Frame Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Installation Type",
                "value": "Countertop"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Wattage",
                "value": "1760 watts"
            },
            {
                "name": "Manufacturer",
                "value": "SharkNinja"
            },
            {
                "name": "ASIN",
                "value": "B07S76WBGF"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "AG301"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 31,236 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,377 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #5 in Electric Contact Grills"
            },
            {
                "name": "Date First Available",
                "value": "July 26, 2019"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d9610c75-cf70-47b7-b1a9-9145ed80e592.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dc942418-2fbd-49b5-907b-9192d68ac61b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/117071b9-0653-4b3a-b386-40a6512dec26.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/87053e1c-2c80-4e4f-acf6-5249915d0219.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/84c67ce4-5c10-40a4-86e4-b2a13f4b9d39.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/11f495e8-b44c-4735-8d96-9f0e9d271aca.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2d05c147-c0e0-4000-8d55-4fd54a188431.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a45d3a0d-1bd8-4aa5-9de9-e80797b37085.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8643205b-1c62-43f3-82d6-10c9c5370b1f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a377e90-81cd-4b9d-9246-68526755c3d0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7a988d56-4e1d-45fd-824d-978304a4f1f3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nick/Trilkin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZZVCQSHEKJAEHU7BQPKTLGWZBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37XK3PLTUVPAS?ASIN=B07S76WBGF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 22, 2022",
                "reviewTitle": "5.0 out of 5 stars Understand what you're getting, and adjust accordingly.",
                "reviewText": "tl;dr: Good device. Worth getting in place of a normal air fryer due to its greater flexibility. It is, however, still a convection device. Keep in mind when cooking things.This is a first impression so far only using it to cook a few things so far, but my experience has been great - if with a few caveats. For full disclosure, I bought this with my own money and while it was about $30 off. I received what appeared by all accounts to be a brand new unit with that new appliance smell, complete with burning off excess plastics on first use.First things first: this is a fancy convection oven. It's a convection oven that gets to very high temperatures and has very strong air circulation, but it is - ultimately - a convection oven. Unlike a proper grill, this has a fan that is constantly circulating air which means it will cook things faster. Keep this in mind when using it and make adjustments to prevent overcooking your food. As a general rule, the recommended times that come with the device are to make something Well Done. For this purpose, they're accurate, but you probably will want to cut a few minutes off of those times for anything less than that.The device itself is straight forward to use. It has fairly standard oven/air fryer controls, but arranged a little differently. There are different functions that effectively change whether the air circulates in the unit or not, and there are macro temperature controls (low, med, high, max) that can be fine tuned from there. Time is only in intervals of whole minutes, which is slightly inconvenient, but Fine.When initially starting up and preheating, this thing is fairly loud. It doesn't stay loud for long, but can probably wake up a light sleeper in a small apartment. Probably not a huge issue, but one to be mindful of when using for the first time.I've cooked london broil and salmon with this using the Grill option (regular circulation) with the recommended temperature settings (High and Max accordingly.) As I mentioned before, be mindful of how much you want to cook something. The recommended settings always err toward Well Done. As an example: in the case of salmon, I cooked it for eight minutes the first time and it was just a touch more cooked than preferred. At seven minutes, it was perfect.As for the steak, don't make the same mistake I did the first time and keep opening the grill if you have a standard meat thermometer. All of that hot air is just going to escape and it'll take some time to get back up to temperature again. In my case, I was too paranoid about the doneness of the steak that I ended up slightly overcooking it (medium-well instead of medium-rare) due to having to bring the unit back to temperature in order for it to cook the center properly. In short: get a quick read thermometer, or just follow the guide line of shaving a minute or two off of recommended cook time based on desired doneness.As for the results, they still tasted great. The grill surface does get hot enough to make a nice sear into the meat. Like any convection oven, the circulating air keeps the food from drying out and the cuts of meat were left very juicy and tasty.Cleaning is easy for as long as the ceramic coating lasts. This is the same caveat as literally anything with a Teflon (or similar) coating. If you're especially paranoid, let everything soak in soap+water before cleaning it off. The brush it comes with does the job, but any sort of dish scrubbing brush (NOT WIRE PADS) should be just as good.Overall, my first impressions of this appliance are great. It is far easier, quicker, tastier, and more convenient than frying off or sticking something in the oven to broil. My wife and I have replaced the air fryer in our kitchen with this since it serves both purposes. If anything changes, I'll update this review.Update: We’ve cooked a larger variety of things including turkey legs, hamburgers, smaller wings and so on. Everything remains great. It’s been very easy to clean as well with no signs of chipping on the finish. I will say I do hand clean everything, but it shouldn’t make much difference in the dishwasher.",
                "reviewVotes": "476 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jean M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDISB5YQRW6YXQZSM525ODXNDVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SBG3E80GI47L?ASIN=B07S76WBGF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 4, 2021",
                "reviewTitle": "5.0 out of 5 stars customer service rocks!",
                "reviewText": "I don't like leaving a review until I've used a product for awhile and the design flaws and other problems have a chance to show themselves. How a company responds is so important. I did have a problem (more later) and it was quickly and efficiently resolved. I have been using this unit about once per week for 8 months.First - the product usability - I am not a great cook, nor do I care. I want simple, straight forward recipes, with ingredients I recognize, and if it has more than 5 ingredients (including salt and pepper) my eyes glaze over. So, obviously, I haven't tried most (any?) of the recipes that came with the unit. I bought this because of the Covid lock down. We were missing our weekly burger night at our favorite restaurant. It works great! My burgers on the outdoor grill come out like hockey pucks, but the Ninja ones are perfect! Easy, juicy, quick. 5 minutes, no flipping and cooks evenly. I also use it for fries and it works very well. I had to experiment with cooking times depending on the brand of frozen fries I buy, but no big deal. I don't use any oil with the fries, you are supposed to use some, but we like them not as crispy. I haven't cooked anything else in the Ninja.The thermometer probe - Don't waste your money. Maybe it's me, but I can't figure out a way to use it without burning myself. My meat thermometer works just fine. I do love that the top of the unit has a temperature chart - it's a little thing, but it is so convenient.Cleaning it - the grill insert is really kinda a pain, but, frankly, I think that is typical of any appliance with a grate. There is a brush provided that certainly helps, and I use a scrubbie too. The fry basket and the main pot clean up just fine - easy peasey.The problem I had - after several months the edges of the cooking pot started to flake off the nonstick coating. Even the cheap generic fry pans I bought decades ago when I first moved out on my own, didn't flake off that quickly. My daughter has had this same unit (without the probe) for over a year, using it several times a week, and has not had this problem. I took some photos, called the service number. No waiting in a queue (so no obnoxious, tinny music), the rep turned the call into a video call via a text message (I have no clue how he did it!) so I could show him the pot and the whole unit up close and personal. He immediately said that was not supposed to happen (I already knew that!), then said he would send me a new one and that it would would take up to 10 days. I don't think the call lasted longer than 10 minutes total. Unbelievably fantastic customer service - no fussin', no cussin' (not that I'd be cussin' anyway). The rep was wonderful, I did have a little trouble with his accent, but it's not like I can carry on a conversation in a foreign language, so props to him for that. I asked him just to slow down (everyone talks too fast for me) and enunciate a little more and he was very accomodating. We did fine. Unfortunately, when I tried to answer the survey at the end, the system didn't recognize my keypad responses, I think it might have been because of the type of call he used. I wanted to leave a positive response. Oh, well. Two days later - surprise! The new cooking pot arrived! Wonderful customer service.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jordi A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 13, 2023",
                "reviewTitle": "Excelente producto, nos gustó mucho",
                "reviewText": "Mi esposa y yo buscábamos la mejor opción para una air fryer, realmente es la primera que compramos, pero todo lo que dice en la descripción viene con el producto, realmente recomendamos esta marca y sobre todo este modelo, como dicen algunos comentarios hay que adecuarse a los tiempos y como te gusten los alimentos, pero en general para empezar tiene 4 funciones que solo hemos utilizado 3 por lo pronto, pero las 3 nos gustaron mucho, esperamos seguir comprando los accesorios para poder deshidratar pronto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hollie ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 11, 2022",
                "reviewTitle": "Great Quality",
                "reviewText": "I'm so happy with the Ninja Foodi 5 in 1! My meals have turned out perfect every time and it's so easy to use. So far I have used the Grill, Roast and Air Fry functions for pork chops, chicken, salmon and different vegetables. It's super easy to clean which is a nice feature. Now I'm wondering why it took me so long to decide to buy one! I would definitely recommend this product.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathleen Peck",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 18, 2024",
                "reviewTitle": "An air fryer that takes up little space.",
                "reviewText": "This Ninja Foodi is just the right size for seniors or smaller families. It is perfect for making meals quick and easily with clean-up made simply as well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Verduzco Carbajal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 19, 2023",
                "reviewTitle": "Ampliamente recomendable",
                "reviewText": "Sí te gustan las carnes asadas, este aparato electrodoméstico es obligatorio. Muy útil, prácticamente sin humo, facilísimo de limpiar, muy bajo consumo de electricidad y muy sencillo de operar.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janet Mary Crossfield",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 12, 2022",
                "reviewTitle": "DO NOT BUY THIS ITEM>",
                "reviewText": "Absolute rip off. Would never buy another Ninja product. Disgraceful. DO NOT BUY THIS ITEM. Tried all the convertors but blew electrics. Now have to pay the postage to return this awful product. Just disgusted with the product. Queried it with the sellers when I received it but just does not work properly in the UK even with convertors and just blew all the electrics. The convertor recommended does not work and is not the right one despite ensuring I ordered the right one. Wasted two weeks now for nothing. Never buying a Ninja product again because of this. Utter disgrace.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$169.49",
                "sellerName": "Jazzer Shack",
                "sellerRating": "5"
            }
        ]
    }
}