{
    "remaining_requests": 33766,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Compact-Electric-Temperature-Control-Feature/dp/B075BCVSJZ",
    "body": {
        "name": "DASH Compact Air Fryer Oven Cooker with Temperature Control, Non-stick Fry Basket, Recipe Guide + Auto Shut off Feature, 2 Quart - Aqua",
        "price": "$49.00",
        "originalPrice": "$49.00",
        "rawPrice": 49.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Compact-Electric-Temperature-Control-Feature/dp/B075BCVSJZ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07SR5WD84"
        ],
        "asinVariationValues": [
            {
                "asin": "B075BCVSJZ",
                "variationName": "Color",
                "variationValue": "Aqua",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31jrXSH9ZVL._SS36_.jpg"
            },
            {
                "asin": "B075BDY5WR",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/414WVv5mRxL._SS36_.jpg"
            },
            {
                "asin": "B077W6TX88",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41cjXx8WurL._SS36_.jpg"
            },
            {
                "asin": "B075BDW6DZ",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/416sb4HB2XL._SS36_.jpg"
            },
            {
                "asin": "B075BCTVPX",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41yxq2ZRl0L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41iaNRal4lL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41hsSp-I 6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51G8EnoL gL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51G87NB5UYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SNX gQnbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nAbbaPWPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61s5oFZmYcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the DASH Store",
            "link": "https://www.amazon.com/stores/DASH/page/F42BA37C-41D6-4B53-B178-A95B4E659D0B?ref_=ast_bln"
        },
        "brand": "DASH",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 16615,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 1 hr 53 mins",
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 1 hr 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "HEALTHIER FRIED FOOD: Dash Compact Air Fryer uses AirCrisp technology (instead of oil) to help reduce added fat by 70-80%, without sacrificing the flavor of your fried food (No more residual smell hours after you’ve eaten)",
            "QUICK plus EASY: Short on time. Simply load the 2 qt capacity fryer basket, set the temp, and set the timer. Your food comes out crispy, guaranteed, EVERY TIME. And in less time than it takes to pre-heat your oven, making it more energy efficient",
            "SAFER: The auto-shut off function prevents overcooking, and the cool touch housing and handle makes it easy to use.",
            "VERSATILE: This is the PERFECT appliance for picky eaters, large families, or those who have busy schedules. Appetizers to desserts, 1 dozen chicken wings, 1lb French fries, even baked goods, and all within minutes of setting the timer - it couldn’t be easier.",
            "COMPACT plus LIGHTWEIGHT: Half the weight of a standard fryer, the Dash Air Fryer is your MUST-HAVE for that first apartment, smaller kitchen, college dorm life, or camper/rv traveling. Plus, its sleek design and trendy color options will accent any kitchen space."
        ],
        "description": "Healthier fried food is here with the Dash Compact Air Fryer. AirCrisp® technology circulates air to cook food thoroughly without the oil and mess of a standard fryer, reducing added fat by 75% while keeping flavor. Simply plug in the fryer, set the time and temperature, and you’re ready to go! The Dash Compact Air Fryer is great for single serving meals, and can cook sweet potato fries, spicy chicken wings, vegetables, and more in less time than it takes to pre-heat your oven.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Product Dimensions",
                "value": "8.1\"D x 10.2\"W x 11.4\"H"
            },
            {
                "name": "Color",
                "value": "Aqua"
            },
            {
                "name": "Capacity",
                "value": "2 Quarts"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Bake"
            },
            {
                "name": "Output Wattage",
                "value": "1000 Watts"
            },
            {
                "name": "Item Weight",
                "value": "5.7 pounds"
            },
            {
                "name": "Brand",
                "value": "DASH"
            },
            {
                "name": "Wattage",
                "value": "1000 watts"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Model Name",
                "value": "Compact Air Fryer Oven Cooker"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Controller Type",
                "value": "touch"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Max Temperature Setting",
                "value": "400 Degrees Fahrenheit"
            },
            {
                "name": "Manufacturer",
                "value": "StoreBound"
            },
            {
                "name": "ASIN",
                "value": "B075BCVSJZ"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "DCAF150GBAQ02"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 16,615 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#19,801 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #87 in Air Fryers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "September 2, 2017"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "L. Demartin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGUK7ZPW2EI6XFKBPUJAOZXTLJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R344PZQ321ATTD?ASIN=B075BCVSJZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Fry healthier and less mess",
                "reviewText": "The Dash Compact is perfect for a single person. Low profile on a counter top, sufficient room for a burger, quiche, onion rings, bacon, chicken. So easy, so quick, and dishwasher safe. So little oil is used that it is good on the budget and the oil splatter. Wish I had bought it earlier!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "You Know My Name (Look Up The Number)You Know My Name (Look Up The Number)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4BVXJSYO5KMDLMMBPMXFKOAZ2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KJIYLFRZR52Q?ASIN=B075BCVSJZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Such a great little fryer!",
                "reviewText": "It’s perfect for making single serving meals and appetizers for two. It cooks evenly and I have just taken frozen fries, frozen tater tots, frozen buffalo chicken wyngz, and frozen mozzarella sticks, so far into the fryer. Straight from packaging to cooking and it’s easy. I usually cut the full cooking time in half and when it dings, I turn the items over. With fries, I shake them and “stir them” with tongs about 3 times during the cooking process. Everything turned out great. My guest was impressed with the mozzarella sticks in particular because they were perfect and without the grease.Cleanup is easy!It’s non-stick, if you didn’t read the description, and you just need to shake out crumbs before wiping with a soft sponge with soap and water. They recommend wiping the heating element off if grease or food gets stuck to it. The fan sits above the food, and the fan pushes the heat down to the food. So it’s not going to get dirty often unless someone overloads the basket. I keep it to one layer of chicken or mozzarella sticks, but fries take up more room.It’s fairly quiet, and certainly not noisy. You just hear the whole of the fan. It gets to peak heat within minutes and it has to be cheaper than heating a whole oven for one person to eat a meal or snack. I hate using the oven for something like fries or tater tots. It’s a waste of energy ($$$) for something so simple.One tip is to preheat the unit by running it for about 3 minutes before you put food in to cook. This way the energy used during cooking will go directly to your food rather than not be able to gauge how well the food is cooking. You’d have to preheat your oven for 5 minutes and it’s a much bigger use of energy.Those photos were not taken for this review. I just happened to have a few I took to send to someone when I was cooking dinner with it. So that’s from my first go-round.If you are cooking for more than one, then get something bigger, but if you’re cooking for yourself, then this will help you out nicely.",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710INn04MKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71NhtYxD2LL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71m49KJmfSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ttOkOvRPL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDBJWNN4M7TIWAZFF2JWJPUFYOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SX6ADY01NC2N?ASIN=B075BCVSJZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "5.0 out of 5 stars I wasn’t expecting to love it",
                "reviewText": "I’ve used air fryers before and always thought they have high utility and function, but they’re so bulky and kind of hideous so I didn’t want to buy one myself. I thought the Dash would be cute but probably not super functional. I was WRONG on the second count. It is cute and it’s not huge - to be clear, I would say it’s best suited for one person portions. But, it is extremely easy to use, the color is nice (gray), it’s not particularly loud especially compared to other air fryers, it’s got the versatility and function of full sized air fryers, is easy to clean, and the size is manageable if you want to leave it on the counter. I wish I had bought it sooner.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JamesJames",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETENNT4CBNPFDHGFZN4DY6PJCJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHW5QK0PQNC4O?ASIN=B075BCVSJZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2019",
                "reviewTitle": "4.0 out of 5 stars Great cooking appliance, but watch the non-stick coating",
                "reviewText": "I've had the Dash Compact Air Fryer for nearly 6 months, and I love it. It's small and prefect for 1-2 people. Great quick toaster oven that creates health crispy food with little or no oil. It works by circulating air over the top of the food, so you need to flip over or toss the food.PROS: It's perfectly cooks food that comes in smaller pieces (french fries) or meat that cooks up quickly (beef, shrimp, salmon). Oven Fried Chicken: I could never get my oven fried chicken to get crispy like a oil deep fryer. After baking it in the oven, I would quickly air fry for 5 minutes to give in a crispy skin and coating. Frozen Fries: Works well with most types of frozen french fries, but Shoe String Fries are the best for air frying due to their thin cut.CONS:1. The Non-Stick Coating. A lot of comments complain about the non-stick coating flaking off. Many modern cooking appliances have cheap non-stick coating, and this is no exception. I used to have a Foreman grill that had the same problem. I learned through past experience to use parchment paper under my food to prevent the food from sticking and the flaking of the non-stick coating. PRO-TIP: For the Dash Compact Air Fryer, I used the removable circular tray to trace and cut out perfect parchment paper liners (see pictures). It makes clean up super easy and preserves the coating on the cooking surface. I added a picture of my air fryer tray after 6 months of regular use (looks like new). It takes about a minute to cut the parchment paper to size, and I usually pre-cut a dozen ahead of time. Don't pre-heat the air-fryer with parchment paper inside because it will be blown up into the heating element and burn the paper. Make sure the parchment paper is weighed down by food.2. The Spring-loaded Timer. The manual timer is spring loaded and requires sufficient tension to be accurate. If you set the timer for less than 5 minutes, it will turn off before the 5 minutes. I'm not certain if this is a design flaw or just my machine (your mileage may vary). I wouldn't recommend cooking anything for less the 5 minutes. Most food requires more than 5 minutes, so this shouldn't be a huge problem.3. Thick food. This is not just a problem for this brand or model. All air fryers operate by pushing hot air over the surface of the food. So, thinner slices of food work better. I wouldn't cook a thick cut of steak in it (unless you like it blue) or thick cuts of pork/chicken. As I mentioned above, I would bake thicker pieces of meat in the oven and crisp the outside in the air fryer. For food cut into small pieces (like fries), lay them on the tray in a single thin layer. Don't fill the basket to top.Despite the few drawbacks, I love the Dash Compact Air Fryer. It doesn't do everything, but it's great at one thing: making things crispy. I use it for baked salmon, crisp up baked fried chicken, cook frozen fries, burgers, bratwurst, etc. It permanently replaced my toaster oven, and its thinner footprint means I save counter space.PS: If you have leftover fried food, try re-heating it in the air fryer. It will make it crispy again.",
                "reviewVotes": "141 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71P6hjx9CCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71YgllRRYIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alice Lovejoy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGGCNPGQQYFM5NLEVKMYJYZMQLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BWURT69L652I?ASIN=B075BCVSJZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "Love the retro look",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGASF676AFISCFERV5Q3OS5IZ6DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O0864TJ3P79U?ASIN=B075BCVSJZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect for One Person",
                "reviewText": "I got this for my dad because he had expressed interest in borrowing mine. I really like that this is a small unit, just right for basically one person/one serving. It is analog, so no fancy push buttons, just a time dial and a temperature dial. Set it to the temperature you need, turn the timer on, and when the light turns green, the unit is at the proper pre-heat temperature. The basket pieces are all dishwasher safe (I hate washing dishes) and the unit is very easy to clean. Highly recommend for someone that doesn't need to air fry large quantities of food.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 20, 2023",
                "reviewTitle": "Works well",
                "reviewText": "This is a great size for one person. I do get two servings out of some items. I can get two small chicken breasts in it. So far everything I've made is tender and juicy and the fries are nice and crispy. Does not take up much room on my counter so I can leave it out. Highly recommend for singles. And so easy to clean.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bo joe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 29, 2022",
                "reviewTitle": "great, very easy to use.",
                "reviewText": "I already had one and this was a gift. Recipient was trilled with it; great for one or two people.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra C",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 19, 2021",
                "reviewTitle": "I love my new Dash air fryer",
                "reviewText": "I wasn't sure I would like my air fryer, but after using it for over a week now, I know I love it!!! The size is compact and fits well on my kitchen counter and the red color is amazing. Everything I have made from fries, to pizza, crispy beef, turkey thighs, pork tenderloin and cauliflower bites has been easy to do and turned out delicious. The size is definitely for one person and you can not do very big portions in it. So if you are hoping to make multiple things in it at once this is not the size for you. At this point it's a good size for me. I'm so glad I purchased it and there are wonderful groups on Facebook to help with recipes and ideas.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hy Goldberg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 24, 2021",
                "reviewTitle": "Air Fryers are fast and easy.",
                "reviewText": "The air fryer is amazing. It works quickly without all the oil. I use it almost every day. It is the perfect size for a small kitchen space, and for single or double portions.The only problem is the rotary dial on top to set the temperature. It should have more and clearer settings.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan Dutton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 17, 2022",
                "reviewTitle": "Unfortunately I was supplied with a Dash suited to USA electrics not UK. enough said.",
                "reviewText": "Unfit for uk for reason given, and alien plug and 110v",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}