{
    "remaining_requests": 33829,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Breville-Joule-Fryer-BOV950BST-Stainless/dp/B0BYFR7T23",
    "body": {
        "name": "Breville the Joule Oven Air Fryer Pro, BOV950BST, Black Stainless Steel",
        "price": "$549.95",
        "originalPrice": "$549.95",
        "rawPrice": 549.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Breville-Joule-Fryer-BOV950BST-Stainless/dp/B0BYFR7T23",
        "soldBy": {
            "sellerID": "A1RHZSN6VRQHCL",
            "name": "Everything Kitchens",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1RHZSN6VRQHCL&asin=B0BYFR7T23&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C2JCWMQT"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BYFR7T23",
                "variationName": "Color",
                "variationValue": "Black Stainless Steel",
                "price": "$549.95",
                "variationImageURL": "https://m.media-amazon.com/images/I/41uNhGWaVoL._SS36_.jpg"
            },
            {
                "asin": "B0BYFTZT3H",
                "variationName": "Color",
                "variationValue": "Brushed Stainless Steel",
                "price": "$485.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/419ai9s221L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "11",
        "stockDetail": "Only 11 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41uNhGWaVoL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41l27T4IBHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AhQqibmQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51B57t3wkgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RNjjegR3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TKHPLbi9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HfGLBZi6L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1zcdkIwNjL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1zcdkIwNjL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Breville Store",
            "link": "https://www.amazon.com/stores/Breville/page/EBBDE160-83A6-4DE3-A1B2-C27D03CABFF6?ref_=ast_bln"
        },
        "brand": "Breville",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 185,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 17 hrs 4 mins.",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The Breville Joule Oven Air Fryer Pro is a connected countertop oven that features 13 pre-set smart cooking functions powered by the Element IQ system to steer power when and where it's needed for beautifully cooked food that's crisp, juicy and full of flavor.",
            "JOULE APP EXPERIENCE: The Breville Joule Oven App combines cook-progress monitoring and its unique Autopilot feature with recipes from your favorite chefs and food brands for a one-of-a-kind cooking experience.",
            "PUT IT ON JOULE AUTOPILOT: The automated multi-event cooking experience guides you through the recipe and moves smoothly between cooking modes. Just press start and the oven does the rest, handling the tricky bits so you can enjoy the fun parts.",
            "ELEMENT iQ SYSTEM: steers power when and where it's needed to create and maintain the ideal heating environment for precision cooking. The 6 independent quartz heating elements, PID temperature control, and smart algorithms work together to deliver precise and even temperatures.",
            "13 SMART FUNCTIONS: Thousands of hours of food testing, data research, and thoroughly tested algorithms have resulted in the optimization of 13 simple food presets - which all makes for cooking without compromise. These versatile cooking functions are built into the oven and on the Breville Joule Oven app for maximum versatility and usability.",
            "GUIDED RECIPES: Access step-by-step recipes from brands including Epicurious, New York Times Cooking, Serious Eats, America's Test Kitchen, ChefSteps, the Breville Test Kitchen, and more in the Joule Oven app.",
            "VOICE ACTIVATION: “Hey Google, set the oven to bake.\" Go hands free with voice activation. Compatible with Google Assistant and Amazon Alexa.",
            "AIR FRY & DEHYDRATE PRESETS: Why buy a stand alone air fryer or dehydrator when the Joule Oven Air Fryer Pro can do both? With precise heat control and maximized airflow, you can enjoy crunchy, crispy, air fried family favorites or dehydrate slices of fruit or vegetable all in one machine.",
            "STAY CONNECTED ON THE GO: The Joule experience lets you connect to your oven via the app with progress monitoring and push notifications so you can relax with confidence, while Joule keeps its eye on dinner."
        ],
        "description": "Nail it. First time. Every time. Enjoy the confidence of cooking with Joule®. Unleash your inner chef and unlock your Breville Joule® Oven's full potential with the power of Joule® Autopilot and the Joule® Oven App. Just press start and the oven does the rest, guiding you step-by-step through video recipes and moving seamlessly through multiple cooking functions, times and temperatures to extract more flavor, aroma, color and texture from every meal. Stay connected and relax with confidence while Joule keeps its eye on dinner for you. The Breville Joule® Oven Air Fryer Pro also features 13 pre-set smart cooking functions powered by the Element IQ® system to steer power when and where it's needed for beautifully cooked food that's crisp, juicy and full of flavor.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Breville"
            },
            {
                "name": "Color",
                "value": "Black Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "21.5\"D x 17.3\"W x 12.8\"H"
            },
            {
                "name": "Special Feature",
                "value": "Auto Cook Menu, Adjustable Rack"
            },
            {
                "name": "Control Type",
                "value": "App Control"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "13’’ non stick pizza pan, Wire racks (x 2) Reversible for 8 different rack positions, 9” x 13” broiling rack, 9’’ x 13’’ enamel roasting pan, Air fry / dehydrate basket"
            },
            {
                "name": "Model Name",
                "value": "the Joule® Oven Air Fryer Pro Black Stainless Steel"
            },
            {
                "name": "Finish Type",
                "value": "Brushed"
            },
            {
                "name": "Item Weight",
                "value": "22.8 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Breville"
            },
            {
                "name": "ASIN",
                "value": "B0BYFR7T23"
            },
            {
                "name": "Item model number",
                "value": "BOV950BST1BUS1"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 185 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,626 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #62 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "March 14, 2023"
            },
            {
                "name": "Capacity 6 Quarts",
                "value": "Wattage 1800 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 22.8 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Enjoy the Confidence of Cooking with Breville+ Your culinary co-pilot gives you step-by-step guidance on 400+ recipes, tested & tuned to your oven Automated Cooking Event To Guide You Guides you through recipes and moves smoothly between cooking modes For Step-by-step Instructions with Breville+ Breville+ is an ecosystem of guided recipes, live & on-demand classes, cook guides & more With Progress Monitoring via the App Progress monitoring & push notifications allow you to relax while Joule keeps its eye on dinner Google Assistant & Amazon Alexa Voice Activation “Hey Google, set the oven to bake.\" Compatible with Google Assistant and Amazon Alexa Next page 1 Breville+ 2 Joule Autopilot 3 Guided Recipes 4 Stay Connected On-the-go 5 Go Hands-free",
                "media_link": []
            },
            {
                "media_text": "Choose your oven 13 cooking functions Settings 11 cooking functions 9 Slices; 13\" Pizza Capacity 6 Slices; 13'' Pizza Convection Powered Element IQ System LCD Display 13 cooking functions Settings 13 cooking functions 9 Slices; 13\" Pizza Capacity 9 Slices; 13\" Pizza Convection Powered Element IQ System LCD Display 13 cooking functions Settings 9 cooking functions 9 Slices; 13\" Pizza Capacity 6 Slices; 13\" Pizza Convection Powered Element IQ System LCD Display 13 cooking functions Settings 10 cooking functions 9 Slices; 13\" Pizza Capacity 6 Slices; 13\" Pizza Convection Powered Element IQ System LCD Display",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d3303db1-bd9f-47d1-9db5-a56b0629fc1e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fbf5482c-ee10-4efc-b857-6f63fe2df279.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/749f5060-2dea-4b62-9aa0-1f03cac573f2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b14c86a9-753f-4f10-9b37-8620d6c6ee99.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5bbfd799-c407-4ff9-a284-4f4993203b60.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/faf2d1d4-be87-4e30-9d24-30ededefe7fa.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbfe37e5-ad30-4f18-9844-5ad3cdc5a77c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/79971ac2-930c-4d54-9a4d-8449361c9de4.__CR0,0,488,700_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08c1d446-85da-48e5-a7fa-1fbe3a089554.__CR0,0,488,700_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a587f0e-cf2f-45c8-967d-a38c6fcd994e.__CR0,0,488,700_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c338ec61-c2dd-448b-8dfd-d2a5f36f019a.__CR0,0,488,700_PT0_SX488_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John K. Hampton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKOVTHLED7AFSLLN3H5KY6ABILQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10I94YZCY9CEN?ASIN=B0BYFR7T23",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Wow, a great toaster oven plus.",
                "reviewText": "Had a cheaper version of this model for a few years and used it all the time. Wanted a newer model with a light inside. Broiled a rib eye steak as soon as I got it, came out great. I also use it to finish off microwaved baked potatoes. 7 minutes in the microwave 5 minutes in toaster oven soft inside crispy skins on the out side. Frozen pizza comes out hot and bubbly in just a few minutes. Hardly use my regular oven any more. Has many built in cooking cycles that make cooking a quick meal easy. Trust you'll love this one. Hardly a day goes by that I don't use it. Oh, easy to clean any drips with a pull out tray that I rinse off or pop in the dishwasher easy peasy. A bit pricy but well worth it in my opinion.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ROBERT GUNTER",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7U22KCMWPSODTBLVPK4EA6IHEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QQZOTJKBNWHT?ASIN=B0BYFR7T23",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars This is a Great Product.!!!",
                "reviewText": "Works like a big oven. This is the easiest oven to use with consumer-friendly controls. Fits nicely on a countertop. Looks beautiful and expensive in our kitchen. This product gives you a replacement for your toaster oven, toaster, air fryer and much more.I am very happy with my purchase and would recommend to any cook or someone that just warms up food. Great well-made product.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Sauer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLAFDUADKARFTNYMKWHMTJUBVVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z7ZGRC4Q3Y5H?ASIN=B0BYFR7T23",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Great oven with continued support",
                "reviewText": "Update: the app allows preheating without autostarting the timer and enables modes which aren't on the main screen. That fixes the main thing that annoyed me, and after living with it for a month, the dang thing does an incredible job of cooking. BTW, get the cutting board for the top - it's so worth it to have a cool top surface. So I consider it now a five star device which I love *almost* as much as I expected to. Integration with home assistant so I can blink lights and stuff when it needs attention would put it at six stars out of five. 😂No Home Assistant integration yet, but maybe someday.Original review follows, because I'm not editing history; I said what I said at the time, even if it was borderline wrong. 🤷‍♂️---The idea of a smart oven is awesome, as is the guided cooking. ChefStep almost got it right, then Breville bought them and I guess everything stopped?This thing is really nicely made and works well. But there are two things which are annoying me enough that I really wish I had preserved the box.1: the app is absurdly limited, and even though they obviously have an API so Alexa works, the API isn't documented anywhere. There's supposedly a Google voice integration, but the link on their setup page is broken, so no Hey Google for you. No Home Assistant integration either, despite supposedly having a developer on staff who said it was coming soon a year ago.2 - you can't just preheat the oven. Alexa can preheat the oven, ans the app can preheat the oven *in a recipe*, but there's no way to just use the front panel or the app to preheat to 350. You can say 350 for 15 minutes, but as soon as the oven is preheated, the timer starts. So they expect you two stand in front of the oven with your food all ready to throw in at the moment the preheating is done. The timer pauses when you open the door, but it's a small oven so you're losing heat now. You can can reset the timer, but as you're increasing the time, it's still counting down. So you turn to 15:00, and then it goes to 14:59, so you rotate again to get to 15 then 16 minutes. Every second, the number on the display is goes down by one, so it's a really aggravating experience. And of course there's no timer for how long it'll take to preheat. Sure, there's a thermometer in there which knows the current temperature and could calculate based on the time it's taking to increase the temperature how many more time intervals it'll take to reach the temperature, but obviously basic machine learning isn't a popular enough buzzword at Breville.l to apply it in a smart oven.All those buttons and all that intelligence, and no friggin way to just separately preheat or start the timer like literally every other oven which has ever been made. Otherwise, this thing is great. But holy cow, how did they overlook the most basic feature?Also, I'm a software engineer, not some old technology-averse curmudgeon who doesn't understand modern humanity. 😂",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BreeBree",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJLYYTZS5EHPN6P246FU6AFVTHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11CBDCU9IVN7Q?ASIN=B0BYFR7T23",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy and efficient",
                "reviewText": "I have a makeshift kitchen in a basement “apartment.” This toaster oven air fryer does more than replace a full sized oven. They have marked in the glass the rack positions to make it idiot proof. For me having the app with detailed instructions and videos was invaluable. I wish there were more meal recipes vs baking and more low carb but I’m sure the recipes will keep growing. The auto pilot feature is ridiculous. My steak was PERFECT! Veggies were perfect. I hate to cook and now I’m actually kind of having fun just to see what all it can do.Living in a basement I was worried about ventilation. I have an air purifier that jumps about 20 points when my roommate uses the oven upstairs - or more. It’s rare the Breville affects it all and it’s a few feet away. It doesn’t heat up the room either. My tv heats up the room more!It’s not loud. I love the light comes on the last few seconds to warn you it’s about time to check things out. Auto pilot is amazing. When I cook on my own I see if they have done some similar to see like rack position etc. It’s been easy to use and everything has cooked perfectly from actual toast to baking to air frying. I don’t have a lot of money so this was a MAJOR sacrifice for me but absolutely worth it. Love it",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bi3j2GcRL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Don C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXJBZ7NIQAJBC2DGWDE4S4ACXCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YP0F1QM6TTO5?ASIN=B0BYFR7T23",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Probably one of the best overall counter top ovens you can buy",
                "reviewText": "It's not cheap, especially if you want the black stainless steel flavor which is only available in their most expensive oven. Even on sale for $439, it's pricey. However, our previous Breville lasted at least 10 years so I'm hoping this one will be of the same quality. Our previous Breville didn't have air-fryer capability, and we're finding that to be pretty useful as well. It's big (and bigger than our previous one), so make sure you have the room for it. I had bought the Breville cutting board to sit on top of our previous one, and it fits on this one as well.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael V. Patrick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKKFGXFKZFOLBRKUZ7D4KHF3XDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RHHOPE6LOVLE?ASIN=B0BYFR7T23",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "5.0 out of 5 stars HUGE and VERSATILE",
                "reviewText": "This oven is truly large, so be sure to measure your space first and consider that it is recommended by the manufacturer that you have space on the sides and back for air circulation and heat dissipation.The instructions are easy to follow and provide plenty of options. My favorite setting is Proof. I really did not think that this function would work well because proofing can be tricky, but it has been perfect every time during my weekly bread baking operation. The air fry setting may not work as well as a single use air fryer, but it works decently and all the other functions make it a worthwhile purchase for our household. The outside gets HOT during some operations. The removable crumb tray is fantastic. The included pans all work well. Cleaning after preparing an item like chicken wings can be difficult, but that was expected. We love this oven!",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$544.40",
                "sellerName": "K&C LLC",
                "sellerRating": "5"
            },
            {
                "price": "$549.95",
                "sellerName": "KitchenUniverse",
                "sellerRating": "5"
            },
            {
                "price": "$549.95",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}