{
    "remaining_requests": 33844,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ninja-AF101-Fryer-Black-gray/dp/B07FDJMC9Q",
    "body": {
        "name": "Ninja AF101 Air Fryer that Crisps, Roasts, Reheats, & Dehydrates, for Quick, Easy Meals, 4 Quart Capacity, & High Gloss Finish, Grey",
        "price": "$89.99",
        "originalPrice": "$129.99",
        "rawPrice": 89.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ninja-AF101-Fryer-Black-gray/dp/B07FDJMC9Q",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTCMBG2K"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $13.50 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31MBSKiZOPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51 6qyCM6iL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QmFXfrxSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61ExzP6zu2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51T5o8TmUBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61CYf PTbyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51P18V57qbL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ninja Store",
            "link": "https://www.amazon.com/stores/Ninja/page/4D837C13-1334-44EE-AD50-9586EE0F3873?ref_=ast_bln"
        },
        "brand": "Ninja",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 51423,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 3 hrs 7 mins",
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 3 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LESS FAT: Now enjoy guilt-free food. Air fry with up to 75% less fat than traditional frying methods.* *Tested against hand-cut, deep-fried French fries.",
            "WIDE TEMPERATURE RANGE: 105°F-400°F allows you to gently remove moisture from foods or quickly cook and crisp foods with convection heat.",
            "FAMILY-SIZED CAPACITY: 4-quart ceramic-coated nonstick basket and crisper plate fit 2 lbs of French fries.",
            "4-IN-1 VERSATILITY: Includes 4 versatile cooking programs: Air Fry, Roast, Reheat, and Dehydrate.",
            "DEHYDRATE: Create flat, chip-like dehydrated foods for fun, homemade snacks. The combination of low fan speed and low temperature enables thorough dehydration.",
            "EASY-TO-CLEAN: Dishwasher safe parts including the basket, and crisper plate. Wipe to clean machine exterior.",
            "WHAT'S INCLUDED: Shark Air Fryer, 4 Quart Nonstick Basket, Crisper Plate, & 20 Recipe Booklet."
        ],
        "description": "Time is precious, even more so when you’ve got hungry mouths to feed. Why wait for your oven to preheat and then slowly cook that highly anticipated meal when there’s a quicker way to put food on the table for your whole family? Meet the Ninja Air Fryer, a fast and easy way to cook your favorite foods. It ensures even circulation of hot air around your food for quick, crispy, and golden finishes, every time. The secret is the smart processor that delivers a wide temperature range while powering the fan that automatically adjusts speeds based on your cooking function, allowing you to cook and crisp your favorite foods, like 2 lbs. of French fries, using little to no oil in a family-sized 4-quart ceramic-coated basket. The wide temperature range gives you the ability to roast, bake, air fry, reheat, or dehydrate foods, making it your new go-to appliance for any meal or snack. With the Ninja Air Fryer on your countertop, you can pull crispy meals out of thin air.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Product Dimensions",
                "value": "8.5\"D x 12.1\"W x 11\"H"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Capacity",
                "value": "4 Quarts"
            },
            {
                "name": "Material",
                "value": "Ceramic"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "1"
            },
            {
                "name": "Output Wattage",
                "value": "1550 Watts"
            },
            {
                "name": "Item Weight",
                "value": "10.58 pounds"
            },
            {
                "name": "Brand",
                "value": "Ninja"
            },
            {
                "name": "Wattage",
                "value": "1550 watts"
            },
            {
                "name": "Voltage",
                "value": "110 Volts"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Model Name",
                "value": "Ninja Air Fryer"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Inner Material",
                "value": "The basket and crisper plate are both made of aluminum and have a nonstick ceramic coating."
            },
            {
                "name": "Min Temperature Setting",
                "value": "24 f"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "No"
            },
            {
                "name": "Max Temperature Setting",
                "value": "400 f"
            },
            {
                "name": "Cable Length",
                "value": "2.6 Feet"
            },
            {
                "name": "Manufacturer",
                "value": "SharkNinja"
            },
            {
                "name": "ASIN",
                "value": "B07FDJMC9Q"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "AF101"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 51,423 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#30 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #1 in Air Fryers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "August 13, 2018"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efffff38-3426-4ff2-9f7d-a24bc99b5115.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4a51305-42c4-4bb3-8bc5-bb2b7b302836.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/da22ee84-a8ee-4c5e-afcc-b5be90c4942e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ebfa16e7-cf08-466e-84ce-cee0ea3996a6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1ac63f2d-4d97-4cee-b569-9cc4cfe25344.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a97b0f50-945f-4fbd-b39e-fe0f93e5dc13.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e982df9b-bef7-4e76-bb62-a77c4f61c860.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3e7b3911-d15c-4b67-beb5-044bfc542981.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "C. Martin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEV7EUWYUMUZAYPW63JDXLQ3BT5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2US61C880CV4N?ASIN=B07FDJMC9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2019",
                "reviewTitle": "5.0 out of 5 stars Best appliance since the microwave!!!",
                "reviewText": "Been having this fryer for 2 weeks now and it has NOT rested yet. I LOVE IT & wonder how I've gone this long w/out one. Before I start bragging on this thing, I am by no way endorsed by Ninja or getting paid by them. I've owned a few Ninja products blenders and still have one that's over 10 years old. They make quality machines. This fryer is a life & time saver...especially if you're a lazy cook. I have been researching air fryers for the past few months and nothing comes close to the Ninja. The basket size isn't the large 5+ quart capacity like the bigger fryers, (Ninja is only 4qt), but this thing cooks so fast you won't miss the extra 1 qt. It comes w/ a crisper that works perfectly, a recipe book and a multi-layer rack. The first night I had it I made wings and I tell you that I will NEVER buy fried chicken again!!! Yes, they were that crispy and tasted much better. I bought the Louisiana fried chicken flour from Walmart, battered the wings, spritzed w/ a little olive oil and had fried chicken in 10 minutes. No greasy mess, no 3rd degree burns from hot oil, and your house doesn't smell like a chicken joint for 4 days afterward. Because the Ninja uses a ceramic coating on their fryers the clean up is very easy. Next, I made sweet potato fries! Had a bag of frozen ones in the freezer and popped those babies in for 10 min. They were crispier than McDonald's. I tried homemade fries but the procedure takes too long. You have to peel, slice, soak potatoes, dry them...I'm just ready to pop them in the fryer and eat! It has been nonstop air fryer cooking in this house! I hit youtube to get a few recipes and it's been on ever since. What I like best about this fryer is it has a dehydrator feature and how fast it cooks. Frozen chicken wings? No problem! Throw them in the fryer for 10 minutes and they're defrosted. I've cooked pizza, fries, wings, reheated food, fried zucchini, and tonight I baked a chocolate cake. Everything came out perfect! Next up is donuts! The only thing I don't like about this fryer is 30 seconds after it finishes cooking it shuts off. I know this is a safety feature but I always have more items to cook. In 2 weeks, I have used my microwave twice, and that was to reheat coffee. Before I forget, I did cinnamon rolls too! I used the canned Pillsbury ones and it normally takes 20 min in the oven. In the Ninja? 8 minutes and that's if you like them brown. I actually could have stopped it at 5 min and they would be perfect. My house smelled like a Cinnabon factory!😛 I have used every feature on this fryer except the dehydrator but I'll be making beef jerky soon. Overall, I am VERY pleased! The best selling feature was the price & the size. The Ninja is much slimmer than some of the bulkier fryers and fits under my cabinet nicely. I'm also happy it only used 1500W unlike some of the larger fryers that burn 1800 which could kill your light bill. The outside of the fryer doesn't get hot so you won't have to worry about getting burned but do take caution when taking your food out. Is it loud? My exhaust fan on my stove is louder than the Ninja. The extension cord on it is long so you don't have to worry about being limited on where you can place it. I think I've covered everything? This thing is THE BOMB! If you're wondering what cookware you can use, just about anything you place in a microwave you can put in the Ninja. I went to the Dollar Tree and bought a few 7\" foil pans I use to reheat food & bake in. Also, grab you some silicone tongs while you're there so you don't scratch the surface of your fryer. This thing has been almost as good as a kid getting a new bike for Christmas. You will NOT be disappointed w/ this purchase. Happy & healthy cooking!",
                "reviewVotes": "3,012 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim Mattina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVNJVH2OSQUUDI5Z63C4GCJ45MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NOFKT62N0TWL?ASIN=B07FDJMC9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Surprisingly convenient and efficient!",
                "reviewText": "I’ve primarily used this air fryer for frozen foods. I cook only for 1-3 people.*Air fryer is nicely sized. I’m in an apartment and wanted something that didn’t take much counter space.*Living in Phoenix, I was looking for something to avoid generating heat.*Breaded items come out nice and crisp! Chicken strips, popcorn shrimp, panko shrimp all perfect!*Chicken breast and halibut fillets cooked up beautifully and very juicy!*Very easy to clean (only 2 pieces to wash).*Easy temperature and timer controls. Though, I wish the beeper were a bit louder.*Not heavy. I’ve taken this to my parent’s house for quick easy meals. I’ll likely get one for them!For a larger family, you may want something a bit bigger. For me…perfect size. Highly recommend!",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Becky",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2WWMGERF4YEBTWXHKKUPUXTGWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M01N2EX35XLB?ASIN=B07FDJMC9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Convenient and quick! I love this thing!!!",
                "reviewText": "I don’t know why it’s taken me so long to jump on the air fryer band wagon but I’m glad I finally did!!! This little gadget is perfect for my family! Toaster strudels, French fries, chicken wings, chicken nuggets, you name it and it comes out perfectly crunchy (without the wet soggy greasiness!) It’s also small which is a bonus since our apartment has a tiny kitchen and clean up is a breeze! We made pizza rolls and cheese sticks and it got so messy but all it took was wiping it down with a paper towel and even the melted on cheese came off without soaking or scrubbing!!! I love it and highly recommend!",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jess",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4YJMFG3M64MVSUR67VVSDXCD6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SKNXW94RESCD?ASIN=B07FDJMC9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Most used appliance",
                "reviewText": "This air fryer is a game-changer in the kitchen! It's perfect for making crispy and delicious fried foods with little to no oil. The results are amazing! 🍗🍟One of the things I love about this air fryer is its versatility. It can do so much more than just fry. You can also use it to roast, reheat, and dehydrate your favorite foods. It's like having multiple appliances in one! 🥦🍤The cooking performance of the Ninja AF101 is top-notch. It heats up quickly and evenly, ensuring that your food is cooked to perfection every time. And with its large capacity, you can easily cook meals for the whole family. 🍽️🔥Cleaning up is a breeze too! The non-stick coating makes it easy to wipe clean, and the basket and tray are dishwasher-safe for added convenience. No more scrubbing for hours after enjoying your delicious meal! 🧽🚿Overall, I highly recommend the Ninja AF101 Air Fryer. It's a versatile and efficient kitchen appliance that will take your cooking to the next level. Say goodbye to greasy fried foods and hello to healthier, crispy deliciousness! 🙌🍗🔥",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVMRZGPDADFIGGF5TYC7VESM7ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TZSYMLQ17FI0?ASIN=B07FDJMC9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Why did I wait so long!",
                "reviewText": "I have no idea why I waited so long to get an air fryer. Since we have had this one, we have literally used it every day. We have had fun trying out different types of food. This air fryer does crisp items up- which I love. There are a number of features we haven’t used yet, but I love the ease of setting the temperature and cook time. Also, it is easy to pause and flip the food. The fry basket is nonstick (not plastic) with a crisping metal plate that is removable. It is exceptionally easy to keep clean. We also ordered silicone baskets to use as needed which we like to use with messy things like cheese sticks. So far everything has been great. We love the ease of use and not having to preheat an oven and wait for a longer cook time. We have cooked broccoli, cauliflower, salmon, chicken wings, hash browns etc. in the fryer and everything has been excellent. We typically only have 3 people eating here at any one time, but over the holidays with 4 people we would postage to cook two batches of the main dish to have enough for everyone, that would be my only complaint. But that would still take less time than using the oven. We are all very please with this purchase. I highly recommend.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}