{
    "remaining_requests": 33870,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/COSORI-Airfryer-Dishwasher-Safe-freidora-Exclusive/dp/B0936FGLQS",
    "body": {
        "name": "COSORI Air Fryer Pro LE 5-Qt Airfryer, Quick and Easy Meals, UP to 450℉, Quiet, 85% Oil less, 130+ Recipes , 9 Customizable Functions, SHAKE Reminder, Compact, Dishwasher Safe",
        "price": "$99.99",
        "originalPrice": "$99.99",
        "rawPrice": 99.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/COSORI-Airfryer-Dishwasher-Safe-freidora-Exclusive/dp/B0936FGLQS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $20 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Ub-f5GHxL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/512EZjEVq3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HJsdktEIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517EV06E09L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F3Y94OeTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-k8YbvQFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1Cdzc0qc-L.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the COSORI Store",
            "link": "https://www.amazon.com/stores/COSORI/page/D46391DC-ED44-44EA-81E1-A77E2522B50C?ref_=ast_bln"
        },
        "brand": "COSORI",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 24018,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 2 hrs 12 mins",
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 2 hrs 12 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "CUT DOWN 85 percent OIL :With 360 degree rapid heat circulation technology, feel free to enjoy the same crispy textures as traditional deep frying with up to 85 percent less fat.",
            "ENJOY MEALS IN MINUTES: This air fryer cooks with industry-leading temperatures up to 450 degreeF, making heating efficiency 20 percent faster than before. Help you prepare a quick meal.",
            "9 EASY FUNCTIONS: 9 one-touch cooking functions on a tempered glass display let you preheat and add personalized Shake Reminders. Let's add some fun to the cooking process",
            "COMPACT BUT SUITABLE CAPACITY : It can hold 5-quarts of cooking space, which fits enough food for 1-4 people, with compact design takes up little room on your counter top",
            "TEMPERED GLASS DISPLAY: Enjoy making one-touch selections on a beautiful tempered glass display ergonomically angled toward you.",
            "COOKBOOK and ONLINE RECIPES : Always be inspired to cook with an included cookbook of 30 original recipes by Cosori chefs and 100 plus recipes on the free VeSync app. You’ll be cooking like a pro in no time",
            "DISHWASHER SAFE: With a nonstick BPA-free basket , you can spend less time cleaning and more time enjoying your meals.",
            "EASILY PURCHASE ACCESSORIES: Search \"B0BSFNTD3N\" to find the COSORI air fryer disposable liners for 5-6Qt air fryer, \"B07QHSZGXC\" to find the original COSORI accessories set",
            "SPECIFICATIONS: This Air Fryer is ETL-Listed with a power rating of 120V / 1500W, a temperature range of 170F degree–450 degreeF, and a 1-60 minute timer. Please note that this voltage only applies to the US and Canada.",
            "CALIFORNIA ROOTS: Based in California, COSORI is proud to call the Golden State our home."
        ],
        "description": "COSORI Pro LE 5.0-Quart Air FryerThe high max temperature of 450°F lets you cook meals up to 50% faster than Oven. Patented Air Whisper® Technology keeps noise levels under 55dB for no disruption during dinner table conversation. Specifications:Temp Range: 170°F–450°FTime Range: 0-60 minBasket Dimensions(D x W x H): 8.6 x 8.6 x 4.3 inProduct Dimensions(D x W x H): 14.4 x 10.8 x 12 inPower Supply: AC 120V, 60HzBefore Use (read carefully)Please complete the following steps in a ventilated environment before use. This will ensure your air fryer lasts longer and eliminates potential odors from the manufacturing process.1. Clean and dry: Take out the frying basket and clean it with a damp cloth or sponge dipped in dish soap and water. NOTE: Do not use any metal kitchen utensils or abrasive cleaning materials as this may damage the unit.2. Test run: Run at 450°F for 30 minutes without any food in it.3. Wait for cooling: Wait for the air fryer to cool down completely.4. Clean and dry again: Repeat step one.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Temperature Control, Timer, Manual control, Dishwasher Safe, Automatic Shut-Off, Programmable"
            },
            {
                "name": "Product Dimensions",
                "value": "10.8\"D x 12\"W x 14.4\"H"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Capacity",
                "value": "5 Quarts"
            },
            {
                "name": "Material",
                "value": "tempered glass panel, Metal"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Roast, Veggies, Broil, Bake, Preheat, Frozen Foods, Chicken, Bacon, Sea Food, Reheat, Air Fry"
            },
            {
                "name": "Output Wattage",
                "value": "1500"
            },
            {
                "name": "Item Weight",
                "value": "12 pounds"
            },
            {
                "name": "Brand",
                "value": "COSORI"
            },
            {
                "name": "Wattage",
                "value": "1500 watts"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Model Name",
                "value": "CAF Pro"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Min Temperature Setting",
                "value": "77 Degrees Celsius"
            },
            {
                "name": "Controller Type",
                "value": "Mannual"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Max Temperature Setting",
                "value": "230 Degrees Celsius"
            },
            {
                "name": "Cable Length",
                "value": "3 Feet"
            },
            {
                "name": "Manufacturer",
                "value": "COSORI"
            },
            {
                "name": "ASIN",
                "value": "B0936FGLQS"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "CAF-L501"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 24,018 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#412 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #3 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "August 20, 2021"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4f96205-9202-452c-8aad-722679270231.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4153747d-bb8f-4fb4-b834-a8d54a3d4b5e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7faff55d-27f3-40f7-8f09-fade627bd2f8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5fefc768-753a-4222-b413-368bb55ac145.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1d2c9be-6350-4a5a-b353-d2e495b6a066.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4eb29fd-b646-4d6d-995c-387ecda6538d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a40ab4db-fd82-4a81-a4f7-fcdfc68e1b15.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "dlb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIENRUWPMQJDATDWEDXILHQM5HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSLZL6D9C3WZH?ASIN=B0936FGLQS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Very Nice Air Fryer!",
                "reviewText": "This is my first venture into the world of air fryers and so far so good. I’ve used it several times already and have really enjoyed the convenience, speed, and the healthy food that it efficiently cooks. This particular air fryer, the Corsori Pro LE 5 quart is very nice looking and full of nice features. I really like its sleek modern design, the touch panel functionality, its compactness, and also how quietly it operates. In addition, it’s super easy to use and to clean. I’ve heard that the Cosori customer support is very good as well, which is a nice bonus and that, unfortunately, tends to be a rare thing these days. Hopefully I don’t need to contact them anytime soon though. In the mean time, I’ll continue to use and enjoy my new favorite kitchen appliance.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dhruv Verma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI7PWJ7SDOQARCB2F3TC4JWFR7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18LWT6HAQNT85?ASIN=B0936FGLQS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Cooking Simplified!",
                "reviewText": "We recently bought this airfryer, it had been on our list for the longest and we finally got our hands on this. It is a quick & a easy method to eat \"fried\" foods without feeling guilty. All the dishes that come out of this are always delicious and crispy and it is very easy to use compared to baking or frying.Design - It may be small for larger families but its compact size is perfect for me and my partner, always does not take up a lot of the counter space. Its a sleek design which is stainless steel and we got the grey/black color.Usage - It is quite easy to use, it already has pre set functions for temperatures & times for some items, which makes it convenient to use. The display is big enough to see how much time is remaining for an item to be cooked, etc.Cleaning - The cleaning of the air-fryer is what held me not buying one for the longest time, but with this air fryer we don't have to worry about that. The basket and the tray inside are easy to clean and are dishwasher friendly and the food barely ever sticks to the bottom, making it very smooth to just pop in to the dishwasher.Overall, this is a great product for the price its at, it has even made baking and reheating foods so much easier for us! It is a fantastic investment for those looking for quick cooking without having to use too much oil/butter on their dishes. A great addition to the kitchen!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG44ZBFZFUS3RAXDVJCEHEIEBRXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGVOF8SWMQYNS?ASIN=B0936FGLQS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Very convenient",
                "reviewText": "Fryer really helps in many ways. Great for smaller amounts of food that you don't need the whole oven for. Works quickly and doesn't heat up the house which is great in the summer. Crips up food without oil. Easy to clean and I think is even saving me on electricity. Overall a great purchase. I just wish I had bought a larger one than the 5qt so it as easier to cook for 3 or 4 people.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ComfyShoeMaven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXVSLHH2C4OV54J72TOUOJDTW3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4RKLKQR2QZ6G?ASIN=B0936FGLQS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Love It!",
                "reviewText": "I had been reading about air fryers for years, but just recently, I decided to buy one. The first one I bought had to be returned because when I did a test run, the odor was so strong that it lingered for days, and it set our fire alarm off. So, I decided to try this one, and bought the five quart because there's only two of us, and I wasn't going to cook that much in it.Because I wasn't sure about using an air fryer, I bought a used one from the Amazon Warehouse. That way, I wouldn't feel like I had wasted a lot of money if it didn't get used. When we did a test run with this one, there was very little odor, which was a relief. Also, the controls are very easy to use, and I like the fact that the basket is dishwasher safe.We haven't used it a lot, yet, but we did do the following:1. Bacon--Turned out just right.2. Frozen onion rings--Came out nice a crispy.3. Frozen French fries--Cooked in no time, and turned out great, even without shaking.4. French fries warmed up--Did a great job.5. Poached eggs--Total failure. Tried three different times at different temps, and never got them to turn out right.I kind of wish we had gotten at least the six quart, because the five quart doesn't hold much at all. It held about five onion rings, so we had to cook twice in order to get enough for both of us. However, we're going to stick with this until we're able to get a combo toaster/convection/air fryer oven where we'll have more room to play with.Other than it being kind of small, this air fryer meets our needs at present, and I'm looking forward to experimenting with more things, such as baking some cookies, and cooking hamburgers. I'm very happy with this air fryer, and I highly recommend it.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hal9001Hal9001",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 15, 2023",
                "reviewTitle": "Who knew frying air could be so delightful...",
                "reviewText": "Picked this up on a black friday sale, had been ruminating over getting one of these for a while and decided to go for it. So far I've used it to cook chicken, hash browns, fries, onion rings, Jamaican patties, reheated pizza and a few other quick items. This air fryer has handled all of these things well, it's also fairly intuitive to pick the time and the temp and get things moving... it heats up fast and gets the job done in a decent amount of time. It's somewhere between microwave and oven as far as timing on things. This particular fryer has a decent amount of space and is very easy to clean.Overall I'm glad I picked this up, and it's pretty easy to recommend... only negative thing for some folks might be that it takes up a bit of counter space, so that's maybe something to keep in mind. Otherwise, if you're like me and sort of on the fence, take the plunge and give it a try, I'm willing to bet you'll end up using it more than you initially think you will.Update: It has been about 2 months since my purchase, and at this stage I really don't find myself using my oven or even my microwave as often as I did before the air fryer, especially for heating stuff up, this air fryer has become a pretty essential kitchen utility. Easy to recommend.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61o8bQ3dj0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61zynHbqfyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. J. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on January 8, 2024",
                "reviewTitle": "Beste aankoop ooit",
                "reviewText": "Dagelijks gebruikt. Top airfryer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "iGlad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 25, 2022",
                "reviewTitle": "You will wonder at all it can do!!",
                "reviewText": "I had a Tefal air fryer which was fairly limited in what it could do as it had a paddle but we used it quite often for about the last 7 years or more. However the energy crisis and the fact that our oven has packed up simply had me looking around for a new air fryer. I did my research and realised I didn't need a ninja so anything with a good review will do. The Instant pot was out of stock and by chance the Cosori popped up and after checking couple of reviews and online videos I opted for the Cosori as it's sleek design also caught my eye along with the excellent feedback as well as the FB community pages packed with recipes. Their 2 year warranty was reassuring as I had never heard of this brand. I ordered and it arrived within 2 days which was a surprise but most welcome.I must say it's an absolute gem so far as it cooks food in half the the time of my old Tefal pad airfryer. I did some chicken thighs in about 14mins (10 min press and I added 4 to brown it a bit more). I cooked some sausages from frozen in 10 mins and added an extra 3 mins to get them brown). This morning I boiled some eggs in 10 mins so no steamy kitchen and no need to watch the pot.The glass tempered screen on the top is clear and pretty idiot proof imho but some may think differently. The presets can be amended as you can alter the temperature and the time which is excellent so there's plenty of flexibility.The overall design is very pleasing to the eye and differs from the usual Air fryer styles which are a bit ugly but that's just me.The tray is nice and solid and fits nice and easy without any fuss. The fact that the pan is square is a bonus especially when cooking a joint. Also cleaning it it with a sponge and soap and water is a 2 minute job so no hassle there.The preheat is 4 mins but you can alter it so not really a problem but you can go manual and not bother with a preheat.I will be cooking a couple of rump steaks later tonight so I may report back on how it went. I followed an online recipe and ignored the preset so it cooked a much lower temperature and for longer. FOLLOWUP: The steak looked and tasted great however next time I will try the preset which a higher temperature was only 6 mins.I will be putting it to the test with a whole chicken come the weekend so wish me luck! FOLLOW UP: The medium chicken from Aldi fitted nicely in the tray and after seasoning I gave it 60 mins in the Cosori with a turnover after 30 mins. I think I could have gotten away with 45 mins but I wanted to be sure it was cooked. The chicken tasted great nice and soft and juicy and the missus said it was the best meal I’ve made her.Next on my list is a leg of lamb. FOLLOW UP: The 1.5 kg leg of lamb fitted nicely in the tray as I looked for a more square piece with less bone. After defrosting it I seasoned it with 2 tablespoons of oil, salt and pepper, garlic powder and mixed herbs. I left it covered for a few hours in the fridge. And took it out an hour prior to cooking to get it to room temperature. I set it at 180c for 20mins then turned it over and gave it another 40 mins. I like it well done and checked it with a knife. I let it rest for 10-15mins and served it with steamed veggies. The missus gave me 10/10 as it was well cooked, tender and juicy. Another great result and it seems I’m now cooking every Sunday.it comes with a 2 year warranty, manual, recipe book and access to the app which has more recipes in it. Also there's a FB community and oodles of recipes online.Overall for the price you will not be disappointed as I certainly wasn't.When it's back in stock buy it!",
                "reviewVotes": "204 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Albert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 18, 2022",
                "reviewTitle": "Todo lo bueno de la Cosori de 5.5L sin todo lo malo",
                "reviewText": "Tenía una Cosori de 5.5L que me duró un año porque la cesta interior perdió toda la capacidad antiadherente y, encima, se desatornillaba y al final terminó cayéndose (y rompiéndose) al cabo de algo más de un año y poco. Al decidir comprar una de nuevo por el ahorro de tiempo y de electricidad respecto a un horno, optamos por la de 4.7L dudando un poco por la diferencia de volumen, pero la decisión fue la correcta:- Mucho más bonita y límpia por fuera: el cristal templado es más fácil y agradecido de limpiar.- Mucho más silenciosa (pero mucho).- Más fácil de limpiar: la rejilla escurridora se quita (y se puede cocinar sin ella), y es muchísimo más fácil de limpiar y menos aparatosa.- Menos opciones, pero más útiles: tiene menos programas (9 vs 11), pero los que han quitado son programas que jamás usé con la de 5.5L, y además esta tiene función Shake manual: es decir, puedes indicar tú si quieres o no quieres el Shake, mientras que con la de 5.5L tenías que elegir un programa que ya lo llevara y cambiar la temperatura y tiempo después.- Más intuitiva y más fácil de usar: puedes cambiar de temperatura y tiempo sin necesidad de tener que alternar entre uno y otro, y no hace falta \"pausar y reanudar\" si los cambias en mitad del cocinado.- Consume menos, pero llega a más temperatura (230ºC vs 205ºC).- No hay tanta diferencia de volumen de cocinado: a pesar de que tiene menos capacidad, la rejilla de la de 5.5L quita mucho espacio, con lo que al final te cabe *casi* la misma comida.En general, estamos muchísimo más contentos con esta, y desde luego es una buena inversión con el tiempo y la electricidad que te ahorras.",
                "reviewVotes": "315 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 31, 2023",
                "reviewTitle": "Nothing like to old air fryers",
                "reviewText": "Excellent product, easy to use and clean. This is the next generation of air fryers. This one is compact, easy to use and has a quiet operation (compared to another model that I purchased). Food cooks evenly with no hot spots. Meat retains all its juices. I have cooked fresh chicken pieces and pork-all did a better job than my conventional oven. I tried some frozen foods-again better results than a conventional oven.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}