{
    "remaining_requests": 33816,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GoWISE-USA-GW22955-Dehydrator-Touchscreen/dp/B081GJXXRM",
    "body": {
        "name": "GoWISE USA GW22955 7-Quart Electric Air Fryer with Dehydrator & 3 Stackable Racks, Digital Touchscreen with 8 Functions + Recipes, 7.0-Qt, Black/Copper",
        "price": "$72.59",
        "originalPrice": "$77.23",
        "rawPrice": 72.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GoWISE-USA-GW22955-Dehydrator-Touchscreen/dp/B081GJXXRM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09MJ3BLBV"
        ],
        "asinVariationValues": [
            {
                "asin": "B081GJXXRM",
                "variationName": "Color",
                "variationValue": "Black/Copper",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41+OmOEFjCL._SS36_.jpg"
            },
            {
                "asin": "B07ZWG619F",
                "variationName": "Color",
                "variationValue": "Black/Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41M1ysVClKL._SS36_.jpg"
            },
            {
                "asin": "B0884M3H6W",
                "variationName": "Color",
                "variationValue": "Mint/Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41pHPSrbmML._SS36_.jpg"
            },
            {
                "asin": "B081G8PG9V",
                "variationName": "Color",
                "variationValue": "Red/Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41dGgnz32ML._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "50",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 OmOEFjCL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41VtDS1oYuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lVSnpwUEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41dsY6NvFJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518xcwzGi6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LkdrnYvAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1j9 k59d L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the GoWISE USA Store",
            "link": "https://www.amazon.com/stores/GoWISEUSA/page/E12522BC-145B-4AEF-AB11-A0CAFA309C2E?ref_=ast_bln"
        },
        "brand": "GoWISEUSA",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 15708,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Compared with a 5-quart air fryer basket or smaller, GoWISE USA’s newest air fryer comes with an extra-large cooking capacity. The single basket and crisper tray give you 7 quarts of cooking space, the perfect size for feeding; The whole family or to whip up some snacks for a party. Easily cook a whole chicken or 4-5 burgers with a touch of a button without heating up the house.",
            "Searching for a gift This air fryer is the perfect gift under the tree for everyone. Get this multifunctional air fryer for the Moms on the go, dads who love to cook, grandparents or anyone who wants to be healthier. This air fryer allows you to cook your favorite fried foods with little to no oil and without the mess that comes with deep frying.",
            "Air fry, grill, and more: This extra-large air fryer is designed with 8 cooking functions, so you can save time and space. Air fry, roast, broil, dehydrate, grill, bake, reheat, or keep warm all in 1 appliance. The large control panel features a full touchscreen menu to make it easy to select a function, set a time and temp, and start cooking with a touch of a button.",
            "The cooking possibilities are endless with an extended cooking timer up to 60 minutes and a wide temperature range from 180°f to 400°f. The air fryer gives you more control by allowing you to set the temperature in increments of 5.",
            "Use your air fryer as a dehydrator tool. The built-in dehydrate function is designed with a temperature range from 90°f to 170°F and a timer from 2-24 hours. The air fryer comes with 3 stackable racks that enables you to prepare more servings of dried fruits, veggies, beef jerky, and your own dried herbs.",
            "Easy cooking followed by easy cleanup. This air fryer is built to last; The removable pan and crisper tray are coated with PFOA-free non-stick material. The non-stick basket extra-large cooking space measures to be 10\" X 9.5\" X 4\"",
            "Comes with a recipe book that contains 100 recipes tested right in our GoWISE kitchen. These step-by-step recipes will get you started and hooked on using your new kitchen gadget. Get more ideas from US and others, GoWISE is constantly sharing new video recipes, blogs and seasonal recipe books. We also have a whole community of influencers and everyday users sharing their recipes in social media.",
            "Customer obsessed and committed to 100% satisfaction, all GoWISE USA products come with a 30-day money back guarantee, 1-year and forever support from GoWISE customer care. Registered products receive an additional 60 days of coverage.",
            "Product specifications: 14”H x 13” D x 13” W (16.5\" with handle), 1700W 120V Ac. UL listed and FDA compliant"
        ],
        "description": "Introducing the GoWISE USA 7-quart digital touchscreen air fryer. Do more than fry with 8 preset cooking functions accessed on the large one-touch menu screen. Functions include air fry, roast, broil, dehydrate, grill, bake, reheat, and keep warm. Extended cook time up to 60 minutes (or 24 hours for dehydrate!) non-stick coated pan and crisper try for easy cleanup. Comes with 3 stackable racks and 100 recipes for your air fryer recipe book.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Manual, Programmable"
            },
            {
                "name": "Product Dimensions",
                "value": "16.5\"D x 13\"W x 14\"H"
            },
            {
                "name": "Color",
                "value": "Black/Copper"
            },
            {
                "name": "Capacity",
                "value": "7 Quarts"
            },
            {
                "name": "Material",
                "value": "copper"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Roast, Broil, Bake, Reheat, Dehydrate"
            },
            {
                "name": "Output Wattage",
                "value": "1700 Watts"
            },
            {
                "name": "Item Weight",
                "value": "16.3 pounds"
            },
            {
                "name": "Brand",
                "value": "GoWISE USA"
            },
            {
                "name": "Wattage",
                "value": "1700 watts"
            },
            {
                "name": "Voltage",
                "value": "120"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Model Name",
                "value": "GW22955"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Controller Type",
                "value": "button,touch"
            },
            {
                "name": "Max Temperature Setting",
                "value": "400 Degrees Fahrenheit"
            },
            {
                "name": "Manufacturer",
                "value": "GoWISE USA"
            },
            {
                "name": "ASIN",
                "value": "B081GJXXRM"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "GW22955"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 15,708 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#24,867 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #102 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "November 13, 2019"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Digital Retro Air Fryer 7-in-1 Air Fryer Digital Air Fryer with Duo Display Air Fryer & Dehydrator Max XL Multi Air Fryer Oven with Rotisserie & Dehydrator Air Fryer Oven Ultra Capacity 2.75 Quart 3.7 Quart 5 Quart 7-Quart 11.6 Quart 12.7 Quart Temperature Range 175°F-400°F 175°F-400°F 180°F-400°F 180°F-400°F 130°F – 400°F 120°F-430°F Timer Range 30 Minutes 30 Minutes 30 Minutes 60 Minutes/Dehydrate up to 9 hours 60 Minutes/Dehydrate up to 9 hours 60 Minutes/ Dehydrate up to 8 hours Assorted Colors ✓ Black Black ✓ ✓ ✓ Presets - 7 8 8 + Mute & Alarm Functions 8 11 Detachable Basket ✓ ✓ Basket w/ Crisper Tray Basket w/ Crisper Tray Included Recipe Book Recipe Book Recipe Book + Basket Divider Recipe Book + 3 Stackble Racks Recipe Book + 8 Piece Accessory Set Recipe Book + 11 piece Accessory Set Watts 1350 Watts 1500 Watts 1500 Watts 1700 Watts 1700 Watts 1600 Watts",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/e81bd5cb-ce84-403e-8270-6a47d23dbcdc.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d8ce27d5-1ce4-4fdb-869b-218f131fb408.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/27f57270-8783-4b67-9322-dc11092e6a99.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/479dcf25-7ca0-485f-9f12-d5a2a3c9830d.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b0e08bf2-e626-4454-8ed9-ad86362bb225.__CR0,0,625,1251_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b0a09f69-ddf2-4fe2-ae46-6bc9ff8eb272.__CR0,0,625,1251_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/73b4f139-3deb-45c6-a73a-c46a618b5873.__CR0,0,625,1251_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f9415b02-d3ab-463a-bd9e-b7077892dbb4.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/47c5480b-61ca-4157-8161-cb50985ba2d6.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ec6c76de-ffc4-4ca5-8c0a-dd69cb7a6574.__CR0,0,625,1250_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Miss Information",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPAEA2G4LBCJLSPYVW6O4PM7PMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SSBX56G1EWUR?ASIN=B081GJXXRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2021",
                "reviewTitle": "5.0 out of 5 stars Can't believe I waited so long to get this.",
                "reviewText": "I’ve been on a ketogenic diet for just over a year and one of the keto bloggers that I like had recommended one of the other GoWise models—the one that's more like an oven, with the rotisserie feature, etc. I had that in my Amazon cart for the better part of the past year. Almost bought it so many times but stopped myself each time. I love the idea of an air fryer but it’s a new way of cooking and I’m such a creature of habit. It felt overwhelming/intimidating to me to be learning to cook my dishes a new way—on top of just learning to cook keto.Around the holidays, my son happened to mention something about air fryers and I told him how I had this one in my cart forever and he was all excited about the dehydration feature (as was I) so I thought, okay, I’ll get it. So I ordered the oven-style one and of course, as soon as I did, I started second-guessing myself. Did more reading and thought maybe I don’t need all the bells and whistles. Since it's my first one, I thought maybe I should just go with the more traditional basket style. I really wanted to make things like Brussels. So, I ended up ordering this one, as well. It still had the dehydrator feature that my son wanted, so I figured I’d look at both once they arrived and make a decision.When this one arrived, I definitely liked the way it fit my counter and the size of it more than the oven style one when comparing them side by side. The basket is HUGE! Unfortunately this one was DOA. I plugged it in and it didn’t turn on or light up. I immediately called GoWise and they were very apologetic and said to send it back. At the same time, I liked the red of the other model, so after a lot more back and forth (I still wasn’t totally convinced I needed an air fryer at all or if I needed one that was so big!), I finally decided I’d re-order this basket style one but I would get it in red. Of course, by then, Amazon didn’t have the red. So, apologies, Amazon (who I order EVERYTHING from), but I ended up ordering this model in red from another retailer. (But I did buy the accessory kit, silicone 'parchments' and Emmerich's Keto Air Fryer Cookbook from Amazon!)After using it for just a few weeks, I can’t believe how much I vacillated. I had told myself not to feel pressure—that if I just used it 1-2X per week to make Brussels or wings, that would be okay. Well, it turns out I use it daily. Several times a day, in fact. It makes the best Brussels I’ve ever had. Crispy on the outside, mushy on the inside. It makes killer baby bok choy in 5-6 minutes. It makes amazing chicken—not just wings (which are totally crunchy/crispy) but also chicken breasts. Yes, you can do the air-fried chicken breasts with pork dust or parmesan crust so it’s like KFC, OR you can just do a marinated chicken that still gets nice charred edges but is juicy inside. So simple and low maintenance. Poppers, stuffed mushrooms, stuffed zucchini, meatballs, string beans… it does a great job on all of them. I’ve only had this for maybe a month now and I'm loving it. I hope this review gets posted even tho the unit I ended up keeping was NOT from Amazon. Again, I have this same model but in the red.If you're like me and not totally sure if you need this or if you’ll use it enough to warrant buying one or giving up the real estate on your counter or if you should go with a smaller one, I would say JUST DO IT! I am SO thrilled that I ended up getting it—and going with the 7 quart. I actually cannot imagine having one of the smaller ones (like with the 5.8 qt basket). This one is roomy enough to make 3-4 chicken breasts at a time or 12-15 wings, and not have to cook in batches. So far I’m just cooking for 2 people most of the time, but it’s perfect. With air fryers, it's definitely better to go too big than too small. But this one's been just right.As others have said, clean-up is a breeze. I bought the silicone liners instead of parchment, but I only use them about maybe 20% of the time, if that. They're good, but both the basket and tray clean up so easily without it.A few go-to's so far:frozen Brussels: 380 for 18 minutes, shake basket every 5 minutes (or less)baby bok choy: 350 for 5-6 minutes (shake basket midway)marinated chicken breasts: 360-400 for 15-20 minKeto fried chicken breasts: 400 for 22 minutes for regular thickness (or 14-16 min if they are sliced thin)the best crispy wings ever: 375F for 25 minutes, shake basket midwayEnjoy!!",
                "reviewVotes": "67 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSMWYFHVZM6ZI7JK5SFMQQYNM3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ILJAE6226ZPS?ASIN=B081GJXXRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2020",
                "reviewTitle": "5.0 out of 5 stars Works Great! Surprisingly Quiet",
                "reviewText": "This is my first air fryer. I debated the toaster oven style versus the more traditional air fryer style that this one has. I'm glad I made this choice. It's simple to clean because it just has the one non stick basket that wipes clean after each use very easily. The main basket is sturdy but very light weight so it's easy to rinse in the sink if necessary. I put the stacking mesh baskets in the dishwasher without any issues. It's surprisingly quiet, not even as loud as the range fan on my microwave. Huge capacity. Could easily fit a whole chicken. Digital controls very easy to use. I've made several good chicken dishes and zuchinni fries, but my absolute favorite thing so far is reheating pizza. Sounds basic, but it seriously tastes like it came fresh from the restaurant and only takes 5 minutes with no preheat time. I can never microwave pizza again.A couple of negatives: the recipe book is good for brainstorming ideas but is sometimes confusing and some recipes are not that good. Also the cook time seems somewhat subjective, and takes some practice depending on your quantities. Finally it doesn't cook large batches as evenly as I would like, but I'm still experimenting. I'm learning you have to flip or shake most food once or twice during cooking, and then it turns out better. I think this is a pretty common issue for most air fryers.Overall very happy with my purchase especially for the price compared to other air fryers. Highly recommend!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jamie32182",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRZPAI7OY5U5XPFGKUGHYMLF2OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PGQ6XNDZMPHZ?ASIN=B081GJXXRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent!",
                "reviewText": "I've owned a few air fryers, my first one was a Powerflex and it lasted years with nearly daily use. It was very similar to this brand. I decided since we used it so much that I would splurge on a Ninja and sure enough after about 3 months, the back of it literally melted and it stopped working. We were able to return it thankfully and i'm grateful it didn't lead to a fire. After researching a bunch, I landed on this little bad boy and we've had it for months now. It works like a charm. No bells and whistles, it's just a solid air fryer that works perfectly. Love that they have different colors too, we got the teal one and it's a really nice color.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 10, 2022",
                "reviewTitle": "large unit",
                "reviewText": "works great with 3 racks, excellent for making wings!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arturo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 7, 2022",
                "reviewTitle": "Works as expected",
                "reviewText": "Works as expected",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Finny",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 19, 2022",
                "reviewTitle": "Excellent fryer.",
                "reviewText": "Liked everything about this fryer. This is quite large and probably we could have ordered one half this size, but in the end we can cook larger amounts at one time instead of in batches. Quite amazed at how often we use this thing. Everything has turned out perfectly. Very pleased with this purchase.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 28, 2021",
                "reviewTitle": "Es una máquina que debería estar en más hogares",
                "reviewText": "No acostumbro a escribir mis reseñas al momento de utilizar los productos por primera vez, sino todo lo contrario me gusta esperar al menos 6 meses para poder tener una visión más amplia, esta no es la excepción.Lo que no me gusta primero, la pantalla es iluminada pero con un azul casi morado que no muestra con mucha claridad las imágenes de los alimentos, la temperatura y el tiempo se ven mejor porque son mucho más grandes que las ilustraciones de cada alimento, me hubiera gustado que fuera luz blanca o incluso verde por cuestiones de visibilidad, esto es prácticamente todo lo que no me gustaLa freidora es una chulada, se ha utilizado para una infinidad de platillos y todos han terminado siendo todo un éxito ,en los primeros días de uso quedamos sorprendidos en mi familia por la rapidez con que se cocinan los alimentos, incluso sacados del congelador por ejemplo unas papas en gajo están listas en 9 minutos, casi lo mismo con pollo congelado, ¡ni siquiera tienes que descongelar nada!El sabor de los alimentos si cambia un poco, especialmente si estás acostumbrado al sabor del aceite, en mi casa casi no utilizamos aceite y para nosotros no hubo una gran diferencia, pero aunque estés acostumbrado al sabor de los alimentos fritos en aceite, pues solo basta ponerle un poquito de aceite encima a tus alimentos al momento de freírlos en esta máquina y listo, yo compré un bote aspersor para aceite pero solo funcionó bien en las primeras 2 veces que se utilizó, luego comenzó a aventar solo un chorro de aceite en lugar de un aerosol de aceite, así que te aconsejo que no gastes tanto en un bote especial para eso, mejor compra una brocha de silicona blanda para poner un poco de aceite a tus comidas antes de freírlasLa limpieza es súper fácil, en menos de 2 minutos está lista para el siguiente día, es físicamente y en mi opinión muy bonita, si es grande pero precisamente por eso la ordené, así que el tamaño para mi no es estorboso sino todo lo contrario, no es ruidosa en exceso y en cuanto a consumo de electricidad pues no hemos notado cambios en el recibo de electricidad, aunque si gasta como un microondas pues a menos que la utilices todos los días y para cocinar todo no creo que aumente tu recibo de electricidad por muchoSi te sirvió o gustó mi reseña por favor dale \"me gusta\" para que más personas la puedan ver en amazon :)",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 29, 2021",
                "reviewTitle": "Happy with this purchase",
                "reviewText": "Great air fryer. Easy to clean. Blue interface/controls are hard to see in daylight.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}