{
    "remaining_requests": 33777,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Elite-Gourmet-EAF1222SS-Rotisserie-Dehydrate/dp/B0CB994MTS",
    "body": {
        "name": "Elite Gourmet EAF1222SS Air Fryer Oven Double French Doors, Bake, Grill, Roast, Broil, Rotisserie, Toast, Warm, Air Fry, Dehydrate, 1500 Watts, with 25 Recipes, 12L. Capacity, Stainless Steel",
        "price": "$76.69",
        "originalPrice": "$76.69",
        "rawPrice": 76.69,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Elite-Gourmet-EAF1222SS-Rotisserie-Dehydrate/dp/B0CB994MTS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CR6MXNS5"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41bwmww4j5L._SS36_.jpg"
            },
            {
                "asin": "B0CB994MTS",
                "variationName": "Color",
                "variationValue": "Stainless Steel and Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41lGPBBzUiL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Stainless Steel and Dark Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41N+CZ1OuxL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lGPBBzUiL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51dkxL7HqUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51E-4 KfOJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gnkKcSBiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51y8DdeHnfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51O-nbBh5 L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Elite Gourmet Store",
            "link": "https://www.amazon.com/stores/EliteGourmet/page/7C41F0D0-1198-4E29-9F0F-7F910F09B7C4?ref_=ast_bln"
        },
        "brand": "EliteGourmet",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 783,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "12L CAPACITY: This beautiful & stylish air fryer oven has 12L capacity, perfect for single family meals. Cooks faster, healthier, and more safely than in oil by eliminating splatter burns and reduces electricity use.",
            "STAINLESS STEEL FINISH with fashionable dual French Doors allows you to open one or both doors for easy access and to save on space.",
            "ADJUSTABLE TIMER AND TEMPERATURE settings give you the ultimate in cooking control and versatility allowing you to Bake, Grill, Roast, Broil, Rotisserie, Toast, Warm, Air Fry and Dehydrate all with one appliance! A high-power convection fan envelopes food in temperatures from 140 to 450 degrees and a 60-minute timer automatically shuts off the Elite Gourmet air fryer oven at the end of the cooking cycle.",
            "COOK A VARIETY OF FOOD so you can enjoy your favorite meats, chicken, fish, vegetables, pizza and much more by air frying, baking, roasting, grilling, broiling, toasting, and dehydrating.",
            "HEALTHY EATING by air frying with 85% less oil for fat-free delicious meals. Same crispy outer without the added calories! Simply add food to the basket, if desired, add a tbsp of oil (prior to placing in basket), select temperature & time, and start cooking!",
            "GUILT-FREE COOKING lets you enjoy crispy veggie chips, fish fillets, chicken tenders and more without fatty oils. Includes an instruction manual with cooking guide and 25 delicious and healthy recipes to get you started.",
            "ETL APPROVED 1500 Watts/120V Air fryer ideal for home kitchen use. Includes a dishwasher safe bake pan & air fry basket for fast, easy clean-up.",
            "TRUSTED BRAND - As a trusted brand for 40 years, Elite Gourmet has delivered high quality and stylish kitchen products that are affordable & user friendly. Call, email, or live chat with us, our US-based support team responds quickly to all inquiries."
        ],
        "description": "The Elite Gourmet 12-Liter Air Fryer Oven with dual French Doors has a variety of functions to give the chef in your home unlimited cooking potential. Designed with a beautiful stainless-steel finish, adjustable Timer and Temperature controls, you can air fry, cook, bake, grill, roast, toast, broil, warm, reheat & even dehydrate your favorite meals and snacks fast & easy! Enjoy moist & tasty treats or crispy healthy fried foods without mess and fewer calories! It’s faster than conventional cooking methods, doesn’t heat up your entire kitchen and is easy to clean. There’s no need to cook with added fats or oils & saves time and energy. Unlike traditional deep fryers, Elite Gourmet's Air Fryer Oven circulates dynamic-hot air which makes food crispy, tasty or juicy & tender without oil and it’s easy on your electric bill! Includes bake pan and air fry basket, drop-down crumb tray, instruction manual with cooking guide and 25 delicious and healthy recipes.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Product Dimensions",
                "value": "15\"D x 16\"W x 14.75\"H"
            },
            {
                "name": "Color",
                "value": "Stainless Steel and Black"
            },
            {
                "name": "Capacity",
                "value": "12 Liters"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Bake"
            },
            {
                "name": "Output Wattage",
                "value": "1500 Watts"
            },
            {
                "name": "Item Weight",
                "value": "11.4 pounds"
            },
            {
                "name": "Brand",
                "value": "Elite Gourmet"
            },
            {
                "name": "Wattage",
                "value": "1500 watts"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Model Name",
                "value": "Elite Gourmet EAF1222SS Air Fryer Oven Double French Doors"
            },
            {
                "name": "Inner Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Outer Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Controller Type",
                "value": "Manual"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Max Temperature Setting",
                "value": "450 Degrees Fahrenheit"
            },
            {
                "name": "Manufacturer",
                "value": "Elite Gourmet"
            },
            {
                "name": "ASIN",
                "value": "B0CB994MTS"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "EAF1222SS"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 783 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#63,189 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #285 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "July 6, 2023"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d6f7a30-e02e-4952-905f-3cd29e478aee.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96194767-ebe1-4a3e-8525-0d29d5a334fa.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/943fa195-36a9-47db-b392-1c34cda4d0e6.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bd71a302-a1d3-444c-80bf-df5fc8bda291.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c83ff56-a603-4681-9395-4b0b8d42ade1.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Darryl LucasDarryl Lucas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF5Q75XKPS6IYBGLEOJ4RCC7USQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ADILKQCU0Y6I?ASIN=B0CB994MTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for rotisserie",
                "reviewText": "Can't beat for the money. I needed a rotisserie oven, and this one works as well as the more expensive one I once had. Cook evenly, auto off and easy to clean. Worth the money.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pl1MHBH7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mister M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNGJB53PPC4CZ4ADOAJSDBD4ZFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U2V270FGUQAQ?ASIN=B0CB994MTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 18, 2020",
                "reviewTitle": "5.0 out of 5 stars I Like It A LOT!",
                "reviewText": "We used to have that other big O Showtime rotisserie oven some years ago and ended up throwing it away because I got tired of using it because it was sooooo big and took all the space in the kitchen. Not good. A few years later I craved another rotisserie oven to make some delicious chicken and I looked and looked and did a lot of research and could not find something affordable and nobody really knows how they perform until you actually have one and use it.I found this Maxi Matic oven and I am glad I found it and bought it. For sure is very different then the last toaster oven we had but I like the way it performs. I have noticed right away that the bread gets toasted in a very different way as before. Is not bad, but very different and one thing I like is that the entire slice of bread is toasted evenly. At first you do have to find that fine tuned perfect spot so that the bread is not underdone or over toasted. This unit is very simple to use. No digital nonsense and I like that a lot. It works really well and it is very spacious from the inside yet VERY COMPACT.I have done rotisserie two times and this oven performed much better than what I expected. It is quiet as well. The parts rotate very nicely with plenty of power and it doesn't feel flimsy. I LOVE the tool they provide to remove the cooked chicken and it is really hard to get burnt. This oven/rotisserie does not fit a turkey but a normal size chicken is totally fine and the two times I cooked them they came out delicious, crispy skin and juicy.This is a really good product and I'm really surprised it has very little reviews. I was also very close in trying the Emeral Air Fryer but I personally don't like the way that technology cooks food. I'm really happy with this Maxi Matic oven and I have very little to complain about it.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vance Kessler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJSKPOJEGSIKCR3GWCJYE6IH7TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QJLPH6QWT79J?ASIN=B0CB994MTS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2021",
                "reviewTitle": "4.0 out of 5 stars One of the best toasters we've owned (and we have gone through a lot of them)",
                "reviewText": "We have used our Elite Gourmet double French door convection toaster oven (ETO4510B) for about a month now. Overall, we really like it. I would have given it 5 stars except for a couple of minor annoyances.Pros:Being able to control the top and bottom heating elements separately allows for fine-tuning some dishes.There is plenty of room for a couple of pizzas or medium-sized baking pans/stones.The French doors allow you to put move the toaster closer to the edge of the counter. (We have a plastic/vinyl backsplash that can warp if it gets too hot).Cons:The doors don’t stay completely open after you open them all the way and are VERY hot.The shelves are a bit thin. I’m used to thicker gauge wires. If you put a heavy dish on it, you can see it sag. However, you can compensate by putting both racks on the same level or using the drip pan as the shelf.There is no simple switch to turn it on, and the only way to turn the unit on is with the timer. We fear the timer mechanism will be the weak link of this toaster. To help preserve the life of the timer, we don’t turn it backward to turn the toaster off. We turn the heating elements off along with the fan and just let the timer run out on its own.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tomaca",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAZ7PRY4VSS57QYY6IHCUTWJGZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37TH2DA4C236P?ASIN=B0CB994MTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "I was looking for a small rotisserie. I didn’t want something that was really big and would take up a lot of space. This is the perfect size!I got one of these for myself and for the person that I am a caretaker for. He is unable to use a stove or oven. This oven is large enough for him to easily slide prepared meals on cooking trays in and out without mishaps or burning himself. He can also use a very small pot inside the oven to heat up soup. It has a timer so he always knows when to remove the food. This is the perfect appliance for him and much better than the standard size toaster oven.The rotisserie is amazing. You have to tie up chicken legs if you cook a whole bird to prevent them from expanding and banging around and dragging inside the oven and possibly damaging the rotisserie turner. Not a cow eater, but my friend is. All the meat cooked on the rotisserie is so, so juicy and cooked to perfection.This was one of the best purchases I’ve ever made.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Pearl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQAEI2QHK3OCVJPO24CGNGJV5SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH8R5T3CH20T3?ASIN=B0CB994MTS",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2022",
                "reviewTitle": "1.0 out of 5 stars Dangerous, But the Dog was Happy. . .",
                "reviewText": "I first used this toaster oven to heat some frozen chicken Kiev. The timer instructions said to tun the dial past 20 and then set to the desired time. Well, the timer refused to allow this. I figured maybe I couldn't turn in back due to the arthritis in my hands, so husband tried and it didn't like him either. So we went to plan B and watched the clock. When the chicken was done, I pulled the shelf out partway and it promptly slid out and dumped the hot chicken onto my lap and then onto the floor (forgot to mention I'm in a wheelchair). The dog ate really well that night, as he doesn't care about the 5-second rule.In short, this oven tries to do too much, and it does none of them well. The doors swing freely and can burn your arm, the large gap between the doors lets hot air blow out, the wire rack is much too flimsy, and the rack supports allow the rack to tilt down and deposit the food on the floor (most users) or in your lap (me). It is way too large for toasting a couple pieces of bread,. We didn't try making anything else lest it sent us to the ER (probably on a weekend). I sent it back and have not had any arguments with its much more cooperative Breville replacement. The Breville has not tried to kill us, either.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heather K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6W4T56LMR4QOKKUJNVUQRO7SAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JSU0V3JWRE72?ASIN=B0CB994MTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Love this!!!",
                "reviewText": "I thought this was also an air fryer. It is not. But I have an air fryer that works fine, so I kept that instead of gifting it, as I had planned.But THIS little beauty...mostly used for a small overn for nachos...lots of nachos! My daughter's new favorite snack is nachos!Then, I used the rotisserie function for an eye roast roast...HOLY COW! Absolutely THEE BEST roast beef I have ever made!!! I mean, not to toot my own horn, but toot toot, I'm pretty great in the kitchen. BUT, the rotisserie action means that it cooked evenly all the way around, with no more done spots! It was AMAZING!!!! Oh, and super easy to clean-idk what these other people are talking about.LOVE THIS THING! I can hardly wait to use it again and again!!!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maggy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 11, 2023",
                "reviewTitle": "Avis",
                "reviewText": "Cet appareille sera défectueuse et non sécuritaire sur le 15 Ampères.A vérifier avant l achat que votre peis3 est de 20 Ampers .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luc C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 16, 2023",
                "reviewTitle": "Très bon four",
                "reviewText": "Camping",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P.L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 17, 2023",
                "reviewTitle": "Spacieux",
                "reviewText": "Les portes devraient être conçues pour rester ouvertes lorsqu'on veut retirer un plat du four ou fournir un accessoire à cette fin.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2023",
                "reviewTitle": "uses less hydro than a stove oven",
                "reviewText": "Written paper instruction not liked... I have cooked chicken, hamburgers, pizzas.. toast more flavour in the meat products..It's what I have been looking for .. really like the convection cooking..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Esperanza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 9, 2022",
                "reviewTitle": "SADLY DISAPPOINTED WITH THIS OVEN",
                "reviewText": "After searching through several different ovens I chose this one hoping that it would be the perfect one. Now that I have used it for a few months I can realistically give an honest opinion. The concept and the intention were a great idea and the design and size are fabulous as I love the french doors, but it ends there. The materials/metals that were used are horribly cheap and extremely below standard. The inner walls are a crappy metal with a finish that you can not even get clean I tried a few products to no avail it does not come clean. After using the rotisserie a few times as we love chicken done this way it is like the residue literally embeds into the metal and will not come off not even with a degreaser and if you try a scouring pad it makes it worse. The walls are so flimsy from not being enforced or braced properly the very thin racks collapse with any kind of weight put on them. There is no way you are putting a large chicken let alone a turkey to cook in there. Needless to say I could go on with more, but alas I feel awful for the people that purchased these ovens also for me after spending this kind of money as I know it will be going in the garbage. I will update and provide pictures of proof as soon as I can I need to change my phone as my camera has stopped working.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}