{
    "remaining_requests": 33817,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cuisinart-TOA-26-Compact-AirFryer-Toaster/dp/B09GL56L4T",
    "body": {
        "name": "Cuisinart TOA-26 Compact Airfryer Toaster Oven, 1800-Watt Motor with 6-in-1 Functions and Wide Temperature Range, Large Capacity Air Fryer with 60-Minute Timer/Auto-Off, Stainless Steel",
        "price": "$104.95",
        "originalPrice": "$129.95",
        "rawPrice": 104.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cuisinart-TOA-26-Compact-AirFryer-Toaster/dp/B09GL56L4T",
        "soldBy": {
            "sellerID": "A13BNE3P7C8THK",
            "name": "Beach Camera Same Day Shipping",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A13BNE3P7C8THK&asin=B09GL56L4T&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B2BPNMFW"
        ],
        "asinVariationValues": [
            {
                "asin": "B07JBLY2D2",
                "variationName": "Size",
                "variationValue": "Compact Airfryer",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09GL56L4T",
                "variationName": "Size",
                "variationValue": "Compact Airfryer Oven",
                "price": "$104.95",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "50",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41fJQ2R4N-L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31PSjU5ap L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41k6y6ctRRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41C4B7Bl1hL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410VFj1JRZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71a4LrhsoRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Cuisinart Store",
            "link": "https://www.amazon.com/stores/Cuisinart/page/9EA87106-FA2E-4134-BB4D-18194A61B989?ref_=ast_bln"
        },
        "brand": "Cuisinart",
        "merchantInfo": "Ships from and sold by Beach Camera Same Day Shipping.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 6199,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 18 hrs 3 mins.",
            "FREE delivery Tuesday, February 20.",
            "Or fastest delivery Friday, February 16. Order within 17 hrs 3 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "COOKING FUNCTIONS: This premium toaster oven and AirFryer, is equipped with an AirFry setting plus toast, convection bake, convection broil, pizza, and warm. With a wide temperature range (Warm-450°F)",
            "CAPACITY: Large enough to AirFry up to 2.5-pounds",
            "SIMPLE OPERATION: Equipped with an adjustable temperature dial and a toast shade selector",
            "INCLUDES: Oven rack, baking pan, and AirFry basket",
            "LIMITED 3-YEAR WARRANTY: Refer to user manual for troubleshooting steps and questions surrounding warranty policies"
        ],
        "description": "Make your meals with ease in the compact, versatile oven that AirFries, bakes, broils, and toasts right on your countertop. Prepare the foods you love-burgers and fries, roast chicken and vegetables, cookies, cakes, and more-with 6 function options. Save space and eat well with the culiry convenience of the Compact AirFryer Toaster by Cuisirt.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Cuisinart"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "13\"D x 18\"W x 15\"H"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Convection Oven, AirFryer basket, baking/drip tray, oven rack"
            },
            {
                "name": "Model Name",
                "value": "Airfryer Convection Toaster Oven"
            },
            {
                "name": "Finish Type",
                "value": "Painted"
            },
            {
                "name": "Power Source",
                "value": "Corded Electric"
            },
            {
                "name": "Temperature Range",
                "value": "250 - 450 Degrees Fahrenheit"
            },
            {
                "name": "Item Weight",
                "value": "1 pounds"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Cuisinart"
            },
            {
                "name": "ASIN",
                "value": "B09GL56L4T"
            },
            {
                "name": "Item model number",
                "value": "TOA-26"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 6,199 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,713 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #42 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "September 17, 2021"
            },
            {
                "name": "Capacity 2.5 Pounds",
                "value": "Wattage 1800 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 1 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Cuisinart AFR-25 Compact AirFryer Cuisinart TOA-26 Compact AirFryer Toaster Oven Cuisinart TOA-60 AirFryer Toaster Oven Cuisinart TOA-65 Digital AirFryer Toaster Oven Cuisinart TOA-70 AirFryer Toaster Oven With Grill Cuisinart TOA-95 Large Digital AirFryer Toaster Oven Cooking Functions AirFry AirFry, Bake, Broil, Pizza, Toast and Warm AirFry, Bake, Convection Bake, Broil, Convection Broil, Toast, and Warm AirFry (+presets), Bake, Broil, Bagel, Pizza, Roast, Reheat and Warm, Dehydrate, Proof, Low and Dual Cook AirFry, Bake, Convection Bake, Broil, Convection Broil, Toast, Grill and Warm AirFry (+presets), Bake, Broil, Bagel, Pizza, Roast, Reheat, Warm, Slow Cook, Dehydrate, Proof, Low, Dual Cook and Preheat AirFry Presets Fresh Fries, Frozen Fries, Wings, Nuggets, Snacks, Vegetables Fresh Fries, Frozen Fries, Wings, Nuggets, Snacks, Vegetables Integrated Cooking Guide ✓ ✓ ✓ Temperature Range Warm to 450° Warm to 450° Warm to 450° 80°-450° Warm to 450° 80°-450° Cooking Timer Up to 60 Minutes Up to 60 Minutes Up to 72 Hours (Dehydrate Setting) Up to 60 Minutes Up to 72 Hours (Dehydrate Setting) Cubic Feet Capacity 0.3-cu.-ft. Interior 0.3-cu.-ft. Interior 0.6-cu.-ft. Interior 0.6-cu.-ft. Interior 0.6-cu.-ft. Interior 0.95-cu.-ft. Interior AirFry AirFry 2.5 Pounds of Wings AirFry 2.5 Pounds of Wings AirFry 3 Pounds of Wings AirFry 3 Pounds of Wings AirFry 3 Pounds of Wings AirFry 4 Pounds of Wings Pizza Bake 8-Inch Pizza Bake 8-Inch Pizza Bake 12-Inch Pizza Bake 12-Inch Pizza Bake 12-Inch Pizza Bake 13-Inch Pizza Toast Toast 4 Slices of Bread Toast 4 Slices of Bread Toast 6 Slices of Bread Toast 6 Slices of Bread Toast 6 Slices of Bread Toast 9 Slices of Bread Accessories Included Basket, Baking Pan/Drip Tray Basket, Baking Pan/Drip Tray and Oven Rack Basket, Baking Pan/Drip Tray and Oven Rack Oven Rack, Stainless Steel Basket and Baking Pan/Drip tray Basket, Baking Pan/Drip Tray, Oven Rack and Grill Oven Rack, Stainless Steel Basket and Baking Pan/Drip tray",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/753b754b-4bfd-4ffc-9802-1bb287c33470.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3f9934c-a7ac-4e59-b6cd-820e8b89cc50.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2234a8a7-dacf-42b0-abbb-63fef7a949ce.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/241e3209-a244-445b-9ebd-ac51e455b3f9.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/079b691d-c69e-4efe-bdf1-732d9417d767.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/37df12fc-c2e3-4556-b6d6-b4f4ccfb9386.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a9f9e70-9d8f-4618-9b40-2785446179b7.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/395c6e06-4e42-448a-930a-4a0d2fa228d1.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f2b8878-b257-41e4-a62d-1feaf2045fa3.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5cdaba50-d0e7-4f0d-be2b-e884a3c8c257.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MZ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUCL5VSRLSFKP2WDAO5UJVSDWPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8EXWZW6S7E9G?ASIN=B09GL56L4T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 8, 2019",
                "reviewTitle": "5.0 out of 5 stars Exceeded expectations!",
                "reviewText": "I bought this in anticipation of a future kitchen remodel, planning to use it in a temporary kitchen (which I'll set up in a bathroom.) So even though I liked the larger Cuisinart model at first look, I decided this smaller unit will fit in my space much better. And I'm glad I got the smaller one - it's more than sufficient if cooking for just a few people (and it's a lot less expensive!)So I've been putting through its paces for the last week. And I have to say - wow! This lil guy is really useful even in a full-service kitchen with a regular big oven, especially if you're cooking for one or just a few people . So far I've made crispy breaded chicken tenders, baked potatoes, air-fried sweet potatoes, roasted Cornish hen, baked apples, air-fried beet chips, pizza, roasted chickpeas, and toast. (Contrary to some reviews here, it can toast bread just fine - the instructions are in the manual, in some notes right before the recipes.)Everything turned out very well (except one time I did not pay attention and set the temperature wrong and burned my toast.) The chicken was very tender and juicy, and the baked potatoes and roasted hens achieved that nice crispy skin. Roasted chickpeas were crunchy, so were the beet chips and the breaded chicken.Air-fried food doesn't taste the same as food fried in oil - air-frying is essentially baking with hot air. So this method will deliver a good crunch, but add dipping sauces or even just ketchup if you miss the taste of the oil.Now the dials are not very precise - there is no \"click\" between different settings so you have to eyeball it. I did not have any problems with the timer, as some have noted here. The instructions say to twist the dial past your desired time, then backwards to what you want. I've been doing that and the timer seems to be working fine.I used some of the recipes in the included manual and some that I found online, following suggested temperatures and cook times and so far everything has come out great. If you need to open the door early to check your food or flip it, the fan will stop, but the timer will keep on ticking if it has not reached the end yet. So you may have to add a little time to make up. I do wish it had a light so that you didn't have to open the door to check the food - I guess the bigger model has one.When using the oven, don't forget to slide the unit forward to the front edge of your counter; otherwise when you open the door, the handle will rest on the countertop and prevent you from opening the door all the way, which makes it difficult to slide the tray out. But you're supposed to move it away from the wall anyway when using it - it vents heat back there, and the top gets hot as well. So just slide it forward when using, away from the wall and any overhanging cabinets.This smaller oven will not accommodate a whole chicken. However chicken pieces, or 2 Cornish hens fit just fine.The basket and drip tray seem kind of flimsy, but were not too difficult to clean. I have been using parchment paper to line the drip pan each time I use it, which helps a lot. And a nylon brush is useful for cleaning the basket. The interior of the oven wipes clean very easily with a paper towel or sponge.This thing exceeded my expectations...I call it my Easy Bake Oven and already prefer it to the big oven for many tasks. Five stars!",
                "reviewVotes": "116 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "frenchpete",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHEMFMAZF62C575VN2Y3HPFZYQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MHMEVS4HA5HL?ASIN=B09GL56L4T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2019",
                "reviewTitle": "5.0 out of 5 stars Only had it for a couple of weeks....like it a lot! (Will update this in a month or two)",
                "reviewText": "One of the big problems with reading the reviews on this product is that the reviews are for multiple products on this page. This of course is going to cause much confusion. The product I am reviewing is the small little guy, the AFR-25.What I like:1 - It's small, takes up minimal space on counter.2 - Very easy to use, just two knobs; temp and timer.3 - Looks very nice, stainless steel front.4 - Air fry basket/tray is quite large; perfect for a 2-3 people.5 - It cooks fast; so far everything we had cooked has taken less time than what was stated in the manual.6 - I like that the heat and fan pause when you open the door (but the timer keeps on going)7 - No need to fire up the big oven or make a mess frying in a pan.The down-side:1 - It gets hot in the back BUT not on top or underneath; I think this is probably the case with most toaster oven type airfryers.2 - No light inside; but it is the cheapest model.3 - Probably my biggest issue is with removing the tray when hot; it's hard to grasps the tray and pull it out with pot holders (I use some kitchen tongs to pull it partially out before grabbing it with the pot holders)4 - The mechanical timer; not the most accurate but gives you a 'ballpark' time frame. We always use another kitchen timer. Also, it states in the manual, that you must turn the timer past 20 minutes and THEN back down for anything below 20 minutes.5 - This is not \"set it and forget it\"; there is a learning curve to using it and figuring out what works best. I don't think this is a big deal, but it might be off-putting for someone looking to just throw some food in a basket and push a button.All in all, I like this little air fryer: good value, great looks, perfect for compact kitchens, cooks fast, minimal clean up (we line the bottom tray with foil and spray the basket with oil. A little soak and the baskets clean. We have done chicken wings (about 18 at one time), frozen french fries twice, panko coated crispy shrimp (my fav), chicken cordon bleu, jalapeno poppers, chicken drumsticks (9 large), zucchini with onions, toast (2 minutes worked for me) and salmon fillets (awesome). Haven't burned anything yet, everything turned out great so far. We do watch the time closely and use a meat thermometer.So far thumbs up from me; it is already changing the way we cook stuff.Cheers",
                "reviewVotes": "96 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steph",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHLFE6W2ZOMHPVFQPKQTTZWERMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XYMXN2TRQFL1?ASIN=B09GL56L4T",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Pretty good...",
                "reviewText": "We had a Cuisinart toaster oven before this that my son took with him when he moved out. We decided to upgrade to this combo oven and I'm kinda surprised about all the raving reviews.The toaster is a little slower than the original one, which is my main complaint. The timer dings instead of beeps (like an old fashioned oven timer) and ticks like a bomb.I do really like that it is small, but still has plenty of space.However, for the price, you cannot complain. It does everything it's supposed to.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ImanIman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 13, 2023",
                "reviewTitle": "Used item. Many scratch les and dents. Door doesn’t get closed!",
                "reviewText": "The media could not be loaded. I received the item in terrible condition. Used item. Many scratch les and dents. Door doesn’t get closed!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61pFvO4Bx6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71vYQZb06LL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/D1dB2JwVAgL.mp4"
                }
            },
            {
                "reviewerName": "pflowers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 25, 2022",
                "reviewTitle": "Evenly bakes and fast easy cleanup",
                "reviewText": "I have had this oven over 2 years ,and it still cooks everything, quickly, great for summer baking, casseroles,pies, ribs chicken, lasagna",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Augusto Gomez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 18, 2020",
                "reviewTitle": "lo usamos casi para todo",
                "reviewText": "Sustituimos todos los alimentos fritos en aceite ahora usando el Air fryer, el pescado queda riquísimo, nuggets etc, para calentar pizza la deja crocante",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aranzazu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 26, 2020",
                "reviewTitle": "super buena",
                "reviewText": "Tal cual la descripción del producto, funciona perfecto, la comida sabe muy bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lindsay Robinson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 2, 2022",
                "reviewTitle": "Arrived quickly and easy to use",
                "reviewText": "Cooks food so fast. Way better than using microwave for re-heating foods like pizza",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$103.90",
                "sellerName": "Highflyer214",
                "sellerRating": "4"
            },
            {
                "price": "$107.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}