{
    "remaining_requests": 33610,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Chefman-Convection-Rotisserie-Oil-Free-Convenient/dp/B09XBPMZRG",
    "body": {
        "name": "Chefman Extra Large Air Fryer and Convection Oven with French Doors and Rotisserie Spit, The Easiest Way to Cook Oil-Free, Double Wide Glass Windows Open for Convenient Access and Viewing, 24.5 Liters",
        "price": "$129.99",
        "originalPrice": "$179.99",
        "rawPrice": 129.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Chefman-Convection-Rotisserie-Oil-Free-Convenient/dp/B09XBPMZRG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B12XGTY7"
        ],
        "asinVariationValues": [
            {
                "asin": "B09XBPMZRG",
                "variationName": "Style",
                "variationValue": "Black - French Door",
                "price": "$129.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07WNXWSV7",
                "variationName": "Style",
                "variationValue": "Stainless Steel",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41fTdSRA7QL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41d6AbeBi6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mWxVPMq L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LlQNa8E L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yum58ebxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EgZd4Z0rL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51k2THBmw7L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Chefman Store",
            "link": "https://www.amazon.com/stores/Chefman/page/91E18252-ACE3-4B71-AB0D-D43DCB84F22D?ref_=ast_bln"
        },
        "brand": "Chefman",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 3690,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 2 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "AIR FRY LIKE NEVER BEFORE: The world’s fastest, healthiest, and most convenient way to air fry has made its way to your countertop. Get dinner on the table faster than ever with easy access to delicious dishes through durable double French doors and cool-touch handles. Watch your favorite comfort foods cook to crispy, healthy perfection with wide windows and an illuminating interior light.",
            "AN ALL-IN-ONE EXPERIENCE: Master every single meal with the Chefman Extra Large Air Fryer and Convection Oven with French Doors. No matter what dish you’re in the mood for, you can air fry, broil, toast, rotisserie, bake, and keep warm from 200°F to 450°F with incredibly smooth dial control.",
            "COOK FOR A CROWD: Your search for the perfect family-size air fryer has come to an end. Let this oven be your go-to gadget for your partner’s, kids’, or roommates’ favorite grub. Prep a 12-inch supreme pizza or toast up to 6 slices of your favorite breakfast bread all at once. It gets even better—simply wipe down the oven with a damp cloth and load the wire rack, basket, and rotisserie spit in the dishwasher for cleanup in a breeze.",
            "ACCESSORIES FOR EVERY TASK: You can now take on any cooking task with absolute confidence. Air fry tasty chicken tenders in the included basket, cook a whole chicken on the rotisserie spit, bake your world-famous banana bread on the pan, or whip up french fries to a golden finish on the wire rack.",
            "WARRANTY INFO: cETL approved with advanced safety technology for long lasting durability, and 1-year assurance provided by Chefman; For information on how to use your product, scroll down for a PDF User Guide.120 Volts/1700 Watts"
        ],
        "description": "Looking for an air fryer that does it all? The Chefman Extra Large Air Fryer and Convection Oven with French Doors takes convenient and world-class cooking to a whole new level. This innovative, all-in-one oven has every feature you need to feed your dinner company healthy and delicious dishes without fail. Easily access your comfort food favorites through wide double French doors, and watch it fry to crispy perfection with crystal-clear windows and ultra-bright built-in light. Air fry your kids’ favorites, rotisserie an entire chicken for dinner, toast breakfast for two, or bake the dessert of your dreams. No matter the crowd, cooking method, or cuisine, this air fryer has you covered. With a family-size, 24.5-liter capacity, 9-inch by 13-inch interior, wide temperature range of from 200°F to 450°F, cool-touch handles, and superior dial control, you can take control of every task. What’s more—this oven comes with six handy accessories so you can whip up masterful meals every night of the week. Chefman has you covered. With a 1-year assurance, you can purchase and cook worry-free. This product is cETL- approved with advanced safety technology for long-lasting durability. For information on how to use your product, scroll down for a PDF User Guide. 120 Volts/1700 Watts",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Chefman"
            },
            {
                "name": "Color",
                "value": "Black - French Door"
            },
            {
                "name": "Product Dimensions",
                "value": "15.74\"D x 17.25\"W x 14.76\"H"
            },
            {
                "name": "Special Feature",
                "value": "Dishwasher Safe Components"
            },
            {
                "name": "Control Type",
                "value": "Touch Control"
            },
            {
                "name": "Included Components",
                "value": "User Guide"
            },
            {
                "name": "Model Name",
                "value": "Extra Large Air Fryer and Convection Oven"
            },
            {
                "name": "Item Weight",
                "value": "21.6 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Chefman"
            },
            {
                "name": "ASIN",
                "value": "B09XBPMZRG"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "RJ50-FDAF-M25"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 3,690 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#99,963 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #320 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "April 6, 2022"
            },
            {
                "name": "Capacity 24.5 Liters",
                "value": "Wattage 1700 watts"
            },
            {
                "name": "Material Alloy Steel",
                "value": "Item Weight 21.7 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Multiple rack slots let you cook different foods at one time Rotisserie option cooks chicken to crisp-skinned tender perfection Bake small-batch treats without heating up the whole kitchen",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c85631e0-f2fb-4982-9005-7243275bb417.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/274babfd-c1d7-462e-8cbb-c4aa01fdfbc9.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0636b3f8-1270-4c6a-adde-fe2da808848b.__CR0,0,1600,1600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Easy as pie Intuitive controls and fast convection cooking makes baking easy as can be. The Keep Warm function allows you to warm up any leftovers, too!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f227c66f-ebcd-4452-8492-c7f4ed815f3a.__CR0,0,1600,1600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8f01f177-e60d-42b5-80b2-4af6b277f5ee.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c85631e0-f2fb-4982-9005-7243275bb417.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/274babfd-c1d7-462e-8cbb-c4aa01fdfbc9.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0636b3f8-1270-4c6a-adde-fe2da808848b.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f227c66f-ebcd-4452-8492-c7f4ed815f3a.__CR0,0,1600,1600_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Uninterchangeableless",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZQ72RQ2U7CWHKXYPIVYNXCWPMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR1IABXQB5552?ASIN=B09XBPMZRG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2020",
                "reviewTitle": "5.0 out of 5 stars Good product, excellent customer service!",
                "reviewText": "I bought one of these for my mom for Christmas since I had a similar model and am really happy with it. She didn't get it out & start using it until January, but shortly after there was a problem with the cord. There was sparking and an electrical smell, so she immediately unplugged and stopped using it. She only just told me about it a few weeks ago (it's April now) so I contacted Chefman & let them know. We answered a few simple questions they had & sent them some pics. Their customer service was EXCELLENT! They were concerned, helpful, efficient, and sent out a replacement within days. I don't blame them entirely for the faulty unit, since I know sometimes things like this happen. I'm glad there was no fire for sure, but knowing the product since I have one too, I know it's a good brand. Now I'm even more convinced that the company is doing the right thing by their customers. I expressed my appreciation, and they didn't even ask me to write a review. I just had to put the word out. I would still highly recommend the product and next time I'm looking for a kitchen gadget, Chefman will be my first stop! Excellent customer service!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Missy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE32BWRFR5LVPISCV4IPLH6LMIRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CAT9CSYSF3O9?ASIN=B09XBPMZRG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 26, 2020",
                "reviewTitle": "5.0 out of 5 stars Great oven, but air fry not working",
                "reviewText": "I really liked the air fry on this oven, but unfortunately the air fry has recently gone out.. I have power to bake and toast but not air fry.. when I put the air fry on the power button kicks off... this was purchased in Feb 2020 so its only been 3months and only used the air fry a few times... I have purchased a extended warranty, but hopefully this will be covered under the manufacture's warranty This is the one that I purchased : Chefman Air Fryer Toaster Oven, 6 Slice, 26 QT Convection AirFryer w/ Auto Shut-Off, 60 Min Timer; Roast, Bake, Fry Oil-Free, Nonstick Interior, Accessories & Cookbook Included, Stainless Steel/Black. All in all the oven worked really great. The air fryer cooks wonderful and I love the multifunction options the oven has. The company worked well with me and is sending me another one. No hastlesOverall rating.I would appreciate hearing from you asap.. I do like to use the air fry..Please contact me by email : mimicaillier@eatel.netThanksMary Bagala",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDCITMOZML676DGNP47NPBJ3BFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MI7T9Y7EVGK2?ASIN=B09XBPMZRG",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 14, 2022",
                "reviewTitle": "1.0 out of 5 stars Chefman will not honor their warranty",
                "reviewText": "I gifted a Chefman model RJ50-M purchased from Amazon Warehouse on 6/27/22 for my daughter's wedding anniversary on 7/25. When the box was opened the only thing wrong was the manufacturers box had a dent in the corner and the oven was still packed from the manufacturer and nothing seemed wrong with it.The air fryer is awesome, makes perfect toast, but when it comes to baking it's a nightmare.Every single thing I've tried to bake, either normal or convection, comes out burnt to a crisp. I follow the directions on the package, set the proper time and temp required, and get burnt food.I have tried setting the temp lower and time shorter, still burned food.I'm thinking there is something seriously wrong with it, so i stopped using it because I'm afraid it might burn down the house.My daughter contacted Chefman and requested help with the warranty Please let me know if you can help.Got for our anniversary 7-25 and started burning food right away. The first thing i cooked in the oven was pizza, it was so burned the chickens wouldn't eat it. Every pizza, crescent rolls, anything on bake burned to a crisp, even when i set the time and temp lower than directed. The other modes, toast, air fry are perfect. I stopped using it and went back to my old toaster oven which I've had for years, on 8-15. So used for almost a monthShe submitted the required information that they asked for and Chefman responded:After reviewing the documents sent over, your product is not covered under our warranty.We can only cover new items and your Amazon order confirmation says it was Used-Like New.Please reach out to Amazon and let them know you would like a refund or an exchange because we can not offer you any warranty services.Best,DebraCustomer Support RepresentativeMy return date ended on 7/27/22 and the oven I purchased doesn't work and now I am out the money I spent and my daughter does not have a toaster/air fryer oven in working condition.The company will not honor their warranty because I purchased it it from Amazon Warehouse in Used-Like New condition.I need a resolution",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Escamilla",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 14, 2022",
                "reviewTitle": "Buen tamaño interior y varias funciones de operación.",
                "reviewText": "Adquirí este producto por su espacio interior, el cual puede ser una limitante en freidoras de aire convencionales.Por fuera es de apariencia, y tamaño, similar a cualquier horno eléctrico, la puerta frontal es de cristal con bisagra, abre hacia abajo.Cuenta con una rejilla para asador o dorador, una charola para recolectar grasa y moronas, una charola para asar y una canastilla para la función de freidora de aire.Los controles son por perillas; tiene temporizador, selector de temperatura, selector de función y modo tostador. Cuenta con un botón para encender la luz interior.Sus funciones de cocinado son: asador, asador por convección, horneado, horneado por convección, dorador, freidora de aire y tostador. Estas funciones permiten aprovechar el aparato más allá de solo calentar o freír productos congelados.Hasta ahora he cocinado pescado, hamburguesas de res, hamburguesas de pollo, alitas boneless, pechuga de pollo. Y en todos los casos los alimentos han quedado bien cocinados, jugosos y sin resecarse o quemarse. Prácticamente no necesitas aceite extra para cocinar y los alimentos tienen una cocción uniforme (recomiendo \"voltear\" las hamburguesas a la mitad del tiempo estimado de cocción).El aparato llega a la temperatura ideal más rápido que un horno de gas; pasar de temperatura ambiente a 200 centígrados le toma de 5 a 8 minutos. Conserva bien la temperatura con la puerta del aparato cerrada (nota: el equipo se apaga si se abre la puerta).El equipo también se calienta por fuera, pero sin llegar a quemar o causar molestia al tacto; sin embargo recomiendo que sea utilizado por personas aptas para el uso de equipos de cocina que generan altas temperaturas.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LorieLorie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 1, 2020",
                "reviewTitle": "Great little oven!!!",
                "reviewText": "I bought this oven/air fryer to replace a smaller little toaster oven I had, and I'm glad I did. This countertop oven not only fits, and looks great on the counter, but it is fantastic at roasting/baking/toasting, and that air fry!!! oh the chicken wings taste amazing!!! The unit is easy to use, easy to clean (the removable spill tray is very handy) and cooks/bakes like a traditional kitchen oven. To date I have baked home made bread in it, cookies, roasted chicken/beef, chicken wings, and toasted up to 6 pieces of bread for toast. The top and sides do get a little warm but as long as you heed the recommendations in the user manual of keeping it at least 2-4 inches away from the wall, or other appliances on your countertop, it's good to go. I highly recommend this oven if you are in the market for something this size.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81dG+cR2HPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81ShPtY+vqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "FdoArj.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 29, 2021",
                "reviewTitle": "Práctica",
                "reviewText": "Excelente freidora. El acero inoxidable ofrece una imagen aséptica e impecable. Se percibe de muy buena calidad. Mi esposa hornea panes y otros productos con ella. Cuando se trata de confeccionar platillos caseros o de recalentar es más práctica y funcional que un horno convencional, engorroso por su tamaño. Simplifica las labores de cocina para un matrimonio ya solo.Espaciosa, acepta un recipiente de 31 cm con suficiente espacio lateral para manipularlo.Las temperaturas son bastante precisas, aunque solamente indica los grados en F, no en C°. Cocina bien, aunque no es clara la diferencia práctica entre los modos “bake” (hornear), “convection bake” (hornear por convección) y “Air Fry” (freír con aire), pues en cualquiera de ellos produce buenos resultados con diversos platillos. Posiblemente después de un uso prolongado se puedan discernir diferencias sutiles. Sobre su durabilidad, es pronto para decir.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 21, 2021",
                "reviewTitle": "Stopped working properly",
                "reviewText": "This product was working really well until a few days ago, can't turn the setting knob( for bake, airfry broil etc) and it stops working after a couple minutes. If I could go back to the purchase sate I would not buy this again. I have contacted the manufacturer but no response yet.. and it seems everyone who bought around the same time is having the same problems. I wouldn't buy. Now I have to find another toaster oven airfryer.. such a waste of money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PATRICIA O.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 14, 2023",
                "reviewTitle": "Hornito feliz",
                "reviewText": "Es muy funcional, aunque un poco tardado en el cocimiento de algunos platillos, pero si ayuda.... Gracias",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$128.95",
                "sellerName": "Mountainside Liquidations",
                "sellerRating": "0"
            }
        ]
    }
}