{
    "remaining_requests": 33823,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Air-Fryer-Nonstick-Temperature-Dishwasher/dp/B07R6TZMZL",
    "body": {
        "name": "CHEFMAN Small Air Fryer Healthy Cooking, 3.6 Qt, Nonstick, User Friendly and Dual Control Temperature, w/ 60 Minute Timer & Auto Shutoff, Dishwasher Safe Basket, Matte Black, Cookbook Included",
        "price": "$59.40$45.30",
        "originalPrice": "$59.40",
        "rawPrice": 59.4,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Air-Fryer-Nonstick-Temperature-Dishwasher/dp/B07R6TZMZL",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BVNVJBHW"
        ],
        "asinVariationValues": [
            {
                "asin": "B085GN68LC",
                "variationName": "Color",
                "variationValue": "2 Quart Black",
                "price": "$49.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41EfD0xmTgL._SS36_.jpg"
            },
            {
                "asin": "B07R6TZMZL",
                "variationName": "Color",
                "variationValue": "3.5 Qt - Manual Black",
                "price": "$59.40",
                "variationImageURL": "https://m.media-amazon.com/images/I/41cQ-qZqqBL._SS36_.jpg"
            },
            {
                "asin": "B07R7XR59S",
                "variationName": "Color",
                "variationValue": "3.5 Quart Black",
                "price": "$64.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41J7LKQiMmL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "88",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41cQ-qZqqBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51-AvFuqQVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Rg-tYMtDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rh1Wnrb9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uyEQrGFRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uqJxV85RL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hyuWeh30L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Chefman Store",
            "link": "https://www.amazon.com/stores/Chefman/page/91E18252-ACE3-4B71-AB0D-D43DCB84F22D?ref_=ast_bln"
        },
        "brand": "Chefman",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 17964,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 4 hrs 4 mins",
            "FREE delivery Monday, February 19. Order within 4 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "HEALTHIER FRYING: This air fryer makes ‘healthy fried foods’ a reality. Temperature ranges from 200-400 F allows you to cook at your desired temperature, achieving a healthy, crispy, fried finish using at least 98 percent less oil than traditional fryers. Air fry vegetables, pizza, frozen foods and leftovers – this air fryer evenly crisps every inch of your food.",
            "SPACE SAVING BASKET: A sleek, rounded shape and matte black finish earns this air fryer a prime spot on countertops- all while remaining compact and easy to store. The 2-in-1 tank & basket allows for maximum capacity with a small footprint, saving space on your counter and in your cabinet; perfect for any small kitchen, dorm, office, RV trips, and more.",
            "PERFECTLY CRISPY RESULTS: Achieve perfectly crisp results for a wide variety of foods, with little or even no oil. The Dual knob controls both temperature & time; 60-minute integrated timer easily lets you air-fry everything from frozen veggies to mozzarella sticks, chicken or fries, and even re-heat yesterday's dessert. No need to worry about overcooking – once the timer is up, the fryer will automatically shut off.",
            "EASY CLEAN: The Black non-stick basket is dishwasher safe, making clean-up a breeze. When you’re hand washing, keep the air fryer in great shape by using soft sponges and cloths. (Abrasive sponges like Brillo pads are NOT the air fryer’s friend.)",
            "RESOURCES: cETL approved with advanced safety technology for long lasting durability, & 1-year hassle-free assurance provided by Chefman, so you can purchase worry-free - we've got your back. For information on how to use your product, scroll down for a PDF User Guide, QuickStart Guide and Recipe Book. 1200 Watts/120 Volts – RJ38-V3-DC35"
        ],
        "description": "Black : Achieve the deep-fried flavor you love, without all the oil and added calories. The Chefman TurboFry™ Air Fryer allows you to bake, fry and roast like a pro. This airfryer requires little to no oil, so there’s less of that fried oil smell lingering in the house and less fat that you’re consuming. It’s large Black capacity and flat basket gives you the ability to cook enough for a hungry crowd all at once. Skip the microwave! Reheat soggy leftovers in the air fryer to return them to their original texture. Make better-for-you fries that are just as crispy and tasty, roast chicken thighs, or heat up leftovers for a quick and easy meal. The temperature control with 60-minute timer automatically shuts off once food is done, so you never have to worry about burning or drying out your food. Its space saving basket is removable and dishwasher safe for easy clean-up, so you’ll have more time to dream up your next air-fried meal!",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Product Dimensions",
                "value": "8\"D x 8\"W x 9.5\"H"
            },
            {
                "name": "Color",
                "value": "3.5 Qt - Manual Black"
            },
            {
                "name": "Capacity",
                "value": "3.6 Quarts"
            },
            {
                "name": "Material",
                "value": "Iron + Non Stick Coating, Plastic"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Roast, Bake, Reheat"
            },
            {
                "name": "Output Wattage",
                "value": "1200 Watts"
            },
            {
                "name": "Item Weight",
                "value": "7.4 pounds"
            },
            {
                "name": "Brand",
                "value": "Chefman"
            },
            {
                "name": "Wattage",
                "value": "1200 watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Model Name",
                "value": "Black"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Min Temperature Setting",
                "value": "90 Degrees Fahrenheit"
            },
            {
                "name": "Controller Type",
                "value": "knob"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Max Temperature Setting",
                "value": "400 Degrees Fahrenheit"
            },
            {
                "name": "Manufacturer",
                "value": "Chefman"
            },
            {
                "name": "ASIN",
                "value": "B07R6TZMZL"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "Black"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 17,964 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,979 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #97 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "June 25, 2019"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0dc588b9-2051-4d5e-8eb2-9527f8d17223.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7dffda5f-443f-4b12-8bdb-8f602b02630f.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8cc845ea-560d-4901-803f-0e8f866dddb0.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c9b6fa3-1787-44c4-9e0f-02a7e4b792ca.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8f99925f-186d-45ff-b4fe-a0db5ca7d77c.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/498e7e70-2fa9-4243-931c-9944f9036ec2.__CR0,0,1464,600_PT0_SX1464_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joseph F. Bristow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERRZCLSKY6UUAOEX6L3XQ2R6UXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QS5GYAQEKOXT?ASIN=B07R6TZMZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Small Batch Air Fryer",
                "reviewText": "The Chefman 2-Quart air fryer is perfect for single serving preparations. I have always wanted to make fries and tater tots with a crispier outside, but haven't been able to find a way, until now. This air fryer does an amazing job, and it does it in less time than it usually takes to heat up frozen fries or tots. I've done onion rings, chicken nuggets, and fried mozzarella, all of which came out perfectly.The timer and temperature control are analog, but the markings are clear, and it is easy to set the time and temperature relatively accurately. Because most foods require cooking times of 10 minutes or less, which represents the low end of the timer, I use the timer on my microwave to make sure the item cooks for the proper time. I usually move the timer to a higher setting, then when the microwave timer goes off, I move the timer to zero to shut off the fryer (as recommended by the manual). That is probably not necessary, but it gives me piece of mind that the food is not being over- or undercooked.The small size of the fryer makes it easy to store, particularly in a small kitchen like mine. With counter space at a premium, it was important to find a fryer that I could easily fit in a cabinet. The Chefman definitely satisfies that requirement.The fryer is easy to clean, with only two parts, the basket and the screen insert, that need to be washed. Water can get inside the plastic front of the basket and inside the rubber pieces that prevent the screen from moving inside the basket during cooking. I leave those out to allow them to dry thoroughly. I haven't put them in the dishwasher, since it is easy to clean them by hand, but they are dishwasher safe, according to the manual. Care needs to be taken when washing the screen, as the rubber pieces can slip off.Overall, the Chefman 2-Quart Air Fryer has been an excellent addition to my kitchen. The crispy fries and tots were well worth the purchase.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Retro Rex",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNKKF6G6BKS42HJZGJIFX7MGRQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J77XN6DQ11V8?ASIN=B07R6TZMZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2019",
                "reviewTitle": "5.0 out of 5 stars An Excellent, Affordable Air Fryer",
                "reviewText": "I absolutely love this air fryer. It's easy to use and does an excellent job of mimicking the effect of deep frying without all the denatured oil involved in the process.Its temperature dial is easy to adjust. Its timer dial is easy to set. Its fryer basket is easy to clean (just remove the grating and wipe it clean). During operation, the fryer basket can be removed, at which point the fryer turns itself off while the timer continues to run; this allows the user to safely check on the food at any time and even end the cooking session before the timer has run out. A blue light at the top shows that electricity is being supplied to the fryer; a red light next to it indicates that the fryer is heating the food. Wax paper or air fryer liners can be added so that the food isn't in direct contact with the fryer basket and so that any batter won't be in contact with the fryer, and the fryer works perfectly with them.Thus far, the fryer has conferred on my recipes all the crispiness that makes fried foods so desirable, but this air fryer has made the recipes all the more healthy by eliminating the need for oil-based frying. French fries, onion rings, vegan fish and chips (battered tofu soaked in a lemon-kelp-dill marinade and coated with kelp sheets), vegan sausages--you name it. The air fryer cooks them to tasty, crispy delights.There may be more expensive fryers with additional bells and whistles, but this one fits my needs perfectly and delivers ten times out of ten. I highly recommend this fryer.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emily",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDLLMI4MNHIE7EID4CN25KMRRHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25CQXL1JHJBDJ?ASIN=B07R6TZMZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars My first air fryer - very satisfied with it!",
                "reviewText": "This was my first air fryer and it was a great experience! I am now on the bandwagon for air fryers lol, I think they are fantastic! They are super easy to use and very efficient. I actually loved mine so much that I got one of the same kind for my mom for Christmas!This is the perfect small air fryer and has never let me down. I always get good results.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Atlanta, GA Shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGTOEVSNTVYHRTBNXZV5XVUEWSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I3M3PTZSWRGX?ASIN=B07R6TZMZL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 30, 2020",
                "reviewTitle": "4.0 out of 5 stars Small. Useful. Not as convenient.",
                "reviewText": "This is very small, but convenient.Purchased because I wanted a healthier way to cook wings and french fries. We spoil ourselves at least 2 Saturday's a month. Due to the cook capacity, it's even healthier because I can't cook as much at one time. Size capacity limits to about 10 wings or less. It works better for drummett and flats as opposed to larger chicken pieces. If you have full wings, you can only fit 4. Due mostly to capacity and necessity to flip items, fries cannot be cooked with wings. I am not crazy about that as it now requires two different cook schedules as opposed to using my oven to bake an entire bag of wings and some fries.It does cook wings up perfectly! They do taste slightly better as the juices remain in the meat as opposed to being present on my tray when I bake in the oven. For cooking meals....hmmmm. Don't think its ideal. For example, you could do ONE chicken breast or 2 small thighs in the unit, but you STILL need a stove top pot for rice and possibly another pot for sauteed veggies if you aren't going to do a salad. I think this is more feasible for snacking if you can find items that fit.While cooking capacity is small, the unit's girth is probably bigger than a blender. Despite it's outer size, most of the unit is the convection oven. Looking at it and its size, I can't imagine how large a 4 liter unit would be on a counter top.The cooking appliance is well made. Sturdy and well coated, you can literally just wipe it clean. (Of course you wash with soap and water. Just saying there is so little debris created while cooking.)Have not used for baking anything yet, but it appears that the capacity would allow for 2 cupcakes to be baked or 1 large muffin. This is also why I joke and say you'll eat healthier. LOL. You're just cooking such small portions.Its handy, but I think it's better for quick snacking - pizzeria rolls, just fries, hot dogs, etc. Despite less grease, I would prefer regular cook top and oven preparation for volume. I much prefer making enough dinner food at night to pack for the next day's lunch. I prefer not to brownbag sandwiches.I bought the unit largely on its comfortable price and reviews. Based on my experience with it, I would recommend it for a 1 person home or for a home with people who would like to minimize use of their microwave for better tasting snack items. The microwave tends to make frozen processed foods taste rubbery. (I could see how the larger units that allow for tiered cooking - perhaps wings on bottom tier and fries on top tier or small steak at the bottom and baked potato at the top - could be very useful for drastically reducing use of cook top and larger oven and eliminating dirty pots and pans for quicker clean up.)",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bret D. Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5BVOPLBIVUVNCR4JR2QW5KBZKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NM8850ZANBQI?ASIN=B07R6TZMZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for quick meals",
                "reviewText": "Works well , easy to clean. Saves calories since it doesn’t use oik",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jess",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 8, 2024",
                "reviewTitle": "Muy buena",
                "reviewText": "La encontré con una promoción y me ha sido muy útil, tiene muy buen funcionamiento.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adriana G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 15, 2022",
                "reviewTitle": "Práctica y muy útil",
                "reviewText": "Fácil de usar, lavé la charola y calenté una hogaza de pan antes de usarla por eso que mencionan de los químicos tóxicos. No deja algún tipo de sabor. Recomiendo revisar los alimentos de vez en vez para que puedan cocerse parejos. Hay muchas recetas en internet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susie  ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 21, 2021",
                "reviewTitle": "The perfect size for one person",
                "reviewText": "I've only used it once so far but I think it will get a lot of use this winter. I made two small breaded pork cutlets in no time at all and they were great! Easy to use, only a temperature and timer dial and simple to clean. It's small but perfect for just me by myself. Day 2 of use. I had one potato and made French Fries. They turned out perfect.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allyson P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 18, 2021",
                "reviewTitle": "Never Use Oil Again!",
                "reviewText": "Amazing and easy to use! It is perfect for two people. Way healthier and in no oneway depletes the flavour. Perfect for so many foods. I have even made cinnamon rolls in this.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yflyer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 4, 2020",
                "reviewTitle": "Works very well for 2 people",
                "reviewText": "Easy to use. For a family I'd suggest an 6.8 Quart Fryer. We bought a 3.5 Quart due to storage limitations-it's fine for two people. It works well, especially with recipes for air fryers. Sometimes you have to modify times:ex. with this one, I find doing frozen fries at 390˚F for 4 minutes-shaking-then 4 minutes is the perfect time. It's not always necessary to lay (say fries) spaced out on the bottom of the fryer.-you can try a bunch at a time. If you have to do things in batches, then to make sure they are all hot at the same time, you can add the batches that are cooked back in the air fryer and heat them up 1 minute so everything is hot. So far I've sone chicken wings from scratch (look up \"Fool Proof Air Fryer Chicken Wings\") , frozen chicken strips, french fries from scratch, and frozen french fries-all came out good, and with a few timing tweaks, really good. I like the speed with which food is cooked (eg. Wings Oven time vs, Air Fryer). It's a breeze to clean. Heats very quickly. Only CON so far is once the timer is set, you can't turn it back off. So if a recipe calls for say 24 minutes and shake or turn at 12,For my convenience, I set the timer for 12 minutes-the bell goes off, I do what's required and reset for another 12 minutes. There are lots of recipes on the interne-veggies, poultry, beef, fruits, etc.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}