{
    "remaining_requests": 10967,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Stroller-Object-Lessons-Amanda-Parrish/dp/1501386662",
    "body": {
        "name": "Stroller (Object Lessons)",
        "price": "$11.26 $7.20",
        "originalPrice": "$14.95",
        "rawPrice": 11.26,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Stroller-Object-Lessons-Amanda-Parrish/dp/1501386662",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61cPGxatEkL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Amanda Parrish Morgan",
            "link": "https://www.amazon.com/Amanda-Parrish-Morgan/e/B09Q685ZYK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by glenthebookseller.",
        "customerReview": "5.0 out of 5 stars",
        "customerReviewCount": 11,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 19 hrs 29 mins",
            "$3.98 delivery Monday, March 4."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "History & Criticism",
                "link": "https://www.amazon.com/History-Criticism-Literature-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10204"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloomsbury Academic (October 20, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 152 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1501386662"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1501386664"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 5.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.8 x 0.55 x 6.4 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,348,796 in Books (See Top 100 in Books) #819 in Philosophy Aesthetics #1,326 in Customs & Traditions Social Sciences #5,517 in Literary Criticism & Theory"
            },
            {
                "name": "Customer Reviews",
                "value": "5.0 5.0 out of 5 stars 11 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "kc mo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQJIHYOOAYPLKE3UATJTJFFXHUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT21NFVCL600O?ASIN=1501386662",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2023",
                "reviewTitle": "5.0 out of 5 stars A Wonderful read",
                "reviewText": "I don't have children and still I enjoyed this book. Amanda is a talented writer so it is easy to relax and read.. It has been quite a while since I have been around this age group through my friends. I babysat for many of my friends because I get along with kids. This book gave me the sights and sounds of it again. Snow and summer, long sunsets, rain, new cut grass. The smell of kids both clean and dirty, running across the yard as soon as you show up. Quick calls to meet for breakfast, lunch or dinner with about 20 minutes notice. \"Yea I can meet you at Winsteads\".It brought that back but also a new appreciation for strollers. They are ubiqitious and status linked, I knew that, but I had never realized they were contraversial. It is impossible to have this 21st century life without them",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dsp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIRFLOBVFDASMAYKQJMLSGES2QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DUFC37GI5CYG?ASIN=1501386662",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2022",
                "reviewTitle": "5.0 out of 5 stars A lovely memoir with a fresh take on one of parenthood's most visible symbols",
                "reviewText": "This is my first foray into Bloomsbury's \"Object Lessons\" series, and as such I wasn't quite sure what to expect from Stroller. I was quickly engaged with the book and ended up reading it in one sitting. The book includes a well-researched history of the object itself--stroller/pram/buggy--which was both surprising and informative. As much as I enjoyed reading about how strollers came to be and how their role in culture varies from place to place, though, I gravitated even more toward the personal vignettes in the book. With honesty and intelligence, Morgan looks at the symbolic connection between the stroller as a representation of connection, separation, and materialism within the context of her world as a mother, runner, consumer. The book is in turn funny, piercing, illuminating and ultimately quite moving. I had no idea that a stroller, in the right author's hands, would give me so much to think about.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ir",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7MMCM2EZI4JZ6UPIRYUITNAL7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I8VR1KVXJ73I?ASIN=1501386662",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2022",
                "reviewTitle": "5.0 out of 5 stars Worth the trip!",
                "reviewText": "Review of Stroller by Amanda Parrish MorganWhen I bought Stroller, its short format made me hope that reading an “entire” book without yawning or googling into the freefall associations of my brain chasing a stray fact down alleys to the whirlpool of Google web surfing. The book, Stroller, by Amanda Parrish Morgan, is the most recent printing for OBJECTLESSONS, “A book series about the hidden lives of ordinary things” from Bloomsbury Academic. Parrish Morgan’s short book pulled - and pushed - me out of the rut of post-pandemic reading. And it did more; it introduced me to a new form of writing that combines scholarly attention with the evocative richness of memoir. In this case, the everyday object in the writer’s lens is the smallest and most energy-efficient vehicle of all time: the baby stroller.This discussion ranges from interpretation of artistic and scholarly uses of strollers to experiences of the author. The effect is one of engaging the reader in close focus, attending to the object as a tool for its obvious purpose and also as metaphor -- finding the meaning the object carries for and about society. In this case, the object is the practical transport for infants and children. It (the stroller) is also a vehicle for mothers’ fears, a consumer item of significant import about the purchasers, and an artifact of a consumer society. Additionally, the author opens her personal story. As a young mother in her early days as a parent, her life rotates (sometimes frenetically) around a demanding cycle of writing, running, teaching, and parenting. The focus on the stroller, a human-powered yet mechanical form of transport, appears -- at one level -- to be the purpose of writing. As the facts about the baby carriage roll out, however, the personal and social aspect reveal a larger purpose. With its interesting history and shiny future, the stroller is the focal point but hardly the only point of this book. For assessing today’s consumer society and the role of affluence and status, branding and purchasing power in modern life, one could find no more apt vehicle. No matter how practical or down-to-earth an item may seem, data suggest that branding and marketing are as much a part of the product as its brakes, the color scheme, or, indeed, any feature. Parrish Morgan’s work lead me first to question the role of branding and status in products advertised (!) for the safety of our children. The durable take-away from this book for me is larger: banana stains and mud splatters on the well-used stroller reveal a picture of parenting so strong and so tender that merchandizing is nowhere in the final equation. When I emerged from the fascinating trip, I did google – both for more info about strollers and also to find more writing by this gifted and dedicated author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dirt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPNDVF2CFNVGOL4AG5H7RO5HGHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C4YIIXKXX8FQ?ASIN=1501386662",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2022",
                "reviewTitle": "5.0 out of 5 stars Not your typical narrative",
                "reviewText": "I loved Stroller. It was a unique combination of historical and literary analysis synthesized with the author's narrative. I haven't encountered the same combination in other books I've read (I am new to the Object Lessons series), but it was very refreshing.Morgan seamlessly switches from historical nugget, to literary analysis, to personal anecdotes about her parenting // stroller experience. It is unexpectedly humanizing, it allowed me to feel like a peer to Morgan, rather than seeing her as a stodgy expert passing down her wisdom to you, dear reader. Morgan's vulnerability allowed me to connect with her and develop a kinship. It felt like we were on a journey together. I am an expecting father and can't wait to read Stroller again after I have some experience parenting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MWC3201",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGULOPC4SKQ3YPDDACYJF54TNVIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6LC2BT1P8I7W?ASIN=1501386662",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2022",
                "reviewTitle": "5.0 out of 5 stars A window into motherhood",
                "reviewText": "This book is a treasure. The book is both well-researched and very personal. Amanda Parrish Morgan has used the device of a stroller to share information about motherhood in the US and elsewhere. She also weaves in stories on the changing roles of mothers over the last 100 years. As informative as this content is, the best part of the book are the author’s candid and realistic anecdotes of her experiences as a mother with a stroller. Morgan’s writing is precise and clear-eyed. I will share this book with young mothers, mothers-to-be and their Moms.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYVL3R2E5PDEPFZJ3KKWMYGKZGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JHNU9Z6MCAH6?ASIN=1501386662",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2022",
                "reviewTitle": "5.0 out of 5 stars Candid and relatable",
                "reviewText": "I simply loved this book. I’m not sure what I expected, but was captivated by the vulnerability of the author, Amanda Morgan, in her way of sharing stories from early motherhood. These are the stories mothers don’t share enough, and in her openness, Morgan is most comforting. I look forward to reading more of her work.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonymous",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERM636VJRGYVQ7GSDPCEKXKFSKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GKT2ZBDH73LM?ASIN=1501386662",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2022",
                "reviewTitle": "5.0 out of 5 stars Stroller was so much more than I bargained for.",
                "reviewText": "I read Parrish’s Stroller in one sitting, unexpectedly drawn in into a world of different cultures through the view of a parent with a stroller. I expected to read about the stroller as an object, and maybe just that. Instead Parrish beautifully weaves the stroller through stories of motherhood, sometimes her own. Excellent read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBN6HHLR4ZCJYAVC7BHKJR4JJFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJYZFW13YWY92?ASIN=1501386662",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2022",
                "reviewTitle": "5.0 out of 5 stars A Gem of a Book",
                "reviewText": "There is more wisdom per page in this little masterpiece than any book I ever have read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}