{
    "remaining_requests": 11177,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Jeep-Destination-Ultralight-Stroller-Midnight/dp/B07B7QC8DV",
    "body": {
        "name": "Jeep Destination Ultralight Side x Side Double Stroller, Midnight",
        "price": "$217.99",
        "originalPrice": "$299.99",
        "rawPrice": 217.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Jeep-Destination-Ultralight-Stroller-Midnight/dp/B07B7QC8DV",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41bHbNU6jhL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41MAh-nOM6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-1Mjf9-8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417AfDUhWaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-Iu-T9hlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61jFKDRxvpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/612p7iPzHRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0c201935-e983-4dcd-a095-6d442242bb79/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4eb152ce-c94e-4207-ae35-190274f7266e/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/721c9a0a-71bf-4837-a9a8-7812c8af1a88/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/093b42ae-37d6-4a18-af29-4fc5d65c1d32/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/081ee317-70da-43e7-a3ca-5a266e78bed0/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/487255f5-fe28-44fd-846e-50ecd6e943cf/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1lXtf0rF7S.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1lXtf0rF7S.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Delta Children Store",
            "link": "https://www.amazon.com/stores/DeltaChildren/page/D1A6D986-9B00-46FE-9A7B-3DCA1B3BAA9A?ref_=ast_bln"
        },
        "brand": "DeltaChildren",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1333,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tomorrow, February 17. Order within 3 hrs 39 mins",
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Monday, February 19. Order within 18 hrs 54 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "oxford cloth",
            "Imported",
            "RECOMMENDED USE: Each seat holds up to 40 pounds (80 pounds total). Canopies feature pop out SPF 50 sun visors to shield little ones. Peak a boo windows allow you to keep an eye on your children. Swivel bars make it easy to get children in and out",
            "LIGHTWEIGHT: This stroller features an aluminum frame. Weighs 28.66 pounds. Storage bin provides plenty of room for toys, snacks, etc. Double stroller features 1680D fabric that is durable and water resistant",
            "SIZE: Assembled dimensions (in inches): 29.5 (width), 36.2 (depth), 41.7 (height). Folded dimensions: 29.5 (width), 30 (depth), 13.4 (height). Easy/compact standing fold, foam handles and carry strap for easy storing or traveling. Quick release wheels",
            "SMOOTH RIDE: 7 inch swivel lock front wheels (unlock for easy maneuverability; lock for added stability on bumpy surfaces). 10 inch back wheels with suspension for a smooth, comfortable ride. One step back break lock. Fits through standard 30 inch doorways",
            "SAFE & COMFORTABLE: Independent, multi position reclining seats and adjustable foot rests. 5 point safety harnesses. Reflective shoulder pads ensure you can be seen during nighttime walks. JPMA certified; meets or exceeds ASTM and applicable CPSC standards"
        ],
        "description": "The J is for Jeep Brand Destination Ultralight Side x Side Double Stroller makes it easier than ever to go places, do things and see sights with your whole family. Loaded with features that make errands with multiple children a breeze, this double stroller offers independently reclining seats and foot rests to cater to each child's needs and comfort. Two oversized canopies with extended able SPF 50 sun visors protect little ones from harsh rays, rain or snow while peek-a-boo windows allow you to keep an eye on your children as you walk. Large enough to be comfortable for two children, slim enough to fit through 30\" doorways with ease, and sturdy enough to be your go-to everyday stroller, the J is for Jeep Brand Destination Ultralight Side x Side Double Stroller grants you the freedom to make every trip an adventure. Easily adapt to varying terrain with the stroller's front swivel-lock wheels, unlock for easy maneuverability on even surfaces, and then lock for added stability on bumpy surfaces. And when you're done exploring, this double stroller with an easy, compact fold closes in seconds and stands upright. The stroller's lightweight aluminum frame, foam handles and carrying strap make loading it in the car or taking it on vacation a stress-free task. Since 1941, the Jeep brand has been a symbol of freedom and expression. Influenced by a love of the great outdoors. J is for Jeep Brand products are created for life's little adventurers.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166842011"
            },
            {
                "name": "Tandem",
                "link": "https://www.amazon.com/Tandem-Strollers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=173210011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Delta Children"
            },
            {
                "name": "Seating capacity",
                "value": "2"
            },
            {
                "name": "Color",
                "value": "Midnight Black"
            },
            {
                "name": "Included Components",
                "value": "Stroller Cover/Canopy"
            },
            {
                "name": "Age Range (Description)",
                "value": "Kid"
            },
            {
                "name": "Model Number",
                "value": "11508-2013"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,333 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,175 in Baby (See Top 100 in Baby) #5 in Tandem Strollers"
            },
            {
                "name": "Assembly Instructions",
                "value": "No Assembly Required"
            },
            {
                "name": "Warranty Description",
                "value": "90 days parts only"
            },
            {
                "name": "Import Designation",
                "value": "Imported"
            },
            {
                "name": "Product Dimensions",
                "value": "36.2\"L x 29.5\"W x 41.7\"H"
            },
            {
                "name": "Item Weight",
                "value": "28.66 Pounds"
            },
            {
                "name": "Folded size",
                "value": "29.5 x 30 x 13.4 inches"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "80 Pounds"
            },
            {
                "name": "Material",
                "value": "Aluminum, Rubber"
            },
            {
                "name": "Fabric Type",
                "value": "oxford cloth"
            },
            {
                "name": "Frame Material",
                "value": "Aluminum"
            },
            {
                "name": "Care instructions",
                "value": "Spot or Wipe Clean"
            },
            {
                "name": "Harness Type",
                "value": "5 Point"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b93799a6-f5d0-4fa3-8d61-091627f527a3.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2190e29d-687b-4813-8f2d-843480a28895.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d1c71598-7125-43e3-a497-d688fdc6c73d.__CR0,1,3230,1998_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/949d95ba-6f78-4649-97bc-076a99a3634b.__CR0,1,3230,1998_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5bb25bec-fab4-40d2-b855-3c80cf43a57d.__CR0,1,3230,1998_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "happy shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWWL6L5JY5YPBUSHLXRZGZIY4KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PTQZI50FTHD9?ASIN=B07B7QC8DV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic stroller",
                "reviewText": "I bought this side by side double stroller because my other double is so big and long that it doesn't fit in doctor offices. I had low expectations but this stroller is awesome! Its easy to fold, has a shoulder carry strap, is not nearly as heavy as my other stroller and fits really well in my car! I have a 2020 Honda pilot and this stroller can stand up in the cargo area and I can fit my big trunk organizer on 1 side and 4 carry on suitcases lined up on the other side of the stroller with room in front for last minute packing as well.As an additional plus my Chico key fit 30 carseat for the baby actually drops in and fits really well between the seat and roll bar....not made to fit, doesn't click in or anything but it works and that was a huge plus for me to not have to take the baby out of the infant carseat.I dont think you could get 2 infant carseats to fit next to each other but works fine for the toddler on 1 side and baby on the other.Also steers great, can do 1 handed on most any terrain. Have done pavement, gravel, dirt, and grass. Fantastic stroller and very affordable. Recommend it to everyone.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQIKRUPSGEFH2OUMYAIZGJGGO4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT5D7MUHU28R3?ASIN=B07B7QC8DV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 1, 2023",
                "reviewTitle": "5.0 out of 5 stars GET IT! Perfect for the budget conscious traveler that also appreciates quality products",
                "reviewText": "Pretty sure this is my first Amazon review ever, so that says a lot lol. To preface my review, I already have an Uppababy Vista V2 and an Evenflo- Pivot Xplore, which are also GREAT products. However, I was in the market this time to find a double stroller that my 2 and 4 year old could fit in that did not require a lot of drama when it came to loading, unloading, and traveling to different places with different terrain.Pros:• Fit my average size 2 (very soon to be 3) and 4 year old boys• Price point! Similar strollers cost double! I was considering buying more expensive brands second hand, but when I saw how worn down they could get after use at a consignment store, I said NO WAY to paying $700 for a stroller like this for it to turn out looking like THAT. This stroller is worth the money and some.• I was able to maneuver stroller with one hand (woo!)• Travelled through different grounds- including rocks and dirt• Fit through clear halls on a cruise!• Fits through average size doorways• Kids were able to lie back comfortably enough to take a nap•So EASY to set-up and fold to put away• Large storage basket“CONS:”• Seats are a little on the smaller side, but the adjustable leg rests make up for it• Set-up like a jogging stroller, so the seats are a tiny bit reclined• No cup holderOverall, 10/10 for design, price, quality, and function!",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81EDyCht-AL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steph",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGVP2CKUU6UYACQL4X6VELOUVPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B288NE13BSHV?ASIN=B07B7QC8DV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars The perfect stroller for vacation!",
                "reviewText": "I can't tell you how much I LOVE this stroller! When we planned a trip to Disney world back in February, I knew we needed a better double stroller. I did a lot of research and ultimately chose this because of the price, you couldn't beat it! It is fairly lightweight and has a strap for carrying it over your shoulder. The storage bin underneath has so much room that we were able to store our backpacks, food and all of our necessities while we walked around the parks. The seats recline back which made it the perfect nap spot for my 5 and 3 year old. We did not have any issues fitting through doors or making our way through the large crowds in this side by side stroller. It is very easy to maneuver. My favorite part about the stroller is the swing out child bars. It allowed the kids to sit safely in their seats without having to buckle them in every time. My only complaint is that I could not find a travel bag for this size stroller. Other than that, I absolutely love this stroller and wish I had purchased it when my kids were younger. I recommend this stroller to all my friends/family when they ask for stroller recommendations! Great buy!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBUXYCOOTHFJOI56JYX6WV2NZ7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KAIHR04SAZA2?ASIN=B07B7QC8DV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 8, 2019",
                "reviewTitle": "5.0 out of 5 stars Winner Winner",
                "reviewText": "I purchased and returned 3 double strollers before I found this and knew immediately it was “the one.” I have a 2.5 yo and a 6 month old and I was trying super hard to avoid the side by side style because I didn’t want anything bulky and wanted to fit through standard doors when out and about. First I tried the sit and stand style (awful maneuverability, very clunky) and returned. Next I spent $600 on the City Select double and found it smooth but very hard to open and close, and frustrating that both seats had to be detached before folding. I also felt like my 2.5 yo was on the verge of growing out of the city select. I was about to pull the trigger on a double Bob when I randomly found this Jeep stroller on Amazon and noticed it had high reviews. The first thing I noticed was the stylish design. It looked slim for a side by side. After reading that others found it maneuverable and easy to use I pulled the trigger- and it has been the best $200 I’ve spent. Putting it together was as simple as popping on some wheels. The wheels are not rubber but they have a rubber feel and work well on various terrain. It is SO smooth. You can push two kids with one hand and it turns on a dime. Not to mention, it looks much more expensive than it is. We love how easily it folds down and the carrying strap. It’s pretty light compared to the other doubles we tried. Both our infant and toddler are super comfortable. I wish it reclined a touch more but it’s plenty for a nap. My only other wish would be for a parent cup holder but I’ve been fine to toss my water bottle in the basket underneath. The most important things to me were maneuverability and a sleek design. I didn’t think I’d find that in a double but this stroller proved me wrong. I shopped in many stores with this thing yesterday and fit through every doorway I tried. If you’re looking for an awesome double, try this before spending a fortune!",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/817MRTl9WFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81Gd-IQwdeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECSSWXF7FRA5DVNPEOWKNGRD7YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSGZ2UF5JDSG8?ASIN=B07B7QC8DV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Better than I anticipated.",
                "reviewText": "This stroller went above my expectations for the doubles I found within my budget. I was hesitant about Jeep brand because I have a single Jeep stroller that failed me while at Disney. But this one is great!Pros: extremely easy to operate (folding, steering, carrying), it’s very compact and lightweight when folded (more compact than all 3 of my single strollers), sun shades come down really far, comfy for both my 5 month old and 2.5 year oldCons: shallow seat depth, wish it reclined one step lower, no snack trays",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandra Gómez GonzalezAlejandra Gómez Gonzalez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 22, 2022",
                "reviewTitle": "Me encanta!",
                "reviewText": "Tengo mellizos de 9 meses y les quedó increíble.Tuve otra carriola para cuando estaban más pequeños, pero está carriola está increíble. Es ligera, pasa baches y topes sin problema, nisiquiera se sienten.He subido a niños más pesados que mis hijos y no se inclina aunque los pesos de los niños sean diferentes.Tiene muy buen espacio en la parte de abajo, tiene unas ventanillas en la parte de arriba que te permiten ver a los niños.El tamaño a lo ancho no es tan grande, por lo cualPuede pasar por cualquier lugar.El precio es accesible, ya que la puede usar desde los 9 meses hasta yo calculo 3 años.Lo único que le hace falta es una base para Pop poder vaso tanto para niños, comoPara quien los pasea, pero es algo que tú le puedes instalar.Es fácil de armar y fácil de doblar para guardar. Cabe perfectamente en mi auto que es un versa y aún le sobra muchísimo espacio para cargar más cosas.En definitiva es una excelente opción, ya sea para mellizos o para niños de diferentes edades.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61hPLCreBTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pj",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 14, 2023",
                "reviewTitle": "1000/10",
                "reviewText": "Muy bien, fácil de cerrar, ligera para ser carriola doble y pequeña! Me encantó",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura Verduzco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 12, 2023",
                "reviewTitle": "La mejor carriola doble",
                "reviewText": "No he encontrado un lugar donde no quepa. Caben mi hijos de 3 años y de 6 meses. Si necesitan una siesta, ambos pueden tomarla sin problema y con toda comodidad.No tiene portavasos, pero eso se soluciona fácil. El precio es increíble para la calidad de la carriola. La mejor compra que he hecho desde que soy mamá de 2.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 25, 2021",
                "reviewTitle": "TWINS MUST!! Estable, bonita y muy fácil de usar!",
                "reviewText": "Tengo pocos meses de usarla con mis gemelos de un año y hasta horas ME ENCANTA!! Peso entre ambos de 20kg.Fácil de armar, fácil de maniobrar, llantas resistentes, muchísimo espacio en la cesta, me encanta q cada asiento se reclina, me encanta q cada asiento tenga su propia barandal (que se quita muy fácil y puedes, o poner o quitar un niño sin tener q afectar al otro pasajero), excelente ventilación, fácil de limpiar, muy buen toldo que con su extra protección les quita perfecto el sol de su cara, hay una pequeña compartimentos en donde guardo mi celular y dinero.Para mi, es una GRAN compra a un precio MUY accesible comprado a lo q vi en el mercado.Estoy segura a obtienes mayores benéficos que con otras opciones más económicas.Un plus es q mis hijos de 4 y 6 años se pueden subir si problemas, solo hay q tener en cuenta que si va un niño mayor con un bebé, puede recaer el peso en las llantas de un lado lo cual lo hace un poco más difícil de maniobrar pero no es un defecto es una realidad con cualquier carriola.Mi único pero es q incluya un contenedor o un lugar en donde poner una botella de agua para el adulto que la esté usando, por lo demás estoy súper feliz.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LUCIA D.LUCIA D.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 2, 2023",
                "reviewTitle": "EXCELENTE TODO TERRENO",
                "reviewText": "The media could not be loaded. ¡La mejor!Recorrimos 115km del Camino de Santiago, literalmente en todo tipo de terreno y está perfecta! La recomiendo para toda actividad 🙌🏻⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91Ok2MctidL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91Ore-W8DsL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/D1JUFR0IGxL.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}