{
    "remaining_requests": 11207,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Jeep-Classic-Jogging-Stroller-Grey/dp/B07JR8TY2Q",
    "body": {
        "name": "Jeep Classic Jogging Stroller by Delta Chidlren, Grey",
        "price": "$159.95",
        "originalPrice": "",
        "rawPrice": 159.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Jeep-Classic-Jogging-Stroller-Grey/dp/B07JR8TY2Q",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B085D3DKLL"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lmUzHRWZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41KTqBDwnBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zIGgdCbGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zoY0r8tUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41u5ltYUwlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qygunVtIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NLWbYlVXL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/f5765ad8-6cb4-5438-bf41-9c87636fbfd5/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5afd4766-d511-4b09-946c-433a4ba6b181/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fd71d1bc-ab15-4b84-b7d1-3068572265b3/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1YADTuyq2L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1YADTuyq2L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Delta Children Store",
            "link": "https://www.amazon.com/stores/DeltaChildren/page/D1A6D986-9B00-46FE-9A7B-3DCA1B3BAA9A?ref_=ast_bln"
        },
        "brand": "DeltaChildren",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1697,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 3 hrs 58 mins",
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Monday, February 19. Order within 9 hrs 43 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "JOGGING STROLLER TRAVEL SYSTEM: Use as a standard jogging stroller or create a travel system with your infant car seat (car sear sold separately) ; SIZE/WEIGHT: 24.4”L x 44.9”W x 41.1”H ; 26 lbs.",
            "COMPATIBILITY: Stroller fits the following car seats: Graco SnugRide Click Connect; Evenflo Nurture; Evenflo Embrace ; For Britax B-Safe 35 Car Seats & Chicco Keyfit 30 Car Seats, use the J is for Jeep Brand Jogger Car Seat Adapter (sold separately)",
            "PROTECTS THEM FROM THE ELEMENTS: Extendable visor with UPF 50 shields kids from the sun, rain, wind or snow ; ADJUSTS TO THE TERRIAN: 12” front wheel with swivel lock provides stability ; Shock absorbing frame with 16” back wheels ensures a smooth ride",
            "FITS YOUR LIFESTYLE: Swing away child tray makes getting your child in and out easy ; Reclining seat for your child’s comfort ; Safety tether ensures stroller stays close while you jog ; Two parent cup holders for convenience ; Storage basket underneath",
            "COMPACT FOLD: Easily folds ; Back quick-release wheels make it easier to transport in your car ; SAFE DESIGN: 5 point safety harness with reflective piping for nighttime walks; JPMA certified to meet or exceed all safety standards set by ASTM"
        ],
        "description": "\"Turn any day into an adventure with the Jeep Classic Jogging Stroller. Perfect for daily errands or runs in the park, this versatile jogger can be used as standard jogging stroller or as a travel system with your infant car seat (car seat sold separately). Able to tackle the toughest terrain, this stroller effortlessly adjusts to varying surfaces with its suspension system with visible shock absorbers that will smooth out any bumps in the road (or trail!). Equipped with an adjustable UPF 50+ canopy, multi-position reclining seat, swing away child tray, two cup holders, reflective material for nighttime runs, and plenty of storage, the Jeep Classic Jogging Stroller is designed to keep parents and kids with an active lifestyle happy. And, when you need to take this jogging stroller with you on a day trip or vacation, it folds easily and has quick-release back wheels that allow for hassle-free storage. Recommended use: Infants up to 50 lbs. Since 1941, the Jeep Brand has been a symbol of freedom and expression. Influenced by a love of the great outdoors, Jeep kids’ products are created for little adventurers. Fits the following car seats (car seats sold separately): Graco SnugRide Click Connect 30, 35, 40 Evenflo Nurture Evenflo Embrace For Britax B-Safe 35 Car Seats, please use the J is for Jeep Brand Jogger Car Seat Adapter (sold separately)\"",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166842011"
            },
            {
                "name": "Joggers",
                "link": "https://www.amazon.com/Joggers-Strollers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=166846011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Delta Children"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Age Range (Description)",
                "value": "Baby"
            },
            {
                "name": "Model Number",
                "value": "11288-2094"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,697 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,214 in Baby (See Top 100 in Baby) #11 in Jogger Baby Strollers"
            },
            {
                "name": "Product Dimensions",
                "value": "44.9\"L x 24.4\"W x 41.1\"H"
            },
            {
                "name": "Item Weight",
                "value": "29 Pounds"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "50 Pounds"
            },
            {
                "name": "Warranty Description",
                "value": "90 days parts only"
            },
            {
                "name": "Import Designation",
                "value": "Imported"
            },
            {
                "name": "Harness Type",
                "value": "5 Point"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "50 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Jeep Since 1941, the Jeep Brand has been a symbol of freedom and expression. Influenced by a love of the great outdoors, Jeep kids products are created for life's little adventurers. Jeep Classic Jogging Stroller Available in Red (2018) or Grey (2094) Standing up to you and your little explorer’s active lifestyle, the Jeep Classic Jogging Stroller epitomizes form and function for the on-the-go, adventure-seeking family. Thoughtfully designed with parents and baby in mind, this stroller provides your little passenger with the utmost security and comfort, while high performance features that can tackle any terrain, ensure a smooth and safe ride, wherever the journey takes you. Make every outing with baby an adventure - only with Jeep! Jogging Stroller + Travel System: Use as a standard jogging stroller or create a travel system with your infant car seat (car seat sold separately) Safety and Comfort for Baby: 5-Point Safety Harness | Reflective piping for nighttime strolls | Extendable visor with UPF 50+ shields kids from the elements | Multi-position seat recline Adapts to Any Terrain: 12\" front wheel with swivel lock provides stability | Shock absorbing frame with 16\" back wheels ensures a smooth ride Suits Your Active Lifestyle: Safety tether ensures stroller stays close while you jog Storage for Your Convenience: Storage basket underneath for easy access to baby essentials | Two parent cup holders for additional convenience Easy Transport: Easy compact fold with quick-release back wheels for easy storage into car Size: 24.4\"L x 44.9\"W x 41.1\"H | Weight: 26 lbs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/01c58384-13e6-40d5-9c31-86244e527ada._CR0,0,300,400_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/27312be1-93a3-4a5b-994a-ecfdb2238bff._CR0,0,350,175_PT0_SX350__.jpg"
                ]
            },
            {
                "media_text": "Product Features Adapts to Any Terrain This stroller is equipped to handle any terrain. Its 12” front wheel with swivel lock action provides stability as you jog or walk; unlock for low speed maneuvering or lock into place for jogging. Its shock absorbing frame helps smooth bumps and uneven surfaces. Exceptional Safety and Comfort A 5-point safety harness with reflective piping ensures safe strolls or jogs day and night. Protection from the Elements An extendable visor with UPF 50+ offers your little one superior protection from the sun, rain, wind or snow. Stands up to Your Active Lifestyle Created to suit your active lifestyle, this stroller includes a safety tether strap that attaches to your wrist to ensure that the stroller stays close to you while you jog.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/446e3f9d-dd04-4a75-a7bc-f836edf9da44._CR0,0,220,220_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1cb19aac-8130-4a0e-a6ad-8037c52e1a07._CR428,0,2143,2143_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/877f3e2d-9144-4dc1-bb85-c108f8ff2638._CR0,0,220,220_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6db8c9bc-5a9f-4052-b882-57265d1a9dd3._CR0,0,220,220_PT0_SX220__.jpg"
                ]
            },
            {
                "media_text": "Storage For Your Convenience Undercarriage storage provides easy access to baby essentials, with two parent cup holders for additional convenience. Swing-Away Child Tray A swing-away child tray makes it easy to lift your child in and out of the seat. Compact Fold with Quick-Release Back Wheels Ideal for quick excursions, day trips or week-long vacations, this stroller features an easy compact fold with quick-release back wheels that enables easy and convenient transport of the stroller into your car. Create Your Own Custom Travel System! This stroller allows you to easily create your own custom travel system for maximum versatility and value! Fits the following car seats (car seats sold separately): Graco SnugRide Click Connect 30, 35, 40Evenflo NurtureEvenflo EmbraceFor Britax B-Safe 35 Car Seats, please use the J is for Jeep Brand Jogger Car Seat Adapter (sold separately)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d4d9759c-7b17-413c-81fa-10cc5ffce141._CR0,0,220,220_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2936ed07-dbef-48d2-bbdd-996cce0cb323._CR285,0,2431,2431_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bf9483b7-5624-48bf-9d79-d10745437cff._CR0,0,220,220_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/22db29b5-51b3-4e50-a86b-b10253620cca._CR285,0,2431,2431_PT0_SX220__.jpg"
                ]
            },
            {
                "media_text": "J is for Jeep Brand Jogger Car Seat Adapter for Britax B-Safe 35 Seats Shop Coordinating Items",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/01c58384-13e6-40d5-9c31-86244e527ada._CR0,0,300,400_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/27312be1-93a3-4a5b-994a-ecfdb2238bff._CR0,0,350,175_PT0_SX350__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/446e3f9d-dd04-4a75-a7bc-f836edf9da44._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1cb19aac-8130-4a0e-a6ad-8037c52e1a07._CR428,0,2143,2143_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/877f3e2d-9144-4dc1-bb85-c108f8ff2638._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6db8c9bc-5a9f-4052-b882-57265d1a9dd3._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d4d9759c-7b17-413c-81fa-10cc5ffce141._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2936ed07-dbef-48d2-bbdd-996cce0cb323._CR285,0,2431,2431_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bf9483b7-5624-48bf-9d79-d10745437cff._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/22db29b5-51b3-4e50-a86b-b10253620cca._CR285,0,2431,2431_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cbfde431-6872-411b-865e-81daaccba45b._CR0,0,150,300_PT0_SX150__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Anna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZIIHVY2WUYGZMFKF4CGRXU6W6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31UVKNM44E0CA?ASIN=B07JR8TY2Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 28, 2020",
                "reviewTitle": "5.0 out of 5 stars Great every day stroller!",
                "reviewText": "This is one of four strollers we own and has been fantastic for us. We started using this with our first baby at around 5-6 months. We go about 2 miles a day mostly on city blocks, but also on very uneven/rocky country roads (we’re talking cow pasture here!). After about 14 months of constant use, it has held up very well and is only about to be retired in lieu of a double stroller for baby #2.Pros:-Easy to push and works well on many different surfaces. The ability to lock the front wheel helps a lot for off road terrain.-Fairly light weight and easy to fold - even throughout most of my second pregnancy I was able to lift it in and out of our SUV trunk.-All parts of the stroller have held up incredibly well.-Storage is not ideal, but functional for carrying quite a few lighter items (not the full diaper bag) and fairly easy to access even when the stroller is fully reclined. We typically bring water bottles, sunscreen, an extra blanket and a few snacks.-Our favorite part is that baby #1 has been very comfortable in this stroller, in fact it’s become our fail safe method for nap time and plan many of our walks around it.Cons:It’s not perfect, but I think it’s a great option for the price!-We did purchase a different stroller for the newborn phase (until the baby can hold their head up independently) and also separate one for travel as this is fairly bulky. In retrospect, there may be a better “all purpose” option at a higher price (rather the same price as all 3 strollers!)-The inner tube tires are terrible! They popped within two months of use - we’re taking full on slashed tires after a stroll around town. However the solution is easy and affordable... replace with these slime tires: https://smile.amazon.com/dp/B00BF96ZR2/ref=cm_sw_r_cp_awdb_t1_f1m-EbS3P401J-I wish the storage was a little better so we could do more grocery shopping. We are 1-2 miles from markets, which is just a little too far to maneuver the stroller and carry groceries at the same time.In summary, we have been very pleased with this. and will plan to use it again with baby #2. We did finally take the plunge with the Bumbleride Indie Twin, which will be our daily stroller from now on, but once the older toddler is a little more mobile, I imagine we’ll probably go back to using this quite often.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "coxfamily",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMJFTISIHQTMCDVXPMBQLUOP27Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCH7DUUQTMHTT?ASIN=B07JR8TY2Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Love this Jogger. Wish the basket under it was a little larger.",
                "reviewText": "The Jeep Classic Jogging Stroller by Delta Children has been a game-changer for my active lifestyle as a parent. Its sturdy construction and smooth maneuverability make it a reliable choice for jogging and outdoor adventures. The adjustable handlebar and reclining seat add to the comfort factor for both the child and the person pushing the stroller. The storage compartments are handy for carrying essentials but it really needs to be a little larger! The sun canopy provides excellent protection. While it may be bulkier than some other strollers, it's a trade-off for its durability and stability during runs. Overall, this jogging stroller lives up to the Jeep brand's reputation for ruggedness, making it a great investment for parents who enjoy staying active while spending quality time with their little one.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Paul ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDWAYSSW4O2N4DGWRN7KNL2HTQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T99UNQ6QLRB4?ASIN=B07JR8TY2Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Powered by Jeep Jogging Stroller",
                "reviewText": "This thing is legit AF! It encompasses 95% what high end strollers are at 1/3 the cost. Seriously can’t beat this stroller. It’s Jeep branded which is sleek and encompasses that outdoorsyness. It’s sturdy, made well, powered by Jeep, front swivel works super smooth with 2 options, and overall it’s smooth.The main push handle could be a little sleeker but let’s face it, you’re gonna use this thing alot and it doesn’t need to be fancy.See people complaining about it folding compact, these are large wheels and as with most strollers it can only get so compact so not a deal breaker. A tricycle design can only do so much lol.Weight is ok, not heavy and obviously not carbon fiber light but this thing is legit.Have no idea how you could ask for more at the price point it’s being offered at.Worth every penny and dodging the overpriced high end ones. Highly recommend.The only negative thing id ad are the cup holders. Slightly flimsy, good for a 20oz drink tops. However I have a Nuna pipa travel system that I spent $1000 on and that didn’t even bring a single cup holder, so again no real complaints on this Jeep stroller.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81reI5fNyjL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "glojo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4G3VWKUIDUFQZHBQEMMG63C67Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X7O80Y4HFRCZ?ASIN=B07JR8TY2Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Great on dirt roads!",
                "reviewText": "This stroller is the best quality without the outstanding price of other overpriced strollers. The stroller rides great and smoothly on dirt roads and has great quality features.Would highly recommend. Great quality for price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K Ann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESI4D63ZBW2C2Q3YFOA2BQDZSZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WWJKKJH7ON9L?ASIN=B07JR8TY2Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2021",
                "reviewTitle": "4.0 out of 5 stars Good stroller for value",
                "reviewText": "Easy to push & good glider. Nice shade and visibility for toddler. Recline mechanism is easy to operate. Decent storage under seat. Kid cup holders are good. Tray is just ok. Easy to clip on & release. Cup holders for \"Mom\" are worthless beyond a 16oz plastic H2O bottle--Very narrow & they swivel, which means a tall, narrow tumbler tips over. Nowhere to really put any other accessories for easy access, while pushing.I have a Ford Edge V6 Limited Edition SUV & this jogger fits without collapsing the back seats, but it's a tight squeeze for anything else. Great simple, handy jogger for value. Would jot recommend for a \"i use my stroller every day\" Mom that would want something a little more LUX but it is perfect for occasional use, without breaking your piggy bank.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 13, 2024",
                "reviewTitle": "Excelente relación calidad/precio",
                "reviewText": "Buen tamaño, buen amortiguador y fácil de usar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Excelente, cumplen su función, los ocupa mi hija como portera en fútbol.. Mejor de lo esperado",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 13, 2024",
                "reviewTitle": "Excelente, Genial...",
                "reviewText": "Mucho más de lo que esperaba, simplemente es genial... Para correr con tu hijo, en parque, pasear por las calles sin problemas, para todo terreno!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge...",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 4, 2024",
                "reviewTitle": "Exelente",
                "reviewText": "El producto es de material muy resistente, cumple.con su función, mi niño de 4 años puede subirse sin problema , tiene la resistencia, y soporte ...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana Judit Quintero García",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 15, 2023",
                "reviewTitle": "Si es todo terreno",
                "reviewText": "Súper cómoda y si es todo terreno, no me cuesta nada subir las banquetas o pasar los topes, está genial!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 14, 2024",
                "reviewTitle": "Está hermosaa pero…",
                "reviewText": "Es una carriola hermosaaa por donde la veas pero tiene sus contras, sería la carriola perfecta si el respaldo se reclinará un poco más y el techo tuviera una ventana para ver al bebé y cubriera un poco más del sol porque a mi bebé siempre le da el sol en la cara, tiene buen manejo y si es todo terreno, fácil de doblar, los porta vasos son una burla jaja no soportan unaBotella de 1 litro, solo le he puesto los biberones de mi hijo y se colgaron",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$169.99",
                "sellerName": "Fun2BKids",
                "sellerRating": "4"
            }
        ]
    }
}