{
    "remaining_requests": 11101,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Evenflo-Pivot-Modular-Stroller-Ayrshire/dp/B0BRMFYKM7",
    "body": {
        "name": "Evenflo Pivot Xpand Modular Stroller (Ayrshire Black)",
        "price": "$279.99$268.63",
        "originalPrice": "$349.99",
        "rawPrice": 279.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Evenflo-Pivot-Modular-Stroller-Ayrshire/dp/B0BRMFYKM7",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08WQXJ7NF"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BRMFYKM7",
                "variationName": "Color",
                "variationValue": "Ayrshire Black",
                "price": "$279.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/21qgT2+pLZL._SS36_.jpg"
            },
            {
                "asin": "B07G2ZDHNB",
                "variationName": "Color",
                "variationValue": "Percheron Gray",
                "price": "$288.49",
                "variationImageURL": "https://m.media-amazon.com/images/I/418kfWpNiLL._SS36_.jpg"
            },
            {
                "asin": "B0BRMC94T6",
                "variationName": "Color",
                "variationValue": "Sabino Gray",
                "price": "$281.92",
                "variationImageURL": "https://m.media-amazon.com/images/I/51VK6A9g13L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "25",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41yVq1bnygL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/412uBMqDP6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41seaK70IfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/516E2X0p6gL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51co8Vr CLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tplTWQqkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qgIp9aPuL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00571dc4-1ccc-44d2-8c39-c14deb9d80a6/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6bb788cd-c69c-44dc-9e05-5010cf905cf9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8cfed9c5-1e1d-43d9-8df5-10c4ee540cca/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0b3d6cf-fadd-40d4-abf4-fa5da5a224df/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ba1cf9f-bda5-4996-893d-5671b0e5466a/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/86839cf1-dbef-4e3e-add1-3c8bc0621b35/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91+yIBubwSL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91+yIBubwSL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Evenflo Store",
            "link": "https://www.amazon.com/stores/Evenflo/page/3C218481-6E42-408E-8D53-997BC89AEF18?ref_=ast_bln"
        },
        "brand": "Evenflo",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1038,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 18 hrs 44 mins",
            "FREE delivery Friday, February 23. Order within 18 hrs 29 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% Polyester",
            "Imported",
            "MAKE IT A DOUBLE: The easy slide and lock system expands the frame in seconds to accommodate a second toddler or infant car seat without tools, extra parts or adapters",
            "SWITCH IT UP: Toddler seat transitions to lay flat carriage mode, allowing baby to stretch out, while the adjustable canopy offers three heights to fit kids up to 43 in.",
            "STROLL EFFORTLESSLY: Large cruiser tires with front-wheel swivel and rear-wheel suspension ensure a smooth ride",
            "GO OR STOW: Extra-large storage basket expands to over 2 feet in length with easy access front and back to hold a diaper bag and all the day’s essentials. When not in use, stroller folds compactly and self-stands with toddler seat attached for convenience",
            "ACCESSORIZE IT: Compatible with Evenflo’s LiteMax Infant Car Seats (sold separately), the stroller also accommodates several other brand models when used with Evenflo Infant Car Seat Adapter (sold separately). Additional accessories include the Pivot Xpand Stroller Second Seat (sold separately), Stroller Rider Board (sold separately), Evenflo Stroller Child Snack Tray with Snack Cup (sold separately), and Pivot Xpand Stroller Market Basket (sold separately)"
        ],
        "description": "Evenflo’s® Pivot Xpand™ Modular Stroller is the perfect full-size stroller for your needs now and later, by converting to a double! It grows from single to double with an easy slide and lock system that expands the frame in seconds to accommodate a second toddler or infant seat without any tools, adapters or extra parts needed. Click on an additional infant car seat or Stroller Second Seat (sold separately) for multiple double riding options! The toddler seat easily converts to a comfortable lay-flat carriage mode. Both modes are reversible, allowing your child to ride forward-facing or parent-facing. Pivot Xpand is fully compatible with Evenflo’s LiteMax™ Infant Car Seats (sold separately) without needing an adapter. Pivot Xpand’s extra-large, back and front-access storage basket expands to over 2 feet in length! Large cruiser tires with front-wheel swivel and rear-wheel suspension provide a smooth ride and superior maneuverability. Comfort features include a 3-position seat recline and 6-position adjustable footrest. The flip-flop friendly brake keeps the stroller in place as you safely take your child in and out of the stroller. A peek-a-boo window keeps baby visible at all times while parents enjoy a 4-position adjustable handle and removable bumper bar. The canopy’s adjustable height allows you to accommodate child’s growth spurts. The flex-hold cup holder ensures a snug fit for a variety of beverage sizes, helping to avoid spills. When not in use, Pivot Xpand can be stored in a self-standing, compact fold, with the toddler seat still attached. For even more riding options, you can also add the accessory Stroller Rider Board (sold separately). Use it for an extra passenger or simply to give your child a way to quickly hop on and off when little legs need a break. It’s been 100 years and Evenflo continues to push the boundaries in baby and children’s gear design and innovation. We meet the needs of new generations of parents by focusing on what they really care about: leading-edge safety, smart design and technology, and convenient features that help them enjoy the journey of parenthood.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166842011"
            },
            {
                "name": "Tandem",
                "link": "https://www.amazon.com/Tandem-Strollers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=173210011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Evenflo"
            },
            {
                "name": "Seating capacity",
                "value": "2"
            },
            {
                "name": "Color",
                "value": "Ayrshire Black"
            },
            {
                "name": "Age Range (Description)",
                "value": "Kid"
            },
            {
                "name": "Model Number",
                "value": "13812454"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,038 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,717 in Baby (See Top 100 in Baby) #18 in Tandem Strollers"
            },
            {
                "name": "Warranty Description",
                "value": "90-day-limited"
            },
            {
                "name": "Import Designation",
                "value": "Imported"
            },
            {
                "name": "Product Dimensions",
                "value": "39\"L x 26.5\"W x 39.25\"H"
            },
            {
                "name": "Item Weight",
                "value": "30.2 Pounds"
            },
            {
                "name": "Folded size",
                "value": "26.5\" W x 23.75\" D x 33.75\" H"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "55 Pounds"
            },
            {
                "name": "Material",
                "value": "Polyester"
            },
            {
                "name": "Fabric Type",
                "value": "100% Polyester"
            },
            {
                "name": "Frame Material",
                "value": "Metal"
            },
            {
                "name": "Care instructions",
                "value": "Clean minor spills and stains on cloth, vinyl or plastic surfaces with cold water and mild soap. Air dry. On models with removable seat pads, machine wash them separately in cold water–delicate cycle. NO chlorine bleach. Tumble dry 10 – 15 minutes on low heat, remove immediately. DO NOT iron or dry clean. Metal and plastic parts can be wiped clean with a soft damp cloth and dried with a soft cloth. DO NOT use abrasive cleaners."
            },
            {
                "name": "Harness Type",
                "value": "5 Point"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/e167374e-d6c9-43e2-b211-6bcd675e8369.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ad493091-d759-4085-982e-25faac3158c3.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/91e0162a-1577-4ce7-8060-1d2c3b2591ed.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/93be2d94-05ce-40d1-9625-e39bed02f466.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0d72464d-9ce2-4cd1-88fd-85fe32f32c9a.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Eyes That Shine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGF5RVFM6B7LTHYFA2BZBRWO33OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K5PE5UCEVNKD?ASIN=B0BRMFYKM7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2020",
                "reviewTitle": "5.0 out of 5 stars I can't say enough! All the features and affordable!",
                "reviewText": "I can't say enough about this stroller!!! Between babysitting and my first child, I've tried a few strollers. I always dreamed of one that the carseat clicked into with my first, so with my second I was determined to get one. I was so happy to find this double one in our budget (let's be real, doubles that fold and have the features this does are stupid expensive, $600??? Crazy! Not this one!!)My child came super early and had to be on oxygen and constant monitoring. This also required countless appts. This stroller can hold all of that and a giant backpack in the bottom and still be easy to get into the bag and press buttons on monitors! It maneuvers amazingly! Hospitals have elevators and lots of people and twists and turns. I can navigate all of that one handed with this stroller (mind you that was only one seat and child, but I can't imagine too much harder with both). I can still push both kiddos in it with one hand on footpaths and decently through grass. Uphill requires two hands, but that's ANY stroller ha!Seats move and change so easy!!The basket holds a crap ton! It has held a 50lb toddler when we didn't have the second seat on hand. It holds two bags of cat food and a GIANT diaper bag! I have put countless things in that basket and it rocks! Seriously one of my favorite features!The folding! So so easy! I'm constantly putting in and out of my trunk and needed one that folded well and quickly. Two little pull tabs and it is swinging in. Only trick is when you're opening it (one handed latch fyi), if you aren't careful, the handle will scratch the ground. It's really only an aesthetic problem. I've learned how to open it right so it won't scratch! I suggest trying it a few times on carpet before you are on concrete/pavement.The handle adjusts!!! This is amazing! So many strollers don't so I was so happy this one does! Also, one foot brake. Very easy to press!The peekaboo flap actually stays open! It doesn't have velcro but it is properly fitted to stay open when you want it open! Hallelujah! I was constantly fighting with my previous stroller! Not any more!I have a honda accord and it fits in my trunk with ROOM to spare. I store toddler seat separate in back and the stroller to side front. I can still fit cat food and a decent amount of groceries in my trunk! That is impressive. I had a stroller before for one kid and could only fit the stroller 🙄Only Downfalls:I wish the toddler seat was completely flat in bassinet position, or could become completely flat. The incline is good for sids protection, but when you want to change a diaper, the slight incline is a slight pain.The handle scraping if you aren't careful. It has a weird unfolding trajectory (not bad, just different) if you haven't practiced so definitely practice to get the hand of it.The shade could be a tad longer or would he cool if you could swing it more into a 180. When the toddler seat is flat or in the middle position before a full sit, the shade isn't quite covering of the baby's face. For a toddler it probably works, but I wish I could get a tad more or adjust it for times the sun is lower. Not a deal breaker since we can just clip a blanket to shade a bit.This isn't a problem for me but should definitely be checked if you're worried. It is a little heavier. I think it is easy to lift one armed in and out of a trunk 🤷‍♀️ but it could be a pain for some. If you're worried, check one out at a store. **My two cents, with all the weight this sucker can carry and maneuver smoothly, it makes sense it weighs a bit more.**Definitely get the evenflo accessories package for it. The bag is worth every bit!!",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brandon Carrigan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX6MQEMUZ6W6YUHSRHFX3DS5VLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23HRX7460EYJA?ASIN=B0BRMFYKM7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2020",
                "reviewTitle": "5.0 out of 5 stars Highly recommend!",
                "reviewText": "Our first stroller was compatible with our infant seat and was loud, ugly, and difficult to use. Plus it tipped over anytime we hung the diaper bag from the handle meaning we either had to carry it or lose valuable storage space underneath. For our second kid we did some extensive research and landed on this— so glad we did, we couldn’t be happier!Our favorite features:- Assembly is a breeze- Easily converts for use with 1 or 2 kids while remaining compact and attractive. We use the included seat (which both my infant and toddler find comfortable), the adapter for our Chicco infant seat, and the rider board. With the number of configurations between the three it has always been comfortable and exactly what we needed for our two kids.- The large rubber wheels make the ride quiet, smooth, and easy to navigate over different terrain.- Even with the weight of two kids it can be steered with one hand!- It’s weight makes it extra sturdy and durable leading me to believe it will last (we’ve had it 9mo and so far no issues!).-There’s plenty of room in the storage basket for a diaper bag or a few groceries, even while holding 2 kids.The pitfalls:- Folding it up can be cumbersome as the seat has to be removed before it’ll collapse to fit into a compact space. It’s really simple, just slightly time consuming and you have to keep track of all the pieces in the trunk. Not the most ideal for a cold/hot/windy day when all you want is to be able to jump right into your car or quickly get inside.- It takes up about 2/3 the trunk space in my compact car- The removable cup holder is flimsy and easily tilts to spill whatever it’s holding.For us the pros far outweigh the cons and we would highly recommend this stroller to anyone planning to have one or more kids! Wish it was around when we had our first so we hadn’t spent the money on a different (more expensive) stroller that was rarely used because we disliked it so much. Plus the price is an added bonus! We visited Disney with this stroller and were stopped so many times by people asking to know more— trust me, if you go with this you’ll be glad you did!",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandra chavez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3SKMZDS7RPFSM7Y3JY4MPG2Q2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B2BCCR05OKH2?ASIN=B0BRMFYKM7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Best stroller",
                "reviewText": "I love this stroller first it’s super compact when it’s folded up. Second it fits well in our trunk. Third easy to assemble and easy to put together when going to use it.You can make lots of adjustmentsFor us we love it because we have convertible car seats not the carrier ones and we needed a stroller to push our newborns around that wouldn’t break the bank. And this is that. There’s options to make it into toddler seats and carriage like seats for baby to lay down and sleep and the best part you don’t have to buy any inserts or extra pieces .! It has great suspension and a easy to use break . That’s big bit like those small ones on the sides with double it’s just one big pedal which I like! It is big but not hard to push around at all. Fits in store isles which i love! Also a big basket on the bottom !",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MechyMe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 15, 2022",
                "reviewTitle": "Quality pram",
                "reviewText": "Very user friendly. Adjustable handle for comfort. The pram is easy to clean and comfortable for baby. Very large cargo compartment underneath for shopping and baby paraphernalia. The modular design makes it easy for adding addition seats for more children. Easy to manoeuvre swivel wheels in front help with turns. Toe breaks on back wheels very convenient.I would recommend this pram over the competition (ie:Graco) much better build not as flimsy.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Will i am",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 15, 2022",
                "reviewTitle": "Comoda para el bebé, pesada, también.",
                "reviewText": "Pros: es muy cómoda para el bebe. El asiento se acuesta y se sienta por completo lo que hace que el bebé tenga una muy buena vista del paisaje, cosa que con otras carriolas no ocurre.No es calurosa.Colores bonitos. El asiento lo puedes poner de muchas formas. Con vista hacia adelante o atrás e incluso mas arriba o mas abajo.La canasta es de súper bien tamaño.Contras: Pesa. Pesa mucho. Subir el esqueleto al auto es una cosa de pensarse.Al andar en la calle si hay espacios angostos no gira tan facil hay que batallar. Si vas en camino amplio es una maravilla pero espacios normales a chicos, no es muy cómoda.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on February 1, 2020",
                "reviewTitle": "Best decision ever!",
                "reviewText": "Best decision ever! Easy to manoeuvre around and fits my 18mths and 5yo gals perfectly! My 5yo gal is one the taller side at 110cm, but still able to fit in for naps. And best part is u can move the seat to the highest position and use as dining chairs in restaurants. For me, I’ll say, go get it!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelsey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 18, 2020",
                "reviewTitle": "Good stroller!",
                "reviewText": "We bought this stroller when we found out we were having our second baby and it had been such a life saver, the basket holds soo much stuff, it’s super easy to use and convert back and forth! The only issue we had was there’s little peices in the 3rd holes where the peices slide up and down that were really hard to get out and our car seat wouldn’t fit until we removed them",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monica C ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 17, 2019",
                "reviewTitle": "Me encanto!!!!",
                "reviewText": "Aún no la uso en el día a día porque mis bebes aún no nacen, pero me parece que está muy funcional y práctica en el caso de que la uses para gemelos.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$279.99",
                "sellerName": "Premium Brands 101",
                "sellerRating": "5"
            },
            {
                "price": "$279.99",
                "sellerName": "BABY GEAR & MORE STORE",
                "sellerRating": "4"
            }
        ]
    }
}