{
    "remaining_requests": 11231,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/3Dquickclose-Compact-Fold-Stroller-Lightweight/dp/B0BSP4K34F",
    "body": {
        "name": "Summer Infant 3Dquickclose CS+ Compact Fold Stroller – Lightweight Stroller with Oversized Canopy, Extra-Large Storage and Compact Fold",
        "price": "$149.99",
        "originalPrice": "",
        "rawPrice": 149.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/3Dquickclose-Compact-Fold-Stroller-Lightweight/dp/B0BSP4K34F",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BW33HFZP"
        ],
        "asinVariationValues": [
            {
                "asin": "B082FDW992",
                "variationName": "Color",
                "variationValue": "3Dpac CS",
                "price": "$149.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41NhavtB4GL._SS36_.jpg"
            },
            {
                "asin": "B0BSP4K34F",
                "variationName": "Color",
                "variationValue": "3Dquickclose CS+",
                "price": "$99.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41zs0EAVv0L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41zs0EAVv0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41CZJRlvV0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nSMQL-stL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rRTh6dh5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41f5EMmWukL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PwCjpvWxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 yMJtURWL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Summer Infant Store",
            "link": "https://www.amazon.com/stores/SummerbyIngenuity%E2%84%A2/page/685A41C4-41C5-4DD0-90E7-80404C2B8F8C?ref_=ast_bln"
        },
        "brand": "SummerbyIngenuity™",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1931,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22. Order within 20 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LIGHTWEIGHT: Weighing in at just seventeen pounds, the Summer 3Dquickclose CS+ Compact Fold Stroller is easy to maneuver, making it the perfect stroller for on the go or as your little one’s everyday ride.",
            "COMPACT FOLD: The unique “quick close” technology lets you easily fold this compact stroller one-handed in seconds.",
            "CAN BE USED WITH CAR SEAT: This versatile baby stroller is compatible with a variety of carseats, including the Summer Affirm 335, Graco SnugRide Click Connect 35, Graco SnugRide SnugLock 35, Chicco Keyfit 30, Chicco Fit2 and Baby Trend Secure Snap Gear 35, which means you can start using it as soon as you bring your baby home.",
            "SAFETY & COMFORT: Keep them safe and comfortable with a five-point safety harness and an adjustable seat that can be reclined to the perfect position for your baby.",
            "EXTRA STORAGE: Keep all your gear organized (both large and small) with a sizable basket underneath the seat, as well as smaller storage solutions like a back pocket and cell phone holder."
        ],
        "description": "Keep things light without sacrificing safety (or style) with the Summer 3Dquickclose CS+ Compact Fold Stroller. This lightweight stroller offers a “quick close” feature that allows the user to fold it in seconds – with just one hand! The sleek design offers all the features of a full-size stroller including a five-point safety harness, large storage basket, a multi-position recline, a child’s cup holder, extra-large canopy, and a removable bumper bar for easily getting your little one in and out of. Adults will enjoy a cup holder as well as a cell phone holder, peek-a-boo window so you can check in on your little one through the canopy, and a storage pocket. At only seventeen pounds, it’s convenient for travel or just everyday use and is compatible with select infant car seats, so you can start using it as soon as your baby comes home.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b?ie=UTF8&node=166842011"
            },
            {
                "name": "Lightweight",
                "link": "https://www.amazon.com/Lightweight-Strollers/b?ie=UTF8&node=370094011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Summer Infant"
            },
            {
                "name": "Color",
                "value": "3Dquickclose CS+"
            },
            {
                "name": "Age Range (Description)",
                "value": "Baby"
            },
            {
                "name": "Model Number",
                "value": "31900"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,931 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,190 in Baby (See Top 100 in Baby) #7 in Lightweight Baby Strollers"
            },
            {
                "name": "Product Dimensions",
                "value": "34.5\"L x 20.5\"W x 41.25\"H"
            },
            {
                "name": "Item Weight",
                "value": "17 Pounds"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "50 Pounds"
            },
            {
                "name": "Material",
                "value": "Metal"
            },
            {
                "name": "Harness Type",
                "value": "5 Point"
            },
            {
                "name": "Warranty Description",
                "value": "90 Days Limited"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "3Dmini 3Dlite ST 3Dlite+ 3Dquickclose CS+ 3Dlite Wagon 3Dlite Tandem Age Range 6 months up to 45 lbs. 6 months up to 50 lbs. 6 months up to 50 lbs. 6 months up to 50 lbs. 6 months up to 50 lbs. per seat 6 months up to 50 lbs. per seat Weight of Stroller 11 pounds 15 pounds 14 pounds 17 pounds 25.5 pounds 25 pounds Car Seat Compatible No No No Yes No No Adjustable Recline Multi-position recline Multi-position recline One-hand multi-position recline Multi-position recline No No Adjustable Leg Rest No No No Yes No No Additional Features Two parent cup holders, parent storage pocket Parent cup holder, parent storage pocket, large sun visor pop-out Parent cup holder, parent storage pocket, peek-a-boo window, carry strap, cell phone holder, oversized canopy, premium fabrics Parent cup holder and cell phone holder, oversized canopy, large storage basket, easy one handed fold, peek-a-boo window Easy access mosquito net, dual snack trays and cup holders for kids, 4-wheel suspension, made with fabric from recycled materials Parent cup holder and cell phone holder, large canopy with front and rear sun visor pop-outs, large easy access storage basket, made with fabric from recycled material",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08b41b3d-ed34-46e8-a9f3-ea7f8bb08a39.__CR0,0,4042,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6559b87d-68fc-42a4-9b5a-c4ce26a56182.__CR0,0,2021,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6163a3b-9d10-4054-9a44-1157f7652ba7.__CR0,0,2021,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f537130a-bda9-40ab-97b1-c5c09f8fcab7.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/21259b97-c65f-462c-a227-cdf468bc2c8b.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/98850cdd-0b79-48bd-a40a-37096c4c2c23.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2adab55-a742-4834-8dcd-0e6880e06dc2.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2efda024-1856-482a-a836-110c795753f2.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7d130c75-2e18-4b91-9922-70574683fdde.__CR0,1,312,624_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jessica C.Jessica C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXRH5JNYV7VC76KMJUA4QLKXLXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FP8KZDFPPIWE?ASIN=B0BSP4K34F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2022",
                "reviewTitle": "5.0 out of 5 stars Replacing my Chicco Bravo with this!",
                "reviewText": "Been struggling along with the Chicco Bravo stroller for 10 months now. Got strong and figured whatever, I guess I'll just deal with it at this point and eventually I'll get an umbrella stroller. It's been in the back of my mind frequently that I do eventually need to get something lighter, something that doesn't make me dread putting the stroller in the car and lug it in and out of places.Then we took a flight with the Bravo and the airline lost the canopy somehow?!?!! I took it as a sign. Time to find a new stroller ASAP so I could get back on my daily walks this summer with my daughter!!I spent so many hours trying to pick the right stroller. This is such a hard thing to search for online. I went to a local Buybuybaby but their selection was a lot of $500+ strollers and I did not want to spend that much money. I also didn't want something super cheap feeling either, since I've been used to the quality of the Bravo, which is very sturdy. Goal was to find something for $200 or less, preferably closer to $100.I was looking for 1. Lightweight and small 2. Quality feel and able to push in the grass 3. Decent sized canopy, basket and tray/storage for baby and parent.I was surprised by the quality when I first opened the box. Here are my initial reactions - maybe if I can remember I will update again after using it for a few months.-Sturdy and more solid than I expected for price. Like the colors too.-Super quick and easy set up.-Surprised by and like the design of the 5 point harness. No connecting pieces like my Chicco Bravo. Set in place to connect as 5 regularly, or if you want to switch it to 3 point seems easy to do that. Lots of height and width adjustment appears to be available too.-Snack tray super easy to add or remove.-Cup holder was disappointing. Seems pretty flimsy but we'll see how it works. First time I folded up stroller it fell right off 😑.-Love how easy it is to adjust the leg rest, looks like that will work well.-Love the canopy coverage and the peekaboo window at first glance, although we'll see how it actually performs when we put it to use on a sunny day.-Wheels looks sturdy, but upon first push felt a tad wobbly. To be expected for a lightweight stroller though. It will certainly be an adjustment for me going from the almost all-terrain Bravo.-Wish handle bar was adjustable. Feels slightly high for me (5' 4\") but I'm sure I'll get used to it.-Parent storage pocket looks perfect for keys and phone and possibly small wallet.-Rear brake felt really tight but I was trying to push it without shoes on at first. Seems like it will hold well, which is good.-Basket is small but that's to be expected with a lightweight stroller. Seems bigger than other lightweight strollers I saw in stores. But cannot fit my itsy bitsy backpack diaper bag.-I haven't tried it yet, but I like that this is compatible with the Chicco KeyFit30 carseat. However, I don't like how the straps to connect the carseat seem like they will tend to flip out of their designated pockets and hang out/constantly need to be packed back into the pockets. Time will tell if this becomes a nuisance or not.-Best of all, the weight and size. It's lightweight, folds up so easily, is compact when folded, has a carrying handle and is just all around what I need to get out and about more frequently with an almost 1 year old!!",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710yjqNj12L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71HSNiHjs-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71QWY39UkSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Qbr8CdRsL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mom Needs CoffeeMom Needs Coffee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEF3D6PGXOSS2P6KUDKVWHVUDSAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GWR9YT2RTLI9?ASIN=B0BSP4K34F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing size! Great for busy areas, like hospitals and malls",
                "reviewText": "Wow, this is surprisingly awesome. I bought this for the lightweight, small size to push my 40lb, 40in tall preschooler. Go ahead and judge me, I don't care, I'm too happy about how smoothly our latest hospital visit was due to this new stroller. I pulled it out of my trunk and opened it in seconds. Pushed it across the long@ss parking lot, up the neverending hill to the last doors of our major hospital where my son has his visits, and through the busy halls with ease. Into the elevator without any issues and ohmygod the SWIVEL to turn my son forward facing without bumping any walls or rolling the thing was incredible and quick- a family of 3 entered directly behind us and wasn't disturbed in the least. In the past, corners were basically an Olympic event with strollers and I'd never attempted to turn my son around in the elevator. I wish I had bought this sooner! I'm using this for everything now.I wish I had taken a photo of my son in the stroller. He was in a puffy jacket and had a throw blanket on his lap, placed there before I put the tray on. He's old enough I didn't use the belt and the tray was enough to keep him secured as we moved.This is extremely light weight and folds down to an incredible size. It could probably fit behind my passenger seat on the floor in front of my son's car seat if absolutely necessary. My other 2 strollers took up most/my entire Subaru Impreza's trunk space whereas this one takes up about 1/3 of the space. It's also lightweight enough that I can lift it with one hand when closed. This stroller also features the one handed close feature and can hold infant seats although I don't need that at this moment. It has a shoulder strap and can be carried like an oversized messenger bag.The size of the stroller when open is SO much smaller than either of my Graco easy fold strollers (jogger and 4 wheeled that can be used with click connect system). It's also incredibly easy to maneuver. Like, wow it's SO smooth even with whatever material the wheels are made of (not rubber but I'm ok with the compromise now that I've used it). The basket is shallow but still fits the plastic rain cover I keep with us at all times and a blanket can be draped over the top instead of folded in the basket for later if needed.Our diaper bag is a backpack with stroller straps but I would definitely recommend NOT hanging the diaper bag on this stroller - it's just too light weight without a kiddo in it and will tip right over. I think I'd forget that fact if I did attach the bag just to have the stroller fall rafter letting my kid out. Nobody needs that mess; I'll continue to wear the bag.HIGHLY recommend to everyone but especially those who have to travel in busy/populated areas. I don't plan on using this at the amusement park but definitely for all hospital and mall visits, possibly the zoo.Edit 7/23- took this to an amusement park against my better judgement. I know, I know! But it's just so awesome I had to try... Oh well, lesson learned! While it did it's job on the concrete and firm paths, any area that had gravel fill (a thick layer of teensy rocks) really put me to the test and made me nervous (almost got stuck once or twice). My kid is old enough to understand \"sit back\" so his weight could be distributed more to the rear tires but I'm honestly not taking this again after this experience. I still love the stroller for everything else but I wouldn't recommend this anywhere that isn't mostly smooth.Edit 9/17/23Easy for bigger kids to use. This summer this stroller has been pushed by a 9yo, a 10yo, and an 11yo on separate occasions. Sometimes with my son, other times with a toddler. Overall, easy to maneuver and no frustrations.Edited to add photos:1- takes up 1/4 of my trunk. I have room for groceries!2- while it does fit behind my passenger seat, the seat had to be moved up slightly and my son wouldn't fit in his Chicco booster with the stroller in the foot space. However, if I needed to move the stroller from my trunk, obviously it would fit elsewhere easily. Also, I have a small sedan so larger vehicles would be more accommodating.3- This stroller is in the front of my Graco click connect strollers (traditional on left, jogger on right). It's obvious how this stroller is so much more compact than either of those.4- I was able to keep a cup of lemonade in the pocket. Why is this important? The cupholder on the tray is basically worthless for any cup that isn't toddler sized and the cupholder that can be attached to the stroller is MIA. This was a nice compromise BUT I was able to push the stroller one handed so really, this is only necessary if you need both hands (or a place to keep your cup while taking your LO to the restroom).",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71UC7uMmNQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81G4Ghm1SiL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81MbU5STpGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81aqf6cuDFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karla JaurezKarla Jaurez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 26, 2022",
                "reviewTitle": "Muy buena por un precio racionable",
                "reviewText": "Me gustó mucho porque es compatible con la silla para auto de Chicco KeyFit 30, como yo ya tenía la silla buscaba una que se ajustará a ella pero las de la marca son muy grandes y caras.Es de buena calidad, fácil de doblar y abrir. Lo único malo es que no se reclina completamente.El toldo es muy amplio peroooo suena cada que lo mueves, como que truena y a veces eso despierta a mi bebé. No sé si sea defecto de fabricación o así sean todas.Es una carriola sencilla, pero a buen precio.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610QMnzdBuL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "The KhansThe Khans",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 11, 2022",
                "reviewTitle": "Fantastic stroller - lots of great features and is perfect for travel and everyday use!",
                "reviewText": "I waited 2 months to write this review so I could thoroughly test out this stroller. I initially purchased it for travel as I was looking for something more compact and lighter than my standard stroller, but am now also exlcusively using it for my everyday walks. I recently took a couple of cross-country flights solo with my 12 month old, and this stroller was was a godsend for my trip. Here's why:I was able to quickly fold the stroller down with one hand while holding the baby in my other arm. The stroller itself isn't heavy, and the added shoulder strap makes it easier to carry while keeping your hands free. The basket isn't the biggest but for a compact stroller, it is still very generous (I managed to shove the diaper bag in there with no issues). Smooth one-hand manoeuverability! I chose this one over the popular Summer umbrella stroller because being able to steer the stroller with one hand while holding other bags in a busy airport is vital! Brake is activated with one foot.The canopy is large and opens up to provide very good shade. I particularly love the adjustable footrest - much better than other strollers where the kid's legs are just hanging off the seat. The mobile holder is a nice touch. There's a little envelope pocket behind the canopy, which can perfectly and discreetly hold smaller items like a wallet, keys, etc. There is also a sneaky little drink pocket nestled next to baby's seat as well, perfect to hold a sippy cup, baby bottle, etc.The stroller works a charm on sidewalks, and even slightly gravelly terrain, as the front wheels have suspensions so the ride isn't as bumpy. My baby seems to enjoy this stroller more than his original one, and it looks to be holding up well to our daily use. The wheels haven't given us any issues so far (no jamming as yet), and have been running smoothly. In terms of materials, the fabric is durable and cleans easily (I've spot cleaned it a couple of times already).A few points to consider (but not enough to warrant taking stars off):-The beverage holder isn't the most sturdy, but works fine for a standard bottle - there's literally a sign on it that indicates it isn't suitable for coffee cups so it's a bit silly for people to complain about how their cups are falling out.- I do wish the seat would recline more to facilitate more comfortable naps. My little one has napped in it a couple of time regardless, and he seemed fine.- The handlebar is not adjustable. My husband and I are tall (5'9\" - 5'11\") so the height of the handlebar is ideal for us, but I can imagine that for shorter adults, it may not be the most comfortable to manouever.- The stroller is quite compact when folded but perhaps not small enough to fit in the overhead baggage compartment on a plane (I gate-checked it instead).- I have not tested out the feature for adding an infant car seat, so cannot comment on that.All in all, this stroller was definitely one of my top baby purchases! Lots of lovely features, you're getting a lot more than what you're paying for in my opinion! It's a better-equipped alternative to an umbrella stroller. Ideal for travel and casual everyday use! Hopefully it lasts me the next couple of years until my little one outgrows it!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91WWD2KQX4L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vanessa RVanessa R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 5, 2021",
                "reviewTitle": "The best travel stroller",
                "reviewText": "The media could not be loaded. I just preface this review by telling you that I travelled alone by plane with my 2 year old daughter. This stroller is so seamless and easy to use that it actually made my trip with her more enjoyable. Because it folds up so easily with ONE hand, I was able to juggle her, bags and the stroller. It’s very light and the over shoulder strap is very handy. It has just enough storage: cup holder for you, pouch beside the handle bar, under seat shelf storage. Easy one hand handling. I spent HOURS a day walking the side walks and streets of Victoria, BC without any issues. The wheels are sturdy enough. The table for the child is just the right size for a sippy cup and a few crackers. The sun visor comes down surprisingly low! It did rain while we were here so her legs got very wet but I suppose you could buy a stroller cover. This is definitely worth it’s value. My daughter fit in it perfectly. The folded unit fits almost anywhere, including a small closet or under a chair. The cup holder on the handle bar is a bit flimsy so I wouldn’t recommend putting hot beverages there but it’s perfect for a water bottle or something.Highly recommend.",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/617QoL9CmEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7171O7vYxuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61j+xIzEbFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71qulwr7w4L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61-O3Gpbh3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61prvdHG+HL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/D166AqR0RjS.mp4"
                }
            },
            {
                "reviewerName": "fiona t.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on May 28, 2023",
                "reviewTitle": "Best stroller invested",
                "reviewText": "I was contemplating between 2 strollers for the past weeks and Im so glad I chanced upon this stroller with great reviews and now I have no regrets with mine. This is the 4th stroller I bought in 2 years and for the first time my husband actually love the stroller. Smooth ride, easy fold, comfy seat (baby loves it too) 10/10 will recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica Lynn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 17, 2024",
                "reviewTitle": "Great little travel stroller!",
                "reviewText": "We purchased this for our week away in Mexico and it traveled well on/off our plane right there and back. Love that the canopy goes so far down for extra shade from the sun. The recline is nice as well for naps... could go down a little further but it did the trick. The basket under is fairly spacious and the pocket behind the seat is nice too. We liked it so much we decided to just use it as our everyday stroller for the past 6+ months and it's held up nicely. Love that it's lightweight and not too bulky.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}