{
    "remaining_requests": 11192,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Baby-Trend-Snap-N-Go-Universal-Carrier/dp/B00838BNK2",
    "body": {
        "name": "Baby Trend Snap N Go EX Polyester Lightweight Foldable Universal Single Infant Car Seat Carrier with 2 Cup Holder and Covered Compartment, Black",
        "price": "$76.49$69.31",
        "originalPrice": "$76.49",
        "rawPrice": 76.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Baby-Trend-Snap-N-Go-Universal-Carrier/dp/B00838BNK2",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CD33RNVK"
        ],
        "asinVariationValues": [
            {
                "asin": "B008U4MKU6",
                "variationName": "Size",
                "variationValue": "Double",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00838BNK2",
                "variationName": "Size",
                "variationValue": "Single",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00838BNK2",
                "variationName": "PatternName",
                "variationValue": "Stroller",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "PatternName",
                "variationValue": "Stroller + SEAT,CS02D13A",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "PatternName",
                "variationValue": "Stroller + SEAT,CS66C49B",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "PatternName",
                "variationValue": "Stroller + SEAT,CV89D08B",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CHRVNDMP",
                "variationName": "PatternName",
                "variationValue": "Stroller + Infant Car Seat Base",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41blxoq6onL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51PyXfzpIiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DpBLAQWQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pNYj-121L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41u UrqINtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wc6HUxDLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YFRDMIHoL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/be90e28f-4092-4263-b8cb-0f00f5973d40/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a84d2cc7-d558-4493-a00e-4785d4a632ff/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d6161eec-4005-4976-939d-156717194018/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7df75904-8240-48ab-a0b0-37519dc736e2/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a29e17dc-180d-4de0-a350-a31467c0e233/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c721d8f-ea8c-4465-9e75-df8ff95251a9/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81LtbLTnDNL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81LtbLTnDNL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Baby Trend Store",
            "link": "https://www.amazon.com/stores/BabyTrend%C2%AE/page/0FBEC37A-4172-483B-89BC-9BF29059CEB4?ref_=ast_bln"
        },
        "brand": "BabyTrend®",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 8236,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tomorrow, February 17. Order within 7 hrs 11 mins",
            "FREE delivery Monday, February 26"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% Polyester",
            "Imported",
            "Instant Stroller Conversion: Baby Trend Snap-N-Go EX Universal Car Seat Carrier transforms your infant car seat into a stroller instantly, offering a seamless transition for parents on the move",
            "Compact and Travel-Friendly: Snap-N-Go EX baby stroller folds compactly, making it easy to store at home or pack for travel adventures; Comes with one-hand folding feature that amplifies portability",
            "Spacious Storage and Braking Confidence: Stroller boasts an extra-large storage basket underneath that provides ample room for essentials; Made with foot-activated rear wheel brakes for extra security",
            "Thoughtful Parent Tray: Car seat combo is equipped with 2 cup holders and a covered compartment, which offers a convenient space for parents to keep their drinks and personal items within easy reach",
            "Universal Compatibility and High Weight Limit: Accepts infant seats from various brands; Car seat carrier has a weight limit of 45 lbs"
        ],
        "description": "The Snap-N-Go® EX Universal Infant Car Seat Carrier allows adults to place an infant car seat on the carriage frame without removing their child from the infant car seat. A convenient parent tray with 2 cup holders and covered storage compartment keeps incidentals within reach. Lightweight and easy to transport the Snap-N-Go® EX features a convenient one hand fold for storage and transport. It also includes a large drop down storage basket to keep larget items close by. Safety features includes rear wheels with brakes for stability, adjustment straps on the carriage frame to cradle the car seat, and the securing strap for securing the car seat onto the carriage frame. Accepts most Baby Trend® infant car seats.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166842011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Baby Trend"
            },
            {
                "name": "Seating capacity",
                "value": "1"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Age Range (Description)",
                "value": "Infant, Toddler"
            },
            {
                "name": "Model Number",
                "value": "SG13105"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 8,236 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,375 in Baby (See Top 100 in Baby) #20 in Baby Strollers"
            },
            {
                "name": "Assembly Instructions",
                "value": "Adult Assembly Required, Some Tools Provided"
            },
            {
                "name": "Warranty Description",
                "value": "1 Year Limited Warranty"
            },
            {
                "name": "Import Designation",
                "value": "Imported"
            },
            {
                "name": "Product Dimensions",
                "value": "36.75\"L x 24.5\"W x 40\"H"
            },
            {
                "name": "Item Weight",
                "value": "14.2 Pounds"
            },
            {
                "name": "Folded size",
                "value": "39 x 19 x 12 inches NaN"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "30 Pounds"
            },
            {
                "name": "Material",
                "value": "Polyester, Plastic, Metal"
            },
            {
                "name": "Fabric Type",
                "value": "100% Polyester"
            },
            {
                "name": "Frame Material",
                "value": "Metal"
            },
            {
                "name": "Care instructions",
                "value": "Spot or Wipe Clean"
            },
            {
                "name": "Harness Type",
                "value": "5 Point"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amanda Brees",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM67ZLSNV2TH3O4MC7VM7GCXQBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RXJDQSUH06DJ?ASIN=B00838BNK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2021",
                "reviewTitle": "5.0 out of 5 stars The Perfect Infant Carseat Carrier",
                "reviewText": "I'm going to write the review I wish someone would have written for me when I first set out to buy strollers. In short, you're going to need three strollers. Get ready to invest $500 in strollers, and call it good to go. Any less, and you'll get what you pay for. Or worse yet, try a bunch of mid-priced strollers, and still not end up with what works.The first stroller you'll need is an infant seat carrier that is incredibly lightweight and easy to fold apart and back together. I can't imagine what I would have done without my Baby Trend Snap-N-Go EX Universal Infant Car Seat Carrier. When they are tiny, you're going to spend all sorts of time lugging that infant carrier around. You literally need something that basically falls right open to toss that heavy seat in and run errands. I used this thing constantly, and it was well worth the investment.I tried other similar infant carrier holder/carseat combinations such as the Graco Modes 3 Lite DLX Stroller, Includes Reversible Seat, Pierce and Evenflo Urbini Reversi Lightweight Stroller, but they both turned out to be a huge waste of money. The Graco reversible only works with their propriety travel system car seat, and the wheels are still plastic! No matter how tempting it may seem, don't settle for a regular sized plastic wheeled stroller no matter how many gadgets it might have.The Evenflo was also great in theory, but a waste of money. Being able to interchange the carseat, and flip the baby forward and backward just does not matter all that much at all. Instead, you REALLY just need a very lightweight and portable universal infant carrier. That's all I used for the first six months of my daughter's life, because she was so little.The next stroller you are going to need is a good jogging stroller. I love my JOOVY Zoom 360 Ultralight. In theory, you can get a carseat adapter for it. It has big wheels for walking off the postpartum weight, but it is still pretty compact and lightweight. I would get the Joovy Zoom 360 Ultralight Jogging Stroller, Large Canopy, Lightweight Jogger, Extra Large Air Filled Tires instead of the original ZOOM for sure. It is absolutely worth it to get the rain cover and the bigger canopy. There is nothing worse than going on a walk with the sun in your child's eyes most of the time.That said, you're still going to need something more compact than your jogging stroller. Don't fall for the trick of getting a regular sized stroller instead. That's a huge waste of money. You already have your jogging stroller, and an infant seat carrier. When they are less than six months old, those two should do the trick. Once they get a little older, you'll need to replace that infant seat carrier with an umbrella stroller.I tried the Cosco Umbrella Stroller with Canopy stroller. Another giant waste of money. I took it through airport security, and my daughter literally fell out of it onto the ground! I left it at my destination, and opted to carry her back through security the other way. Every parent thinks they need a 'regular' stroller, but what you actually need a shopping/airport/errand running stroller for your trunk. The jogging stroller can live in your garage for when you want to get your walk/run in. This second stroller needs to live in your car where you used to keep your infant carrier. It needs to have a five point harness, but it also needs a great canopy. That's my biggest complaint about the Zoom Ultralight 360: the canopy is worthless. It makes a huge difference. You also need it to be super compact. A stroller that is for the purpose of lugging around your baby needs to be small. Trust me, you'll pay all sorts of money for a 'regular' stroller, and it will sit there in your garage unused. Either you will use your jogging stroller to power walk/run, or you'll need something for on the run. That's really it.I HIGHLY recommend Joovy Kooper Stroller, Lightweight Stroller, Compact Fold with Tray. It is the quintessential alternative to a 'regular' stroller. It fits in my subcompact Scion XD no problem, and I just push the button to unfold it in an instant. It folds right back up no problem. The trifold takes up less space than a cheap umbrella stroller. It glides through tiny aisles. There is nothing worse than trying to push a GIANT stroller in any store. This is the solution. It is way more than an umbrella stroller, but way more helpful than a 'normal' stroller. You don't need your stroller to make your baby recline, or turn around. You just need a place for a snack, a cup, a water bottle, and some shopping items below the cart. The wheels are big enough, and even though they are plastic, they are only going to be for running in and out of stores. You'll use your jogging stroller for gravel, cement, rough roads, etc. This just needs to get you in and out of the coffee shop without needing someone to help you hold the door.And there you have it! This is the review I wish someone had written for me specifically when I set out on this incredibly expensive journey of finding a perfect stroller!",
                "reviewVotes": "639 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Curtis Cauthen ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDSP4QPIWB2IKHIEZJSYTUZR36Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O77CZ0IVQIEF?ASIN=B00838BNK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Heaven sent",
                "reviewText": "This stroller is my saving grace just what I needed for my twin boys. I was looking for a stroller that would fit into my trunk ( I have a 2010 bmw 528i for reference )and this is perfect, it's a tight fit but the handle detaches so it fits great. The bottom carrier basket is big enough to carry oxygen tanks and more since my boys are oxygen dependent. The stroller is extremely easy to put together no instructions needed, and folds up great, not clunky at all. Definitely recommend!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deanna NavaDeanna Nava",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMBI7L62SG3F4WTR2EQ4TN7SLEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AFGBMLH3EHMO?ASIN=B00838BNK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2021",
                "reviewTitle": "5.0 out of 5 stars Great buy",
                "reviewText": "I just got this in 2 days ago and have taken it for a fee test drives, so far I really like it. I wanted to specifically add pics of it folded and in my small trunk. That was one of the main pics I was looking for when going through the consumer reviews and I never found any. I have a Kia Soul that has a narrow and very small trunk. I have the baby trend skyline travel system and the stroller was way too big. I had to drive around with it on its side which prevented me from being able to use my trunk cover and made it difficult to close the trunk door. This small device fits perfectly in my trunk with a few inches of wiggle room on each side. I now have no issues using my trunk cover which I appreciate because I leave my diaper bag in the car and worried someone might break in thinking it’s something of value. The device is super light weight and I had no trouble carrying or folding it. Assembly took me about a whole 2 minutes to complete. I was a little weary about it given there were several bad reviews about the tires breaking off and the back tires not being compatible. I was happy to see all the correct parts when I unboxed it and so far have not had any issues with the tires. After looking at all the reviews it seems like the tire issues were between 2017-2019. I’m hoping the manufacture has fixed the issue since then. *however did I make a few modifications to the strap (at my own risk and discretion) because I personally did not like how it went across the car seat. My baby gets really fussy and I tend to take her in and out a lot. That strap was just annoying having to unbuckle it and then her each time. I ended up buying another buckle and installing it on the other strap so they each had a male/female part (pics included) that way I was still able to secure the car seat to the stroller but the straps are being bucked around the handle of car seat (one buckle on each side) rather than across the car seat. It works for me but obviously don’t do it if you’re not comfortable making any modifications to it. I noticed a lot of people complained that the car seat does not actually snap in to the stroller but the design of it is pretty secure. The seat just sits inside almost like a hammock but it’s very sturdy even without the straps. Overall, I am super happy with the purchase and hope it lasts long enough to get me monies worth. Hope this helps.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/713V0MGTaTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CYeCwFJyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71HnTwPKUzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71dOTJpRbdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71eZNCR4BSL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sophia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBC6ZBRFB55MV5GSJXIJI4FB4WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLQU20N8G18MA?ASIN=B00838BNK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Works well with any car seat carrier",
                "reviewText": "This has been one of my best purchases! It's very lightweight and easy to fold to take in the car as well. Has a nice size basket in the bottom for diaper bag, shopping bag(s), toys, etc. Much easier than using one of the name brand car seat \"systems\" and much less expensive too.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer M. Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWFPN73XSQ7UBGHKES5H44SLXIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CTXKJJHDOSLX?ASIN=B00838BNK2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 23, 2023",
                "reviewTitle": "4.0 out of 5 stars So handy and easy to use",
                "reviewText": "This thing has been a lifesaver. It SUPER easy to open and also to fold. It’s lightweight, which makes lifting easy. The baby always enjoys the ride, so it’s made life so much easier when we’re out and about. The only problem I have with it is the wheels stiffen up some at times, which makes it harder to direct. But for the price, that hasn’t been a big deal.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Justin Lusby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYTZZ5TP6SXCORXKSCCF4RWKY4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BQOLLRBD4K7U?ASIN=B00838BNK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Buy this product",
                "reviewText": "Worth the money. Easy to store or throw in the back of the truck. Dries easy if gets wet in a matter of seconds. Very lightweight and worth the money. You can buy fancy 600 dollar travel systems, but you’re throwing money in the trash. Buy the baby trend carrier and this and save hundreds of dollars. Easy to assemble. No tools required. It’s literally as the label describes as snap n go. Never once have I thought this was a useless purchase!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juanita Richardson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYBN5PIE7N3WYIOBRTMIIIGT7VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IN4Z87MC92PL?ASIN=B00838BNK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Must buy!",
                "reviewText": "This is really good. Lightweight and easy to navigate. Which it took up less space but this is about as small as you can get for a car seat to attach to. I’m 5’2 and my husband is 6”2 and it is still comfortable to push around at either height.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fautum",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 10, 2023",
                "reviewTitle": "Buen producto",
                "reviewText": "Tarde mucho en comprarlo, pero no me arrepiento, es una excelente carriola, práctica, cómoda y ligera.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ANGELICA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 21, 2018",
                "reviewTitle": "Súper ligera, practica y útil.",
                "reviewText": "De las mejores cosas que compramos con nuestros bebés. No pesa nada! Hasta como una mano la puedes cargar. Muy practica. Compatible con car seat graco. Vivíamos en un depa con un elevador muy pequeño y fue la única que cupo. Los contras: sólo sirve para bebés gemelos. Difícil para vender o regalar. Mis gemelos fueron más pesados y más grandes de la talla y peso común, así que al año y Par de meses ya no Cabían. Una cosa buena, que es de bajo precio, y te permite darte tiempo para saber qué carriola doble necesitarás más adelante se acuerdo a tus necesidades, y te da tiempo de comprar la correcta de acuerdo a tus requerimientos personales, ya que es difícil elegir carriola doble gemelar ya que los consejos para una sencilla no aplica para una mamá de gemelos.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "4431712509",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 30, 2019",
                "reviewTitle": "Muy práctico",
                "reviewText": "Rápido de armar y compacto, coloco los dos asientos de bebés que son muy diferentes muy rápido. Cumple con las necesidades para dos bebés. Mis bebés tienen menos de un año y caben perfectamente, prefiero traerlos ahí que en la carriola doble que es muy pesada",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Graciela",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 19, 2019",
                "reviewTitle": "Ligera y económica. Justo lo que esperaba.",
                "reviewText": "Ligera, economica, practica y funcional. Facil de empujar, montar y desmontar. La doblo y subo a la x-trail sin problemas. Doblada se mantiene en forma vertical sin caerse. Justo lo que esperaba. Se adapta a cualquier marca de silla infantil (las nuestras unas chicco fit2).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OMAR GUZMAN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 8, 2018",
                "reviewTitle": "EXCELENTE SERVICIO Y PRODUCTO",
                "reviewText": "ME LLEGO EN EL TIEMPO QUE ME INDICARON INCLUSO ANTES Y EL PRODUCTO ES LO QUE YO ESPERABA, EXCELENTE PAGINA, LA RECOMIENDO",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}