{
    "remaining_requests": 11274,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Summer-Infant-Mini-Convenience-Stroller/dp/B07P1YSC18",
    "body": {
        "name": "Summer Infant, 3D Mini Convenience Stroller – Lightweight Stroller with Compact Fold MultiPosition Recline Canopy with Pop Out Sun Visor and More – Umbrella Stroller for Travel and More, Gray",
        "price": "$59.99",
        "originalPrice": "",
        "rawPrice": 59.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Summer-Infant-Mini-Convenience-Stroller/dp/B07P1YSC18",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BW3HMLBQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B07GGHVL64",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$59.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Wb6bsO7rL._SS36_.jpg"
            },
            {
                "asin": "B07P1YSC18",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "$60.52",
                "variationImageURL": "https://m.media-amazon.com/images/I/41SJ9qnp2AL._SS36_.jpg"
            },
            {
                "asin": "B0BMJ5FL3L",
                "variationName": "Color",
                "variationValue": "Gray/Black",
                "price": "$69.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/410VNb6aHAL._SS36_.jpg"
            },
            {
                "asin": "B0BS9SWRM1",
                "variationName": "Color",
                "variationValue": "Light Gray",
                "price": "$69.28",
                "variationImageURL": "https://m.media-amazon.com/images/I/41rwSKelsDL._SS36_.jpg"
            },
            {
                "asin": "B07SRVB6T6",
                "variationName": "Color",
                "variationValue": "Pink/Black",
                "price": "$59.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41s7N5tR2jL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41SJ9qnp2AL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/410yU sbaJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41o1qpvpjTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SlpiRWojL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 -JfZatEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MU6aFgcsL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1rf-R8wCvS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/51ZqHb+HiEL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Summer Infant Store",
            "link": "https://www.amazon.com/stores/SummerbyIngenuity%E2%84%A2/page/685A41C4-41C5-4DD0-90E7-80404C2B8F8C?ref_=ast_bln"
        },
        "brand": "SummerbyIngenuity™",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 18528,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 20 hrs 4 mins",
            "FREE delivery Thursday, February 22. Order within 20 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% polyester",
            "Imported",
            "LIGHTWEIGHT - A lightweight stroller makes any outing a little easier; The Summer 3Dmini Convenience Stroller has a durable steel frame that weighs 11 pounds and has a full-sized seat, plus auto-lock, anti-shock front wheels and lockable rear wheels",
            "FOR TRAVEL AND EVERYDAY - Whether you’re traveling or just on the go running everyday errands, having a lightweight, compact stroller is a must! It’s mini, but mighty for long-term use and offers both an everyday and travel stroller option",
            "MULTI-POSITION RECLINE - Keep your little one comfortable with multi-position recline, padded seat back and padded 5 point safety harness; It’s perfect for nap time strolls and edge-of-the-seat travels; Maximum weight for this toddler stroller: 45 pounds",
            "COMPACT FOLD - The easy, compact fold makes it simple to store this lightweight umbrella stroller and bring it with you on the go; Plus, it has a hassle-free canopy with flip out sun visor that is perfect for sunny days",
            "EXTRA STORAGE - With plenty of storage in this stroller, you won’t have to leave anything at home; It includes a storage basket, rear storage pocket and two cup holders"
        ],
        "description": "With the Summer 3Dmini Convenience Stroller, you don’t have to sacrifice any features you want in a stroller. It’s mini, but mighty for long-term use and full of premium features for both parents and their little ones. This convenience stroller has a durable, lightweight and stylish steel frame that weighs only 11 pounds! With a compact, easy to fold frame, you can be on-the-go running errands or traveling or stow and go with ease. Some of the parent-friendly features included in this lightweight stroller include: 2 cup holders, a storage pouch, storage basket, auto-lock, anti-shock front wheels, lockable rear wheels and more. The comfort features for baby include: a full-sized seat, multi-position recline & padded seat back, hassle-free canopy with pop out sun visor, padded 5-point safety harness and more.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b?ie=UTF8&node=166842011"
            },
            {
                "name": "Lightweight",
                "link": "https://www.amazon.com/Lightweight-Strollers/b?ie=UTF8&node=370094011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Summer Infant"
            },
            {
                "name": "Seating capacity",
                "value": "1"
            },
            {
                "name": "Color",
                "value": "Gray"
            },
            {
                "name": "Age Range (Description)",
                "value": "6 months up to 45 lbs."
            },
            {
                "name": "Model Number",
                "value": "32873"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 18,528 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#403 in Baby (See Top 100 in Baby) #1 in Lightweight Baby Strollers"
            },
            {
                "name": "Harness Type",
                "value": "5 Point"
            },
            {
                "name": "Product Dimensions",
                "value": "8.3\"L x 7.6\"W x 44.1\"H"
            },
            {
                "name": "Item Weight",
                "value": "12.62 Grams"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "45 Pounds"
            },
            {
                "name": "Material",
                "value": "Alloy Steel"
            },
            {
                "name": "Fabric Type",
                "value": "100% polyester"
            },
            {
                "name": "Frame Material",
                "value": "Alloy Steel"
            },
            {
                "name": "Warranty Description",
                "value": "1-year manufacturer's warranty"
            },
            {
                "name": "Import Designation",
                "value": "Imported"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "3Dmini 3Dlite ST 3Dlite+ 3Dquickclose CS+ 3Dlite Wagon 3Dlite Tandem Age Range 6 months up to 45 lbs. 6 months up to 50 lbs. 6 months up to 50 lbs. 6 months up to 50 lbs. 6 months up to 50 lbs. per seat 6 months up to 50 lbs. per seat Weight of Stroller 11 pounds 15 pounds 14 pounds 17 pounds 25.5 pounds 25 pounds Car Seat Compatible No No No Yes No No Adjustable Recline Multi-position recline Multi-position recline One-hand multi-position recline Multi-position recline No No Adjustable Leg Rest No No No Yes No No Additional Features Two parent cup holders, parent storage pocket Parent cup holder, parent storage pocket, large sun visor pop-out Parent cup holder, parent storage pocket, peek-a-boo window, carry strap, cell phone holder, oversized canopy, premium fabrics Parent cup holder and cell phone holder, oversized canopy, large storage basket, easy one handed fold, peek-a-boo window Easy access mosquito net, dual snack trays and cup holders for kids, 4-wheel suspension, made with fabric from recycled materials Parent cup holder and cell phone holder, large canopy with front and rear sun visor pop-outs, large easy access storage basket, made with fabric from recycled material",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08b41b3d-ed34-46e8-a9f3-ea7f8bb08a39.__CR0,0,4042,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6559b87d-68fc-42a4-9b5a-c4ce26a56182.__CR0,0,2021,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6163a3b-9d10-4054-9a44-1157f7652ba7.__CR0,0,2021,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f537130a-bda9-40ab-97b1-c5c09f8fcab7.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/21259b97-c65f-462c-a227-cdf468bc2c8b.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/98850cdd-0b79-48bd-a40a-37096c4c2c23.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2adab55-a742-4834-8dcd-0e6880e06dc2.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2efda024-1856-482a-a836-110c795753f2.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7d130c75-2e18-4b91-9922-70574683fdde.__CR0,1,312,624_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dchiz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4TPULBM3PNT7BQ2BBKQDJYZLEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TO8ROURIK2OF?ASIN=B07P1YSC18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Better than expected",
                "reviewText": "I was a little worried after reading all the reviews but made the purchase anyway based on price. I wanted it to take on vacation with my toddler grandson because the one his parents have is too big and bulky and takes up too much room in the car. It arrived just before we left so we took it in the box and assembled it upon arrival at our vacation spot.It was easy to assemble, and based on reviews, we made sure we knew how the lock mechanism worked on the front wheels that keeps them either going straight or being able to turn freely. As others said, it WAS hard to engage the mechanism at first but honestly, we left them in the free position.The stroller was lightweight, easy to fold and easy to maneuver. We LOVED the built in zippered storage pouch with cup holders! Also, the canopy’s extra Sun visor was great for our little guy and there was plenty of airflow around him. Having storage underneath was an extra bonus for such an inexpensive stroller.The only thing that was at all a problem was the positioning of the vinyl footrest. It seemed to be at an awkward height so if he was using it, his knees were bent and up high - and if he extended his legs, they hung over the edge. Regardless, we loved the stroller. We used the stroller for 9 days, on concrete, on gravel, on grass - basically everywhere we went while in South Dakota. In fact, my daughter in law was so pleased with it that she ordered one as soon as we got home! She now keeps it in the car for regular use - and the big bulky stroller that was great for infants is now relegated to the garage ( for the next one ). And the one I bought stays at Nana and Papa’s house so we have it for any of the grandkids who are visiting. I would recommend this stroller to anyone thinking about buying it.",
                "reviewVotes": "49 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hannah Crouse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAWWC6IFMESKZKJ373JZ7VECJLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWDLAAD4H6RF4?ASIN=B07P1YSC18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Light weight and compact",
                "reviewText": "We needed a small travel stroller with a high weight limit for our special needs child, so we don’t have to lug the large stroller. This is perfect. Fast delivery, the next day. It’s compact, very easy to put together, light weight and our child fits perfectly. The cup holder and zipper storage are very nice. Canopy is nice has extended panel in the front and can be easily removed if needed. Stroller fold down easily and all 4 wheels can quickly and easily be detached if needed. We haven’t had it out in public yet but for a few stroll around the house and driveway it’s seems nice. Only down side, I wish the under storage was a smidge bigger with higher netting that went all the way around the bottom to store more but for quick trips like the doctor, store or even amusement parks this is perfect for what were looking for.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. Groves",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUORAHBKQY542E4P4NSF36SKMRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L4IG0VKJE046?ASIN=B07P1YSC18",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "4.0 out of 5 stars Good for what it is.",
                "reviewText": "I love that this stroller is small.I love that this stroller is so lightweight.I do not love that the basket can't fit my gym bag, but that's a natural consequence of the size of the stroller. It's fine.I really, really dislike the latch. This thing does not stay folded. I jam it against the back seat in the cargo area of my car and hope it doesn't slide back and flop open. I jam it into a corner at the gym daycare and hope it doesn't fall over and flop open. It's a 50/50 gamble every time.It occasionally doesn't close smoothly and I have to unfold it and start over for no discernible reason. A little annoying.The canopy is great when it's in place; I like that it's large compared to most umbrella strollers. But it pops off one side or the other pretty often, so unless it's absolutely pouring, I usually detach it and leave it in the car.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ChrisChris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUCQHM2ZKOY6LAFLLHOXZX4OCIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T0OFB525LRHM?ASIN=B07P1YSC18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 17, 2019",
                "reviewTitle": "5.0 out of 5 stars 3D Mini compared to Graco TraveLite",
                "reviewText": "I ordered both the Graco and Summer 3D stroller. Here is my opinion on the Graco compared with the Summer.Graco has taller handles, great for taller people, not necessary for my husband and me since we are of average height.The storage bin is much more accessible and is larger on the Graco due to thefolding mechanism (see photos). I prefer the Graco when it comes to folding and unfolding, they have provided larger handles for those maneuvers. However the latch that keeps the stroller closed doesn’t keep the stroller as compact as it could be. Graco has provided a carrying handle mounted onto a side bar, a nice feature I think. The seat does recline, but certainly not suited for a baby under 6months. The straps are adjustable, but the Summer stroller allows for much more adjustable variations. Both strollers reclined with ease. One downside of the Graco strap: when unbuckled the over the shoulder straps don’t stay attached to the waist straps. This make for 2 issues. 1. The strap comfort pads slide off every time you unbuckle 2. You have to reattach these every time you want to buckle up the kiddo. I appreciated the Summer stroller in this aspect, the shoulder straps clip onto the waist straps. Allowing them to be removed, only when you so choose. I preferred the Graco cup holder over the Summer, because it’s removable and plastic. The Summer cup holder is made of material, it is flimsy, and not easily cleanable. The plus on the Summer stroller cup holder is that it has a zipper pouch for accessories, phone, etc. The Graco has a removable lap bar, while the Summer stroller does not offer this feature. They both seemed equally easy to push. The Graco has bigger wheels, making it easier to push through dirt and rocks. Overall the Summer Lite Stroller is smaller, more compact, and lighter. My husband ended up picking the Summer Lite Stroller due to its smaller size and he preferred its features over the Graco. We gifted the Graco to my 6ft tall sister and brother-in law who we thought would appreciate its larger/taller size.",
                "reviewVotes": "590 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71AA4mO-3fL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71AeKsoXtAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71VwC+hKWLL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71zTKs2cLyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Valerie Robertson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 8, 2023",
                "reviewTitle": "Grama's Special Wheels",
                "reviewText": "While I love carrying my grand daughter, she is now 16 pounds so that doesn't work for long. This stroller is so easy to use, lightweight and she loves going for rides outside and in the mall in it. The bottom storage is a bit small but otherwize it rides well and is padded and adjustable height. Good straps to ensure baby is secure. The top wind and sun cover is removable. I add a backpack or a grocery bag across the handles and we are good to go. It can be a bit tippy if you put too much weight on the handles but otherwize its a great height for walking for seniors and is door wide friendly. Am loving it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Parija",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 30, 2020",
                "reviewTitle": "Exactly as expected. 👌 nice",
                "reviewText": "Loved the product and packaging. Delivered before expected time during pandemic. Easy to fold. Light in weight. Not fancy but decent. For everyday use. Quality of wheels is good. Breaks are functional. Canopy is small.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 1, 2024",
                "reviewTitle": "Nice but..",
                "reviewText": "Lightweight, and easy to put together, sadly my toddler seemed too big to be in this stroller, only 30 inches tall. Other than that I did like the stroller the sun shade was really nice too!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yusra Negash Said",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 30, 2023",
                "reviewTitle": "Better Than Expected!",
                "reviewText": "I typically don’t write reviews but this stroller was a great purchase!We wanted a cheap stroller so that our heavy duty one wouldn’t be damaged and because it was so bulky to travel with. Considering the price, we were expecting a truly low quality product of the summer. This was not the case! I traveled with my daughter (just over a year old) through the airport, all through a city, and the stroller held up very well. She was able to nap as the stroller reclined!Pros:- able to hold drinks, keys etc- able to hold diaper bag on the handle- easy to maneuver- easy to set up with one hand- lightweight- easy to open and close- if you need to shorten it for travel, you could ways remove the wheels and canopy (they’re super easy to install!)Cons:- under stroller space is quite small (I usually put a blanket there)- a little longer than expected with no removable partsWould definitely recommend anyone planning to travel either alone or with your family as it is light weight, makes life easier, and if it gets damaged you won’t be as sad due to the price :)",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "Great value for a travel stroller!",
                "reviewText": "This travel stroller is easy to assemble, light weight and compact. Great for travelling.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71UxsyaNsGL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}