{
    "remaining_requests": 11120,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Joovy-Lightweight-Swing-Open-Extra-Large-Retractable/dp/B07NFS7G26",
    "body": {
        "name": "Joovy Kooper Lightweight Baby Stroller Featuring Removable, Swing-Open Tray, Big Wheels, Reclining Seat with Footrest, Extra-Large Retractable Canopy, and Compact Fold (Olive)",
        "price": "$299.99",
        "originalPrice": "$299.99",
        "rawPrice": 299.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Joovy-Lightweight-Swing-Open-Extra-Large-Retractable/dp/B07NFS7G26",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B096B4DDTH"
        ],
        "asinVariationValues": [
            {
                "asin": "B07NFSYJ3H",
                "variationName": "Color",
                "variationValue": "Forged Iron",
                "price": "$299.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41-cfzSnuvL._SS36_.jpg"
            },
            {
                "asin": "B07NFRJ85G",
                "variationName": "Color",
                "variationValue": "Glacier",
                "price": "$199.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41J07TwRDnL._SS36_.jpg"
            },
            {
                "asin": "B07NFS7G26",
                "variationName": "Color",
                "variationValue": "Olive",
                "price": "$199.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41KaPfMBa+L._SS36_.jpg"
            },
            {
                "asin": "B07NFTVP3V",
                "variationName": "Color",
                "variationValue": "Paprika",
                "price": "$242.49",
                "variationImageURL": "https://m.media-amazon.com/images/I/41rbs45qFzL._SS36_.jpg"
            },
            {
                "asin": "B07NFVFLPL",
                "variationName": "Color",
                "variationValue": "Sand",
                "price": "$199.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41WrrjkCkNL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "Only 2 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41KaPfMBa L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41xBdQooYSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513zC4wY7BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518WH2F6F0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517gSpZPHxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ejtx5cLJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518gIpJK3IL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a22ae44c-5336-4ede-8a28-077b4bbded08/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6fed8f23-1d1e-415e-9f34-6c2237ea50c3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2127ce6-273d-48a9-9799-6fd6b11aa23a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa7630f3-2010-4523-a1f0-e3182f10c5b7/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/082d0c76-bd3b-4bfb-a51d-e413524105ac/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f4739652-cc7d-415c-b20b-f5b3ffb50238/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Joovy Store",
            "link": "https://www.amazon.com/stores/Joovy/page/0B8B05E6-8000-4C4A-AAD9-55FB02D94D3E?ref_=ast_bln"
        },
        "brand": "Joovy",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 441,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 6 hrs 47 mins",
            "FREE delivery Thursday, February 22. Order within 19 hrs 47 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SWING-OPEN TRAY has extra-deep cup holders for bumpy rides and this lightweight stroller is designed so little ones can’t kick the tray and lose their snacks! It also folds down with the stroller, so feel free to keep it attached",
            "BIG WHEELS on this compact stroller are the biggest wheels of any comparable stroller on the market. That means a smooth ride for little ones and an easy one-handed push for you",
            "RECLINING SEAT WITH FOOTREST lets little ones kick back and relax with the customizable recline of the Kooper’s seat without limiting your access to the storage basket below",
            "EXTRA-LARGE WATER REPELLANT CANOPY provides UPF 50 sun protection from almost any angle and unzips for even more coverage and includes a peek-a-boo window",
            "BUILT FOR FAMILY, DESIGNED FOR LIFE - Joovy believes that happy, healthy parents produce happy, healthy children and the Kooper foldable stroller is designed to be compact and hard-wearing to carry your little one up to 55lbs"
        ],
        "description": "Joovy is an American company that makes vibrant, high-quality gear for your family. All their products, from high chairs to double strollers, have been designed to be useful, dependable, and just plain FUN. Say goodbye to ugly patterns and throwaway construction: you can use Joovy's products until they've been run ragged by the memories you make as a family. Joovy's Kooper is a full-sized baby stroller that is tough, compact, and lightweight all at once. The Kooper has a deep set, swing open tray, so no one will kick the tray and lose their snacks on their way off the stroller, as well as Joovy's signature one-step linked brake, to stop any runaways before they start. The Kooper was designed for comfort: it features the biggest wheels of any comparable stroller on the market, as well as an extra spacious, reclining seat for just kicking back and relaxing. As you've come to expect with all of Joovy's products, the Kooper has undergone extensive safety testing and is manufactured without flame-retardant chemicals or other harmful industrial materials. It comes in six colors--black, forged iron, glacier, olive, paprika, and sand--and measures 34.5\" L x 21\" W x 41\" H.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b?ie=UTF8&node=166842011"
            },
            {
                "name": "Lightweight",
                "link": "https://www.amazon.com/Lightweight-Strollers/b?ie=UTF8&node=370094011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Joovy"
            },
            {
                "name": "Color",
                "value": "Olive"
            },
            {
                "name": "Age Range (Description)",
                "value": "Baby"
            },
            {
                "name": "Model Number",
                "value": "8222"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 441 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,858 in Baby (See Top 100 in Baby) #42 in Lightweight Baby Strollers"
            },
            {
                "name": "Product Dimensions",
                "value": "34.5\"L x 21.1\"W x 40.9\"H"
            },
            {
                "name": "Item Weight",
                "value": "16.17 Pounds"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "55 Pounds"
            },
            {
                "name": "Material",
                "value": "Aluminum"
            },
            {
                "name": "Frame Material",
                "value": "Aluminum"
            },
            {
                "name": "Harness Type",
                "value": "5 Point"
            },
            {
                "name": "Import Designation",
                "value": "Imported"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Premium, Compact Travel Stroller The ONLY compact stroller in the US with a tray that folds with it",
                "media_link": []
            },
            {
                "media_text": "Previous page Adjustable Canopy With an option to extend even more with zipper, UPF 50 sun protection and a mesh peek-a-boo window Built-In Storage Zippered pocket and mesh cup holder Flip-flop Friendly Parking Brake One tap locks and unlocks both sides Car Seat Adapter Available Minimum child age in Kooper seat is 3 months+ Kooper Universal Car Seat Adapter sold separately Compact One-Handed Standing Fold Weighs just 16 lbs., making the Kooper a perfect option for travel Next page 1 Canopy 2 Parent Organizer 3 Brake 4 Newborn Ready 5 Fold",
                "media_link": []
            },
            {
                "media_text": "The Joovy Difference Built-In Comfort The deluxe extendable canopy offers added sun protection with extra headroom. The Kooper's wide seat offers comfort as your child grows. Nap-Ready Reclining Seat Let your little one kick back and relax. The Kooper's seat has a customizable recline, perfect for naps on-the-go. More Storage Compact strollers never bring the noise with storage space, but the Kooper is a game-changer, with a whopping 15 lbs of storage capacity. Travel Friendly With a one-handed fold and lightweight frame, the Kooper is great for traveling with limited cargo space.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/66231ad4-c5e9-48e2-9f94-f4bc65038fba.__CR0,0,625,469_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7b803cdc-79fb-4005-bc90-bdc0f10a96b8.__CR0,0,626,470_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/85c74ca7-c6a9-4a6d-a78d-1a91d1c06707.__CR0,0,625,469_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c50b850c-5cfe-4814-9a73-2536202a0c09.__CR268,119,1658,1244_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/beab7560-723f-48cf-9ebe-d914fa94db8c.__CR0,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0569b2ce-63a1-4240-b692-5c2714243fed.__CR0,0,3051,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2704869d-80d8-4e6e-adfe-f2e19c229e21.__CR0,0,3050,1250_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/08f0e289-3251-4e43-8c4c-3caf7151b50e.__CR0,1,3050,1250_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/368af48b-6a60-4c3f-bc91-966540c372c1.__CR0,0,3050,1250_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2bf44ccb-f96c-4503-a979-b60bb349c9db.__CR0,1,3050,1250_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/eabfab58-f6d2-4472-8ea1-567ee167cf92.__CR0,1,3050,1250_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/66231ad4-c5e9-48e2-9f94-f4bc65038fba.__CR0,0,625,469_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7b803cdc-79fb-4005-bc90-bdc0f10a96b8.__CR0,0,626,470_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/85c74ca7-c6a9-4a6d-a78d-1a91d1c06707.__CR0,0,625,469_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c50b850c-5cfe-4814-9a73-2536202a0c09.__CR268,119,1658,1244_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Elli&Mama",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJWJOZBX465TCG3ZWJRPR6QWBPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZKOZ4GYRQOLC?ASIN=B07NFS7G26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2021",
                "reviewTitle": "5.0 out of 5 stars Lots to read/ lots of info- kooper vs minu vs metro 2020",
                "reviewText": "I love my new stroller! I bought and returned TOO MANY bc I wasn't happy. I had bought the Uppababy Minu and also the Ergobaby Metro 2020 and returned both. I was looking things like; 1: comfort for my LO, 2: foldability (my new word), 3: maneuverability, and being a woman- 4: a nice sleek looking design thats easy to clean.Seat: the seat is actually flat which makes it more comfortable. The minu and metro both had a slight tilt in the seat that after a few minutes my daughter looked like the seat belt was the only thing holding her in and honestly looked super uncomfortable.The minu seat was very hard and rigid (could be fixed with a cushion but that'd cost more $ after the $430 I already paid).The metro was so plush and so comfortable, I mean come on- the brand is ergobaby, but not if my kid is hanging on by a thread. I wish ergobaby would sell just the seat cushion bc I'd buy it in a second. My daughter's comfort is first and foremost on my list.Foldability: super easy to \"pop\" open and close, not \"one handed\" bc of the safety latch but I open the stroller before I get my kid. I will say it is do-able one handed if the latch is unlocked first and then opened. I also like the close bc it'll stand up on its own without being all over the nasty ground. One thing I don't like is that when you close it the front bottom part of the stroller hits the ground and can get scraped but I'm trying to find a way to fix that.Minu- great to open and close and oddly very satisfying 🙃, also very very sturdy, like a damn tank!Metro- hard to pop open like the other 2 strollers. Like you have to fling the damn thing multiple times to get it to lock open or you have to do it manually while this oddly noodle like stroller is just flopping around.Maneuverability: joovy kooper is small width wise, much better then the full size bus I had before (you would think someone would've told me I didn't need a huge stroller), takes turns like a champ and fits between the tiniest space.Both minu and metro turned great and were small enough width wise. So all 3 are pretty even.FOR THE KID: Kooper has a nice tray, which is a must for us, and the leg rest adjusts which we actually use a lot more then expected.Minu doesn't have adjustable leg rest and the tray was extra at the time and metro was hard to push the buttons to adjust. The seat CAN sit straight up if you pull hard enough on the string/tab thing. This is the same type of adjuster the other strollers have (I know for sure on the minu, don't remember the metro). I actually don't like this part of the stroller but it's fine and not too annoying.The seat is plenty big enough for a toddler. My daughter is almost 3 weighing 30 lbs and about 36-37 inches and she has plenty of space for her head and for her legs. I was worried about this bc all reviews I saw were for little ones a year and under. She can use this for awhile. She LOVES the sunshade and I do too. It's nice and big enough to cover that late afternoon sun from blinding her and gives her a private little space if she needs to sleep.FOR US: looks nice and sleek (I bought the all black) and unlike the minu the all black doesn't cost an extra $30 bucks after the $400 you dish out first. Metro didn't cost more for black either though. The tray pops out for easy cleaning and I can close the stroller with it. This is a selling point of joovy but I also can do this with other strollers that don't advertise this. The storage area is made in such a way that things don't fall out and is pretty spacious. With the minu things would easily fall out of the front bc of how it's made/angled. Metro was very small and would fall out the back. Kooper also has a little zip storage bag which comes in handy at odd times. I do worry about the canopy being weather proof. I live in the southwest were we don't get much rain and the winters are mild compared to what others may have but I will find a cover if necessary to protect my baby. I do like the peekaboo window, it's a simple fold over design with a big enough space to actually see your LO.We're gonna have another baby so I love that I can buy the carseat adapter and use basically any careseat brand and not need a new stroller (one of the reasons I bought this one). And the wheels can be changed so this can definitely make it through another kid. I haven't washed the fabrics yet, so far all I've done is wipe down here and there but it's been easy to clean cheetos and chocolate 😋.I've been looking for a unicorn stroller and I think I may have finally found it. I've read hundreds of reviews and looked at/tried out easily over 30+ strollers (my poor kid being my test dummy for lack of a better term). I'm surprised joovy kooper isn't on more top 10 lists. Everyone has different needs and all babies are unique but from what I've tried this works great with babies that can hold themselves upright. I'm not afraid to spend $ to get a quality item, but sometimes the higher end models don't meet my expectations.I'd highly recommend joovy kooper. I will update after we've had the stroller longer for durability, etc.I don't get compensated in anyway, just wanna help out other parents since I did most of the hard work already... your welcome! 😇",
                "reviewVotes": "211 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Love 2 Shop",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZQGAQJSTGMO4SPJ5DNBJQYC6CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2764RT7QW4OOY?ASIN=B07NFS7G26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2021",
                "reviewTitle": "5.0 out of 5 stars LOVE LOVE LOVE",
                "reviewText": "So, first of all let me tell you I looked at soooooooo many strollers, it was exhausting!I have been using this stroller for awhile now, so I can give you my honest review of it.I was given a Bob stroller (a great stroller and must have for serious outings/hiking/walking/running).But I wanted another stroller that was light and easy to maneuver around, especially for quick trips or a short walk, but even for a zoo day too. I also wanted features of a good sun cover, basket storage, and a tray. This stroller is EVERYTHING!!!It is super easy to maneuver anywhere, it's lightweight but definitely NOT cheaply made. Handles bumps in the road with ease, I never get stuck. One finger easy turning. Seriously fantastic.The sun cover has absolutely AMAZING coverage, with a a perfect peek through area to watch the baby/toddler.The tray is fantastic!!!! Easy to open just one side, easy to take completely on/off, easy to clean and folds with the stroller!The backseat adjustment is easy to use and allows any position you want.Brakes are secure and simple to use, located in a convenient area as well.Seat belts are very secure from the child opening them....but easy to use for the adult (as I find some were horrible to try to open and close).Handle bar is nicely padded, comfortable to use.The storage is VERY roomy.It has a nice little pouch to put your phone and small things in.There is a cup holder, but it is for lighter cups (not your hydro flask).Folding is a dream, as well as lifting to put anywhere...and reopening too.I bought the green color, which is beautiful in person (the video has the more accurate color...the picture on the website looks terrible).Every time I used this stroller, I'd make my husband laugh...I kept repeating \"this stroller is amazing.\"Now I used my Bob stroller for the infant car seat, so I can not comment on the use of that, although I really imagine it's pretty great with this stroller too.I can't say enough good things about it.It's a fantastic stroller, a great buy!!!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheyla Lucia GonzalezSheyla Lucia Gonzalez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 27, 2023",
                "reviewTitle": "La mejor stroller para viajar",
                "reviewText": "Ligera, bonita, práctica… calidad 100%",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81KDbQfROzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714+10l0y1L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kayleigh Reid",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 6, 2024",
                "reviewTitle": "Best buy",
                "reviewText": "This is one of my best buys! Absolutely brilliant buggy and exactly what I was looking for! Such amazing value for money too. Light, compact but large enough to see the child through to around 3/4yrs old. Easy to fold and unfold, easy to manoeuvre. Tray, large extendable hood and basket are all great. Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Eckert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 14, 2021",
                "reviewTitle": "Guter Kinderwagen",
                "reviewText": "Toller Kinderwagen, leicht und kompakt aber auch gut verarbeitet und solide. Auf und zuklappen funktioniert wunderbar. Wir sind zufrieden.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "peppespe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 15, 2021",
                "reviewTitle": "Consigliato",
                "reviewText": "Nulla da invidiare al più blasonato della Chicco",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon customerAmazon customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 12, 2023",
                "reviewTitle": "I love it ! Me encanta este carrito!",
                "reviewText": "The media could not be loaded. It is a good stroller, very light and manageable and its closure is compact. I definitely recommend it and the price is very good for all the good quality it has. My two-year-old son remains relaxed and asleep in the stroller. I would say that it is better than the Babyzen yoyo because of how tall the chair is and the wheels are quite good and the hood is undoubtedly quite extendable and covers the children well from the sun or rain. without a doubt I recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714Xpltt0WL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71sM8KWWihL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/E1EMWKD--GL.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}