{
    "remaining_requests": 10958,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Deluxe-Wrangler-Stroller-Delta-Children/dp/B08R8TFLTS",
    "body": {
        "name": "Jeep Deluxe Wrangler Stroller Wagon with Cooler Bag and Parent Organizer by Delta Children, Black/Green",
        "price": "$360.00",
        "originalPrice": "$399.99",
        "rawPrice": 360.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Deluxe-Wrangler-Stroller-Delta-Children/dp/B08R8TFLTS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BVT19JJD"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41k6y61uqQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41PhmQiOVuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61-bZi5x8QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512xP asSPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41b9eErVBAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JHhOTK9kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91k3DHu4bKL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Delta Children Store",
            "link": "https://www.amazon.com/stores/DeltaChildren/page/D1A6D986-9B00-46FE-9A7B-3DCA1B3BAA9A?ref_=ast_bln"
        },
        "brand": "DeltaChildren",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1946,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 4 hrs 43 mins",
            "FREE delivery Wednesday, February 21. Order within 43 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "3 WAYS TO RIDE: Car Seat Mode: Attach your car seat with the included adapter | Stroller Mode: Use the two 5-point safety harness seats for older kids | Wagon Mode: Haul all your gear to any activity | Compact fold and auto lock latch for easy transport/storage",
            "TONS OF STORAGE: Detachable cooler bag holds up to 16 cans (or 15 lbs.) | Parent organizer with 3 storage compartments and front zipper pocket | 1 parent cup holders | Large front and back storage pockets",
            "EASY TO DRIVE: The wagon has 2 adjustable leatherette handlebars so you can push or pull | Swivel front wheels for easy turning | All-terrain puncture proof airless tires | One-step on/off parking brake | 12” back wheels, 8” front wheels",
            "KEEPS KIDS COMFY: Removable UV blocking fabric/mesh canopy and roll-down shades for sun protection/privacy | Canopy fits in storage pocket when not in use | Holds up to 110 lbs. (55 lbs. per seat) | Age w/ adapter 0+ | Age in stroller mode 6 months +",
            "SIZE: With canopy: 46”L x 29”W x 46”H | Without canopy: 46\"L x 26.7\"W x 46\"H | Folded: 38”L x 29”W x 25”H | Weight: 46.6 lbs. | Included car seat adapter works with: Graco SnugRide Click Connect 30, 35, 40; Evenflo Nurture and Embrace; Britax B-Safe 35; Chicco KeyFit 30"
        ],
        "description": "The Jeep Deluxe Wrangler Stroller Wagon with Cooler Bag and Parent Organizer by Delta Children is ready to tackle any family adventure. Designed with all the conveniences of a double stroller and the rugged durability of a wagon, it’s a super-fun crossover that makes any outing easy—take it to the park, beach or sporting event. With so many ways to ride, it’s ideal for kids of varying ages. Attach your current infant car seat with the included adapter for babies or use the two seats with 5-point safety harnesses to securely transport older siblings, twins or friends. The UV blocking canopy protects little ones from the sun while pull-down shades block additional light during naptime. Remove the canopy for open-air cruising. Equipped with more storage than the average stroller, this wagon comes with a removable cooler bag, parent organizer, cup holder and multiple storage pockets to keep all your must-have travel gear on-hand. This wagon is the most off-road capable option ever thanks to its all-terrain puncture proof airless tires. Easy to maneuver, swivel front wheels allow you to turn and pivot, and you can push or pull the wagon with the two adjustable leatherette handlebars. To store or transport, the Jeep Deluxe Wrangler Stroller Wagon by Delta Children features a compact fold and quick release back wheels which make it easier to fit tight spaces. And when your children outgrow the need for a stroller/wagon, use it to haul your own gear at the farmers market, while gardening or the grocery store. Holds up to 110 lbs. Weighs 46.6 lbs.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166842011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "46\"D x 29\"W x 46\"H"
            },
            {
                "name": "Brand",
                "value": "Delta Children"
            },
            {
                "name": "Material",
                "value": "Leather"
            },
            {
                "name": "Color",
                "value": "Wagon"
            },
            {
                "name": "Special Feature",
                "value": "Adjustable"
            },
            {
                "name": "Number of Shelves",
                "value": "1"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Outdoor"
            },
            {
                "name": "Target Audience",
                "value": "unisex-baby"
            },
            {
                "name": "Item Weight",
                "value": "46.6 pounds"
            },
            {
                "name": "Number of Wheels",
                "value": "4"
            },
            {
                "name": "Weight Limit",
                "value": "110 Pounds"
            },
            {
                "name": "Assembly Required",
                "value": "No"
            },
            {
                "name": "Caster Type",
                "value": "Pneumatic"
            },
            {
                "name": "Department",
                "value": "baby-boys"
            },
            {
                "name": "Manufacturer",
                "value": "AmazonUs/DEMQX"
            },
            {
                "name": "ASIN",
                "value": "B08R8TFLTS"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "60003-2182"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,946 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,675 in Baby (See Top 100 in Baby) #82 in Baby Strollers"
            },
            {
                "name": "Volume",
                "value": "6.95 Fluid Ounces"
            },
            {
                "name": "Maximum recommended load",
                "value": "15 Pounds"
            },
            {
                "name": "Finish types",
                "value": "black"
            },
            {
                "name": "Warranty Description",
                "value": "90 days."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Import",
                "value": "Imported"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Jeep All-Terrain Sand Wheels for Stroller Wagons #60001 and #60003 Jeep Deluxe Wrangler Stroller Wagon Upgrade your Jeep Wagon with the Jeep All-Terrain Sand Wheels! The Jeep Deluxe Wrangler stroller wagon with cooler bag and parent organizer by Delta Children is ready to tackle any family adventure.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b009b849-48ab-415a-a9fc-58b8a0530f9e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ff608dd6-144f-410c-8437-a7f09ebc4baf.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/49fc7672-4756-44d4-99e9-c03b50a8af0c.__CR0,0,2021,625_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/107ca32a-6e75-44fe-8890-3b205f6ac8f3.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a2b6dfa-f193-47a5-838f-ef0fcf935a77.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ryan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEHWQ7WMPOO5LB75XVHPNCA52NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VH1GX256S3KW?ASIN=B08R8TFLTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2023",
                "reviewTitle": "5.0 out of 5 stars The big boy",
                "reviewText": "To get this out of the way, it's definitely a large stroller. So if you are looking for something compact that will go into a small trunk, this is not the answer for you. That said, we've brought this to the mall, a large children's indoor play area, outside on paved paths, and inside grocery stores without ever feeling like I was stuck or couldn't get where I needed to go without knocking things over. The width is pretty close to our stand-alone stroller. It's mostly the length that makes this feel large.Pros:- The attachments for the carseat adapter are very easy to assemble and take apart each time you fold it away.- It's not so heavy you feel like it's getting away from you when pushing it around.- It's a really smooth stroller. My youngest son slept for almost two hours with constant motion and lots of noise.- The maneuverability overall is really great.- It's not so big that it doesn't fit where most car seats can go. If this helps anyone, the little stroller parking spaces they have at amusement parks and zoos are plenty big enough to fit this.- It feels well made. The handles are comfortable and you don't feel like you're working to move it around.- The canopy is also great. It has two blackout screens on the sides and then a net screen at the ends which allows plenty of airflow.- As big as it is, it's not ridiculously heavy. It's heavy, but I don't have issues getting it in and out of the trunk.- Space, space, and more space. All of the pockets and the stroller itself have plenty of room for all of your plans.Cons:- There's a decent amount of exposed metal around the sides. Some of it is cushioned, but even where it is padded, there's not a lot. Especially with the car seat adapter installed, which requires you to put a steel bar across the middle of the car seat, my toddler has bumped their head on it a few times. We are buying some small pool noodles to wrap the frame better.- The attachments add a decent amount of width to the stroller. If you need to go through a doorframe, you'll have to take everything off the sides in order to fit through. Not the end of the world, but we run into this every time. To the point that we won't use all the added attachments unless we know we're going to be in a wide space.- Because of the length, it can sometimes be hard to make sharp turns. I haven't found myself in this scenario often, but trying to make a u-turn in a hallway or something similar is difficult.- This requires a decent amount of trunk space. My wife drives a newer Prius and it takes up almost the entire trunk space. On our midsize SUV it fits fine, but it is quite bulky.",
                "reviewVotes": "123 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TwilaTwila",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWD3NI4IE6RAWCT2ORCHXRL3L3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MCISXDDEVBNZ?ASIN=B08R8TFLTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 5, 2021",
                "reviewTitle": "5.0 out of 5 stars The BEST wagon out there!!!",
                "reviewText": "Straight out the box I was in love and gave it 5 stars, but I wanted to use it before I wrote my review. So far everything about this wagon is awesome. My son is 4 and disabled. So I want something that he could sit up in or lay down in if he gets tired. I also was looking for something with a lot off storage pockets. So I wouldn't have to carry extra bags for his stuff and mine.THIS WAGON HAD EVERYTHING I NEEDED AND MORE!This wagon has 3 nice size storage compartments and each one has 2 or more sections.It comes with a nice size ice chest that holds about 10 to 12 can sodas.It has canopy with two shades that are great at keeping the sun and wind out.Both handels are adjustable for your comfort no matter if your pushing or pulling.Tomorrow we go to Six Flags Discovery and will let know how it fares when pushing and or pulling for an extended time.But so far it's great.The only con that I can see is that it's kinda heavy and bulky, but to me that just means that is sturdy and well made.So we have gone to Six Flags Discovery Kingdom and Hurricane Harbor and I'm still in love. Here are my thoughts.When pushing the wagon it can be difficult when trying to turn. It makes wide turns so when your trying to make even a normal turn it can be difficult. I found myself picking the back up and turning it that way. Making it just a little inconvenient in some situations.When pulling it I have no problems. I know that seems weird, however when I pull, the wagon turns easily with no problem and the weight in the wagon doesn't change that.I love this wagon and everywhere I go people are always asking me where I got it.",
                "reviewVotes": "76 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1E9k2jVKES.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/C1VKsdK2UCS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/D1cBb0uX0PS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/D1pODyhXp+S.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/D1ynBIHlqMS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley McKenzieAshley McKenzie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEXMMZUYEIJP7HYH6QK7OS7CKYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31ZCCZ9F69LSF?ASIN=B08R8TFLTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2023",
                "reviewTitle": "5.0 out of 5 stars I'm obsessed!!",
                "reviewText": "I absolutely LOVE our jeep wagon. It is perfect for us with a one year old and 4 year old. They both fit comfortably and have plenty of space. There's so much space for your things and I love that it even comes with a cup holder. The five point harness is essential for my toddler. It is so easy to push and maneuver through doorways. I thoroughly enjoy pushing my kids in this it's so nice. Amazing quality and even comes with a little cooler and attachment to hold it. Would definitely recommend purchasing this wagon!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81+2qYIKOXL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deborah Dale",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXCK3PLMIZMHICVO7FOYOTNG5QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14A0X1BJIMRJF?ASIN=B08R8TFLTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Wow! This is awesome!",
                "reviewText": "My grandson and his wife just had their 3 child. The 8 year old is in soccer, the 3 1/2 yr needs to be secured and now an infant to deal with. This is perfect and boy is it sturdy. Lots of storage. The only down side is its heavy so Mama who is very small is struggling to load and unload in the back of her SUV but she doesn't care. Said it's been the perfect way to go from parking lot to field with gear, toys and baby needs! They also will be using it to go out to the river for fishing and boating. Great product!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPR4EJOFT4I5KOTMXRXZFESZLNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MUA4JANLL7T3?ASIN=B08R8TFLTS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 22, 2023",
                "reviewTitle": "5.0 out of 5 stars A lot lighter than I was expecting",
                "reviewText": "I am 5’3 roughly 120 lbs or so. I have a very petite build and I have 2 small children I purchased this for. I was really shocked by how easy it is for me to lift and get in and out of my trunk. I use it for grocery shopping, department store visits, mall trips and of course park trails. If you have small children (especially one in a car seat still) I cannot recommend this enough! It saved my life.I will say it takes up pretty much all of the floor space in my trunk (Nissan rogue 2012). But you can put a few things on top of it and on the sides. It comes with a bunch of bags and attachments but I just use the canopy from time to time. It’s really sturdy and has good steering. I love that it has a cup holder too!! Great purchase and something that can be used for many years after the children outgrow it.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charlie Alvarez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 27, 2023",
                "reviewTitle": "El Mejor estorbó",
                "reviewText": "El tamaño es muy grande. Pero es tan cómodo y práctico que vale la pena el estorbo. Por qué mi hijo de 4 años se duerme cómodamente. Lleva las bolsas y todo y mi hijo va bastante cómodo. Vale la pena( Solo si tengan una camioneta para su traslado.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alberto Del Castillo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 25, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Vale cada $ invertido. Es un gran producto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 2, 2023",
                "reviewTitle": "Todo un éxito!",
                "reviewText": "Muy cómodo, no tan practico por su tamaño, pero es genial, lo recomiendo bastante, el wagon es muy grande, muy grande… pero tiene a favor que se le quitan las ruedas y eso ahorra mucho espacio, mis hijos pasean muy cómodos y yo bien contento por mi compra, toda la gente voltea por lo cómodo que se ve para los bbs y no dudan en preguntar.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Veronica Diaz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 12, 2022",
                "reviewTitle": "Grande muy grande",
                "reviewText": "Es de muy buena calidad, es muy grande cabe en la cajuela de mi Ford Escape, pero hay que buscarle la forma ya que de otro modo no cierra por las llantas que son muy grandes. Es más pesado que una carreola grande. Cumple muy bien su función se pueden subir mis hijos de 7 y 4 años sin problema caben los dos muy bien, es de gran ayuda para los paseos en el parque y todo el mundo me pregunta donde lo compré es muy llamativo. En general estoy muy satisfecha con mi compra.Hay que considerar que es pesado y no es nada práctico de transportar ya que ocupa mucho espacio, sabiendo esto justifica bien su función, que para mi ha sido transportar a mis hijos que ya no usan ni caben en una carriola y demás cosas para paseos en el parque o la playa.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Merary F. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 2, 2022",
                "reviewTitle": "Nos encantó!",
                "reviewText": "Bastante grande, algo pesado, pero nos encanta. Caben Perfecto mis hijos de 6 (casi 7) y 2 años. Plegado aunque aún es grande cabe Perfecto en la cajuela de nuestra camioneta, tiene la posibilidad de sacar muy fácilmente las llantas grandes para acomodarlo mejor. En resumen nos pareció excelente. Llevamos cerca de 2 meses con él y nos encanta!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}