{
    "remaining_requests": 11151,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Evenflo-All-Terrain-Stroller-Bassinet-Voyager/dp/B0CMBJ7FDQ",
    "body": {
        "name": "Evenflo Pivot Xplore Dreamz All-Terrain Stroller Wagon with Bassinet Insert (Voyager Green)",
        "price": "$319.99$307.19",
        "originalPrice": "$399.99",
        "rawPrice": 319.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Evenflo-All-Terrain-Stroller-Bassinet-Voyager/dp/B0CMBJ7FDQ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CPVZL2VS"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CMBYDYQ3",
                "variationName": "Color",
                "variationValue": "Jetsetter Black",
                "price": "$319.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/11D7gSzBX4L._SS36_.jpg"
            },
            {
                "asin": "B0CMBJ7FDQ",
                "variationName": "Color",
                "variationValue": "Voyager Green",
                "price": "$319.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/115eiHx5ZwL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41A1KBHgmPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51OK1mHhbvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Hpp888c5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 8XqHT15L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tiEMFFeEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41AaXJnA3iL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51PKlFbrstL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2a7972e-c354-4ff6-bef1-2f58a6e86a22/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a25b8a17-c4ad-413e-96a3-c828368b85c7/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df8c18cc-a6c7-4246-834e-917ad7cb8b4b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0fc5f409-e703-4444-8148-d1c4ce6aed02/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81P4jF6nNDL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81P4jF6nNDL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Evenflo Store",
            "link": "https://www.amazon.com/stores/Evenflo/page/3C218481-6E42-408E-8D53-997BC89AEF18?ref_=ast_bln"
        },
        "brand": "Evenflo",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 12,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 21 hrs 51 mins",
            "FREE delivery Friday, February 23"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% Polyester",
            "ADVENTURE THEN NAP: Stroller wagon with flexible modes allows you to adapt on the fly without pausing for naps; includes a comfortable bassinet insert for children from 6 months to 33 lb",
            "PUSH, PULL, DREAM: The flip of our three-position, telescoping handle allows you to push as a stroller or pull as a wagon, even as your child nods off",
            "SHADE YOUR LITTLE ONE: Larger UPF 50+ canopies expand from 2 to 3 panels with a quick unzip to help protect against the sun’s harmful rays, while breathable mesh helps to keep naptime comfortable",
            "TAKE ON THE TERRAIN: With 3-point harness secured, the all-terrain wheels roll from pavement to beach and beyond; flip-flop friendly brakes help to keep your wagon in place when not on the move",
            "KEEP KIDS COMFY — AND BUSY: A newly extended footwell provides more leg room, while a BPA-free child tray lets kiddos share snacks, toys and giggles",
            "PACK IT AND GO: Offers a detachable storage basket with pop-out cup holders for adults; bassinet insert rolls up and tucks out of the way when not in use"
        ],
        "description": "Adventuring can take a lot out of a little one! Be ready for naptime on the go with the Pivot Xplore™ Dreamz All-Terrain Stroller Wagon with Bassinet Insert. Designed for children from 6 months to 33 lb, the bassinet insert lets your little one take a break from the action comfortably, then tucks out of the way until the next catnap. This all-terrain ride accommodates up to two children ages 6 months to 5 years, with each seat holding a child up to 55 lb (110 lb total). As with our bestselling Pivot Xplore, the Xplore Dreamz transforms with a flip of the three-position, telescoping handle, allowing you to push as a stroller or pull as a wagon even as your child nods off in the bassinet insert. Larger UPF 50+ canopies expand from 2 to 3 panels with a quick unzip to help protect your child against the sun’s harmful rays, while breathable mesh helps to keep naptime comfortable. A newly extended footwell gives energetic little legs extra room. With 3-point harness secured, the rugged, all-terrain wheels take your family adventure from pavement to beach and beyond, while the wagon’s 27 in. width fits through most doorways with ease. For more flexible seating, the Xplore Dreamz accepts a toddler seat or infant car seat adapter (both sold separately). To keep little gigglers busy, the included BPA-free child tray features two cup holders. Mesh pockets store snacks, toys and items you want to keep within reach. An additional, detachable storage basket includes pop-out cup holders for adults. Elastic straps on the side of the wagon hold everything from umbrellas to water bottles to keys. The front of the wagon drops down with the press of a button for easy in and out. Quick, easy, compact fold makes your Xplore Dreamz a breeze to pack up for travel. From adventure to naps, you’re ready for a full day of fun.It’s been 100 years and Evenflo continues to push the boundaries in baby and children’s gear design and innovation. We meet the needs of new generations of parents by focusing on what they really care about: leading-edge safety, smart design and technology, and convenient features that help them enjoy the journey of parenthood.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166842011"
            },
            {
                "name": "Standard",
                "link": "https://www.amazon.com/Standard-Strollers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=166845011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Evenflo"
            },
            {
                "name": "Color",
                "value": "Voyager Green"
            },
            {
                "name": "Age Range (Description)",
                "value": "Baby"
            },
            {
                "name": "Model Number",
                "value": "18912490"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 12 ratings 4.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,282 in Baby (See Top 100 in Baby) #53 in Standard Baby Strollers"
            },
            {
                "name": "Product Dimensions",
                "value": "45\"L x 27.5\"W x 39\"H"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "55 Pounds"
            },
            {
                "name": "Material",
                "value": "Polyester"
            },
            {
                "name": "Fabric Type",
                "value": "100% Polyester"
            },
            {
                "name": "Frame Material",
                "value": "Metal"
            },
            {
                "name": "Harness Type",
                "value": "2 Point"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/15608e47-fe10-4226-9c00-4b0001bdb5a4.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/508f9d9a-50f6-482e-a27c-2ba3cdae125e.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1950754b-38c5-4654-b5ab-17f4d6d4cc8c.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6905604f-b0e6-4301-bdf1-b6321e485773.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6ee1a501-b18e-4c1b-8523-ba49469dba5f.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Webb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2TLMUFKSP4J7IWRI4JCS6ZZGMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BKJSZRJQ3NU7?ASIN=B0CMBJ7FDQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing Comfort and Versatility but Pretty Huge",
                "reviewText": "This is a really amazing stroller wagon. I feel like it is the equivalent of a huge SUV with all the pros of having all the features and tons of room but also the same cons of being really huge and a little unwieldy at times. This thing is a tank. On flat ground it rolls really easily and smoothly, on hills you can feel the weight.It is really wide. I had to laugh about the product description saying it will fit through \"most\" doorways at 27 inches wide. Our back door is 30 inches and you have to pay close attention to get it through without hitting the sides.When in use, the wagon is amazing. The large wheels roll really smoothly and seem to just soak up any bumps in the road that might be jarring for a smaller stroller.The interior is really great. There is plenty of room for a couple of kids, blankets and some toys.We ordered it to use with our grandson and he really loves it. I really like the open feel of the wagon. I go on long walks with my grandson in a jogging stroller but we really can't interact with him facing forward and me pushing behind. This is a whole different experience because even when he is facing forward the whole top can be open to allow for interaction.I do feel like they could have done a better job accounting for the accessories like the middle tray, storage basket and bassinet insert. They are great when being used but don't really \"tuck away\" when not in use. You'll pretty much want to decide if you want to use them and if not you'll want to leave them in the car.While this does fold up, it doesn't get very small at over 2 feet thick and over 3 feet long. The handle is bolted on so the overall length will be a challenge for some vehicles. It is also really heavy at 43 lbs.I was able to find the dimensions :PRODUCT DIMENSIONS: 27.5 x 39.0 x 45.0 inFOLDED DIMENSIONS: 27.5\" W x 34\" D x 39\" HPRODUCT WEIGHT: 43.0 lbs.I think this stroller wagon is ideal for families with 2 children who spend a lot of time outside at parks or the beach. While it can go inside, I think it would get a little unwieldy in stores. We will definitely be using this quite a bit in the summer and I picture one side will be used to carry a lot of things until our grandson gets a little brother or sister.Overall happy with the \"Evenflo Pivot Xplore Dreamz All-Terrain Stroller Wagon with Bassinet Insert (Jetsetter Black)\".",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher Robin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNATKZHXCR4BVDJTZNVCW5GZCJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39T25OVN27FWZ?ASIN=B0CMBJ7FDQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars This is so very nice",
                "reviewText": "I am absolutely thrilled with this stroller wagon! It has truly been a game-changer for our family's adventures. Here are some of the fantastic features that I love:Versatility: The flexibility of this stroller wagon is unparalleled. I can easily switch between modes without disturbing my child's nap. The bassinet insert is incredibly comfortable, and the fact that it's suitable for children from 6 months to 33 lbs is a big plus.Ease of Use: The three-position telescoping handle makes it a breeze to push or pull the wagon. This is especially handy when my little one decides to take a nap during our outings. No need to wake them up – just adjust the handle and keep going!Sun Protection: The UPF 50+ canopies are a lifesaver on sunny days. They expand to provide ample shade, and the breathable mesh keeps my child comfortable even on hot days. It's peace of mind knowing that they're protected from harmful UV rays.All-Terrain Capability: The all-terrain wheels are a dream. Whether we're on pavement or at the beach, this wagon handles it all with ease. The flip-flop friendly brakes are a nice touch, ensuring that the wagon stays put when needed.Comfort and Convenience: The extended footwell provides more legroom, ensuring that my child is comfortable during the ride. The BPA-free child tray is a hit with my little one – it's perfect for sharing snacks, toys, and keeping them busy during our outings.Storage: I love the detachable storage basket with pop-out cup holders for adults. It's great for carrying all our essentials. Plus, the ability to roll up and tuck away the bassinet insert when not in use is a clever design feature.In summary, this stroller wagon has exceeded my expectations in every way. It's made our family outings so much more enjoyable, and I highly recommend it to any parent looking for a versatile, comfortable, and reliable solution for on-the-go adventures. It's truly worth every penny!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Eller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVJNSGDC2NMOAJN5YARVQ3D7PQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFWWOU0S9GW56?ASIN=B0CMBJ7FDQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Highly maneuverable, flexible and somewhat lightweight",
                "reviewText": "Pros:Well-builtadjustable handle is a nice easy feature.The middle drop down area for feet is a comfy touch.Cons: The large button in the middle of the handle to disengage the handle from locking in the 'push' position is not the ideal position. It gets pressed when you grip the handle normally one handed and that means that only two handed to the sides pushing/pulling etc.. is a viable option. We can work around it but this was a large 'in-use' designer fail.A little small - we have a 7, 4 and 2 year old and our other flat wagon can fit them all. This one fits only two unless one rides in the foot area. In other words - this is a two person only wagon. Just beware of that.The middle foot area is not reinforced on the bottom - so any rubbing from speedbumps etc.. is going to wear through the material eventually. Seems like something that they could have took some time to make more wear-proof.All in all - it collapses fairly compactly and is somewhat light and fits into car and SUV trunks. Not for more than two smaller children.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gmidget316gmidget316",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4VY2ZV5PNHUBKGWTPRKAG7C7NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AYSNQYF4W6VL?ASIN=B0CMBJ7FDQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars 3-in-1 Fully Loaded Stroller with a 55lbs per seat weight limit",
                "reviewText": "The media could not be loaded. Please see my video reviewI forgot to mention in the video, the 2 seats lack any type of padding where the child sits. While the back of the seats is not an issue because there’s no frame, I would have liked there to be some cushion on the bottom where they would be sitting. However, I have not heard any complaints, but also haven’t used it for a long period of time.I also mentioned that it will not stand up on its own, I meant it won't stand up on its own while having it stand on its tires. However, it will stand up if you lay it on its frame. Having it stand up this way though could cause damage to the frame and material. (Photo)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Rs4S3-oOL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48961e98-9232-43a6-8bc0-1e3c8a126cc6/default.jobtemplate.mp4.480.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}