{
    "remaining_requests": 34484,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sheaths-Universal-Strength-BPA-Free-Non-toxic/dp/B0CK1DW4LR",
    "body": {
        "name": "Knife Sheaths for Kitchen Knives 8\"-12\" Universal Knife Edge Guards Set | Knife Cover with Extra Strength | BPA-Free Knife Guards | Non-toxic and Food Safe (2 Pcs)",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sheaths-Universal-Strength-BPA-Free-Non-toxic/dp/B0CK1DW4LR",
        "soldBy": {
            "sellerID": "A75JSDAAEZCR3",
            "name": "Premium Mart",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A75JSDAAEZCR3&asin=B0CK1DW4LR&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CRSBKJYK"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CK1DW4LR",
                "variationName": "StyleName",
                "variationValue": "2 Pcs",
                "price": "$9.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CK1CX6LB",
                "variationName": "StyleName",
                "variationValue": "5 Pcs",
                "price": "$15.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51C2kz3zfjL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51vGFP icML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41U -PSQkxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ifYuCYFYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4195poVWx9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xJjt3cgiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1j78eZ78JL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bright Hobby Store",
            "link": "https://www.amazon.com/stores/BrightHobby/page/808D2BE0-0960-42EF-A312-EA193D6140FC?ref_=ast_bln"
        },
        "brand": "BrightHobby",
        "merchantInfo": "Premium Mart",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 26,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 5 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✅COMPREHENSIVE SIZE --- Our knife guards for kitchen knives set is thoughtfully compiled to cater to various knife sizes, ensuring a perfect fit for your entire collection. The set includes sheaths for two different knives: Chef/Kitchen Knife (8.5\"x2\"), and Carving/Bread Knife (12.2\"x2\"). This diverse sizing accommodates all your kitchen essentials, providing a tailored protective solution for each blade.",
            "✅SAFE AND NON-TOXIC MATERIAL --- Crafted with utmost consideration for your well-being, our knife guard set is made from non-toxic ABS plastic, guaranteeing a safe and healthy kitchen environment. The chosen material is not only durable but also free from harmful chemicals like BPA. This commitment to safety ensures that your knives remain pristine and free from contaminants, offering you peace of mind as you prioritize the health and safety of your culinary space.",
            "✅EXCEPTIONAL DURABILITY --- Built to withstand the rigors of daily kitchen activities, these sheaths are highly resistant to cuts, stains, and abrasions. The durable ABS plastic ensures long-lasting protection for your valuable knives.",
            "✅OPTIMIZED DESIGN WITH ANGLED OPENING --- The sheaths feature an angled opening, allowing for easy insertion and removal of knives. This thoughtful design enhances user convenience and promotes a seamless cooking experience.",
            "✅SLEEK AND PROFESSIONAL APPEARANCE --- The sleek design of our knife sheaths not only enhances the overall aesthetics of your kitchen but also adds a professional touch. Keep your knives protected in style.",
            "✅EXCEPTIONAL VALUE --- We collaborate directly with top-tier knife sheath manufacturers, eliminating middlemen. This enables us to provide outstanding quality at a fraction of the cost compared to traditional retailers.",
            "✅LIFETIME WARRANTY --- We confidently back our products. Bright Hobby knife sheath is covered with a lifetime warranty against any defects in material or workmanship, buy with confidence."
        ],
        "description": "Revolutionize your culinary experience with our meticulously designed Knife Sheath Set, a sophisticated solution ensuring the longevity and safety of your treasured knives. Skillfully crafted from non-toxic ABS plastic, absent harmful chemicals like BPA, our sheaths provide not only a secure storage option but also a guarantee of a safe and healthy kitchen environment. Going beyond conventional protection, these sheaths are explicitly engineered to be food-safe, contributing to the overall cleanliness of your culinary workspace and ensuring that your knives remain pristine and ready for use. Revel in exceptional durability, as our sheaths boast high resistance to cuts, stains, and abrasions, safeguarding your knives through countless culinary adventures. The optimized design features an angled opening, allowing for seamless knife access, while the versatile size range caters to fillet/boning and chef knives. Elevate the visual appeal of your kitchen with the sleek and professional appearance of our thoughtfully designed set. Rest easy with our commitment to quality, backed by a customer satisfaction guarantee, making this Knife Sheath Set an essential choice for those who prioritize safety, durability, and unmatched convenience in their culinary endeavors. Invest today and experience the perfect fusion of style and functionality in your kitchen.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Kitchen Utensils & Gadgets",
                "link": "https://www.amazon.com/tools-gadgets/b?ie=UTF8&node=289754"
            },
            {
                "name": "Kitchen Knives & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=23944789011"
            },
            {
                "name": "Knife Cases, Holders & Protectors",
                "link": "https://www.amazon.com/Knife-Cases-Holders-Protectors/b?ie=UTF8&node=13840871"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "12.17 x 2.32 x 0.55 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CK1DW4LR"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 26 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#141,969 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #205 in Knife Cases, Holders & Protectors"
            },
            {
                "name": "Date First Available",
                "value": "January 8, 2024"
            },
            {
                "name": "Brand",
                "value": "Bright Hobby"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Style",
                "value": "2 Pcs"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MJMJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAS2E435RBOFRFMJROKHAN5ARPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QEBJRCNAH24D?ASIN=B0CK1DW4LR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Very inexpensive knife sheath solution - look at your blade/handle design first",
                "reviewText": "At last! Solid, inexpensive knife sheathes to replace my embarrassing paper bag hack from when we moved. Very happy with purchase, and at this price point I was even willing to replace my paper bag, since it seems I'm never going to get around to getting a larger knife block (we used to have a magnetic strip on the wall to hold some knives).Pros: • Solid plastic holder with a nice grippy texture on the outside, so even if your hands are wet, it's grippier • Interior is some kind of soft coating to make it easier to slide the knife in, which works well • The angled opening on one end makes it very easy to get the knife blade inserted for sliding in • Easy to slide in & out, it was not overly grippyNotes: • The shape of the knife blade & connection to the handle makes a difference in the fit. My inexpensive workhorse, a Dexter 8\" blade, has no pretty shaping of the blade near the handle, so the sheath stops only when it hits the handle. This means if I insert the blade fully until it stops, the very tip of the knife sticks out about 1/8\" and I need to back the blade up a bit so it doesn't stick out. However, my other fancy 8\" blade that is weighted has a flare on the blade that stops the sheath earlier, and the tip doesn't stick out of the sheath at all. • To make this a \"true\" universal fit, it'd be wise for the sheath to be designed to accommodate the worst-case scenario of having the handle be the stopping point - just 1/4\" longer probably would have done it. I debated docking a star, but these are SO inexpensive I don't think I should ding them for it. Also, it'd be really nice to be able to purchase an 8\" and a 10\" version. • I cut down the 12\" sheath so I'd have two sheathes that fit my 8\" knives. I was able to accomplish this by slowly & carefully scoring the plastic with a box cutter (my other thought was to try the chop saw but I didn't feel like firing it up). YMMV on modifications. But it worked well! Plastic was not brittle, which means I can use the modified sheath for my inexpensive blade so that the tip won't stick out, as I cut it with space to spare.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ZQZhyuc+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71++jEhYmZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710bFK0kR+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71JSDmMQArL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71LsbJi6XdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71sXvfD8ZcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHL3PDYQ5FVCKK54UH2QHXQII7TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UUT2D9NWKHVO?ASIN=B0CK1DW4LR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Make your knife drawer safer",
                "reviewText": "These are a simple idea, pretty well executed. Plastic guards with a velvet-type lining that you can slide the blades of kitchen knives into. They are easy to use and hold to the blade reasonably well. By that I mean that you can pick the knife up and the guard won't fall off, but I would not use these to then throw the knives into a backpack and expect them not to come off. SInce the blade can come out the entire back of the guard they are really best for protecting stationary knives in a drawer.The textured look outside is printed into the plastic and provides a nice amount of grip to the sheath. Since it's easy to remove, there's little risk of struggling with the cover that could lead to accidents when handling the cover.Keep your knives clean and dry when using these sheaths and they should last a good while. If you get anything into the velvet lining I would worry about how to get it out.The size assortments are a little puzzling, but I happened to need to cover two knives that were pretty close to these sizes. The large cover is on a 10\" chef's knife, so it's a little larger than it needs to be. I noticed that the 5 piece assortment of covers does not go up to the 12\" size. So pay attention to your knife sizes when selecting your set.These sheaths are an inexpensive way to protect your blades and your fingers if you just have some knives in a drawer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "X",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7PBZ5RK5YZ2GZ42RMKFWTIF4GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24R7W08J8XPW6?ASIN=B0CK1DW4LR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice inexpensive sheathes",
                "reviewText": "Edit: The seller fixed what was most likely a typo in the original item description that indicated that there were two of the 8.5 inch sheathes included. I bumped this up to 5 stars as the misleading description was the reason I originally gave the low rating. I'm going to make some changes below as they're no longer relevant.Two nice sheathes. These are pretty nice and super handy, I had been using folding cardboard, and these certainly look a lot nicer. They're just plastic, but are sturdy and look great. These also have have a soft lining to keep from scratching the knife and are good value for the price. My only complaint is that I wish these were either sold individually or there was a set with 2x the 8 inch version, the 12 inch is works for a smaller knife without an issue, but and I don't have any knifes this long.Overall, these are super handy and look nice. I would probably order more if there were options for singles of the 8.5 inch version or a set with two of the 8.5s.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Craig Raper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFE66ALSJD5BRXF763RBZASPRAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WOJBATWIRM5A?ASIN=B0CK1DW4LR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars excellent way to protect your knives at home",
                "reviewText": "These are great for protecting the cutting edge of your knives at home. They are very easy to use. I slide the knife in from the open end with the edge pointing down.They have a good snug fit. However, for travel, I would strongly recommend one of those plastic holders that close, or a knife roll. With these sleeves, the knife can slide out the top if shaken or jostled hard enough.One thing to keep in mind... the inside is soft and fuzzy. That works great as long as it stays clean. Don't put your knife in it if the knife is not clean. If any debris gets inside, it is possible for it to end up causing one or more scratches to the side(s) of the knife. Once you get something in there that will cause scratches, it can be difficult cleaning the inside of the sleeve. The price on these is also extremely reasonable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TWTW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENPL7HDQ743SG4UAERRZEY62IMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB2OQJLPMFFFW?ASIN=B0CK1DW4LR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Good protection for knives",
                "reviewText": "This Knife Sheath set provides two sizes, 8\" and 12\" lengths. I used the sheaths to cover the cutting edge of the knives. They slipped on easily and stayed in place. I did experience some problem when the knife was damp when inserted into the sheath. The inner surface of the sheath has a fiber-like finish that coats the knife upon removal. I had to wipe the knife before using when removing from the sheath. I included photos of the particles that come from the sheath. When the knife is absolutely dry, I did not notice the issue. Overall, I needed a sheath to cover the knife edge. This product met that requirement well!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71SnZg6gvVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81FS8NSj3sL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81MtB9HAg-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81xov8F-SJL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}