{
    "remaining_requests": 34494,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Magnetic-Refrigerator-Kitchen-Organizers-Accessories/dp/B0C2C29LCL",
    "body": {
        "name": "Magnetic Knife Holder for Wall, Knife Magnetic Strip Magnetic Knife Holder for Refrigerator Mount Knife Rack Kitchen Utensil Holder Metal Tool Holder Knife Block Kitchen Organizers Accessories 10 Inch",
        "price": "$9.99",
        "originalPrice": "$12.49",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Magnetic-Refrigerator-Kitchen-Organizers-Accessories/dp/B0C2C29LCL",
        "soldBy": {
            "sellerID": "A3US3N1F8MGYRX",
            "name": "JLDJ store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3US3N1F8MGYRX&asin=B0C2C29LCL&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BTX4V2DK"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C2C29LCL",
                "variationName": "Size",
                "variationValue": "10 inches",
                "price": "$9.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0C3MK51N1",
                "variationName": "Size",
                "variationValue": "12 inches",
                "price": "$11.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BP7JD2SF",
                "variationName": "Size",
                "variationValue": "16 inches",
                "price": "$12.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/414k1Fy2EUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/5157f5ekpLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ve-Fw5 YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HHQ-eMcAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41s2knj1ObL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519XzVkcc5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rWFZ9lMNL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the HEREOF Store",
            "link": "https://www.amazon.com/stores/HEREOFhereisforyourneeds/page/401B9317-6123-4ADF-BFFE-A4997EBD5622?ref_=ast_bln"
        },
        "brand": "HEREOFhereisforyourneeds",
        "merchantInfo": "JLDJ store",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 395,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 4 hrs 6 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 14. Order within 2 hrs 36 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Heavy Duty and Solid magnetic knife holder: Our magnetic knife holder for refrigerator contains powerful magnets and has an extremely strong grasp for holding kitchen knives, utensils securely and evenly. Best knife magnet strip with no risk of the knives falling off, even for heavy cleaver and knives with heavy handles. Great magnetic knife holder for fridge to help with your kitchen organization and storage. WARNING:Please keep the magnetic knife strip more than 3 feet away from the pacemaker.",
            "Higher Quality Stainless Steel knife magnetic holder: No worries about any rust. Made of superb 304 stainless steel, our wall knife holder magnetic strip is with higher corrosion resistance than other magnet strips knife holders and knife rack magnetic knife bar made of 201 stainless steel who can only last for 2 to 3 years even in normal environment.",
            "Sleek and Modern magnetic tool holder strip: Designed with satin finished, smooth surface and rounded corners, our magnet knife holder strip protects hands and metal kitchen tools from scratches. Magnetic strip for knives with streamline design blends perfectly with other appliances in modern kitchen & home decor. Great knife strip to replace knife magnetic block, in drawer knife block, acrylic organizers, utensil holder for kitchen counter, knife block set, knife drawer organizer or knife case.",
            "Versatile knife holder for wall: Knife holder for kitchen counter with strong magnetic force bears up to 60 lbs.The magnet strips heavy duty with can be used for holding chef tools like tongs, scissors, whisks, knife steel, magnetic spice jars, frosting knife, spoons, smart cutter, knife guard, can openers in the kitchen,or displaying utility tools like screwdrivers,wenches in your work place,and also great magnetic knife strips for storing toys or tools, like keys,key knife, pairing knife pack.",
            "Easy to Install Kitchen Gadgets: the knife holder for kitchen counter comes with hardware and an easy-to-follow instruction for drilling and mounting on wall. You can install the kitchen knife magnetic holder in minutes. Vertically pull duct tape to put the backing off from the magnet strip for knives. The backing of the wall knife holder magnet has 2 holes for wall installation.",
            "Easy to Clean knife magnetic strip for refrigerator: Unlike magnetic knife block without knives, wooden knife holder, bamboo knife drawer organizer or magnetic strips with adhesive backing that collects dirt, this metal knife magnetic strip with simple and smooth surface is easy to wipe and clean by a wet rag. You will get shinny and fresh a new kitchen knife holder in seconds.",
            "Better Storage for Knives: With knife magnetic strip no drilling magnet bar, storing knives set for kitchen can be a hassle. If you keep professional chef knife in a drawer, mixed with other utensils, it could wreak havoc on anyone and you'll also risk dulling or chipping its blade. Use our strong magnet knife holder, a complete steak knife set can be displayed neatly on the knife holder magnet and you can easily access your favorite one right away.",
            "Great Gift Ideas: Kitchen magnetic knife strip with elegant looking is budget friendly gifts & cool finds for house warming gifts, homesteading gifts, birthday gifts, unusual Christmas gifts for parents, friends, wife, families, pro chef. Also work as magnetic organizer, tool magnet bar, wall hanging strips, magnetic tool holder strip, kitchen utensils holder, kitchen countertop organizer for rv storage and organization, kitchen storage, home organization, kitchen organizers and storage.",
            "Kitchen Space Saver and Home Hacks: Compared to drawer knife organizer, bulky knife board, butcher block countertop, our kitchen magnetic knife strip for wall is designed to mounted on wall and frees up counter space and keeps your kitchen tidy and organized. Perfect magnetic knife board, rv must haves, restaurant supplies, apartment essentials for first apartment, house necessity and kitchen must haves, kitchen supplies, bar accessories, bar essentials, etc.",
            "After-sales Service: Magnetic knife block without knives. Knife wall magnet rack works perfectly as a knife storage drawer organizer and a knife block magnetic tool for knife display and kitchen organization for utensils. Satisfaction guarantee and 2-year warranty. Any concerns or issues with this magnetic knife rack metal bar, please contact us FIRST on order detail page before returning the knife strip magnet."
        ],
        "description": "*NOTE of the knife holder magnetic: A cook is only as good as his knife. Keeping knives in a drawer may be at risk of dulling the blades, and stashing in a bulky wooden knife block takes up precious counter space in your kitchen Vertically place the magnetic knife bar on desk and pull plastic tabs to separate the backing completely off. When aligning the magnetic bars strip on the backing, watch fingers to avoid pinching. If mounting on the side of refrigerator, find the right position before attaching and do not move it around to avoid scratches on the finish of the fridge.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Kitchen Utensils & Gadgets",
                "link": "https://www.amazon.com/tools-gadgets/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289754"
            },
            {
                "name": "Kitchen Knives & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=23944789011"
            },
            {
                "name": "Magnetic Knife Strips",
                "link": "https://www.amazon.com/Magnetic-Knife-Strips/b/ref=dp_bc_aui_C_5?ie=UTF8&node=13840861"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "10.67 x 2.09 x 0.87 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.48 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "HEREOF"
            },
            {
                "name": "ASIN",
                "value": "B0C2C29LCL"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "HO-MKH-10"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 395 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,361 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #4 in Magnetic Knife Strips"
            },
            {
                "name": "Date First Available",
                "value": "April 13, 2023"
            },
            {
                "name": "Color",
                "value": "Gray"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Brand",
                "value": "HEREOF"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "No"
            },
            {
                "name": "Style",
                "value": "Compact"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "A cook is only as good as his knife. Keeping knives in a drawer may be at risk of dulling the blades, and stashing in a bulky wooden knife block takes up precious counter space in your kitchen No matter you are a pro chef or a person who love to cook, HEREOF magnetic knife rack is a good kitchen helper. With this magnetic knife holder stand, you can store knives securely and access them with ease.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10b6cbf2-e579-416e-b27c-ce35373c7b5d.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "WARNING: Pacemakers and mechanical shunts may be reset if within close proximity to strong magnet. Not for refrigerator doors and any surfaces or tools that are not iron or non-magnetic. When putting the knife onto the magnetic knife strip, make sure the magnetic bar should be as close to the handle as possible. *NOTE of the knife holder magnetic: A cook is only as good as his knife. Keeping knives in a drawer may be at risk of dulling the blades, and stashing in a bulky wooden knife block takes up precious counter space in your kitchen Vertically place the magnetic knife bar on desk and pull plastic tabs to separate the backing completely off. When aligning the magnetic bars strip on the backing, watch fingers to avoid pinching. If mounting on the side of refrigerator, find the right position before attaching and do not move it around to avoid scratches on the finish of the fridge.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5dd81af1-6c35-42c8-8dc9-0721faf043c9.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d96e4e58-fb2a-4363-80d2-8b1c1bde82a9.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Powerful Kitchen Magnets: Magnetic strips heavy duty holds up to 60 lbs weight. It has so many uses other than knives in the kitchen, like shed, garage, tools, cubicle, camping, etc.Great for Limited Space: This magnetic knife holder for wall no drill helps get rid of the magnet knife block and open a little more space up.Clean and Modern Look: Shinny metal surface and simple shape design make the magnetic strips for wall a beautify look and match your modern home hero and kitchen decor nicely.Secure and Compact Storage: This metal knife magnetic strip with cool fridge magnets helps keep the knives farther out of reach of kids. Metal strips for magnets are a great kitchen organizer and counter organizer for pocket knife storage, home and kitchen organization.Widely Used kitchen Items for Home: The knife wall magnet rack can be mounted on the side of a cabinet, metal splash board, drywall, utility room, living room, etc. Works great as cooking utensil holder for drawer organizer kitchen utensils and rv organization and storage.Clutter Free Kitchen Accessories: This small utensil holder with strong flat magnets and magnetic dots perfect to store kitchen tools like big knife, steak knives set, benchmade kitchen knives, viking knife, magnetic bowl, black knife set, chef's knife, bench knife, hook knife, magnetic shelf, magnetic cups, frosting knife, chop saver, bar knife, knife ring, knife key, Japanese knife set, global knife set, lettuce scissors, bread knife, knife tool, channel knife bar tool for wall storage and in kitchen & dining room tables.Multi-purpose Kitchen Tool Holder: A perfect alternative to knife storage drawer organizer, magnet strips with adhesive backing, adhesive magnetic strips, knife organizer drawer insert, magnet tool holders, cutlery holder, sticky magnetic strips, self sharpening knife block set, wall adhesive strips, knife holder for kitchen drawer, drawer knife block, universal knife block, knife display case, rv fridge bars, magnetic adhesive strips, knife stand, utility knife holder, magnetic key holder for wall, stainless steel utensil holder, etc.",
                "media_link": []
            },
            {
                "media_text": "Magnetic Knife Holder 16 in Magnetic Knife Holder 12 in Magnetic Knife Holder 10 in Over The Sink Dish Drying Rack Size 16 inches 12 inches 10 inches 17.5 x 11.8 inches Can be rolled up × × × ✓ Suitable sink size 15.5 inches or shorter 11.5 inches or shorter 9.5 inches or shorter 16.5 inches or shorter Qty of pipe 1 1 1 15 Suitable for Any magnetic smooth surfaces surface/wall, or shelf with iron or magnet Any magnetic smooth surfaces surface/wall, or shelf with iron or magnet Any magnetic smooth surfaces surface/wall, or shelf with iron or magnet Drying plates, cutleries, bowls, vegetables, fruits, etc. Use as a trivet rack or a heat resistant mat for cooling bread, and watering plants Color Gray Gray Gray Black",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10b6cbf2-e579-416e-b27c-ce35373c7b5d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbf5b058-0dc8-42dd-8c92-75d2b0b948bb.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2cf1e71-460c-4fdc-9cc9-8dacef011c7e.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6746d46-189e-4d29-b3fc-88d2d24f7fa1.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/43c1217a-18ed-445a-9c8a-27ed5aa963e6.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/daee743c-f76a-4a63-abbb-77d3ec70bf58.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5dd81af1-6c35-42c8-8dc9-0721faf043c9.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d96e4e58-fb2a-4363-80d2-8b1c1bde82a9.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a829c99-cfcc-4676-8ce6-4ba220a52b3c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fdda7166-abed-407c-ae83-f12accffdf34.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e7f03ee7-f5af-4889-a84b-2428d9fb916f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/61666dcc-5507-4540-88b2-e0f0a9f57743.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/005569cf-9721-47ac-a86d-eee5fd599ad7.__CR0,1,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "WickedStormWickedStorm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7KCVDSOA4GFEPKPCVRLI6QJCNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23P3BZ0NHKBLM?ASIN=B0C2C29LCL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Very strong. Holds my knives perfectly",
                "reviewText": "I bought 2! Very stylish addition to the kitchen. Very easy to install less than 5 minutes. Holds my knives ready to slice and dice at any time. No more searching because right at hand. Magnet is very strong but not so strong you feel like you have to rip it off the wall. Very happy with this product.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61NqjRenuGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-iNpp6utL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "CaptLeon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEA3DREDZJS5L4LRYLKKU5MVO2EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3596FXQ5JUN2D?ASIN=B0C2C29LCL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Super cool",
                "reviewText": "I can't say enough good things about the Magnetic Knife Holder! It's truly a game-changer in my kitchen organization. This 10-inch magnetic strip is incredibly versatile, and I love the fact that I can use it both on my kitchen wall and on the refrigerator.The convenience it brings to my cooking routine is outstanding. I no longer have to rummage through drawers or fumble around in a clunky knife block. My knives are right at my fingertips, making meal preparation a breeze. The magnetic force of this holder is impressively strong, ensuring that my knives are securely held in place without any risk of falling.Not only does it keep my knives within easy reach, but it also doubles as an efficient tool holder for other kitchen utensils and metal tools. It's amazing how much more organized and efficient my kitchen has become since I added this magnetic strip.The sleek, modern design of the holder complements my kitchen decor perfectly, and it's super easy to install. The quality of the product is top-notch; it feels sturdy and well-made.In summary, the Magnetic Knife Holder is a fantastic addition to any kitchen. It's a space-saving, practical, and aesthetically pleasing solution to keep your knives and other metal tools neatly organized. If you want to streamline your kitchen and add a touch of elegance, this is the perfect accessory for you!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen Nassery",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR7DZDUDEUOVQRJCI37EYM7IWEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV9R30UOPS34F?ASIN=B0C2C29LCL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy Install, Works well",
                "reviewText": "This product was easy to install and would anywhere you'd want. I hung my on the wall with the included screws and it literally took just a couple of minutes. The magnet is super strong and in my case holds five large knives just fine. It could certainly hold more if needed. Great product, Great price and quick delivery. Over all an AWESOME product and price.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Wester",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW4AWXGEU474TPMS3LMQIG2I3WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26KY5QY8T0HMO?ASIN=B0C2C29LCL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Strong magnet, works perfectly",
                "reviewText": "Took less than ten minutes to install and it looks so clean and professional. I ordered the longer size to hold all of my knives and so far it's been great. They stick well, don't slide, and the stainless steel goes with everything else in my kitchen. Wish I'd ordered one years ago instead of the knife block I was using. Really frees up a lot of space when there's not much to spare!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KC66",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2YYF2D6IBCJVJAYNSVQGYKXB4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U4NKLMY1607D?ASIN=B0C2C29LCL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Good size for small spaces",
                "reviewText": "Magnetic Knife Holder is the perfect size for my needs. I had looked at other holders, but they were all too wide for my space. This one fit perfectly on the side of my cupboard. It is strong enough to hold several knives and utensils. Looks nice. I used three 9 lb command picture frame holders to install it because I'm in a rental and screw holes are a no-no. As the holder itself weighs under 2 lbs, it is very secure installed this way.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSOUDHNWO4INIAO2Q6NEMS3OCGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLPA7H6U0SU2C?ASIN=B0C2C29LCL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Works alright",
                "reviewText": "I’m surprised to say that the magnet isn’t as strong as I thought it would be. My knives are heavy, but I figured a magnet of that size would hold up, but I had to add another magnet underneath to keep in place.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wanda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6WXUI5KDGWL7JH4TTA6PR4PTHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBZTSBQVNL0ET?ASIN=B0C2C29LCL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Very heavy duty! Exactly as described.",
                "reviewText": "This product was a snap to install and has a very strong magnet!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JD1776JD1776",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHSD7ZPTF6LMNR6JECY3BX22QYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLA1VQCCNJLW9?ASIN=B0C2C29LCL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for declutter",
                "reviewText": "I have limited counter space & so do not want a big knife block sitting out. Plus I always use the same 2 knives out of it so what’s the point of having that big thing in my way? This is a great item to keep your knives handy in close reach yet still be able to show off your nice knives & help declutter your countertops. I put out the 4 I’d probably use the most. I could probably add a fifth if I decide it’s necessary. The rest I’m getting rid of or putting in the drawer. It seems to hold them securely. No expected trips to the ER! The wall plate installed easily with 2 screws. I considered using some heavy duty double sided adhesive but the screws seemed a safer option. I like that the main magnet part can come off the wall plate for cleaning. Highly recommend.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71HAV3tJmVL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}