{
    "remaining_requests": 34732,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Babish-High-Carbon-1-4116-Cutlery-Kitchen/dp/B08WJS3KVB",
    "body": {
        "name": "Babish High-Carbon 1.4116 German Steel Cutlery, 8\" Chef Kitchen Knife,",
        "price": "$16.39",
        "originalPrice": "$22.98",
        "rawPrice": 16.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Babish-High-Carbon-1-4116-Cutlery-Kitchen/dp/B08WJS3KVB",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTN2XBHL"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "High Carbon Stainless Carving Fork",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/216OviItehL._SS36_.jpg"
            },
            {
                "asin": "B08WJS3KVB",
                "variationName": "Color",
                "variationValue": "High Carbon Stainless Chef's Knife",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21YXfqnqYCL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "High Carbon Stainless Clef Knife",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31wV-3-W35L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "High Carbon Stainless Santoku Knife",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31HizJnT8jL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "High Carbon Stainless Set w/ Knife Roll",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ddD1Hy7RL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/317Dvl oCML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31bPjhYRF-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31OdX8e5H4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iPFEUJ7nL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mvUUw3MEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Im 9yt6fL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Babish Store",
            "link": "https://www.amazon.com/stores/Babish/page/916ED02F-A646-4A3D-8648-FEA8C7A9CF63?ref_=ast_bln"
        },
        "brand": "Babish",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 8061,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 46 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 7 hrs 46 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 14. Order within 3 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Forged from a single piece of high-carbon 1.4116 German steel",
            "Tempered, taper-ground, and polished for a frightening level of sharpness",
            "Full-tang ABS handle provides a balanced, comfortable grip",
            "All-purpose knife ideal for chopping, slicing, dicing, mincing and more",
            "Before first use, remove any tags or stickers. Rinse with warm soapy water and towel dry."
        ],
        "description": "Slice and dice your way through piles of veggies or primal cuts of beef with this durable kitchen workhorse. It’s precision-forged form a single piece of high-carbon German Steel, then tempered and hand-ground for maximum sharpness. The full-tang handle features a grippy yet sleek wrap that provides a balanced, comfortable grip so you can cut with more confidence. With just the right amount of rock and gentle taper, this knife is perfect for both heavy chopping and fine slicing, making it a perfect all-purpose knife any way you slice it. Excess heat and detergent from automatic dishwashers can damage or stain the blades, so dishwashers are not recommended. Do not allow blades to soak in water. Do not allow food to remain on blade after use, as this may cause stains. In most cases, persistent stains can be easily removed with a standard stainless steel cleanser & polish. Use a sharpener and honing rod between uses to keep knives sharp. It’s recommended to use a whetstone or have your knives professionally sharpened once or twice a year. (See more sharpening instructions below.) To preserve sharp edges, use knives on a wood or soft plastic cutting board. Hard surfaces such as countertops, dinner plates, or glass cutting boards will dull blades. Knives are not made to cut bones, frozen foods, or other hard objects. Love this knife and it will love you back. Use extreme caution to protect against injury. These knives are extremely sharp. Never use a knife as a can opener, pry bar, screwdriver, wedge, or hand tool. Never handle a knife by the blade. Keep sharp edges pointed away from you when laying a knife down. Never attempt to catch a falling knife. Keep all knives away from children. Store properly in a knife block, roll, or other safe place.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Kitchen Utensils & Gadgets",
                "link": "https://www.amazon.com/tools-gadgets/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289754"
            },
            {
                "name": "Kitchen Knives & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=23944789011"
            },
            {
                "name": "Chef's Knives",
                "link": "https://www.amazon.com/chefs-knives/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289857"
            }
        ],
        "productInformation": [
            {
                "name": "Blade Material",
                "value": "High Carbon Steel"
            },
            {
                "name": "Brand",
                "value": "Babish"
            },
            {
                "name": "Color",
                "value": "High Carbon Stainless Chef's Knife"
            },
            {
                "name": "Handle Material",
                "value": "Stainless Steel,Abs Handle,Steel"
            },
            {
                "name": "Blade Edge",
                "value": "Plain"
            },
            {
                "name": "Blade Length",
                "value": "8 Inches"
            },
            {
                "name": "Construction Type",
                "value": "Forged"
            },
            {
                "name": "Item Weight",
                "value": "11.3 ounces"
            },
            {
                "name": "Blade Color",
                "value": "Silver"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "No"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Item Length",
                "value": "12 Inches"
            },
            {
                "name": "Manufacturer",
                "value": "Babish"
            },
            {
                "name": "ASIN",
                "value": "B08WJS3KVB"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "131293.01R"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 8,061 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,558 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #9 in Chef's Knives"
            },
            {
                "name": "Date First Available",
                "value": "March 1, 2021"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Tri-ply Sauté Pan Carbon Steel Wok Stainless Steel Measuring Bowls Tiny Whisks Tongs Babish Approved ✓ ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e322291-b155-429b-beb2-10b0d493a621.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/832ddeac-edfd-4355-80b9-a4429cdecb98.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d56dbc90-a62b-426d-9fef-308e9372daf2.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4681bf7-a094-4b4c-903c-a35d0a034abc.__CR0,0,485,970_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bdcb86bb-1ecb-4f54-b258-85be9b879e06.__CR0,0,485,970_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0af075e-7189-4c8e-8470-683c432072d1.__CR0,0,485,970_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/48b7d9a5-083a-4068-bc26-e36e3ccb7aae.__CR0,0,485,970_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3be1fe65-005f-44fa-b42c-81959938923f.__CR0,0,485,970_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MPMP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDZ4DPUQ2SJEPPZFCCHKNWBIPNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FZNJRNA1T6RY?ASIN=B08WJS3KVB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2022",
                "reviewTitle": "5.0 out of 5 stars Great Value for the MOney",
                "reviewText": "A couple of things to get out of the way first. I am not a trained chef. I am not a professional cook. I am not a cutlery or forging expert. I'm not going to bore anyone at parties with my knowledge of metallurgy or knife-making. My primitive intellect doesn't understand alloys and compositions and things with... molecular structures. Any knowledge I really have comes from watching YouTube videos, experimenting with recipes, and failing or succeeding over several decades in the kitchen. I did discover somewhat early on that unlike golf where I can buy the most expensive clubs sold, I will still be a pretty bad golfer, in the kitchen, good tools can help even a bad cook be a better cook. I also have a brother in law who is a trained and (formerly) professional chef, who has complimented me on numerous occasions for having good quality cook and prep-ware.That out of the way, I am rating this knife entirely on its own merits, price point, etc. My five-star rating is for a $18 knife (which it was when I bought it, though I've noticed the price fluctuates a little bit). Certainly anything I say about it might vary if it were a $150 knife. It is not. So take that into account.I have been a fan of Andrew Rea's cooking videos for quite a long time, and when he started selling products, I wanted to support him. I have a few things from the Babish line, including the tiny whisks (HIGHLY recommended, you'll be surprised by how much you use them), the small prep bowl (again, extremely useful), and the iron trivet, which I bought because it sort of looks like me and that's fun. But one thing I really love is knives. Knives make me sort of starry-eyed, and I love having a new one. In fact, I have many more than I really need. Especially if you ask my wife. I bought this sort of as a low-risk bet, more than a real need for it. I was curious. I wanted to know how a $18 knife would hold up. Worst case, I figured, is I would hate it and donate it to a nephew or something. I didn't.Most of my knives are forged and made in Germany. They are typically Messermeister, Wustoff, or Zwilling. Not the most expensive knives you can buy for sure, but definitely above average. Before I got married, I had a block of Chicago Cutlery knives, which got the job done, but they were kind of cheap stamped-steel rigs. Decent for college knives, but not awesome. I only say this to give you an idea of what I'm comparing this to. I do not have wildly expensive professional cutlery, but I do have nice stuff.I honestly expected this to be a pretty below average knife, but perhaps probably okay for the price. Like a Target special. When it arrived, I was more impressed with it than I expected to be. It's well packaged, a nice weight, pretty well balanced, and sharp. The handle is comfortable and it looks nice. Nothing about it screams loudly that it doesn't belong with its much more expensive German counterparts. The shape is unique, and pretty cool. Especially if you're only looking to have a couple, two or three, knives in your collection. It's become one of my go-to knives for vegetables, chopping, etc. I used it tonight on a tri-tip and it slices meat competently as well. I always hand-wash my knives, so I can't say whether it holds up to machine washing, or how well. Don't put your knives in the dishwasher. Come on.I do not know the metal composition, nor do I care all that much. For the price, I'm guessing it's probably a lower-grade steel, but that's fine. I also don't know how long it will hold an edge over the long-term, but two months later, a couple of passes on a ceramic steel and it's still going strong. I assume it's full tang. It feels like it is, but if it's not, again, I'm not sure I care. The construction is all at least average. Even my chef brother-in-law was reasonably impressed with it, and his knives, I'm pretty certain, were forged in the fires of Mount Doom by ancient trolls, or something.I would possibly buy more Babish knives, but then I'd probably have to get a divorce. Because I don't know where I'd store them, along with the scores of other knives I have that I don't display or use. But if these were the only knives I had, I think they'd be fine. I'd be perfectly okay gifting these to someone just starting to build their culinary skills and collection. Again, if this was $150, I may feel differently about it, but it's not, and I do not. For the price, this checks all the boxes for me.",
                "reviewVotes": "98 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61vkHpO5ITL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71UBZl4tGGL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zephyr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPKB2OU5D6RSRQD3OSU74NOXGVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMZBAKFNQZJ0B?ASIN=B08WJS3KVB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Good knives for any home cook",
                "reviewText": "These are the best knives I've owned as an adult. I am not a chef. I cook meals for my family, so take that as you will. I use the chef knife almost every day, for almost all tasks. They're very comfortable to hold and use. They are sturdy and heavy, but in a high quality way. Not so heavy that they feel unwieldy. The little paring knife is my least used out of this set, but I don't do much small and detailed cutting. Using it has been a pleasure, as the blade and handle are well balanced. The Babish bread knife is THE BEST BREAD KNIFE I have ever used, hands down. Actually slices through bread, whether it's stale and tough, or freshly toasted. Leaves behind minimal crumbs. Every other bread knife I've ever used just shredded the bread to pieces. This is a total game changer! These knives are very sharp just out of the box, you've been warned! PSA: BE VERY CAREFUL washing these, so you don't cut yourself.I have purchased the Babish Santoku knife separately, and I use it interchangeably with my chef knife almost every day. I was just gifted the Babish Clef knife--I'm very excited to try it out this fall season on some tough squash and pumpkin. I bought an adjustable knife sharpener/honer to keep these beauties working well for me for years to come. These would make an excellent gift.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Rieley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7A4YIETNEHGWQMUIIZLP5Y2RDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I41R3A0PBODC?ASIN=B08WJS3KVB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Incredible value",
                "reviewText": "Comes extremely sharp, in a well-designed box. The shape, the grip, the logo... it just all feels premium, and for cheap. I'm excited to try more babish cookware in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J.J. In NY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSCKAPIR22NFTYQUKDQ3IDKHTNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35XOUMV25OBI?ASIN=B08WJS3KVB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Sharp, and well designed",
                "reviewText": "It is definitely sharp, I don't think anyone can argue that. It feels balanced and fits nicely in my hand, which gives you more confidence to use it often. When you are new to using knives in the kitchen, having a tool that inspires confidence makes a huge difference. The design makes it easy to hold, and use in the correct way.I'm just an amateur in the kitchen, but this one knife has a lot of uses, and does many things well.Keep it clean, wash it soon after using it instead of letting it soak, and it should serve you well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSQWANEYOM6OI4XEFV2L5LUX2VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R117PU3O8CPVX?ASIN=B08WJS3KVB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Great For Price, With a Few Issues",
                "reviewText": "Ordered this to bring to a home where i frequently cook and then, surprise! I kept it.It works a treat, blade is true and sharp, well packaged, holds comfortably, nice steel, and holds a sharpening over tough root veg prep, whole squashes, etc. Recommend. Will you think you are holding a $200 knife? Of course not, silly. But this is a great every dayer -- and to let other people use to keep them away from The Precious.NOTE: the design of the blade is such that it has a long straight edge (rather than rounded) at the base at the bottom toward the handle, at the tang. This will cause a stress point as well as open your hand up for a cut until you adapt to this blade shape difference from other well known German models.Handle is also slightly smaller in circumference than some other knives, and this may affect grip for larger handed folks.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric Thompson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCRUDBP4DTINDGCAOGOQA5A7PKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIOQR27MNNT69?ASIN=B08WJS3KVB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent knife!",
                "reviewText": "It's super sharp and comfortable to use. It also has the heft to cut large vegetables, like squash, easily.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mansi thumbar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWINHRK3CWS4LIKMAI6L4BAIEMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VKM5PHLYH5PX?ASIN=B08WJS3KVB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing Sharpness! Mind your fingers with it.",
                "reviewText": "The Babish High Carbon Knife is an excellent choice for anyone who wants a sharp, durable, and versatile knife. The blade is made of high-quality German steel that is sharpened to a very fine edge. This means that the knife can easily cut through even tough foods with minimal effort. The blade also retains its sharpness for a long time, so you won't have to sharpen it as often as other knives.The handle is made of ABS plastic, which is a durable and comfortable material. It is also well-balanced, so the knife feels good in your hand. The knife is dishwasher safe, but hand-washing is recommended to extend its lifespan.One thing to keep in mind is that the knife is very sharp. This means that you need to be careful when using it, as you could easily cut yourself. However, if you are careful, the Babish High Carbon Knife is a great knife that will last for many years.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matteo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 15, 2023",
                "reviewTitle": "Excelente filo",
                "reviewText": "El corte se siente muy fácil,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Fernanda Contreras",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 25, 2023",
                "reviewTitle": "Lo amo !",
                "reviewText": "El mejor cuchillo, ya quiero comprar los demás 🤩",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ingrid Flores",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 9, 2023",
                "reviewTitle": "Lo mejor",
                "reviewText": "Excelente acabado,profesional y con un filo extraordinario.Lo usamos para rodizzio y esta genial.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Celma A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 8, 2023",
                "reviewTitle": "Fantástico",
                "reviewText": "Super útil, de material excelente e ele e multi uso. Ameiii",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frederico",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 14, 2023",
                "reviewTitle": "Ótimo custo benefício",
                "reviewText": "Pelo preço que ela se propõe, que não é tão barato, mas ao mesmo tempo não tão cara, é uma faca excelente. O fio que vem de fábrica despensa comentários, ótima para cortar os mais diversos alimentos e com muito conforto pra manipulação. Em termos de acabamento, simples, porém ótima. Uma peça com material muito bom, bem feito e com uma estética bonita e minimalista. Em linhas gerais, ótima faça para ter em casa para uso geral de cozinha, forte recomendação.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}