{
    "remaining_requests": 34669,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Victorinox-6-7706-L114-Preparing-Vegetables-Straight/dp/B0052C216M",
    "body": {
        "name": "Victorinox 6.7706.L114 Swiss Classic Paring Knife for Cutting and Preparing Fruit and Vegetables Straight Blade in Green, 3.9 inches",
        "price": "$9.58",
        "originalPrice": "",
        "rawPrice": 9.58,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Victorinox-6-7706-L114-Paring-Knife/dp/B08972C89S",
        "soldBy": {
            "sellerID": "A1G35A3E12TBG5",
            "name": "BSD Fragrances",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1G35A3E12TBG5&asin=B0052C216M&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08972C89S"
        ],
        "asinVariationValues": [
            {
                "asin": "B0052C216M",
                "variationName": "Color",
                "variationValue": "Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31qJJBNszpL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Orange",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31MPHgrDzDL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31LKsjNQM3L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Yellow",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31o0DHOMBnL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31qJJBNszpL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41dx3mMqYBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ll463vBsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FJUQpyD4S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413qO4fykHS.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Victorinox Store",
            "link": "https://www.amazon.com/stores/Victorinox/page/59DC7984-FCC0-4299-B3F1-A360893B7FDB?ref_=ast_bln"
        },
        "brand": "Victorinox",
        "merchantInfo": "Shirlyns Natural",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 3356,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 5 hrs 35 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 14. Order within 50 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A COUNTERTOP ESSENTIAL: As the master of your kitchen, you deserve the right tools to express your creativity. This indespensable knife allows you to dominate kitchen advantures that require precision.",
            "FIT FOR ALL TASKS. Designed to handle both small and large kitchen tasks with durability. Crafted with high carbon stainless steel, each knife is conical ground and ice tempered to ensure long-lasting sharpness.",
            "EASY HANDLING. We've designed a contemporary, textured handle with a non-slip grip -- even when wet. These exceptional knives are weighted and balanced for easy handling.",
            "A CUT ABOVE THE REST: Our superior lightweight Swiss stainless steel blades provide precision, stability, and accuracy. They are easy to clean, extremely sharp and the prefect gift for everyday use or the culinary professional.",
            "TRUSTED SWISS QUALITY. Expertly crafted in Switzerland in 1884, Victorinox provides a lifetime against defects in material and workmanship. Making a lifetime commitment has never been so easy."
        ],
        "description": "A paring knife is every chef’s go-to tool for precision jobs in the kitchen, and our Swiss Classic Paring Knife 10 cm is a knife drawer standout not only for its fresh color palette but also for its sharp edge and pointed tip. Expertly remove pepper seeds, swiftly core an apple, slice a pile of vegetables into sticks or finely dice them into perfect little squares – whatever job you give it, the smooth, uniform cuts of this Paring Knife will result in dishes that are as beautiful as they are nutritious.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Kitchen Utensils & Gadgets",
                "link": "https://www.amazon.com/tools-gadgets/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289754"
            },
            {
                "name": "Kitchen Knives & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=23944789011"
            },
            {
                "name": "Paring Knives",
                "link": "https://www.amazon.com/Paring-Knives/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289859"
            }
        ],
        "productInformation": [
            {
                "name": "Blade Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Brand",
                "value": "Victorinox"
            },
            {
                "name": "Color",
                "value": "Green"
            },
            {
                "name": "Handle Material",
                "value": "Polypropylene"
            },
            {
                "name": "Blade Edge",
                "value": "Plain"
            },
            {
                "name": "Blade Length",
                "value": "4 Inches"
            },
            {
                "name": "Construction Type",
                "value": "Stamped"
            },
            {
                "name": "Item Weight",
                "value": "0.004 ounces"
            },
            {
                "name": "Blade Color",
                "value": "Silver"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Item Length",
                "value": "8.1 Inches"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Victorinox"
            },
            {
                "name": "ASIN",
                "value": "B0052C216M"
            },
            {
                "name": "Item model number",
                "value": "6.7706.L114"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 3,356 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,703 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #13 in Paring Knives"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 1, 2012"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Expertly remove bell-pepper seeds, swiftly core an apple, slice a pile of vegetables into sticks or finely dice them into perfect little squares. Add joy to your kitchen. Cutting edge means more than just the razor-sharp blade of a perfectly honed knife. It stands for innovation, for taking something traditional and re-inventing it, be it a knife or a recipe. This is what makes our products such great companions for every day’s adventures. All steel blades are made of martensitic stainless steel a correct alloy for a cutting edge retention, corrosion protection and flexibility. With a slightly larger handle that is easy and comfortable to hold, these household knives are ergonomic in design for perfectly cutting & chopping vegetable and other food items for a long period of time. Made of Polypropylene, it exhibits good strength, rigidity and hardness. It is suitable for sterilization and can be used at temperatures of up to 80 - 100°C. These are dishwasher safe.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/32d5ccc9-02f2-403f-bc23-f64bce0b2a48.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/984f995b-7a53-4e2a-bfd4-c5683b43b63b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/a8ef2edb-f9fd-4478-b2b9-47019b4ef701.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "If you get hold of one of these masterpieces, it will almost seem as if everything cuts itself. And that is the secret of a good chef. Thanks to the broad product range, every professional will find the right knife for his or her specific requirements. 45000 Swiss Army Knives and 90,000 Kitchen & Professional knives are produced every day, to meet the ever increasing demand of our customers. Since decades, issues concerning Sustainability have been given high priority. Is it because of our Swiss roots? Our 130-year history? Or is it simply because of our deep connection with nature? The fact is – we have always felt an obligation to treat our resources and our colleagues and customers responsibly.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/25636edf-7b75-4994-a53b-830208814da5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/a03f43c3-5436-4b4e-95e7-be90c4e56c48.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/7cd66775-7978-4c6a-9c6f-03a4d4effc7b.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Our company founder Karl Elsener starts a cutlery workshop in a pursuit for social upliftment of his fellow citizens. 1897 he develops the “Original Swiss Army Knife”. His mother Victoria actively supports him in his endeavours. He later names the company VICTORINOX. Combining his Mother’s name with INOX meaning stainless steel. ”….Never leave the planet without one “says Astronaut Chris Hadfield, who has a record of 4000 hours in space. Created to serve the Swiss Army in 1897, today armed forces of more than 20 different nations carry one. The small red knife has been present in space missions carried out by NASA since the late 1970s. As customer needs have changed over the years, the legendary Swiss Army Knife has also evolved. Quality, Functionality, Innovation and Iconic design have the highest priority, and this also applies to our other product categories: Watches, Travel Gear and Fragrances.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/54e8e837-fe55-45d9-b441-be0e55138ed5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/3f270d0a-13ff-4a98-9926-ff6f6f15f394.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/9885a75e-12e8-4264-833d-567904372065.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/c77fc4bf-3328-48b7-8a94-4625766f42e1.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/32d5ccc9-02f2-403f-bc23-f64bce0b2a48.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/984f995b-7a53-4e2a-bfd4-c5683b43b63b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/a8ef2edb-f9fd-4478-b2b9-47019b4ef701.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/bafea4b7-d8f0-4c61-8042-49b6be2cbb0e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/25636edf-7b75-4994-a53b-830208814da5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/a03f43c3-5436-4b4e-95e7-be90c4e56c48.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/7cd66775-7978-4c6a-9c6f-03a4d4effc7b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/54e8e837-fe55-45d9-b441-be0e55138ed5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/3f270d0a-13ff-4a98-9926-ff6f6f15f394.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/9885a75e-12e8-4264-833d-567904372065.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ethan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVOY5QGNKWA3IKNYNVOL7GXYBSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NLBO4IIXT0Z5?ASIN=B0052C216M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2021",
                "reviewTitle": "5.0 out of 5 stars Best Butcher Knife? Yes!",
                "reviewText": "Disclaimer: Not a normal review, this is a vegetable knife, but also a very versatile butcher knife! If you are queasy, or anti-hunting/meat - probably not the best for you to read so avert your squimish little eyes, por favor.As an avid hunter/outdoorsman who processes their own game instead of taking it to a butcher, finding the right, no, perfect tools for the job make it much more pleasing and satisfying. If you don't like reading, let me just tell you right now, buy this knife; I have tried so many types of knives for processing deer and this is the best one hands down!During the 2020 hunting season I went to the butcher with a friend and noticed that ALL the butcher hands were prefering to using this knife and I mean they USED them. They struck bone, they dropped on the concrete, they were stepped on and tossed into a bin, they were abused. Inspection of the magnet strip on the wall showed many more displayed that had been sharpened so often they lost the manufactured shape, but still sharp as a razor (more of a reflection of the butcher shop admittedly in this aspect since they were re-sharpened) and they had gobs of them up on the magnet strip. If one of the biggest butchers in town use these knives in abundance like this and can abuse them for so long that they are re-sharpened until the metal is worn to a knub, then I might as well give it a shot for 7 bucks right?As a base control - previous preferred knives I are/were 9\" Dexter fillet knives. Dexters are made with a high carbon steel material with a large handle for better precision. They resharpen fast, but also rust fast too due to the high carbon. I love Dexters' still, and will still not hesitate to use it. However, this season I vowed to try this Victornox knife. I put it through the ringer and it worked SO WELL!*To the Review*1.) Unboxing:PRO:Unboxing the knife I was pleased to find the blade in hair cutting sharp condition. Although, not scary sharp. Some people would refer the condition of the knife as razor, however, my definition is a bit different. Regardless, a few passes on each side of a leather strop with some buffing compound really cleaned up the edge nicely and was infact razor/scary sharp.The knife is SUPER lightweight and VERY small! This is a huge plus for for me as putting it in a backpack doesn't take up much real estate and won't weigh down the pack with unnecessary weight. This is untrue with the Dexter. It is a bit cumbersome, although I still used it because of its superb edge retention and precision.The contours of the handle, along with the plastic material are grippy when wet. This is a big deal when hands are covered in blood, or when trimming silverskin/tendon from meat later in the meat processing stages.Con: The knife did not come with a sheath. For a hunter that wants to carry the knife in a backpack this is a big turnoff. My Dexter did not come with a sheath either. I made a sheath for the victorinox by using some thick cardboard paper (think double a battery packaging) I double folded this heavy duty cardboard paper material and duct taped it. Whalla, sheath!1.) Field dressing/gutting deer review: The first step to gutting deer is to make an incision that runs from the tail, to the middle of the ribcage. Making this first cut proved the knife's thin blade and scary sharp edge made it perform like a scalpel. I was very impressed. After this point, most of the removal is done by hand except for a few select cuts which I noticed little difference between dexter and Victorinox.2.) Skinning: This knife did SO well. This is where I was most impressed with the knife. It handled the contours of the body and stayed so sharp throughout this process. I skinned two deer this night with this knife, with no touch ups to the blade. The edge retention was amazing!3.) Meat processing: Cleaning the silverskin off deer meat is not a very fun task at all, but it is necessary. This little knife made the process so much smoother than using large fillet knives.Overall, I highly recommend this knife for hunters like me. They are amazing tools that take up little-to-no room in the pack and for 7 bucks, what's not to love?",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "a critic",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE46TG5H4QPPNUSERCOTQWPRB6JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P5TJ9MNX2LFC?ASIN=B0052C216M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Do everything knife",
                "reviewText": "I bought this knife in two sizes. It’s the sharpest serrated knife I have ever used. It works for just about anything. You have to be really careful not to cut yourself, especially if you are not accustomed to extra sharp knives. This knife stays sharp, does not seem to ever need sharpening. I got rid of all my old paring knives, this one beats them all. You can cut tomato slices tissue thin. It’s an amazing product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JJ B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQGEVKABNYZEP4SIOYNV6TK446Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPV7QPE1NQP63?ASIN=B0052C216M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Great value",
                "reviewText": "Easy to use and very sharp. The blade has retained its sharpness after many uses.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WayneO",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHWAMP5YDG4BQPL4P45YQ7BCGDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NVRLLXN7SR49?ASIN=B0052C216M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Very sharp",
                "reviewText": "Bit longer than most paring knives. Thats a plus . Watch your fingers very sharp",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan in Wisconsin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE74UWX5EBLKS3ZLGWE2O2KDPOGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15810731M9XSP?ASIN=B0052C216M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful knife!!!",
                "reviewText": "Great knife at great price. Very sharp. Really like that it is a bit longer than a lot of other paring knives. I have other knives by Victorinox that I love and this seems to be another win in the kitchen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMMLHLWMFOEOSJZSFBVZOBT54TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LXFZC0F1S4SE?ASIN=B0052C216M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "4.0 out of 5 stars Cheap knife, good steel",
                "reviewText": "The steel used in Victorionox knives is better than cheap alternatives. These are not high end knives nor are they meant to be.It came with a \"grocery store\" edge... sort of sharp. If you can sharpen, it will take a much better edge with stones. Hardness is probably mid 50's on the rockwell scale... easy to sharpen for a stainless steel blade.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tracy Pickens Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXQV5XGDGEM3HF4QSFVHWNSAVLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJUXQMWY61Q66?ASIN=B0052C216M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Great knife",
                "reviewText": "This knife is great! I would buy another one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "steve fisher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2BT4GR6WEOBUP46DONFE2CZHBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20LA8D900XCN9?ASIN=B0052C216M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Great multipurpose knife",
                "reviewText": "Great multipurpose kitchen knife",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CAJGMM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 9, 2023",
                "reviewTitle": "Recomendable.",
                "reviewText": "¿Qué más se puede decir de los productos Victorinox que no se haya dicho ya?Consideren añadir un cuchillo de esta marca a sus utensilios de cocina, pienso que no se van a decepcionar por su calidad y en este caso, su gran filo.Tal vez el costo pueda parecer alto, pero esperando la oferta adecuada, se puede adquirir a un gran precio.Es muy recomendable este artículo y hay variedad de tipos de cuchillos y colores; los diseños pueden ser un tanto minimalistas, pero geniales y prácticos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yolanda S",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 9, 2021",
                "reviewTitle": "Excelente",
                "reviewText": "Corta verduras con gran facilidad, puede cortar a través de 6 tortillas para hacer chilaquiles sin ningún esfuerzo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2024",
                "reviewTitle": "Veg cutter",
                "reviewText": "This little knife is razer Sharpe cuts so well, onions no problems very versatile for most jobs you need to do in the kitchen again good price the delivery was there on date they gave me no messing very happy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mariola",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 30, 2024",
                "reviewTitle": "Butter cutter",
                "reviewText": "It’s my second knife from this company. Absolutely brilliant,very sharp and very smooth cut by this knife ,worth every penny,plus I love the yellow colour. Highly recommend to buy ,if you need one",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel Bush",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 31, 2023",
                "reviewTitle": "The best knives",
                "reviewText": "Brilliant knife for the money. Soooo sharp. Easy to use and wash. Easy to re sharpen when needed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.58",
                "sellerName": "AuthenticTimeStore",
                "sellerRating": "5"
            },
            {
                "price": "$9.58",
                "sellerName": "BSD Fragrances",
                "sellerRating": "4.5"
            },
            {
                "price": "$9.58",
                "sellerName": "Shirlyns Natural",
                "sellerRating": "5"
            }
        ]
    }
}