{
    "remaining_requests": 34464,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/WANGMAZI-Kitchen-Stainless-Chinese-Sharpening/dp/B0CJM68GRK",
    "body": {
        "name": "王麻子 Kitchen Knife Block Set German Stainless Steel Chinese Cleaver Chef Knife Set Block with Sharpening Steel Over 300 Years of Brand(Silver, 6pc)",
        "price": "$35.99",
        "originalPrice": "$59.99",
        "rawPrice": 35.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/WANGMAZI-Kitchen-Stainless-Chinese-Sharpening/dp/B0CJM68GRK",
        "soldBy": {
            "sellerID": "A355HGPA38TU8A",
            "name": "王麻子WANGMAZI Direct US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A355HGPA38TU8A&asin=B0CJM68GRK&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJBXPV7Q"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21i2Smp1STL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Silver CK4",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31oXrTDIJqL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Silver CL7",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31yak3j+gpL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Silver CN8",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31dI0XfA4ML._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Silver11",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21PybGmUIyL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Silver3",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41V7NjQkV9L._SS36_.jpg"
            },
            {
                "asin": "B0CJM68GRK",
                "variationName": "Color",
                "variationValue": "Silver6",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31bbWqZuJbL._SS36_.jpg"
            },
            {
                "asin": "B0CJC3W1R7",
                "variationName": "Size",
                "variationValue": "Cleaver1",
                "variationImageURL": null
            },
            {
                "asin": "B0CJJTHYQK",
                "variationName": "Size",
                "variationValue": "Damascus1",
                "variationImageURL": null
            },
            {
                "asin": "B0CJBZ41G5",
                "variationName": "Size",
                "variationValue": "Cleaver2",
                "variationImageURL": null
            },
            {
                "asin": "B0CJB911SH",
                "variationName": "Size",
                "variationValue": "Dams2",
                "variationImageURL": null
            },
            {
                "asin": "B0CJBN67J7",
                "variationName": "Size",
                "variationValue": "Utility2",
                "variationImageURL": null
            },
            {
                "asin": "B0CJ5CQNRP",
                "variationName": "Size",
                "variationValue": "7inch",
                "variationImageURL": null
            },
            {
                "asin": "B0CJM9SS51",
                "variationName": "Size",
                "variationValue": "San7",
                "variationImageURL": null
            },
            {
                "asin": "B0CJBLJBYT",
                "variationName": "Size",
                "variationValue": "Utility7",
                "variationImageURL": null
            },
            {
                "asin": "B0CJB8L6C2",
                "variationName": "Size",
                "variationValue": "Utiy7",
                "variationImageURL": null
            },
            {
                "asin": "B0CJC2XGJZ",
                "variationName": "Size",
                "variationValue": "8Inch Cleaver Knife",
                "variationImageURL": null
            },
            {
                "asin": "B0CJLWSMQ8",
                "variationName": "Size",
                "variationValue": "San8",
                "variationImageURL": null
            },
            {
                "asin": "B0CJC1JXHX",
                "variationName": "Size",
                "variationValue": "Cleaver3",
                "variationImageURL": null
            },
            {
                "asin": "B0CJC3RL7B",
                "variationName": "Size",
                "variationValue": "Cleaver5",
                "variationImageURL": null
            },
            {
                "asin": "B0CJBZ955Q",
                "variationName": "Size",
                "variationValue": "Cleaver8",
                "variationImageURL": null
            },
            {
                "asin": "B0CJBNMXXF",
                "variationName": "Size",
                "variationValue": "11inch",
                "variationImageURL": null
            },
            {
                "asin": "B0CNVJ648G",
                "variationName": "Size",
                "variationValue": "3PCS",
                "variationImageURL": null
            },
            {
                "asin": "B0CJM68GRK",
                "variationName": "Size",
                "variationValue": "6PCS",
                "variationImageURL": null
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31bbWqZuJbL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Ov1kpfP1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41diiWNM4SL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31d zS5T28L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FbQ7wecCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NecMBOfhL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the WANGMAZI Store",
            "link": "https://www.amazon.com/stores/MAKINGYOURLIFEBETTER/page/A5E07F07-5513-4C3F-93BB-79B7BB9C93DD?ref_=ast_bln"
        },
        "brand": "MAKINGYOURLIFEBETTER",
        "merchantInfo": "王麻子WANGMAZI Direct US",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 110,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Monday, February 19. Order within 5 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "KNIFE OF VARIOUS KINDS: This Chinese knife set with block has 6PCS(7-inch Cleaver knife,7-inch santoku knife,7-inch fruit knife,scissors, sharpening steel，knife block）,basically able to meet the needs of your daily kitchen life.",
            "HIGH QUALITY HANDLE: Ergonomic handle made of walnut to fit comfortably in the palm. The rosewood handle is processed by vacuumed technology, which makes the wooden handle not deformable and has stronger corrosion resistance.",
            "PREIUM STAINLESS STEE:The knife is made of carbon-rich 30Cr13 stainless steel,with a precise vacuum heat-treatment tempering processes, keep the knife sharp longer and long-term durability.",
            "SHARP AND DURABLE: The use of cutting edge technology, 15° cutting edge Angle, so that they have more excellent sharpness, the use of forge process, so that the structure of stainless steel becomes more stable, strengthen the wear resistance and corrosion resistance of the cutting edge, the knife has a more durable.",
            "LIFETIME WARRANTY:Our knife is made of hard steel and comfortable handle, we believe it will bring you a pleasant experience, if you have any question , please feel free to contact us anytime, we will deal with it immediately."
        ],
        "description": "WANGMAZI 6-Piece Knife Block Sets, Sharp and Durable,Stainless Steel,Ergonomic Handle,Dishwasher Safe",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Kitchen Utensils & Gadgets",
                "link": "https://www.amazon.com/tools-gadgets/b?ie=UTF8&node=289754"
            },
            {
                "name": "Kitchen Knives & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=23944789011"
            },
            {
                "name": "Asian Knives",
                "link": "https://www.amazon.com/asian-knives/b?ie=UTF8&node=289852"
            },
            {
                "name": "Chinese Chef's Knives & Cleavers",
                "link": "https://www.amazon.com/Chinese-Chefs-Knives-Cleavers/b?ie=UTF8&node=14309831"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Silver6"
            },
            {
                "name": "Brand",
                "value": "WANGMAZI"
            },
            {
                "name": "Blade Material",
                "value": "High Carbon Stainless Steel"
            },
            {
                "name": "Blade Edge",
                "value": "Plain"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "13.5 x 5.49 x 7 inches"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Number of Pieces",
                "value": "6"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "Yes"
            },
            {
                "name": "Construction Type",
                "value": "Forged"
            },
            {
                "name": "Product Dimensions",
                "value": "13.5 x 5.49 x 7 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.72 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "WANGMAZI"
            },
            {
                "name": "ASIN",
                "value": "B0CJM68GRK"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "TK06K2-C"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 110 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#24,533 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #4 in Chinese Chef's Knives & Cleavers"
            },
            {
                "name": "Date First Available",
                "value": "September 22, 2023"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TanagerTanager",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQHY2FHST4SMN26QCWYA5VEWOPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CKU8BA0ZRLF2?ASIN=B0CJM68GRK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent slicing knife for vegetables and boneless meat",
                "reviewText": "A lot of people tend to think that all cleaver-shaped knives are heavy meat cleavers that can chop through bone, but that is not actually the case. There are many varieties (see below).This one, Cleaver8, color silver CN8, with 2# engraved at the top of the blade, is called a light slicing knife or a mulberry knife (that is the literal meaning of the characters after the 2#). Some say it got this name because it is capable of cutting slices as thin as mulberry leaves; others say it is because it was used to cut mulberry leaves into fine threads to feed to silk worms. Whatever the historical meaning, this knife style is quite thin and light compared to other cleavers and is designed to slice vegetables and boneless meat, fish, and cheese. The edge is too fine to chop thick bones, pits, hard stems, rinds, or solidly frozen foods – anything you wouldn’t be able to chew with your teeth. It excels at precision cutting, slicing, and mincing. It has the traditional wooden handle used for centuries by Chinese chefs, in this case made of a light rosewood. The blade is a single thickness of 40CR13 stainless steel. It comes in a nice box in a plastic sleeve with corner protectors on the blade and a general information sheet written in English. The product number on the box is KN200FS2.My initial impression of the knife is that it lives up to its name. As you can see in the photos, it is quite thin (about 2mm at the spine) and comes to a very fine edge. It was sharp enough to cut paper right out of the box. I wanted a slicing knife with a flat belly so that it wouldn’t leave any “accordion cuts”, where the slices end up joined together at the bottom. Mission accomplished. It glides through carrots, potatoes, mushrooms, eggplant and apples, making fine or thick slices without any splitting. Shred a head of cabbage into a fine slaw? No problem. Cube a sweet potato? Easy peasy. The more I use it, the more I'm starting to love it. I haven’t tried it on tomatoes yet, but I expect it to work fine with a gliding cut. If it doesn't, I'll update the review. There is a band on the blade where the metal is brushed at right angles to the rest, which may reduce (but not eliminate) sliced veggies sticking to the blade.I like shiny knives and natural wood, so I find it quite attractive. It also feels good in the hand. The spine and choil (the back of the blade next to the handle) are rounded and polished for comfort. The wood handle is smooth and appears to have a thin finish on it, which I plan to renew with oil from time to time. The handle has a stainless steel cap on the end.I haven’t had the knife long enough to tell how well it will hold its edge. 40CR13 stainless steel is not the hardest, but it is easy to hone and sharpen. The company claims their tempering process improves the hardness considerably. I have a good knife sharpener in my drawer (Spyderco Sharpmaker), so I don't mind if I have to use it occasionally. I also plan to touch up the edge every few days with some strokes on a ceramic honing rod. As a Chinese chef pointed out, the best knife is not necessarily the hardest one, but can be the one that is easiest to sharpen. Toughness (resistance to chipping) and hardness are tradeoffs in knife steel. A harder knife can be more brittle, and it takes much more effort to remove chips than to sharpen a less hard but tougher knife.It’s a big knife, of course, so if you haven’t used a cleaver-style knife before, take your time to learn how to handle it correctly and safely. Look for videos from expert chefs on the knife skills for using this kind of slicer. Push cuts and pull cuts work best with this knife, and the weight of the blade helps it to almost fall through food. Use a pinch grip on the blade to hold it for cutting. Avoid hammering the blade onto the cutting board, because that will dull the edge. The blade dimensions are 7.9 x 3.5 inches (20.1 x 9 cm). It weighs 10.8oz (306g), which by way of comparison is an ounce heavier than my Henkels 10-inch chef’s knife. For the $25 I paid for it, I consider it a great buy.If you want to chop meat with bones or cut solidly frozen foods, parmesan rinds, or a large, heavy squash, Wangmazi has other cleavers that are more suitable. Cleaver5 is a larger, thicker, and heavier meat and bone cleaver, as is Axe1. As far as I can tell, Cleaver1 and Cleaver2 are medium-weight knives meant for slicing and chopping (perhaps chicken and fish bones but not heavier bones?). Cleaver3 and the one called \"8Inch Cleaver Knife\" are combination chopping and slicing knives thickened at the heel of the blade closest to the handle for chopping and thinner at the other end for slicing -- in the listing photos you can see the line at bottom of the blade that divides these two zones. All are made of 40Cr13 stainless steel except for Cleaver2, Cleaver3, and Cleaver5, which are made of three-ply stainless steel with a harder, sharper center layer of 90Cr18MoV enclosed in outer layers of 30Cr13 for toughness. Of course, these are not the actual names of the knives but the Amazon designations, which could change over time, so take this with a grain of salt.In terms of caring for all of these knives, while the blades are stainless steel, the handles of most are rosewood. You wouldn’t want to put them in the dishwasher any more than you would put a rosewood guitar in there. Even with a waterproof handle, putting a sharp knife in the dishwasher is not recommended, since the food particles thrown at the blade will dull it, banging against other hard objects can damage the blade, and washing with aluminum objects can cause stainless steel to rust or pit. All sharp knives should be hand washed and dried. Occasionally rubbing the handle with oil will help to preserve the wood.No matter how sharp knives start out, they all dull eventually, but they stay sharp longer if you treat them well. One way to do that is to use an appropriate cutting board. Wood or plastic cutting boards are good (end-grain wood is best). Glass or bamboo cutting boards are too hard and will dull the blade. Lay the blade almost flat to scoop up sliced vegetables (a great feature of cleaver-style knives) – never scrape the edge sideways across the cutting board, which damages the edge. You can also use the spine or the unsharpened end of the knife to move the food on the cutting board. Don’t toss the knife into a drawer – protect the blade (and your fingers) by storing it in a knife block or on a magnetic knife holder. Use a ceramic honing rod and/or a leather strop from time to time to keep the blade sharp longer.For the right job and with reasonable care, this knife is a joy to use and should last for a very long time.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51msYpNaOPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/6169oOQrq+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61AhqqIJBYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61FclNB0OqL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Y2eRQiLkL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71STNkUMB4L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Creator",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSSZ6LS6ZIRMFWOAZWF6Q7JQGWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31Y2HTQ82RTZG?ASIN=B0CJM68GRK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Good food prep knife",
                "reviewText": "Out of the box this knife looks great. The wood handle looks beautiful, and the blade has a full length tang that runs through the grip. The spin measures in at 1.75mm, which is about twice as thick as the Kiwi knives that I use (because they practically last forever). The wood grip does become a little uncomfortable toward the front as it is not rounded off. I am honestly not sure why the butt of the knife has the cut out, so that looks a little awkward. The description claims that it is German high carbon steel, which I have no way to verify. The only writing on the blade translates to Wang Mazi Multipurpose Knife. I'm fairly sure it's Chinese steel, but either way it seems like it will hold up for a while, as long as you sharpen it regularly. It cuts onions, bell peppers, avocado, carrots, pork, chicken, and beef with no problem. Comparing it to my Wusthoff and Messermeister knives, this thing cannot hold its own, but it will work out for cutting things that I don't want to risk chunking up my good knives. All in all, not a bad knife by any means, just not really a great knife.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yakov Katsman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF3XOGUTN6RHNYWBC7X7IQI6S5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R194HC7OQ0EVLG?ASIN=B0CJM68GRK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Good tool",
                "reviewText": "Good sharp knife",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joni",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZNCUM3S4LBXGQXSOPZ6IVEDSGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E25ANQ0PZLTF?ASIN=B0CJM68GRK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful meat cleaver",
                "reviewText": "Daughter loved this meat/vegetable cleaver I gave her for Chrisstmas. She says it cuts like butter. An indispensible kitchen tool for everyone who cooks and hates to cut vegetables.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Very good and sharp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQ23KM2LKTFQK2DR5KZYU5UOD5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AWDHSTFNJMPO?ASIN=B0CJM68GRK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful knife",
                "reviewText": "Chopping lettuce",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "surfista",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYD4WJ3MHMIMUBHYRJVMCGQBVLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EIH0FVXFSQM3?ASIN=B0CJM68GRK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Thin, Light, Cuts - with Some Corner Cutting",
                "reviewText": "This is a relatively thin and light budget knife that performs fine - but not without some corner cutting. Hopefully after reading this, you'll have enough information to decide whether the corners they chose to cut are deal breakers. This is a light duty knife that shouldn't be used to cut bone or chop hard things. The materials are fine and the wood handle is nice. It came out of the box mostly hair-shaving sharp, but it took more than a few passes to finally get all of the hair. Most likely, though the evenness of the grind was actually done quite well, the apex was ever so slightly off. When a blade is this thin, there's very little room for error. That being said, it was plenty sharp out of the box. How long it will stay sharp is an open question. I couldn't see any specification of the actual steel used, so I assume it's not the best German steel, and I also assume it's not treated to a very high hardness. But the steel seems fine overall. The good thing is that the blade stock is quite thin, and geometry is very important when it comes to cutting, i.e., you can have a very thin blade that is slightly dull and it will out cut an equally dull thicker blade. So, even if it dulls a bit right away, it will still cut OK. As long as you have a way to sharpen the blade it shouldn't be that much of an issue over time, if at all. The second corner they cut was that the tang sits slightly proud of the handle. If you use the pads of your fingers you will even feel a slight burr (it's a fine burr, so it won't cut you or anything), which does count as another corner cut. You won't feel the burr if you're normally gripping the knife though, but you will feel the metal. It won't matter to most people and it's relatively common with knives at this budget level. You can actually file and/or sand down the tang to be flush with the wood, but, at this price and quality it may not be worth the effort - especially if doesn't bother you. Getting a very good knife in this price range will always be a bit of a crap shoot. Hopefully, I've made what you're getting a little more clear. If you're looking for a light knife, you can live with the corner cutting, and the price is right for you, this knife should serve its purpose. Hope this helps.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Judeann Conry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH62S2US4EULYIMF57UES66P2NQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZKFBJSVZJQE1?ASIN=B0CJM68GRK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Light",
                "reviewText": "Light, maneuverable and sharp",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ramir",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUFFK7CJZTE64JAB75HZRSB23GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ITSLENQ18CBS?ASIN=B0CJM68GRK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "3.0 out of 5 stars Not for chopping hard things like coconut or bones",
                "reviewText": "It was a great knife for cutting vegetables, fruits, until I used it to open a coconut. Im not sure if it was meant for chopping things like bones. It had tiny pieces of metal that came along the sharp edge of the knife after chopping coconut",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}