{
    "remaining_requests": 32734,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Eclipse-Blackout-Curtains-Bedroom-Insulated/dp/B00DSMOH9C",
    "body": {
        "name": "ECLIPSE Meridian Modern Blackout Thermal Grommet Window Curtain for Bedroom or Living Room (1 Panel), 42 in x 95 in, Black",
        "price": "$10.69",
        "originalPrice": "$57.99",
        "rawPrice": 10.69,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Eclipse-Blackout-Curtains-Bedroom-Insulated/dp/B00DSMOH9C",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTQF4LHF"
        ],
        "asinVariationValues": [
            {
                "asin": "B00DSMOH9C",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51wMCZuvEpL._SS36_.jpg"
            },
            {
                "asin": "B00DSMOH8I",
                "variationName": "Color",
                "variationValue": "Chocolate",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51H7JZAlSRL._SS36_.jpg"
            },
            {
                "asin": "B00DSMOM3I",
                "variationName": "Color",
                "variationValue": "Linen",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51TBYaMnN0L._SS36_.jpg"
            },
            {
                "asin": "B00DSMOLZW",
                "variationName": "Color",
                "variationValue": "River Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51IpAcesfcL._SS36_.jpg"
            },
            {
                "asin": "B00DSMOMDS",
                "variationName": "Color",
                "variationValue": "Sage",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51KeDZkjKnL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "Only 14 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/411n3prqYhL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41RH0LZcc6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cEGog78rL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51V0ilgP3lL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JHlJzAm4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wMCZuvEpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Y xi4uYSL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the ECLIPSE Store",
            "link": "https://www.amazon.com/stores/EclipseCurtains/page/BCC85C84-66FA-48CF-A291-B7C90F398C84?ref_=ast_bln"
        },
        "brand": "EclipseCurtains",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2634,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 1 hr 21 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% Polyester",
            "Imported",
            "PATTERN - No more sacrificing design for capability! The perfect marriage between Modern/Contemporary style and high functionality. This stylish geometric circle curtain instantly elevates any room. Sold as a single panel.",
            "LIGHT BLOCKING - Eclipse blackout curtains block out between 98% to 99.9% of sunlight and harmful UV rays to ensure upmost privacy. Perfect for any living room, bedroom, kids room or nursery window!",
            "ENERGY EFFICIENT - Patented Thermaback technology designed to block out intrusive sunlight reduces unwanted noise and offers thermal benefits. Provides an insulated barrier against summer heat and winter chill to balance your room temperature and save on energy bills.",
            "EASY SET UP - A convenient Grommet top header effortlessly slides over your preferred curtain rod (not included) for quick and easy installation Ready to be hung right away!",
            "CARE INSTRUCTIONS - Machine washable for fuss-free upkeep in gentle cycle and cold water. Do not bleach. Warm iron and tumble dry at low temperatures."
        ],
        "description": "Experience the darkness, silence and beauty of Eclipse curtains. Eclipse blackout panels have been laboratory-tested to block out over 99-percent of intrusive light, unwanted noise and can help you save on home heating and cooling costs. Eclipse curtains offer a unique blend of fashion and function for any home décor. Transform your media room into the ultimate home theater experience, or create ambiance in your dining area. National Sleep Foundation studies show that reduced light and noise are optimal for a better night's sleep. Eclipse Curtains are perfect for the bedroom, kid's room or nursery, providing the ideal sleep environment for the whole family. The magic is in the Thermaback construction. The innovative foam-backing is applied to the fabric and allows you to enjoy all of the light-blocking, noise reducing and energy saving benefits, while providing the same fashionable style and elegance of naturally flowing curtains. Hang two or more curtain panels on a standard or decorative rod for optimal coverage and desired effect. Sold as a single grommet panel measuring 42\" wide by your choice of 84\" or 95\" long. Grommets accent panel with an antiqued bronzed metal. Available in black, chocolate brown, linen beige, river blue and sage green. Rod sold separately. 100-percent Polyester. Machine wash gentle cycle, tumble dry, do not bleach. Imported.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Home Décor Products",
                "link": "https://www.amazon.com/home-d%C3%83%C2%A9cor/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063278"
            },
            {
                "name": "Window Treatments",
                "link": "https://www.amazon.com/window-treatments/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063302"
            },
            {
                "name": "Curtains & Drapes",
                "link": "https://www.amazon.com/draperies-curtains/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3736141"
            },
            {
                "name": "Panels",
                "link": "https://www.amazon.com/panels/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3736151"
            }
        ],
        "productInformation": [
            {
                "name": "Opacity",
                "value": "Blackout"
            },
            {
                "name": "Special Feature",
                "value": "Blackout"
            },
            {
                "name": "Room Type",
                "value": "Bedroom, Playroom"
            },
            {
                "name": "Curtain Form",
                "value": "Window Tier Curtain"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Indoor"
            },
            {
                "name": "Specific instructions for use",
                "value": "Decorative"
            },
            {
                "name": "Closure Type",
                "value": "Grommet"
            },
            {
                "name": "Product Dimensions",
                "value": "95\"L x 42\"W"
            },
            {
                "name": "Size",
                "value": "42 in x 95 in"
            },
            {
                "name": "Item Weight",
                "value": "1.2 Pounds"
            },
            {
                "name": "Package Weight",
                "value": "1.25 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,634 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#56,657 in Home & Kitchen (See Top 100 in Home & Kitchen) #506 in Window Curtain Panels"
            },
            {
                "name": "Brand",
                "value": "ECLIPSE"
            },
            {
                "name": "Included Components",
                "value": "Single Panel Blackout Curtain"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Material",
                "value": "Polyester"
            },
            {
                "name": "Care instructions",
                "value": "Machine Wash"
            },
            {
                "name": "Lining Description",
                "value": "Polyester"
            },
            {
                "name": "Fabric Type",
                "value": "100% Polyester"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Pattern",
                "value": "Geometric"
            },
            {
                "name": "Theme",
                "value": "Geometric,Contemporary,Modern"
            },
            {
                "name": "Top Style",
                "value": "Grommet"
            },
            {
                "name": "Seasons",
                "value": "Summer"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "ECLIPSE BLACKOUT CURTAINS This light blocking level is recommended for kids’ bedrooms, living rooms, dens, playrooms, or any room where you may want the appearance of darkness, while still having enough light to navigate throughout the room. Blackout curtains are also the perfect choice on windows that tend to radiate heat, as they provide optimal thermal protection without creating a pitch black environment. Specifications: Blocks 93% - 97.9% of Light.Significant Amount of Privacy.Some Noise Reduction.Some Energy Savings",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0435a438-4ddd-4bb6-b9ad-c1f610a18778.__CR0,0,900,900_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "How to Measure your Window 1. Measure the Width of the window frame. (A to B) 2. Measure the Length of the window frame. (C to D) 3. Measure the Length from the top of the window frame to the floor. (E to F) Determining Proper Width When measuring the width of your window (A to B), be sure to consider whether you are hanging your curtain hardware on the inside or outside of the window trim. If you are aiming for a fuller, gathered look, make sure to multiply your measurement by 2.5x. Determining Proper Length Consider the look you want to achieve and where you want the bottom of your curtains to fall. Panels are usually hung so they fall anywhere from the window sill (C to D) or to the floor (E to F). Typically, panels are hung 4 inches above the window frame. Helpful Tips: Consider pooling your drapes for a more dramatic effect, this means your drapes will gather on the floor. If you have baseboard heating, consider whether you want to cover or have curtains end just above the baseboard.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/9fa6ebcb-f5d7-440d-94c2-7e881c4004f1.__CR656,0,4850,3000_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Benefits at Each Opacity Level Light Filtering - Softly Filters Light - Blocks UV Rays up to 33% Room Darkening - Blocks 93% - 97.9% of Light - Significant Amount of Privacy - Some Noise Reduction - Some Energy Savings Blackout - Blocks 98% - 99.9% of Light - Maximum Privacy - Considerable Noise Reduction - Significant Energy Savings Absolute Zero - Blocks 100% of Light - Maximum Privacy - Maximum Noise Reduction - Maximum Energy Savings",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b8ccc2f9-3c8a-4ee4-82bd-a30c4d3301db.__CR0,0,900,900_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b1f867f2-b04e-499a-971c-6115afd39065.__CR0,0,900,900_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/01c26316-97c7-4f49-83fe-4603ef0c7b1c.__CR0,0,900,900_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/877d8dee-e826-468b-a207-3ad36ccb118b.__CR0,0,900,900_PT0_SX220_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/c9b7b686-ee88-4b8a-94e4-e80923db0680.__CR0,0,2910,900_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0435a438-4ddd-4bb6-b9ad-c1f610a18778.__CR0,0,900,900_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9fa6ebcb-f5d7-440d-94c2-7e881c4004f1.__CR656,0,4850,3000_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b8ccc2f9-3c8a-4ee4-82bd-a30c4d3301db.__CR0,0,900,900_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b1f867f2-b04e-499a-971c-6115afd39065.__CR0,0,900,900_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/01c26316-97c7-4f49-83fe-4603ef0c7b1c.__CR0,0,900,900_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/877d8dee-e826-468b-a207-3ad36ccb118b.__CR0,0,900,900_PT0_SX220_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "RKH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5KW3RVKKG3GRWZWE6ADRYIG2OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ADIU3J59K0DW?ASIN=B00DSMOH9C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2015",
                "reviewTitle": "5.0 out of 5 stars Took a chance, no regrets, extremely pleased.",
                "reviewText": "I am very pleased with this purchase. I purchased the brown and they are very nice looking and look way more expensive than they were. I love the ring patterns which fit my decor perfectly. They match my shades of green and blue. There is possibly gray too but not sure. They block light effectively and keep cold drafts out. The package stated three levels good (which these are) and better and best and breaks out features. For me I am good with this level because it really is well made, looks super nice with just a bit of sheen, and it does a nice job of keeping light and cold out for being just their lowest end of the line. I threw in dryer with wet towel for 20 minutes per pkg directions and wrinkles came out. I did not need to iron. Price is excellent and I am going to order a send set or two. One in a spring color for later and even though these are quite adequate in width I may put a 3rd one up for more fullness for my slider. This is one of my Amazon purchases that I love and will do again. No regrets on this one.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VibrantRebel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA3JLYKVFE4VD3XWRJCO5G5VRYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O8N8XA9NU9V9?ASIN=B00DSMOH9C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2018",
                "reviewTitle": "5.0 out of 5 stars Absolutely keeps the East coast heat at bay!!",
                "reviewText": "I had purchased this curtain originally from Wal-mart when we lived in an older home that was built in 1891! The summers were intolerable and the bathroom received direct sunlight, which made it unbearable to spend any time in after showering (like applying make-up!). I had purchased ONE panel at that time - never do this - and when I went back to search for a second panel, they were nowhere to be found!! The single panel did cover the window (mostly), and in hindsight, it would have been better to have purchased 2 panels. Note to self: always buy 2 panels even if you think you only need one!!Fast forward to almost 3 years later, and I decide that our new home could use the black-out curtains in the Master bedroom after much deliberation. The Master bedroom and master bath receive direct sunlight for several hours, and the sun just beats that side of the house and heats it up beyond belief. The difference between the downstairs and the upstairs is easily 15 degrees. Nuts, right?! I took down the white curtains and dragged out the blackout curtain, and remembered - oh yeah, I only have ONE panel. Face-palm.Fortunately, that panel had a tag that led me to Amazon, as usual! I was a little worried at first that it might not be the same color, but it was. I was delighted to find a single panel to complete the window.Does this curtain work? Yes. I wasn't going for a complete black-out - I really just wanted to block a massive amount of heat coming through the window while trying to conserve a little bit of style. Obviously there is nothing that is absolutely beautiful about most of these black-out curtains, so I feel like these add a little bit of style when it's truly functionality I was looking for. Now, if I worked at night and needed to sleep during the day, these may not be dark enough, but who knows - maybe they would be. Certainly at night when the curtains are closed, I literally am feeling my way through the room if no lights are on. That said, I finally decided to put a candle with a timer for several hours during the night because it is so dark that I have bumped into the chest of drawers and ran into the elliptical walking through the room!These curtains not only block about 90-95% of the light (in my estimation), but they contain the heat. I can touch the backside of the curtain and feel the heat there. While these are not the most beautiful curtains in the world, it's the functionality I was after - and the style isn't really that bad. Trust me, I have seen REALLY ugly black-out curtains!!I am glad to have found these!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. A. SJ. A. S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUEYUT5WQS6QMIV6JKQTJMJR5EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R297BESPFZACO3?ASIN=B00DSMOH9C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2015",
                "reviewTitle": "5.0 out of 5 stars Great for the Price!",
                "reviewText": "I wanted some blackout curtains to keep the light out for my theater room. The curtains work PERFECTLY. It dramatically darkens to the room during the day and keeps it nice and cozy at night time. As a side note, I noticed they are also help to keep the warm air in and cold air out. When we replaced our older curtains, you could feel a slight draft go though them, with these, they keep the draft down by about 75%. While I am sure I could of spent triple and got a higher quality dual lined curtains, but these are AMAZING for the price point they are at.The curtain panels are well made, and stitched. The grommets are capped on both sides giving a nice cleaner finished. They are \"Stiff\" giving it a nice finished look. (Not sure how well it will stay after a washing or two)The colors are spot on with they image for the black set that I bought. (See Images)(Note : With the white balance on my phone, I needed to use the flash.)",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61lOLE+bXwL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61rTA+ZdmEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71la0yidP3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71vgr06yLaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81SHa3KFNqL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91IR5gSfqoL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Smith Man",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEWUSW6IWQGY4UIRYW7ICNF2YOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39402BYQ8D1NK?ASIN=B00DSMOH9C",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2022",
                "reviewTitle": "4.0 out of 5 stars Nice blackout curtains",
                "reviewText": "Wife review: curtains needed replacing in our living room. I couldn’t find the right color to go with our decor. I finally found these and they were the same exact curtains of the ones I was replacing. They don’t wash but they look great for a long time. Good price for having to replace every 8 years or so. They go really well with all decor colors and scheme’s. Hold up really well. They’re definitely a more stiff material. One panel is included. I have one big window and one small. I ordered 4 panels. 3 fit on the big window and 1 fit on the smaller.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shelley c. tong",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTG52ARHZ7DHZWXDCC7XEKG46IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EN749POMSRJR?ASIN=B00DSMOH9C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2015",
                "reviewTitle": "5.0 out of 5 stars ... house and now have a ton of windows - great for letting in light - not so great when ...",
                "reviewText": "We recently moved to a new house and now have a ton of windows - great for letting in light - not so great when it gets cold. I have a total of 11 of these panels. I'm thinking I should have ordered more. They come out of the package ready to hang. They have a few creases from being folded, but those came out easily enough after being on the windows for a couple of days. These curtains are perfect for blocking out the light and the cold. I can really tell the difference in temperature from when the curtains are open and when they are closed. And honestly, I couldn't make them for the price Amazon is selling them. They look fresh and clean and modern and I just love them. The grommets are nice and large so the curtains slide open and closed with almost no effort. My only negative comment is that I wish they were wider. I have a sliding glass patio door and had to purchase three of the panels to cover the opening. Not a deal breaker, but I would have been happier with a single panel that was triple wide. Would I recommend these? In a heartbeat. Am I happy with them? Absolutely. Are they worth the money? Without a doubt. Heck, I'm thinking of ordering more of them just to have on hand. I could make them into matching pillows. Maybe a valance for my tiny kitchen window. The possibilities are endless. On a serious note, these curtains are easily worth the money and they do block out the light and the cold. I suspect this summer I will love them just as much when the hot sun tries to come thru my windows.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPWUFDGJTSVNUZ4VZVVKITC5ONQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38AVFSF8F8DFD?ASIN=B00DSMOH9C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Great quality",
                "reviewText": "These are thick, sturdy, and nice looking, a great value.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rohzalu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 26, 2023",
                "reviewTitle": "Buenas cortinas",
                "reviewText": "Me gusto mucho pero vienen de una en una si piden pidan 2 piezas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Viviana Hernández",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 22, 2022",
                "reviewTitle": "Justo lo que necesitaba",
                "reviewText": "Las cortinas están muy bellas, la cálidas es buena y si hace la función de bloqueo de luz.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheila West",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 4, 2022",
                "reviewTitle": "Just what I needed",
                "reviewText": "loved these curtains - fit perfectly into our new master.... however beware - initially I had thought of getting the sage green ones - BUT they were much more expensive than the brown........ why the same curtain different colour was priced much higher is beyond me.......... but the brown works well. They are definitely dark out curtains - as I am actually sleeping past sun up - despite having 3 windows in the bedroom",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JAZMING",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 27, 2019",
                "reviewTitle": "Excelentessss",
                "reviewText": "Good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 12, 2019",
                "reviewTitle": "Rideau occultant \"Éclipse\"",
                "reviewText": "Ces rideaux sont trèsbeaux et de belle qualité !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}