{
    "remaining_requests": 35614,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ninja-Multi-Purpose-Counter-top-Convection-SP101/dp/B07SCGY2H6",
    "body": {
        "name": "Ninja SP101 Digital Air Fry Countertop Oven with 8-in-1 Functionality, Flip Up & Away Capability for Storage Space, with Air Fry Basket, Wire Rack & Crumb Tray, Silver",
        "price": "$192.00",
        "originalPrice": "$219.99",
        "rawPrice": 192.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ninja-Multi-Purpose-Counter-top-Convection-SP101/dp/B07SCGY2H6",
        "soldBy": {
            "sellerID": "A6YMPVN3GSBV7",
            "name": "Hotwired",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A6YMPVN3GSBV7&asin=B07SCGY2H6&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLW3VSTQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B07SCGY2H6",
                "variationName": "Size",
                "variationValue": "8 Functions",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "13 Functions",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "13 Functions + Smart Thermometer",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08QZZY53M",
                "variationName": "Style",
                "variationValue": "Extended Height",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07SCGY2H6",
                "variationName": "Style",
                "variationValue": "Standard Height",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "Only 4 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51lqoRxpKAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/413WUJf7mlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ibQ6PE6ZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31cmo16AyKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pJFaO9JXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41W11CSxJ1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51c31nrEGEL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ninja Store",
            "link": "https://www.amazon.com/stores/Ninja/page/4D837C13-1334-44EE-AD50-9586EE0F3873?ref_=ast_bln"
        },
        "brand": "Ninja",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 28286,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22.",
            "Or fastest delivery Friday, February 16. Order within 19 hrs 58 mins.",
            "FREE delivery Tuesday, February 20. Order within 16 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "DIGITAL CRISP CONTROL TECHNOLOGY: Precision-controlled temperature, heat source, and airflow for ultimate versatility and optimum cooking performance.",
            "8-IN-1 VERSATILITY: The ultimate meal-making machine with 8-in-1 functionality: Air Fry, Air Roast, Air Broil, Bake, Bagel, Toast, Dehydrate, and Keep Warm all in one powerful, 1800-watt appliance. The height of the interior of this machine is approximately 3\".",
            "LESS FAT: Eat all of your air fried favorites guilt-free with up to 75% less fat when using the Air Fry function vs. traditional deep frying. Tested against hand-cut, deep fried French Fries.",
            "FASTER COOKING: Cooks up to 60% faster than a traditional oven on Air Roast; 60-second preheat; full meals in as little as 20 minutes.",
            "LARGE CAPACITY: 45% larger usable pan cooking area vs. the flat surface area of the Cuisinart toa-60 and toa-65 pan. Fits a 13\" Pizza, up to 9 slices of toast, or 6 chicken breasts (6–8 oz. each).",
            "RECLAIM YOUR COUNTER SPACE: Takes up 50% less space when you flip it up and away to store against your kitchen backsplash.",
            "SELECT TOAST DONENESS: Toast and bagels done the way you like with a toast darkness selector to get it just right.",
            "EASY CLEANING: Includes a removable crumb tray and an easily accessible back panel for deep cleaning.",
            "WHAT’S INCLUDED: Countertop Oven, Air Fry Basket, Sheet Pan, Wire Rack & Removable Crumb Tray.",
            "Amperage: 15 amps"
        ],
        "description": "The Ninja Foodi digital air fry oven packs a lot of features and cooking Capacity in a small countertop footprint. Air fry, air roast, air broil, bake, bagel, toast, dehydrate, and keep warm- all in one appliance- and when you're done cooking, reclaim your counter space by simply flipping the oven up and away to clean and store.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Product Dimensions",
                "value": "19.72\"D x 14.96\"W x 7.56\"H"
            },
            {
                "name": "Color",
                "value": "Silver & Black"
            },
            {
                "name": "Capacity",
                "value": "19.7 Cubic Inches"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Roast, Broil, Bake, Defrost, Reheat"
            },
            {
                "name": "Output Wattage",
                "value": "1800 Watts"
            },
            {
                "name": "Item Weight",
                "value": "18.56 pounds"
            },
            {
                "name": "Brand",
                "value": "Ninja"
            },
            {
                "name": "Wattage",
                "value": "1750 watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Model Name",
                "value": "Ninja SP101"
            },
            {
                "name": "Has Nonstick Coating",
                "value": "Yes"
            },
            {
                "name": "Is Dishwasher Safe",
                "value": "No"
            },
            {
                "name": "Cable Length",
                "value": "34 Inches"
            },
            {
                "name": "Manufacturer",
                "value": "SharkNinja"
            },
            {
                "name": "ASIN",
                "value": "B07SCGY2H6"
            },
            {
                "name": "Item model number",
                "value": "SP101 LP3"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 28,286 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#721 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #12 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "July 26, 2019"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/53edcd7e-403c-4628-aef7-4b9a3ea2a11d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15b47731-64f4-4082-98d0-b8c248d04077.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3eeed4a-48c2-4df1-a13d-8e68e51e0684.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/16ca32c8-5715-49d3-a33f-c9ba0f56f8ee.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/74b1f593-dd67-472f-bb4f-eb39fdb68784.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15c4a553-de56-40cb-86f2-7e6a4010bc86.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f50bd818-9795-4604-b1ff-225e858fa5ed.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e59405c-0071-4d70-bff6-59eedfe2133b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ryan Palmer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5XU7GHGOKUMQP7Z3VRJKBCCDXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1758IF1WJ82P4?ASIN=B07SCGY2H6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastic space saver",
                "reviewText": "I am currently on day 2 of owning this thing so, really, consider this a first impressions review.Firstly, the main draw: The flip-up feature. This really is a game changer and was chief amongst my reasons to buy this particular oven. I am happy to report that this feature works very well and gains me back a good amount of countertop space. It fits like a GLOVE flipped away under my wall cabinets. If you have low hanging wall cabinets, however, you'd do well to take a measure before purchasing to ensure you have access to this feature. This is what sets it apart from other products IMO.Secondly: The power cord. Its bad. Specifically, when plugged in, the power cord extends straight out from the wall and I think the manufacturer absolutely, positively should have opted for a low profile plug-in, especially since this is designed to flip-up to stow away. This is a serious negative as you're not able to place this in front of the power socket its plugged into without the front of the oven protruding past the countertop and nearly falling off. If you have a very small kitchen, take a moment to be sure you'll have adequate room.Finally, the real test: Cooking. So far, I have only reheated refrigerated pizza and air-fried some cheese sticks. To that end, this thing is a beast. The controls were easy enough to figure out without needing the manual. It has a great pre-heat feature which only starts running the timer after it gets to temperature, which is FAST. When set to 450F, pre-heating was less than 2 minutes. I was impressed. The food came out exactly as I hoped. They aren't kidding though, watch your food carefully when you first get it. Use the light. It can quickly burn your food if you're not familiar with convection and don't understand the lower cook times.My only other negative is theoretical: Cleaning. I don't think it will be TOO difficult, as the bottom tray is easy to lift out, but if you DON'T clean regularly I can easily see crumbs and debris piling up in the back when the oven is flipped up. I think the solution is probably just being proactive with cleaning it. For the lazy, maybe avoid this one.Overall impressions are very very good and, at the time I'm writing this, I'm not mad at the $170 sale price either. Go, Ninja, Go.",
                "reviewVotes": "49 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KU4T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGC5QBRTIHMLLZDLEXZZHKQQT5WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7NZCJ49I6L7I?ASIN=B07SCGY2H6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Ninja SP101 Digital Air Fry Countertop Oven: A Kitchen Revolution ★★★★★",
                "reviewText": "I am thrilled to offer my thoughts on the Ninja SP101 Digital Air Fry Countertop Oven, a kitchen appliance that is truly a game-changer. Its 8-in-1 functionality imbues it with an almost unmatched versatility that has truly revolutionized the dynamics of my kitchen.From the moment I unpacked this sleek and modern kitchen marvel, I was amazed at the thoughtfulness of its design. The Ninja SP101 is more than just an oven; it is an air fryer, toaster, broiler, and dehydrator, all packaged into one incredibly compact and stylish unit. The space-saving flip-up feature for storage adds a whole new level of convenience that is a godsend for those of us with limited counter space.The digital controls on the SP101 are user-friendly and intuitive. It was a breeze to program, even on the first try. The bright, easy-to-read display adds to the overall ease of use, and the pre-set cooking modes took the guesswork out of meal prep. From air frying crispy chicken to dehydrating fruits or baking a perfect pizza, every function performed above and beyond my expectations.But it's not just about the variety of functions - it's also about the quality of the results. The SP101's EvenCrisp Technology is impressive, ensuring perfectly golden-brown finishes and textures that truly \"wow.\" The ability to circulate super-heated air around the food means meals are cooked evenly, quickly, and most importantly, deliciously.The large-capacity cooking area is another plus. It comfortably fits a 13-inch pizza, up to 9 slices of bread, or even an entire chicken. Despite its capacity, the oven preheats in mere minutes - a stark contrast to my traditional oven. And the removable crumb tray and accessible interior make the cleanup process a cinch.One of the highlights of the Ninja SP101 is its commitment to health-conscious cooking. The air frying functionality uses up to 75% less fat than traditional frying methods, offering a healthier alternative to deep-fried cravings without compromising on taste or texture.In conclusion, the Ninja SP101 Digital Air Fry Countertop Oven with 8-in-1 functionality is a stellar performer. It offers remarkable versatility, user-friendly operation, and outstanding results. Whether you're an experienced home chef or a cooking novice, this appliance is set to become an indispensable part of your kitchen. The Ninja SP101 not only meets the promises it makes but indeed, surpasses them. I wholeheartedly recommend this to anyone seeking to elevate their cooking experience.",
                "reviewVotes": "127 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Courtney M. Courtney M. ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVL56NKLBGODXVINMUKJYFSJIEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30RNOM085R96C?ASIN=B07SCGY2H6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Makes life easier! Love this!",
                "reviewText": "I wanted something that had a larger air frying capacity than what I currently had, but that take up too much counter space and this hit a home run! I decided I didn’t need the flipping feature, and have really enjoyed using the top with the protection of the cutting board to give me back some “counter space.” It’s actually deeper than I expected too which is nice. Pretty positive a frozen pizza would fit just fine!It heats up quickly, ever feature I have used has worked well. It does take. While to cool down after the fact and do with that the tray would pull out when you opened the door, but that’s trivial. It even cooks some things faster than they would cook in the oven since it’s smaller and heats up faster!Glad I bit the bullet and purchased this!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CNJgQsvhL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Margaret WhalenMargaret Whalen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 12, 2024",
                "reviewTitle": "Everything not only looks cool but taste good",
                "reviewText": "I love my air fryer. I love how I can make roasted potatoes and carrots in such little time. Everything cooks much faster than in a regular over but taste so good. Chicken is most and juicy, same as steak. My favourite is grilled pork chops. Nice to be able to cook dinner for my husband and I all together, fast and only one pan to clean. Everything really does taste better. My only regret is waiting as long as I did to purchase this airfryer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81kNNYIIamL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandro Cano Lopez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 24, 2022",
                "reviewTitle": "Increíble, súper recomendable",
                "reviewText": "Lo mejor de un airfriyer combinado con un horno, fácil de limpiar y gran poder de cocción, de mis mejores compras",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teresa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 29, 2021",
                "reviewTitle": "Muy bueno......",
                "reviewText": ",,, pero la superficie de acero de afuera queda manchado de dedos y trapos muy fácilmente.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ivan smash",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 23, 2024",
                "reviewTitle": "FUncionamiento Perfecto.",
                "reviewText": "En general la marca es de buena calidad y en particular este modelo funciona muy bien, que este en posición horizontal me funciona mejor. en cuanto al funcionamiento muy bien los resultados son muy buenos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 15, 2022",
                "reviewTitle": "Using it everyday!",
                "reviewText": "I was looking for something to replace my older oven in my rental apartment for single use. My main purpose I thought was for the airfry but find that I use the griddle more. Although I don’t cook with a lot of oil, it does leak oil when the unit is flipped up. Not a big issue, but make note not to have it stored on something that may stain. I use it everyday, so a great purchase",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$191.97",
                "sellerName": "ARAS Mart",
                "sellerRating": "4.5"
            },
            {
                "price": "$196.99",
                "sellerName": "Trends Goods",
                "sellerRating": "5"
            },
            {
                "price": "$199.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}