{
    "remaining_requests": 35610,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sharp-Commercial-Microwave-1000-Watts-R-21LCF/dp/B00BDF5ZNS",
    "body": {
        "name": "Sharp R-21LCFS Medium Duty Commercial Microwave (Dial Timer, 1000-Watts, 120-Volts) (Update of R-21LCF),Silver",
        "price": "$300.00",
        "originalPrice": "",
        "rawPrice": 300.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sharp-Commercial-Microwave-1000-Watts-R-21LCF/dp/B00BDF5ZNS",
        "soldBy": {
            "sellerID": "A2BR8O3P4BCKQU",
            "name": "Kitchen Equip",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2BR8O3P4BCKQU&asin=B00BDF5ZNS&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41qtuzAg aL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41CPAU13o-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31d6CDD61sL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wqvkwfAML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SY3BwzkhL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81GwSiPHkzL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81GwSiPHkzL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the SHARP Store",
            "link": "https://www.amazon.com/stores/SHARP/page/58570C33-C65F-4596-8FDA-9843BD17E3F1?ref_=ast_bln"
        },
        "brand": "SHARP",
        "merchantInfo": "Kitchen Equip",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 356,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 57 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SIMPLE TO OPERATE: The classic dial timer can be set anywhere from 10 seconds to 6 minutes and includes bright LED indicators that permits \"at-a-glace\" monitoring.",
            "SPACIOUS INTERIOR: The 1. 0 cu. ft. capacity can accommodate a 13-1/2'' platter, prepackaged foods, single servings or a half-size pan in either direction.",
            "AUTO-CANCEL TIMER: When the door is opened during cooking, the remaining time is cancelled; saving energy and increasing the magnetron's life.",
            "EASY TO MAINTAIN: Stainless steel exterior wrap and interior for easy cleaning and a commercial look.",
            "HEATING TIME GUIDE: A handy \"on-the-spot\" reference for timesaving convenience is located above the timer with recommended times for heating a variety of popular foods."
        ],
        "description": "Sharp is dedicated to improving people's lives through the use of advanced technology and a commitment to innovation, quality, value, and design. The classic dial timer can be set anywhere from 10 seconds to 6 minutes and includes bright LED indicators that permits \"at-a-glace\" monitoring. The 1.0 cubic ft. capacity can accommodate a 13-1/2'' platter, prepackaged foods, single servings or a half-size pan in either direction. When the door is opened during cooking, the remaining time is cancelled; saving energy and increasing the magnetron's life. Stainless steel exterior wrap and interior for easy cleaning and a commercial look. A handy \"on-the-spot\" reference for timesaving convenience is located above the timer with recommended times for heating a variety of popular foods.",
        "breadCrumbs": [
            {
                "name": "Industrial & Scientific",
                "link": "https://www.amazon.com/industrial-scientific-supplies/b/ref=dp_bc_aui_C_1?ie=UTF8&node=16310091"
            },
            {
                "name": "Food Service Equipment & Supplies",
                "link": "https://www.amazon.com/Food-Service-Equipment-Supplies/b/ref=dp_bc_aui_C_2?ie=UTF8&node=6054382011"
            },
            {
                "name": "Restaurant Appliances & Equipment",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18098890011"
            },
            {
                "name": "Commercial Cooking Equipment",
                "link": "https://www.amazon.com/Commercial-Cooking-Equipment/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6054385011"
            },
            {
                "name": "Commercial Microwaves",
                "link": "https://www.amazon.com/Commercial-Microwaves/b/ref=dp_bc_aui_C_5?ie=UTF8&node=5315084011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 20.5 x 16.01 x 12.13 inches; 36.99 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ R-21LCF"
            },
            {
                "name": "Department ‏",
                "value": "‎ Small Appliances"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ June 29, 2004"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Sharp"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00BDF5ZNS"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#38,088 in Industrial & Scientific (See Top 100 in Industrial & Scientific) #4 in Commercial Microwaves"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 356 ratings"
            },
            {
                "name": "Brand",
                "value": "SHARP"
            },
            {
                "name": "Product Dimensions",
                "value": "16.01\"D x 20.5\"W x 12.13\"H"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Capacity",
                "value": "1 Cubic Feet"
            },
            {
                "name": "Special Feature",
                "value": "Timer"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Commercial"
            },
            {
                "name": "Installation Type",
                "value": "Countertop"
            },
            {
                "name": "Wattage",
                "value": "1000 watts"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Included Components",
                "value": "Microwave"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "regular person",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQ4HRFEM5T3FAYGIXRL7P6T3ZEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NRRBRCWIFU62?ASIN=B00BDF5ZNS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2014",
                "reviewTitle": "5.0 out of 5 stars Perfect for My Needs and Personality",
                "reviewText": "I love how well-built this machine is. I like the simple clarity of the timer dial. I love the easy-on-the-ears ring at the end of the cycle. How deep the cavity is. How strong the microwave is. How accurate. I picked this one because it was highly rated, reputed to be durable, simple, functional. That suits me to a T. I'm happy that it's gray on the sides and top and stainless only on the front. I love seeing the remaining time light up -- none of that hard-to-view digital junk. There are slight tactile indentations at the time intervals on what I originally thought was an entirely flat timer on the faceplate. In addition, there are slight \"bumps\" at the time intervals when turning the knob (which is smooth). These tactile indicators are very slight but still discernible to my uneducated fingertips. If I lose my eyesight, I can use those to track the time in the microwave. That the food does not need to rotate is terrific. This machine always gets my coffee, my leftovers, delicate pastries, everything finished evenly and precisely. This Sharp microwave looks really -- well, sharp! For what it is worth, I am an aging woman who always preferred function and durability over trends and designer stuff. This looks better in my book. I've had enough pretty microwaves that took up enormous amounts of counter space and died in less than a year. Thank goodness, this type microwave from Sharp is still available and to individuals, not just to businesses. Please note that the ring at the end is not obnoxious. It cannot be turned off though, so if you're looking for no ring or buzzer at all, look to the next-level-up models. My Sharp says inside the door that it was made in Thailand. The squeeze handle is easy enough for even me with my loss of hand strength to \"grip open\" and boy this door is so much more quiet than the ones on microwaves without handles! I don't wake the family when I warm something in the middle of the night anymore. And one more thing, a family member with cognitive problems is finally able to heat his cup of chocolate by himself -- the functions are that clear.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Gilhooly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDHHYIDQQISXWF34WQFKOWMQSZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R364A04ND3M86H?ASIN=B00BDF5ZNS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2022",
                "reviewTitle": "5.0 out of 5 stars Lasted 4 and Half Years- durable for kids",
                "reviewText": "We bought this as a second microwave because we have five kids who were breaking door push button springs on expensive microwaves from overuse. We were breaking microwaves once a year in our house until this model. We don’t use it for more sophisticated defrosting or sensor cook of vegetables- it really only reheats stuff. If I have a large cold casserole dish it will reheat it when set to the max of 4-6 mins but it’s not super powerful. But it’s perfect for basic reheating, big households, kids- for drinks, soups, oatmeal, potatoes, recipe ingredients, smaller simple stuff. Today it finally died. It may be an internal fuse or a door sensor issue but I feel that getting almost 5 years out of a smaller microwave is probably pretty good for nowadays and we are going to buy a second one before my kids break the door button in the expensive built-on model we have. I like that this sharp doesn’t take up a ton of counter space but still has a large reheating chamber. I like that it has clean brushed stainless steel exterior that looks good in our kitchen and is easy to maintain. The inside is easy to clean as well. It is very simple to operate but gets the job done.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SaRAoRAH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM5HHGMUX4WOMVNNUVHOHKRFIFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MHLG2UQVYZ1U?ASIN=B00BDF5ZNS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2018",
                "reviewTitle": "4.0 out of 5 stars BEST MICROWAVE EVERY",
                "reviewText": "It is more than a standard \"disposable\" microwave, BUT it's so so simple to use, 1/2 page directions vs 5 pages NO CLOCK to RESET every time power goes off, unplugged... NO more flashing zeros. Timer limited to 6 mins, helping to prevent over cooking accidents. No turntable to fail, clean. Inside ceramic and SS easy to clean. Stellar, Fantastic, Best Ever Will buy again. (fyi last heavy duty commercial Sharp MW I got lasted 30 yrs) oh and this is heavy, 2 or 3 x standard disposable MW.(only reason it didn't get 5 stars, first unit arrived DOA, had to return and replace, but Amazon made return so, so, so simple, sent UPS with label next day)",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LimehouseBlues",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP32QMAFIJCPCZLQYQBO5NP6N6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RETTAKS6MWZRC?ASIN=B00BDF5ZNS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2013",
                "reviewTitle": "5.0 out of 5 stars Solid, Easy, Powerful. Quick to clean Perfect for the busy kitchen. No thinking - just dial the time. Phantom load 9 watts.",
                "reviewText": "Here's a microwave with a dial ... no pushbuttons, no fluff. We first tried the Panasonic NE-1022F Commercial Microwave. It's about the same size and feature set; it has a non-electric dial (spring driven?) that worked perfectly; at the end of a cycle the Panasonic rings a mechanical bell. Alas, but that one arrived dented; we returned it for the Sharp.This Sharp microwave is a winner. Simple to use - perfect for a busy household. Turn the knob, and the numbers around the dial light up, showing the timer. Open and close with a handle. That's it - no buttons, no programming, no blinking clock, no thinking.Powerful microwave - gets a cup of coffee hot in 2 minutes. (I measured it: 8 ounces of water in a pyrex cup - got to 205Fin 2 minutes)Easy to clean: There's no rotating carousel, because there's an internal microwave deflector (the microwave standing wave pattern is constanly changing) So you can quickly clean the inside cavity - it's stainless steel on top, back, and sides; white plastic on bottom.Although it spends 99 percent of its time \"off\", it constantly guzzles 9 watts of standby power. So if you use this oven for 15 minutes each day, half your power goes into heating your food, and half and an equal amount is wasted. This phantom power load is more than many other microwaves, and there's no need - it has no electronic display. Sharp - get your act together! (That Panasonic microwave had zero loss to phantom power)Amazon's picture is inaccurate: there is not a digital display at the top.That's news - we're pretty happy with this guy.",
                "reviewVotes": "89 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matt S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 18, 2019",
                "reviewTitle": "Solidly build.",
                "reviewText": "Simple to clean and almost anyone can figure out how to operate it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$300.00",
                "sellerName": "Budget-Supply",
                "sellerRating": "4.5"
            },
            {
                "price": "$300.00",
                "sellerName": "Cook's Direct",
                "sellerRating": "5"
            },
            {
                "price": "$300.00",
                "sellerName": "Kitchen Equip",
                "sellerRating": "4.5"
            }
        ]
    }
}