{
    "remaining_requests": 35683,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Panasonic-Microwave-NN-SN936B-Countertop-Technology/dp/B01DEWZWGC",
    "body": {
        "name": "Panasonic Microwave Oven NN-SN936B Black Countertop with Inverter Technology and Genius Sensor, 2.2 Cubic Foot, 1250W",
        "price": "$299.95$224.13",
        "originalPrice": "$299.95",
        "rawPrice": 299.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Panasonic-Microwave-NN-SN936B-Countertop-Technology/dp/B01DEWZWGC",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07YD4QNYX"
        ],
        "asinVariationValues": [
            {
                "asin": "B01DEWZWGC",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$299.95",
                "variationImageURL": "https://m.media-amazon.com/images/I/31ID8nK54cL._SS36_.jpg"
            },
            {
                "asin": "B000H7AZ06",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$299.95",
                "variationImageURL": "https://m.media-amazon.com/images/I/31FvGYngoxL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31ID8nK54cL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Q8aMehFdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/318DrdFG2OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xDcG0uH7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 XkF1J85L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DBo79Y5NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71pzJ2TfMiL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Panasonic Store",
            "link": "https://www.amazon.com/stores/Panasonic/page/F6906AE2-27F4-463F-8810-41DB8D93F02B?ref_=ast_bln"
        },
        "brand": "Panasonic",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 4714,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 8 hrs 12 mins",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Panasonic Microwave: This 1250 Watt high power, 2.2 cubic foot capacity black countertop microwave delivers a seamless stream of cooking power for even cooking and delicious flavor",
            "Inverter Technology with Turbo Defrost: Patented Inverter Technology generates a seamless stream of power and delivers consistent, evenly prepared food without overcooking; Advanced Inverter Turbo Defrost speeds up defrosting time. Power Source 120V / 60Hertz. Power Consumption 1460W",
            "Large Family Size: This countertop microwave with 16 1/2 inch turntable is thinner, lighter and more efficient, allowing you to devote less space to electronics and more to interior capacity; Internal dimensions (H x W x D): 10 15/16 inch x 18 7/16 inch x 18 1/2 inch",
            "Smart Cooking Settings with Genius Sensor: Built in automatic Genius Sensor adjusts power and times based on different foods; Other advantages include 14 preset menu items, quick minute timer, delay start and child safety lock",
            "Keep Warm Feature: This inverter microwave keeps soups, gravies or desserts warm and fresh until ready to serve. Clock: 12 H"
        ],
        "description": "This 2. 2 cu Ft. Large microwave oven features Panasonic patented Inverter technology engineered for even cooking and delicious results - no more overcooked edges or cold centers. Inverter technology delivers microwave energy in a way that allows delicate foods to simmer without overcooking. Foods retain more Color, texture and nutrients for fast, easy and delicious results. The Panasonic nn-sn936b offers 1250 watts of high cooking power and 14 preset auto cook menu items (sensor cooking Chart included in manual). one-touch genius sensor cook and reheat functions, takes the guesswork out of microwaving by automatically setting power levels and adjusting cooking or reheating time. Other highlights include a membrane keypad Inverter Turbo defrost technology, 10 power levels, popcorn button, keep warm mode, delay start, timer, quick 30Sec, 15\" Turntable and more/less control. The countertop microwave oven measures 23 7/8\" W x 14\" H x 19 7/16\" D and has a glossy Black finish. As a countertop microwave, The Panasonic nn-sn936b can rest on any open surface in the kitchen and can be easily moved. For a finished built-in look, order trim kit For 27” cabinet (Panasonic part # nn-tk922ss) or Trim kit For 30” cabinet (Panasonic part # nn-tk932ss) and install directly into pre-existing cabinetry space. Disclaimer: upper-inside left corner of microwave oven door has a small indentation to allow door to open smoothly. Do not store flammable materials next to, on top of, or in the microwave oven.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Microwave Ovens",
                "link": "https://www.amazon.com/Microwave-Ovens-Small-Appliances/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289935"
            },
            {
                "name": "Countertop Microwave Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3741631"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "16\"D x 18\"W x 7\"H"
            },
            {
                "name": "Item Weight",
                "value": "37 Pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Panasonic"
            },
            {
                "name": "ASIN",
                "value": "B01DEWZWGC"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "NN-SN936B"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 4,714 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,921 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #31 in Countertop Microwave Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "March 25, 2016"
            },
            {
                "name": "Capacity",
                "value": "2.2 Cubic Feet"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Wattage",
                "value": "1250 watts"
            },
            {
                "name": "Brand",
                "value": "Panasonic"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Special Feature",
                "value": "Safety Lock"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Residential"
            },
            {
                "name": "Installation Type",
                "value": "Countertop"
            },
            {
                "name": "Material",
                "value": "Aluminum"
            },
            {
                "name": "Included Components",
                "value": "One (1) Microwave Oven"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Panasonic Microwave Oven NN-SN936B Countertop with Inverter Technology Equipped with 1200-Watts of power, a 1.2-cubic-foot capacity and Panasonic Inverter Technology, this microwave oven delivers fast, even cooking and delicious results.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/dc07c042-5784-4d8a-bd75-bae79ee82196._SR970,300_.jpg"
                ]
            },
            {
                "media_text": "Microwaving Has Evolved 14 Auto Cook Options Dedicated Settings for All of Your Favorite Foods Frozen Entrees and Vegetables Soup Oatmeal Pizza Pasta and more 1 Touch Controls Popcorn, Sensor Reheat, Turbo Defrost, Keep Warm. A Steady Stream of Cooking Power for Even Results Inverter Technology for Constant Cooking Power and Shorter Cooking Time Panasonic’s Inverter Technology generates a steady stream of power at all temperature settings. Shorter cooking time along with consistent, evenly prepared food — edges to center — across a wide range of cooking techniques. Poach, Braise and Steam to Perfection Inverter Technology delivers microwave energy in a way that allows delicate foods to simmer without overcooking. In addition, foods retain more color, texture and nutrients for fast, easy and delicious results.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/f4786bb3-dbd6-45c8-a47d-dfb9a49ead54._SL300__.jpg"
                ]
            },
            {
                "media_text": "Maximum Interior, Minimum Footprint The smart, compact design of the Panasonic NN-SN651B Inverter power unit devotes less space to electronics and provides far more interior capacity. The 1.2-cubic-foot capacity with 13.4-inch turntable is ideal for accommodating breakfast foods, after-school snacks, dinnertime meals and appetizers when entertaining. The smaller, more efficient energy and control units are also up to eight pounds lighter than conventional microwave components. All of which adds up to more interior space, while taking up less space on a counter.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/6bab510c-7df4-4c8a-8e61-9644fde4cafc._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Ease of Use Features Intelligent, Intuitive Controls Provide a High-End Look A sleek, touch-button control panel and four-digit display provide a high-end look, with one-touch sensor cook and reheat. Turbo Defrost Thaws Food Quickly and Evenly Advanced Inverter Turbo Defrost utilizes a microwave sequencing system based on the Inverter's continuous-power delivery method to thaw foods more evenly and quickly. Keep Warm Feature Maintains Food Temperature Keep foods like vegetables, soups, hors d'oeuvres, gravies, sauces and desserts warm and delicious in the oven until they're ready to serve. Modern Convenience for Versatile Food Preparation More advantages include a quick single-minute timer that lets you set cooking and reheating times in single-minute intervals, delay start feature and child safety lock.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/929934e2-07ac-44fc-b637-a18c212f8ba4._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/5ebab503-65d6-4090-9829-c9b144371683._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/6091da84-d9e5-46aa-881a-7819eeee9e9b._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/c1c156d9-ba5f-4bb3-9943-b7f4f863cee6._SL220__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/dc07c042-5784-4d8a-bd75-bae79ee82196._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/f4786bb3-dbd6-45c8-a47d-dfb9a49ead54._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/6bab510c-7df4-4c8a-8e61-9644fde4cafc._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/929934e2-07ac-44fc-b637-a18c212f8ba4._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/5ebab503-65d6-4090-9829-c9b144371683._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/6091da84-d9e5-46aa-881a-7819eeee9e9b._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/c1c156d9-ba5f-4bb3-9943-b7f4f863cee6._SL220__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BW & ABAPBW & ABAP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH36IUSEILMOIK5QETEPGO6QDZNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFYKP8OQ8RSUM?ASIN=B01DEWZWGC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Panasonic NN-SN936W is large, works well, but controls are ancient",
                "reviewText": "I got this microwave in white color because all our appliances in the kitchen are of white color. Finding appliances in white color is becoming harder over the years. We're not willing to replace all our appliances and we're not willing to mix and match. So, we struggle to find the best white ones and compromise on a lot of things.Our previous microwave (Whirlpool) was in a cabinet and had trim kit. That microwave gave a lot of trouble over the years and we finally got tired of getting the repairs done. I temporarily bought a cheap microwave from a local B&M store for interim use until we find a suitable microwave.All our search was unsuccessful. White color, trim should be available, and everything should fit well within the cabinet space. We settled for this Panasonic microwave even though it doesn't come with a trim and it is plain and simple without any modern amenities. I had to add a piece of wood to the cabinet to cover a gaping hole, but at least I didn't have to hire a professional.Positives:+ Large. Quite large in fact.+ Powerful enough. Heats up quite fast due to the inverter technology.+ Inverter technology works well.+ Genius Sensor works very well and cooks vegetables just perfect+ Tiny LED light inside provides a lot of lightNegatives:- Old school. It doesn't even have quick time buttons. if you want 2 minutes, you have to press 2,0,0,start. Even the 30 second quick button requires to press the start button afterwards. The cheap interim microwave was lot more user friendly.- Closing the door make a lot of noise. Very useful if you want to wake up the household in the morning. I found a trick to reduce the noise: keep the door open button pressed while closing the door and release it after closing the door.- No fancy functions offered by newer microwave ovens available in the market- When the heating cycle is completed, it insists on making 5 beeps. Opening the door won't stop that. No way to silence it.We are very happy with this unit because (1) it satisfies most of our needs, (2) reasonably priced, and (3) works very well.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wkEXU51EL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr. Jay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETVKHYSXLEQVQJNHDA4U4THJCDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YEI257MC8O3R?ASIN=B01DEWZWGC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 13, 2021",
                "reviewTitle": "5.0 out of 5 stars Inverter feature is absolutely fantastic",
                "reviewText": "This microwave works extremely well and has a couple pitfalls as well.Pros1) Inverter feature does what is promised. The middle/center of any cooked or reheated foods is as hot as the perimeter almost always. I’m especially impressed with ability this has to accomplish this result with frozen foods.2) I rarely if ever overcook or burn popcorn. The popcorn setting works with a sensor and it does a great job.3) Works well for melting items such as butter. It did take a few tries to figure out best way, though. I now know Power Level 2 and 42 seconds melts two tablespoons of butter perfectly. No exploding.4) Reheat sensor works very well. I tend to forget that I have something in Microwave when I’m working on a meal. This reheat sensor saves the day.5) The auto cook feature for heating soups or making baked potatoes is awesome. Sensor works well so items are usually cooked well. Not over or under done.6) inside is very spacious. Rarely do I have a casserole dish that’s too large to allow the turntable to keep spinning.7) inside is relatively easy to clean. I usually soak some paper towels with dish soap, pop it in the microwave and heat for 30-45 seconds. This really loosens up hard stains. Wipes off easily with this trick.8) The “keep warm” feature is really the bomb! Forget the need for a fancy schmantsy oven warming drawer. This does the trick just fine!9) Defrost feature is excellent with the inverter technology. I find meats don’t start to cook on the edges or leave the center rock solid, as often as I’d have with a standard microwaveCons:1) The auto cook feature relies on 1-14 and unfortunately this requires you to remember what 1 or 3 or 7 does. Unless you post a list in a cabinet door as I finally did that “5” is for potatoes, etc.2) You really need to prepare yourself for the extra heating power this brings. Don’t recommend keeping Tupperware-type lids sealed on bowls, etc when using this microwave. More than once, we have been scared of all our daylights when a lid explodes off a dish. And that can get messy.3) The exterior door could be made of thicker plastic. I find it to be a tad flimsy but not awful or overtly cheap, either.I hope this review is helpful to those making a purchase decision. While I realize this microwave is less than perfect, for the price paid I’m very satisfied. I also wrote this review after owning this for a while, so I could assuredly say this is a reliable machine, at a great value, for what it promises to do!",
                "reviewVotes": "61 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "arthur martin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 12, 2020",
                "reviewTitle": "Buen producto y muy complaciente en espacio",
                "reviewText": "Pues como siempre no da nada de que hablar es excelente producto ya había tenido uno hace años se descompuso por una sobrecarga de luz pero jala excelente igual que el anterior",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 11, 2021",
                "reviewTitle": "It’s as advertised",
                "reviewText": "As advertised",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martha Ventura Sabido",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 15, 2021",
                "reviewTitle": "todo llego excelente!!!!",
                "reviewText": "estuvo muy bien el producto y al igual el servicio por parte del proveedor fue excelente !!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rafael León Marchena",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 17, 2021",
                "reviewTitle": "Trabaja bien",
                "reviewText": "Todo bien, calienta los alimentos súper bien, lo único que le veo de detalle es que en el táctil de los números tiene como un plástico que los recubre que al mes de uso ya se despego y pareciera como si estuviera pelado del botón, pero hasta el momento es el único detalle, funciona bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 30, 2020",
                "reviewTitle": "Lo recomiendo solo para uso ocasional.",
                "reviewText": "The media could not be loaded. Escogí este modelo por que era el único de tamaño grande (2.2) que costara menos de $500 dólares pero desgraciadamente se nota lo \"económico\" en los materiales. El WiFi y bluetooth dejan de funcionar cuando se usa el microondas, parece simple pero esto ha dado MUCHOS problemas. Todo el plástico se siente ligero, delgado y frágil. La puerta al cerrarla suena como resortes de cama vieja. La ventana en la puerta tiene plástico y llegó hundido, abollado. Con uso NORMAL se dañó un botón de la superficie. No noto ninguna mejora de desempeño en comparación con mi anterior micro del 2008 (en serio ).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81CDt44dgBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81KxJ2HBm2L.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/91wnTUNBYjS.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}