{
    "remaining_requests": 35414,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Panasonic-Compact-Microwave-Cooking-Popcorn/dp/B07PML2DC6",
    "body": {
        "name": "Panasonic NN-SN65KW Microwave Oven with Inverter Technology, 1200W, 1.2 cu.ft. Small Genius Sensor One-Touch Cooking, Popcorn Button, Turbo Defrost-NN-SN65KW-(White)",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Panasonic-Compact-Microwave-Cooking-Popcorn/dp/B07PML2DC6",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "30",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31ZPS5vZb6S.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41JwqTP-YNS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QBEnuHdaS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sFRxB2T6S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Esf7hvreS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61lQcOMLdxS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71pzJ2TfMiL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Panasonic Store",
            "link": "https://www.amazon.com/stores/Panasonic/page/F6906AE2-27F4-463F-8810-41DB8D93F02B?ref_=ast_bln"
        },
        "brand": "Panasonic",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1100,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Microwave Cooking Made Easy: 1200W white microwave with 11 power levels, smart controls, 3-level popcorn button, and more for easy cooking of dinner and snacks",
            "Even Cooking and Reheating for Delicious Food: Panasonic’s patented Inverter Technology generates a seamless steam of cooking power for evenly heated foods, edges to center",
            "Smarter Cooking: Genius Sensor takes the guesswork out of cooking but automatically adjusting power and cooking time; Includes 10 sensor cook settings; sensor reheat warms leftovers evenly",
            "More Features to Enjoy: Inverter Turbo Defrost accelerates thawing time; 15 Auto Cook Options, Keep Warm and more",
            "Space-Saving Design: Countertop microwave with 1.2 cu.ft. easy-clean interior houses 13.4” turntable but maintains a small external footprint to maximize counterspace"
        ],
        "description": "Enjoy versatile cooking power with the 1200W, space-saving 1.2 cubic-foot Panasonic NN-SN65KW Compact Microwave Oven, perfect for any kitchen or dorm room. Its sleek design includes a smart touch control panel to make it easy to cook a variety of foods, plus reheat and defrost for the taste, texture and nutrients you want. Unlike traditional microwave ovens that use pulse-on, pulse-off power to cook foods, Panasonic's Inverter technology creates a seamless, continuous stream of cooking power to evenly heat and prepare foods, with no cold spots. The high-power Panasonic NN-SN65KB countertop microwave also includes Genius Sensor Cook and Reheat to take the guesswork out of heating meals, leftovers and snacks plus 15 auto cook options to effortlessly prepare foods like oatmeal, omelets and more. The 3-level popcorn button lets you choose the popping temperature and time for different bag capacities and a useful Keep Warm setting keeps gravies, vegetables, dinner rolls and more warm for up to 30 minutes until ready to serve. This Panasonic white microwave externally measures 12 1/4-inch (H) x 20 11/16-inch (W) x 15 13/16-inch (D) with the spacious internal cavity measuring 9 15/16-inch (H) x 13 15/16-inch(W) x 14 1/8-inch with a 13.4-inch turntable.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1/000-0000000-8675309?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2/000-0000000-8675309?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3/000-0000000-8675309?ie=UTF8&node=289913"
            },
            {
                "name": "Microwave Ovens",
                "link": "https://www.amazon.com/Microwave-Ovens-Small-Appliances/b/ref=dp_bc_aui_C_4/000-0000000-8675309?ie=UTF8&node=289935"
            },
            {
                "name": "Countertop Microwave Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5/000-0000000-8675309?ie=UTF8&node=3741631"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "1.2 Cubic Feet"
            },
            {
                "name": "Special Feature",
                "value": "Auto Cook, Defrost"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Vegetable"
            },
            {
                "name": "Installation Type",
                "value": "Countertop"
            },
            {
                "name": "Wattage",
                "value": "1200 watts"
            },
            {
                "name": "Ventilation Type",
                "value": "Ductless"
            },
            {
                "name": "Controller Type",
                "value": "Touch"
            },
            {
                "name": "Power Consumption",
                "value": "1200 Watts"
            },
            {
                "name": "Voltage",
                "value": "110 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Frequency",
                "value": "50 Hz"
            },
            {
                "name": "Lock Type",
                "value": "Child Lock Available"
            },
            {
                "name": "Number of Power Levels",
                "value": "11"
            },
            {
                "name": "Timer Function",
                "value": "Timer Function Available"
            },
            {
                "name": "Energy Consumption",
                "value": "1200 Watts"
            },
            {
                "name": "Number of Programs",
                "value": "15"
            },
            {
                "name": "Heating Method",
                "value": "Speed (Microwave)"
            },
            {
                "name": "Defrost System",
                "value": "Auto Defrost"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,100 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#118,334 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #124 in Countertop Microwave Ovens"
            },
            {
                "name": "Brand",
                "value": "Panasonic"
            },
            {
                "name": "Included Components",
                "value": "Microwave, Turntable"
            },
            {
                "name": "Model Name",
                "value": "Microwave Oven with Inverter Technology, 1200W, 1.2 cu.ft."
            },
            {
                "name": "Model Number",
                "value": "NN-SN65KW"
            },
            {
                "name": "Product Dimensions",
                "value": "15.8\"D x 20.7\"W x 12.2\"H"
            },
            {
                "name": "Item Weight",
                "value": "28.7 Pounds"
            },
            {
                "name": "Color",
                "value": "White"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Sleek, Smart, Versatile Cooking Power Enjoy the power, speed and convenience of delicious, evenly prepared foods using Panasonic's Inverter cooking, 15 Sensor Cook Settings, Sensor Reheat and more with the compact NN-SN65KW Microwave.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a8eb178-cb8a-40d5-a7cf-1a51a0689e51.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "The Inverter Advantage Unlike microwaves that use a pulse-on, pulse-off power flow to prepare foods, Inverter technology evenly heats foods — with no cold spots— at all 11 power levels from the lowest to the highest. Eliminate the Guesswork As foods cook or reheat, Genius sensors continually measure the amount of emitted steam to continually adjust remaining cooking and reheating time for flavorful results.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ef9506d-f5f7-424b-add6-976085b41300.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3d5a3af-d9bc-4a22-bb78-0d170374d553.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            },
            {
                "media_text": "Sensor Cook Settings Genius Cook prepares nutrient-rich foods with the perfect heating levels and times with 15 settings for sensor reheat, oatmeal, potatoes, soup, breakfast sausage, omelet, fresh vegetables and 8 more. Popcorn Lovers Rejoice With the 3-level popcorn button, popcorn lovers can choose the optimal popping temperature and time for different microwave bag capacities (3.2, 2.7, or 1.5 oz.) for hot, sumptuous snacking.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e6371946-044a-48b1-96ad-270afa6682c7.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c8a660fb-2bbc-44c8-a0f2-f04480c31ba1.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            },
            {
                "media_text": "Make delicious cooking a simple pleasure of everyday life. Experience Fresh conveys a lifestyle kept healthy with advanced, push-button easy microwave ovens, rice and slow-cookers, and other Japanese-designed appliances. A lifestyle that blends the joy of health and creativity with good food and sharing.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4df1783-d298-4bec-a339-1f06776758c9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a8eb178-cb8a-40d5-a7cf-1a51a0689e51.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c54ce439-79f1-448e-9a47-9cc7338fbd9d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ef9506d-f5f7-424b-add6-976085b41300.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3d5a3af-d9bc-4a22-bb78-0d170374d553.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e6371946-044a-48b1-96ad-270afa6682c7.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c8a660fb-2bbc-44c8-a0f2-f04480c31ba1.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4df1783-d298-4bec-a339-1f06776758c9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ralph_S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKFOR45KVH3EMS5LV7JP6ETG2QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RTQD1L2LTYUR?ASIN=B07PML2DC6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Works well",
                "reviewText": "Panasonic NN-SN65KW Microwave Oven, Inverter, 1200W, 1.2 cu.ft., Sensor.Sold by Amazon and shipped by Amazon.Summary: After 5 weeks of use, I am quite satisfied with this microwave, and I would buy it again. Remove the plastic film on the keypad. The beep can be turned off. Sensor heating works well for me. Illumination is adequate. The door button and door work well. Sound level fine. My previous experience with durability of Panasonic products has been quite good, so I am cautiously optimistic about this microwave.Protective film on keypad: After you receive the oven and confirm that it runs, remove the protective film that covers the keypad. You can use a piece of tape on the corner of the keypad to pull off the protective film. If you don't remove the protective film, it will deform gradually because it is relatively soft. Removal instructions are in the manual, on page 24, under \"7. Control Panel.\"Keypad: Using the keypad requires pressing with the tip of your finger (not your fingernail) on the centers of numbers or commands. The keypad will not respond to pressing off-center on a number or command. In practice, this has not been a significant problem. Removing the protective film may help.Beep: When you plug the microwave into an electrical outlet, you will have an opportunity to turn off the microwave's beep, using instructions on page 11 in the manual. To summarize, press Start twice, then press Timer (More) to cycle between Beep On and Beep Off, and finally press Stop/Reset to confirm the setting. (Here, I skipped over the option to change between Imperial and Metric weight systems.) I leave the beep turned off, yet I notice when the microwave stops running. I sometimes forgot when the beep was audible; perhaps I had beep overload.Power levels: My oven cycles between power levels every few seconds when I use keypad power level 1 or 2. With sensor heating at higher power levels, the microwave sound includes a low-pitched hum every few seconds. However, the output power doesn't appear to cycle; water boils at the same rate with or without the hum. Sensor heating works well for me; I mostly use sensor level 8 to cook whole grains in a glass bowl without a lid, to prevent boiling over.Illumination: The LED doesn't have a cover to diffuse the light, but the light nonetheless adequately illuminates the food. I had assumed that the gray interior would make viewing food difficult, but that hasn't been a problem.Door: . The door button operates easily and quietly. To close the door silently, I press the door button and gradually release it while I close the door. . After microwaving, I keep the door open until any condensation on the door has evaporated. . If the door is opened fully, a spring-loaded detent tries to keep the door open. (Car doors operate in the same manner.) Make sure the door is opened fully before inserting or removing something from the oven, or the detent spring will push the door partly closed.Thoughts about durability: . The statement below is printed on the box; I'm not sure how to interpret the second line: \"Manufactured by Panasonic Appliances Microwave Oven (Shanghai) Co., Ltd. Shanghai, China, MADE IN CHINA\" . The microwave was shipped in the Panasonic box only. Something banged into the box but did not penetrate it; the microwave did not appear to be affected. . I used my previous Panasonic microwave (model NN-T664SF) for 17 years, until the turntable gearing began to growl occasionally. I had been careful to press the door button while closing the door, to prevent the door from banging shut. I was quite pleased with that microwave and its longevity.",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKSFN4NCQCXWAEFOJ3WPLTT22MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUGXGULG1OZ54?ASIN=B07PML2DC6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Reheat leftovers without food exploding!",
                "reviewText": "I've been waiting for an excuse to buy an inverter microwave, so after fixing our old microwave twice and experiencing yet another breakdown, I bought this. Being able to actually reduce the cooking power instead of how traditional microwaves cycle on and off (PWM) is huge. I can reheat fish on low power without the fish blowing up. I can defrost without cooking the item. Some concerns I've read in the reviews:-It's loud: I guess the fan is louder than most others, but I wouldn't have noticed it had I not already expected it. In my opinion, not an issue.-It interferes with WiFi: I tested this and it really screwed up communication with a tablet over WiFi. But there seems to be a fix! If the WiFi connection is on 5.8GHz, it shouldn't be affected. But if it's on 2.4GHz, force the WiFi router to use channel 1. I had it on 6 at first, but 1 was totally unaffected.-The inside is dark because it's painted gray and not white: True, but I don't find this to be a big issue. I can still see the item inside well enough.A few other picky things:-A Toshiba inverter microwave I've used lets you change the power while it's running, and this doesn't. Cool feature but not necessary.-To set the power, you press the button multiple times to get to the power level you want. That seems strange, but it's how it works.-Pressing the \"Quick 30\" doesn't immediately start cooking like I'm used to. You have to push Start.-I measured the power consumption through the power cord and while it appears power levels 30% and higher do truly cook continuously at reduced power, it's seems 20% and less still cycle on and off at 30% power level. Perhaps the designers had trouble getting below 30% in a reliable manner. A minor detail some may be interested in.Otherwise, generally well made and powerful on 100% power. I just hope it's reliable with the extra complexity in these compared with traditional microwaves which have exactly four components in the microwave generator circuitry. An inverter like this one adds in a bunch of extra electronics. Regardless, I wouldn't go back to a traditional microwave unless I'm only using it to heat water or making hot cereal.Regarding this being a 1.2 cubic foot size versus larger 1.6 cubic foot: I compared this with my old 1.6 cu-ft over-the-range microwave and not only is the turntable in the Panasonic larger, but the microwave interior is taller. So all that extra space in the 1.6 cu-ft is of no use if the item doesn't fit on the turntable!I do wonder how many complaints about total failure are related to insufficient airflow. Another review on Amazon (\"Unit failed in less than a year\") claims they've had two fail, yet the photo they included in the review CLEARLY shows the microwave in a very tight cabinet with no airflow. That's how you destroy something like this. The user manual states a certain amount of required free space on the sides and top for cooling.",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSHR3XWMSRW4C35U6AAYBJ3MXKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7A3LNB2BV473?ASIN=B07PML2DC6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Convenient but strange",
                "reviewText": "Our microwave bit the dust after 14 years and I couldn't find one locally, so I ordered this. It's the right size and seemed to have good features. I like it okay, but it needs serious improvement. For example, if you want to use \"keep warm\" you literally have to press a button ELEVEN TIMES. That is CRAZINESS. Why not just be able to use the key pad? And the NOISE. It is extremely noisy. I did read in reviews though that this is the case, so I know there isn't anything wrong with the machine itself. The kitchen timer, which I use a lot, depend on, is pretty useless. Five pale beeps and it just goes back to the time of day. If you miss it, you miss it, and when I miss it, I FORGET the thing I was timing. Like FOOD or LAUNDRY. LOL But, it is very attractive. The \"push-in\" to open is very quiet and easy, and unlike some people in the reviews, I don't find the buttons to be hard to use at all. It's just that you have to do SO much button-pushing.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "aidee p.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 6, 2023",
                "reviewTitle": "Esta bien",
                "reviewText": "Llegó bien buen tamaño",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}