{
    "remaining_requests": 35685,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sharp-R-21LCFS-Medium-Duty-Commercial-1000-Watts/dp/B074RCGYLB",
    "body": {
        "name": "Sharp R-21LCFS Medium-Duty Commercial Microwave Oven with Dial Timer, Stainless Steel, 1000-Watts, 120-Volts, One Size",
        "price": "$300.00",
        "originalPrice": "",
        "rawPrice": 300.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Medium-Duty-Commercial-Microwave-Stainless-1000-Watts/dp/B09T9M8432",
        "soldBy": {
            "sellerID": "A206VM5TOE3FA2",
            "name": "Restaurant Solutions Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A206VM5TOE3FA2&asin=B074RCGYLB&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09T9M8432"
        ],
        "asinVariationValues": [
            {
                "asin": "B074RCGYLB",
                "variationName": "Style",
                "variationValue": "Oven",
                "price": "$300.00",
                "variationImageURL": ""
            },
            {
                "asin": "B0CCS749X4",
                "variationName": "Style",
                "variationValue": "Oven + Toaster Oven",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "6",
        "stockDetail": "Only 6 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51NJxrwr5 L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51AzdbWbp9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KmCZWoxCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QVoG6nBaL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71kvERNJ2fL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1FHR1vMxwS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the SHARP Store",
            "link": "https://www.amazon.com/stores/SHARP/page/58570C33-C65F-4596-8FDA-9843BD17E3F1?ref_=ast_bln"
        },
        "brand": "SHARP",
        "merchantInfo": "Restaurant Solutions Inc",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 459,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SIMPLE TO OPERATE: The classic dial timer can be set anywhere from 10 seconds to 6 minutes and includes bright LED indicators that permits \"at-a-glace\" monitoring.",
            "SPACIOUS INTERIOR: The 1.0 cu. ft. capacity can accommodate a 13-1/2'' platter, prepackaged foods, single servings or a half-size pan in either direction.",
            "AUTO-CANCEL TIMER: When the door is opened during cooking, the remaining time is cancelled; saving energy and increasing the magnetron's life.",
            "EASY TO MAINTAIN: Stainless steel exterior wrap and interior for easy cleaning and a commercial look.",
            "HEATING TIME GUIDE: A handy \"on-the-spot\" reference for timesaving convenience is located above the timer with recommended times for heating a variety of popular foods."
        ],
        "description": "Sharp is dedicated to improving people's lives through the use of advanced technology and a commitment to innovation, quality, value, and design. The classic dial timer can be set anywhere from 10 seconds to 6 minutes and includes bright LED indicators that permits \"at-a-glace\" monitoring. The 1.0 cu. ft. capacity can accommodate a 13-1/2'' platter, prepackaged foods, single servings or a half-size pan in either direction. When the door is opened during cooking, the remaining time is cancelled; saving energy and increasing the magnetron's life. Stainless steel exterior wrap and interior for easy cleaning and a commercial look. A handy \"on-the-spot\" reference for timesaving convenience is located above the timer with recommended times for heating a variety of popular foods.",
        "breadCrumbs": [
            {
                "name": "Industrial & Scientific",
                "link": "https://www.amazon.com/industrial-scientific-supplies/b/ref=dp_bc_aui_C_1?ie=UTF8&node=16310091"
            },
            {
                "name": "Food Service Equipment & Supplies",
                "link": "https://www.amazon.com/Food-Service-Equipment-Supplies/b/ref=dp_bc_aui_C_2?ie=UTF8&node=6054382011"
            },
            {
                "name": "Restaurant Appliances & Equipment",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18098890011"
            },
            {
                "name": "Commercial Cooking Equipment",
                "link": "https://www.amazon.com/Commercial-Cooking-Equipment/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6054385011"
            },
            {
                "name": "Commercial Microwaves",
                "link": "https://www.amazon.com/Commercial-Microwaves/b/ref=dp_bc_aui_C_5?ie=UTF8&node=5315084011"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "1 Cubic Feet"
            },
            {
                "name": "Special Feature",
                "value": "Dial Timer"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Commercial"
            },
            {
                "name": "Installation Type",
                "value": "Countertop"
            },
            {
                "name": "Wattage",
                "value": "1000"
            },
            {
                "name": "Ventilation Type",
                "value": "Vented Microwaves"
            },
            {
                "name": "Controller Type",
                "value": "Electronic Dial"
            },
            {
                "name": "Power Consumption",
                "value": "1000 Watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Dial"
            },
            {
                "name": "Frequency",
                "value": "50 Hz"
            },
            {
                "name": "Lock Type",
                "value": "Child Lock Available"
            },
            {
                "name": "Timer Function",
                "value": "Timer Function Available"
            },
            {
                "name": "Energy Consumption",
                "value": "1000 Watts"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 459 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,734 in Industrial & Scientific (See Top 100 in Industrial & Scientific) #1 in Commercial Microwaves"
            },
            {
                "name": "Brand",
                "value": "SHARP"
            },
            {
                "name": "Included Components",
                "value": "1"
            },
            {
                "name": "Import Designation",
                "value": "Made in US"
            },
            {
                "name": "Model Name",
                "value": "Sharp R-21LCFS"
            },
            {
                "name": "Model Number",
                "value": "R-21LCFS"
            },
            {
                "name": "Product Dimensions",
                "value": "16\"D x 21\"W x 12\"H"
            },
            {
                "name": "Item Weight",
                "value": "37 Pounds"
            },
            {
                "name": "Color",
                "value": "Gray"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEAEG5W43J4HTYNSQPFMJBPJMAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10QVLHH6HWTTK?ASIN=B074RCGYLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2022",
                "reviewTitle": "5.0 out of 5 stars Best microwave I've ever used",
                "reviewText": "The cooking is very even, more even than any other microwave I've ever used. I was initially concerned that there isn't a \"defrost\" mode or any way to reduce the power, but since the heating is so even, it actually defrosts things much more gently (with less risk of hot spots) on full power than my old turntable microwave did on its lowest power levels. The even heating also results in less splattering, and the lack of hot or scorched spots makes foods come out much better. Some foods that I used to avoid microwaving (because I didn't like the scorched or overheated spots, or bits of food that pop or explode) are now fine to microwave.I love the simplicity of the controls. It is very easy to use, and easy even for people who tend to be forgetful. If you take food out and then close the door, it doesn't start running again. The dial is quick and easy to operate, so its very easy to add time if you actually do want to cook something longer.The bottom inside is smooth (no turntable) and easy to clean, and everything appears to be very well built. I don't see any parts that look like they would be easy to damage or wear down, so I expect it to last a long time. I had an issue with an older microwave (different brand) that had a push button to release the door, and one day after only a little over a year of use, the push button door release just stopped working and there was no obvious way to fix it. This microwave has a much more robust door latch mechanism that looks like it should last a long time.I will update this review if anything changes, but so far, after using two of these for a few months, I have every expectation that they will still be going strong many years from now.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "acemum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUZGVNEZK3IRR6GYU7CDYYFFTAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4IHMARU5EKXJ?ASIN=B074RCGYLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2023",
                "reviewTitle": "5.0 out of 5 stars no annoying turn table",
                "reviewText": "a simple great quality microwave. extremely easy to clean. this one does not require a annoying turn table. you have more options of what size dish you can use.. this shuts off after opening the door and does not proceed with the time previously set so you should be aware of that. the advantage of that IMO is it does not continue to operate if you remove the dish. you will need to reset the time if you wish to cook more. simple controls. I use a microwave mostly for reheating. I rarely cook in it so this serves my needs. you can of course cook in it. if you are looking for all the bells and whistles, this is not it. I have never used all the weird options on previous microwaves. I prefer this straight forward simple basic style. the quality is excellent.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MikeMike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHKTZ3U6YWQZM4I6PV6E6BYRVMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28LU49P9VMLBG?ASIN=B074RCGYLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Change your product pictures",
                "reviewText": "Update: great microwave, heats evenly, simple to use and clean.Too early to tell if we like this unit yet. Purchased because of the reviews, and the stainless interior. On Amazon the pictures show a stainless interior including the bottom. What we received has a ceramic insert that has sealant on the seams. We steam a lot of vegetables, the stainless was a selling point after the bottom on our current (still working) one started having rust issues under the paint. We shall see seems well built.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61gXXuFVa0L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "BrianBrian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGYZXKMWHZLJPJARAMXGCF4KXNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GDDHVV8TOA4G?ASIN=B074RCGYLB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2021",
                "reviewTitle": "4.0 out of 5 stars Door handle broke after less than 2 years",
                "reviewText": "Overall I'm pleased with this microwave oven. It's a no-frills, simple design I learned about when they got one for the break room at work. It's roomy enough for standard needs... cup of coffee, pot of soup, popcorn, dinner plate, etc. Controls are simply one dial with lighted numerals to stand for minutes or seconds if it's under 1 minute. The lights \"count down\" as it's cooking, so you know how long is left. This is also a great method to figure out what time is best and choose that precise time again later. Sure, you can do that with a digital readout, but with this oven it's just a quick spin of the dial and done. Takes less than a second. The dial offers very little resistance. It spins not freely enough to keep going when you let go, but very easily so dialing in the time is effortless. It does not move as it counts down, so this is an electronic process and not mechanical (to my knowledge). It's 1000 watts, so it has plenty of cooking power.I had to remove some stars, unfortunately, because 1 year 7 months after purchasing this the door handle broke. I like the design of the door handle, but it has some vulnerable parts inside. The door latches closed and the microwave will not turn on unless the door is closed. This is a safety feature. Also if you close the door and don't activate the microwave for a while, it times out and will not power on unless you open and close the door again. Nice safety feature so you don't accidentally cook your food twice if you're absent-minded. The handle latches closed and to open it you squeeze the door handle. It's not exactly intuitive, so new users may just grab and pull until they learn they have to squeeze to release the latch. We had some house guests and when they opened the microwave door, a part inside broke, so the door would no longer latch closed, and consequently the microwave would not power on. I took it apart to diagnose the problem (not recommended). It was a complex operation just to get the door apart. **Skip to the end if you're not interested in a technical description** See the attached pictures. I found that the door latch mechanism involves a spring holding tension on the part that moves in your hand, and also on plastic door latches inside which rock on a pivot. This pivot is built onto the parts as a small plastic nub about 4mm diameter and about 6mm long, which fits into a metal hole as a fulcrum for the mechanism. There are two parts like this (upper and lower) and the nub sheared off of the upper part. The part costs about $9 and it's available online, but I didn't want to wait that long, and the unit was still under warranty. Unfortunately, the nearest authorized service location is about 20 miles away, and they couldn't even look at the microwave for several days. My original request to customer service was to just send me the part, as I was pretty confident I could put it in myself. They completely ignored this request and sent back their boilerplate reply 1) warranty applies 2) call this number. I wound up fixing the part myself by drilling through where the nub was with my rotary tool, cutting down a small machine screw to length with a hack saw, and gluing it in. Works perfectly, although I've slightly decreased the structural integrity of the plastic latch head by drilling through it. We'll see how long it lasts or if the other one fails too. If you're going to do this operation bear in mind that it's not easy to just drill through the plastic part with a drill, as the drill bit keeps jumping around on the slick plastic. A rotary tool works much better, but be careful about melting the plastic too. Do it in short sessions. Also, it is necessary to cut down the machine screw. It has to fit into a narrow area, so the length of the nub does matter. Finally, I did try just gluing the plastic nub back on with super glue, but it immediately broke off again as soon as I reapplied the spring tension. **End of technical discussion** I recommend taking it easy on the door handle, and teaching guests how to open the microwave.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41udo8MT-JL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ZBjh1ZOBL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HB Cho",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJI4AORGQ4GY6K2BMGD2UPI7U7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ1LZ3J1MOLJG?ASIN=B074RCGYLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Good for reataurant",
                "reviewText": "I am using this microwave for my restaurant. Very sturdy and easy to use.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kathy frazier",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGPR6MJNGAKY6V42ZU7X7FNAWWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MLJRU9SRMOXB?ASIN=B074RCGYLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2021",
                "reviewTitle": "5.0 out of 5 stars Good Microwave!",
                "reviewText": "The dial is awesome and I also like the commercial grade construction. Plus, I prefer a microwave with a door handle and no turntable. So this has been super convenient. My only complaint is that it doesn’t cook perfectly even like my similar MW this replaced. But it’s good enough and I haven’t found anything better.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUNZWT3MV7KQD6BIOK2V7V37O4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DLKRODGXT525?ASIN=B074RCGYLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing quality.",
                "reviewText": "Beautiful, convenient, very well made. Cooks quickly and evenly. A great buy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pepe Kuri",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 27, 2023",
                "reviewTitle": "Buenisimo, pero problemas con el envío.",
                "reviewText": "Había calificado con estrellas inicialmente. El horno llegó perfecto, y se ve que es muy bueno, aguantador, de uso rudo, y calienta muy rápido. Todo perfecto hasta ahí. El lado nada agradable, fue que lo retuvieron en la aduana, era PRIME con \"entrega al día siguiente\", pero tardó mas de dos semanas en llegarme. Amazon me hizo un cargo llamado \"Depósito de tarifas de importación\" de 1,000 pesos al momento de la compra, como siempre sucede cuando es un artículo de importación, pensé que eso sería todo, pero no fue así, cuando finalmente me entregaron el horno las personas de DHL, me cobraron más de impuestos de importación $3,017 pesos adicionales! A final de cuentas, el horno que costaba al principio $5,263, + $999.97 de \"depósito de tarifas de importación\" cobrado por Amazon + $3.017 de impuestos cobrados por DHL, terminó costando $9,279.97 ... y por si no pudiera ser peor, por ser un aparato vendido por Amazon EU, no me dieron factura de nada de esto, así que ni siquiera podré contabilizar este gasto. Eso me dejó un muy mal sabor de boca. Ya no se si finalmente me convino o no adquirirlo, pues terminó costando casi el doble de la cantidad inicial.Actualización: 28 julio 2023 - Llamé a Amazon para preguntar si lo que me sucedió estuvo correcto, pues sigo sintiendo que algo no está bien, y me confirmaron que no, efectivamente algo esta mal, levantaron un reporte contra DHL, y me recomendaron contactar directamente a DHL, pues no debieron cobrar ningún \"extra\", ni por gastos de importación, ni por ningún otro concepto.Llamé a DHL hace un momento, y me dijeron que había sido un \"error en el sistema\", que efectivamente no debieron cobrar nada. Se levantó un reporte con solicitud de reembolso, y se supone que en unas cuantas horas me llamarán para coordinar el reembolso de la cantidad que me cobraron. Actualizaré cuando esto haya terminado para que los demás compradores que puedan estar en una situación como la mía, sepan que es lo que deben de hacer. Según DHL, ante esta situación, no debí pagar ni recibir el paquete, esto hubiera ocasionado que se diera una aclaración, y ahí hubieran detectado el \"error\" y hubieran hecho el ajuste correspondiente, y me lo hubieran entregado nuevamente, pero sin tener que pagar nada más.Me pregunto qué hubiera pasado si no hubiera manifestado mi inconformidad??? Espero que esto sea de utilidad para quien lea esta reseña.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "José Luis Peralta Higuera",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 24, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Sufríamos todo el tiempo con los hornos de microondas por el tema de las descomposturas, además de que todas las funciones que normalmente traen no las utilizábamos. Este horno es simple y robusto y calienta mejor que todos los hornos que hemos tenido. Espero nos dure muchos años",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$300.00",
                "sellerName": "Chef’s Deal",
                "sellerRating": "5"
            },
            {
                "price": "$300.00",
                "sellerName": "deqonline",
                "sellerRating": "4"
            },
            {
                "price": "$300.00",
                "sellerName": "Cook's Direct",
                "sellerRating": "5"
            }
        ]
    }
}