{
    "remaining_requests": 35594,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Nordic-Ware-Microwave-Popcorn-Popper/dp/B00004W4UP",
    "body": {
        "name": "Nordic Ware Microwave Popcorn Popper, 12 Cup, White",
        "price": "$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Nordic-Ware-Microwave-Popcorn-Popper/dp/B00004W4UP",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B088HF4YNH"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ZqzhAT9DL._SS36_.jpg"
            },
            {
                "asin": "B00004W4UP",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31U8mGwZ96L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31U8mGwZ96L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51YcdxvZk-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512BeK2faDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DCDwyJUbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51h1CgW-ouL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Nordic Ware Store",
            "link": "https://www.amazon.com/stores/NordicWare/page/D1E66A58-BE2A-40DC-B57D-7591B083CEA6?ref_=ast_bln"
        },
        "brand": "NordicWare",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 7980,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 7 hrs 54 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Makes light, fluffy microwave popcorn without using oil",
            "Made of gemstone unbreakable cookware with a plastic lid",
            "Microwave safe",
            "Dishwasher safe",
            "Made in the USA"
        ],
        "description": "Product Description Quick and easy popcorn from your microwave! Ideal for popping delicious popcorn with or without oil and serve directly from bowl. Proudly made in the USA Amazon.com Made of gemstone, an unbreakable, chip-proof cookware material, the Nordic Ware corn popper efficiently transmits microwave energy directly to the popcorn kernels, popping them quickly without oil. It produces the results of a hot-air popper without an additional appliance. This oil-free method is refreshing when compared to bagged corn, because you don't have to contend with grease, salt, and artificial flavoring unless you dress the corn yourself after cooking. However, take care to monitor the progress of corn during the first use. The manufacturer lists a three-to-five-minute cook time for 1/2 cup of unpopped kernels, but as microwave ovens vary, it could take considerably less time to pop. And overcooked corn burns fast using this method. Luckily, the base and lid are designed not to warp or melt, so burned kernels won't damage them. Use this versatile popper for cooking, storing, and serving popcorn and other snacks. The popper base is also ovenproof. --Carol Gnojewski",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Specialty Appliances",
                "link": "https://www.amazon.com/specialty-appliances/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289941"
            },
            {
                "name": "Popcorn Poppers",
                "link": "https://www.amazon.com/Popcorn-Poppers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=1090764"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Nordic Ware"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Capacity",
                "value": "3000 Milliliters"
            },
            {
                "name": "Special Feature",
                "value": "High Heat Plastic"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Product Dimensions",
                "value": "9.88\"L x 9.88\"W x 5\"H"
            },
            {
                "name": "Item Weight",
                "value": "1.1 pounds"
            },
            {
                "name": "Included Components",
                "value": "bowl, lid"
            },
            {
                "name": "Is Electric",
                "value": "No"
            },
            {
                "name": "Manufacturer",
                "value": "Nordic Ware"
            },
            {
                "name": "ASIN",
                "value": "B00004W4UP"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "60120AMZ"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 7,980 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,038 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #31 in Popcorn Poppers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "August 24, 2008"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Quality Kitchenware. Made in America. Nordic Ware’s products are made by a skilled team of craftspeople in Minneapolis, Minnesota, all of whom share the vision of creating the finest quality kitchenware items in the industry. Our unique designs originate from our own in-house team of product designers and engineers, and we draw on inspiration from our own experiences in the kitchen as well as time-tested manufacturing methods to create products that will be handed down from one generation to the next.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/71412052-238e-4e5a-aff9-c87e53148a81.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Meet the Makers We are fortunate to have an incredible team of dedicated individuals that are behind the strength of the Nordic Ware brand. These are the hard-working Americans who create, craft make, inspect, pack, ship, and bring our products to life. They’re the makers who touched your cookie sheet, your Bundt cake pan, and your griddle with their own hands as each piece was being made. Without them, our brand and products would be something much less. The strength of ‘family’ runs deep within our company DNA-- a trait we take great pride in.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/aa9d6155-c4ae-4235-87ce-f00135ef5e1d.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "75 years of American-made Kitchenware Founded in 1946 by an enterprising young husband and wife team, Nordic Ware began as a fledgling company specializing in ethnic Scandinavian products, as well as everyday items like griddles and steak platters. To this day, our company remains family owned and operated across three generations. The Nordic Ware brand has endured and our products can be found in homes around the world. We now manufacture over 400 products, ranging from cookware and bakeware to microwave-safe plastic products, grilling accessories and tools for food prep and serving. We’re known for producing no-nonsense, durable goods that will be passed down from one generation to the next.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fd40293a-c1c2-4fc3-9ae9-adb5a1b0eaa2.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b3d1b707-d7b9-416a-b4fb-f2cab2c4a755.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/71412052-238e-4e5a-aff9-c87e53148a81.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/aa9d6155-c4ae-4235-87ce-f00135ef5e1d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fd40293a-c1c2-4fc3-9ae9-adb5a1b0eaa2.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JT Kirk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYJ4YWUTGRFPF5Y4RG4SU72Y3ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I23DY8APPHIH?ASIN=B00004W4UP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2011",
                "reviewTitle": "5.0 out of 5 stars Makes lots of popcorn without or with oil",
                "reviewText": "I just ordered my second one because my first one's lid broke after a year and a half - the lid had warped and I snapped it trying to get it to flex back. The bowl still works if covered by something like a plate, but moisture and popcorn buildup can cause problems that way, so basically I'd rather just get another one and have a second large bowl for other use (or as a backup if one is dirty and I'm lazy, which seems likely!).Anyway, this thing is pretty darn good. You put in the kernels, put on the top, and listen for the kernels to pop less than once every 2 seconds, then shut off the microwave, and you get hot popcorn! You can also add salt and oil in before nuking and you'll get decent results (although too much oil can drown the kernels instead of aerosolizing and blend with the poppping corn), just top it off with a little more salt and oil at the end to get quality popcorn - perhaps not movie-style or stovetop, but also it takes less oil and salt to make this tasty, so there's a health benefit to be enjoyed. I occasionally will add tabasco sauce to the oil when I nuke a batch, it tastes great but it does fill the air around the microwave with pepper gas for about 15 minutes which stings the eyes and lungs, so um... don't do that without taking precautions.Keep in mind, if you put in too much popcorn and it can overflow, but it won't stop cooking; put on too much time and don't listen for popping to slow, and the popped corn will scorch (mother nature isn't a precision factory, every batch of kernels will pop differently so be responsible with your microwave popcorn or you risk burned popcorn or even fire).The popper bowl material is an unusual, strong, thick, amalgamted plastic like the other microwave cookware from Nordic Ware, it gets really hot but it survives that heat nicely. It also stays hot for a while, which at the bottom of the bowl can be too hot for some surfaces (like a glass table or one's lap), so I suggest using an old small wooden cutting board or something similar to set it on; a good side-effect of the bowl holding heat is it keeps the popcorn warm longer. The bowl quickly took some stains at the bottom (both inside and outside) from the heat, the oils in the kernels, or a combination, but continues to work with no adverse effects. Cleanup is easy, making dry popcorn you just wipe it down and it's pretty much ready to go; with oil popcorn it's a quick wet soapy sponge and dry (it's a big bowl, so you will likely get wet washing it by hand). The package only says the lid is dishwasher top-rack safe, says nothing about the bowl in the dishwasher, but since it can take a firm beating from the microwave oven, I figure it can handle hot water and Cascade liquid, and so far it's done great in the dishwasher as long as I sweep out the kernels and hulls first - I dunno, maybe your dishwasher will find a way to ruin it since it's not approved, but mine hasn't so far - it can take up a lot of real-estate in the dishwasher though, sometimes it's just easier to wash it by hand than cover up so much of the bottom rack (it's too tall for the top rack).The lid is a softer, clear(ish) plastic that has an X-shaped grip section and cutaways around the sides to let out steam (open it away from your arm and body, steam is hot!). Over time, the lid on mine warped so it fit the bowl even more loosely than it already had (to be fair, I was foolishly storing it upside-down right after cooking and that may have helped warp it) and then let out a few kernels and popped corn, but it otherwise continued to work. The lid is top-rack dishwasher safe, the top grip will gather a little water at the end of the cycle but otherwise it does fine; it really only needs cleaning when running oil with your corn, the oil vaporizes and collects on the lid along with the vaporized water from the kernels.It'll take a few rounds to get the right amount of kernels, I overpopped a ton of batches early - that's 12 cups of popcorn each from just a relatively small-looking amount in the bottom! Mine takes about 4 minutes to cook all that corn in my 800 watt microwave, however I find that the time is affected by the quality of the popcorn I'm buying, and the weather. The quality of the kernels also affects the number of unpopped and old-maid kernels (kernels that cooked but didn't pop due to a leak in the hull, an overly thick hull, or the wrong hull to germ ratio - each kernel is a natural pressure cooker that explodes a liquid into a solid when it hits the air), Orville in the jar is a significantly better pop with less hulls, as well as better to cook with, than the generic in the bag. Don't obsess about popping every last kernel, it's better to have half a dozen unpopped kernels among 12 cups of popcorn than to have part of your popcorn scorched, that blackened stuff is inedible and stinks up the unscorched popcorn as well as your house.Bottom line, for the price, I think this thing delivers pretty well. It has a few little drawbacks, but when all you need is a handful of kernels, this product, and a microwave to make 12 cups of popcorn, that's a great product - no extra stuff to buy, no oil required, no unitaskers (as Alton Brown would say) that are noisy and hog a ton of electricity and shoot kernels everywhere. This thing is quick, it's easy to use and to clean, it is a big bowl, and it's inexpensive.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESOB3BZCYMFHBPXAFKDIHLT3G5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D2NGEOSXMBHS?ASIN=B00004W4UP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars The best microwave popper ever!",
                "reviewText": "This popcorn popper works so good! It has had hard use, almost every night for one and a half years. It’s still in great condition. I love it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "deke40",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3QQWWTMXXO3VVBRYDPMKHPAIWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KZBCK7Z8G8FT?ASIN=B00004W4UP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Does the job",
                "reviewText": "I like the ease of use. Corn comes out the same every time. Parts feel greasy even after washing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHB6JBSUJAQUXWSYEBLDAVRRD37Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GSKHHQE6P06Z?ASIN=B00004W4UP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2022",
                "reviewTitle": "4.0 out of 5 stars Great way to make popcorn",
                "reviewText": "Works as intended - plastic microwaveable bowl with a lid to pop popcorn kernels in the microwave. I’d give it a full 5 stars if the lid snapped onto the bowl - as it is, the lid just sits on top of the bowl, and because I’ve found that the bowl gets really hot, it’s a little bit of a challenge getting it out of the microwave safely - you can easily knock the lid off by grabbing the bowl anywhere other than the bottom, and spilling all the popcorn. Not a huge deal if your patient or careful (I’m neither), but I think a snap-on lid or a bowl that didn’t hold so much heat would be a big improvement - such popcorn bowls exist. This one is fine for the price~ Also I don’t know if I’m supposed to but I put this in the top rack of the dishwasher and it’s been fine.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D Pix",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGS7CYI2QYNWRJTGR4KIH6FY4DCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZMZB9KTDOAAG?ASIN=B00004W4UP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Inexpensive Item!",
                "reviewText": "Could not ask for more. Made in the US, less than ten dollars, clear instructions, works well and easy to clean.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Candy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3FTOARXA2L5XC6TTWQ4XOST6IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33JRU0QNJ1W24?ASIN=B00004W4UP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Popcorn addict",
                "reviewText": "I love that I can pop my popcorn w/o fat or salt or with if I choose. Quick & easy in the microwave.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rasetsu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGHMSENYVBOYLUFNQLHFDR5KVHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R199ZN4GXCEY97?ASIN=B00004W4UP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2019",
                "reviewTitle": "5.0 out of 5 stars This is the one! Not flawless, but very close to it.",
                "reviewText": "I had originally bought the classic popper with the flat lid in spite of the reviews indicating that the flat lid tended to come off during popping, as I wasn't aware of the pro version. Once I heard about the pro version, I returned the classic and ordered the pro, and I'm really glad I did. It works great! There are only a few issues associated with it, probably the biggest being the size relative to the popped popcorn. Popping a half cup of kernels results in the popper being filled to the brim with popped popcorn, making it impossible to \"toss\" the popcorn in order to apply seasonings without spilling everywhere. So I simply transfer the popcorn to a larger bowl and then apply my seasonings. The second issue is that since I pop without using any oil, I need to apply some sort of liquid to the popped popcorn in order to get the seasonings to stick. One possible is melted butter, but that's extra work. I use a butter flavored cooking spray which works fine, is easy to apply, is cheap, and doesn't adversely affect the flavor. I've considered using the spray on version of Bragg's aminos instead, but that's higher in sodium than I would like. The final issue is that the popper does get rather hot during popping. There is a flat rim that extends a half centimeter out from the top of the bowl, so it is possible to grip it without burning one's hands on the bowl part of the popper, but due to a handicap, this is somewhat difficult for me. Not really a flaw in the design so much as something to keep in mind. As to the extra bowl, that would result in extra dishes needing to be done, but I've taken to simply occasionally washing the popper instead of each use as there is basically no residue from popping other than the moisture released by the kernels, and perhaps a stray piece of popped popcorn clinging to the side. I don't have a dishwasher, so that works out best for me. Overall I'm thrilled with the popper. I initially sought a popper as I was trying to reduce my sodium, and the potato chips and crackers I was eating were high in sodium. Popcorn made an obvious alternative, but I quickly found that bags of microwave popcorn contain a lot of sodium by themselves, not counting any toppings that I add. So I went in search of a microwave or air popper, and found the Nordic Ware. Boy am I glad I did! If my experience is any indication, I have only one thing to say to you. Buy it!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carla L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 30, 2023",
                "reviewTitle": "Super",
                "reviewText": "Me encantó este si hace palomitas muy buena calidad estoy feliz con la compra",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pascal Grenier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 28, 2023",
                "reviewTitle": "We are popcorn fans, using this bowl is child's play.",
                "reviewText": "The media could not be loaded. Little tip after popping your popcorn, use a stainless steel bowl (a chicken bowl, for example) to mix your oils or butter. This will help prevent the plastic from staining and becoming hot.Be careful with the Nordicware bowl lid. Although effective, it may be subject to deformation under high temperatures. It's a small inconvenience, but worth mentioning so never microwave butter.another tip add two sheets of paper towels just under the lid so the popcorn won't come out.In our house, this bowl has been used several times a week for years. Some evenings when a lot of people are at home we can use it 3 to 5 times one after the other. Think of the savings compared to pre-packaged bags of popcorn! Plus, you have total control over what you put in it (no popcorn that's too salty or full of additives).Nothing beats the taste of homemade popcorn. With this bowl, prepare to rediscover this simple, authentic, and incredibly tasty pleasure.In summary, this popcorn bowl is an excellent choice for those looking for a simple, healthy and economical solution to making homemade popcorn. Despite some small drawbacks, such as the sensitivity of the lid, its advantages far outweigh it. So, ready to transform your movie nights at home?When it comes to making homemade popcorn with your Nordicware bowl, one crucial aspect is often overlooked: the quality of store-bought popcorn. This can greatly influence your dining experience.Variety in Quality: The varieties of popcorn available in stores vary greatly in quality. Some brands offer kernels that pop evenly and crisply, while others may produce less satisfactory results, with lots of unpopped kernels or popcorns that are too hard.Orville Corn Seeds are famous for their exceptional taste. They offer a delicious and authentic taste experience that is loved by many people. The rich flavor and crunch of this corn make it an ideal option for snack and popcorn lovers.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/E1ciAD3 YFL.mp4"
                }
            },
            {
                "reviewerName": "Nora J. Walker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 1, 2023",
                "reviewTitle": "Perfect popcorn in just 2 minutes",
                "reviewText": "So quick to make delicious popcorn and you can use the popping bowl as a serving bowl. So easy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sunita Gupta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 29, 2022",
                "reviewTitle": "It's the best popcorn maker,I love this 😍",
                "reviewText": "The media could not be loaded. It's easy to use ..just mix all together n put it in microwave for 5 min ...full bowl of popcorn ready without any hassle ...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/B1URUqM20AL.mp4"
                }
            },
            {
                "reviewerName": "Diana Garcia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 16, 2019",
                "reviewTitle": "3:33 mins en microondas",
                "reviewText": "Yo tenia una una de estas cosas pero conica (con una base para poner ciruclos de carton que vendian como repuestos aunque eran innecesarios) hace unos años y la adorabla... hasta que mi padre la que mo accidentalmente al dejarla como media hora en el microondas en lugar de 3 mins. Tenia el problema de que dejaba como 1-2 cucharadas de maiz sinr eventar en el fondo. Despues para reemplazar la anterior consegui lo unico que habia en Mexico una jarra de cristal con tapa y cubierta inferior desilicon (en SAMs y supongoq ue tambien en cotso) . Era facil de limpar pero como el vidrio concetraba la humedad y aún mas palomitas no reventaban. Al final mi padre la rompio accidentlmente ¬¬ .Compre esta cosa porque estaba a buen precio ($218.70 mxn) y debo decir que realmente truenan practicamente tods las palomitas alrededor de 3 mins, es facil de limpiar, y es resistente dentro de lo que cabe. La recomiendo.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}