{
    "remaining_requests": 35648,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Magic-Chef-MC110MST-Countertop-Microwave/dp/B0C6RC2K82",
    "body": {
        "name": "Magic Chef 1000 Watt Compact Small Microwave Oven, Silver",
        "price": "$132.17$108.03",
        "originalPrice": "$132.17",
        "rawPrice": 132.17,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Magic-Chef-MC110MST-Countertop-Microwave/dp/B0C6RC2K82",
        "soldBy": {
            "sellerID": "A2G88111572J8M",
            "name": "BisonOffice",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2G88111572J8M&asin=B0C6RC2K82&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07JJRXQWY"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C6RC7233",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/313KHNnWpgL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Multicolored",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41hlopZO6EL._SS36_.jpg"
            },
            {
                "asin": "B0C6RC2K82",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/313LF3itjjL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Stainless Steel",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31Lc-tOly1L._SS36_.jpg"
            },
            {
                "asin": "B0CC755BC9",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/314i03Iv65L._SS36_.jpg"
            },
            {
                "asin": "B004G7N8W0",
                "variationName": "Color",
                "variationValue": "White - Former",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/310FdvdBwfL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31nmZYTq-AL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/416Fq12HIJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tz1DVEYBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wSVbW3UaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RUcnkjisL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411B6Yuos4L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Magic Chef",
            "link": "https://www.amazon.com/Magic-Chef/b/ref=bl_dp_s_web_3034389011?ie=UTF8&node=3034389011&field-lbr_brands_browse-bin=Magic+Chef"
        },
        "brand": "Magic Chef",
        "merchantInfo": "Ships from and sold by Spreetail.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2151,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 16 - 22.",
            "FREE delivery February 16 - 21. Order within 22 hrs 35 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Countertop Microwave Oven: Standard, small compact microwave includes 10 power levels and an auto-defrost feature to easily cook and reheat a variety of dishes",
            "Intuitive Mini Microwave Controls: Small microwave countertop includes an innovative LED display screen with electronic controls and a 30-second express cooking function for quick and easy reheating",
            "Even Cooking: Glass turntable in this portable microwave oven rotates as the machine runs, resulting in even cooking every time; Features a stainless steel exterior and a child safety lock",
            "Auto Microwave Countertop Cooking: Allows you to enjoy auto-cook settings for popcorn, baked potatoes, pizza, beverages, dinner plates, and frozen vegetables",
            "Magic Chef: For over 90 years, we have been providing affordable and reliable products in the USA; We use our trusted experience to produce and maintain quality products that we stand behind"
        ],
        "description": "Delicious cooking is always just a touch away with Magic Chef! Are you a new homeowner looking for an effective microwave to accessorize your new kitchen? Maybe you have a small apartment and need a standard-size countertop microwave oven, or you have a regular-sized kitchen and just need a regular microwave that you can easily move to another room or surface area. Regardless of your situation, the Magic Chef 1.1-cubic-foot countertop microwave oven will work for you. This stainless-steel microwave oven has plenty of cool features, including 6 programmed cooking modes, auto-defrost modes, and 10 separate power levels. With a total power level of 1,000 watts, it’s powerful enough to cook what you need whenever you need it. This Magic Chef countertop microwave oven packs a punch and is versatile in style and function for any kitchen, even small spaces. With its sleek design, this household microwave oven would fit perfectly on a countertop or any sort of tabletop. Plus, it’s easy to clean after use. The stainless-steel exterior can be sprayed with a mild detergent, and the black ceramic interior is easy to wipe clean with a damp cloth. You can also remove the glass turntable inside and wash it in the dishwasher for hassle-free cleaning, so your counter microwave stays looking new. Magic Chef has been a leader in the houseware industry for over 90 years. We are family owned and proudly provide products for the US market. When you purchase one of our products, we provide top-notch customer service by partnering with a nationwide network of local repair companies to ensure that we can repair your items as quickly as possible. We offer a strong brand with value and performance you can trust.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Microwave Ovens",
                "link": "https://www.amazon.com/Microwave-Ovens-Small-Appliances/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289935"
            },
            {
                "name": "Countertop Microwave Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3741631"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "1.1 Cubic Feet"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Residential"
            },
            {
                "name": "Installation Type",
                "value": "Countertop"
            },
            {
                "name": "Wattage",
                "value": "1000 watts"
            },
            {
                "name": "Controller Type",
                "value": "Touch"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Lock Type",
                "value": "Child Lock Available"
            },
            {
                "name": "Number of Power Levels",
                "value": "10"
            },
            {
                "name": "Timer Function",
                "value": "Timer Function Available"
            },
            {
                "name": "Energy Consumption",
                "value": "1000 Watts"
            },
            {
                "name": "Number of Programs",
                "value": "10"
            },
            {
                "name": "Defrost System",
                "value": "Auto Defrost"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,151 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#41,365 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #57 in Countertop Microwave Ovens"
            },
            {
                "name": "Brand",
                "value": "Magic Chef"
            },
            {
                "name": "Included Components",
                "value": "product, manual"
            },
            {
                "name": "Model Name",
                "value": "MC110MST"
            },
            {
                "name": "Model Number",
                "value": "MC110MST"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Product Dimensions",
                "value": "18.4\"D x 15.1\"W x 23.1\"H"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Rob Locke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMK53TCNCL3F5YJKE43JOF6TCGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RMADLKVFUJL?ASIN=B0C6RC2K82",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "5.0 out of 5 stars I actually like it quite a bit more than I thought I would!! :)",
                "reviewText": "When it was delivered, whom ever dropped it off, on my front steps, by whom I suspect it was \"FedEx\" dropped it off at 1:00 pm in the afternoon, I assume, BEFORE IT STARTED RAINING!! (Thinking back now, I wish I would have checked, my surveillance cameras, so I would actually know, if it was raining, or not when it they dropped it off) but I didn't get home, until 4:00 pm the same day, and of course, the box wasn't covered with a bag or anything. You know because, it was only a little over $100.oo for this microwave, so no need to worry about springing for like a .10 cent garbage bag, if its raining, or looks like it might start to rain, right!! :( I was sure it was ruined, so I was going through the process of returning it, when, a few nights latter, I got to looking at the box, and I noticed though, one of the holes for the handle on the box, there was an internal plastic bag, around the microwave its self. (And I was already having all kinds of issues with, my back, so I really! didn't want to wrestle the thing, into my truck and back to the nearest FedEx store) I was extremely skeptical, weather the microwave was any good or not, considering how saturated the box was. But I thought it would be worth at least trying to see if it was okay, if it could possibly, get me out of having to take it back to FedEx, so I got my brother to get it out and it works great, I really like it. It looked so similar to our old microwave, (Which none of us liked to use, \"us being, my mom, my brother, and my self\") but I really like it, our old one which can't be much more then 3 or 4 years old, the internal light, only came on, while the microwave was running, it wouldn't turn on when you opened the door!! I've never even heard of that!! And you could only set the timer on the old microwave, for a maximum of 59 minutes and 99 seconds. Has anyone ever heard of this? On every microwave I've ever operated, in my lifetime, (and I'm \"43 years old\" but none the wiser\" ;) LOL ) whenever you opened the door, the light inside, automatically turned on, so I assume so you could see, what you were doing, when you were getting, your container, of food situated in your microwave. But any way very happy with the product!! All the things that annoyed me, and my family about the old microwave, wasn't an issue with this one!! 3 Thumbs up!! :) Sorry didn't mean for this review to be so wordy!!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Klpott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6GZKHQFKXPSSUXAYJFOPRA33WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21DBCGQSZKG1Q?ASIN=B0C6RC2K82",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars great microwave",
                "reviewText": "this is real similar to my sears microwave, which died after 8 years. best thing is no steam sensor. cooks great and is easy to program meals.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Windy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDKWSJLTQQAWQN3NFGULC3QMVYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T4L9E8ZLWEX2?ASIN=B0C6RC2K82",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2023",
                "reviewTitle": "4.0 out of 5 stars Nice size",
                "reviewText": "The microwave looks good well made. Is big a really full size microwave for family.It is a little loud when it starts more than normal but gets better as it goes. Do wish the door had a handle instead of the push button to open.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John R. WhitneyJohn R. Whitney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKV45VGRAABN6OP7K4ZSOYJ5XWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13Q9WNLDJ7O3F?ASIN=B0C6RC2K82",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Arrived Promptly. Great Value & Features",
                "reviewText": "Just the right balance of size, features, ease of use, appearance, and value for a countertop unit.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71cvXgaB02L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Benjamin 805",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZRAR4M7CPDHXRTKPHE73IBOUIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WAT5KJ83S2XR?ASIN=B0C6RC2K82",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 22, 2018",
                "reviewTitle": "5.0 out of 5 stars Glad I took the chance.",
                "reviewText": "Update August 30. As I am now at the 3 month mark of owning this microwave I figured I would come back and give a quick update. I am just as happy now with this microwave as I was at the time of my original review. I still feel the same way that this microwave is definitely money well spent. My original review is below.I have only had this microwave for about 2 weeks but considering there are currently no reviews for it I decided to go ahead and write one based on what my experience has been so far. After my Panasonic microwave that I only owned for 10 months decided to die without warning and the manufacture not being any help I went looking for a new microwave. The first microwave I came across was highly rated on Amazon and was made by Bella. I almost purchased that microwave but my girlfriend was insistent that The microwave have a pushbutton for the door instead of a pole handle. Because of this I continue to look and came across this one from magic chef. The first thing that I noticed aside from the fact that it had the button my girlfriend was looking for was that it had an identical keypad to the first one that I looked at. Doing a quick browsing of the owners manual for both microwaves I confirmed that the interface was the same and that the magic chef looks to be a slightly bigger version of the Bella microwave. I normally don’t take chances on items with no reviews but since this looks to be almost the same and the other one was rated so highly I purchased it. Fast forward to now and I can honestly say that I am very glad that I took the chance that I did. We have put this microwave through its paces ever since we got it and everything we have asked it to do has come back with great results. One of the biggest things that I have noticed since we switched to the magic chef is how it heats. With our previous Panasonic we would find spots where food would be bubbling and other spots where it would be ice cold. This new microwave definitely does a lot better of a job with providing even heating. We have warmed up everything from lasagna to soup with great success. My girlfriend also fixes eggs in it for breakfast and she said that she is also a lot happier with the newer one than she was with our previous unit. I have so far only found a couple of small quirks that I wish were different. The first that I noticed was with the kitchen timer. Unfortunately you cannot use the kitchen timer and expect to use the microwave at the same time. I know there are other manufacturers who do have this ability so was a bit disappointed to see that this microwave does not. The other quirk is with the display. Considering they had all of the extra space that they do I was surprised to see that they went with a smaller display for the time. Neither one of these issues are dealbreaker’s and I would definitely recommend this microwave. I know this review is early so I will come back and update it if I come across any issues.",
                "reviewVotes": "48 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carmen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTF4BADSXKN3IY6L3DZ6TYI6YKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HFS3UT73ZCVU?ASIN=B0C6RC2K82",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2023",
                "reviewTitle": "5.0 out of 5 stars A good buy !",
                "reviewText": "Went store shopping to replace our dead microwave . . . truly didn't find anything we liked. Went on line and store shopped . . . still didn't like anything for the price we were looking for. Came across this one on AMAZON and it fit all our needs, size was perfect and price was right. If I HAD to find one negative it would be the sound. Not to loud just an odd buzz instead of a hum. Noise is not a deal breaker . . . Love it !",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Catman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLPUURI57UZC4V5EKIIHMP3RNGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23XUR7073PTU0?ASIN=B0C6RC2K82",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars works great",
                "reviewText": "it is all i expcted it to be",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Florin C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 10, 2022",
                "reviewTitle": "One of the best on the market",
                "reviewText": "I had the previous version of this, twice. Each one lasted about 6 years, which I guess is the most you can expect from products made nowadays. Yes, it's made in China, but so are the Panasonic ones that cost almost twice as much. It' solidly made, with solid performance, at least so far. If it lasts another 6 years, I will be happy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike V.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 3, 2018",
                "reviewTitle": "good microwave, works as expected",
                "reviewText": "I prefer to use grams instead of ounces, but it cannot be set up this way.Otherwise I am fully satisfied with the product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol RB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 19, 2019",
                "reviewTitle": "Great Microwave",
                "reviewText": "This product is a perfect size for counter. Lots of watts for cooking. color black and white is outstanding. Heats up food extremely fast. The touch screen buttons are very sensitive & I would highly recommend this product for a family.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deanne Dewey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 2, 2020",
                "reviewTitle": "I love this Mirowave Oven!",
                "reviewText": "Nothing more to say, it arrived I use it and life is grand. It's more powerful than my old one and that's great!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TrialAndErrorTrialAndError",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 15, 2021",
                "reviewTitle": "SEE UPDATE .. This unit was easy to carry in one hand because of a bag to carry it with one hand",
                "reviewText": "Works nicely.UPDATE: Burnt a spot on a damp towel. Multiple times now seeing its \"firepower\" concentrated on relatively small areas in the oven. It is not cooking evenly. Hope this is a one-off problem. I like this size/price. The door seems to have a gap or space for microwaves to leak.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81AIwL4w0VL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$132.00",
                "sellerName": "KART IT",
                "sellerRating": "4.5"
            },
            {
                "price": "$132.00",
                "sellerName": "UnbeatableSale Local",
                "sellerRating": "4"
            },
            {
                "price": "$132.45",
                "sellerName": "UnbeatableSale, Inc",
                "sellerRating": "4"
            }
        ]
    }
}