{
    "remaining_requests": 35503,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lekue-Microwave-Popcorn-Popper-Maker/dp/B00NF9CT0C",
    "body": {
        "name": "Lekue Microwave Popcorn Popper/ Popcorn Maker, Red",
        "price": "$21.95",
        "originalPrice": "",
        "rawPrice": 21.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lekue-Microwave-Popcorn-Popper-Maker/dp/B00NF9CT0C",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B082D7KW3J"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31n6WwwVaQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21DhkNEAnKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31TzDhPwo7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31iadyQ37-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kq3GTLmUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61YMIXAwRbL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Lekue Store",
            "link": "https://www.amazon.com/stores/Lekue/page/5805253D-4628-40F4-AF47-0D3AB4D6CBF0?ref_=ast_bln"
        },
        "brand": "Lekue",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 12130,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 9 hrs 39 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow 7 AM - 11 AM. Order within 2 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Easy to use - simply fill to the line with popcorn kernels and pop in the microwave for a minute and a half",
            "Collapsible bowl allows for easy storage",
            "Easy to clean - it's dishwasher safe",
            "Suction lid keeps popcorn from overflowing the bowl",
            "8 inches in diameter by 5 inches in height (collapses to 2 inches)"
        ],
        "description": "With the Lekue Popcorn maker, you can prepare healthy and original home-made popcorn in just 3 minutes in the microwave. The innovatively designed collapsible bowl makes for easy storage. Make healthy natural popcorn with no saturated fats. The Popcorn Maker includes tasty recipes, inspired by famous films and developed by the Alicia Foundation.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Specialty Appliances",
                "link": "https://www.amazon.com/specialty-appliances/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289941"
            },
            {
                "name": "Popcorn Poppers",
                "link": "https://www.amazon.com/Popcorn-Poppers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=1090764"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Lekue"
            },
            {
                "name": "Color",
                "value": "Red"
            },
            {
                "name": "Capacity",
                "value": "2.8 Liters"
            },
            {
                "name": "Special Feature",
                "value": "Portable, Oil Free, Collapsible"
            },
            {
                "name": "Material",
                "value": "Silicone"
            },
            {
                "name": "Product Dimensions",
                "value": "8\"L x 8\"W x 5\"H"
            },
            {
                "name": "Item Weight",
                "value": "9 ounces"
            },
            {
                "name": "Included Components",
                "value": "popcorn maker"
            },
            {
                "name": "Is Electric",
                "value": "No"
            },
            {
                "name": "Manufacturer",
                "value": "Lekue"
            },
            {
                "name": "ASIN",
                "value": "B00NF9CT0C"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "0200226R10M017"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 12,130 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#66,209 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #94 in Popcorn Poppers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 1, 2013"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Lekue Microwave Popcorn Popper",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/686006b2-dcd6-48ec-ae9b-08ad52c1f636.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Lékué is fun and practical; it’s design and functionality Lékué products have revolutionized kitchens around the world, making them spaces for new food experiences and unique sensations. Blending flavors and textures; making recipes and trying them, all of this helps children and adults discover the pleasures of cooking at home. Lekue Microwave Popcorn Popper/ Popcorn Maker Perfect Microwave popcorn popper for the Home, Apartment or Dorm room Prepare healthy and original home-made popcorn in just 2-3 minutes in the microwave. Fast: Add the corn kernels, heat in the microwave and enjoy! Large Capacity: Add ingredients you prefer for flavor. Over 90% of the corn kernels pop. Compact: Collaspible,does not use much space in your kitchen. BPA free: Made with 100% platinum silicone. Easy to Clean: Dishwasher Safe. Includes tasty recipes Innovative design: Designed after conducting scientific research on the best way to cook popcorn in collaboration with the Alícia Foundation.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/efa9671d-1191-44ee-8142-d80eccc69377._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/0280a765-3936-416e-83f6-846c070f888d._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "Easy and Quick to Use Collapsible. Easy to Store. Easy to clean. BPA Free. Made with 100% Platinum Silicone. Set it for just a few minutes appropriate to your microwave. Enjoy fast, healthy microwave popcorn in minutes!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/e118b78f-4e9a-4941-947c-b1ae8849c903._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/fe4a49e8-a08d-47db-bf2a-302fa54ad051._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/40c9bd7b-5b93-42d7-8dd9-28992a3668d7._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/cb56c0d0-9972-4d8f-99c2-764317551f3a._SL220__.jpg"
                ]
            },
            {
                "media_text": "Available in Multiple Sizes Classic The perfect size for a couple or even three. Capacity of 98.5 oz (2800 ml) Extra Large Made for sharing with a group, whether family or friends. Makes up to 16 cups of popcorn. Individual MIni For portion control or when you each want popcorn the way you like it. Maybe with butter and without, or one with chocolate and one with cinnamon. Capacity of 23.7 oz (700 ml)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1242cdf0-2cfd-4d86-8206-d6d662f38e42.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/091a0fb1-b745-40f6-8e16-7314107de100.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/973a3f41-97e6-49f6-bbe6-9e060ad62f85.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/686006b2-dcd6-48ec-ae9b-08ad52c1f636.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/efa9671d-1191-44ee-8142-d80eccc69377._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/0280a765-3936-416e-83f6-846c070f888d._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/e118b78f-4e9a-4941-947c-b1ae8849c903._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/fe4a49e8-a08d-47db-bf2a-302fa54ad051._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/40c9bd7b-5b93-42d7-8dd9-28992a3668d7._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/cb56c0d0-9972-4d8f-99c2-764317551f3a._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1242cdf0-2cfd-4d86-8206-d6d662f38e42.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/091a0fb1-b745-40f6-8e16-7314107de100.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/973a3f41-97e6-49f6-bbe6-9e060ad62f85.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Karen B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKC6Y5QXNEP23JC32JZAY2PTFPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29CHXXUWBXLZX?ASIN=B00NF9CT0C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2015",
                "reviewTitle": "5.0 out of 5 stars 10 STAR RATING!!!! BEST POPCORN POPPER EVER USED!!!",
                "reviewText": "This is the BEST & EASIEST popcorn popper I ever used!!! It makes the most delicious popcorn in minutes. I just received it Yesterday and already made 5 batches of popcorn! It pops the corn fast and evenly and leaves very little if any unpopped kernels. I only used 1/4 C kernels and the popper was almost filled to the top with popped corn. I used Orville Redenbacher's Popcorn and all 5 batches were FANTASTIC!!! I set my micro-oven at 4 minutes and listened for the popping to slow down. As soon as the POPPING SLOWED DOWN, I removed the popper from the micro-oven. MOST BATCHES TOOK LESS THAN 2 MINUTES!!! The popcorn made with sugar and splenda required LESS COOKING TIME. I swirled some hot water and soap in the popper after use and clean up was a breeze! Nothing stuck to the popper, not even granulated sugar!HERE ARE THE RECIPES FOR THE 5 DIFFERENT BATCHES:#1: NO OIL.1/4 C Kernels + 1/8 tsp Kosher Salt.Stir salt with kernels before popping. The popcorn was very good, similar to air popped, but a lighter texture.#2: OIL1/4 C Kernels + 1/8 tsp Kosher Salt +1 TBS Canola OilStir all the ingredients together in the popper before popping.This batch was TO DIE FOR!!!!All the kernels popped and the popcorn had a buttery taste with a hint of saltiness.#3: Oil + Wilton Butter Flavoring1/4 C Kernels + 1/8 tsp Kosher Salt +1 TBS Canola Oil +1/8 tsp Wilton Butter FlavoringAdd all the ingredients into the popper and stir them with a spoon before popping.This batch had a really buttery flavor with the perfect amount of salt. My family devoured this batch and wanted more!#4 Kettle Corn.1/4 C Kernels + 1/8 tsp Kosher Salt +1 TBS Canola Oil + 1/8 tsp Wilton Butter Flavoring + 1TBS + 1 tsp Granulated White SugarAdd all the ingredients into the popper and stir them with a spoon to evenly coat, before popping.This was sooooooooo GOOD!!!!! This Popcorn TASTED EXACTLY LIKE KETTLE CORN that you would purchase at a fair!!!Just let the popped corn cool a minute before touching; the sugar gets hot.#5 SPLENDA KETTLE CORN: THE BEST!!!!!!!! AS GOOD AS \"REAL SUGAR\" VERSION!!!1/4 C Kernels + 1/8 tsp Kosher Salt +1 TBS Canola Oil + 1/8 tsp Wilton Butter Flavoring + 6 (tsp sized) packages of SplendaMix the Splenda with all the ingredients before popping.This was as good as the batch made with sugar(batch #4)! In fact, you could not distinguish a difference in taste between the two!!!EXCELLENT KETTLE CORN!!!!!THIS WAS THE EASIEST/FASTEST POPPER to use. Clean up was 2 seconds, and the POPCORN was FANTASTIC!!!DEFINITELY 10 STARS!!!!! HIGHLY RECOMMEND!!! IF YOU LOVE POPCORN, YOU WILL NOT BE DISAPPOINTED!!!!I forgot to mention: the popper collapses down in size for easy storage - added bonus!!UPDATE to review:7/30/2015 I was so IMPRESSED with this popcorn popper that I ordered 2 more! I sent one to each of my children & they loved it!!!",
                "reviewVotes": "233 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHA47IT7QQTJGADFEPZUYD2Z5XNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11PP73XH29FYX?ASIN=B00NF9CT0C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2015",
                "reviewTitle": "5.0 out of 5 stars Excellent, efficient popper! I use it all the time!",
                "reviewText": "Great bowl! I've had it for over a year now, and I've made countless bowls of popcorn in that time, almost on a daily basis. Oil or no oil, salt or no salt, this is a fantastic purchase.Pros:1) Efficient popping: Compared to my other microwave popcorn bowl (Nordic Ware), this bowl is very efficient (popping all but just a couple kernels with, or without oil). I loved my Nordic Ware bowl, but this Lekue bowl blows it out of the water in terms of efficiency.2) Easy, consistent results: I just pour plain kernels to anywhere up to the max fill line built into the bowl, add a sprinkle of popcorn salt (recommended), a drizzle (maybe 1/4-1/2 tsp) of canola oil (just to help the salt stick), mix, and microwave on high (my primary microwave is done in exactly 2 minutes). It comes out consistently every time, with just a couple of kernels unpopped. Note that you'll have to find your own cooking time based on your individual microwave. UPDATE: I have found that, at least with oil, the popcorn doesn't start to burn for me until nearly every kernel has been popped, which happens around 2 minutes 45 seconds in my microwave, so I now safely cook for 2 minutes 30 seconds. Also, although I haven't found that mixing the kernels is really necessary, you can massage the bowl from directly underneath to mix, rather that using a utensil.3) Good popcorn texture: similar to store-bought bagged microwave popcorn (maybe even better), not like air-poppers which, in my experience, dry out the popcorn.Cons:1) A little hard to wash: The bowl is very flexible, and, as such, is a little difficult to hold while washing. That said, I've gotten used to this, and simply hold the bowl with my opposite hand directly outside the bowl from the faucet/sponge. Not ideal, but the collapsing feature is more than worth it (at least for someone like me who takes it wherever I go).2) Bad results in one microwave: One of the five microwave ovens I've used tends to burn popcorn with this bowl, even if I add liberal amounts of oil. If I stop the cooking early enough to prevent burning, about half of the kernels are left unpopped. I'm guessing this is an inexpensive/low-powered oven, but I'm not sure. I would guess that bad reviews here could be mostly attributed to the microwave ovens being used. I've had very good, consistent results (see above) with my Panasonic microwave, which is 1200 Watts and has a turntable, so I'd recommend that.3) Not ideal for strong flavorings: I made the mistake of trying to add some old bay seasoning to the kernels a few times. It was good, but it seemed all popcorn I made for a while after had some lingering taste of the seasoning. Maybe I just didn't wash the bowl well enough (see above).4) It does get hot, and, as others have pointed out, the Nordic Ware has a handy lip, whereas this one does not. That said, I've had no trouble pulling the Lekue out of the microwave bare-handed. I used to think it was hot when I first got it, but now I grab it from the base, which does not get very hot. I pull the base to get it out of the oven, and then it's easy to carry the bowl by the base until it cools a little more. I believe the hottest part is the part you would normally grab from: the curved, mid-section, so avoid that. UPDATE: Also, do not touch the hollow inside of the base, where the hot kernels sit! Grab it by the outside or the very bottom edge of the base, which touches the table.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tony Lam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 23, 2023",
                "reviewTitle": "Very good popcorn popper",
                "reviewText": "I recently purchased the Lekue Microwave Popcorn Popper from Amazon, and I am thrilled with the outstanding performance and convenience it offers. This product has completely transformed my popcorn-making experience, and I highly recommend it to all popcorn lovers out there!First and foremost, the Lekue Microwave Popcorn Popper delivers delicious popcorn with incredible ease. Using this popper, I can enjoy freshly popped popcorn in a matter of minutes, without the need for any oil or butter. The silicone construction allows for even heat distribution, ensuring that every kernel pops to perfection. The result is a light and fluffy bowl of popcorn that surpasses any pre-packaged microwave popcorn in both taste and quality.One of the standout features of this popper is its versatility. It not only pops corn kernels but also allows for endless customization. I can add my favorite seasonings, such as salt, butter, or even caramel, directly into the popper before popping. This means I can create a wide variety of flavors to suit my cravings, making movie nights or snack time even more enjoyable.The convenience of the Lekue Microwave Popcorn Popper is truly remarkable. It is collapsible, making it easy to store and save valuable kitchen space. Cleaning is a breeze as well since it is dishwasher safe. Its compact size and hassle-free maintenance make it a fantastic choice for anyone seeking a convenient popcorn-making solution.Furthermore, the popper's durable construction ensures longevity. The high-quality silicone material can withstand frequent microwave use without warping or deteriorating. I have been using this popper regularly for months, and it still looks and functions as good as new.In addition to its performance, the Lekue Microwave Popcorn Popper also offers a cost-effective and eco-friendly alternative to pre-packaged microwave popcorn. By using loose corn kernels, I can reduce waste and control the quality of ingredients used. It's a win-win situation for both my taste buds and the environment.In conclusion, the Lekue Microwave Popcorn Popper is a fantastic investment for popcorn enthusiasts. Its ability to produce delicious, customizable popcorn quickly and conveniently sets it apart from other options on the market. With its versatility, durability, and eco-friendly nature, it has become an essential kitchen tool for me.I highly recommend the Lekue Microwave Popcorn Popper to anyone looking to elevate their popcorn experience. Say goodbye to pre-packaged popcorn and embrace the joy of freshly popped, homemade goodness!I hope this review helps others discover the incredible benefits of the Lekue Microwave Popcorn Popper. Enjoy the delightful popcorn it creates!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rickard S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on January 23, 2024",
                "reviewTitle": "It's a must have for any popcorn lover",
                "reviewText": "Works very well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 20, 2023",
                "reviewTitle": "Vraiment très pratique !",
                "reviewText": "Parfait ce produit qui facilite grandement la réalisation de pop-corn. Fait le job !Beaucoup plus rapide et facile à nettoyer qu'avec une casserole/poêle.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jaelcn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 25, 2023",
                "reviewTitle": "Imprescindible en mi cocina",
                "reviewText": "Este ingenioso utensilio ha demostrado ser un aliado excepcional en mi cocina y para mi salud.La notable eficiencia del recipiente Lékué para la preparación de palomitas ha sido una revelación en mi rutina de cocina. Su diseño innovador, junto con su tonalidad vibrante, añade un toque de estilo a mi cocina. La facilidad de uso es digna de elogio, ya que basta con colocar los granos de maíz y esperar unos minutos para disfrutar de palomitas frescas y saludables, libres de aceite.La calidad de los materiales utilizados en la construcción de este producto es evidente al primer contacto. La silicona de grado alimenticio utilizada no solo es segura para la cocción, sino que también es fácil de limpiar, lo que facilita considerablemente la tarea después de una deliciosa sesión de palomitas.Además, su tamaño estándar es perfecto, permitiendo la preparación de una cantidad adecuada para compartir en familia o disfrutar durante una noche de películas en casa. No solo he quedado impresionado por su rendimiento constante, sino que también he experimentado una reducción en el desperdicio al optar por granos de maíz naturales en lugar de las alternativas embazadas.En resumen, el \"Lékué Recipiente para cocinar Palomitas\" ha superado mis expectativas en términos de practicidad, diseño y resultados finales. Es un accesorio culinario que ha encontrado un lugar permanente en mi cocina y que recomendaría entusiastamente a todos aquellos que buscan una forma sencilla y efectiva de disfrutar de palomitas caseras de alta calidad.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ng",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 11, 2023",
                "reviewTitle": "Gelang direkt",
                "reviewText": "Habe die Schale gestern bestellt, heute Abend angekommen.Kurz gespült und dann probiert.Habe die Rezensionen und die \"Zubereitungstipps\" angeschaut.Nach Augenmaß bis unterhalb der Linie Seeberger Popcornmais eingefüllt.Dann etwas weniger als 1 EL Zucker drüber.Und vielleicht 1 EL Öl. Hatte nur Rapsöl.Deckel aufgelegt.Meine Mikrowelle hat 850Watt.Ich habe 4 Minuten eingestellt.Nach 1:20 begann das Poppen.Bei 3 Minuten war es dann wieder ruhig.Ich habe die Schale aus der Mikrowelle geholt und das Popcorn in eine Schüssel umgefüllt.Ein paar Körner sind nicht gepoppt.Kein verbranntes Popcorn.Ein paar wenige Zuckerkörner waren noch drin.Vom Geschmack angenehm.Ich werde das nächste Mal den 1 EL Zucker voll machen.Nach ein paar Tagen kann ich sagen, dass bei mir die Zeit bei 2:40 bis 3:20 liegt.Heute sind genau 7 Maiskörner nicht gepoppt. Öl kann man dranmachen, es ist aber auch ohne Probleme mögliche, Maiskörner und Zucker ohne Öl zu verarbeiten.Schüssel+Deckel lassen sich nach der Nutzung mit etwas Spüli leicht reinigen.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$21.95",
                "sellerName": "eKitchenWorld",
                "sellerRating": "5"
            },
            {
                "price": "$22.00",
                "sellerName": "Sterling Avenue",
                "sellerRating": "4.5"
            }
        ]
    }
}