{
    "remaining_requests": 35530,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Home-Appliances-Cocker-Microwave-Chibikuro-kun/dp/B001UV40PY",
    "body": {
        "name": "Home & Appliances Rice Cocker Only for Microwave Oven 2-cup Chibikuro-kun Model:",
        "price": "$15.80",
        "originalPrice": "$15.80",
        "rawPrice": 15.8,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Home-Appliances-Cocker-Microwave-Chibikuro-kun/dp/B001UV40PY",
        "soldBy": {
            "sellerID": "AUBN54HLJKC0N",
            "name": "Thunder Japan",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AUBN54HLJKC0N&asin=B001UV40PY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B075ZPVXD7"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "16",
        "stockDetail": "Only 16 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41N95juMXXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51XtFAa48EL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BQ1Ivpu4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zx95QaGoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CSnt -jdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rdotvO9NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lixhChK-L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the dretec Store",
            "link": "https://www.amazon.com/stores/dretec/page/56F0F2B3-175B-4E0A-8140-7CAF3C80A88A?ref_=ast_bln"
        },
        "brand": "dretec",
        "merchantInfo": "Sold by ClickJapan com and Fulfilled by Amazon.",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 4133,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 7 hrs 43 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Size: Approx. 5.5 x 5.5 x 5.4 inches (140 x 140 x 13",
            "Weight: Approx. 8.5 oz (245 g)",
            "Materials: Main Body, Inner Lid/Outer Lid: Heat-resistant polypropylene (with binchotan charcoal), Measuring Cup: Polypropylene, Rice Spatula: Polypropylene (with binchotan charcoal)",
            "Capacity: Inner container: Approx. 0.4 gal (1.2 L)",
            "Note: Not for use on open flames, ovens, and toasters",
            "Cook delicious in as little as 7 minutes. Very light and easy to handle. Easy to adjust the cooking preferences of your cooked rice, soft rice, and easy to use. You can cook rice sauce, and if you choose the function, you can cook 2 cups"
        ],
        "description": "The \"Chibikuro-chan 2 Cup Cooker with Binchotan Charcoal\" is a rice cooker for cooking small amounts of rice quickly and deliciously. You can also use the hot cake mix and milk to steamed bread. Cook from 0.5 servings to 2 servings. Measuring cup with a non-stick scoop. How to use How to cook white rice (1) Measure your desired amount of rice with the included measuring cup. 2 pairs of scraping cups (1 serving). (2) Place rice in the container and then peel it off. (Use the inner lid to drain. (3) Fill with rice and add water according to the amount of rice. (It can be kept for 15-30 minutes depending on temperature difference in summer and winter). Water volume: 2 gross / approx. 14.2 fl oz (420 cc), 1 gross / approx. 7.2 fl oz (220 cc), 0.5 gross / approx. 4.2 fl oz (120 cc). (4) Lay rice flat and place the lid on the middle and cover the top lid with the upper lid (middle lid facing up). Heating time: 2 gross / approx. 13 minutes, 1 gross / 9 - 10 minutes, 0.5 - 7 - 8 minutes (5) After heating, steam for 10 minutes to 15 minutes. Then stir in a way that loosens the entire body. The amount of water, heating time and steam time are only a guide. Adjust to your preference. Since the microwave heats up rapidly, if you do not have enough water for rice, it will lead to rice. If you need it in a hurry, please handle the warm water to adjust it. Please note that white rice may be slightly spilled on some items. The listed heating time is a standard 500 W microwave oven. When using 400 - 600 W, please heat it up by 10 - 20 %. The heating time may vary slightly depending on the microwave manufacturer and model, so it is necessary to add heating time little by bit. Care Instructions: Before using, please fill the container with water for about 8 minutes, set the lid and other items and boil before using. It will release plastic smell. Please wash the stains after use with a mild dish soap and a soft sponge. (The scrubbers, pollen, and sponges with abrasive material may cause scratching.) Precautions for Use: Since it is for microwave use, please do not use on direct flames, orbovetops, or toasters. Avoid cooking in the microwave or cooking food with low moisture. When heating, make sure to set the rice cooker in the center of the microwave. When using in microwave ovens, grill and toaster function (composite) microwave safe. If the composite electronic electromagnetic has a key for \"rice cooking\", do not use the key, and be sure to use the \"stove\" key. Please avoid cooking with oily foods as the temperature may become very high. After cooking, transfer to another container. If you want to store it, please transfer it to a storage container. Do not store this product. Do not place near fire. When removing from the microwave, be sure to hold the outer container with both hands. It may break if dropped or exposed to sudden impact.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Rice Cookers",
                "link": "https://www.amazon.com/rice-cookers/b?ie=UTF8&node=678540011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "dretec"
            },
            {
                "name": "Capacity",
                "value": "1.2 Liters"
            },
            {
                "name": "Product Dimensions",
                "value": "5.35\"D x 5.51\"W x 5.51\"H"
            },
            {
                "name": "Power Source",
                "value": "Corded Electric"
            },
            {
                "name": "Product Care Instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Special Feature",
                "value": "Easy to handle"
            },
            {
                "name": "Material",
                "value": "resin"
            },
            {
                "name": "Lid Material",
                "value": "Plastic"
            },
            {
                "name": "Item Weight",
                "value": "10.4 ounces"
            },
            {
                "name": "Wattage",
                "value": "200 watts"
            },
            {
                "name": "Included Components",
                "value": "No"
            },
            {
                "name": "Voltage",
                "value": "100 Volts"
            },
            {
                "name": "Model Name",
                "value": "56-03601"
            },
            {
                "name": "Manufacturer",
                "value": "カクセー(Kakusee)"
            },
            {
                "name": "ASIN",
                "value": "B001UV40PY"
            },
            {
                "name": "Item model number",
                "value": "COMINHKPR19580"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 4,133 ratings 3.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#77,262 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #154 in Rice Cookers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Volume",
                "value": "1.2 Liters"
            },
            {
                "name": "Dishwasher compatible",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Import",
                "value": "Imported"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JannieJo8",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI5B4RTECCVTDCRFIMMG22EWKSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XTI4FDPC8EJW?ASIN=B001UV40PY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2022",
                "reviewTitle": "5.0 out of 5 stars Handy, easy rice, soup & cereals! Nice price.",
                "reviewText": "Great little rice maker. Replaces a small electric one that only lasted about a year. Takes up less space in my cupboard. Makes one large or 2 smaller servings of rice. Great for nuking soup instead of stove top or regular bowl boiling over in microwave. Excellent for hot cereals, too!No English directions, but a little research & experimentation with your own microwave solves that.Raised to 5⭐️ Use this a LOT for a variety of dishes! Just sent one to my sister.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul H. Diener",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBFNYR4ASXFUYWTCVZSA7JWVSOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R888OSMGRLE2N?ASIN=B001UV40PY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2016",
                "reviewTitle": "5.0 out of 5 stars Got it to work!",
                "reviewText": "The idea of using a microwave to cook rice was not something I thought was a really viable alternative to a rice cooker. And my first attempt did produce a rather hard mass of rice fused together. As in other reviews there was no instruction in English, so trial and error was the only solution. What worked for me after the second attempt was to put one measured cup of rice in the container and put about three cups of water in and stirred it around with the included rice paddle for a few minutes and drained it using the inner lid. This gets rid of a lot of the starch. (I had not done this the first time along with not enough water which accounts for the hockey puck I had produced) Then I added two measured cups of water, added a little bit of pulverized garlic and salt (not garlic powder) and set it to cook for 11 minutes. At the 5.5 minute mark I stopped the microwave and stirred (really just to check on it to see if there was enough water) and set it to cook for another 5.5 minutes. I took it out of the microwave and set it on the counter for two minutes and opened it up to find two perfectly cooked cups of fluffy rice. I used long grain Basmatti rice and look forward to trying different types now that I know it works, and works well.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon MomAmazon Mom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5XNE24FMCVXD73IIMEKSBGZP5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LMMVBUJDQ8GF?ASIN=B001UV40PY",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2021",
                "reviewTitle": "1.0 out of 5 stars Worst Amazon Product",
                "reviewText": "Since this did not come with English instructions, I followed a reviewer's advice on how long to set the microwave for 2 cups of rice. Big mistake, do no follow any of their tips no matter how well intended. I set it for 13min (7.5 per cup they advised) but water boiled out of the lid so badly and made a mess of my microwave. I even thought the lid had melted but thank goodness it didn't. So I scanned the included Japanese directions on google translate and it says to microwave 2 cups rice at 9minutes in a 700w microwave. I went to a friend's to use their smaller microwave which was 700w but at 8minutes again a lot of water boiled out of the lid (see pic). And again the rice was hard, even after letting it cool off for 30min in the pot after cooking as some reviewers advised.This thing is a piece of junk, Amazon's worst product and should be removed from their site as it's simply dangerous. Wished I took a photo of how awful it looked boiled over yesterday. This photo does not show how badly the water can boil over if left heating for over 8minutes and I'm not gonna attempt a 3rd try and having to clean up my microwave again from an explosion of hot water. So disappointed as I've been looking forever for a mini 2 cup rice cooker for our son to use in his college dorm because they have very small microwaves.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61M4AU2QzIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4WSGLQUKPSML4KMG7D4X564SOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L3IQ70BI2QFD?ASIN=B001UV40PY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2018",
                "reviewTitle": "4.0 out of 5 stars Good Cooker, English instruction follow if you need",
                "reviewText": "Works great. just wish I they had included English directions.That was easy to fix, found these directions on the site for a different brand name, but identical looking cooker.How To UseEnjoy cooking fresh rice quickly and easily!• Measure out desired amount of rice. As a basic guide, one scoopful (150g) of dry white rice will make approximately two servings of cooked rice.• Put rice into microwave pot and rinse well. Use inner lid to pour out dirty water without losing any rice.• When rice is properly rinsed (the water should start to look clear when poured out), leave the rice in the pot and fill with water until rice is just covered (approx. 420ml for 2 scoopfuls, 220ml for 1 scoopful, 120ml for 1/2 scoopful), then leave to soak for approximately 20 minutes.• After the rice has soaked, make sure that the rice is levelled, then place the inner lid on (making sure the handle tab is facing upwards) and clip on the outer lid.• Microwave for the following times (in a 500W microwave):2 scoopfuls = approx. 13 minutes1/2 scoopful = 7-8 minutes1 scoopful = 9-10 minutesBe sure to adjust cooking time by 10-20% for every 100W higher or lower than 500W depending on which microwave you have.• After heating, allow rice to sit for 10-15 minutes, then mix well to loosen before serving.These were the instructions for Zatarain’s boxed Rice pilaf mix.It worked fine in the cooker.MICROWAVE DIRECTIONS1. MIX 1 3/4 cups hot water, Rice Mix and 1 tbsp. butter or margarine (optional) in 2 1/2-quart microwavable bowl until well blended. Cover.2. MICROWAVE on HIGH 5 minutes. Stir. Microwave on MEDIUM (50% power) 15 minutes or until rice is tender, stirring occasionally. Let stand in microwave 5 minutes. Fluff with fork before serving.Microwave ovens vary; adjust cooking times as needed. Cooking times are based on an 1100 watt microwave oven.CAUTION: Bowl and contents will be very hot. Use pot holders when removing from microwave.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHC47OSHN2JO6P24REUVGFHV36DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VC6R5YJ7DBYB?ASIN=B001UV40PY",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 17, 2023",
                "reviewTitle": "3.0 out of 5 stars Works ok but instructions are only in Japanese",
                "reviewText": "This steamer works okay, but you already need to know how to microwave rice unless you can read Japanese. Luckily I microwave rice often. And what instructions I could read shows the instructions are for small low power microwaves (500 - 700W). Mine is 1100W. Luckily for me, this steamer will only be used once or twice a year.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sasha72",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 6, 2018",
                "reviewTitle": "I love it.",
                "reviewText": "Since the product manual is in Japanese, this is how I use it. I often cook rice this way unless I need to cook SUSHI rice where a more expensive rice cooker excels in taste. I measure one cup in a SANDWICH bag, wash the rice in the bag, drain, add a cup and a half of water (add more water if you like), close the bag and leave the BAG t in the cooker for a few hours or overnight. I microwave it for 12-15 minutes while preparing a meal..Using Ziploc bags prevents water from spilling out of the cooker..",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ふくちゃん",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 11, 2024",
                "reviewTitle": "無洗米でも浸水時間は必要でしょう…",
                "reviewText": "30分以上の浸水時間は確保しないと美味しいお米を不味くさせてしまうような気がします…。精米技術が先進したのでお米は磨ぐのではなく、糠臭さを水洗いするような感じでもお米はキレイになっちゃいます…。でも浸水時間は必要不可欠！レンジ炊飯は水加減！取扱説明書の通りだと硬いので加減して、おにぎり仕様にするなら米油とアジシオを添加して炊飯しても美味しいでしょう…。製品は間違いありません…。お米の状態に依存しているようです。楽しんで美味しく頂きましょう…。健康第一で頑張りあいましょう！",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rui Messias",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 10, 2023",
                "reviewTitle": "Mini rice cooker",
                "reviewText": "Microwave mini rice cooker, very handy 👌 and easy to take anywhere 😀",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bluejeh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 7, 2022",
                "reviewTitle": "Rice Cooker",
                "reviewText": "There is no English on the box or in the instructions. It only says 700w. I assume this is 700 watts but Canadian microwaves are often 1200 watts. There is no way to tell how long or at what power this plastic pot should be cooked. The rice was definitely not cooked. Very poor.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "こたろーこたろー",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 12, 2024",
                "reviewTitle": "いまのところ・・・",
                "reviewText": "いままで使っていたものより背が高い分、吹きこぼれはない様子。だが、水分は結構レンジ内に出ているので、レンジの手入れは必要かと。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61hy4BQyg7L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$15.80",
                "sellerName": "SunflowerShop",
                "sellerRating": "5"
            },
            {
                "price": "$18.99",
                "sellerName": "Fun Fun Hobby Japan!",
                "sellerRating": "5"
            },
            {
                "price": "$25.59",
                "sellerName": "Amazon Japan",
                "sellerRating": ""
            }
        ]
    }
}