{
    "remaining_requests": 35379,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GE-JVM3160RFSS-Range-Microwave-Stainless/dp/B00F2QFX5O",
    "body": {
        "name": "GE JVM3160RFSS 30\" Over-the-Range Microwave Oven in Stainless Steel",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/GE-JVM3160RFSS-Range-Microwave-Stainless/dp/B00F2QFX5O",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31gQu99d4YL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31dQ8bmO3BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416GgT45twL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418H97Z18LL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TQNrQ3qHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rob-foncL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uUQnYhUsL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91-42Ui3NXL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91-42Ui3NXL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the GE Store",
            "link": "https://www.amazon.com/stores/GEAppliances/page/401D5506-7BB9-4E49-94A6-AFAD9305E71F?ref_=ast_bln"
        },
        "brand": "GEAppliances",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1177,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1. 6 cu. ft. capacity. 1000 Watts (IEC-705 test procedure)",
            "Dimensions: 29.87\" W x 15.25\" D x 16.5\" H | Net Weight: 63.0 lb",
            "Auto and time defrost. Defrosting times and power levels are programmed automatically or manually for optimal results",
            "Turntable On/Off. Controls turntable operation",
            "Two-speed, 300-CFM venting system. Removes smoke, steam and odors"
        ],
        "description": "1. 6 cu. Ft. Capacity convenience cooking controls auto and time defrost turntable on/off two-speed, 300-cfm venting system^^color: stainless MICROWAVES number: jvm3160rfss commercial category: over-the-range TOTAL capacity (cubic feet) : 1. 6 Microwave watts (iec-705) : 1000 power levels: 10 turntable: glass Microwave convenience cooking controls : Popcorn beverage potato reheat defrost: WEIGHT/time cook time overall depth: 15. 25 overall height: 16. 5 overall WIDTH: 29. 875.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Microwave Ovens",
                "link": "https://www.amazon.com/Microwave-Ovens-Small-Appliances/b?ie=UTF8&node=289935"
            },
            {
                "name": "Over-the-Range Microwave Ovens",
                "link": "https://www.amazon.com/b?ie=UTF8&node=3741611"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "1.6 Cubic Feet"
            },
            {
                "name": "Special Feature",
                "value": "Convenience Cooking Controls, Turntable On/Off, Two-speed, 300-CFM Venting System, Auto and Time Defrost See more"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Residential"
            },
            {
                "name": "Installation Type",
                "value": "Easy Mount"
            },
            {
                "name": "Wattage",
                "value": "1000 watts"
            },
            {
                "name": "Ventilation Type",
                "value": "Recirculating"
            },
            {
                "name": "Controller Type",
                "value": "Touch"
            },
            {
                "name": "Power Consumption",
                "value": "1000 Watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Touch Pad"
            },
            {
                "name": "Frequency",
                "value": "1183 MHz"
            },
            {
                "name": "Lock Type",
                "value": "Child Lock Available"
            },
            {
                "name": "Number of Power Levels",
                "value": "10"
            },
            {
                "name": "Timer Function",
                "value": "Timer Function Available"
            },
            {
                "name": "Energy Consumption",
                "value": "1000 Watts"
            },
            {
                "name": "Defrost System",
                "value": "Defrost"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,177 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#43,842 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #7 in Over-the-Range Microwave Ovens"
            },
            {
                "name": "Brand",
                "value": "GE"
            },
            {
                "name": "Included Components",
                "value": "JVM3160RFSS"
            },
            {
                "name": "Import Designation",
                "value": "Made in US"
            },
            {
                "name": "Model Name",
                "value": "JVM3160RFSS"
            },
            {
                "name": "Model Number",
                "value": "JVM3160RFSS"
            },
            {
                "name": "Product Dimensions",
                "value": "15.56\"D x 29.88\"W x 16.13\"H"
            },
            {
                "name": "Item Weight",
                "value": "40 Pounds"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Material",
                "value": "Stainless Steel, Glass"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHL42AHAAYVDIBPEBPJUPLJDABTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFOQN7JW3CTHA?ASIN=B00F2QFX5O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2021",
                "reviewTitle": "5.0 out of 5 stars Great MIcrowave!",
                "reviewText": "We first got an over the range Samsung microwave years ago. I wasn't happy about having to put holes into the cabinet but we did so anyway. It didn't last 3 years. In fact, that one started making grinding noises after about 1.5 years though still worked for about another year or so, as long as you didn't try to pop popcorn for some reason. The next one was a Frigidaire. I disliked it from the start. Installing the 2nd one meant new holes in my cabinet and once it was up, the beeps were so annoying that everyone in the family commented on them. It would beep like 5 times when something was done, which made everyone scurry to the microwave before the time ran out to avoid the beeping. The beeps were louder than the Samsung. Then, if you left something in the microwave, it beeped another 5 and if you quick opened the door as it started beeping....it still kept beeping anyway. Despite that part, it worked fine....but didn't last 3 years. I was so mad about the holes in the cabinets and the incessant beeps and the fact that these things don't seem to last very long that I went about 3 months with an on the counter microwave determined to never put another in again. But, as my annoyance faded and the counter clutter started to irritate me, we purchased this one. I can't say it was a perfect install, but our previous install bracket was able to be used and I only had to drill 1 new hole as I was able to use one previously drilled holes at install. The best part?? I was able to buy a 5 year protection plan for under $10, the beeping is much quieter, it stops beeping when you open the door and doesn't beep incessantly when you leave something in it. The only thing I have found that I am not 100% satisfied with is the location of the surface light. I usually turn the light on in the AM when the kitchen is dark and finding the light button has been challenging as it's not on the bottom row of buttons. My last 2 had the light in a lower corner so it was easier to find. I am working on it though and figure after a while I will remember the fan is on the bottom corner. Overall, I am so happy with this microwave. I highly recommend it!!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phil",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBMA4ZZY6BKJBFAVSFJBNV45UAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JRQCUDY6CJMQ?ASIN=B00F2QFX5O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect fit in our RV",
                "reviewText": "Purchased this unit to replace our 2 year old OEM microwave that came in our RV. Works much better than the one the RV manufacure installed and has more features.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "My Eyes Are Up Here!",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVF6VCNP4E4LXKS2VT6YLBAA7ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIKKXLCAVY03F?ASIN=B00F2QFX5O",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 10, 2016",
                "reviewTitle": "4.0 out of 5 stars Easier to install than I thought but apparently not packaged for real world shipping",
                "reviewText": "My previous over-the-range microwave was an LG model that failed 366 days after I bought it. When I read the installation instructions for that brand I realized I was in over my head and hired somebody to install it for me.When I ordered this GE JVM3160RFSS 1.6 Cu. Ft. Stainless Steel microwave I wasn't sure if I would need to hire somebody or not. After I received it and read the instructions it was evident that not only were the instructions clear and easy to understand, the \"U\" shaped mounting bracket made the installation easy compared to the LG model which has just a bottom rail that requires millimeter-precision measuring which is practically impossible considering all walls and cabinets are at least a tiny bit wonky. I had never installed an over-the-range microwave before but with the good GE instructions and included hardware I began this job with confidence.The carton, cardboard, and Styrofoam arrived in showroom condition. Not a puncture, tear, dent, or abrasion to be seen. I was therefore surprised when I removed the microwave and discovered it was actually banged up quite a bit. There were several dents on the edges and the unit was no longer plumb. I tested it out for a few days and it functioned fine, so I decided to install it anyways because the damage was mostly limited to areas that would be covered by the cabinets and the remaining damage would be difficult to spot unless you were looking for it (the front, stainless steel, etc areas were fine). Normally I would have returned it but I had already refused one that was soaked and damaged in shipping and didn't have the patience for a third round.The installation was relatively painless except for the top screws which go into the counter above. Two holes were placed almost underneath the cabinet doors and the third would have gone too close to a cabinet wall to work a screwdriver. Also the screws were very poor quality with very soft heads. Even using a hand screwdriver it was nearly impossible to screw them in without rounding them out. I was only able to install 2 of 3 top screws but it is still very sturdy because the wall rail is what really bears the weight. Because the unit was no longer completely plumb from being banged up (the center bowed up slightly) there is a tiny gap on either side where the top of the microwave meets the top cabinet, but I think I'm the only one who can see it because I know its there. The top screw holes really need to be an inch further back and each an inch closer to center. Our cabinets are kit cabinets from a major manufacturer, installed in millions of homes, so it seemed odd to me the holes on the microwave were seemingly installed in the most difficult possible location for an installation.Although the instructions state that two people are required for installation, I had no problem doing it myself. Mostly because the instructions were so good I was able to minimize my time lifting and setting into the bottom rail.The microwave functions great. Because the keypad isn't illuminated it's impossible to use without overhead lights on, but I knew that before purchasing so no point deductions there. If the unit continues to function properly I will leave this review at 3.5 stars.This is possibly the quietest microwave I've ever owned and the surface light is very bright. The fan moves a lot of air without as much noise as one would expect.If I had another home that needed a microwave, I would buy another one of these but would hope they fix whatever problem causes a banged up microwave to be delivered in a pristine box. And the problem with the overhead screws not fitting a major supplier of cabinetry. One inch back and to the middle with each hole would solve immeasurable problems.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKC4ROXSYJPV6SZUFGPWRUF7QWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMA15NHTE9SWN?ASIN=B00F2QFX5O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars good quality",
                "reviewText": "looks and works great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rick O'Brien",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK6BR5UVDD7NSSD2KL2CQVQQR6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RHR3VT0YQX9S?ASIN=B00F2QFX5O",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2017",
                "reviewTitle": "1.0 out of 5 stars Pay attention to the reviews - 1 and done is true.",
                "reviewText": "We bought this to replace a mic that had worked well for 10 years. I was cranky that that machine died at 10 years. Those were the good old days. I should have paid attention to the reviews - we also had the experience of having this GE machine die in 13 months with a 12 month warrantee. That is precision engineering. The reason I am writing the review is the fact that the machine died so soon. I mention the complaints below because I have already gone to the effort of writing my first review on Amazon after being a customer for over a decade.Vent fan was very noisy. It has two speeds - mach 2 and mach 1.The control pad was laid out in a very counter intuitive manner. For example the \"cook time\" button was just to the right of the numeric keypad; the power control button was down at the bottom. You always had to hunt for it when you wanted it. There is no backlighting of the keypad.I did find that it cooked well.I have not arranged for a service call. The machine is completely dead. By the time I pay for a service call and any repair it will be pretty darn close to the price of a new machine from someone other than GE.",
                "reviewVotes": "172 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 7, 2019",
                "reviewTitle": "Straitforward install",
                "reviewText": "Took 2 of us to install but straight forward and fit perfectly in space of old microwave. Very user friendly and looks great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 3, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "Perfect",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. Gerk",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 3, 2019",
                "reviewTitle": "Junk.",
                "reviewText": "Frustrating. A small part somewhere associated with the door keeps blowing out a fuse. Repaired in earlier this year and now again something is wrong. I really would love to return this microwave as it is frustrating to pay for repairs...now inching up to what it actually costs to buy. Thought I was saving money...We have had this microwave two years....and it keeps breaking down...seller will not stand by their product...so don't bother ordering anything from them...this unit is truly a peace of trash.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}