{
    "remaining_requests": 35666,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Panasonic-Microwave-NN-SD372S-Countertop-Technology/dp/B00785MVRA",
    "body": {
        "name": "Panasonic Microwave Oven NN-SD372S Stainless Steel Countertop/Built-In with Inverter Technology and Genius Sensor, 0.8 Cu. Ft, 950W",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Panasonic-Microwave-NN-SD372S-Countertop-Technology/dp/B00785MVRA",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B085T4YY9M"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "30",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41sgj7 -FlL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51KLCM2A1zL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41a9Z1psXAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xDcG0uH7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4145XYiL20L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DBo79Y5NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71pzJ2TfMiL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Panasonic Store",
            "link": "https://www.amazon.com/stores/Panasonic/page/F6906AE2-27F4-463F-8810-41DB8D93F02B?ref_=ast_bln"
        },
        "brand": "Panasonic",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 2091,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Panasonic microwave: this 950 watt high power, 0.8 cubic foot capacity stainless steel countertop/built in microwave delivers a seamless stream of cooking power for even cooking and delicious flavor",
            "Inverter technology with turbo defrost: Patented inverter technology generates a seamless stream of power and delivers consistent, evenly prepared food without overcooking; Advanced inverter turbo defrost speeds up defrosting time",
            "Compact design: This countertop microwave with 11 1/4 inch turntable is thinner, lighter and more efficient, allowing you to devote less space to electronics and more to interior capacity; Internal dimensions (h x w x d): 8 1/8 inch x 12 3/8 inch x 13 7/8 inch",
            "Smart cooking settings with genius sensor: Built in automatic genius sensor adjusts power and times based on different foods; Other advantages include preset menu items, quick minute timer, delay start and child safety lock",
            "Keep warm feature: This inverter microwave keeps soups, gravies or desserts warm and fresh until ready to serve; Power source 120 v, 60 hz"
        ],
        "description": "With its sleek, stainless-steel front and silver wrap, the powerful Panasonic Microwave Oven NN-SD372S Countertop/Built-In with Inverter Technology and Genius Sensor makes a stylish and convenient addition to any home, apartment, dorm room or condo kitchen. This exceptional 950-Watt, 0.8-cubic-foot capacity stainless steel microwave with 11-1/4-inch turntable evenly heats and cooks breakfast foods, after-school snacks, dinners, appetizers and more, while the compact design makes it ideal for individuals or small families. This innovative microwave oven includes patented Inverter Technology which, unlike traditional microwaves that rely on pulse-on, pulse-off power at lower temperatures, delivers a constant stream of cooking power at every temperature for more evenly cooked meals - edges to centers - every time. With the touch of the Genius Sensor cooking button, this microwave takes the guesswork out of creating a great meal by automatically setting power levels and adjusting cooking or defrosting time for added time-saving convenience. The sensor measures the amount of steam produced during cooking and signals the microprocessor to calculate the remaining cooking time at the appropriate power level. A selection of auto cook options enable you to quickly prepare your favorite foods, such as pizza, popcorn, pasta, soup, oatmeal and other dishes. This Panasonic microwave oven externally measures 11-inch x 19-3/16-inch x 15-9/16-inch (H x W x D).",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1/000-0000000-8675309?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2/000-0000000-8675309?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3/000-0000000-8675309?ie=UTF8&node=289913"
            },
            {
                "name": "Microwave Ovens",
                "link": "https://www.amazon.com/Microwave-Ovens-Small-Appliances/b/ref=dp_bc_aui_C_4/000-0000000-8675309?ie=UTF8&node=289935"
            },
            {
                "name": "Countertop Microwave Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5/000-0000000-8675309?ie=UTF8&node=3741631"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "0.8 Cubic Feet"
            },
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Residential"
            },
            {
                "name": "Installation Type",
                "value": "Countertop"
            },
            {
                "name": "Wattage",
                "value": "950 watts"
            },
            {
                "name": "Controller Type",
                "value": "Push Button"
            },
            {
                "name": "Power Consumption",
                "value": "950 Watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Frequency",
                "value": "50 Hz"
            },
            {
                "name": "Lock Type",
                "value": "Child Lock Available"
            },
            {
                "name": "Number of Power Levels",
                "value": "10"
            },
            {
                "name": "Timer Function",
                "value": "Timer Function Available"
            },
            {
                "name": "Energy Consumption",
                "value": "950 Watts"
            },
            {
                "name": "Defrost System",
                "value": "Defrost"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 2,091 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#30,432 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #43 in Countertop Microwave Ovens"
            },
            {
                "name": "Brand",
                "value": "Panasonic"
            },
            {
                "name": "Included Components",
                "value": "Microwave, Turntable"
            },
            {
                "name": "Model Name",
                "value": "Countertop Microwave Oven"
            },
            {
                "name": "Model Number",
                "value": "NN-SD372S"
            },
            {
                "name": "Product Dimensions",
                "value": "8\"D x 12\"W x 7\"H"
            },
            {
                "name": "Item Weight",
                "value": "20.9 Pounds"
            },
            {
                "name": "Color",
                "value": "Stainless Steel / Silver"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Panasonic Microwave Oven NN-SD372S with Inverter Technology Equipped with 950-Watts of power, a 0.8-cubic-foot and Panasonic Inverter Technology, this microwave oven delivers fast, even cooking and delicious results.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e132373f-0c32-4cff-81c6-a06ced56890d._CR0,0,970,300_PT0_SX970__.jpg"
                ]
            },
            {
                "media_text": "Auto Cook Options - Settings for Your Favorite Foods Frozen Entrees and Vegetables Soup Oatmeal Pizza Pasta and More A Steady Stream of Cooking Power for Even Results Inverter Technology for Constant Cooking Power and Shorter Cooking Time Panasonic’s Inverter Technology generates a steady stream of power at all temperature settings. Shorter cooking time along with consistent, evenly prepared food — edges to center — across a wide range of cooking techniques. Poach, Braise and Steam to Perfection Inverter Technology delivers microwave energy in a way that allows delicate foods to simmer without overcooking. In addition, foods retain more color, texture and nutrients for fast, easy and delicious results.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/db83584a-1eb4-4d77-bb03-f5c6eecd4bf5._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Maximum Interior, Minimum Footprint The smart, compact design of the Panasonic NN-SD372S Inverter power unit devotes less space to electronics and provides far more interior capacity. The 0.8-cubic-foot capacity with 11-1/4-inch turntable is ideal for accommodating breakfast foods, after-school snacks, dinnertime meals and appetizers when entertaining. The smaller, more efficient energy and control units are also up to eight pounds lighter than conventional microwave components. All of which adds up to more interior space, while taking up less space on a counter.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1c4b40af-f7ef-4c7f-9da1-13ded770343a._CR23,51,451,451_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Ease of Use Features Intelligent, Intuitive Controls Provide a High-End Look A sleek, touch-button control panel with pop-out programmable dial and four-digit display provide a high-end look, with one-touch sensor cook and reheat. Turbo Defrost Thaws Food Quickly and Evenly Advanced Inverter Turbo Defrost utilizes a microwave sequencing system based on the Inverter's continuous-power delivery method to thaw foods more evenly and quickly. Keep Warm Feature Maintains Food Temperature Keep foods like vegetables, soups, hors d'oeuvres, gravies, sauces and desserts warm and delicious in the oven until they're ready to serve. Modern Convenience for Versatile Food Preparation More advantages include a quick single-minute timer that lets you set cooking and reheating times in single-minute intervals, delay start feature and child safety lock.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/67ac7561-d394-4723-9c14-8fe7cc6f460b._CR14,0,734,734_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/aa2a4be6-d546-435c-b980-d7d16e18b75d._CR0,0,220,220_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/27a8e618-bdbe-4e09-88b5-a0636413c423._CR0,0,220,220_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ea2e9c3b-160e-4c66-9c4b-faf6fe78221c._CR0,0,220,220_PT0_SX220__.jpg"
                ]
            },
            {
                "media_text": "Panasonic NN-SD372S Panasonic NN-SN686S Panasonic NN-SU696S Panasonic NN-SN766S Panasonic NN-SN966S Panasonic NN-SD945S Watts 950 1200 1100 1250 1250 1250 Capacity 0.8 Cu. Ft. 1.2 Cu. Ft. 1.3 Cu. Ft. 1.6 Cu. Ft. 2.2 Cu. Ft. 2.2 Cu. Ft. Turntable Size 11.22 Inch 13.39 Inch 12.4 Inch 13.39 Inch 16.5 Inch 16.5 Inch External Dimensions (H x W x D) 11\" x 19-3/16\" x 14-13/16\" inch 12-1/4\" x 20-11/16\" x 15-13/16\" inch 20.44\" x 16.63\" x 12.38\" inch 11-15/16\" x 21-7/8\" x 19-7/16\" inch 14\" x 23-7/8\" x 19-7/16\" inch 14\" x 23-7/8\" x 19-15/16\" inch Base/Body Stainless Steel/Silver Stainless Steel/Silver Stainless Steel/Silver Stainless Steel/Silver Stainless Steel/Silver Stainless Steel/Silver Power Inverter Inverter Non Inverter (LC) Inverter Inverter Inverter Sensor Yes Yes Yes Yes Yes Yes Child Lock Yes Yes Yes Yes Yes Yes Door Design Square Release Button Square Release Button Square Release Button Square Release Button Square Release Button Square Release Button Auto Menu 9 14 7 14 14 19",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/e132373f-0c32-4cff-81c6-a06ced56890d._CR0,0,970,300_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/db83584a-1eb4-4d77-bb03-f5c6eecd4bf5._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1c4b40af-f7ef-4c7f-9da1-13ded770343a._CR23,51,451,451_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/67ac7561-d394-4723-9c14-8fe7cc6f460b._CR14,0,734,734_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/aa2a4be6-d546-435c-b980-d7d16e18b75d._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/27a8e618-bdbe-4e09-88b5-a0636413c423._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ea2e9c3b-160e-4c66-9c4b-faf6fe78221c._CR0,0,220,220_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dd1dfad0-e010-4f01-b176-50062f558b60._CR91,29,159,317_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/000eefa4-169f-47e3-b978-32cb28da4453._CR136,54,157,315_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/03cc923e-a287-4096-b87e-c9bdaa8e8dc7._CR156,73,160,319_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/729d4976-4017-4498-9f2f-5b97a720566c._CR138,76,158,316_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a6bace8b-9774-4940-848b-2640d3a05576._CR112,34,156,313_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fcc78ae9-1d2e-498e-9466-fadd76519287._CR97,46,158,317_PT0_SX150__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "trancelucence",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNK6ATYRNYJDUY6CXJ2MNEIDEAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP7STCEWKX1K2?ASIN=B00785MVRA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2017",
                "reviewTitle": "5.0 out of 5 stars Innovative, a big improvement BUT DEAD AFTER 6 MONTHS",
                "reviewText": "[SEE UPDATE @ END] I LOVE this microwave. I have owned many dozens of them, purchased them for commercial and residential properties, noted their energy consumption, etc. In fact, we were the first people we knew to purchase one of these wondrous devices, a Gaffers and Sattler, in 1974. Friends and family would bring things over to heat up, no-one could believe how fast it was, a marvel. Back in those days you could use metal in them, in fact the cookbook that came with it described how you could wrap items that cooked faster (like the tips of wings of chickens, for example, or bread/rolls when reheating plates of food) with aluminum foil, and poke strategic holes in it, to prevent them from overcooking. I became quite good at it. I still miss that feature. But I digress.I had my doubts about using the dial instead of a number pad, and anticipated seeing if it really cooked more evenly. After several weeks of use I MUCH prefer the dial to a number pad- it takes about two seconds to enter any cooking time with it, actually easier, second nature now. As for cooking times, even though I went from a 1200 watt microwave, so far the overall cooking time at sea level is either about the same or less for most things I've tried. Water takes a little longer to boil, but frozen dinners cook in about the same amount of time or less (depending on the proportion and distribution of carbs to fats), with less energy consumption (25-30%). Fantastic.As for even cooking, I've long modified cooking instructions because much of the time they don't produce the best result. For example, if you follow the instructions for Swanson Hungry Man classic fried chicken dinners, the smaller pieces of chicken come out hard as a rock and mostly inedible (that's when I miss my aluminum foil). In this microwave with reduced cooking time the chicken came out perfect. I've noted a lot of items cook more evenly, i.e., at the midway point when you pause and stir the still partially frozen food, like with Stouffer pasta dishes, the pasta is more thawed/less frozen, so less cooking time is needed overall. (Though with some dishes, like Stouffer's mac and cheese, I like to cook it about twice as long as called for to get it to brown, to have it turn out like mac and cheese from the oven). I do a lot of microwave cooking, e.g., make brownies, corn bread, nut breads, etc. (brownies cooked in microwave muffin pans take about two minutes on high), and this microwave produces better, more even cooking (oftentimes the very center of baked items is still raw, especially if cooked in a cake pan or pie plate; in experimenting with power level, etc., I've found this not to be the case with this microwave). Great! I've yet to experiment with foods like quiche, chili rellenos, or rice dishes. Added Later: Finally got around to using Defrost, and here is where this microwave REALLY shines. No cycling on and off, and meat evenly defrosted! None of the typical some parts half-cooked, some still frozen business, which can ruin the entire meal. And POPCORN- for the first time ever, no unpopped kernels, not one, without the popcorn being overcooked. Perfect popcorn!Anyway, I love the operation of this (it's quiet, with a pleasant tone when it finishes, the LED light inside is nice (though it could be brighter), and the green LED display coordinates nicely with my aqua color scheme, the look of it (brushed stainless, classy), and the energy savings. I'm using it in my vintage travel trailer on a separate 15 amp circuit along with my Hessaire evaporative cooler, and I don't have to turn off the cooler (it only draws 85 watts) when using the microwave, which will be really nice come summer. Couldn't be happier with this microwave, highest recommendation!P.S. I just read a number of one-star reviews and was shocked at the reported unreliability, the failure rate. I've had a Panasonic DVD Recorder that's worked flawlessly for years now. One review said that Panasonic admits that the microwave doesn't work on new circuit breakers that employ arc fault detection. I just had my vintage travel trailer rewired, replaced fusebox with new circuit breakers. Don't know if they employ arc fault detection but the microwave works fine. I'm glad I didn't read these reviews before buying because I wouldn't have bought it, and wouldn't have had the chance to experiment with the inverter technology. I love this thing, I hope it doesn't fail. Personally, for $100, it's worth it (to me)- I just hope it lasts at least a year or two. I personally have never had a microwave that malfunctioned, I assumed they were all pretty reliable, apparently not. One would hope Panasonic would correct the problems. FYI, another thing negative reviews report is the fuse blowing. It's an easy matter to replace, apparently, described in one or more reviews. Anyway if my unit malfunctions or dies I'll update this review.UPDATE: Stopped working right at 6 month mark. No display, nothing. Didn't happen while in use, bizarre. Hoped it would last at least a year. Glad I got to try the phenomenal inverter technology, but. I am not mechanically inclined and won't attempt to see if it's a fuse, or have repaired, too much trouble. UPDATE #2: Got a new microwave, which didn't work nearly as well, so decided to tackle changing the fuse myself. To make a long story short, go to the questions and answer section above and type in \"fuse\". Up come people's efforts at changing it- problematic, e.g., the fuse is very hard to find, plus you have to change other components as well. So I say if you can afford to try a $100 experiment to try this marvelous technology, with the distinct possibility of the unit lasting only a few months, go for it. As I said originally I loved what the machine could do. I intend to look for another brand with the inverter technology and a better track record.",
                "reviewVotes": "167 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiger094",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWIL3OZI4AP4BVEDUNYQP2N435Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R121MGRXKF6MJ7?ASIN=B00785MVRA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect size",
                "reviewText": "This is my first impression. When my counter top microwave died I bought a1.6cu ft Toshiba inverter microwave. It was the smallest inverter they made. It's huge. I never took it out of the box. Back to the drawing board. When one of the only. 9 cu ft came up on prime day, I purchased the Panasonic and was relieved at the compact size. Much smaller than the huge Toshiba. Despite the small size, the Panasonic will fit a dinner plate. No touch pad took a minute to figure out but it's easier to operate. Push power level x times or long press, turn the dial for time and press start. Only gripe is that the keys aren't back lit. In this day and age, all microwaves should have Backlit keypads. The microwave is whisper quiet and heated very quick compared to the dinosaur it replaced. Coffee cake was hot in 10sec. Great addition to my kitchen without hogging counter space. Just cooked microwave Mac n cheese, wow, best tasting Mac n cheese out of a microwave. No rubbery noodles like other microwaves. Taste and texture like you cooked it on the stove top. I knocked a minute off the cook time and by watching it cook. Any more would boil water out of the bowl. The clear glass and brightly lit interior make it easy to keep an eye on what your cooking. Deep dish pizza was hot in about 30 seconds . As soon as I saw the cheese melting, I stopped cooking. The pizza was piping hot and delicious without that usual mushy taste.Aug 3 2023: Quick update. OK, there is a little bit of a learning curve to the Panasonic, when operating, first select the power level by pushing the power button however many times until desired power level is displayed. You can long press to. Then turn the dial to select time and press start. I was trying to use the dial with power level, wrong...lol.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.  Krupa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHC3A6CJ26IYMZ2RMTL2TCEPBITA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TL34WI1I3EUR?ASIN=B00785MVRA",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2013",
                "reviewTitle": "4.0 out of 5 stars New technology pays off - Update 10/23/2015 Well it sort of does",
                "reviewText": "My 20+ year old microwave recently bit the dust. It was 1100 watts and took up a comparably HUGE amount of space. In fact, in our new home it was as deep as the whole counter and I no longer had an island to shuffle it off to. When I shopped for a new microwave I decided I loved the power, speed, and thorough cooking of my old one but I needed to be more counter conservative with space as well as price - something smaller and under 200.00. I also wanted something that would heat as quickly and evenly as my old one, still fit a 10\" plate, and allow an 8\" square pan to rotate.The Panasonic NN-SD372S 0.8 cuft 950-Watt Microwave with Inverter Technology fit the bill in every way. It was among the least expensive we looked at and at only 19 3/16\" (L) x 14 13/16\" (W) x 11\" (H), had a very smallest footprint. The 14\" deep left plenty of room in front for resting hot pans. I was a bit leery of going down to .8 cuft but it still fits my pans and plates.The new inverter technology does away with the big bulky tube in back. I found that it really does heat more evenly, and really does heat almost as fast as a higher watt unit. Popcorn takes almost exactly the same amount of time as my old microwave, and defrosting something large only takes 1-2 minutes more. The best feature is cooking and defrosting are much more even. I no longer have cooked areas on my defrosted meat.The button functions are pretty basic. They seem to be similar to other microwaves but I mostly just use the power and the cooking times. The interior and the exterior are easy to keep clean and there is an interior light.I've been pleasantly surprised at how well this microwave performs. At almost every turn it has exceeded my expectations.Update 10/23/2015 - This microwave exceeded my expectations and performed amazingly well..... until the day it died, I got an error code a few days ago. Repair guys could only pin it down to Magnetron, control board or the inverter. All had to look at it to diagnose it ( then why bother having an error code) The the diagnostic will cost $ and the repair even more $$. Almost as much as a new microwave.I opted to replace it with the same model and get an extended warranty. I don't expect to get 20 years out of this one either but it was SO good that I'm willing to take a chance again. I did, however, reduce it to 4 stars",
                "reviewVotes": "76 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mónica Leyva Toscano",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 2, 2023",
                "reviewTitle": "Excelente!!!!",
                "reviewText": "Silencioso, bonito y funcional.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Northern Ray",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 2, 2014",
                "reviewTitle": "Great Microwave",
                "reviewText": "I have been very satisfied with this microwave. Great price and fast delivery on Amazon. Great power for the size. Extremely quiet with a door that opens smoothy. Even cooking. Nice stylish, clean look.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arturo HG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 16, 2019",
                "reviewTitle": "Esta bien",
                "reviewText": "El horno funciona bien pero hace ruido el plato cuando gira. Es problema del aro abajo del plato",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 14, 2016",
                "reviewTitle": "so far so good, will write more after using it for a ...",
                "reviewText": "so far so good, will write more after using it for a a few months",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shaheen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 23, 2014",
                "reviewTitle": "Four Stars",
                "reviewText": "Works great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}