{
    "remaining_requests": 35743,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Coffee-Handle-County-Line-Kitchen/dp/B07VJJJ764",
    "body": {
        "name": "County Line Kitchen Cold Brew Coffee Maker, Mason Jar Pitcher - Heavy Duty Soda Lime Glass w/Stainless Steel Mesh Filter & Flip Cap Lid - Iced Tea & Coffee - 64 oz (2 Quart / 1.9 Liter), Gray Handle",
        "price": "$34.99",
        "originalPrice": "$49.99",
        "rawPrice": 34.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Coffee-Handle-County-Line-Kitchen/dp/B07VJJJ764",
        "soldBy": {
            "sellerID": "A1OBTA5VH6VKJK",
            "name": "FourCity Brands",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1OBTA5VH6VKJK&asin=B07VJJJ764&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CGJK14FQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B07VJJJ764",
                "variationName": "Color",
                "variationValue": "Gray - Handle",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41TRVc7tO6L._SS36_.jpg"
            },
            {
                "asin": "B07772LL6V",
                "variationName": "Color",
                "variationValue": "Gray - No Handle",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41FZdYHFKsL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41TRVc7tO6L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41gjWQYggnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 xGVD8lLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WOVR1 -DL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417esDZPYGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mAKE70qCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XQfEGB8WL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the County Line Kitchen Store",
            "link": "https://www.amazon.com/stores/CountyLineKitchen/page/798FC600-B01F-4E97-8AE6-0FED8AEE1FD0?ref_=ast_bln"
        },
        "brand": "CountyLineKitchen",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 23951,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 10 hrs 23 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 10 hrs 23 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 14. Order within 10 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SIMPLE TO USE & CLEAN: Making cold brew has never been more straightforward. Our easy-to-use design takes the complexity out of the brewing process. Simply fill the filter with your favorite coffee grounds, add cold water, and let it steep! Cleanup is a breeze with dishwasher-safe components (do not add boiling water)",
            "EASY POUR DISPENSER, LEAK-PROOF LID: The flip cap pour spout is thoughtfully designed for effortless pouring, eliminating the need for awkward tilting or messy spills. Simply flip the cap, and watch your perfectly brewed cold coffee flow smoothly into your cup, hassle-free. It also features a precision-engineered leak-proof lid, ensuring that your brew remains securely sealed and mess-free, so you can enjoy your coffee wherever you go.",
            "INCLUDES MESH STAINLESS STEEL FILTER: Say goodbye to stray coffee grounds in your drink! Equipped with a top-notch filtration system, our high-quality mesh prevents coffee grounds from entering the jar - ensuring a smooth, clean brew every time. Ideal for making all types of beverages, including tea, its compatibility with various coffee grounds makes it a versatile addition to your kitchen",
            "BUILT TO LAST: Our Mason Jars withstand rough handling and don't leach harmful chemicals. BPA-free and food-grade quality, you have a cold brew pitcher and cold brew maker in one simple package. Our product shipping guarantee ensures full replacement or refund for any damaged items, providing you with peace of mind and satisfaction.",
            "TRAVEL-FRIENDLY DESIGN: Perfect for the home office or on the go - our mason jar cold brew coffee maker was purposely built with a handle for easy carrying - saving you a trip to the coffee shop while you work from home. Check our user guide below for recipe ideas!"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Cold Brew Coffee Makers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17807784011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "County Line Kitchen"
            },
            {
                "name": "Material",
                "value": "Glass"
            },
            {
                "name": "Color",
                "value": "Gray - Handle"
            },
            {
                "name": "Capacity",
                "value": "4 Pounds"
            },
            {
                "name": "Special Feature",
                "value": "Leak Resistant"
            },
            {
                "name": "Style",
                "value": "64 oz, 2 Quart with Handle"
            },
            {
                "name": "Included Components",
                "value": "Filter"
            },
            {
                "name": "Shape",
                "value": "Basket"
            },
            {
                "name": "Item Weight",
                "value": "2.48 pounds"
            },
            {
                "name": "Model Name",
                "value": "CLK-FGS-A033-01-AA1US"
            },
            {
                "name": "With Lid",
                "value": "Yes"
            },
            {
                "name": "Product Dimensions",
                "value": "6.25 x 4.25 x 10.25 inches"
            },
            {
                "name": "Manufacturer",
                "value": "County Line Kitchen"
            },
            {
                "name": "ASIN",
                "value": "B07VJJJ764"
            },
            {
                "name": "Item model number",
                "value": "CLK-FGS-A033-01-AA1US_CA"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 23,951 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,810 in Home & Kitchen (See Top 100 in Home & Kitchen) #2 in Cold Brew Coffee Makers"
            },
            {
                "name": "Date First Available",
                "value": "July 22, 2019"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4bfb8919-5be6-41ca-ac8c-e7e92235bdc7.__CR0,5,970,291_PT0_SX600_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/952bf4c2-5337-49c3-8cfe-16c08a35e7bf.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6adb1897-ef93-48f2-a688-9bff388abf62.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/191add45-9512-4a13-b63e-887e0e63d3f9.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f8efeb7-cf04-49d9-89aa-a01c6fff84ae.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c54b614-8b69-4217-9415-0076437b3cf1.__CR16,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ec77fd2-40fe-490b-8520-a3d48e6d30c0.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXFEDRPAXGPIBHAAUJA5B7VZTFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TN6S14BHMVRM?ASIN=B07VJJJ764",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2022",
                "reviewTitle": "5.0 out of 5 stars Great cold brew that's really easy to make",
                "reviewText": "Three people in my family are coffee drinkers, and I used to make cold brew by steeping coffee in a big bowl on the counter overnight then straining it through a cloth lined sieve into a pitcher. The coffee was good, but it was messy to make. This system is amazing. It does the same thing but in the jar we store it in, and the strainer is easy to empty and clean. I have used store bought ground coffee and coarse ground from coffee shops. The storebought tends to leave sludge in the bottom of the jar, but it's easier to keep on hand. I also find that I don't always use the handle/spout that came with it. I have reusable mason jar lids that work just fine.Here are two of my favorite recipes using our cold brew. I keep a jar of creamer that I make by pouring a can of evaporated milk and a can of sweetened condensed milk in a mason jar - shake well when you use it. Cold brew, creamer, and some vanilla coffee syrup over ice. It's easy to fiddle with the strength of the coffee flavor. I do maybe 70% coffee, 30% creamer. My daughter does more like 50/50.The other drink we make is dirty chai. I buy cartons of liquid chai at the grocery store. 1 cup chai, 1 cup milk, and I never measure the cold brew but I put somewhere between 1/2 cup and 1 cup of coffee and a little pour of vanilla syrup. My daughter says this one is starbucks tier. I would recommend this system and buy it as a gift for any coffee drinking friends.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGANGAL4RCBTU3X265Y6ZV45IIBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10BHHZ8PBQTHS?ASIN=B07VJJJ764",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2019",
                "reviewTitle": "5.0 out of 5 stars Two-jar method: minimal effort, maximal results!",
                "reviewText": "When first looking for a simple way to do cold brew at home, I ended up researching a bunch of methods & other types of equipment & decided this was the most economical system to start with. After using this equipment for about a year, I can honestly say I wouldn't do it any other way! It couldn't be easier, including when it comes to clean-up, as everything can be put in the dishwasher. But even if you wash by hand, it would be very easy to do, especially since the filter is so well-made (no sharp edges, etc) & the jars have a wide mouth. I've worked out a few things along the way that might be helpful.\"Recipe\": To maximize your yield & the exposure of grounds to water to extract the most flavor, I've found the 2-jar method is by far the easiest way to go. The lid design actually makes it even easier! I use the ratio of one ounce coarse-ground coffee to one cup of water, which is what Bon Appétit recommends. They suggest diluting this concentrate 1:1 with water before drinking, but YMMV. I usually pour about 8 oz. cold brew into a tall glass, add a couple packets of sweetener & about 2 tsp. of sugar-free Torani or DaVinci syrups, then top off the glass with unsweetened almond milk (maybe 6 oz.?), so it ends up being slightly less than the suggested 1:1 dilution.Brewing: The way to maximize the yield is to add the grinds to the jar FIRST, then the water, then insert the mesh filter, which will easily slip through the slurry. Make sure it's all the way in, then screw on the lid. Give it a good shake to thoroughly wet the grounds & you're in business! Just give it an occasional shake during the brew time and it turns out great.Capacity: I've done up to 7 oz. of coffee to (almost) 7 cups of water before, but it's a tight squeeze, so to make sure the water can easily circulate when shaking the jar, I stick to 6 oz. to 6 cups. The grounds absorb some of the water, so this usually yields about 5 cups (40 oz.) of concentrate, give or take.Straining: this is where the genius design of the lid really shines! I use an identical jar to strain the coffee into, and all you have to do is pour out as much as you can into the new jar while trying to keep the grounds toward the bottom as long as possible (which prevents them from slowing down the flow). When the flow slows to a trickle, just turn the brew jar upside down over the new jar, make sure the spout stopper is inside the mouth of the new jar, & the lid allows you to balance the brew jar on top of the new one & go on with your life as the last little bit drips out! Once the dripping is done, just switch the lid to the new jar & stick it in the fridge.Sludge: There is a bit of sludge that settles out, but it stays in the bottom as long as you don't shake the jar before pouring. Or, if you really want to shake it, let it sit a couple of minutes before pouring & it settles right out again. (Same thing if any happens to get into your glass.) If the very idea of sludge bothers you, you can use a paper filter to remove all traces, it's just an extra step that I don't find necessary.Enjoy!",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OliviaDaisy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI564FFKQQVKI7W5S3CLOHISASA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IMVWNEOHRMYE?ASIN=B07VJJJ764",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2022",
                "reviewTitle": "5.0 out of 5 stars Sturdy, simple steps and does the job",
                "reviewText": "I had to replace my Primula cold brew set because the plastic cover broke down (took it out of storage from my cellar for the summer season and cover came apart in pieces, had it about 5 yrs).I began my research and at first was looking for a fancy machine that would make the cold brew quicker. The reviews for those machines are hit or miss. I decided to keep looking because I didn’t want to spend the money on so-so results, nor did I want to have to bother with a return.I did like the Primula system and saw they had newer options but one upgrade I hoped for was a bit more of a yield so a batch would last my work week. My search continued and I decided to look at the highest reviews with a good # as well. I looked on Google but settles at Amazon for the most options.Came across this one, checked out the videos (well done for the lost part) and the reviews were overwhelmingly positive. Price was good, process simple and looked like the yield was decent, at least would get me through the week. I’ve used it through the summer and will be putting it away now until about next Memorial Day (The verdicts is that it checks off all my boxes-- Simple to use and clean. Put all pieces in the dishwasher 1/wk.- After you account for the displaced liquid due to the filter being removed I’d say I got 4-5 cups or 32-40 oz- Price was good and comparable to others that were more complicated or fragile.- All pieces are well made, quite sturdy. I wished the handle didn’t stick out so far but because the glass container is thick and heavy (which I like) you need that leverage to hold it securely.Tip: It takes a while to fill it with water through the strainer w/the coffee, so I fill the container about 1/2 way with water and then do the rest through the strainer. I always let it brew for 24 hrs and there’s no taste difference at all.-",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SweetSookie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPAME4DRKCLYESS36PUBZBOHO5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I2JOVY05KU6B?ASIN=B07VJJJ764",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Great value, works as stated.",
                "reviewText": "This works much better than another system I purchased. It has sufficient water flow to the coffee grounds. I like my cold brew on the stronger side and I get that with this system. I let it brew 48 hours and can add more water to adjust to taste. If you like a lighter brew, less time. Easy to use and handle. I like that you don't need to measure out the coffee, just fill the filter. I coursely ground my own coffee and still ended up with silt in the bottom of the jar. I filtered it through another system with a filter made of a different material and that filtered out a lot of it. Overall makes tasty cold brew and for the amount I drink, this is more cost effective. Also I can make whatever flavor cold brew I fancy and that makes me happy. 😁",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "linus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 18, 2022",
                "reviewTitle": "The best I found",
                "reviewText": "So I bought 2 different one before trying this Country Line (2l) This is by far the best design.First of all the filter is well made. It is big enough to put your coffee so that it sit completely in the water. I like strong coffee. I personally put in 20 tbs. It came out perfect. The top of the filter also covers the mouth of the jar. The size of the filter also makes it easy to pour water on top. The ones I have tried before, the coffee kept creeping up to the top thus having to wait until it went down to pour more. It was a long processs.Second, the spout works great. I was afraid at first look, but happy to report I was wrong. It pours like a charm. My previous ones had horrible spouts. The lid of the spout also snaps into place, so leak proof.Thirdly, you can get replacement parts easily or different accessories.And lastly, it looks cool. I love the mason jar look. I am a country gal.Highly recommend",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Desolator",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 25, 2020",
                "reviewTitle": "Amazing!",
                "reviewText": "I spent the best part of a day looking at different cold brew jugs for coffee and I eventually stumbled upon this one, which is perfect! Unfortunately Amazon didn't recommend it to me (maybe because it ships from the US?) but luckily I found an article online that mentioned it.Pretty much all of the other brewing jugs I saw were tall and narrow, meaning that you could accidentally tip it out of the fridge door if opened too quickly. Many also had glass handles and lots of the comments mentioned that the handle broke after only a few uses. The narrow shape would likely have been a pain to wash them by hand as my hands are quite big. Also none of the others seemed to have a consistent seal since the spouts were often open to the air, causing the fridge air to affect the taste.None of the above are issues with this one though. I've been using it for the past month now (made about 4 brews so far) and it's been great! It's wide-mouthed which makes it easy to clean, the glass is thick with no thin handle to break and there's a good silicone seal in both the filter and the lid to keep it fresh (also great for transporting it in the car!). The mesh is great too, very fine holes and sturdy. My only complaint would be that it's not that large, but it makes enough for 3-4 mugs, though perhaps if it was any larger it may not fit in the fridge door, or cause it to have the aforementioned problem of falling out of the fridge door if opened sharply, so maybe it's for the best that it's the size that it is.Highly recommend this over ALL of the other designs, especially as it costs the same as them (~£25 after postage/import taxes).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rose",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 1, 2024",
                "reviewTitle": "Love it",
                "reviewText": "Works really well, love it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "！",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on October 22, 2023",
                "reviewTitle": "Great. Used every week.",
                "reviewText": "This product is very good.Good bits:- The cap stays closed and sealed.- The filter filters most sediment (though there are particles in the last cup, but thats due to a metal filter's limitations and not the product's fault)- It's friggin' huge. Well, it's big.- Easy to use (though the top can be a challenge to get off sometimes)- Love the glass. Looks great, measurements of all kinds, and vey accurate.Bad (?) bits:- You might think you're getting 2L out of this, but with the volume of the filter and coffee, it's more like 1.5L- but whatever. Maths.- Cleaning the filter is kind of hard. I use a たわし on a stick, or for normal people, a stiff brush would work great, but don't think that you can put your hand in there. It's narrow and it'll rip your hands up (lightly), it won't feel good. Unless you're a freak, then go for it.- It doesnt fit in my fridge door. Though, I live in Japan, where fridges are small. So, whatever. Plus, it might break my door, as it's 2L of water... so... yeah.- If i liked to complain, there's not enough to complain about. Seriously, it's great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharp in Singapore ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on April 27, 2020",
                "reviewTitle": "Sharp Handle Corners",
                "reviewText": "Nice set up. My only gripe is that the back of the handle can feel sharp against the hand. A couple of minutes with a Dremel rotary tool and a Cratex fine abrasive cone will smoothen the sharp edges of the handle.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}