{
    "remaining_requests": 35906,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ninja-CFP301-Specialty-Single-Serve-compatible/dp/B08QZSN97Z",
    "body": {
        "name": "Ninja CFP301 DualBrew Pro Specialty 12-Cup Drip Maker with Glass Carafe, Single-Serve Grounds, compatible with K-Cup pods, with 4 Brew Styles, Frother & Separate Hot Water System, Black",
        "price": "$140.75",
        "originalPrice": "",
        "rawPrice": 140.75,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ninja-CFP301-Specialty-Single-Serve-compatible/dp/B08QZSN97Z",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CMQTMDXG"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-AMJyoeBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41YicqLlgBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51P8rGIWLiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41efoXcriPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51t6-cJ8Q4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51H8MCUoW4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/7144FHF3zpL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ninja Store",
            "link": "https://www.amazon.com/stores/Ninja/page/4D837C13-1334-44EE-AD50-9586EE0F3873?ref_=ast_bln"
        },
        "brand": "Ninja",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5716,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Faster Brewing: Brew a coffee pod faster than a leading Keurig coffee maker upon startup.",
            "Dual Coffee Maker: Grounds and pods coffee system with 9 grounds brew sizes (Small Cup, Cup, XL Cup, Travel Mug, XL Travel Mug, ¼ Carafe, ½ Carafe, ¾ Carafe, or Full carafe) in addition to 4 traditional pod brew sizes (6, 8, 10, or 12 oz).",
            "4 Brew Style Choices: Select Classic, Rich, Over Ice, Specialty for your grounds or coffee pods.",
            "Specialty Brew: Brew a super-rich coffee concentrate that you can use to create delicious lattes, macchiatos, cappuccinos, and other coffeehouse-style drinks.​",
            "Independent Hot Water System: Separate from the coffee dispenser to eliminate cross-contamination. 2 temperature settings—hot and boil—allow you to make instant soups, oatmeal, or hot cocoa.",
            "Built-In, Fold-Away Frother: Turns hot or cold milk or milk alternative into silky-smooth froth.​ Removable for easy cleaning.",
            "60-oz Multi-Position Water Reservoir: Allows you to position the reservoir on the side or rear of the machine to fit your space, plus it is removable for easy refilling.",
            "Thermal Flavor Extraction DUO: Delivers perfect flavor for grounds and pods with even saturation and precise temperature control for ultra-flavorful coffee.",
            "Easy Cleaning: Clean function, dishwasher-safe parts, and removable pod adaptor allow you to easily deep clean your unit.​",
            "What's Included: Keep Warm function, Delay Brew, Fold-Away Frother, Paper Filter Kit, 12-Cup Glass Carafe, Ninja Pod Adapter, Ninja Smart Scoop."
        ],
        "description": "The Ninja DualBrew Pro Specialty Coffee System delivers Classic, Rich, Over Ice, and Specialty brews from your favorite coffee grounds or coffee pods. Customize your brew with 9 grounds sizes from single serve to carafe and 4 pod sizes from 6 to 12 oz. Use the fold-away frother to create cappuccinos and lattes or dispense hot water from the independent hot water system to make tea or soup.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "96 Fluid Ounces"
            },
            {
                "name": "Special Feature",
                "value": "Programmable, Milk Frother, Removable Tank, Thermal, Auto Clean Function, Water Filter"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Paper"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coffee maker"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Wattage",
                "value": "1550 watts"
            },
            {
                "name": "Voltage",
                "value": "120"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Style",
                "value": "4 Brew Styles + Frother"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 5,716 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,049 in Home & Kitchen (See Top 100 in Home & Kitchen) #44 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "Ninja"
            },
            {
                "name": "Included Components",
                "value": "Ninja smart scoop, Fold-away frother, Ninja DualBrew Pro Specialty Coffee Maker, K-Cup pod adapter, 12-cup glass carafe"
            },
            {
                "name": "Model Name",
                "value": "Ninja CFP301"
            },
            {
                "name": "Model Number",
                "value": "CFP301"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Product Dimensions",
                "value": "9.13\"D x 11.39\"W x 15.54\"H"
            },
            {
                "name": "Item Weight",
                "value": "9.69 Pounds"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Capacity 96 Fluid Ounces",
                "value": "Material Plastic"
            },
            {
                "name": "Item Weight 9.69 Pounds",
                "value": "Wattage 1550 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Coffeehouse Versatility Meets Pod Convenience. The Ninja DualBrew Pro Coffee System delivers Classic, Rich, Over Ice, and Specialty brews from your favorite coffee grounds or coffee pods. Use the fold-away frother to create silky smooth froth.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/724125a0-d192-4a3b-8e6b-e1c8e3dbfdf0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "4 Coffee Pod Sizes Brew your favorite coffee pod in 6, 8, 10, or 12-oz cup sizes. 9 Grounds Brew Sizes Enjoy a single cup, to travel mug, to full carafe. Choose from 9 Sizes: Small Cup, Cup, XL Cup, Travel Mug, XL Travel Mug, ¼ Carafe, Half Carafe, ¾ Carafe, Full Carafe. 4 Brew Styles Customize your grounds or coffee pods with 4 brew styles, including Classic, Rich, Over Ice, and Specialty. Create cappuccinos, lattes, and more with the Specialty brew setting. 60-oz Multi-Position, Removable Water Reservoir The multi-position reservoir can be placed on the side or back of the coffee system to fit your space. Plus, it can be easily removed for easy cleaning and refilling. Built-In, Fold-Away Frother Transform hot or cold milk/milk-alternatives into silky-smooth froth in seconds. Top your Specialty brew with frothed milk for a coffeehouse-style drink. Independent Hot Water System Dedicated hot water line eliminates flavor contamination. 2 temperature settings, hot and boil, allow you to make tea, hot cocoa, instant soups, and oatmeal.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/724125a0-d192-4a3b-8e6b-e1c8e3dbfdf0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65e7c96a-1e45-42e5-aacc-2a27dd0376cd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0fa6517e-5dd7-4acb-bd29-48eb9b7f4c7c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a575a14-6599-4911-b865-aad977d82ab9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f2a87025-af6d-4494-8abb-d075ed268e94.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7cc0281-fb2e-4ab6-b69f-7de554e92002.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a61c8444-d683-48b0-965e-a380fbb76e0b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/54293d1c-ad62-426c-8aae-c8f2ddf6c79a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3b648c5c-ad67-4783-819f-9ec78f6fff84.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Noel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDLFSJNTBXQRVUEIQIPQRE5ZPLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVPBQGSZ1CWXX?ASIN=B08QZSN97Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Yes!",
                "reviewText": "This coffee pot is great!! Super quick, has a rich brew setting, k cups, hot water, coffee, cold drinks. This is everything! Super easy to use and clean frother-finally I can froth without a big mess to clean up! So happy with this coffee pot!!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mel P.Mel P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM3XCSAWKE44ESZIOOHLBH57STA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H1CGWR9183NW?ASIN=B08QZSN97Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Wish I bought one sooner!",
                "reviewText": "It is bigger than I realized/thought doesn’t take up a massive amount of counter space.I love the touch screen and how easy it is to set the time and program it. It seems complicated but was actually very easy to figure out.One of my favorite features is the Keep Warm function- the plate has a red warning sign that lets you know the plate is still hot/on and you can set the time for how many hours you want the plate to stay warm. Secondly, I love the brew options for single serves or how I can brew a half pot, 3/4th or a full pot. And the no drip option is a plus (just use the lever under the interface to close the spout.).It also has a built in frother, which is obviously easy to use- just a button and it works very well. The reservoir is large, which is also a plus- if you mostly use single serve, you won’t have to constantly fill the water tank like with smaller single serve machines.Overall, I love this machine! There are so many brew options and they even give you a receipt book for specialty brews. It’s easy to figure out but I would recommend using YouTube for a better demonstration as the instructions aren’t great.One thing I read that most people don’t like is the it takes a minute or so to warm up but that doesn’t bother me especially because I’ll mostly be programming mine to automatically brew in the morning.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61d3DY9JJTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71fhhV7nuEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71of+fhJqcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "W. Mitchell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG3YY77QU7HEFRQWJHGOFNTZBOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SG1I80FHYC9O?ASIN=B08QZSN97Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Coffee Brewer",
                "reviewText": "I've been using Keurigs for many years but when I ran across the CFP301 on sale, I was intrigued enough to give it a try. I really liked how you could set so many brew sizes and the ability to brew 1/4 carafe if I wanted a few cups without having to make two individual cups. I actually planned to use it mostly with reusable pods, like I've always done with my Keurigs, so I ordered a set that would work with this machine (most will not). The pods I bought look to be good quality, but I've never used them. I've been using pods for so long it never clicked that with a machine like this, using reusable pods makes no sense whatsoever. Just use a regular filter, add your coffee and set the brew size to the size cup you want. But there's more. Much more. With a Keurig or other pod-style machine, you are limited by the size of the pod. They can work a little magic by slow-walking the brew for a travel mug, but it was always weaker than a standard cup and there was little you could do to remedy it except for maybe brewing two pods into one cup. With the Ninja, I can simply adjust the amount of coffee and select the desired brew size. Done. Delicious.This machine, like all of the Ninja products I own, is well engineered. The moveable tank is a fantastic idea and is easy to use. The flip-down cup holder? Awesome! The foldable frother? Very cool, and the way you can just pop it off over the cup to take it to the sink is slick. Even the \"smart\" scoop is a very nice touch. Everything is so easy to use and convenient. The carafe is well designed and easy to clean. The insert for the carafe ensures the hottest coffee is circulated from the bottom up. Nice! I've had no issues with the temperature of my coffee. It has been nice and hot every time and the hot plate under the carafe makes sure it stays that way. When using a thermal travel mug, I'll either let it cool for a few minutes or plop a small piece of ice into it. It's hot.For filters, I am using Melitta #4 and folding the seams as recommended by Ninja. These are affordable, especially if you buy them in multi-packs. The result is delicious, ground-free coffee. I've read several reviews complaining about grounds in their coffee, but they don't mention their particular setup. Are they using a permanent filter? Pods? I don't know, but I'm not getting any and I'm not sure how I could using the paper filters.As for any negatives, which I feel compelled to include in any review, the only things I can think of are insignificant. The build quality is great, but it is a lot of plastic. For the price-point, it's definitely as good as I think one could reasonably expect. As long as it holds up to plenty of use, it looks good, works very well and I'm happy with it. I do wish there was a little capacitor to power the clock temporarily during brief power outages or if you unplug it for a few minutes. This is a tiny complaint, but I already have two other clocks on other appliances in my kitchen and it's a minor nuisance having to reset all these clocks every time the power blips.I haven't had the machine long enough to do a long-term review but if anything changes, I will update my review. So far, I am very happy with my purchase and highly recommend it.Edit (11/2023): I've been using this coffee maker for five months now, and I would now be lost without it. I absolutely love the versatility. My most recent development was to dig out my old 34 oz. French press, which fits nicely under the filter basket. For the best, boldest coffee, I measure the proper amount of coffee into the press and add 24 oz. of hot water from the Ninja for my normal 2 12 oz. cups. Easiest way ever to use the press. If I need a whole pot or just quick cup, I just brew like normal. If someone has a favorite K-cup, the insert works as expected. Selecting the brew size for coffee or water has been consistent and accurate. I really, really love this coffee maker.",
                "reviewVotes": "272 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DN",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGU3OA5ZH5ELAEIQYO22T56GUP7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2907CW5644YRZ?ASIN=B08QZSN97Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2021",
                "reviewTitle": "5.0 out of 5 stars It's worth it",
                "reviewText": "I have a love/hate relationship with Ninja products - I really love them. But I strongly dislike the warranty. And I hate the lifespan. Once they are done - they're done. I have had a couple of Ninja blenders that surpass the crushing and blending power of my 30 year old beehive Oster - but their life expectancy is about five years.This was a very strong consideration in purchasing a $200 coffee maker. I am not a coffee connoisseur - I typically drink one cup daily - very strong with cream only. But it has to be a perfect cup. I want to enjoy every single sip.I found a Ninja coffee system, brand new, at a thrift store locally for $15. The coffee was amazing. Perfect every single time. When my son moved to his own place, I gifted it to him and started researching one for me. Since I am the only coffee drinker in the house now (no, I'm not crying because he's gone, don't be silly) I considered a Keurig. But I honestly do not like the quality of the coffee from those machines - have tried several but it is not at all to my liking. However, the amount of wasted coffee I was dealing with really started bothering me and decided I needed an option for one cup.This machine is really perfect. The one cup option that I thought I settled for because it is a K cup option turned out to produce an amazing cup of coffee. I THINK it is because the Ninja makes three holes into the K cup rather than the standard one hole other machines use? It may also be the water temperature gets super hot. I do not know, but I really appreciate the depth of flavor from the K cup option on this machine.Another nice option that I never thought I'd want is the frother. It seems silly to me, but one comment in the Ninja manual stated that a cold cup with cream steals the heat from the coffee and changes the flavor - so I toyed around with the frother, using the microwave for 30 seconds and then blending the coffee and cream - its fantastic.This week I had a fever and opted for tea over coffee - I remembered the hot water option on this machine - it gave me two options - hot water and boil - I selected boil and my tea was steeping in no time at the perfect temperature. I absolutely appreciate that the water runs through a separate dispenser so my tea did not have any coffee residue or discoloration or flavor. I plan now to retire my stand alone boiler.The reservoir on the Ninja is adequate for my one cup daily - it is very easy to remove and fill or even fill while in place - I prefer the side option, but like that it can be attached to the back to save space. I don't think that would make much difference because this machine is very big - it does not fit under my standard cabinets.I bought this as a birthday gift for myself and if that last son hadn't left at the same time, I likely wouldn't have spent that much money on myself - but I was pitiful. I am extremely happy I did because the cost is worth it. I am very hopeful this machine will last past my 5 year expectation.Since I do not purchase coffee daily, I cannot state that I have saved money - I mean, I have because I'm not making half pots just for myself and wasting most of that - but if I were a coffee shop customer, I would absolutely think I'd save money with the frother thing and the quality of the coffee - It is really a great machine and I very highly recommend you purchase it. I was debating between the Keurig Duo Pro and this machine and given the quality of the K cup coffee from this, I haven't once looked back - there is no way in my mind the Keurig would produce the same quality cup from the K cups.Enjoy",
                "reviewVotes": "264 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Braulio Moreno",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 7, 2023",
                "reviewTitle": "Excelete cafetera",
                "reviewText": "Muy buena ccafetera",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sid Gould",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 17, 2023",
                "reviewTitle": "Best all around coffee maker",
                "reviewText": "Haven't had a drip coffee maker of any kind for the last 10 years. I have been using a french press for the last five years and before that my coffee was made in a percolator. A friend introduced us to the variety available in coffee pods, which my wife loves, so that kind of made up my mind. The Ninja CFP301 seemed to have it all and it meant I could do coffee from grounds as well as from pods. We buy beans from a local roaster and the quality of the finished coffee matters a great deal along with the versatility of using k pods.I can't begin to say enough good things about our Ninja coffee maker. We keep 4 or 5 different types of coffee beans on hand and this machine has made great coffee from them all. The fact that it dispenses hot water for tea, etc as well as makes coffee is a bonus in a small kitchen, so no more kettle on the counter. The footprint of this machine is not as big as I feared so it fits well on our counter top. The brew styles work a charm as does the milk frother. OK, so you have to heat the milk up first in the microwave instead of steaming it hot...no problem. The 'Specialty' brew style is worth having the machine for all by itself. While it doesn't produce the crema that true espresso machines do, it makes a cup of espresso from ground coffee that looks, smells and tastes close enough to genuine espresso that making lattes and cappuccinos is easy and a great complement to my kitchen.The conversion from grounds coffee to k pods is simple and I even bought reusable pod capsules that work very well.If there is a con of any kind it's that the warming plate keeps the coffee a bit hotter than I like so that a pot of coffee doesn't age well. I turn it off after a few minutes.I heartily recommend this coffee maker and have done so to all of my coffee fanatic friends.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelly Morton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 29, 2023",
                "reviewTitle": "Not fit for purpose in UK",
                "reviewText": "My wife ordered this Ninja on Amazon UK and when delivered we found that it was for use in the USA , with a US plug attached this machine was dispatched to us from Europe, when a electrical coffee maker comes with a US Plug with 120 voltage and UK on 230 V it’s definitely not fit for purpose in the UK",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patrick Benoit",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 29, 2023",
                "reviewTitle": "Nice coffee maker, happy with it",
                "reviewText": "Nice coffee maker, happy with it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carolina Malcon Cervera",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 4, 2023",
                "reviewTitle": "Hermosa",
                "reviewText": "Se pueden hacer muchos tipos de café. Funciona excelente. Todo en 1 sola cafetera",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}