{
    "remaining_requests": 35734,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/HyperChiller-HC2-Patented-Coffee-Beverage/dp/B07FJ6J24R",
    "body": {
        "name": "HyperChiller HC2 Patented Iced Coffee/Beverage Cooler, NEW, IMPROVED,STRONGER AND MORE DURABLE! Ready in One Minute, Reusable for Iced Tea, Wine, Spirits, Alcohol, Juice, 12.5 Oz, Black",
        "price": "$17.49",
        "originalPrice": "$24.99",
        "rawPrice": 17.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/HyperChiller-HC2-Patented-Coffee-Beverage/dp/B07FJ6J24R",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BSPCWT6M"
        ],
        "asinVariationValues": [
            {
                "asin": "B07FJ6J24R",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$17.49",
                "variationImageURL": "https://m.media-amazon.com/images/I/51ctRcJeo9L._SS36_.jpg"
            },
            {
                "asin": "B08YJ9QVP7",
                "variationName": "Color",
                "variationValue": "Mint",
                "price": "$17.49",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Sc0WnaY2S._SS36_.jpg"
            },
            {
                "asin": "B08YJLRLZD",
                "variationName": "Color",
                "variationValue": "Rose Gold",
                "price": "$17.44",
                "variationImageURL": "https://m.media-amazon.com/images/I/41W69ROX2pS._SS36_.jpg"
            },
            {
                "asin": "B08YJ26Q4B",
                "variationName": "Color",
                "variationValue": "Slate Blue",
                "price": "$17.44",
                "variationImageURL": "https://m.media-amazon.com/images/I/51tWj4rkVGL._SS36_.jpg"
            },
            {
                "asin": "B0BNCKZFZF",
                "variationName": "Color",
                "variationValue": "Stainless Steel",
                "price": "$24.59",
                "variationImageURL": "https://m.media-amazon.com/images/I/41UTLgwpP8L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ctRcJeo9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51-DV7Th8mL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JgganXMkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vpnfhSm L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rBKyDsB0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51olXs7F2OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81OlIdgOtcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: HyperChiller",
            "link": "https://www.amazon.com/HyperChiller/b/ref=bl_dp_s_web_20627713011?ie=UTF8&node=20627713011&field-lbr_brands_browse-bin=HyperChiller"
        },
        "brand": "HyperChiller",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 22031,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 2 hrs 37 mins",
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 7 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "NEW, IMPROVED,STRONGER AND MORE DURABLE! We listen to our dedicated \"Chillers\", so HyperChiller is constantly improving. We've also added new colors for you to choose from! .Filter type:Reusable",
            "Improved V2 product - the easiest, most cost effective way to chill your favorite beverages. Our Patented design uses regular water to chill and because there are no chemicals or Gels, all parts of the HyperChiller are dishwasher safe.",
            "Having to hit the floor running this morning and don’t have time to prepare your iced Coffee, The HyperChiller will chill your Coffee in less than 60 seconds. Take the edge off a hectic morning by enjoying an Iced Coffee on the go.",
            "It works with ALL types of coffee makers whether you use a single brew or a K-Cup by brewing directly in to your HyperChiller. Drip style model, no problem, simply pour the Coffee from the carafe and you are Iced in 60 seconds.",
            "Your HyperChiller is perfect for chilling all of your favorite beverages whether it’s a special blend of tea, juice, wine or other adult beverages without dilution you can even chill a glass of wine. The best Happy hour accessory you can buy.",
            "This is the easiest and most convenient item to make iced Coffee without dilution. Simply fill with water and place UPRIGHT in the freezer, remove and place in your Coffee maker and brew or pour from a carafe in to the HyperChiller and then into your cup."
        ],
        "description": "Improved V2 product - a simple device to make perfect Iced Coffee in one minutechills hot Coffee by up to 130+ degrees in 60 seconds without dilutionother uses: chill whiskey, wine, Iced tea, etc. high volume 12. 5 oz. Capacitydishwasher safe.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Cold Brew Coffee Makers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17807784011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "HyperChiller"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "4.25\"D x 4.25\"W x 6.75\"H"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Moka Pot"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Style",
                "value": "french"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coffee maker"
            },
            {
                "name": "Included Components",
                "value": "1"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Model Name",
                "value": "HC2"
            },
            {
                "name": "Number of Items",
                "value": "2"
            },
            {
                "name": "Human Interface Input",
                "value": "Unknown"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Item Weight",
                "value": "12.6 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Maxi Matic"
            },
            {
                "name": "ASIN",
                "value": "B07FJ6J24R"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "HC2"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 22,031 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,155 in Home & Kitchen (See Top 100 in Home & Kitchen) #12 in Cold Brew Coffee Makers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 2, 2018"
            },
            {
                "name": "Capacity 12.5 Fluid Ounces",
                "value": "Material BPA Free Polypropylene Plastic & Food Grade Stainless Steel See more"
            },
            {
                "name": "Item Weight 0.79 Pounds",
                "value": "Voltage 120"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Danny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPI5JTHHWN5KQA5IR5W6TSBKQ6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YGQ881VIHF31?ASIN=B07FJ6J24R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2021",
                "reviewTitle": "5.0 out of 5 stars A must have!",
                "reviewText": "Definitely the greatest \"Why didn't I think of this?\" invention ever. I use it for coffee from a coffee machine as it is already lacking in flavor. Putting it on ice makes it worse. With the HyperChiller, I can get cold coffee without watering it down with ice. It deserves five stars as it does a great job and is something I use almost every day. I also want to make sure the word gets out with positive reviews. There are a few cons which I hope they fix for V3. I will buy right away.1. Price. Was this a Shark Tank product where you sign your life away for a few peanuts? Based on the quality of the aluminum inside and complaints about cracked plastic, the HyperChiller should not be more than $10. Even with the 70% overhead needed to be on Amazon, cost before freight and tariffs should not be more than a dollar from a good manufacturer in China. That being said, you gotta love capitalism.2. This can and should be Made in the USA. Unless most of the profit margin is going to paying off the Sharks, this product can be easily made stateside. It would provide safety and peace of mind as it does come in contact with something you ingest.3. The vent hole for the inside ice chamber should be placed higher up the incline. As you pour hot liquid into the main chamber, you will need a very steady hand as anything more than a slow pour will result in hot liquid going into the inside ice chamber melting the ice inside and making cooling less effective. I imagine it takes longer to cool if there is less ice on both sides of the main chamber.4. Make a bigger version. To cool faster, instructions say to swirl the liquid inside the HyperChiller. I do not fill it to the brim to avoid spillage. Capacity is stated as 12.5 ounces. That is about the size of the tall size at Starbucks. Super size me.",
                "reviewVotes": "59 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RichG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVBHZBARCOC7BLEO4B7BGBHAD4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PS23WM94ZBM9?ASIN=B07FJ6J24R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2022",
                "reviewTitle": "5.0 out of 5 stars It works good but read kinda cons",
                "reviewText": "1) if you can’t wait about five minutes for an ice cold cup of coffee WITHOUT ADDING ICE don’t get this.2) only holds 12 1/2 ounces. But 4$3) it has more parts then I thought it was going to but they’re not really a big pain. But it has you know a few parts four of them that you’ve got to maintain and make sure you don’t lose but they really don’t need to be put into a dishwasher you just wash them off and you put them back together again and you keep putting it into the freezer after you use it you dump it out you wash it out fill it up again put it in the freezer. But it has more parts and I was expecting a lot more. I was expecting it to have just one container and that’s it but it’s nothing like thatdepending on how hot the coffee is you put into it you can get 2 usages but again you’re going to wait between five and 10 minutes for the second one as well. So if you’re in a hurry and you want 24 ounces of coffee this is not what you get. This was not exactly what I was expecting when I got this. I understand the concept of it is you know pretty basic but I didn’t think it was gonna be like this I thought that it was gonna be a very large container and it’s not I also thought I was gonna be able to drink out of it and you can’t because it’s huge. It’s not meant to be drunk you have to pour into something else. But overall of course it works. The concept is simple there’s a ton of ice with a metal container and a coffee goes into it and as the ice melts the coffee gets colder. I’m not disappointed at all. Because I can wait that amount of time to get an iced coffeeIt works. I watched a video about it and you know it’s about 60 seconds or so they said to leave it in. To be completely honest here that’s not how it works. When I get iced coffee I don’t want any ice inside of it OK I want the coffee to be cold like it was in the refrigerator I don’t want the ice. ice waters down no matter what you get. You have to leave this there for about five minutes if you take it directly from your coffee pot and poured it. It only holds 12 1/2 ounces. But if you leave it there for five minutes or so it comes out ice cold. And depending on how hot it is you can get more than one usage out of it you may have to wait five or 10 minutes out. But if you want a cup of coffee that’s going to be cold without ice you’re not gonna get it in 60 seconds no matter what are you shaking around you know slowly in your head and swirly they said to do or to leave it standing straight you’re not gonna get it cold like that you’re still gonna have to put it over ice. So wait five minutes if you can",
                "reviewVotes": "70 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFOL6ANCDVGZLBF7SSNNYJVZMVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V9EHBQLTIL81?ASIN=B07FJ6J24R",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Useful flask for a quick glass of iced coffee.",
                "reviewText": "I brewed using a keurig, let it sit for about 5 minutes then swirled the flask for another minute, coffee was ice cold. However the ice inside was nearly melted so water poured through the holes that's on the lid, so you have to use your finger to plug the hole as you pour. Another thing I noticed was some coffee getting into the middle and sides through the lid holes.They say it can be used twice before having to refreeze but that's only if you want the coffee lukewarm poured over ice. If you actually want it ice cold it can really only be used once before the ice inside is nearly melted. But some brewers like nespresso don't brew as hot as a keurig so maybe your experience will be different.The build quality could be better as well, seems like it's only a matter of time before the plastic cracks.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheenaloves2shop",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXZPTUGAGRPJIKC2XDYIWJVNPRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZU2DPB5DC7UH?ASIN=B07FJ6J24R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Thank me later! Cold coffee lovers dream!",
                "reviewText": "The Hyperchiller isn't just a fantastic addition to your home; it also makes a wonderful gift. Its simplicity in use is a standout feature, and as someone who enjoys cold coffee year-round, it's truly one of my best buys. I even got two for convenient rotation and several more to share as thoughtful gifts. The Hyperchiller has undeniably elevated my cold coffee experience, making it a must-have for coffee enthusiasts and an excellent choice for giving the gift of chilled perfection.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jailsonmsjunior",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 3, 2023",
                "reviewTitle": "MARAVILHOSO",
                "reviewText": "Compra certa para quem curte beber café gelado. Fica uma delicia e geladinho. Ainda recomendo adicionar gelo no copo, mas o bom é que vai demorar muito a derreter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 13, 2023",
                "reviewTitle": "Parfait!",
                "reviewText": "Bon cadeau!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis G.Luis G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 7, 2023",
                "reviewTitle": "Excelente producto!!!",
                "reviewText": "Deja las bebidas muy fríos en pocos segundos, café, te o cualquier líquido que se quiera enfriar muy rápido. Llego muy a tiempo. Excelente Construccion y calidad",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81aIh6K9+-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71U3BPrqGIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 11, 2023",
                "reviewTitle": "Best invention ever!",
                "reviewText": "This is genius! You can have fresh iced coffee in 3 minutes! It works like a charm! Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Padilla Ferraris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 26, 2023",
                "reviewTitle": "Excelente calidad",
                "reviewText": "Muy fàcil de utilizar y practico. Ademas me llegó en 2 dias.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}