{
    "remaining_requests": 35889,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cuisinart-CHW-16-12-Cup-Programmable-Coffeemaker/dp/B09GCX353T",
    "body": {
        "name": "Cuisinart CHW-16 12-Cup Programmable Coffeemaker & Hot Water System New Black",
        "price": "$84.46",
        "originalPrice": "$129.95",
        "rawPrice": 84.46,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cuisinart-CHW-16-12-Cup-Programmable-Coffeemaker/dp/B09GCX353T",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BH7NJLSK"
        ],
        "asinVariationValues": [
            {
                "asin": "B003KYSLMC",
                "variationName": "Color",
                "variationValue": "Black/Stainless",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/512SxbU0Q9L._SS36_.jpg"
            },
            {
                "asin": "B09GCX353T",
                "variationName": "Color",
                "variationValue": "New Black",
                "price": "$84.46",
                "variationImageURL": "https://m.media-amazon.com/images/I/31mU1rOsRZL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31mU1rOsRZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41-AKi-mifL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31AmEXDSNqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/516ivVbyrNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ovzlEDAaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41E9GjfHmsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CW O13akL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Cuisinart Store",
            "link": "https://www.amazon.com/stores/Cuisinart/page/9EA87106-FA2E-4134-BB4D-18194A61B989?ref_=ast_bln"
        },
        "brand": "Cuisinart",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 8910,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 5 hrs 4 mins",
            "FREE delivery Tuesday, February 20. Order within 19 hrs 34 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Drip Coffeemaker: 12-cup glass carafe - Fully automatic with 24-hour programmability LCD Clock and self-clean feature",
            "1- to 4-cup setting and adjustable auto shutoff (0–4 hours)",
            "Adjustable keep warm temperature control - Brew Pause feature",
            "Gold tone, commercial-style permanent filter - Charcoal water filter",
            "Hot Water on Demand: - Provides hot water on demand for tea, soup, oatmeal and more"
        ],
        "description": "Experience the ease and convenience of a full-size coffeemaker and hot water system in one. Full programmability, including 24-hour advance brew, 1 to 12 cup settings, and adjustable carafe temperature, ensures that coffee is always hot and ready to be enjoyed. Dual filters eliminate impurities for fresh, robust coffee flavor. Designed to heat up in a hurry, the hot water system features a separate reservoir with a spout that easily dispenses hot water directly into a cup for hot tea or cocoa, or into a bowl for oatmeal, soup, ramen, and more. A drip tray prevents spills and detaches easily to make room for taller cups. The sleek, compact design with the two reservoirs side by side conserves countertop space while complementing any kitchen décor.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "12 Cups"
            },
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Product Dimensions",
                "value": "7.13\"D x 13.39\"W x 14.7\"H"
            },
            {
                "name": "Item Weight",
                "value": "1 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Material",
                "value": "Glass"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 8,910 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#46,142 in Home & Kitchen (See Top 100 in Home & Kitchen) #106 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "Cuisinart"
            },
            {
                "name": "Included Components",
                "value": "Drip Coffeemaker, 12-cup glass carafe, Gold Filter, Charcoal Filter"
            },
            {
                "name": "Model Name",
                "value": "Cuisinart CHW-16 12-Cup Programmable Coffeemaker & Hot Water System"
            },
            {
                "name": "Model Number",
                "value": "CHW-16"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Color",
                "value": "New Black"
            },
            {
                "name": "Style",
                "value": "Hot Water"
            },
            {
                "name": "Capacity 12 Cups",
                "value": "Material Glass"
            },
            {
                "name": "Item Weight 1 Pounds",
                "value": "Human Interface Input Buttons"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Cuisinart 12-Cup Programmable Coffeemaker & Hot Water System Cuisinart Coffee Plus 12-Cup Programmable Coffeemaker & Hot Water Dispenser Cuisinart Coffee-on-Demand 12-Cup Programmable Coffeemaker Cuisinart Coffee Center 12-Cup Programmable Coffeemaker Model # CHW-16 CHW-12P1 DCC-3000 DCC-4000P1 Hot Water System ✓ ✓ Carafe 12-Cup Glass 12-Cup Glass Up to 12-Cups 12-Cup Glass Adjustable Carafe Temperature ✓ ✓ ✓ Controls Push Button Push Button/Dial Push Button/Dial Push Button 24-Hour Programmable ✓ ✓ ✓ ✓ Auto-Off 0-4 Hours 0-4 Hours 0-4 Hours 0-4 Hours Clean Function ✓ ✓ ✓ ✓ Gold-Tone Filter ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6464100-3645-4ccc-ae5b-75e9f1372539.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2aeaeec2-81d8-418f-980e-eb231a941d52.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/408be2af-dca4-4d62-82f8-785fae10f80d.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6be94193-00fb-47bf-bb7b-88d53dfa86d9.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/359eef24-41eb-4bda-bfba-d0e19b1cb25a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ddf267cd-a0e7-470c-b8c3-1355a31e3eea.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b246a7bf-1c0c-492e-ba91-f4d004395079.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9f6bf880-a0d5-4824-9490-20dd896e3b05.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "sscrib",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYPOYD36YZQBFXG3LXIZFBXEBQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AZ3UAVA4I52O?ASIN=B09GCX353T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2012",
                "reviewTitle": "5.0 out of 5 stars Great Hot Beverage System",
                "reviewText": "I bought this coffeemaker for my wife as a Christmas present (2011). We love it a lot. It makes great, HOT coffee, and the hot water system works perfectly. If you are like me, you are reading these comments in order to learn whether or not you should buy this product. With that in mind, let me give you a few things to consider:The Not So Good1. Plastic taste - A number of folks have complained about a plasticy taste, especially on the hot water side, and I can verify that we have experienced a little of that, but only on the coffee side. It took us about 3-4 pots of coffee before the plastic aftertaste went away, and we haven't tasted it since. We have never tasted it on the hot water side. It's possible that the people who keep tasting it truly have models that have a problem, but it's also possible that they just imagine they are tasting it. Either way, at least for us, whatever plastic taste was there before seems to be gone now.2. Hard to fill the coffee reservoir - It is true that the hole you pour water through to fill the coffee side is poorly positioned and quite small. Some folks use a funnel, others rotate around to the side of the coffeemaker to improve their pouring angle. Me? I just pour carefully. I have not spilled any water (yet). My biggest issue is that I find the last 1/2 cup of water difficult to get out of the carafe. If I try to pour 8 cups of water into the reservoir I can get the first 7 1/2 out easily, but that last little bit is tough. To compensate I just fill the carafe with a cup or so more water than what I intend to pour into the reservoir - say, 9+ cups if I want to brew 8 - and then discard whatever extra water is left in the carafe. Problem solved.3. Slight residue from coffee grounds - We use the bundled reusable coffee filter. We have found that it leaves a very fine residue from the coffee grounds at the bottom of our coffee, which isn't a big deal, but is at least something worth mentioning in case that sort of thing bothers you.4. Coffee brewing time - The coffeemaker is not slow, but it certainly is not fast. Reading some reviews led me to think this thing made really fast coffee, which just is not the case. I would say it's average, which really isn't bad, per se, but you should temper your expectations. A Bunn this is not.The Good1. Great coffee - Isn't this why you buy a coffeemaker? This unit makes really good coffee, period. It is VERY hot. I mean, you can put cold milk/creamer in your coffee and it'll still be hot when you're through, especially if you select the hottest carafe heat setting (a nice touch, I might add). A coffeemaker should make good coffee, and this one does not disappoint.2. Speedy hot water system - I was very impressed with how fast the hot water system heated the water. Once again, after reading some reviews you would think this thing took forever. It doesn't. In just a few minutes it does its job as advertised. It's certainly faster than heating up a pot on the stove, although it only heats one serving or so at a time. But the reheats in between each serving take less time than the initial heating of the first serving, a real plus if you plan on making more than one hot drink at a time. But keep in mind that this hot water system is not intended to completely replace a kettle if you intend to fix a lot of tea or hot cocoa at one time. If you are making hot drinks for more than 2-3 people at a time, it might be faster to heat a lot of water on your stove rather than waiting for multiple reheats. As long as you keep this in mind I don't think you will be at all disappointed with the hot water system. It really does work well.3. Simultaneous dual function - I got the impression from previous reviewers that you could not make coffee and hot water at the same time. This is not true. My unit will brew coffee on one side and heat up water on the other side simultaneously. Perhaps Cuisinart updated this model to add this function, or perhaps the previous reviewers were simply wrong. All I know is that mine does both at the same time and they both perfectly.I disagree with some of the reviewers who complained about other various issues with this coffeemaker. The hot water drain plug on the bottom of the unit is positioned exactly where it should be, and is simple enough to use. If you are using simple tap water for the hot water system it'll work just fine. The five beeps that indicate that the coffee is finished brewing are not too loud, nor intrusive. My microwave makes more noise when it beeps. The hot water reservoir should be drained occasionally (since you canot dispense all the water you put in), but this isn't as big of a deal as previous reviewers make it out to be. This takes about 10 seconds of your week. The electrical cord is a little short, but do people expect it to be 10 feet long? In the end, just like with any product being reviewed by hundreds of people, every possible flaw will be brought to light. But all in all I think this is a great product that is worth the money (assuming you buy it on sale - the retail price on this thing is outrageous; I got it for $85). I highly recommend it.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nico",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJM2LM4XMYPSXUIDSB7JUAWIPOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYBTF2W54JB59?ASIN=B09GCX353T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2014",
                "reviewTitle": "5.0 out of 5 stars Great Product! One Thing to Clarify. Pretty Detailed Description.",
                "reviewText": "I got this product for my mom. She had been using the same old Krups coffee maker for the past 7 years. It made great coffee but it was painfully slow. Took around 30 minutes to make 7 cups of coffee. But whenever I mentioned a new coffee maker, she insisted she did not need one.Well, it was clear to me that she DID, but she just did not want ME to pay for it. Well, when turning on the tv in the morning, it was on a commercial. Conveniently, this same coffee maker was being talked about. I heard things like \"12 cups\" and \"hot water reservoir for quick brewing\". All I needed to hear was \"Quick\" and I was sold. Bought it and told her nothing of it.Lets get a few things clear. It has a 12 cup programmable coffee maker. And it ALSO has a hot water system. They are two separate things. The 12 cup coffee maker side does not keep heated water, which I was surprised to learn. The \"hot water system\" belongs to the section on the right, which is a separate 7 cup reservoir that does heat water. That is a 19 cup system!BUT!, the fact that the coffeemaker side is not heated, really makes no difference. This coffeemaker has a brilliantly designed brewer that drips the hot water through the coffee. It is almost like a showerhead. This results in very fast brewing. I can put 12 cups of tap water that is barely even lukewarm, and press brew and have a full pot in less than 15 minutes. It also has something that is pretty cool, it lets you choose how hot you want the coffee, Low, Medium, High. It has easily programmable timers that let you set it up so you can have a full pot of hot coffee when you wake up; likewise it also has a setting on what time (or how long after it is done brewing) to turn off the heating plate that keeps it warm. You can set the coffeemaker to make individual cups, or four cups of coffee at a time with the flip of a switch. I was wary of this one thinking that it was saying you could only make four cups max at a time, but I felt that would be illogical and I am over thinking. If you wan 8 cups, pour in 8 cups of water, and flip that \"1 cup\" or \"4 cups\" switch to off, and it will use all the water in the reservoir, just like most coffeemakers. This maker uses #4 paper filters. the ones shaped like a cone. It also comes with a filter/basket that would work perfectly, but you would have to clean it after every use. It also has an alarm that lets you know when it is done brewing, it is fairly subtle, but it is noticeable, about as loud as a microwave, but not so high pitched.Now to the hot water system. This thing is a pretty nice feature to have. It gives you hot water on demand. It even has a little safety switch that is no trouble to slide left and right. This means that kids have less of a chance of playing around and getting burned. It is a 7 cup reservoir! If you put tap water that is a very normal temperature, it will take about five minutes to heat up completely. Winter is coming, time to break out that hot chocolate mix, rather than heating up the entire mug in the microwave to get the water warm and inevitably getting the mug too hot to handle, use the Hot Water System. Same for tea. BUT... the best use for this Hot Water System, is Cup Noodles/Ramen Noodles. It was the single greatest discovery I have made, the answer was right in front of me the whole time.After my mom received this, she said the typical \"you shouldn't have done this\" but was grateful nevertheless. It was not until after her first work week that she came to me and said \"I love my new coffee maker\" I told her I was glad that she liked it. It was then she told me that I was right, she said \"you were right, I did need a new one, I had no idea that in needed it until I actually had it\" That right there MADE MY DAY.Heres the deal.1. The \"hot water system\" does not refer to the 12 cup system that brews the coffee into the carafe. But, it coffeemaker itself is very fast and makes a full 12 cups in under 15 minutes.2. It has a bunch of useful features that allow you to set when the maker turns on and how long to keep your brewed coffee warm. It also gives you choices on how hot to make the coffee. There is an alarm that lets you know when it is done.3. It comes with a basket filter, but you can use #4 Cone style paper filters.4. The hot water system holds an additional 7 cups itself. It dispenses piping hot water that is perfect for tea or hot chocolate and all your other hot water needs. BUT, the best use for this Hot Water System is for Cup Noodles/Ramen Noodles.5. The Hot Water System has a safety switch, so that it might prevent children from burning themselves. The switch is easy to slide, large, and would not be a problem for a semiconscious individual fumbling around for that coffee. The switch is easy to miss because it looks like part of the button you press to dispense hot water. Many would probably overlook it unless they are told about it. But if a kid DID figure it out, they could easily disable it and dispense the hot water.This is a great product, if you are looking for a new coffeemaker (and you are smart enough to not buy a Keurig), your search has ended. This is THE ONE. And even if you don't think you need it, there is a chance you might.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazingly comfortable ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 14, 2024",
                "reviewTitle": "Fabulous space saver",
                "reviewText": "Makes great coffee and the water dispenser is great for oatmeal or tea. Saves so much counter space.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mario Rodríguez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 23, 2021",
                "reviewTitle": "Excelente calidad",
                "reviewText": "Espere unos meses para poner una reseña, ahora después de usarla diaria me parece que funciona excelente.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 14, 2016",
                "reviewTitle": "Five Stars",
                "reviewText": "We were very pleased with our coffee replacement appliance that arrived in a timely manner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grandma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 2, 2023",
                "reviewTitle": "Water reservoir",
                "reviewText": "Do not fill water reservoir night before for coffee, it will leak",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 17, 2021",
                "reviewTitle": "Muy recomendable",
                "reviewText": "Plllevamos poco de uso pero hasta ahora a cumplido perfectamente con su objetivo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}