{
    "remaining_requests": 35735,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LuxHaus-Stovetop-Espresso-Maker-Stainless/dp/B08BLRJCWS",
    "body": {
        "name": "LUXHAUS Moka Pot - 9 Cup Stovetop Espresso Maker - 100% Stainless Steel Italian and Cuban Mocha Coffee Maker",
        "price": "$46.45",
        "originalPrice": "",
        "rawPrice": 46.45,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LuxHaus-Stovetop-Espresso-Maker-Stainless/dp/B08BLRJCWS",
        "soldBy": {
            "sellerID": "A22SZCDG6RAUMZ",
            "name": "LuxHaus",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A22SZCDG6RAUMZ&asin=B08BLRJCWS&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07NY4J2TW"
        ],
        "asinVariationValues": [
            {
                "asin": "B07NZ4GPYJ",
                "variationName": "Size",
                "variationValue": "3 Cup",
                "price": "$36.49",
                "variationImageURL": ""
            },
            {
                "asin": "B07P2CGKS7",
                "variationName": "Size",
                "variationValue": "6 Cup",
                "price": "$39.80",
                "variationImageURL": ""
            },
            {
                "asin": "B08BLRJCWS",
                "variationName": "Size",
                "variationValue": "9 Cup",
                "price": "$46.45",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41QLv6wi6kL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Dm4SSqstL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VvJp-jd3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NSLrO 4 L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514E1sCGULL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F78Nb-SiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91uJBRwNLBL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: LUXHAUS",
            "link": "https://www.amazon.com/LUXHAUS/b/ref=bl_dp_s_web_15595049011?ie=UTF8&node=15595049011&field-lbr_brands_browse-bin=LUXHAUS"
        },
        "brand": "LUXHAUS",
        "merchantInfo": "LuxHaus",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3368,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 6 hrs 22 mins",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Thursday, February 15. Order within 10 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "MAKES 9 ESPRESSO SIZE CUPS - Total capacity per brew is 18oz which is 9 espresso-size cups (about 2oz each). Espresso is quite a bit stronger and is traditionally drank in smaller size cups. No need to make a daily trip to your local coffee shop for a dose of freshly-brewed espresso when you can make it at home. Save time and money and impress your friends with your barista skills.",
            "THE BEST TASTING ESPRESSO - Experience delightful flavor in your morning coffee. The LuxHaus stainless steel moka pot was made specifically for discerning coffee afficionados that appreciate a full bodied aromatic cup of espresso. We are excited to offer you our high-quality espresso pot. Life is too short to be drinking bitter coffeeso ditch the instant coffee or cheapo competitor and step up to LuxHaus quality.",
            "FOOD SAFE STAINLESS STEEL - Your health is our #1 priority. Rest assured that you are getting your money's worth here. We use the highest quality, food-safe 100% stainless steel for our italian espresso maker. Don't buy other cheap competitors as they may rust or flake off metal pieces into your morning espresso. Your well-being is too important to risk it. We are confident and offer a 100% no-rust guarantee with our coffee maker.",
            "GAS, ELECTRIC OR INDUCTION STOVETOP - Yup it's high quality stainless steel so it works on induction too. Whether you have induction, gas or electric range or even a camping stove you’re just moments away from a strong shot of coffee-happiness. It heats up really quickly and is ready in minutes.",
            "LUXHAUS QUALITY GUARANTEE - We are so confident that you will love our stovetop moka pot that we are offering all customers a lifetime satisfaction guarantee. If at any point you decide you are not completely satisfied with your purchase, just drop us an email and we will refund 100% of your mone"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Stovetop Espresso & Moka Pots",
                "link": "https://www.amazon.com/Stovetop-Espresso-Moka-Pots/b/ref=dp_bc_aui_C_4?ie=UTF8&node=14163721"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "LUXHAUS"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "4\"D x 8\"W x 8\"H"
            },
            {
                "name": "Special Feature",
                "value": "Portable"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Moka Pot"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coffee maker"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Item Weight",
                "value": "2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B08BLRJCWS"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,368 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#43,674 in Home & Kitchen (See Top 100 in Home & Kitchen) #22 in Stovetop Espresso & Moka Pots"
            },
            {
                "name": "Date First Available",
                "value": "February 22, 2019"
            },
            {
                "name": "Capacity 1.1 Pounds",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 0.13 Pounds",
                "value": "Wattage 1000 watts"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/364c81cd-89e3-48ac-b233-204743a13281.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b91a4f1-0a12-4e2e-a759-ad5d8306781b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b84e39a5-e67e-4271-bb2a-de0836be19f9.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4746bd34-52db-4d81-9cb2-18c4a1708451.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/11439521-5180-4848-9d1a-779a1ef1ba9d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c1a187f3-6cde-4d25-8695-c98b202142ef.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0cd43b4-c5d1-47cc-84ea-712671425da7.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "bearbear",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGKVPFEL2PDEJ64QB2JRFDJYFRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35WRIHR9WFRO2?ASIN=B08BLRJCWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2021",
                "reviewTitle": "5.0 out of 5 stars Works Well, Easy to Use, Makes a Good Cup of Coffee",
                "reviewText": "I was looking for something to make espresso, but I didn't want the complexity, cost or footprint of an espresso machine. A moka pot seemed to be a good compromise. While it isn't espresso, it's still a very strong shot of coffee with good extraction, and is a very good base for frothed milk drinks. I chose the LuxHaus primarily because it is stainless steel, an \"Amazon Choice\", and is sold at what I consider to be a reasonable price point. I've had the LuxHaus moka pot for about a week, and so far I'm impressed. The results with dark roast coffee, or with New Orleans style chicory coffee have been excellent. I wasn't as impressed with the results from a lighter roast coffee.Using the LuxHaus moka pot is relatively easy, fill the lower chamber with water, add coffee to the basket, insert the basket into the lover chamber, screw on the upper chamber onto the lower chamber and place on a stove eye at medium heat. On my stove (gas) it takes six to eight minutes to make a pot. One tutorial I watched suggests starting with hot water for better coffee. I've done so, but can't really tell the difference in the coffee. Cleaning the pot is relatively easy, but a bit messy. The biggest issue is getting the grounds out of the basket, it isn't hard, but I end up using a paper towel to get all the grounds out, and to wipe clean the filter plates.I'd recommend a moka pot for those who want coffee house style drinks, but don't want full up espresso machines. I can also recommend the LuxHaus pot. It works as advertised, the LuxHaus pot itself seems very well made, and the coffee has been very good. The LuxHaus pot comes in a nice presentation box. According to the box, the pot is designed by LuxHaus and assembled in China. A card included with the pot says LuxHaus is run by a husband and wife out of their garage.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71AkLi7Xt6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71eI+JYL24L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jian Y. Jiang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYDLJXA4IUAFUS5OLKS3W3ZR64Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCYLN83M0OWD?ASIN=B08BLRJCWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Great moka pot, great customer service",
                "reviewText": "I've had my Luxhaus moka pot for over a year now and use it several times a week. I love that it's stainless steel, an attractive design and easy to clean. Recently though, the hinge connecting the lid broke. I reached out to customer service and they responded quickly and are already sending a replacement hinge assembly. I was very impressed with their response. The hinge and lid are not crucial to using this moka pot and I've continued making coffee without the lid without any problem.I love my Luxhaus 6-cup Moka pot and look forward to using it every morning!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FaustaBarra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVFHDHGEHOFBYCVWYQXWC7N6H7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SNIBDFGKAZAS?ASIN=B08BLRJCWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2023",
                "reviewTitle": "5.0 out of 5 stars A very well made pot",
                "reviewText": "First of all, this makes a fine cup of coffee. I've used just about every kind of coffee pot there is including the classic Bialetti aluminum model. Stainless steel is a far better material in all respects. I've only had mine for a month or so, I used it every day and it is a pleasure. The aluminum pots degrade over time, they stain, easily accumulate scale, and look sadder and sadder over time. I expect this stainless pot will hold up much better, and it cleans up completely. It is well manufactured, the thread to screw the top and bottom together is finely cut and polished so it goes together easily.The coffee starts to rise through the funnel quickly and smoothly, it sputters (as expected) only at the very end when the majority of the water has passed through the grounds. It takes a bit of trial and error to grind your coffee properly: if the grind is too fine and packed, it will take longer to rise, may not make as much coffee as there is water in the base, and may sputter a lot. If the grind is too coarse and/or is not sufficiently filling the basket, the water will rise too quickly and not extract as much flavor from the bean. Once you get that right, it performs very consistently. I like the width of the base which sits on the cast iron flame tamer I use on my gas burner very squarely and isn't at all tippy. The rounded spout is a great improvement over the classic triangular pouring spot which always seemed to dribble on my old Bialetti. I was a little dubious about the spring loaded basket, imagining that it might cause the dry grounds to be bounced out of the basket, but that hasn't ever happened and having the spring hold the basket above the rim of the base makes it much easier to take out, you don't have try to get your fingernail between the lip of the basket and the edge of base to take it out to empty the grounds, it just lifts right out. It doesn't interfere with tightening the top onto the base. I had one very minor problem which was that the fitting that holds the hinge for the lid cracked on one end and fell off. I was still able to use the top--but not to worry the Luxhaus customer service was stellar! Stefan replied the very same day that I emailed, and they have set on a free replacement hinge at no cost to me. If only all products were so well made and so well supported!",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ5Q4AGY7TGPQ2D666DNAHG6OAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35DVOLSC6F8NJ?ASIN=B08BLRJCWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Best coffee ever! Just get it!",
                "reviewText": "I used drip... Percolator...Keurig (joke coffee maker that uses pre-ground coffee pods that probably were stored in a warehouse for a year before you bought it) and most recently French press (for years). Grind beans, too. This beats them all. Very rich coffee... fast and easy. Easier to clean than the FP. No glass to break (I broke my French press glass container about five times--LOL--and got sick of doing... so that's why I switched.) This moka pot is great because it contains no aluminum. I don't use preheated water, makes no difference to me. I just heat it up slowly and I keep the lid open so I can see the coffee coming out. As soon as it starts sputtering, I turn off the fire and run the bottom under some cool water for a few seconds, which isn't necessary but stops the process immediately. The coffee is deep and dark. Fantastic. Gorgeous packaging, too. The best coffee decision I ever made. Stop thinking about it and get this one. You'll be glad you did! A+++ highly recommended.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greta K.Greta K.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 20, 2022",
                "reviewTitle": "Disappointed",
                "reviewText": "Almost a month I was looking for a good quality coffee maker. Now I am very disappointed how the stainless coffee maker could be rusty and black inside and outside in a month of use. Just wasted money.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61DCNzTUCcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Ngh2EHTUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/613y0ht9I9L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dale M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 17, 2022",
                "reviewTitle": "Just buy it, can't go wrong",
                "reviewText": "There are so many subtleties using a moka pot reviews can vary due to people not having the skills required to make a great cup of coffee, these little coffee makers are not necessarily user-friendly. By making sure you follow the directions and use boiling water in the base, not packing down the coffee in the basket, using a courser rather than a finer grind, and taking your time, you will produce a fantastic cup of coffee. This particular design and brand is the epitome of this type of coffee maker and it's beautifully executed and a lifelong piece of equipment that will last for years and years. Great. value fore a truly excellent product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Schwerdtfeger",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 22, 2022",
                "reviewTitle": "Moka Pot",
                "reviewText": "Box of this item was very nice and experience looking.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorentz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 6, 2023",
                "reviewTitle": "Handy expresso",
                "reviewText": "The LuxHaus has proven to be an ideal means of making our daily expresso coffee and I am pleased that it is stainless steel and not aluminium. However it should advertised as only a two cup not three unless of course someone is thinking of smaller coffee cups used years ago.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}