{
    "remaining_requests": 35722,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/DeLonghi-Espresso-Cappuccino-Stainless-EC260BK/dp/B08C96BG9H",
    "body": {
        "name": "De'Longhi Stilosa Manual Espresso Machine, Latte & Cappuccino Maker, 15 Bar Pump Pressure + Milk Frother Steam Wand, Black / Stainless, EC260BK, 13.5 x 8.07 x 11.22 inches",
        "price": "$85.99",
        "originalPrice": "$85.99",
        "rawPrice": 85.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/DeLonghi-Espresso-Cappuccino-Stainless-EC260BK/dp/B08C96BG9H",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09SGKSDBH"
        ],
        "asinVariationValues": [
            {
                "asin": "B08C96BG9H",
                "variationName": "Style",
                "variationValue": "Espresso Machine",
                "price": "$85.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0B7Q2VBR6",
                "variationName": "Style",
                "variationValue": "Espresso Machine + Cappuccino Maker",
                "price": "$110.94",
                "variationImageURL": ""
            },
            {
                "asin": "B0C99C3N4L",
                "variationName": "Style",
                "variationValue": "Espresso Machine + Cappuccino Maker + Tamper",
                "price": "$130.89",
                "variationImageURL": ""
            },
            {
                "asin": "B09RV3K4B3",
                "variationName": "Style",
                "variationValue": "Espresso Machine + Frothing Pitcher",
                "price": "$105.94",
                "variationImageURL": ""
            },
            {
                "asin": "B09RV466ND",
                "variationName": "Style",
                "variationValue": "Espresso Machine + Glasses, Set of 2",
                "price": "$105.78",
                "variationImageURL": ""
            },
            {
                "asin": "B0C99BCX5Q",
                "variationName": "Style",
                "variationValue": "Espresso Machine + Pitcher + Glasses",
                "price": "$125.73",
                "variationImageURL": ""
            },
            {
                "asin": "B0C9999Y4Y",
                "variationName": "Style",
                "variationValue": "Espresso Machine + Tamper + Glasses",
                "price": "$130.73",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41BVDBHS-JL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51YiDe1lkpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZIM4tIj5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xqo5YUVLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gCAK02-SL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Xa40ebE0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/6117K1MGfIL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/51g7Oqv3V8L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/D1maeK-DBlS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the De'Longhi Store",
            "link": "https://www.amazon.com/stores/DeLonghi/page/013D2401-2556-4F91-B917-60281FC571D1?ref_=ast_bln"
        },
        "brand": "DeLonghi",
        "merchantInfo": "Sold by Arzuq Grocers and More and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 9334,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 10 hrs 20 mins",
            "Or fastest delivery Thursday, February 15",
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 9 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Note: 1)Too coarse a grind, too little coffee, or insufficiently tamping the grounds before brewing can all lead to inadequate pressure for a proper brew",
            "Brew lattes, cappuccinos and espressos in a comfort of your home",
            "Contemporary and Compact Design: The perfect addition to your modern kitchen countertop, without taking up too much space, plus it’s easy to clean",
            "15 BAR Pump: The optimal pressure to extract a single or double espresso, so your coffee drink comes out perfectly rich.",
            "Manual Milk Frother: Texture your milk with ease to create an authentic cappuccino, latte or flat white..Stainless Steel Boiler. Auto shut-off"
        ],
        "description": "Now you can incorporate delicious espresso drinks into your daily routine. Introducing Stilosa by De’Longhi. Created for those embarking on their espresso journey, this elegantly designed machine allows you to easily craft authentic espressos, lattes and cappuccinos in the comfort of your own home. The 15 bar pump creates the optimal pressure to extract a single or double espresso according to espresso brewing standards. An ergonomically designed portafilter has two filters, for single or double espresso. A separate tamper provides an additional control of even and consistent pressure for a better extraction. The two level cup holder accommodates taller cups. The heart of Stilosa – the durable Stainless steel boiler is engineered to last long and work for years with consistent performance, unlike the competition. The manual milk frother mixes steam and milk to create a rich, creamy froth for evenly textured lattes and cappuccinos just the way you like them. Stilosa’s sleek, refined design and stainless steel elements make this the perfect addition to your kitchen countertop, without taking up too much space. On top of that it’s simple to clean and maintain, to ensure your espresso machine lasts longer. Your at-home espresso journey starts now with Stilosa.What's included: Espresso Machine Portafilter Tamper Filter for Single & Double Espresso Measuring Spoon Instruction Manual & Quick Start Guide 1 Year Warranty.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Espresso Machines",
                "link": "https://www.amazon.com/Espresso-Machines-Coffee-Tea-Kitchen/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289748"
            },
            {
                "name": "Manual Espresso Machines",
                "link": "https://www.amazon.com/Manual-Espresso-Machines/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14162641"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "1200 Milliliters"
            },
            {
                "name": "Special Feature",
                "value": "Milk Frother"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Espresso Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Espresso"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Wattage",
                "value": "1100 watts"
            },
            {
                "name": "Voltage",
                "value": "120"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Color",
                "value": "Black and Stainless"
            },
            {
                "name": "Style",
                "value": "Espresso Machine"
            },
            {
                "name": "Material",
                "value": "Stainless Steel, Plastic"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 9,334 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,314 in Home & Kitchen (See Top 100 in Home & Kitchen) #1 in Manual Espresso Machines"
            },
            {
                "name": "Brand",
                "value": "De'Longhi"
            },
            {
                "name": "Included Components",
                "value": "33.8 fl.oz water tank, De’Longhi Stilosa Espresso Machine, Accessories Included: Portafilter, Measuring Scoop/Tamper, single & double pod filter"
            },
            {
                "name": "Model Name",
                "value": "Stilosa"
            },
            {
                "name": "Model Number",
                "value": "EC260BK"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Product Dimensions",
                "value": "8.07\"D x 13.5\"W x 11.22\"H"
            },
            {
                "name": "Item Weight",
                "value": "9.48 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Capacity 1200 Milliliters",
                "value": "Material Stainless Steel, Plastic"
            },
            {
                "name": "Item Weight 9.48 Pounds",
                "value": "Wattage 1100 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Introducing Stilosa by De’Longhi Created for those embarking on their espresso journey, this elegantly designed machine allows you to easily craft authentic espressos, lattes and cappuccinos in the comfort of your own home.",
                "media_link": []
            },
            {
                "media_text": "Contemporary and Compact Design The perfect addition to your modern kitchen countertop, without taking up too much space, plus it’s easy to clean. Manual Milk Frother Texture your milk with ease to create an authentic cappuccino, latte or flat white. Stainless Steel Boiler Robust design, durable construction of this boiler is engineered to last long and work for years with consistent performance. Two level cup holder Allows you to use a variety of cup sizes so you can have as much—or as little—espresso as you’d like.",
                "media_link": []
            },
            {
                "media_text": "De’Longhi Stilosa Espresso Machine Stilosa is an elegantly designed espresso machine that elevates your espresso experience at home. We’ve incorporated new features that let you easily craft authentic espressos, lattes and cappuccinos with ease, just the way you like them. With its compact, contemporary design, innovative features and streamlined process, the perfect espresso is more accessible than ever before with Stilosa by De’Longhi.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/229a7b29-d6d8-466c-a97e-3d253ffe3205.__CR0,1,4999,3749_PT0_SX800_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a33f420-5bc3-44ef-98f2-7ea761dc516a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/958e779c-a3b8-42c7-9354-d23445468cc5.__CR0,0,2499,1024_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b979758c-f4d6-4311-bf19-3d90956b38e5.__CR0,425,2500,1025_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/17f4b187-d676-4103-bbe3-2885880fbe41.__CR0,802,4789,1963_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8625056b-1de9-4494-a709-5ee33d0ce81e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/229a7b29-d6d8-466c-a97e-3d253ffe3205.__CR0,1,4999,3749_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7d38a56d-cf6e-40b5-871f-bd8fc6774c59.__CR0,0,4882,2001_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Benjamin BurlinsonBenjamin Burlinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNVJBHNE6Q5XOLQ23XUGWTOGXLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDNMQOSKKBLSQ?ASIN=B08C96BG9H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2023",
                "reviewTitle": "5.0 out of 5 stars I have the answers to your questions. ~Now updated~ see bottom.",
                "reviewText": "* I only rate exceptional products 5 stars.* This espresso machine meets my exceptional standard.* Price/function ratio is unbeatable.* Good for everyone except those brewing commercial amounts of coffee.Due to the length of this review and the sake of brevity, I will label each section for easy reference.SUMMARYWill this machine brew a cafe quality coffee drink right out of the box? Yes, but with major caveats.WHY I BOUGHT THIS MACHINEMoney. Plain and simple. I wanted an espresso machine that wasn’t $500+. I just don’t have the money. I set out to buy what I thought was the very cheapest functional espresso machine to find out if it would in fact produce an espresso that was worth it. The Stilosa is it. You can’t go cheaper, once you do that, the machines offered don’t work at all, I mean, at all. They don’t have consistent pressures, temperatures and flow rates. So please, don’t waste your money on the $59.00 versions. At the time of posting, I bought the Stilosa at $99.00 on sale.INTRODUCTIONWhen I purchased this, I knew nothing about espresso. I just wanted a good coffee drink without spending, what is now, $7.00 a cup. Since then, I have learned everything about espresso and have almost a 100 hours of study and practice in. Through lots of trial and error, I have taught myself the intricacies of espresso brewing, and believe me, it is far more intricate than you think! I also found out that many of the terms are vague and far from universal. With that said, most of what I will write aligns with as much of a community standard as one exists.CAVEAT #1The truth is simple. This machine will brew a cafe quality drink right out of the box because “most” cafes have horrible drinks. I have discovered that brewing espresso is a fine balance between science and art. The major chains actually have very expensive machines and they still brew disgusting coffee. I have read so many reviews, and the one thing that is consistent throughout all of them is this; purists (the French and Italians), and anyone who has had a good espresso, won’t even go to the major chains. This is why. Lemon juice is disgusting! But pair it with sugar and you have probably one of the most popular drinks on the planet, lemonade. Likewise, most of us hate extra dark chocolate, because it is really bitter, but blend it with milk, and surprise, you have one of the most popular deserts, milk chocolate! Sugar balances sour, and dairy balances bitterness. What this means is this. You could run sand through the Stilosa, and if you blend it with enough sugar and milk, it is difficult to differentiate between it and major chain’s coffees. It isn’t until you start drinking espresso straight that you notice how horrific most of it is. To test this, just go in and ask for a double shot, chances are it will be bitter or sour. If you don’t know, espresso is actually very balanced and often velvety and sweet on its own. So, will the Stilosa brew a really good espresso right out of the box with no other tools? No, but…… neither will a $5,000.00 machine. Which leads me to caveat #2.CAVEAT #2It doesn’t matter what machine you buy, none of them will take bad coffee and make it good. Again, I wanted to buy a machine as cheap as possible, with no accessories, and see if I could get a good espresso. Sorry, if you are on a budget, it’s not gonna happen. No matter what your budget is, you have to have a grinder. As soon as you are forced into buying pre-ground coffee roasted 10 weeks ago, you will only get what those products are able to deliver, regardless of the price of your espresso machine. My suspicion is, this is why major brands have such bad coffee. In the pursuit of supply chain uniformity, they lose freshness. Crema is a function of the release of CO2, once ground, these gases are escaping. It is simple science. Even with the best vacuum packaging, pre-ground coffee will lose its ability to create crema in a couple days (if not less). Combine that with stale beans and there is nothing you can do to make good coffee. Imagine trying to make a great sandwich with expired stale bread and cheese. Ingredients matter. You have to have a grinder. I didn’t want one, but I was forced to buy one, otherwise my espresso machine was just going to sit there, unused. This is of course if you don’t want to dump a bunch of sugar and milk in. I spent $50 on an Enzoo conical burr grinder, and it works great. You may say, “what about just grinding your beans at the grocery store?”. tried that, several times, it doesn’t work. First of all, those machines are all out of spec because nobody every maintains them. Second, every coffee is different and “dial in” needs to happen for each brand and roast of coffee. Third, you will buy a 8 or 10 oz bag of coffee and grind it all at once but you’ll never use it all at once. The next morning, your coffee is already starting to go stale.The good news is this. If you have a $1000.00 espresso machine, you still need a grinder. So at least you can buy the Stilosa and have an overall lower financial commitment.CAVEAT #3It is impossible to get a fantastic espresso without adding some tools to the Stilosa. This is not so bad considering the price point of the Stilosa, because, once again, you will have to buy all that anyway regardless of the machine you purchase. This is only the case if you buy an espresso machine and not a bean to cup machine of course. If you don’t want to mask your espresso with sugar and milk, you will need the following things without exception;Grinder = $50-$75Kitchen Scale = $15-$35Not necessary but very helpful and time saving;WDT = $10-$30Dosing Funnel = $10-$35Tamping Tool = $10-$65Espresso shot glasses VariesPuck Polishers Blah blahNon-pressure Portafilter $$$$ priceyAnd the list goes on.This is where espresso making turns into more of a hobby than just wanting a good cup. The accessories that come with the Stilosa will work, they don’t work great, but they will work. What you trade in money, you lose in time. You can still get a really good cup of coffee (this is only if you have a grinder and a scale) from the Stilosa with its accessories, but you will work for it. The last 5% of quality is always the hardest, and that’s where the upgrades come. If you want, budget a few things. Namely a bottomless, naked, Portafilter, with a non-pressurized filter basket. The Stilosa comes with a Portafilter and 2 pressurized filter baskets (7 gram + 14 gram). ~ Side Note Below ~ ~ The Stilosa has a very unique and interesting pressurized filter basket. More often, to maintain pressure, a pressurized filter basket will only have one hole in the bottom. The Stilosa actually has a spring driven piston that really works very well. This is an industry upgrade and I think more and more economy machines will come with this feature. You can also “hack” the filter basket if you wanted. You can remove the spring piston assembly, place the screen back in the basket, and have a non-pressurized basket. I would NOT recommend this as it probably voids your warranty. ~CAVEAT #4The price to function ratio of the Stilosa is incredible. But that is a ratio. More expensive machines give you things that this just won’t. You will not be able to watch or change; temperature profiles or pressure profiles, and it doesn't have a PID (proportional–integral–derivative controller), and frankly a bunch of other things you probably have never heard of. But the Stilosa has fantastic features for the price point. It has a very flat and consistent pressure profile, its group head is heated, as is the top of the machine (for heating your cup), and the steaming wand is amazing. It is also a nice size and fits very well on my counter without being overbearing. Unless you are making 100+ cups a day, you really don’t need all that other stuff. Of course, those things are nice if you have found yourself turning espresso into a hobby, but as we all know, hobbies get kind of expensive. My only substantial complaint about the Stilosa is this, there is no way to grab and hold it as you install and remove the Portafilter. I am strong enough that this isn’t a problem, but for others out there, this may be a bit of a challenge.SUMMARYFive stars all day long. This is the single best entry machine you can buy. It is backed by a major espresso machine manufacturer and they hit the mark. It will consistently produce a “better than cafe” espresso, it will just make you work for it. Paired with a good grinder, you will be able to play with all your ratios and pull Ristrettos, Espressos, and Lungos without issue. It heats fast (a little over a minute on cold mornings), has a really nice upgraded spring piston pressurized filter basket. Consistently makes “better than cafe” micro foam for latte art (with practice). You can easily upgrade the Portafilter to a bottomless one without issue. No automatic timing, which is what you want for proper pulls (time is a measure, not a variable). It is advertised that it has an auto shut off……. I haven’t see that yet. I just turn mine off after use. I also fill it with filtered, bottled water, it’s so much easier than removing the tank and filling it. Considering I have less than $200.00 in the whole setup, I couldn’t be happier. With good coffee, a good dial in, and lots of practice, you will be able to make a really good cup of coffee, better than the major chains. I would buy again in a heartbeat.THE “CATCH”This will take you to a whole new level, but you are going to earn it. Lots of frustrating moments, but ultimately very rewarding. If you just want a fast cup of coffee, don’t buy this. Go buy a pod machine like Nespresso, LOR, or Lavazza. Remember, these aren’t espresso machines, and just because they call it that, doesn’t make it true. But with that said, their coffees are moderately good. For about the same total investment, you can get milk “frothers” and a pod machine that will make your drink in 20 seconds. Dump enough sugar and milk in and you won’t know the difference. But they will never dial into the perfect, pure, crema topped, 1-2 ratio, pressure pulled, espresso. And once you have had that, you’ll never go back.Some helpful info:51mm 2 ear Portafilter with a 7 gram and 14 gram filter basket.~ most machines are 54mm or 58mm with 18 gram baskets. As a small side note, 7 grams was the original Italian single espresso, and can be very difficult to brew correctly. But less coffee means you can have more of it throughout the day!Steaming wand with Pannello attachment.Heated top for cup warming.Heated grouphead.33+ oz water tank.~ UpdateI stand by everything I have said. However, I decided to upgrade to a bottomless naked portafilter and that has changed everything. The dial in on a new coffee is so much easier and the crema and flavor of the coffee is so much easier to manipulate!The other big thing I have discovered is the perfect coffee. Do yourself a favor and go get Tony’s Upland blend. Brew it to a 2.7 ratio at roughly 27 seconds. Oh…. My….. Gosh…..! You’re welcome.",
                "reviewVotes": "1,681 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61+z-fQvOhL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/612fodR-Z-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61CKNBEzm6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61IagOCZK+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ZoMcGzWwL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61cC-2ym-xL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61eQY9H1QFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61sGFPQgmKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61tlcP0zu9L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712Pl03jMYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CfO7CtHVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71PpE7IkJzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71rCoTluS1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71tkog8aDVL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelcie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAW4ZKF7LZ7FCCLZJCUHW7NCTZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REA0F8M7530MH?ASIN=B08C96BG9H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Incredible!",
                "reviewText": "So I had purchased a cheaper espresso machine before and it was such a pain. I truly struggled just to prepare, make my coffee, steam the milk, then clean up the mess. Took me 15 minutes just to do that! This machine is much faster! Heats up in seconds, and then the milk steams in a couple minutes! A few tips that I have learned over the years of making espresso:1. Rinse your tools! After using the coffee filter, I truly know the easier way is to dump the grounds and rinse them off. If you do have time, take out the part that holds the grounds from the handle bar and rinse that, but really you should be able to just leave it after rinsing to start. The directions recommend taking apart filter shots after a couple hundred coffee cups! And I’d rinse off the steam wand as well, milk builds up, it takes just a few seconds but saves you time! The steam wand and the rubber tip that shoots steam come right off, I would rinse those too. And finally (without touching too much because its hot!!!) I’d wipe the machine part where the hot water goes into the coffee, it gets grounds on it. Just a wet paper towel.2. Shoot steam before and after steaming milk!They put this in the directions also, you need to shoot out some steam for a couple seconds before doing the milk because water can drip out at first! Then I like to do it again after you finish, in case milk gets sucked into the spout. It can make it easier to clean and keep your steamer clear!3. DESCALE!!!! They recommend this after 200 coffee cups (same as the shot filters). They have their own brand of descaler, but there are others out there (unsure if others are able to use for this machine). The directions help, they say to add 1/4 a bottle of descaler to the water tank then fill the rest with water (the bottle of descaler also has the directions) then you leave the portafilter off and run the machine into an empty bowl and also spray the steamer a good bit. Then you wash out your water tank thoroughly and make another empty bowl of water to get the descaler out fully! It doesnt take too long because the machine is very fast! I just set a reminder on my phone for when I believe I’ve made about 150 cups, I never like to push the time limit products give me, just to be safe! Then I do the descaler and coffee shot filters at the same time! It’s super easy and can really make the machine last a good long time!!!4. Get a cup for the espresso! If you like to use a large tumbler for coffee, it wont fit under the portafilter. I like 20oz coffee mugs and add espresso to it, I had an old pour cup from my previous machine, I use it then pour the espresso into my tumbler! Unless you like a small mug of coffee, then youre fine! Keep in mind, the machine wont calculate a 1 shot or 2 shot amount, You need to turn off the machine when you feel it’s an amount you want! My pouring cup has measurements on the side so it tells me when I’ve reached 2 shots!So overall, that is my experience and I truly think this machine was worth the cost!!!PS.***** added this a week later! FOR THE DOUBLE SHOT, I suggest doing one scoop tilting the scooper sideways and tapping gently, then packing it in!! Then you can do the same thing again! I recommend doing this over a coffee container or the sink or trash, it will likely be somewhat messy!!! You get the hang of it though!",
                "reviewVotes": "54 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hugo Cesar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 6, 2023",
                "reviewTitle": "Una buena cafetera para disfrutar un buen espresso",
                "reviewText": "Es un equipo sencillo de uso y con un manual de usuario detallado. La calidad es excelente, los terminados en los filtros y la cafetera son bastante buenos. Al principio me resultó confuso el exceso de ruido que hacía,pero leyendo el manual descubrí la razón y se corrigió ese detalle. Hay equipos muy modernos de la misma marca y algo más costosos pero para mi, este aparato cumple su objetivo con creces.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monica JaramilloMonica Jaramillo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 21, 2023",
                "reviewTitle": "High quality - Delicious coffee!!!",
                "reviewText": "This espresso machine is wonderful! Great quality for a very good price. It's very easy to operate and to clean, it is not as noisy as I initially thought, you get delicious espresso and cappucino shots. My husband is a coffee aficionado and he is in love with this machine, we are really happy with this purchase. Recommended!",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61cfRlbstZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "M I TANASA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 5, 2022",
                "reviewTitle": "Noise and watery coffee",
                "reviewText": "Really noisy and didn’t make the coffee as shout be so watery coffee.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Realperson101",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 29, 2024",
                "reviewTitle": "Amazing value",
                "reviewText": "Works perfectly. Great entry level machine for everybody",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonio Huesca Herrera",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 7, 2024",
                "reviewTitle": "Compacta y funcional",
                "reviewText": "Una cafetera compacta, excelente y eficiente.El espumador de leche es muy buenoVale la pena el precio.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}