{
    "remaining_requests": 35874,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bonavita-One-Touch-Featuring-Thermal-BV1500TS/dp/B00SK5IXPQ",
    "body": {
        "name": "Bonavita 5 Cup Drip Coffee Maker Machine, One-Touch Pour Over Brewing w/Double Wall Thermal Carafe, SCA Certified, 1100 Watt, BPA Free, Dishwasher Safe, Stainless Steel, BV1500TS",
        "price": "$149.99",
        "originalPrice": "",
        "rawPrice": 149.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bonavita-One-Touch-Featuring-Thermal-BV1500TS/dp/B00SK5IXPQ",
        "soldBy": {
            "sellerID": "AXIXCKCSVXIQ7",
            "name": "Bonavita Life",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AXIXCKCSVXIQ7&asin=B00SK5IXPQ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "Only 8 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 iMiC2yuL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41k-13KD32L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vqZ88BfNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TMGjDa4fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/313xnRWYwnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ndg-yIneL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Rw2GaFMbL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bonavita Store",
            "link": "https://www.amazon.com/stores/Bonavita/page/1F1ECE4A-E9F0-4B16-AFB5-D97304C204DF?ref_=ast_bln"
        },
        "brand": "Bonavita",
        "merchantInfo": "Bonavita Life",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 2775,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 8 hrs 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SPECIALTY COFFEE AT HOME: Bonavita’s 5-cup coffee maker is engineered to similar brewing specifications as our popular 8-cup series brewers, is best for those who prefer to brew their coffee in small 4-5 cup batches",
            "AWARD WINNING RESULTS: Golden Cup Standard Coffee Machine is curated with features to mimic the artisan pour-over brewing method. This machine brews coffee to Golden Cup Standard when following our recommended brewing instructions, and is curated with features to mimic the artisan pour-over brewing method",
            "BETTER FLAVOR, FAST: 1100W heater maintains professional recommended brewing temp of 198°-205°F (91°-96°C) for optimal flavor extraction; Stainless steel thermal carafe is durable and double-walled to keep coffee’s ideal temperature longer",
            "TASTE THE DIFFERENCE: Showerhead and filter basket work in harmony to evenly saturate coffee grounds for uniform flavor extraction; Optional Pre-Infusion Mode allows fresh roasted coffee to bloom before brewing to enhance its flavor",
            "BREW WITH BONAVITA: Our coffee brewers and kettles create enriching and delicious coffee experiences without fuss; As your trusted home barista, our appliances are designed to fit with all kitchen decors and deliver great brews all day, every day – cup after cup!"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "40 Fluid Ounces"
            },
            {
                "name": "Special Feature",
                "value": "Thermal"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Pour Over"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Wattage",
                "value": "1100 watts"
            },
            {
                "name": "Voltage",
                "value": "110 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Product Dimensions",
                "value": "6.2\"D x 12.3\"W x 10.6\"H"
            },
            {
                "name": "Item Weight",
                "value": "5 Pounds"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 2,775 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#56,904 in Home & Kitchen (See Top 100 in Home & Kitchen) #122 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "Bonavita"
            },
            {
                "name": "Included Components",
                "value": "Carafe"
            },
            {
                "name": "Model Name",
                "value": "5 Cup Coffee Maker with Thermal Carafe,"
            },
            {
                "name": "Model Number",
                "value": "BV1500TS"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Color",
                "value": "Black, Silver"
            },
            {
                "name": "Capacity 40 Fluid Ounces",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 5 Pounds",
                "value": "Wattage 1100 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Specialty Coffee Association - Certified Nov 2022",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1cf1178b-4f42-47cd-b06a-4e6b69eb7df4.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "5 Cup One-Touch 8 Cup One-Touch Connoisseur Capacity 5 Cups 8 Cups 8 Cups SCA Certified ✓ ✓ ✓ Warming Plate No No No Insulated Carafe ✓ ✓ ✓ Pre-Infusion Mode ✓ ✓ ✓ Filter Basket Style Hanging - Flat Bottom Sits on Carafe - Cone Hanging - Flat Bottom Pour Over Style Brewing ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03abc750-b017-4515-b25f-a363fa36f4d7.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e43f7ec0-f4b0-4ef2-ab90-f1297f4987c3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f2c42e0-c559-4851-9fcd-30954c028fc6.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6975e285-b187-46e0-8e99-5207bf6ed0b9.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0b916a8f-3008-45a3-bef1-9713a2f5343c.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/826b69a5-e9c9-4aed-bc30-96aed4ed6f7f.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9922fff6-8d34-4ad8-86be-4b5c257ee459.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1cf1178b-4f42-47cd-b06a-4e6b69eb7df4.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ef87f311-21eb-4523-91d2-f61f3d46a918.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e917550b-4eee-452d-b03c-fc074cc61c7e.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/adee51dd-1fd4-46e6-9c45-f900bff70f90.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30053979-916c-48fc-aa82-b253ffc4a1c2.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Paul Rako",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRNVUZUSPLPKDV65CORK2MUIZUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10EWIAFENAA0V?ASIN=B00SK5IXPQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2017",
                "reviewTitle": "5.0 out of 5 stars The best coffee I have ever had.",
                "reviewText": "I am not a coffee snob. I drink it with milk. I use Folgers decaf. I refuse to grind my own beans. I prefer to let billion-dollar multinational corporations do the grinding for me. I used to plop three heaping tablespoons of Folgers into a cut-open plastic jug and pour my reverse-osmosis filtered water over it. Then I put it my microwave for 14 minutes. I drained the coffee through a Brawny paper towel into a 30oz Balfor thermal mug I got on Amazon. OK, so a bit savage and feral, but I didn't want to be a total suburbanite with a coffee machine. The Bonavita BV1500TS brews in one-third the time. I bought one of those gold-tone permanent filters so no drinking paper residue. I was delighted to see Bonavita is thoughtful enough to put a 4-pack of filters in the box, so I didn't have to wait for the permanent filter to arrive. I was sure my low-temperature microwave method would be less bitter, but it was the exact opposite. The Bonavita made perfect coffee, and it was my goofy old method that made the coffee taste bad.There is a review on CNET, \"Bonavita BV1500TS review: A high-end brand's step-down coffeemaker brews with bitter results,\" by Brian Bennett. He claims this model makes bitter coffee. He also says he loves the 8-cup model. He notes that he tested with a very touchy coffee known to be bitter. I almost bought the bigger unit based on this. I am so glad I didn't. The coffee I made today was the best-tasting, smoothest, most delicious coffee I have ever had anywhere. I disagree completely with Bennett's review. Maybe it is outdated. Maybe he got a bad unit. Maybe he did not run three carafes through the unit in preparation, as the directions tell you to. Maybe he got the coffee maker on a grumpy day. As an engineer, I can see that the water delivery system needs to cool the water down from boiling before it drips on the grounds. Maybe Bennett left the lid open or blocked the vents or tested in a hot or cold warehouse. All I know is he is dead wrong. His testing was not double-blind, so I don't put much credence in it.The unit came in a couple days, even with regular (not Prime) free shipping. It was delivered on Saturday despite saying it would be Monday. Yeah Amazon. The unit was well-packed, and had a decent little manual included. As noted, I loved they put in 4 filters, although the gold-tone filter came today too, but only after I made the first cup.OK, its fast, and fantastic coffee, and its small and compact. The bad is that while it brews in minutes, you have to wait for the water to drain past the coffee after it stops brewing. No different than any other machine, I suppose. There is a plastic lip inside the stainless steel carafe so it never drains completely. No problem, one factor in getting this one versus the 8-cup model is that there is a glass double-wall thermal carafe available for this model. Its 30 bucks, here on Amazon. I will suffer with the stainless carafe until I do a \"treat yo'self\" to the glass one. I did love how the top screws onto the carafe, with perfect registration and a lever to open carafe drain. It does have a very restricted flow out of the carafe. Come on Bonavita. This is a drug delivery system. We want it fast. I did not notice any leaking or dripping problems as some others have noted. After I made the three conditioning pots, for the actual first coffee I did not bother to screw on the top. I just poured directly into my 30oz Balfor thermal mug, then added the milk. The perfect temperature of the coffee made it taste even better. This was after adding milk however.No, this is not a shill review. I bought it with my own Social Security money here in the Florida retirement community. I am just so used to being disappointed with products, it was great to get one that exceeded my every expectation. Best yet, I save wear and tear on my old analog commercial microwave, a Sharp R-6300. Search Google for Sharp R-6300 and you can read an article I wrote years ago about that great unit. Next up is a tea-maker I also ordered from Amazon. I hope its as good as this product. Its another way to reduce the usage of my microwave, which I consider irreplaceable.I got so worked up writing this, it occurs to me there is no reason I can't make a second pot tonight, its decaf after all. Now I get to try the paperless filter, yippee.[Update, Oct 2021, four years later.] I still love this coffeemaker. I not only have used it every day, I have taken to brewing tea in it, so that means I use it more than twice a day on average. A family-sized tea bag makes 5 cups, four brews fills the gallon jugs I used to buy at the supermarket. Way cheaper, I can make decaf or caffeinated tea, and no artificial sugar or high prices. I love that it just takes one button press, no \"features\". I don't want to program a computer with every product I use, I just want to press a button and have it brew and turn off automatically. I don't want a heater under the carafe.I had to buy two more double-walled glass carafes. One I dropped. Good thing, since its pour spout was hand-firmed and way too tiny, it was nearly impossible to pour without dribbling coffee down the side. The second was not properly sealed so condensation formed inside. There is a little glass nipple on the bottom where they are supposed to seal it off, and that was not sealed. The handle is two small as well, but it kinda works. My review for that will be \"Italian style, Italian quality.\" I came back here today since I am considering buying a second one, since I don't want to go a day without the machine, when the first one wears out. I did learn that some people credit the cone filter with better coffee. Oh, I gave up on the permanent filter, it left little grounds in the coffee. I just use a #4 cone filter from Publix. They are cheap and work great.",
                "reviewVotes": "104 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Clinton Webb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7WTYK2UI7QPFCLR6K4VCUMM2YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQJMKCA6AO59M?ASIN=B00SK5IXPQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2016",
                "reviewTitle": "5.0 out of 5 stars A great choice if it's on sale",
                "reviewText": "I got this on an \"open box\" deal for $66, and for that price it's impossible to beat. For the list price it's still quite good but possibly more difficult to justify. I would say for what I paid, it's a five star product. For the over $100 list price, it's closer to four stars. Read on for my detailed thoughts.I've worked at a few coffee shops, done cuppings with roasters, tried many different brewing techniques, roasted my own beans, etc, so I've definitely tried plenty of good coffee. This coffee is good. When you pay more for a drip machine, you're essentially buying consistency -- water temperature, volume, brew time, where the water is distributed over the grounds, all of these things matter, and make a difference in the flavors that end up in your cup. So while a $10 walmart dripper just indiscriminately dumps some moderately hot water over your precious coffee, a more expensive maker will control these variables with greater and greater precision. It's possible a moccamaster is more precise, but I don't have experience with one. I can say that the coffee the bonavita produces compares favorably with the extremely expensive, top of the line fetco machines (with proprietary spinning showerhead drippers and all the other bells and whistles) we had at the last coffee shop I worked at. I've changed cities since I worked there, so it's difficult to compare apples to apples, since I don't have access to the same beans, but using fairly middle of the road beans I've gotten pleasing results. It's not as good as the godly-est pourovers I've ever had, but it's fairly consistently quite good, doesn't require you to stare lovingly at your hario for 10 minutes, and can brew several cups at once, unlike an aeropress. Changing the volume of beans used and the fineness of the grind yield relatively predictable results, which is a wonderful encouragement for experimentation in search of your personal perfect recipe.To address some of the common complaints:I find the coffee plenty hot when the machine is finished brewing. It's very important to preheat everything before you start brewing, especially since it's a comparatively small volume of hot coffee. I run a two or three cup \"blank pot\" through the machine to rinse the filter and heat everything up before I brew.It's true, the pot does not keep the coffee hot all day, however I have to say it's just a little ridiculous to expect it to. It's a relatively small volume of liquid (less liquid=less heat retention) in a pot that has a fairly large surface area, including that big, plastic, heat sucking lid. This is part of the reason for the tall, skinny design of the moccamaster, to minimize the surface area of the lid. I've found the bonavita carafe keeps my coffee reasonably hot for a couple hours, which is plenty for me. It might not be the world's best thermal pot but it's also not terrible, and the wider lid makes it easier to clean. For what I paid it's fine.It's got a few plastic parts but what coffee maker for around $100 or less doesn't?I don't know if they changed the design of the carafe since the previous reviewers bought theirs, but I don't experience the problems they've had with pouring without the lid. I wouldn't call it a great pouring experience but it also doesn't make a huge mess as others have complained. It definitely pours better with the lid but if I pour a cup without I don't have any problem. Maybe a drip or two but nothing out of the ordinary. That being said, the complaint about there always beings about a tablespoon of liquid remaining in the carafe is totally true. It doesn't make me crazy, but it is kind of mystifying how I can leave the thing upside down for hours, come back, and there's still a tablespoon of water rolling around in there. I don't think the volume of liquid is enough to affect the quality of the coffee, and if you wanted to you could just dry it out with a towel, but it is a very strange design problem.Bonavita offers a double walled glass carafe replacement that looks beautiful and is probably better than the stock one on most counts, but is rather expensive given the cost of the machine itself.Overall, if you want something approaching consistency and quality from a drip brewer, this is a good choice. Maybe not the world's best, but also not the most expensive. Since I got it for 66, I'm quite happy. But if I had bought it for list price, I might have felt like I would rather have saved some money and just worked on my chemex technique. So at 66, five stars, over 100, four stars.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabriel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 16, 2020",
                "reviewTitle": "Brews Delicious coffee",
                "reviewText": "I have seen reviews claiming that it wasn't certified by the sca and that it was doing \"bad coffee\". This is incorrect. While this product did not recieve the certification that the 8 cup got, it brews at the exact same temperature using a 1 100 watt heating element. It consumes less electricity but still brews between 195-205f, i know, i tested the temperature. And for those who don't know, it wasn't certified because it only brews 25oz of coffee, the sca only certifies batch brewers that do 32oz and more.The coffee maker is very simple to use and intuitive. You only have an on switch to push, that's it. The design of the way it brews is where it is considered a shortcoming: you have to place the basket on top of the open carafe and let the machine do its work. Then you should proceed to manually screw the lid and fine somewhere to drop the basket and let it cool down. Other than this weird design choice, it's an incredibly intuitive machine to use.It brews excellent coffee, provided you have a quality burr grinder, a precise scale and quality beans and by quality, i mean those more expensive beans selling at around $21,50 the 300g. As long as you invest in proper, quality coffee beans, this brewer will be a solid option as using grocery pre-ground coffee is deffinitely not a proper option for this one because like i said at the beginning, it brews at higher temperature than cheaper machines, so pre-ground coffee just won't be good.Overall, it is a very solid and competent drip machine and as long as you only use quality beans and measure your doses, you won't be disappointed by this one.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 9, 2019",
                "reviewTitle": "Buena cafetera",
                "reviewText": "Me gusta mucho hacer mi propio café por diferentes métodos, filtro, prensa etc pero no tengo mucho tiempo por la mañana para prepararlo como me gusta, por ello busqué por un buen rato cafeteras de goteo que no quemaran tanto el café, leí súper buenos comentarios en amazon.com de esta cafetera, creo que algunos son exagerados porque obviamente depende mucho del tipo de café que uses, yo compro tostado medio y molido medio, para mí es la mejor combinación para esta cafetera y con función de preinfusión, ya que tostado oscuro lo quema y deja un sabor a quemado. La cafetera incluye un par de filtros para usar de inmediato, el filtro reusable también sirve y filtros del número 4 así como una solución para descalcificar la cafetera. No olviden lavar las partes y usarla con agua un par de veces antes de usarla con café. Creo que esta cafetera es un buen complemento para alguien que cuenta con poco tiempo en las mañanas, pero tampoco quiere café quemado todo el tiempo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Giovanni C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on June 18, 2017",
                "reviewTitle": "Tanto semplice, quando efficiente.",
                "reviewText": "Niente fronzoli, né complicazioni, né discutibili programmi, né l'atroce piastra riscaldante che rende il caffè imbevibile dopo un quarto d'ora. Fa il caffè, semplicemente; lo fa molto bene, perché l'acqua (miracolo!) raggiunge 95°C, e lo mantiene caldo nella caraffa termica senza farlo irrancidire. Ideale per chi preferisce un buon caffè ad una buona elettronica.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "浄見史都香",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on May 27, 2018",
                "reviewTitle": "使いやすいです",
                "reviewText": "ポットの口が狭く洗うときに手がひっかかるのを除けば、たいへんいいです。毎朝使っています",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ROGELIO PEREZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 12, 2022",
                "reviewTitle": "Hace muy buen café",
                "reviewText": "Excelente cafetera, solo necesito café en grano, lo muelo más bien grueso casi como para prensa francesa, activo la pre infusión y me queda el mejor café que he probado en una cafetera de goteo. Plus: temperatura ideal, vertedero tipo regadera, no se desperdicia el café, se mantiene caliente sin quemarse. Vale lo que cuesta.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$150.95",
                "sellerName": "Kitchen Kapers",
                "sellerRating": "5"
            }
        ]
    }
}