{
    "remaining_requests": 35880,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mueller-Function-Anti-Drip-Permanent-Borosilicate/dp/B08TYTBX8X",
    "body": {
        "name": "Mueller 12-Cup Drip Coffee Maker, Auto Keep Warm Function, Smart Anti-Drip System, with Durable Permanent Filter and Borosilicate Glass Carafe, Clear Water Level Window Coffee Machine",
        "price": "$29.87",
        "originalPrice": "",
        "rawPrice": 29.87,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mueller-Function-Anti-Drip-Permanent-Borosilicate/dp/B08TYTBX8X",
        "soldBy": {
            "sellerID": "A19CSHFDLJUHLG",
            "name": "DOCTORS BEST PRODUCTS INC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A19CSHFDLJUHLG&asin=B08TYTBX8X&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41OwJTdd ZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51HDF400XlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419dRPoKazL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/414gmIR4MEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5100HhsfUXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51f ay0cmGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Hpe5nKStL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Mueller Austria",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Mueller+Austria"
        },
        "brand": "Mueller Austria",
        "merchantInfo": "DOCTORS BEST PRODUCTS INC",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 4770,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 8 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Large Capacity - Glass carafe with 60 fl oz capacity, this allows you to brew a large amount of coffee up to 12 full cups, or simply choose 2 or 4 at a time. It has an easy-grip handle for comfortable, drip-free pouring. The dishwasher safe carafe is made of high-quality, non-porous borosilicate glass, which won’t absorb odors, while its superb heat-resistance will keep your coffee hotter for Ionger.",
            "Permanent Filter - All in one Coffee machine which allows you to wake up to fresh coffee every morning. Eliminate the need to buy costly paper filters as this coffee machine has a permanent filter that can be removed and washed, however filter paper can still be used if you prefer. Savor the flavor in every refill.",
            "Anti-Drip and Anti-Slip Features - Boasting a built-in smart anti-drip feature, you can ensure that your coffee maker and kitchen counter-top remain clean and tidy. The anti-slip feet firmly support the machine for added safety.",
            "Keep Warm Function - The handy keep warm function allows you to keep your coffee at a consistent temperature and ready to drink when you are. After your machine has brewed a fresh carafe of coffee, the warming plate will retain heat, keeping the carafe warm until turned off.",
            "Superior Quality With Mueller - We are here to offer you only the best quality products designed to make your life easier. If you need any help, please feel free to contact us. Our unparalleled 24/7 live telephone customer support is ready and waiting to assist with anything you need!"
        ],
        "description": "Mueller 12-Cup Drip Coffee Maker, Auto Keep Warm Function, Smart Anti-Drip System, with Durable Permanent Filter and Borosilicate Glass Carafe, Clear Water Level Window Coffee Machine",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "12 Cups"
            },
            {
                "name": "Special Feature",
                "value": "Permanent Filter"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Paper"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coffee maker"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Wattage",
                "value": "650 watts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Material",
                "value": "Borosilicate Glass"
            },
            {
                "name": "Product Dimensions",
                "value": "10.55\"D x 7.68\"W x 12.52\"H"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 4,770 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#216,937 in Home & Kitchen (See Top 100 in Home & Kitchen) #342 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "Mueller Austria"
            },
            {
                "name": "Included Components",
                "value": "Filter, Carafe"
            },
            {
                "name": "Model Name",
                "value": "MUDC-550"
            },
            {
                "name": "Model Number",
                "value": "DC-550"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Capacity 12 Cups",
                "value": "Material Borosilicate Glass"
            },
            {
                "name": "Wattage 650 watts",
                "value": "Human Interface Input Buttons"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5T2HUHEJLGEYOBGPQ2BIGPW3VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DFG52B3U3QWI?ASIN=B08TYTBX8X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 13, 2022",
                "reviewTitle": "5.0 out of 5 stars A great, easy-to-use coffee maker! (Update: 6 months later and it's still a great machine)",
                "reviewText": "Update: The machine died seven months inA few days ago when I had company for the holidays, my machine completely kicked it. Light would come on, but no water would brew and no heat came on the hot plate. Normally this wouldn't be a big deal and I would order a new one, but it was the day after Christmas and I had guests, so I had to run out to the grocery store and buy a $20 Toastmaster to bring back home.I'm a little disappointed in durability. I am absolutely aware that I am rough coffee customer, making at least 4 full twelve-or-sixteen ounce mugs a day and more when I have company, and I also left the hot plate on every day for a few hours between mugs. Still, this machine didn't even last as long as my first Keurig, and that thing died quick.I put this machine through it's paces, and was never disappointed by its quality or its performance. It made its last cup as good as its first, never developed off-tastes or anything. Its built-in coffee basket was good, and when used with paper filters I find it made a very fine cup of coffee. I am, however, admittedly still disappointed that it went so soon.Would I buy it again? Well, I had to buy the Toastmaster that day because Amazon was going to take a while and I needed it that day. Mueller's cup was admittedly superior to that one's, and it held more coffee, but the Toastmaster performs fine enough so I'll keep it until it dies. Will I return? Maybe. I did like it a lot. I think I'm only disappointed because I was so enthusiastic about its performance only to find it didn't last very long.Original ReviewI don't really grow a loyal following towards brands. I like both Coke and Pepsi, I think both McDonalds and Burger King make fine burgers, etc. So I found myself very surprised when I kept coming back to Mueller for my coffee products. I first bought their Nespresso Machine (Which I don't think is available anymore :( Mueller, please bring this one back!), then got their electric kettle, the k-cup machine (Which honestly was my least favorite of the bunch; it was fine, but it heated up really slowly and you couldn't make multiple cups for friends), both of their grinders, and now the drip machine. I am most certainly not a blind fangirl, but I can tell you that Mueller has consistently done wonderfully in the coffee world, and certainly punches above its price-tag.Some background. I've been making learning and making coffee for eight years. I own tons of coffee makers, I have a legit espresso machine and a high-quality grinder, I know all about grades of specialty coffee and how to make them, etc. But I have been diagnosed with a serious disability, and that made the whole extensive process of pulling in that perfect cup of coffee was draining way too much of my daily energy for results that ultimately weren't worth it.I stopped drinking coffee because of this, but I really wanted my daily cup. So for less than $30, I picked this one up from a company I knew I liked. I have tried this machine with everything, from french roasts to specialty coffee, old pre-ground or freshly roasted and ground, it comes with a permanent filter but accepts 8-12 cup paper filters as well (A wonderful blessing with my area's drought when rinsing your permanent filter can suck), and it never complains except the one time I packed the grounds far too tight in it, which just needed a quick loosening halfway through. Everything I've made has come out tasty and just the right temperature.For you fancy coffee aficionados out there like me, this is a $30 machine so there is no programming. You can't set it to make your coffee at a certain time, you can't program in a bloom phase, you can't dial in your coffee-to-water ratio. But sometimes when you're sick and tired, something you can pour some water and grounds into, go take a shower and have your day's worth of coffee ready when you get back... it's just a blessing. The heating element will keep any amount warm, although you might want to be careful not to leave it on too long if you have under a cup left since that might cook it instead of warm it.(Incidentally, if you want a bloom, I found letting a few drops come through the cycle then taking away the carafe and returning it 30 seconds later did the trick. I also noticed that the water is extremely well-dispersed; when you look at it, it's a round puck of coffee, there isn't a giant hole that pressure pushed through the middle. This makes better coffee, and it will bloom beautifully)And when I say it's simple, I mean it. On days when I don't feel good, I can roughly pour some grounds straight out of the bag into a filter, use the carafe as my measuring cup to add water, turn it on and a few minutes later some genuinely tasty coffee is ready. It never complains if I haven't cleaned the carafe properly, if I accidentally add too much or too little, if I'm using staler grounds, it always comes out yummy.If you're a coffee lover who is wondering if the complex process for your black gold is truly worth it on those early mornings, I have to tell you, it's been awesome. There will always be a place for your Olympia Cremina or your thermal Breville, but for undeniably cheap, easy, quick, genuinely tasty coffee, I don't know if you'll be able to beat this one.My one complaint is that I do worry slightly about mold if you don't take care of your machine. I've never had this in the one or two previous drip machines I've had, but after you make coffee and open your machine, there is a lot of water leftover in the machine, especially in condensation underneath the lid. I don't know if this is common in drip machines, but it does worry me slightly. Still, if you keep the lid popped a little overnight, this seems to cure it. Take care of your machines!Bonus tip: If you own the Mueller burr grinder like I do, the cup that the grounds wind up in is actually a wonderful tamp for this machine, where you can compact the grounds a little. I don't actually know if this does anything on this sort of machine (It's important in espresso), but it makes me feel better and helps get the puck of coffee out at the end if you're using the permanent filter. I don't know if other grinders could be used, but you could also use a glass to do this if you wanted. Just don't tamp too hard, yesterday I kinda smashed it in there on accident and the water didn't want to flow; removing the carafe and loosening the grounds fixed this.Update: My machine still works great six months later! Like I noted before, it's a very unfussy machine that makes great coffee in a lot of styles really easily. It's easily the best drip-maker I've ever used.I have some general notes that I've learned over the months:You probably want to either use paper filters or have like a french press ready when you use this. Paper filters will block coffee oils, which can be good or bad depending on your tastes and what you want that day, but this machine's permanent filter lets even decently-sized grounds through and into my pot. If you really want a more bodied coffee, definitely be ready to strain it into another filter sometimes. Even if they don't get into your cup, letting grounds through into the pot and then leaving it on the heater for a few hours will ruin the rest of the pot.This machine tends to like medium-to-heavier coffees and make the best results there. If you can find beans that are nuttier, chocolatier or even a little spicier, this machine will do really well. Something more delicate like a specialty light roast or something silkier or that has wine notes is alright, but not optimal.This machine doesn't appear to have boil protection, so definitely never leave it on overnight or if you have to go to work. I left mine on one evening when I fell asleep and when I woke up eight-ish hours later, the four cups had turned into a one cup and the whole thing was steamy and angry.Overall, I love this machine and give it an enthusiastic five stars. Mueller is a rare company that has won me over, someone who never falls for marketing. Definitely a good company and product.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cat Door",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFQ7K3UWXJIOLPDAJW7LKA2MCAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BBY3NRLJ79O7?ASIN=B08TYTBX8X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2022",
                "reviewTitle": "5.0 out of 5 stars Great Coffee Maker for GREAT Price",
                "reviewText": "My old one died. We had it for 12 years and I bought it from a garage sale so who knows how ole it was before that? This one is new. It is clean, easy to use, has every feature I could want, and cost very little. It is not a piece of junk just because it is not 80 or 100 or 300 dollars. True, it won't start itself and let me arise to a cup of coffee, but it makes a cup fast. I only used it once. I timed it: I opened a bag of coffee, measured out enough to make 6 cups, closed the bag tightly, put the cup in place, put the filter that comes with the coffee maker (saving me needing to buy filters), put the filter into the machine, filled the carafe with 6 cups of tap water, poured it into the pot and turned it on. The coffee was ready to drink (hot and smelling great) in a total of 8 minutes. That was just enough time to prepare some toast and an egg! I shared the coffee with my mom and we both LOVED it! A drip machine in our opinion makes the best coffee. We don't like percolators or pods. Both tend to in our opinions to result in a more acidic tasting coffee. I am so glad I found this machine. We will enjoy it for years to come!We consider coffee is a treat. We limit our drinking to once a week to keep it special. We like to taste it a bit like a wine connoisseur and to experiment with different countries of origin and different mixtures. We also like to have different items with it and to observe the way some things such as a bit of cake, fresh bread, etc. go with it. So, having a good consistent clean hot simple maker allows us to have fun with it!",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENFTSGMBW76USK3JCRI7POMTJIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IBJB5138JU1O?ASIN=B08TYTBX8X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2022",
                "reviewTitle": "4.0 out of 5 stars Budget Friendly Sleek Basic Maker",
                "reviewText": "I purchased this because it was budget-friendly, had a small footprint on my counter, and was stylish and modern-looking. It is also fairly quiet and very easy to use, as it only has one toggle switch. The filter also seems to be easier to clean than my last, more expensive, maker. Alas, I thought I could live without an auto shut-off, but my memory is failing and the other coffee drinkers in the house are too rushed in the morning to remember to shut it off, so it's trade-up time. If you're looking for a small, stylish, basic unit for a decent price that brews a good cup of joe (and are more responsible than my family), this fits the bill nicely.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCYTOQE77ZPNHPL6HUN6FYPUJSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BN439AIKL2XB?ASIN=B08TYTBX8X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2022",
                "reviewTitle": "5.0 out of 5 stars Excellent coffee maker, unbeatable price, high quality",
                "reviewText": "We’ve bought the Mueller brand before for a few other kitchen appliances, and like all the other Mueller products we have, this coffee maker is of stellar quality and at an unbeatable price! It’s so much better than the Mr. Coffee we had before, and I love that it uses a washable filter, as that will save us a ton of money in the long run and reduce waste. Wish we had gotten this years ago! Makes a delicious cup! I especially like that the warmer doesn’t auto turn off, because I like to enjoy my coffee over the course of the entire day, and this will keep it warm the whole time without me having to keep turning it on over and over all day. Absolutely perfect little coffee maker.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Mason",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 14, 2022",
                "reviewTitle": "Beware - may not be useable in UK",
                "reviewText": "A lovely looking coffee maker but.......It has a plug for the USA not the UK.I bought one and it had a US plug on it. The seller (BestQuality Mall) gave me a refund.Another supplier I contacted has just informed that their's also does not have a UK plug.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$29.88",
                "sellerName": "USA E-MART",
                "sellerRating": "5"
            },
            {
                "price": "$36.99",
                "sellerName": "THE LAST STORE",
                "sellerRating": "5"
            }
        ]
    }
}