{
    "remaining_requests": 35949,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Keurig-K55-K-Classic-Coffee-Programmable/dp/B018UQ5AMS",
    "body": {
        "name": "Keurig K-Classic Coffee Maker K-Cup Pod, Single Serve, Programmable, 6 to 10 oz. Brew Sizes, Black",
        "price": "$109.99",
        "originalPrice": "$149.99",
        "rawPrice": 109.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Keurig-K55-K-Classic-Coffee-Programmable/dp/B018UQ5AMS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CHYVYHV4"
        ],
        "asinVariationValues": [
            {
                "asin": "B018UQ5AMS",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41awJlhnx-L._SS36_.jpg"
            },
            {
                "asin": "B01BOU6DLE",
                "variationName": "Color",
                "variationValue": "Rhubarb",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41kGIu4aqIL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41awJlhnx-L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/414ebq3dPiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CGaJgKp9L.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Keurig Store",
            "link": "https://www.amazon.com/stores/Keurig/page/0B04B9D1-B1B3-445A-9B1D-E274FEEC9CD9?ref_=ast_bln"
        },
        "brand": "Keurig",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 99810,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 9 hrs 1 min",
            "FREE delivery February 19 - 21",
            "Or fastest delivery Monday, February 19"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Note: 1)Too coarse a grind, too little coffee, or insufficiently tamping the grounds before brewing can all lead to inadequate pressure for a proper brew. 2)It is important to note that the amount of espresso extracted will vary depending on the grind size and amount and reprogramming may be needed when the size and amount are adjusted.Please refer to user guide or user manual or user guide (provided below in PDF) before first use",
            "Brews multiple k-cup pod sizes: (6, 8, 10 ounce) – the most popular k-cup pod brew sizes. Use the 6 ounce brew size to achieve the strongest brew.",
            "Large 48 ounce water reservoir: Allows you to brew 6 plus cups before having to refill, saving you time and simplifying your morning routine. The water reservoir is removable, making it easy to refill whenever you need to.",
            "Descaling: An important part of cleaning your keurig brewer. This process helps to remove calcium deposits, or scale, that can build up inside a coffee maker over time.",
            "Auto-off: An auto-off feature is easily programmed to turn off your coffee maker after it has been idle for 2 hours, helping to save energy.",
            "Simple button controls: Just insert a pod, select your desired cup brew size, and brew a great-tasting cup in under a minute.",
            "Fabric type: Plastic"
        ],
        "description": "Product Description The Classic Keurig K-Cup Single Serve Coffee Maker, and a perennial best-seller, the Keurig K-Classic brews a rich, smooth, and delicious cup every time with the quality you expect from Keurig. Simple touch buttons make your brewing experience stress free, and multiple K-Cup pod brew sizes help to ensure you get your perfect cup. Whether you like your coffee strong, mild, decaf, or flavored, you can brew all of your favorites with the Keurig K-Classic– and with large 48oz water reservoir, you can brew 6+ cups before having to refill. Discover hundreds of K-Cup pod varieties from all of the brands you love, including Green Mountain Coffee, Starbucks, and Lipton, and enjoy coffee, tea, hot cocoa and more. Also available in a two fun colors to complement your décor, and compatible with the Keurig Classic Series My K-Cup Reusable Coffee Filter, so you can brew your own ground coffee. Brand Story By Keurig",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Single-Serve Brewers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=2474054011"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "8 Ounces"
            },
            {
                "name": "Special Feature",
                "value": "Programmable, Removable Tank, Auto Clean Function"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Product Dimensions",
                "value": "9.8\"D x 13.3\"W x 13\"H"
            },
            {
                "name": "Item Weight",
                "value": "9 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 99,810 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#296 in Home & Kitchen (See Top 100 in Home & Kitchen) #3 in Single-Serve Brewers"
            },
            {
                "name": "Brand",
                "value": "Keurig"
            },
            {
                "name": "Included Components",
                "value": "K05 Coffee Maker"
            },
            {
                "name": "Model Name",
                "value": "K-Classic Coffee Maker"
            },
            {
                "name": "Model Number",
                "value": "K-50"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Style",
                "value": "Classic"
            },
            {
                "name": "Capacity 8 Ounces",
                "value": "Material Plastic"
            },
            {
                "name": "Item Weight 9 Pounds",
                "value": "Voltage 120 Volts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Keurig K-Classic Coffee Maker Single Serve K-Cup Pod Coffee Maker The Keurig K-Classic brews a rich, smooth, and delicious cup every time with the quality you expect from Keurig. Simple touch buttons make your brewing experience stress free, and multiple K-Cup pod brew sizes help to ensure you get your perfect cup. Whether you like your coffee strong, mild, decaf, or flavored, you can brew all of your favorites with the Keurig K-Classic and with large 48oz water reservoir, you can brew 6 plus cups before having to refill. Discover hundreds of K-Cup pod varieties from all of the brands you love, including Green Mountain Coffee, Starbucks, and Lipton, and enjoy coffee, tea, hot cocoa and more. Also available in a two fun colors to complement your décor, and compatible with the Keurig Classic Series My K-Cup Reusable Coffee Filter, so you can brew your own ground coffee. Features 6, 8, and 10 oz Brew Sizes Large 48 oz Removable Water Reservoir Simple Button Controls Auto Off",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b076e30c-3a31-463f-8597-6a5009be603f.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c1e9703-f591-4903-b90f-5b24a7a87a90.__CR30,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b076e30c-3a31-463f-8597-6a5009be603f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/17e22d25-e15c-4ca2-b5fe-bdd809941030.__CR30,0,1940,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kristin B.Kristin B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4YBVO724V3BJUUFP4DBFQGNEHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23IV0ZT6LC0HU?ASIN=B018UQ5AMS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2016",
                "reviewTitle": "5.0 out of 5 stars This Keurig is My Favorite Kitchen Appliance and It's Well-Worth the Money We Spent!",
                "reviewText": "***Updates are located at the bottom of this review.******Original Review***Up until recently, I had never been much of a coffee drinker except for the occasional seasonal flavored latte drinks but I was having trouble keeping up with my very active twin toddlers. We already had a standard coffee maker but I didn't want to brew a whole pot of coffee at once and single-serve coffee makers seem to be very popular so I figured it couldn't hurt to give it a try. I had seen several different Keurigs from the basic ones to very fancy ones but wanted to purchase one that both fulfilled my needs to brew a single cup of coffee and wasn't too expensive so I opted to buy the Keurig K55 Coffee Maker in black.When the Keurig arrived, I eagerly opened up the box to get it set up and start using it! I found it fairly simple to set up since there is a Use and Care Guide included and it's easy to follow the step-by-step instructions. I'd say the setup only takes a few minutes and then you are ready to brew your first cup of coffee. There are lights on the brewer that illuminate and walk you through the brewing process but once you are used to it, it becomes second nature and now, I don't even have to think about it, which is good in the early morning when I'm not thinking straight and need my coffee!Brewing: To brew a cup of coffee is very simple. You'll need to turn on the brewer by pushing the power button. The power button and heating lights will illuminate and the Keurig will make some noises while it heats up. When the three cup sizes illuminate in blue, you know it's time to brew your coffee. Set your coffee mug on top of the drip tray and lift the handle for the K-cup pod holder. Place a K-cup pod in the holder and lower the handle completely until the three cup sizes are blinking. The three sizes are: small cup (5.25 ounces), small mug (7.25 ounces) and large mug (9.25 ounces). Select your size and the coffee will be ready in about a minute. If the water reservoir is low on water, the \"add water\" light will illuminate and the process won't continue until you've filled the reservoir. Once it's stopped dripping, you may remove your mug and enjoy your coffee! If someone else wants to brew a cup of coffee right after yours is done, all they have to do is remove your K-cup pod since they are single-use pods, add theirs and repeat the process.Water Reservoir: The reservoir holds 48 ounces of water so you don't have to fill it up every time you want to brew a new cup of coffee, which is one of the reasons I selected this model. I make about two cups of coffee every day so I end up refilling the reservoir every few days. There are filters to use with the water but I purchase bottled water so I haven't used the filters at this point. When the reservoir needs to be filled, I remove the reservoir, take off the lid, fill it up with water, place the reservoir back in the Keurig and replace the top.Cleaning: I feel this Keurig is fairly simple to clean. The drip tray is removable and I usually wipe it down with a damp paper towel a couple times a week and wash it in water, soapy water occasionally. I also like to wipe down the exterior since the front part of the Keurig gets splatters of coffee on it. You can also clean the pod holder, funnel, needles and water reservoir and lid. Be careful as the two needles used to puncture holes in the K-cup pods are very sharp.Coffee Pods (the best part!): The Keurig K55 Coffee Maker uses the K-cup pods, which you can purchase nearly everywhere and there are many brands and flavors to choose from. You don't need to buy any specific brand with this coffee maker. As long as they are K-cups, they should work and I haven't come across any pods that don't work. I've been having a lot of fun purchasing different flavors and brands since I have several friends and family members who also have Keurigs so it's a lot of fun to swap coffees! I prefer flavored coffees and there are so many out there to try but my favorites are the Green Mountain flavors in Caramel Vanilla Creme and Wild Mountain Blueberry. There are K-cup pods in different price ranges and it's nice to have that option since everyone has a different budget. The nice thing with this brewer is that the flavors don't tend to blend from one cup to the next. For instance, my mom and I have brewed cups of coffee one right after the other (different flavors) and neither of us have noticed the other flavor in our respective cups. I've only brewed one cup of apple cider with this and haven't noticed the previous coffee flavor in the apple cider or the apple cider in my next cup of coffee. In this brewer, you can use all kinds of coffee flavors from flavored to medium and dark roasts to hot chocolate to apple cider. I typically choose the small mug (7.25 ounces) setting since I like the flavor. It isn't too strong or too watered-down for me but others may prefer other settings.Programmable Auto Off Timer: You can set the brewer to turn off two hours after the last cup of coffee has brewed (included in the instructions). I just turn the Keurig on and off as I need it but it's nice to have that option.Noise: Some people have stated that this brewer is noisy. I've found it's the noisiest when it's taking water from the reservoir and it sounds like a loud hum. It's not too loud when it's brewing the cup of coffee. I occasionally get up earlier than my husband and kids and brew a cup of coffee and no one has woken up (I'd say there is about 30 feet between the kitchen and bedrooms with the doors closed). When we have guests and they brew coffee before I wake up, I can't hear it at all.This Keurig is made in China and mine had a packaging date of August 2016, a month before I purchased it. I've been using it for two months and haven't had any problems with it at all. It measures about 12 inches deep (from front to back), nine inches wide (side to side) and 13 1/2 inches tall. I've had several family members use it and my parents and in-laws have found it fairly simple to use after I show them how to brew the coffee since we all have different models. Ever since I started drinking coffee, I've had better success with staying more alert and awake to take care of my twins and buying this Keurig has been well-worth every penny we spent on it! I have no regrets buying it and have been having a lot of fun finding different flavors to try. As with all of my reviews and especially any appliances and electronics reviews, I will periodically update this review, add in any new information I discover and adjust my thoughts and star rating, if needed. If you, or someone you know, is interested in a Keurig, I highly recommend this one. It's a great model that is nice on your wallet and will brew a great cup of coffee as often as you'd like!***Update 04/25/2017 - I've had this Keurig now for almost eight months and it's still working great for us! I typically brew four cups of coffee a day now to keep up with my kids and I've had no trouble with using this Keurig. When we have guests and are switching pods a lot, I never notice a strange taste at all (since we all like different flavors). I clean out the drip tray and wipe the whole machine down at least once a week to keep it looking nice. We only use bottled water in it so I've never had to use the filter. When we go away for a few days, I always wipe everything down and empty the water reservoir so it can air out and dry. I still highly recommend this Keurig if you want a good single-cup brewer that isn't incredibly expensive!",
                "reviewVotes": "1,798 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/710XWsoy-1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/713EnyZRKVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/719KyjC9LhL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71JHQxf4wAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71uOdUunzML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Careful 'n Selective",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG64QPK2SOOKNS7IXKMB7GJ6G7HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z4BJ6WKBET9Q?ASIN=B018UQ5AMS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2017",
                "reviewTitle": "5.0 out of 5 stars Well-Designed with Superior Performance -The Very Best Coffee Maker That We Have Owned In 40 Years",
                "reviewText": "The media could not be loaded. In the forty years of our marriage, we have owned several well-known brands of coffee makers. However, we feel that the Keurig K55 coffee maker has proved superior to any of our previous coffee brewers.Last year I invested in our first Keurig coffee maker, and I chose the K15 for individual servings. This worked out so well that a few months later, I bought another for my office and I loved my second Keurig as much as I loved the first one. Then last winter I decided to purchase another Keurig, only a different model that would accommodate several servings.I bought the K55 model because it has various featured options. This includes offering the choice for different hot beverages without the extra step to refill the tank each time with water, and this is due to the larger 48 oz. water reservoir. In addition, this enables us to make a variety of hot beverages in rapid succession, within a few seconds instead of waiting for all the water to reheat. Furthermore, the Keurig K55 offers a personal ‘custom tailored’ brew by letting us determine the strength of our coffee, and we have a choice of three. The smallest amount for a 6 oz. provides the strongest brew and the other two servings are an 8 and 10 oz.I like strong coffee, or sometimes I like to have flavored coffee, and my sister-in-law likes the same coffee that I do. My husband prefers a milder brew, and he never drinks flavored coffee. My son drinks tea, and likes to try different varieties and my grandson loves sampling different selections of hot chocolate.The Keurig K55 has a fast set-up, with easy to follow and systematic directions from the manual. It offers us a variety ways to make coffee, tea or just to heat water and all without any major modifications, because it just goes from one task to another.Below are some of the general features, and all are well designed and ‘user friendly’.CONTROL PANEL:All the controls are on the top right of the coffee maker and I like the flat slope surface that slightly slants down toward my eye level, and therefore, I don’t need to step on my tiptoes to read the buttons.On the panel, there are 5 press buttons and each one has an LED light to reduce ‘user error’.Power: Green LEDAuto Off: Green LED - (this is the automatic timer and when activated will automatically power off after 2 hours).3 Brew Size Servings – corresponding size to the serving size and each with a Blue LEDa. Cup Size - yields 6 oz. – which will provide the strongest brewb. Small Mug - produces 8 oz.c. Large Mug – dispenses 10 oz.Aside from the 5 press buttons to regulate the Keurig coffee maker, there are 3 other LED light indicators.1. Add Water – a Blue LED will light upIf there is not enough water, the coffee maker will not work, therefore I consider this indicator as a safety feature, as well as a resolution to a possible ‘user error’.2. Descale – will light up with a Red LED lightThis is another handy feature, to indicate necessary cleaning maintenance.3. Heating – while the water is heating, a red LED powers on, and then powers off when the water is hot and ready for a brew.WATER RESERVOIR:Included with the Keurig K55 is a Charcoal Water filter Cartridge Kit with 2 charcoal filters. This will eliminate the unwanted chemical taste that is in some water systems, and good tasting water is essential for a delicious cup of coffee. The recommended life span for each charcoal filter is approximately 2 months or 60 ‘full-tank’ refills. There are several selections for Replacement Charcoal Filter-Pods available on Amazon.com.The water reservoir attached to the left side is easy to remove with a slight lift up and outward motion. It fits inside a base and the tank is easy to remove and replace without any struggle. Alternatively, remove the reservoir tank cover, and pour water in from a bottle or a container.DRIP TRAY:This is much more than ‘just a drip tray’, under the cover is a 1” deep receptacle that will accommodate 8 oz. of a liquid spillover. Therefore, if the user makes an error and pushes the wrong brew amount for a smaller cup, this will save the kitchen counters and the floor from a major flood.In addition, this coffee maker will accommodate my 7 ¼” coffee thermos by sliding the drip tray out from bottom base, and I can have my thermos filled when placed on the bottom flat tray base.THE KEURIG K55 ACCOMMODATES REUSABLE COFFEE FILTERS:My favorite coffee is from fresh beans that I grind myself, and therefore it’s important to me that a coffee maker will accommodate a reusable filter. The K-Cup pod holder on the K55 is very easy to remove and it literally takes less than 10 seconds. Just tap the bottom of the pod holder with a finger and the K-Cup holder slides out with ease. The reusable K-cup filter then slides in place within the groove, and works with perfection for a delicious cup of fresh ground beans, or any ground coffee.The reusable coffer pod filter that I use is the Keurig My K-Cup Reusable Coffee Filter (Single) – and this is compatible with the Keurig K55 model.I purchased this from Amazon last spring, and in addition, I use this same filter with my Keurig K15. https://www.amazon.com/Keurig-5048-Reusable-Coffee-Filter/dp/B000DLB2FI/ref=sr_1_1?ie=UTF8&qid=1486296530&sr=8-1&keywords=Keurig+My+K-Cup+Reusable+Coffee+Filter+%28Single%29In conclusion, the Keurig K55 is a well thought-out designed coffee maker, with user-friendly features. This machine comes with a ‘Charcoal Water Filter Cartridge Kit and 2 charcoal pod filters, which guarantees excellent coffee, even though we have ‘hard water’ (which tastes awful) in our water system. In addition, I love that Keurig does NOT use a breakable glass carafe, which was the thing that broke most often with our previous coffee makers.",
                "reviewVotes": "916 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fdfc1864-42ba-4d29-8316-85f3fb6c8e36/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Charlie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2024",
                "reviewTitle": "Love this unit. Looks good in different colors and works really well.",
                "reviewText": "I had the same older model keurig for over 20 years and it started to have a pump noise which in my opinion is very good considering I use this thing twice a day for that long. The new unit looks good and I like the fact it fills the water as it pours in the cup to save time. Very hot also vs the old Keurig I had. I love it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ADRIAN DE JESUS ROFFIEL CALATAYUD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 1, 2022",
                "reviewTitle": "A precio de mercado",
                "reviewText": "Adecuada para preparar un buen e intenso \"café americano\" , no diseñada para \"café expreso\"",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R thomas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 13, 2018",
                "reviewTitle": "Five stars",
                "reviewText": "Tested out the coffee machine...works awesome",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josianne Belanger",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "Easy to set up and works wonderfully.",
                "reviewText": "Makes my life a lot easier. So glad to have one again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patricia Middaugh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 5, 2022",
                "reviewTitle": "Funciona fácil el color muy lindo",
                "reviewText": "Me encanta",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}