{
    "remaining_requests": 35819,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hario-Mizudashi-Coffee-1000ml-Black/dp/B001VPXEBU",
    "body": {
        "name": "Hario Mizudashi Cold Brew Coffee Pot Cold Brew Coffee Maker 1000mL, Black",
        "price": "$21.95",
        "originalPrice": "$24.50",
        "rawPrice": 21.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hario-Mizudashi-Coffee-1000ml-Black/dp/B001VPXEBU",
        "soldBy": {
            "sellerID": "A1QYIKZX69H4A7",
            "name": "Plus Star Japan Selection",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1QYIKZX69H4A7&asin=B001VPXEBU&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CRLS9CYH"
        ],
        "asinVariationValues": [
            {
                "asin": "B001VPXEBU",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31QR+kEvGUL._SS36_.jpg"
            },
            {
                "asin": "B00I7JKAQ0",
                "variationName": "Color",
                "variationValue": "Brown",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41-Z-bG+9EL._SS36_.jpg"
            },
            {
                "asin": "B00IJ3PAIM",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Mw1678ygL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "Only 10 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31QR kEvGUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31EJDU yi3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31IXjSnHpeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Qx2U9UdSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21PqqLNqpPL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Hario Store",
            "link": "https://www.amazon.com/stores/Hario/page/BB8ACFCF-67B8-4932-AC01-30172390D0D9?ref_=ast_bln"
        },
        "brand": "Hario",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 12620,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 35 mins",
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 7 hrs 35 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 7 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Mizudashi Coffee Maker: The simplest way to make and enjoy cold brew coffee at home. Simply add ground coffee to the fine mesh basket, add water and leave in refrigerator to brew. Clean up is easy with a removable filter -- simply wash and reuse",
            "Cold Brew at Home: Grind coffee coarse for a lighter more delicate coffee, or finer for a brew with more body and strength. Delicious homemade cold brew coffee, however you like it",
            "Daily Use: Featuring a slender spout for slow, steady and controlled pouring. Brew and serve directly from glass coffee server",
            "Japanese Design: Made with high-quality Hario heatproof glass. Made in Japan",
            "Product Details: 5-cup capacity, brewed volume 1000mL; W138×D94×H294mm"
        ],
        "description": "Hario does it again with their Cold Brew coffee maker. The simplicity is what makes this coffee brewer better than the next. All you have to do is place about 80g/2.8oz of your favorite coffee grinds and then top it off with water. Stir it for a bit until all the grounds have been soaked. Place it in your refrigerator overnight ( 8hours) and enjoy the full bodied, rich taste of cold brewed coffee. There's nothing like it.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Cold Brew Coffee Makers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17807784011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Hario"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "3.7\"D x 5.43\"W x 11.57\"H"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Cold Brew"
            },
            {
                "name": "Included Components",
                "value": "Coffee Pot"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Voltage",
                "value": "100 Volts"
            },
            {
                "name": "Model Name",
                "value": "\"Mizudashi\" Cold Brew Coffee Pot"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Unknown"
            },
            {
                "name": "Item Weight",
                "value": "11.2 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Hario"
            },
            {
                "name": "ASIN",
                "value": "B001VPXEBU"
            },
            {
                "name": "Item model number",
                "value": "\"Mizudashi\" Cold Brew Coffee Pot"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 12,620 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#44,561 in Home & Kitchen (See Top 100 in Home & Kitchen) #20 in Cold Brew Coffee Makers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 21, 2011"
            },
            {
                "name": "Capacity 34 Fluid Ounces",
                "value": "Material Glass"
            },
            {
                "name": "Item Weight 0.7 Pounds",
                "value": "Wattage 1000 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Coffee In the world of artisanal coffee, Hario is home to such iconic designs as the V60 Dripper, Buono Pour Over Kettle, Skerton Coffee Grinder, and Technica Coffee Syphon. Our history of developing innovative Coffee Products began in the 1940s, and now includes a broad portfolio of Drippers, Filters, Servers, Kettles, Grinders, Syphons, Scales, Presses, Cold Brew and Other items. Each of our products is designed and manufactured to our exacting standards, remaining true to our Japanese heritage and commitment to quality. Tea In Japanese, Hario means \"King of Glass\". Originally developed for use in the science laboratory, our heatproof borosilicate glass is manufactured in Japan and resistant to sudden temperature change and odor transfer, while also being safe for use in microwave ovens and dishwashers. Many of our tea items utilize our \"Hario Glass\" and spans Teapots, Drippers, Servers, Presses, Kettles and Other items. Tableware and Cookware From Rice Cookers to Drinking Glasses, Bakeware to Water Pots, our Tableware and Cookware category includes a wide variety of items in multiple sizes, shapes, colors and materials. Discover traditional Japanese items with a modern flair. Pets Admittedly geared towards smaller dog breeds and their feline counterparts, our pet items have won numerous design awards for innovation and quality. Many of our items are available in durable glass and porcelain, and also in multiple colors and shapes.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f2d80f01-1b14-4a04-80b2-496d9dfda134.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02510add-d78d-4f8d-b5ff-0edd7d5e9ebc.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fdea010f-38fa-44be-8c5c-b17aef0bce0f.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76672b94-dc4f-4a7f-9f05-c217297622ae.__CR0,0,300,300_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Since 1921 Hario was established in 1921 in Tokyo, Japan as a manufacturer of laboratory glassware. By the late 1940s, after many years of research, the company introduced its heatproof \"HARIO glass\", which allowed the company to introduce its first coffee product - the Hario coffee syphon. After years of expansion in a number of different categories, in 2005, Hario released its iconic V60 Dripper, which has since become the most widely used dripper for manual pour over coffee. Hario's current catalog now spans kitchenware, laboratory glassware, automotive headlights, aromatherapy, pets products and jewelry, with a particular focus on specialty coffee and tea accessories. In addition to its dedication to product quality, Hario has an unwavering commitment to social responsibility, operating its pollution-free glass factory which utilizes 100% natural ingredients.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5d34136-3471-409d-8cab-fc03f71a820d.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Dripper Server Kettle Scale Filter Kit Materials Glass, Metal, Ceramic, Plastic, and Copper Glass and Metal Copper, Enamel and Plastic Metal and Plastic Paper Plastic, Glass and Ceramic Sizes 01, 02 and 03 360, 450, 500, 600, 700, 800 and 1000 ml 700, 800, 1000 and 1200 ml - 01, 02 and 03 -",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/38db4a01-0e8a-4750-8c62-c5ad1a4e3b5c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f2d80f01-1b14-4a04-80b2-496d9dfda134.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02510add-d78d-4f8d-b5ff-0edd7d5e9ebc.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fdea010f-38fa-44be-8c5c-b17aef0bce0f.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76672b94-dc4f-4a7f-9f05-c217297622ae.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5d34136-3471-409d-8cab-fc03f71a820d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0962d09a-58e3-489e-a5e7-a640a6efbfd2.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a0dacf4-6fd8-4b5e-a073-d7ed89e2e341.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c74c1d0e-e039-4966-bf1b-5db1a76f0528.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/21d14fd9-110e-4fa2-b1e0-fc78dc833387.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/13f55d6b-b98d-4f26-9278-7b7931535ecb.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b3fbf72-082b-4a02-9d86-52a34be9d50b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e8ab75be-2f12-4aef-a79e-3d26f60291c1.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Colorgirl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMG3ALUBE3FEBHODTBHP5J24YDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQJW0RKDRDRZJ?ASIN=B001VPXEBU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 4, 2016",
                "reviewTitle": "5.0 out of 5 stars UPDATED -Love It So Much We Bought Two (Decaf and Regular)- and Replacement Mistake An Improvement!",
                "reviewText": "PLEASE UPDATED INFORMATION AT END OF REVIEW (CHANGED RATING EXPLAINED)---------------(Original review)I was not sure what to expect when I got this coffee pot. I have the similar pot for cold brew for tea FORLIFE Mist Glass Ice Tea Jug , 50-Ounce, Turquoise so I thought that this would be a great addition to our kitchen. I am absolutely in love with the cold brew tea pot and use it constantly. I am still not sure I am as fond of this coffee pot as I thought I would be, however.WHAT IS THIS POT LIKE?In contrast to the Mist Tea Jug, this pot has a silicone type filter in it which is more like synthetic cheese cloth. The filter is reinforced with hard plastic and the rim sits in the rim of a very tall and narrow glass pot. This pot can be used hot or cold, but not on direct heat to my understanding. The lid snaps on, but is not air tight. The handle is at the top making it easy to pour. I have the red option.When storing on the door of the refrigerator, I am a bit nervous about the height of this pot. It seems almost a bit unstable due to the narrow bottom vs the long height that it has. It does not tip over easily, but if someone were to suddenly jerk the door of the refrigerator open, I am not so sure that this pot will not tip off the shelf.HOW TO USE THIS POTThe directions are in Japanese with illustrations, but even when translated, I do not like the coffee made in this pot using the instructions enclosed which require 80g of coffee and a very long brewing time of up to 24 hours.I prefer to use medium coarse ground coffee filled HALFWAY up the see through area. That translates to approximately 6 Tablespoons of ground coffee. Then I gradually pour filtered water over top which is room temperature. I leave this to sit in the kitchen at room temperature, not the refrigerator. If I want to drink it sooner, then I will grind it finer- right between medium and fine. If I am going to leave it in longer, then I will grind it the medium coarse setting. It is important to stir the grounds a few times to get them brewing well. If they are not stirred up, they will clump at the top like a big plug and not do much of anything.If we want to drink it sooner with the medium fine grind, we will drink this from after 15 minutes to a half hour of making it. We warm it up on the stove since it is still winter weather, and then either make bullet proof coffee out of it, or traditional coffee with sweetener (we use honey) and cream. We will often add just a little bit of boiling water just to make it the right concentration.We will leave it in the brewer about 4 hours tops- not longer than that. I find that the caffeine content is too high for me and I don't like it. My husband does not like the taste of it after 4 hours either and loves it when I stop brewing at 4 hours, although he does like it after 15 minutes or so too. (If he has a cup, I just add more water to the filter to brew the four hours after that and it is still fine)HOW DOES THIS COFFEE POT PERFORM?I do not like coffee made in this the traditional way. Perhaps this summer when my husband and son enjoy iced coffee this will get more use. I bought it primarily for that reason. However, I was interested in trying the cold brewed coffee for the more alkaline behavior in the body. IT is very smooth and great tasting if I use the brewing method I listed above. When using the instructions as laid out the caffeine content ruins the coffee for me. I just don't like it. Even diluted way down I am not fond of it.HOW EASY IS THIS TO CLEAN?If you clean this right away, it is easy to clean. Immediately when I am done brewing, I remove the filter with the coffee grounds and the bottom screws off. I quickly knock the grounds into the compost and then clean the filter with a gentle brush brush using GENTLE motions. Too hard and rough will ruin this filter. I only keep the coffee in the pot in the refrigerator for two days as it is not air tight so it will get stale quickly with that refrigerator taste.THE BOTTOM LINEThis coffee pot makes one of the most smooth and not bitter coffees that I have ever had. I like it even more than french press coffee, although I did find that the french press cold brewed coffee seemed to taste a bit better than this pot, perhaps I need to compare again side by side. Warmed up, it is wonderful tasting for regular coffee drinking or even bullet proof coffee. Although it does not make much coffee, and has to be made every couple of days, it is one way to have coffee that is smooth and not bitter without babysitting it to a degree.I am still not in love with this coffee pot. It is good and I will use it, especially in the summer when the guys love their iced coffee, but for me, it just isn't that WOW. Perhaps as I continue to work with it, I will change my feelings about it, but after a week of constant use and experimentation, I am still on the fence about my feelings for it. I like it- sort of. And the coffee is really good. But is it worth it? I am just not sure yet.I am rating this four stars, but will update with more information as I continue to experiment with this and find our favorite way to use it.----------------------UPDATE (4-2016)The above is my original review, but I have changed my review to five stars. I have learned that for our needs, using fine/med grind works perfectly. I only leave the grounds in the pot for 4 hours max and then take them out and store the pot in the refrigerator. We warm the coffee up on the stove, or if preferred, drink it on ice. If using about 33% water added to it, it is perfect.My problem was that I was trying to use this heated up for bulletproof coffee a lot and I really am not that fond of it in that application. This seems to taste better with sweetener and a touch of cream if desired in it. I really like it better that way.For heat brewed coffee, I prefer bulletproof preparation. With cold processed, I prefer cream and sweetener instead. The finer grind leaves a tiny bit of sludge in the bottom of the pitcher but it is not that much and the coffee is smooth and clean. Coarser grind does not release enough flavor for us and left about the same amount of sludge.UPDATE- REPLACEMENT FILTERI wanted to get a backup filter for this coffee maker. I found the page for it, and it was brown just like this one was. When I sent for it, I was surprised to see that the bottom had a screen in it instead of the solid bottom. It still twisted off. The coffee brewer works so much better with it than the original. It has a tiny bit more sediment but works much faster. I love it.They have since changed it to the green tea strainer part so apparently something was amiss when I ordered it. I still am glad, however, as I do prefer the screen bottom over the solidHere is a link to the replacement part in case you want to try it too: Strainer of HCC-12DG",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ben St. Thomas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF5VMXOYMOZVG6HHOXYMPZ5OYEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12K8CS7UQYN8X?ASIN=B001VPXEBU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2018",
                "reviewTitle": "5.0 out of 5 stars Easy, good, low acid coffee. What's not to like?",
                "reviewText": "Over the last three years, I have been experimenting with all sorts of different coffee brewing methods in an attempt to find one that met the list of things I wanted from a coffee maker.1: It has to be easy. I do not mind grinding my beans as I can see a definite improvement in the quality of the finished product with that, but I have also tried:Pour overs. Too finicky about the pour time and such.Aeropress. Killer coffee. Too much rather precise timing and such for early morning pre-coffee brain.Two different high-end small size brewers. Could not get a decent cup of coffee out of either of them. Sour or bitter.A semi-automatic Espresso machine. Again, too much work for a cup of joe.2: The resulting coffee has to be adaptable. Somedays I want a strong short hot cup. Other days a milder glass of iced coffee. And sometimes I like to make a quasi Vietnamese style super sweet with Hazelnut syrup over ice.3: I would prefer it not be acidic.So of course, A cold brew rig is the way to go. I started with a Toddy. Works well, but the part where you sit a half gallon of coffee and grounds balanced over a juice carafe for an hour to let it drip through the small fiber puck filter...ehh. I kept having nightmares of that crap all over my kitchen. Yeah, I can set it in the sink, but my sink is not flat bottomed, so the wobbly factor was raised. Plus those filters are a dog to get rinsed out. Noticed the flow was significantly diminished after the third batch even with soaking the filter in multiple changes of water after use.Then I thought I was overthinking it. So I went with 50 grams of fine grind in a quart mason jar of water in the fridge overnight. Filtered it through a Melitta #4 in one of the pour over gadgets. That worked, but again a bit too fiddly. Plus I got the feeling I was filtering out some of the wanted coffee flavors.Along came this lil number. I have a few Hario kitchen gadgets already, so I was familiar with the brand and their quality. The 80 grams of ground coffee for a liter of returned concentrate seemed high at first. But man with a 24-hour brew in the fridge, this concentrate is strong. Like I tried drinking an espresso cup of it with a teaspoon of sugar straight, and after a while, I felt I could see through time. 1 to 1 water to concentrate is plenty strong for most folks iced coffee. Maybe a bit stronger for a drink with creamer and sugars. My go-to summertime drink is.Make the Mizudashi with 80 grams of semi-fine grind medium roast. (I have a Capresso Infinity grinder, and I set it on the 2nd tick mark from the right in the FINE section) 1150 ml of bottled water (my tap water is hella hard) and a 24 hour brew time in the fridge. Pull the filter basket, and I pour the concentrate into a 32 oz. Nalgene bottle. In a second Nalgene bottle, I mix: 1 15oz can of full fat Coconut milk, 8 oz. of simple syrup and 8 oz of bottled water. Shake the devil out of it to blend, and it goes into the fridge too. When I want a drink, I pour into a 20 oz glass: Half cup of concentrate, half cup of the Milk mix (Shaking well before), half cup of water and fill the glass with ice. Stir or shake in a cocktail mixer. Is it super strong? No. Is it super sweet? No. Does it cost $8 like from Starbuckers? Nope.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 26, 2023",
                "reviewTitle": "Uno de los mejores",
                "reviewText": "La calidad del recipientes es excepcional como lo esperarias de la marca, asi como de la malla de filtrado para el cafe, donode podrias unsar un molido aun mas fino que el necesario para el coldbrew, aun asi recoiendo usar las instrucciones para tener un mejor resultado, si no te quedan claras las instrucciones de uso existen diversos tutoriales en youtube, lo unico que no me gusto es que al sacar el filtro no queda totalmente sellado el interior pero es lo de menos no me dura tanto tiempo para terminarme la jarra.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Javier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 14, 2023",
                "reviewTitle": "Indispensable para hacer cold brew",
                "reviewText": "Muy útil y fácil de limpiar.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 30, 2023",
                "reviewTitle": "Ideale per caffè freddo",
                "reviewText": "Perfetta per la realizzazione del caffè freddo. Ottimo per la preparazione di diverse porzioni che si possono facilmente conservare in frigo.La qualità del prodotto è buona",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gianluca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 15, 2023",
                "reviewTitle": "Ottimo rapporto qualità e prezzo",
                "reviewText": "Minimale ma fa il suo lavoro. Purtroppo le istruzioni sono solo in giapponese...ma non è troppo complicato da usare :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jag",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 1, 2023",
                "reviewTitle": "Café muy rico…",
                "reviewText": "… evidentemente, depende de la calidad del café.La compré para reemplazar una igual que se rompió. Ahora tengo un filtro y tapa de repuesto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$23.85",
                "sellerName": "Press 18",
                "sellerRating": "5"
            },
            {
                "price": "$23.95",
                "sellerName": "Thunder Japan",
                "sellerRating": "5"
            },
            {
                "price": "$24.50",
                "sellerName": "Ignite Ideas",
                "sellerRating": "5"
            }
        ]
    }
}