{
    "remaining_requests": 35925,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Keurig-K-Elite-Temperature-Capability-Programmable/dp/B078NN17K3",
    "body": {
        "name": "Keurig K-Elite Single-Serve K-Cup Pod Coffee Maker, Brushed Slate, 12 oz. Brew Size",
        "price": "$149.00",
        "originalPrice": "$189.99",
        "rawPrice": 149.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Keurig-K-Elite-Temperature-Capability-Programmable/dp/B078NN17K3",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CKGK6BYM"
        ],
        "asinVariationValues": [
            {
                "asin": "B07N3GRVGS",
                "variationName": "Color",
                "variationValue": "Brushed Gold",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41JD5tyPO+L._SS36_.jpg"
            },
            {
                "asin": "B0788F3R8X",
                "variationName": "Color",
                "variationValue": "Brushed Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/4157vmLzOLL._SS36_.jpg"
            },
            {
                "asin": "B078NN17K3",
                "variationName": "Color",
                "variationValue": "Brushed Slate",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41P-VNraYdL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41P-VNraYdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41fz7jnNQ4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gC2XBvoDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lGC0CPPHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/716nq9xBcwL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Keurig Store",
            "link": "https://www.amazon.com/stores/Keurig/page/0B04B9D1-B1B3-445A-9B1D-E274FEEC9CD9?ref_=ast_bln"
        },
        "brand": "Keurig",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 56970,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "WHAT'S IN THE BOX: One water filter handle, and one filter to help ensure your beverages taste their absolute best.Filter type:Reusable.Temperature: Adjust the brew temperature between 187° and 192°..Temperature Control : Allows you to adjust the temperature from 187° – 192",
            "BREWS MULTIPLE CUP SIZES: 4, 6, 8, 10, 12oz Enjoy the most popular cup sizes.",
            "STRONG BREW BUTTON: Increases the strength and bold taste of your coffee’s flavor.",
            "ICED SETTING: Brew hot over ice at the touch of a button for full-flavored, delicious iced coffee.",
            "HOT WATER ON DEMAND BUTTON: Perfect for instant soups or oatmeal.",
            "FAST & FRESH BREWED: Coffee made in minutes.",
            "LARGE 75oz WATER RESERVOIR: Allows you to brew 8 cups before having to refill, saving you time and simplifying your morning routine. Removable reservoir makes refilling easy.",
            "REMOVABLE DRIP TRAY: Accommodates travel mugs up to 7.2 inches tall and holds a full accidental brew for easy cleanup.",
            "BREWER MAINTENANCE REMINDER: Alerts you when it is time to descale your coffee maker. Descaling is an important process that removes built-up calcium deposits, ensuring the best-tasting brew possible."
        ],
        "description": "The Keurig K-Elite single serve brewer blends a premium Brushed Slate finish and programmable features to deliver both modern design and the ultimate in beverage customization. With a striking brushed finish and metal details, it’s a stylish addition to any kitchen. The Keurig K-Elite single serve coffee maker features Strong Brew for when you want to brew a bolder cup of coffee, and an Iced button to brew hot over ice for a refreshing, full-flavored iced coffee. It features five brew sizes, so you can brew your favorite coffee, tea, hot cocoa, or iced beverage at the touch of a button. Choose from hundreds of delicious varieties of K-Cup pods, or brew your own ground coffee using the Universal My K-Cup Reusable Coffee Filter (sold separately). The K-Elite brewer offers programmable features like auto on and temperature control, as well as providing hot water on demand for instant soups and oatmeal, and the large 75oz removable water reservoir lets you brew 8 cups between refills.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b?ie=UTF8&node=7740213011"
            },
            {
                "name": "Single-Serve Brewers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=2474054011"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "4.7 Pounds"
            },
            {
                "name": "Special Feature",
                "value": "Removable Tank, Programmable, Water Filter"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Espresso"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Wattage",
                "value": "1500 watts"
            },
            {
                "name": "Voltage",
                "value": "100120 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Product Dimensions",
                "value": "9.9\"D x 13.1\"W x 12.7\"H"
            },
            {
                "name": "Item Weight",
                "value": "6.6 Pounds"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 56,970 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#571 in Home & Kitchen (See Top 100 in Home & Kitchen) #4 in Single-Serve Brewers"
            },
            {
                "name": "Brand",
                "value": "Keurig"
            },
            {
                "name": "Included Components",
                "value": "1 K-Elite Single-Serve Brewer, 1 water filter handle and 1 filter"
            },
            {
                "name": "Model Name",
                "value": "K-Elite Coffee Maker"
            },
            {
                "name": "Model Number",
                "value": "K-Elite"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Color",
                "value": "Brushed Slate"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Capacity 4.7 Pounds",
                "value": "Material Plastic"
            },
            {
                "name": "Item Weight 6.6 Pounds",
                "value": "Wattage 1500 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Keurig K-Elite Single Serve K-Cup Pod Coffee Maker Product Details The Keurig K-Elite brewer blends a premium finish and programmable features to deliver both modern design and the ultimate in beverage customization. With a striking brushed finish and metal details, it’s a stylish addition to any kitchen. The Keurig K-Elite coffee maker features Strong Brew for when you want to brew a bolder cup of coffee, and an Iced button to brew hot over ice for a refreshing, full-flavored iced coffee. It features five brew sizes, so you can brew 4, 6, 8, 10, or 12oz of your favorite coffee, tea, hot cocoa, or iced beverage at the touch of a button. Choose from hundreds of delicious varieties of K-Cup pods, or brew your own ground coffee using the Universal My K-Cup Reusable Coffee Filter (sold separately). In addition to a host of programmable features like auto on and temperature control, the Keurig K-Elite coffee maker provides hot water on demand for instant soups and oatmeal, and the large 75oz removable water reservoir lets you brew 8 cups between refills. Key Features: Alerts you when it is time to descale your coffee maker. Descaling is an important process that removes built-up calcium deposits, ensuring the best-tasting brew possible. Just insert a pod, select your desired cup size, and brew your perfect cup in under a minute. Compatible with the My K-Cup Universal Reusable Coffee Filter, allowing you to brew with your own ground coffee. More Features Perfect for instant soups or oatmeal Increases the strength and bold taste of your coffee’s flavor Brew hot over ice at the touch of a button for full-flavored delicious iced coffee Brews K-Cup pods in under a minute Minimizes noise when the coffee maker is in use",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/16633503-ef55-4a43-8c8e-9f9c42c00885.__CR0,6,411,411_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0611bbc1-9551-410b-a4e6-b5e3a1d32277.__CR30,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/16633503-ef55-4a43-8c8e-9f9c42c00885.__CR0,6,411,411_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/239bdab2-97e4-4b37-869b-503f24b069d5.__CR46,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76627225-c0f4-4cfa-8e54-af96ca621fb4.__CR0,74,1464,453_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Michelle Rosello",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLGK33PIXZMVW4WI3JT7BK6I2UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U8N67CBTM2ZX?ASIN=B078NN17K3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Best quick coffee maker on the market",
                "reviewText": "I've always had great success owning a Kurig. When this one came on sale, I had to get it and update my 12 yo Kurig. The brushed steel is well designed and the functions are easy to read with so many options. I love a large cup of coffee and this kurig offers up to 12 oz. Nice selection. It's quick to heat and brew while being very quiet. I look forward to using the iced coffee feature on this. I highly recommend this Kurig for anyone looking for exceptional value, long standing reputation and delivers quick for those of us on the go or really needing that cup of coffee, tea, etc.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergej M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF337A4LOE6XZ4R2ZEIN3HCQQ6YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WFBWADP2DVVQ?ASIN=B078NN17K3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars OK Product not the best",
                "reviewText": "The Keurig K-Elite Single-Serve K-Cup Pod Coffee Maker is an impressive coffee machine with a multitude of features. It offers extensive customization options, allowing you to control brew strength and water temperature. It includes convenient extras like high altitude and iced coffee settings, a large water reservoir, and a hot water dispenser. While it doesn't come in various colors, its classic design and compact footprint make it a practical choice. The Keurig K-Elite offers programmable features, multiple brew sizes, a hot water dispenser, a large removable water reservoir, and compatibility with all K-Cups and reusable filters. Its classic appearance, available in brushed silver, brushed gold, or brushed slate, adds to its appeal. However, it's worth noting that it's a larger model and lacks a self-cleaning feature. Overall, it's a top-tier single-serve coffee maker for those who value customization and convenience.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marsha DeVaughn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEU7JGM2R3IDQ7X4UKN4BOI3J22Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EB29PJIB8PVA?ASIN=B078NN17K3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "5.0 out of 5 stars My first Keurig!",
                "reviewText": "I bought this during the Prime members specials. Got an excellent price when compared to other sellers. It’s easy to assemble, very well packaged. However, i did not receive a full instructions manual. For a first timer just a little quick start guide wasnt enough so i resorted to YouTube. It works well. I didn’t expect the short lived heating up noise but not bad and only lasts about a minute. Very nice looking design. I like the fact it looks the same on both sides front front view instead of showing the water tank from front. That was one of my deciding factors to go with this one. Easy operation, multiple cup sizes, hot water dispenser alone i really like because i don’t like my coffee really strong, so if too strong i just add more hot water. Came with filter attachment but quick start doesn’t tell you how to install if you’ve never had one. You Tube does. I have only had a few days. If necessary i can leave an updated review later. I think my biggest challenge will be finding the coffee i really like. Starbucks is too bitter for me. A friend uses Green Mountain and likes it so it’s my next try. I do wish they would come out with a way to make these kcups easier to recycle. You have to rip off the top and empty the coffee grounds and rinse. When in a hurry this is a little too time consuming but i feel it’s important with so many using these machines. Our landfills and waterways need help already.",
                "reviewVotes": "41 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark D. Schnittman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCU2VIV447XUPWPFKA4P4P6XIRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKMWVK72L35YU?ASIN=B078NN17K3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Less noise, much better coffee",
                "reviewText": "This is the 2nd Keurig machine that I have owned, the previous being a K145 OfficePro that I had for almost 10 years. I bought the new machine because the K145s cup size selector switch started to malfunction, probably from the contacts getting worn out from use. Being an engineer, I know that this only happened because of inferior design and/or parts quality. Neverthless, I was able to grab this unit on sale for labor day. I'm not sure if I would have paid full price for it, but it seems to be worth what I paid. I have made several observations after using this machine for over a month, hopefully to help the rest of you make an informed buying decision.Pros:- Makes better coffee than my K145. I would imagine this is due to Keurig changing the time and/or water delivery speed of the brewing process. Using good-quality K-Cups, it makes coffee on par with using a good-quality drip machine (like my Ninja). The coffee is notiably richer and more full-bodied compared with the K145 using the same K-Cups. This was a surprize to me, as I expected just a more expensive version of the old machine. Being that I love good coffee, this alone would have justified the purchased in my book.- The pump makes half of the noise that the K145 did. This is also a plus because I get up early for work and don't want to disturb the rest of the family. The brew time is about the same.- The machine now allows 2 extra cup size selections -- 14oz and 4oz, 1 larger and 1 smaller (by 2 oz) than on the K145.- The machine will dispense hot water to make tea or hot chocolate. I can't comment on this feature yet, as I have yet to use it.- The water tank is 20%-30% larger than on the K154, leading to more time between refills.- This machine is compatible with non-Keurig K-Cups, as there is no barcode reader in the machine. Don't get me started.Cons:- The water tank was a product of the 'function follows form' perspective of some marketing idiot. The tank doesn't have any convenient surfaces to grip it in one hand, and due to it's compound curves is difficult to reinsert into the machine correctly. It's a 2-handed operation, due to their wanting to hide the water tank and make it look like the other half of the machine from an industrial design perspective. Mildly annoying.- The water tank doesn't have a window on the front to check the water level. Another brilliant design choice. Now I have to peek around the side to determine how much water is left.- The menu system of the digital pad is mildly confusing, and takes a little getting used to. It's not terrible, but it could be more user friendly. Playing with the settings using trial and error is more useful than trying to read the manual, which was probably written by the same person who designed the water tank.All-in-all, the better quality of the coffee, the larger water tank, and the quieter operation justifies the upgrade. Reccommended, with a few reservations.",
                "reviewVotes": "169 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Virginia W.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 14, 2024",
                "reviewTitle": "OMG!",
                "reviewText": "We needed a new Keurig and this one does not disappoint! We have been using Keurig machines for years now but the last 2 we bought were not as good as any previous ones and were highly disappointing. This one was our last chance for Keurig and man are we happy we gave it one last shot! This machine is wonderful! The different cup sizes are great as are the strong and hot water options. I have yet to try the ice coffee setting but I’m excited to do so. I would definitely recommend this model!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 29, 2023",
                "reviewTitle": "Best of the bunch",
                "reviewText": "Researched the heck out of single serve coffee machines. Bought a Nespresso (kept it-but its only good for espresso and crema type coffees and not as hot as I'd like), then a premier Cuisinart from Williams Sonoma (approx $250 ), sent it back as it was crap, kept dis-functioning, coffee was not hot enough, weak and bland. Then went for this Keurig- and what a great surprise. The hottest coffee of them all (temp options), flavor is perfect, well made, easy to use. I will say that if you read their company write up- its 100% accurate. It does everything they say.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Agustín a.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 17, 2023",
                "reviewTitle": "Execelnte cafetera muy facil de usar",
                "reviewText": "Muy facil de usar, super contento",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carolina Prieto MartinezCarolina Prieto Martinez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 1, 2022",
                "reviewTitle": "Me encanta 😍",
                "reviewText": "Me gusta que tenga para varios tamaños de taza, así como intensificar el café, fácil de instalar y de utilizar",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71MskA3HnVL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diane",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 29, 2024",
                "reviewTitle": "Great coffee maker",
                "reviewText": "What do I really like? I can brew a stronger cup of coffee. I can choose different cup sizes. It heats up quickly. There is an option for ice coffee. The grandkids can make their own hot chocolate from pods or with hot water.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}