{
    "remaining_requests": 35924,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Caf%C3%A9-Specialty-Technology-Essientials-Barista-Quality/dp/B09648KFJ4",
    "body": {
        "name": "Café Specialty Drip Coffee Maker | 10-Cup Insulated Thermal Carafe | WiFi Enabled Voice-to-Brew Technology | Smart Home Kitchen Essentials | SCA Certified, Barista-Quality Brew | Matte Black",
        "price": "$172.78",
        "originalPrice": "$299.00",
        "rawPrice": 172.78,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Caf%C3%A9-Specialty-Technology-Essientials-Barista-Quality/dp/B09648KFJ4",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09H7ZZC1Y"
        ],
        "asinVariationValues": [
            {
                "asin": "B09648KFJ4",
                "variationName": "Color",
                "variationValue": "Matte Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21Pkx-1mv7L._SS36_.jpg"
            },
            {
                "asin": "B0964BVHQH",
                "variationName": "Color",
                "variationValue": "Matte White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31o14Axk-jL._SS36_.jpg"
            },
            {
                "asin": "B0964C3BT4",
                "variationName": "Color",
                "variationValue": "Stainless Steel",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31cns+u3wyL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31yry54bW3L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41-ej1uMFcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41dM2nYt70L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zeBWXvoIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418QyD3Yb9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31RWmR0th2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517Qu5LOPeL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Café Store",
            "link": "https://www.amazon.com/stores/Caf%C3%A9/page/A9FB1340-4485-4AB4-913B-5F486EF5AE7B?ref_=ast_bln"
        },
        "brand": "Café",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 1255,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 8 hrs 56 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SCA CERTIFIED - Experience a barista-quality cup of coffee right from your own counter with this stylish, SCA Certified coffee maker that has been rigorously tested to ensure your coffee is consistently delicious.",
            "WIFI ENABLED - Adorn your kitchen with this beautifully designed smart coffee maker that can be controlled with the SmartHQ app, Alexa, and Google Home. Voice-to-Brew controls deliver a conveniently connected perfect cup, every time.",
            "10 CUP BREW - Whether your brewing 1 cup or a whole pot, you can customize every cup to your personal taste with this advanced, 10-cup coffee maker that stores your favorite settings for number of cups, temperature and brew strength.",
            "CUSTOM BREW STRENGTH - Enjoy the perfect, balanced cup of coffee exactly the way you like it courtesy of four unique brewing modes: Gold, Light, Medium & Bold.",
            "AUTO BREW - Mornings just got easier. When you use the auto brew feature, you can wake up to fresh, hot, perfectly personalized coffee that is ready just when you programmed it to be.",
            "Easy-to-use filtration unit that fits inside the water reservoir of your coffee maker. Helps remove chlorine and other impurities from your water. GE Appliances Replacement Carbon Coffee Filter Cartridges, 6-pack, UNIV1CFLTR6PK, sold separately",
            "Too coarse a grind, too little coffee, or insufficiently tamping the grounds before brewing can all lead to inadequate pressure for a proper brew. It is important to note that the amount of espresso extracted will vary depending on the grind size and amount and reprogramming may be needed when the size and amount are adjusted."
        ],
        "description": "Start the day with coffee brewed to Golden Cup perfection, the world's highest standard certified by the Specialty Coffee Association. Equipped for Wi-Fi connection, this drip coffee maker from Café can be paired with your smartphone using the SmartHQ app. This allows you to control the strength, size and temperature of your brew from anywhere, and to schedule up to 10 cups of brew in advance. Select from four unique brewing modes: Gold, Light, Medium, and Bold. Brew to your favorite temperature every time thanks to a precision coffee maker that creates drip coffee from 185 to 205 degrees. Distinguished by sleek designer finishes, the Café Appliances define bold contemporary style in the kitchen. Countertop appliances that pair style with substance. Enjoy the design, style, and quality of a Café appliance on your countertop. Café's line of small appliances come in several beautiful finish options, each featuring the signature copper accent. The Expressions Collection is a line of countertop appliance from Café that beautifully match the design of your Café kitchen and have the innovative features you want.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "2.8 Pounds"
            },
            {
                "name": "Special Feature",
                "value": "Removable Tank,Water Filter,Thermal,App-Controlled,Cup Warmer,Timer"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coffee maker"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Product Dimensions",
                "value": "7.3\"D x 12.5\"W x 14\"H"
            },
            {
                "name": "Item Weight",
                "value": "10 Pounds"
            },
            {
                "name": "Material",
                "value": "Copper"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 1,255 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,009 in Home & Kitchen (See Top 100 in Home & Kitchen) #38 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "Café"
            },
            {
                "name": "Included Components",
                "value": "Coffee Maker, Filter Basket, Water Filter, Coffee Scoop, Insulated Thermal Carafe"
            },
            {
                "name": "Model Name",
                "value": "Café Specialty Drip Coffee Maker with Insulated Thermal Carafe"
            },
            {
                "name": "Model Number",
                "value": "C7CDAAS3PD3"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Color",
                "value": "Matte Black"
            },
            {
                "name": "Style",
                "value": "Thermal Carafe"
            },
            {
                "name": "Capacity 2.8 Pounds",
                "value": "Material Copper"
            },
            {
                "name": "Item Weight 10 Pounds",
                "value": "Voltage 120 Volts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Expressions Collection Café's line of small appliances come in several beautiful finish options, each featuring the signature copper accent. The Expressions Collection is a line of countertop appliances from Café that beautifully match the design of your Café kitchen and have the innovative features you want. Café Specialty Drip Coffee Maker with Thermal Carafe Matte Black Start the day with coffee brewed to Golden Cup perfection – the world's highest standard certified by the Specialty Coffee Association. Equipped for Wi-Fi connection, this drip coffee maker from Café can be paired with your smartphone using the SmartHQ app allowing you to control the strength, size and temperature of your brew from anywhere, and to schedule up to 10 cups of brew in advance.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d065fc56-a55d-4ff8-99d8-dfb625f7c339.__CR0,0,600,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6d064d0-1825-475d-82aa-b845d19c9dae.__CR120,0,360,180_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "SCA Certified Experience a barista-quality cup of coffee right from your own counter with this stylish, SCA Certified coffee maker that has been rigorously tested to ensure your coffee is consistently delicious WiFi Enabled Adorn your kitchen with this beautifully designed smart coffee maker that can be controlled with the SmartHQ app, Alexa, and Google Home. Voice-to-Brew controls deliver a conveniently connected perfect cup, every time 10 Cup Brew Whether your brewing 1 cup or a whole pot, you can customize every cup to your personal taste with this advanced, 10-cup coffee maker that stores your favorite settings for number of cups, temperature and brew strength",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bc6a0f1f-317b-4f6d-ac5c-6e3c939eef85.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34f1c12a-c2bf-40af-ad41-82df8f0a3294.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6ebe3b33-7f8b-45a1-ad09-1324924ec8a5.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Custom Brew Strength Adjust brew strength to exactly the way you like it, courtesy of four unique brewing modes. This Gold Cup standard is backed by an SCA Certification that ensures you have the ideal pour every time Auto Brew Mornings just got easier! When you use the auto brew feature, you can wake up to fresh, hot, perfectly personalized coffee that’s ready just when you programmed it to be Precision Brew Experience exact temperature control with this precision brew coffee maker that brews drip coffee from 185 to 205 degrees and meets the rigorous standards of the Specialty Coffee Association",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bb012343-fe63-486b-90ee-f35c1e0e7e6a.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c306271a-a0cd-430d-8e31-91f4dadb679a.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2ae8065-d7e1-4b25-9629-a8ce436457cb.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e94cfb90-6386-4a13-881b-9951c7591b6b.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d065fc56-a55d-4ff8-99d8-dfb625f7c339.__CR0,0,600,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6d064d0-1825-475d-82aa-b845d19c9dae.__CR120,0,360,180_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bb0fc645-d2a4-4a19-8ebf-f254e16b88cd.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bc6a0f1f-317b-4f6d-ac5c-6e3c939eef85.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34f1c12a-c2bf-40af-ad41-82df8f0a3294.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6ebe3b33-7f8b-45a1-ad09-1324924ec8a5.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bb012343-fe63-486b-90ee-f35c1e0e7e6a.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c306271a-a0cd-430d-8e31-91f4dadb679a.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2ae8065-d7e1-4b25-9629-a8ce436457cb.__CR0,0,600,600_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "em33em33",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQHCHN67D42DCNC4SVH4Q7TI47A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WNN9I8PSI0E?ASIN=B09648KFJ4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 10, 2022",
                "reviewTitle": "5.0 out of 5 stars More then the Bells and Whistles, It Makes Great Coffee!",
                "reviewText": "So after reading some reviews here I was hesitant to buy this machine due to some reviews saying how messy it was. We'll let's just get this out of the way. I have yet to see a mess from this machine and have posted photos showing how good the coffee bed actually looks. In the photo, that is 69g of fresh roasted beans ground right before brewing using a Fellow Ode grinder. Not even close to a mess!Now getting into the actual review. My have to haves for this machine were a timer for auto brewing for the weekdays, SCA approved and a thermal carafe. I have owned other SCA approved machines in the past like the Breville Precision Brewer, the Bonivita 8 cup and the latest was an SCA approved Ninja Machine. If the Ratio 6 had a timer that would have been in the running this time around. Unfortunately it does not and this machine checked all my boxes so I decided to give a it a try and so glad I did!Without touching on all it's options yet, the one thing the machine needed to do in order to make it a keeper was make a great cup of coffee! If it couldn't do that, then it wouldn't matter how high tech this thing was and all the fancy stuff it could do, it was going back. Well I am happy to say, this machine makes one delicious cup of coffee! My first reaction to my first brewed sip was WOW, this cup is smooth! It was super smooth, sweet and delicious! An 8 cup pot finished brewing in just about 5 minutes which is pretty fast.The thermal carafe definitely kept the coffee hot for an hour after brewing and was even drinkable 2 hours later. Some reviews mentioned they were upset there was no hot plate. No thermal carafe machine comes with a hot plate! That is the reason for going with the thermal carafe. So your coffee doesn't cook and continue to change in flavor. If you want a hot plate, you need to buy the glass carafe. That goes for any coffee machine. If you want your coffee to stay the hottest in the thermal carafe, run hot water in the carafe so when you brew your coffee, you won't be brewing into a cold carafe which will cool the coffee down quicker. Also, the more coffee left in the carafe the longer it will stay hotter for. If you only have one cup left in the carafe, it will cool down quicker then if you have say 4 cups sitting in there.The machine allows you to choose the gold standard setting which sets everything to the SCA approved cup of coffee and no settings can be changed when set to this but for those who like to tinker, the machine also allows you to set the exact temperature of the water from 185° to 205°. You can also change the brew strength between 3 settings, light, medium and bold. I am not sure what this setting actually adjusts as it's separate from the temperature setting. I haven't brewed on anything besides the gold setting so far but I am definitely going to test the other stuff out but the Gold Setting brews a great cup.The wifi option is such a bonus on this thing! It makes setting everything up super easy. Being able to set a schedule for weekdays means I don't need to program the machine every night. If something changes, can just go into the app and change what I need. Have grinds and water in the machine but don't want to brew yet, can just start the brew from my phone when I am ready. It's great. Also hooked up to Google Home with no problem. Like I said though, if the machine didn't brew a great cup of coffee none of this other stuff would have mattered!Bottom line, yes the machine is expensive but if you are reading this review around the time it's posted, it's $100 off right now putting it much closer in price and even better then some of it's competitors! And it make a great cup of Joe!*8 Month Update - Machine is still working great! Have not had any issues and still producing a great cup of coffee. I basically have kept it on the Gold setting and found there is really no need to play with the temp and strength as the Gold Cup produces a great cup. I have been using an 18:1 coffee to water ratio based on the ounces listed on the water reservoir. Fresh roasted whole beans and weighed out. During the week I prep the night before and have a schedule setup in the app for weekdays. In the morning the coffee still comes out great even with grinding the night before. I have yet to experience any mess with grinds overflowing as others talk about and have made pots using up to 74 grams of coffe. Still recommend this machine.",
                "reviewVotes": "203 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+VznT4cLL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71XydWxG4ZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "RMillerRMiller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVZB44QWIOZG3XRQTC4NSIIAEAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EJI7KTBRT4CN?ASIN=B09648KFJ4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Best coffee pot ever",
                "reviewText": "Don't hesitate to get this smart coffee pot. It is beautiful, easy to operate and set up. Most importantly it makes a great tasting cup of coffee ☕️I did the usual vinegar water run through of a new coffee pot, then 2 brew cycles with plain water to get the plastic newness out of any first coffee brews. Doing this also helps me familiarize with how the system works. Then I set up wifi (easy) and set it to brew at 8 a.m. on gold setting. I ground the coffee, put water in and woke up to the aroma of coffee brewing. I love that if I wake up earlier than the brew time is set for, I can go into the ap and start coffee from wherever I am.I also have a smart Cafe range I love and microwave so that is what led me to the coffee pot in same series. The copper accents are as quality as what is on my range and microwave. I've seen some reviews saying it's cheaply made but I don't see that on mine at all. It's a heavy sturdy well made copper handle yet light to lift. Accents are all same good quality as on my appliances.The stainless steel pot has a mouth wide enough to get in there and clean too. (The stainless steel I had before had such a small opening that it was very hard to clean.) So I noticed that right away. There are useful settings such as cleaning you can also set from app.The water canister is not removable and the ONLY feature I would change about it is that as others have said, this is such a convenient part of a coffee system missing on this one. I just use my old Ninja system one to fill it. The cups are not the same amount though, about a half cup off.There is also a removable filter in the water resivour but I haven't found out where to buy for replacement yet. I think this is a great part to have for great tasting coffee and filters should be connected to buying the system. I use the filtered water from my refrigerator to fill my coffee resivore and this is extra filtering. Our water here in Washington State is pure but hard!Over all best looking and tasting coffee pot we've ever had. It was a little more than I usually soend on a coffee pot but worth it!I'll update in a few months how it's doing but I'm sure I will feel the same way!Edit 3 months later:I wanted to come back and say, after having this a few months, they should design the water holder with a vent that allows airflow because it stays fogged up and a humid environment like this is can lead to bacteria growth. They should just make it removable to clean but at least a vent!Filters for water were also hard to find but we did find them on Amazon. Otherwise still happy with it.6 month review: June 2023Have had a few problems with the wifi randomly disconnecting my coffee maker so I have to go in and do it all over. Also minor glitches when you cancel a pre set. The App doesn't like you to cancel and you have to unplug and reset.I've gotten zero support from GE about the vent issue in water chamber. I simply leave the lid propped open to dry it out after coffee brews. Despite this effort, I've found mold in the filter area when changing water filter. I now remove that filter daily when drying out water chamber.This coffee pot is a lot of maintenance for such an expense! So far I'm still using it but would not buy again unless GE fixes the water chamber issue. Either removable water chamber or a VENT.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719PzlSbHTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71FSzeZY77L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71I3pyzIsXL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "LorJvLorJv",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 9, 2023",
                "reviewTitle": "Muy linda y moderna",
                "reviewText": "Me encantó, haces un buen café y puedes programarlo por medio de una app para tener listo tu café a la hr que quieras. Se ve muy bonita en mi barra de la cocina y super moderna, sí vale la pena!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71OqyzfobZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sally Jackson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 6, 2023",
                "reviewTitle": "Non UK - Do not buy from UK",
                "reviewText": "This comes up in your search results from the UK but it is not clear it’s a US product with a US electrical setup. Maybe I should have guessed from the 110v but to be honest I didn’t actually remember what UK voltage was, I had to look it up.Anyway, after blowing up two adapters, I finally found out I need a £99 step down transformer, which is huge and expensive, in order to power the thing.It makes great coffee, it does. However you have to prop the water and coffee areas open every day to dry them out, otherwise it’s going to make dank coffee really soon.I had raised my coffee-making ability to an 8/10 using thermal carafes, descaling, using filtered water and really good, fresh beans. This machine takes it to 10/10. Is it worth the hassle to get the upgrade? With a UK plug yes, but for me I wish I hadn’t bothered.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manuel Andrade RiveraManuel Andrade Rivera",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 3, 2023",
                "reviewTitle": "Muy bonita",
                "reviewText": "La cafetera llegó en perfectas condiciones, el embalaje es perfecto, se nota la calidad desde que ves la caja, al abrirla todo se encuentra perfectamente bien empacado. Debo decir que se nota la calidad de los materiales, tuve que pensar mucho y mucho para decidirme por este modelo, ya que estaba entre la Breville y la Oxo que también son certificadas, leí muchas reseñas de las tres, y este modelo no cuenta con mucha publicidad como los otros 2, todas con buenas y malas referencias, pero no hay como vivir la experiencia propia. Definitivamente es un gran salto de una cafetera de 300 pesos que compré hace ya un par de años a este modelo que no es precisamente barato y aun mucho mas para mi país México. Instalé la app en mi celular que fue relativamente sencilla probé con agua solamente mientras tanto, no la he probado como para dar algún otro comentario por lo que por ahora puedo decir que las primeras impresiones cumplieron mis expectativas. Estaré actualizando este comentario conforme la vaya probando",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71xSN0HrZjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71NtFNar1cL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61alt2JsbyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61RebW9xFHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719AyNvbD4L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$172.78",
                "sellerName": "MTL Retailers",
                "sellerRating": "4.5"
            }
        ]
    }
}