{
    "remaining_requests": 35882,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/OXO-Barista-Brain-Coffee-Maker/dp/B00YEYKK8U",
    "body": {
        "name": "OXO Brew 9 Cup Stainless Steel Coffee Maker,Silver, Black",
        "price": "$229.95",
        "originalPrice": "",
        "rawPrice": 229.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/OXO-Barista-Brain-Coffee-Maker/dp/B00YEYKK8U",
        "soldBy": {
            "sellerID": "A1RHZSN6VRQHCL",
            "name": "Everything Kitchens",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1RHZSN6VRQHCL&asin=B00YEYKK8U&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B078213MG4"
        ],
        "asinVariationValues": [
            {
                "asin": "B00YEYKK8U",
                "variationName": "StyleName",
                "variationValue": "9 Cup Coffee Maker",
                "price": "$229.95",
                "variationImageURL": ""
            },
            {
                "asin": "B09NVWPYTH",
                "variationName": "StyleName",
                "variationValue": "9 Cup Coffee Maker + Descaling Solution",
                "price": "$251.52",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "19",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41o0XxoT2cL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51uJocQqUZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51A0-ToVE9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417FCv fjqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418P9clkIML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QrnCL7kYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61nZ-JfQy1L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1kCrPa9DVS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1kCrPa9DVS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the OXO Store",
            "link": "https://www.amazon.com/stores/OXO/page/58FC57D0-38D8-4C7B-ACEF-9C6CD042DED6?ref_=ast_bln"
        },
        "brand": "OXO",
        "merchantInfo": "S-Waves Electronics",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 3300,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 22 hrs 48 mins.",
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 8 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "BetterBrew Precision Brewing controls water temperature and optimizes brew cycles for rich, flavorful coffee – whether you’re making two cups or a full pot",
            "Fully programmable and easy to use, a single dial lets you choose cups, program the time and set the automatic wake-up timer",
            "Temperature-controlled brewing keeps the water between 197.6–204.8°F /92-96°C – the ideal range for drip coffee",
            "Rainmaker shower head evenly disperses water over coffee grounds for better flavor extraction",
            "Internal mixing tube ensures your last sip is as delicious as your first",
            "Voltage is 120V/60Hz",
            "Pause and pour feature lets you grab a quick cup before brewing is complete",
            "Double-wall stainless steel thermal carafe keeps coffee piping hot; freshness timer shows freshness at a glance",
            "Certified by the SCA (Specialty Coffee Association) for gold-standard home brewing"
        ],
        "description": "The OXO 9-Cup Coffee Maker controls brewing time, water temperature and volume for rich, flavorful coffee at the push of a button. BetterBrew™ precision automatically optimizes brewing time and keeps the temperature between 197.6–204.8° -- the ideal range for a better-tasting brew. The double-wall stainless steel thermal carafe keeps your coffee piping hot, while the internal mixing tube ensures your last sip is as delicious as your first. With a pause and pour feature, automatic wake-up timer and freshness indicator; the OXO Brew 9-Cup Coffee Maker is recognized as an exemplary home brewer by the SCA (Specialty Coffee Association) for delivering rich, gold-standard coffee – every time. Note: Voltage is 120V/60Hz.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "OXO"
            },
            {
                "name": "Color",
                "value": "Silver, Black"
            },
            {
                "name": "Product Dimensions",
                "value": "8.3\"D x 15\"W x 17.2\"H"
            },
            {
                "name": "Special Feature",
                "value": "Jug, Programmable, Thermal, Timer"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Paper"
            },
            {
                "name": "Style",
                "value": "9 Cup Coffee Maker"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Cappuccino"
            },
            {
                "name": "Included Components",
                "value": "Base, Insulated Carafe"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Model Name",
                "value": "OXO"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Dial"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Item Weight",
                "value": "10.5 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "OXO"
            },
            {
                "name": "ASIN",
                "value": "B00YEYKK8U"
            },
            {
                "name": "Item model number",
                "value": "8710100"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 3,300 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#29,851 in Home & Kitchen (See Top 100 in Home & Kitchen) #82 in Coffee Machines"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 7, 2015"
            },
            {
                "name": "Capacity 45 Fluid Ounces",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 10.5 Pounds",
                "value": "Wattage 1400 watts"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/db98897d-eba0-43e8-983b-c4c734615b34.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7bb6eaff-b54f-4637-8e3e-1051ff3fff50.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ce34e75-6733-4f8a-93a2-2e2ac47a164e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbb7cd32-a72d-46d4-9da2-a8d38aa837ce.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "mtspace",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRFRPTYNXGE3CGAIO7ZENQBUZWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TPQCZ3W5PEAQ?ASIN=B00YEYKK8U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2016",
                "reviewTitle": "5.0 out of 5 stars OXO vs Capresso vs Bonavita - 8 Reasons the OXO is Better",
                "reviewText": "I have owned two Capresso machines for a total of six years and I have owned two Bonavita machines for another six years. I find this machine to be better than either. At their best I would say that all three coffee makers are capable of making very good coffee, and I would be hard pressed to support the claim that the coffee made in this machine is consistently better than the best coffee from either of the previous brands. That said, it is very good. At Starbucks or at good restaurants I rarely find coffee that I enjoy so much. I don't seek out coffee esoterica and I don't consider myself a coffee snob; but I do buy good beans and I grind them for each use.If the coffee made in this machine is not measureably better, why would one spring for the extra money for the OXO machine instead of the Bonavita or the Capresso?Before we answer that question, we must explain why the thermal caraffe. The answer is that burners that keep uninsulated caraffes warm invariably burn coffee and they do not keep out air. The combination of oxygen and excess heat too quickly turn the tasty brew from beverage to burnt battery acid. Keep excess heat and air from fresh-brewed coffee and it can taste good for hours. Need it to be warmer? Pop your mug of coffee in the microwave for half a minute or so. A good thermal caraffe can keep coffee tasting fresh-brewed for four hours or more. And the caraffe on the OXO is that good.WHAT MAKES OXO BETTER? --1) The caraffe on this machine works better. It keeps coffee tasting fresh from the time it is made at 5:00 AM until lunchtime, around noon. None of the previous machines did this - although all were ten or fifty times better than open pots, there was always a bit of oxidation bitterness, even if the lid was kept on the thermal caraffe. A constant irritation with the Bonavita was that the pour spout was so poorly designed that (it seemed like) fully 10 percent of the coffee ran down the side of the caraffe onto the counter. Of course, pouring slowly could sometimes help a bit, but I never could do this. The people who will benefit most from this difference are absentminded guys whose wives hate cleaning up their reckless coffee spills. In such a case, this difference alone could help save a marriage.2) The OXO machine's fit and finish are better. I cannot tell why, but this machine just looks better sitting on my black granite countertops. Perhaps it is the shiny black plastic. Or the sculptural curves. In any case, it has the presence of a work of art, FWIW. This machine is, however, taller by about two inches. It has a greater kitchen presence. This extra size may sometimes be a tiny drawback - especially in a tiny galley kitchen.3) The brew-stop feature really works. Remove the caraffe and two things happen: 1) a spring loaded plunger closes to stop coffee flow. 2) the machine senses the absence of the pot and pauses the brewing cycle. With the Bonavita, I always scalded my hand if I wanted coffee before the cycle finished; both features are missing from it.4) Number 4 coffee filters actually fit. With the Bonavita, one must fold the paper filters over at the bottom and side joints, then hope that sliding the pot into position does not nudge the top of the filter closed - the consequence of which is a plugged machine with scalding hot water and coffee grounds flowing across the kitchen counter and floor. This little accident has happened probably two dozen times in the six years I've operated Bonavita machines. Diligence and determination reduced the frequency of occurrance, but it was always a hazard. With the OXO, the bin that holds the filter is deep enough that this kind of problem is much less likely. No folding, no sliding, no scalding coffee floes.5) The clear water reservoir helps one see how far the brewing cycle has gotten. The Bonavita and the Capresso coffee makers had smoke tinted plastic reservoirs which allowed one to observe the water level from nearby; but not from acrosss the room. With the OXO I can observe the progress from across the kitchen.6) Of course, once the novelty of it wears off I'm sure that this won't count for much, but I happen to think it's mildly amusing watch the water bubble up through the central heating tube. So does my wife. Who buys a coffee maker as a source of entertainment? I admit it's not much, but we take our amusement where we can find it.7) \"The caraffe is not in place.\" Fortunately, this coffee maker does not scold you for being neglectful as some cars did in the 1980's with spoken phrases like \"your door is a jar;\" but it does turn on a red light when it senses that the pot is not in place. Absentminded people might find this of some help when they have started the machine by pushing the start button, but nothing has started happening ... because the caraffe is in another room!8) The microprocessor counts how many times you have brewed coffee since descaling. When it gets to 90 it tells you to descale the machine. Since I have lost 4 machines to scale, I like the idea that this might extend the life of this machine to the point that it actually has a lower cost of ownership than my previous machines. I know that it is saving me on electricity already because in my old Bonavita it now takes two cups of water to make one cup of coffee -- it's evaporating half of the water. That's very energy intensive. It did not do this when it was new. Sadly, my experience with Bonavita machines is that once I notice that they need descaling, it is too late. So a friendly reminder might help me extend the life of my machine and keep brewing costs down.My impression of OXO kitchen tools has always been that they are very carefully and thoughtfully designed. And that they are well executed. This coffee machine extends those brand values to coffee makers. At the point it completes the cycle, the coffee made by this machine is certainly as good as, if not perceptibly better than that of the Bonavita or Capresso; but the coffee keeps better in the caraffe, it pours into the cup better, and it is much less susceptible to filter handling errors that result in rivers of hot coffee running across the counters, down the cabinets, and onto the floor. It looks better, and I have reason to hope it will ultimately have a lower cost of ownership thanks to its descaling reminders. I've had it for a week and I am very pleased with it.",
                "reviewVotes": "261 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Italian herb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESJ4A2FL6Q5BREWDIYYAKDFJVMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y7C19V9C85M4?ASIN=B00YEYKK8U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2018",
                "reviewTitle": "5.0 out of 5 stars The right choice for me!",
                "reviewText": "I have been using a Farberware Perculator for over thirty years, and it made a decent cup of coffee. As with many other appliances, the design of the new farberware percs is similiar to older ones, but there have been some disappointing changes, and I no longer trust their quality.I am not a coffee aficionado but I do appreciate a good tasting cup of coffee and look forward to my coffee in the morning.My current farberware perc is over 20 years old and on its last leg, so in a fevered pitch, I began researching coffee makers.My priorities were first and foremost, 1. a good tasting cup of coffee, 2. coffee that is hot, 3. ease of use, and 4. very little plastic on the housing.I looked and compared all the high end models, and some not so high end models.Technovorm was tempting, but there seemed to be so many parts to detach and clean. The price was way past what I wanted to spend, and the job of taking it apart and putting it back together, was not the way I wanted to spend my mornings. Bonavita, had so many choices that I lost patience comparing all the sizes and shapes, and there were many spillage and pouring complaints in the reviews. I looked at most available coffee makers and just could not find the right fit, in terms of quality, and size.I also looked at many medium priced coffee makers, some had great reviews, but I absolutely did not want a hunk of cheap plastic sitting on my kitchen counter.Somewhere out of the blue, this oxo barista brain popped up. At this point I was beyond frustrated. Esthetically, it looked like something I could live with. It was a good functional size, gave 2 choices of flow for small or large amounts, had one single dial to operate everything, gave an option for programming, and had consistent rave reviews for a great tasting cup of coffee.So off I went onto the Oxo bandwagon. Before I say anything else, let me join all the reviewers who described the coffee as great, smooth, hot, and consistent. Two hours later, the remaining coffee in the carafe was still hot. Very hot. (And I did not pre-heat the carafe)I have read allot of reviews where people were complaining because they couldn't get that first much needed coffee fix before the brew was complete. Well, I can't imagine that waiting another couple of minutes would create such a catastrophe, but if it was absolutely necessary, couldn't you put a saucer in place to catch the drip, for all of 3 seconds?BTW ... after the brew cycle is complete, there is no dripping. The brewing temperature is consistent with the SCAA standards, and the pulsating then pause brew technique enhances the quality of the brew. And btw, the only plastic in the entire unit is the basket that holds the filter. The unit is made of stainless steel and borosilicate glass.I have read so many reviews and tried to understand what people are demanding. Wouldn't you just want a coffee maker that is made responsibly, and delivers a fine tasting cup of coffee?Do you go into a fancy coffee brewing house, and demand that you get an extra swallow of coffee while you wait for your order, because you just can't wait an extra 2 minutes?And no one seems to accept the fact that with any new appliance, there is a learning curve. It's not going to jump out of the box and tap dance. If your coffee is a little strong, use less coffee. If it's weak use more. No matter how great a coffee maker is, it can't read your mind! And no matter how great it is, it will have condensation, or a residual drop of water from the previous brew. If there is a machine out there that will wipe itself down , then rinse out your cup, I'd like to know.This oxo barista brain is well thought out, well made, simple, and delivers a great cup of coffee!",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "George Visgilio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP2367LBX2DXIOB7OD455PJRH3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LCKVXXJKZAKW?ASIN=B00YEYKK8U",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Great coffee, sketchy engineering",
                "reviewText": "As many reviews have said it does make excellent flavorful coffee every time with no complicated “programming “.But, it’s also a royal PIA :Setting the clock is complicated, it’s no good under counter as it’s too tall and adding water and coffee require it to be even more open height, the screw cap on the carafe is balky and the tiny opening requires you to almost invert it to pour, the warming plate turns off after one hour - no choice, the water chamber cannot be detached for drying or cleaning, the filter holder basket is balky and hard to take out after brewing - I could go on…..",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joann M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 22, 2023",
                "reviewTitle": "Makes a great cup of coffee!",
                "reviewText": "I am very impressed with this coffee maker!I am a very fussy coffee drinker. I searched for some time for a coffee maker that is easy to operate and makes a good cup of coffee. This coffee maker meets and exceeds my expectations on both counts. We have had it for a couple of months now and it still works great and continues to make great coffee! I highly recommend it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "3H Hutch",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 13, 2018",
                "reviewTitle": "Like it so far",
                "reviewText": "The coffee maker arrived as promised in two days in perfect condition. We have only had it for 2 days but have made 2 full batches of morning coffee and 2, 4 cup batches of evening decaf coffee and the coffee maker worked as described. It is very simple to set up and use. The coffee in each case was one we had been using for many months in our old coffee maker but the flavour was noticeably better using the Oxo coffee maker. The full batches stayed hot until gone but the smaller batches of decaf were not quite as hot but still excellent. Next time I will preheat the carafe for small batches. The other thing we noticed is that while the coffee maker was done pumping the water and starting tracking the time since the coffee was made, a large amount of water remained in the filter so we had to wait several more minutes before pouring the coffee. This was especially noticeable with the decaf coffee, but that is always the case with decaf.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 27, 2017",
                "reviewTitle": "Looks great. Makes great coffee. Just make sure to empty the carafe before making the next batch.",
                "reviewText": "I don't have many coffee makers to compare this to, but I love it. Looks nice on the kitchen counter, keeps coffee warm for a long time. It doesn't have a heated plate, but the insulated carafe is pretty effective. Watching the water percolate up the clear tube in the middle of the reservoir is nifty.The only downside is that because the carafe isn't clear, sometimes I forget to empty it of old coffee before making a new batch.If you like to make a large pot of coffee and then drink it over several hours, then this isn't the maker for you. The insulated carafe will keep it warm enough for an hour or so, but that's it. A maker with a heated plate would keep it hot for longer. But who wants 3-hour old coffee?",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shopper",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2018",
                "reviewTitle": "Not worth the price",
                "reviewText": "Purchased on sale for $200 (regular price at the time was $300). Yes, it makes good coffee at least in the beginning. But if you're willing to spend around this price point have a look at some of the other brands out there.I've been scrupulous about constantly cleaning and descaling this unit since it arrived in October. There are a few things that have come up since I bought this that I wish I'd known about before investing this kind of money in a coffee maker.1-The brew temperature will slowly start to to go down. When first purchased the first cups right after brewing were scalding hot. Over a few months I've had pots that were only warm. It seems to vary now, I'll get 3-4 days of hot, then out of nowhere a pot comes out warm. This alone makes it two stars at best. My old $35 drip machine never had this issue. Yes I do preheat the carafe every time.2-The pump grinds and shudders when I start the brew cycle, which I assume means parts are already starting to fail.3-The smell - silicone? - from the water container does not go away. Honestly, this smells like skunk, I kid you not. You can wash the bridge (I did) but it won't help. And the shape and size of the container makes it impossible to properly wash and rinse. You can wipe it with a damp paper towel but nothing will kill that smell, which goes through the whole kitchen.4-Over time the filter basket has started to leak excessively from the bottom after removing the pot when the brewing is done. And when you lift the basket lid to take out the used filter, water goes pouring back into the water container.5-Washing the pot properly becomes a problem because after using dish soap and warm water on the lid, you have to rinse the entire thing for an insane amount of time or suds will be trapped inside it. Soapy coffee anyone?Follow-up: Three months after purchaseSo, with daily use (4 pots a day) this naturally needs more frequent cleaning and descaling. The lid is unfortunately a complete deal breaker. Because whether you use soapy water or a cleaning/descaling solution, some of it will always stay trapped inside, affecting the coffee taste for many pots afterward. And just rinsing with hot water will do nothing to clean out the grime inside. $200, 90 days, and now this is headed to the garbage dump. I've also noticed that some plastic parts (carafe rim and lid) will stain in spots that won't clean up. If you can afford a coffee maker at this price range, do yourself a huge favor and buy something else. Downgrading to one star and learned my lesson - don't get taken in by all the reviews from people who've owned this for all of two weeks. Piece of garbage.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pascal Laprade",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 20, 2018",
                "reviewTitle": "Really good coffee",
                "reviewText": "This coffee maker makes really good coffee. I have been using the OXO for about three months, now, and the coffee it makes is consistently good.Of course, being certified by the Specialty Coffee Association, you would already expect that the OXO 8 cup Coffee Maker make good coffee.For me, this was a big step up from my previously, second-hand coffee makers. I already had a Burr grinder, so the coffee maker was all I needed to get to a great coffee experience. I use a scale to measure the amount of coffee I put in the basket, as well as the water quantity, and the result is really, really good. Compared to these previous machines, the coffee is sweeter and richer, and I found it was easier for me to distinguish between coffee from different origins, as the specificities of each are just highlighted by the OXO.It's also a beautiful machine, the visual balance is well thought, the black finish is quite nice, and I really like to see the water being pumped in the middle of the water compartment.I found it brews my coffee quick enough. I like the dial as a means of control, more than the traditional buttons. The LEDs just add a touch of modernity that is very welcomed.The steel carafe keeps the coffee hot enough for my taste, and is relatively easy to clean, but will always keep a certain amount of coffee from pouring at the very end of the pot. You have to turn it upside down entirely for these last drops to fall out, which is not a big deal, but is still a bit annoying. I really like that the lid remains on during brewing, as I do not have to think about screwing it on as soon as it is finished.The main issue I have with the OXO is that its drip valve doesn't work at all... This could be a deal breaker for some, but I just learned to live with it. It started on the second or third day of usage, and has been consistent ever since. It is apparent that the metal spring just isn't strong enough to close the valve when the carafe is removed. Since I never remove my carafe until the brew is complete, it's not a major problem for me, but it still makes a mess every time I am done brewing, as a few drops that wouldn't go into the carafe just spills over the base of the machine.As I said, you can live with it if you don't remove your carafe mid-brewing, but for a machine this price, such an obvious issue is pretty disappointing, especially since many other people seem to have that same issue.But I still recommend the OXO 8 Cup Coffee Maker: it really does make good coffee, and it is just a beautiful object to have on your counter.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "",
                "sellerName": "S-Waves Electronics",
                "sellerRating": "5"
            },
            {
                "price": "$229.95",
                "sellerName": "The Kitchen Clique",
                "sellerRating": "5"
            },
            {
                "price": "$229.95",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}