{
    "remaining_requests": 35877,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Capresso-426-05-5-Cup-Coffeemaker-Silver/dp/B0728C671N",
    "body": {
        "name": "Capresso 5-Cup Mini Drip Coffee Maker, Black and Stainless Steel",
        "price": "$39.19",
        "originalPrice": "$39.19",
        "rawPrice": 39.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Capresso-426-05-5-Cup-Coffeemaker-Silver/dp/B0728C671N",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CT56L8WX"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41CBvESBRDL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51YVIhmp4yL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iPijhbycL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kVleckLrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sVs7Vz7NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qjcRAlz0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cHk UQlxL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Capresso Store",
            "link": "https://www.amazon.com/stores/Capresso/page/1A91C58F-81C8-413B-A590-48C3B30796A3?ref_=ast_bln"
        },
        "brand": "Capresso",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 5284,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 47 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Note: 1)Too coarse a grind, too little coffee, or insufficiently tamping the grounds before brewing can all lead to inadequate pressure for a proper brew. 2)It is important to note that the amount of espresso extracted will vary depending on the grind size and amount and reprogramming may be needed when the size and amount are adjusted.Please refer to user guide or user manual or user guide (provided below in PDF) before first use",
            "COMPACT DESIGN: Perfectly sized 5-cup glass carafe is ideal for 1 or 2 people",
            "GOLDTONE FILTER: Eliminates the need for messy paper filters and is easy to clean",
            "PROGRAMMABLE: Set the machine to automatically brew at your programmed time. Glass carafe features brew-through lid, drip-free pouring spout and an ergonomic handle",
            "KEEP WARM: Hot plate stays on for 2 hours and then automatically turns off",
            "DRIP STOP: Pour a cup while brewing"
        ],
        "description": "Get your morning Caffeine fix with the caress mini drip Coffee maker. With a black base and stainless steel accents, It comes with a glass carafe with brew-through lid, and a permanent gold tone filter. The drip-free pouring spout and ergonomic handle makes it comfortable to hold and easy to pour without messy spills. It also features an internal water level indicator as well as programmable 24-hour timer and clock with digital LCD display. A coated non-stick warming plate keeps your Coffee hot for two hours and the machine automatically shuts off after two hours. Backed by a manufacturer's one year limited, This drip Coffee maker is sure to guarantee satisfaction.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Capresso"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "6.25\"D x 8\"W x 10\"H"
            },
            {
                "name": "Special Feature",
                "value": "Programmable,Timer,Cup Warmer"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Style",
                "value": "Coffee Maker"
            },
            {
                "name": "Included Components",
                "value": "Coffeemaker, glass Carafe"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Voltage",
                "value": "110"
            },
            {
                "name": "Model Name",
                "value": "5-Cup Mini Drip Coffee Maker"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Item Weight",
                "value": "2 pounds"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Capreso"
            },
            {
                "name": "ASIN",
                "value": "B0728C671N"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "426.05"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 5,284 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#19,342 in Home & Kitchen (See Top 100 in Home & Kitchen) #55 in Coffee Machines"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "September 29, 2015"
            },
            {
                "name": "Capacity 1 Cubic Inches",
                "value": "Material Stainless Steel, Glass"
            },
            {
                "name": "Item Weight 2 Pounds",
                "value": "Wattage 650 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Quick Brew Quickly brews 5-cups (25-oz) of coffee into glass carafe with ergonomic handle and drip-free pouring spout Maximum Brewing Quality Multiple nozzles spray water evenly onto ground coffee ensuring full saturation of grounds-GoldTone filter is easy to clean and eliminates the need for paper filters Programmable Easily program the coffee maker to start brewing at the desired time – coffee maker will keep warm for 2 hours and then automatically shut off",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/38d6a1bd-5244-4d20-bbed-0d69666e92fc.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/13513d68-34e5-49a3-9105-a4adefd2cdb0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7365ad3e-4bd4-46eb-be49-aa5f761d6eca.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "ST300 SG300 SG220 12-Cup Coffee Maker On-the-Go Mini Drip Capacity 10-cup 12-cup 12-cup 12-cup 16-oz 5-cuo Heating System Coil Coil Coil Coil Coil Coil Small Cup Setting 3-5 cups 3-5 cups 3-5 cups 3-5 cups - - Serve While Brewing ✓ ✓ ✓ ✓ - ✓ Drip Stop ✓ ✓ ✓ ✓ - ✓ Auto-Off after brewing 2 hour 2 hour 2 hour resets after brewing 2 hour Auto-ON Programming ✓ ✓ ✓ ✓ - ✓ Filter Type GoldTone Cone/ Size 4 GoldTone Cone/ Size 4 GoldTone Cone/ Size 4 GoldTone Basket Nylon GoldTone Basket Charcoal Water Filter ✓ ✓ - - - - Electronic Charcoal Filter Indicator ✓ ✓ - - - -",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/38d6a1bd-5244-4d20-bbed-0d69666e92fc.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/13513d68-34e5-49a3-9105-a4adefd2cdb0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7365ad3e-4bd4-46eb-be49-aa5f761d6eca.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/021deb34-696f-4e72-a8be-3ebd1f4708b0.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/37d15d21-478a-4e39-b744-0c6992899b5d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9c63dc62-688a-4730-8865-e98f64ec6a9d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/522797d6-6f4b-418b-9bf6-26a0f79102cb.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1f7bb4b0-cc1a-4d18-b8b0-d46e9ef97e34.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2250fac5-b1ec-489b-8b87-471d44c965e2.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDFOOGSPIPELAGG6MYPVRGFIQBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VB0EFQ31JSPH?ASIN=B0728C671N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2022",
                "reviewTitle": "5.0 out of 5 stars Well made coffee maker",
                "reviewText": "This is a nice coffee maker! Like a lot of reviewers I’m the only coffee drinker in the house so five cup in the morning is usually enough. I like to grind my beans and pods get expensive so a small pot works best for me. The Capresso is a nice size and fits under the kitchen cabinets. Although the clock and timer work well I don’t use it. The water level step is an interesting design, I seldom make less than a full pot but once in a while I want one more cup and it’s hard to see the lower steps. I do keep it in a darker corner of my counter so the water level and clock are a little harder to read. I’ve been using it daily for about five months now with no complaints. I think the hot plate keeps coffee at the right temperature, doesn’t burn the coffee if you leave it on to long. A little more than I wanted to spend but the quality is there and the cheap ones are just that.Well I guess I spoke to soon. Less than seven months and it died, stopped heating. The clock and timer work but I need coffee! I’m not afraid to take things apart, they all work the same way. I did not find any shorts or fried wires. What I did find was the water level step was getting kind of nasty and due for a good cleaning. I really liked this coffee maker so do I try another one or move on to something else? I’ll have a spare carafe and basket! I didn’t change my rating but yeah, I’m disappointed. Just more landfill.Final update; I did get ahold of customer service after being on hold for over an hour. The problem is I have to ship it to Pennsylvania. UPS shipping calculator came up with about $16.80 for shipping. I get it, they can’t give a coffee maker to anyone willing to be on hold for a hour. I’ve had bad luck with these small coffee makers so I went cheap and bought a SHARDOR for $17.99 + tax. So far it is working just fine!",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cidney J.Cidney J.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3E4REFOF4VJN2S327HIH7ZINPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV1YBV735ZZHF?ASIN=B0728C671N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Love this little coffee maker!",
                "reviewText": "This is exactly what I wanted, and I’m truly happy with my purchase! I replaced an old 4-cup coffee maker, which was fine for many years until it started leaking around the base. And quite often I wanted just one more cup. This 5-cup Capresso is perfect! It makes great coffee, and the pour spout is mess free. I like the water level indicator and the handle is sturdy and easy to hold, and the programmable features are a nice plus, and simple to use. I can’t say anything negative about this cute little coffee maker.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71UGJkkYB8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ak2013",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP4DJR7KVXLPFQLRVGFCYLKQIJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UV13INU4XPU9?ASIN=B0728C671N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2020",
                "reviewTitle": "4.0 out of 5 stars Great for small spaces and one person",
                "reviewText": "I’ve been using this for about an year now, so far it has held up fine. I chose to buy this one because:1. I had been using an AdirChef single cup coffee-maker but wanted to make more coffee in one go (for morning and for taking to work). The 5-cup size of this coffeemaker was perfect for my needs. Note about the size: The “cup” of 5-cup is a European measure, and it’s also the standard for coffee-makers in the US. If you are going from 1-cup drip coffee-makers to this (like I did), don’t expect it to make 5 times the amount of coffee from your one-cup coffeemakers. Here, 1 cup = 5 oz. As I drink from a standard 12 oz mug, for me it makes enough for 2-servings of coffee.2. Capresso is a relatively known/specialized brand for coffee equipments. I don’t think they’re the best-ranked or anything, but it’s just that personally, I feel more comfortable buying a coffee-maker from a company whose main business is coffee-related items, and not a variety of stuff from toothbrushes to exercise machines.3. It has a hot plate and an auto-shutoff. The coffee stays hot for two hours, and after two hours the machine shuts off automatically. I keep the coffee machine plugged to the wall and so far it has been completely safe. I haven't measured the temperature of the coffee, but freshly brewed it's very hot (at least, hot enough for my taste). On the hot plate, it's a little less hot (not steaming), but still good enough to take out and drink comfortably any time within the 2-hr mark.Other details:Coffee-filter: It comes with a reusable gold-tone filter, but I don’t like cleaning it up everyday, so I use paper-filters (basket type, 4-6 cups). My taste-buds aren’t refined enough to sense a taste-difference between this and the 1-cup coffee maker I had, and anyway it isn’t a fair comparison because the sizes are different. The other coffee-maker I have is a moka-pot which makes much stronger coffee, again no way to compare tastes.The carafe: It’s glass, therefore easy to clean. I don’t have a dishwasher so I don’t know if it’s dishwasher-safe. But it’s easy enough to clean by hand. Except, the glass is very light so it feels flimsy and fragile in your hand. I don’t know how shock-resistant the glass is, and I have no intention of testing it. Other than that, I like the design of the carafe. It has volume markers, for both water and coffee. So you can use the carafe to fill your desired measure of water, knowing how much coffee it will produce (some water will be retained by the ground so the coffee will always be little less than the water). The lip of the carafe is well-designed and feels nice to pour from (doesn’t spill).The stepwise cup markings inside the water-reservoir: These are very helpful for me because I can pour water directly from the water-filter and know the measurements. In my previous coffeemaker, I used to fill the carafe/mug with filtered water and then pour it to the coffee-maker’s water reservoir, or just fill it to some random measure (which is very bad for making coffee). Having a measuring system inbuilt to the reservoir helps to bypass that step. I specifically like that it’s inside the reservoir and not to the side like many other coffee-makers, because I have very little space in my apartment so I don’t have to free the side of the coffee-maker to be able to see the markings.The 24-hour programmable timer: I like to grind my coffee just before brewing, so I haven’t tested this feature.Overall, I like this coffee maker. The one negative is that there is always some drops of coffee falling to the hot plate as you remove the carafe. It badly affects the smoothness of the ‘pause’ function. At first I was worried about the coffee droplets on the hot plate, but as I said in the beginning, so far it hasn’t caused any problem.",
                "reviewVotes": "59 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tripleshot7",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOIRFJL3GQXDF7Q54FAN44Q7WFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A0YENEEGQPF9?ASIN=B0728C671N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Compact and simple",
                "reviewText": "Easy to use, takes up little space, makes an excellent pot of coffee. Coffee brews hot and stays hot!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vagabond1081",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 17, 2023",
                "reviewTitle": "I love it",
                "reviewText": "It makes hot, delicious coffee and is easy to clean and program. I use a large mug and the coffee pot holds 2 mugs, which is perfect for me. It is small and very nice looking.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ma. Guadalupe Corona Arechiga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 7, 2022",
                "reviewTitle": "Ligera y muy bonita!👍🌺",
                "reviewText": "Todo me agradó. Es muy cómoda y tal como se describe se recibió.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave Hanafin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2024",
                "reviewTitle": "Quality product.",
                "reviewText": "Good quality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fernanda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 15, 2022",
                "reviewTitle": "Muy buena cafetera.",
                "reviewText": "Muy buena cafetera, lo recomiendo ampliamente, ya que la requiero para pocas tazas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 26, 2022",
                "reviewTitle": "Buena y funcional, ideal para espacios pequeños o personas solteras.",
                "reviewText": "Me gustó que es pequeña, fácil de lavar y almacenar.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}