{
    "remaining_requests": 35883,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Presto-02811-12-Cup-Stainless-Coffee/dp/B00006IV0Q",
    "body": {
        "name": "Presto 12-Cup Stainless Steel Coffee Percolator",
        "price": "$67.48",
        "originalPrice": "$67.48",
        "rawPrice": 67.48,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Presto-02811-12-Cup-Stainless-Coffee/dp/B00006IV0Q",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJ9XX4SQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BG3HSRTX",
                "variationName": "Style",
                "variationValue": "Cordless",
                "price": "$69.69",
                "variationImageURL": ""
            },
            {
                "asin": "B00006IV0Q",
                "variationName": "Style",
                "variationValue": "Non-Cordless",
                "price": "$67.48",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31fKF3HOQkL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Jt8PbYbhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41dRYbXf1fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41d4 fTkX8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31A5klcfwuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41p-xj2xSQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61RpYNZZdnL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81ecSM1kCwS.pdf",
            "userManualLink": "javascript:void(0)"
        },
        "byLineInfo": {
            "name": "Visit the Presto Store",
            "link": "https://www.amazon.com/stores/PRESTO/page/DCAA63BB-5854-4DA5-9AD0-40998884F669?ref_=ast_bln"
        },
        "brand": "PRESTO",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 18771,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 48 mins",
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 7 hrs 48 mins",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Tomorrow, February 14. Order within 4 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Please refer to user guide or user manual or user guide (provided below in PDF) before first use"
        ],
        "description": "Product Description Made from luxurious stainless steel. Makes 4 to 12 cups of rich, flavorful coffee automatically; a cup a minute. Signal light tells when coffee is ready to serve. Attractive, traditional styling - ideal for table service. 120 volts, 60 Hz only Amazon.com One of the most comforting sounds in the world is the bubbling of a coffee percolator at work. And then comes the toasty aroma--it makes for a perfect morning. Percolators have come back to home kitchens, and the Presto 12-cup stainless steel coffee maker is a prime example. Its elegant, hotel-style design brings a touch of luxury to what is for many a daily pleasure. This coffee maker brews up to twelve cups of coffee at a cup-a-minute rate, which it then keeps at a constant, piping-hot serving temperature. An indicator light in the base announces when the coffee is ready. The inner fixtures--the filter basket and perk tube--are also made of stainless steel, rather than the more common (and less durable) aluminum. The power cord is removable to make storage simple. Before cleaning the coffee maker, unplug the unit and allow it to cool completely. Wash the coffee maker with warm, sudsy water and dry it thoroughly; it is not immersible. To preserve the gloss of the stainless steel, do not use steel wool or harsh, abrasive cleansers. The perk spout and filter basket can be cleaned with a brush or pipe cleaner. If necessary, coffee stain remover can be used periodically on the interior surface. The coffee maker measures 10 by 5 by 13 inches (including handle, lid, and spout). Presto guarantees this product with a one-year limited warranty. A simple instruction sheet is enclosed. --Garland Withers",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Percolators",
                "link": "https://www.amazon.com/Coffee-Percolators/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289746"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "13.1 x 9.7 x 6.2 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.9 pounds"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "National Presto Ind"
            },
            {
                "name": "ASIN",
                "value": "B00006IV0Q"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "02811"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 18,771 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,013 in Home & Kitchen (See Top 100 in Home & Kitchen) #2 in Coffee Percolators"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 31, 2003"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Beautiful traditional design. Easy-pour spout provides elegant coffee service. Easy-to-clean stainless steel construction.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5e477736-85ea-4a8e-ba5d-936524e57630.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/908a8c1a-fddf-4a61-aa9f-3b13bf6a92f5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa08593b-2b07-49fb-9f27-7f4a8bc947a8.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "National Presto Industries, Inc. has stood the test of time! Founded in 1905 in Eau Claire, WI. It is a respected producer in the housewares and small electric appliance industry. The company created the first saucepan-style pressure cooker in 1939. Its first electric appliance came in 1948 with the Presto Vapor Steam Iron; the first steam iron to use tap water instead of costly distilled water. In 1956, Presto introduced a complete line of fully submersible electric cooking appliances employing the first removable heat control. Other notable innovations include the PrestoBurger hamburger cooker in 1974, the FryBaby electric deep fryer in 1976, the SaladShooter electric slicer/shredder in 1988, and the Pizzazz pizza oven in 2000. Predicting the needs of consumers... ...and then fulfilling those needs through consistent product innovation and quality manufacturing has been the objective of National Presto Industries for over 100 years, and it will continue to be in the years ahead.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1865026-7642-4258-aab3-b48dc60f2ebe.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0081aa80-5b60-46bf-b05c-37cb5166b1c6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1dfa6df5-0451-4bc8-b1c1-b3ca11fd367c.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ab24f672-d29a-4028-9820-632e9959a0bf.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5e477736-85ea-4a8e-ba5d-936524e57630.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/908a8c1a-fddf-4a61-aa9f-3b13bf6a92f5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa08593b-2b07-49fb-9f27-7f4a8bc947a8.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8da94d8d-d319-4bf5-b269-946cbd67f629.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1865026-7642-4258-aab3-b48dc60f2ebe.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0081aa80-5b60-46bf-b05c-37cb5166b1c6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1dfa6df5-0451-4bc8-b1c1-b3ca11fd367c.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "RMG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLX563D3LDSH5D2NEOLS5P4XPVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29BLHNCP7NXH0?ASIN=B00006IV0Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Makes a great cup of hot coffee",
                "reviewText": "I’ve run the gamut on all sorts of coffee makers and know how to make a good cup of coffee. Pour over using a kettle and kalita wave, v60, or Chemex will get you the most nuanced coffee as long as you know how to pour it. It takes practice and I used to have the time and patience for it, but now I reserve those moments for when I’m truly in the mood. There are good drip brewers out there that make good coffee and I recommend using, especially the ones that brew at the right temps and speed, and I never thought old fashioned percolators can make good coffee. I always thought they “burn” coffee and brewing with recirculated coffee ruins the taste. I was wrong. I recently learned through experience that Percs and can make great coffee. I purchased this coffee maker mostly out of curiosity. I wanted my coffee to stay hotter in my mug for longer, and drip coffee just seemed to cool down too fast, even from the SCAA recommended machines. Preheating the mug is a workaround, but requires an extra step that you really don’t want in the morning. Knowing that percs are known for making hotter coffee, I purchased this one. Let me tell you, it did not disappoint. This thing makes great tasting, hot coffee. There is a learning curve though. Here is what works for me:I put a scoop of ice in the pot along with my water to make it very cold before brewing. These electric percs need very cold water to start to get the best results.Do not use a filter. I tried using the sample filters that came with the pot but the few times I tried I got very weak coffee. I think these filters allow water to bypass the coffee grounds in the basket, and don’t allow the full and even saturation needed. The benefit you get of easier clean up is not worth getting a horrible tasteless pot of coffee.Use freshly ground beans. If the beans are freshly roasted, even better. But at a minimum, to get the best tasting coffee from any brew method the beans need to be ground right before brewing. Burr grinders give the best results. However if you don’t have a grinder that’s ok. I buy pre-ground coffee too. I make sure to buy only small containers so the grounds don’t get too stale before they are used.Grind the beans to a coarseness level slightly above drip. However, regular drip grind works just fine.Experiment with coffee to water ratios to get the results you want. In this perc I prefer a 20:1 ratio (20 parts of water to 1 part of coffee grounds, by weight).Unplug the perc shortly after brewing. Doing this will preserve the best flavors of the coffee.Lastly, after it’s cooled, if there is still unused coffee that you want drink, you can “freshen” it up easily. First take out the basket and tube. Put the lid back on and plug it in again. The pot will start heating the coffee. In about 2 min the light will go on and the coffee will be at the same hot temp again. Unplug the pot and enjoy your cup. (Won’t be a good as first cup but close enough for me).Using these guidelines for myself, I always get a delicious, full bodied, piping hot coffee that is better than any cheap drip machine, just as good as high quality drip machines, and the coffee stays hot in my mug longer. I was surprised that these vintage style percs made good coffee, but I guess they knew what they were doing 50+ years ago when these were popular. The convenience of drip took over, but I’ve found that percs have a certain charm to them. While not as “convenient” its still very easy to use. I enjoy the sounds it makes, and I like that they are so simple to clean. It’s all metal, no plastic, which also means hot water is not touching any plastic during brewing, which you can’t say for most drip machines. Plus it has a small blueprint so takes up a lot less space. The only thing I wish it had was auto-shut-off. The only way to turn it off is pulling the plug out of the pot. Auto-shut off after 1-2 hours should be a standard feature. I can’t see how leaving the pot on all day would be desirable at all.Overall I really like this pot. It’s nostalgic and makes great coffee!",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arthur SeniorArthur Senior",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWOF7BVIKVMARHWEHQWYB3QEZBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19TY9RZ4FYB8B?ASIN=B00006IV0Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2020",
                "reviewTitle": "5.0 out of 5 stars If Your Looking For A Coffee Percolator That Makes Excellent Tasting Coffee, This Is It!",
                "reviewText": "The media could not be loaded. In the first years of my life, I grew up with a coffee percolator. Its in my humble opinion, a percolator is the best way to make coffee. Back in the 1990's, companies started marketing drip style coffee makers. They would classically show somebody getting coffee grounds all over their percolators, and using that as a reason to switch to drip. Well, it must have worked, because our family switched to drip style coffee makers, and we went through many of them, as they never lasted more then 3 to 5-years!I gotta be honest, when you've tasted drip brewed coffee, it just isn't as good. When you've tasted percolator brewed coffee, its like a night and day difference. After a power outage spike took out our old coffee maker, it was time to finally go back to the percolator, and we chose the Presto. How does it measure up? Well, let me install a new surge protector first, plug the percolator into it, and then I'll tell ya.The coffee maker comes packaged fairly well, nice box, cardboard separation inserts. Comes with an included 2-prong power cord, the same kind waffle irons, rice makers, and crock pots use. It comes with a instruction manual, and all the parts that make up the percolator, all packaged in plastic bags, which you must take out, and install properly to get ready for use.With the lid removed, filter basket and tube, fill the unit with the amount of water you require for the needed cups you want. For example, if you want to make 12-cups of coffee, fill to the 12-cup mark. I grind my own coffee beans with a portable B&D electric coffee grinder. I like my coffee strong, so I fill the grinder to its max level, and I just do a medium grind, that way you don't get a lot of grounds getting past the filter basket into your coffee.Yes, I am well aware of the age old discussion, to paper filter, or not paper filter, that is the question. To be perfectly honest, using paper filters will indeed alter the taste of the coffee to be less desirable, all to have no grounds at the bottom of the pot. If you do a medium grind, you won't get that many grounds at the bottom of the pot anyway, so I recommend to not use a paper filter for best flavor results.Once you have filed the filter basket, just place the percolator pickup tube into it, then center the bottom half of the tube, with the bowl shaped recessed notch at the bottom of the coffee pot. Then just hold it in place while you install the lid. The lid literally snaps into place, so there is no way that lid is ever coming off on its own, without human intervention, so you can trust it, which is a plus. Then all you have to do is plug the cord into the wall, and the coffee maker begins percolating after just a few seconds.When the coffee pot is fully filled, it is surprisingly heavy, so much so, I decided to weigh it. The coffee maker weighs in 6-pounds and 10.7-ounces, that is almost 7-pounds! It is in my opinion, that seniors who are suffering from arthritis, will have quite a bit of difficulty managing this coffee pot. I remember my mother had a lot of trouble, just trying to lift a 12-cup drip style pot. So you might want to use a second hand with a pot holder, to help you support the pot as you pore.The good news however, is that this pot has an excellent handle, that remains cool to the touch, so you never have to worry about getting burned, as what would happen with a stove top percolator! Additionally, the percolator has a beautiful spout, and it functions as good as it looks, pores beautifully. I recommend that you use filtered water, I use a Britta filter, which is better for your health, and helps to reduce calcium deposits in the coffee pot.The company claims that the percolator takes 1-minute per cup, so 12-cups = 12-minutes. I am always wary of company claims when it comes to marketing, so I decided to test that. The water sat long enough in the pot to reach room temperature before I plugged it in. As my video clearly shows, the Presto 12-cup percolator took a total of 12-minutes and 55-seconds to finish brewing. So while that is nearly a whole minute longer then company claims, its well within the norm, so they get a pass.....This time.By now your wondering, all this is well and good, but how does the coffee taste? I am happy to report, that the coffee that this percolator makes, tastes phenomenal! Literally, every time I took a sip, I was in heaven. Its like one of those things that makes you ask yourself, \"what have I been doing with all of my life?\" The answer is, you've been doing it wrong for years, but now you own a percolator, so you've redeemed yourself. I can't recommend the flavor that this machine produces enough!Please note that, unlike drip style coffee makers that never get the coffee that hot, this percolator makes coffee piping hot, 195-degrees Fahrenheit. Be careful with your first sips, unless you cool it down a bit with some liquid creamer or milk.Now as far as cleanup is concerned, its not the huge ordeal that companies made it out to be, when they suggested that you switch to drip style coffee makers. Simply, remove the lid, run it under hot water, set aside. Remove the filter basket, knock it against the inside of your trash can, most of the grounds fall in, or use a piece of paper towel to assist. Run the filter basket under hot water to rinse out any remaining grounds. Run some water through the pickup tube, just make sure its clear, set aside to dry.A quick rinse of the pot as well, not even soap is required, Its literally that simple, and now your percolator will be ready for the next pot you make. I recommend only plugging and unplugging the cord from the male end that goes into the wall, there is really no need to detach it from the coffee maker itself. But when the coffee percolator finishes brewing, it will automatically turn off and switch to warming mode. I don't recommend leaving the pot in warming mode for longer then 30-minutes though, that way the coffee stays fresh and doesn't turn bitter on ya.I would have preferred that this coffee maker had an on/off switch, but that doesn't appear to be a feature, that is found on percolators in general, not just from this brand. Other then that, I literally have nothing else negative to say about it. The percolator is both beautiful in design, as it is, in its function to make excellent tasting coffee, what more could you want? I really love this coffee maker and I can't recommend it enough. If you've been using a drip style coffee maker, please do yourself a favor, and get a percolator.I rate this coffee maker a solid 5 out of 5 stars! Highly recommended!",
                "reviewVotes": "195 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/710iMMfzFSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71OjGZnGSuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71Zfuiik09L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81+04bkNGpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/8169FH15KTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81LJ9V9bhBL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fd6f3a30-7595-4baa-95f2-2472452a0165/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "CESAR LOZANO FLORESCESAR LOZANO FLORES",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 5, 2022",
                "reviewTitle": "Excelente compra. Intuitiva y práctica",
                "reviewText": "Es muy práctica y de gran capacidad pero lo mejor es la calidad con que hace el café, lo prepara con un gran sabor, consistencia y temperatura sin quemarlo. Hay que tener en cuenta que no debes sumergirla pero es muy fácil de lavar. Se puede usar aún sin los filtros de papel. La recomiendo ampliamente.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Hr2YZkyqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stijn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on June 26, 2023",
                "reviewTitle": "Kapot na 6 maanden",
                "reviewText": "De percolator zorgt voor lekkere koffie!Echter is de machine na 6 maanden al kapot.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stuart Cloete",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 1, 2023",
                "reviewTitle": "Doesn't work in most of the world!",
                "reviewText": "it's 110volts, half-powered and will burn itself up if you simply use an adapter. very inconvenient and expensive to return to las vegas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 4, 2020",
                "reviewTitle": "So easy to use and makes great coffee",
                "reviewText": "The reason I decided on this coffee maker is because your hot coffee doesn’t come into contact with plastic. So far I’m very pleased, it’s easy to use, it’s fast, and it makes great, hot coffee. The pot itself is beautiful, it pours nicely with no dripping...and like I said- no plastic leeching in to our coffee.The pot keeps your coffee warm but I prefer to pour it into a thermos-carafe after it’s done brewing. You can use filters but also fine without; very minimal grounds get through (depending on how fine your coffee is ground obviously) The only (very minor) thing I would change about the percolator is the indicator light- it only comes on after the coffee is done, with no visual sign that shows the pot is on till it’s done it’s brewing cycle. I would recommend this percolator- my husband is buying a 2nd one for his work-home.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Master JOKER",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on June 21, 2017",
                "reviewTitle": "まあ使える",
                "reviewText": "コーヒー豆と水を入れたら勝手に大量にコーヒーを作ってくれるマシンを探していたので購入。特に問題なく大容量のコーヒーがすぐに作れます。気になる点としたら機械部分が丸洗いできないことくらいかな。あと、もうちょっと安いといいな。",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$67.48",
                "sellerName": "Electronics Warehouse Outlet",
                "sellerRating": "4.5"
            }
        ]
    }
}