{
    "remaining_requests": 35843,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Takeya-10310-Patented-Airtight-Silicone/dp/B00FFLY64U",
    "body": {
        "name": "Takeya Patented Deluxe Cold Brew Iced Coffee Maker, 1 Quart, Black",
        "price": "$27.99$20.53$27.99",
        "originalPrice": "",
        "rawPrice": 27.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Takeya-10310-Patented-Airtight-Silicone/dp/B00FFLY64U",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BY9MMPJM"
        ],
        "asinVariationValues": [
            {
                "asin": "B00FFLY64U",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31ia1LGKYFL._SS36_.jpg"
            },
            {
                "asin": "B08BGB9Q62",
                "variationName": "Color",
                "variationValue": "Stone",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31ru2WY3rKL._SS36_.jpg"
            },
            {
                "asin": "B08BH5BGDW",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31rirXtc4sL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $3 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31AhyluvI9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31luZkY9h9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vx6GRPoYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41heTg4XgcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416unEqtsNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SkkjZBPZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1Nvcq4A9dL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Takeya Store",
            "link": "https://www.amazon.com/stores/Takeya/page/BEC0230B-B9DF-4F71-B0F4-46A1222332BB?ref_=ast_bln"
        },
        "brand": "Takeya",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 65456,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 10 hrs 39 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 14. Order within 5 hrs 54 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The Deluxe Cold Brew Coffee Maker is a durable BPA Free Tritan pitcher with an airtight lid and non-slip silicone handle. It produces 4 servings of smooth cold brew with any type of coffee grounds and is less acidic than traditional coffee brewing.",
            "The Fine-Mesh Coffee Filter in this cold brew coffee maker keeps grounds out of your freshly brewed pot - differing from other coffee machines. Tritan plastic withstands hot temperatures if you want a hot cup of coffee. Fits in most refrigerator doors",
            "Premium Bottles and Lids: Our innovative line of insulated hydration solutions come in a range of sizes. We offer water bottles in 18, 24, 32, 40, and 64 oz sizes, beverage makers and pitchers in 1 Qt and 2 Qt sizes",
            "BPA Free Hydration Solutions: From insulated stainless steel water bottles to beverage makers and pitchers, as well as a variety of product accessories, Takeya USA products help you stay cool, refreshed and hydrated for an active, on-the-go lifestyle",
            "Innovative Hydration Solutions: Takeya brings over 55 years of Japanese design heritage to our line of insulated, BPA free water bottles, our sustainable iced tea, fruit infusion, and cold brew pitchers, and our Pickleball bottles and equipment."
        ],
        "description": "Like coffee? Taste the difference with our NEW patented 2 Qt. Deluxe Cold Brew Coffee Maker. The traditional hot coffee brewing process releases undesirable acids and oils, resulting in bitter flavor and acidity that is intolerable to many. With cold brewing, only the naturally delicious coffee flavors are extracted, leaving behind the bitter oils and fatty acids, creating a perfectly balanced, smooth extraction of concentrated coffee. Once brewed, concentrated coffee can be kept fresh in our airtight Cold Brew Coffee Maker for up to 2 weeks and used for both hot and iced coffees. Makes two quarts of concentrated coffee. Proudly made in the USA!",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Cold Brew Coffee Makers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17807784011"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "1 Quarts"
            },
            {
                "name": "Special Feature",
                "value": "Permanent Filter"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Coffee Infuser"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Cold Brew Coffee"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Not Stated"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Product Dimensions",
                "value": "5\"D x 7.5\"W x 9.5\"H"
            },
            {
                "name": "Item Weight",
                "value": "0.8 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 65,456 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,148 in Home & Kitchen (See Top 100 in Home & Kitchen) #1 in Cold Brew Coffee Makers"
            },
            {
                "name": "Brand",
                "value": "Takeya"
            },
            {
                "name": "Included Components",
                "value": "Pitcher, Filter, Lid"
            },
            {
                "name": "Model Name",
                "value": "Cold Brew"
            },
            {
                "name": "Model Number",
                "value": "10310"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Style",
                "value": "Coffee Maker"
            },
            {
                "name": "Capacity 1 Quarts",
                "value": "Material Plastic"
            },
            {
                "name": "Item Weight 0.8 Pounds",
                "value": "Human Interface Input Touchscreen"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "DURABLE PITCHER BODY Made from BPA Free Eastman Tritan. The dishwasher safe, shatterproof pitcher stays stain and odor free brew after brew! FINE MESH FILTER The Takeya ultra-fine mesh filter is designed to brew coffee to perfection. The fine mesh keeps coffee grinds out of your coffee and expertly extracts the best flavor. Plus, it's easy to fill, install and wash. CAFE STYLE COFFEE AT HOME Bring cafe quality cold brew to your kitchen. Available in 1 qt and 2 qt sizes and in three colors (Black, White, Stone) for your cold brew coffee needs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42d393b5-1a1c-4cc4-9352-895369f3f09f.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/761802ef-3d6d-4ba1-a433-b368933e07f9.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f13953dd-c1e9-4dec-82b2-8e625ef214a7.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/79c2d919-e919-4c09-81a7-38847d9f92a6.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a98b09d-a1f3-43c1-9249-447d6a230c14.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9234c888-9ee6-4871-960d-1a6bfbe6b66c.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42d393b5-1a1c-4cc4-9352-895369f3f09f.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/761802ef-3d6d-4ba1-a433-b368933e07f9.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f13953dd-c1e9-4dec-82b2-8e625ef214a7.__CR0,0,600,600_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Aaron",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKMFKUXFAZRTRITTPEANIXBXGKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DE25RXIGB4QK?ASIN=B00FFLY64U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 31, 2022",
                "reviewTitle": "5.0 out of 5 stars Life changing if you drink iced coffee",
                "reviewText": "Game changer? No, try life changer! This thing is awesome... Simple to use, quick to set up, easy to clean, and it is already saving me so much time and money. What's better than all that? Convenience of iced coffee ANY TIME at home. No more going out on weekends just to get coffee, and getting it into me earlier in the day is making me more productive. Options for what beans you can use will expand too vs whatever the coffee place uses, free to change it up or experiment with different roasts.I got the 2qt because I figured with brew time it would last longer between batches, and it's perfect. I feel with the smaller one you would have to empty it right away and begin brewing the next batch to be ready on time, I've had no gaps in it being ready so I highly recommend the 2qt. This is all about making life easier right? The coffee stays nice and fresh all week. I got a container with a seal to store it when it's about half way so I can get the next batch going. I've been using whole beans and works great, no grounds or crumbs, flavor is great, and very strong. I brew it a day and a half - 2 days. Perfect. A 1lb bag gets me 3 brews, so just over 5oz a run, each brew lasts me about a week. If I diluted it more it would last longer. Way cheaper than almost $4 a cup for sure!!!The coffee is so delicious, I love it and enjoy it far more than any coffee I've ever had. I only drank coffee for caffeine, now I find myself wanting it because it's so tasty... It isn't nearly as bitter so you need way less sugar or cream. I usually use a hazelnut creamer and don't even add sugar anymore. I also don't think it's staining my teeth as bad. I didn't know if it would be as strong caffeine wise but oh yes it is! Also, no more straws or single use cups!!! Bought 5 cups with lids so I have one for every work day no matter what.So if you enjoy iced coffee, or better flavor of cold brew, and are like me who drinks ice coffee even in dead of winter you need this! Has already paid for itself!!!",
                "reviewVotes": "84 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denys",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRLL36BLGUDL6RDWIQGLOUKF3TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR8LQI6YG2DON?ASIN=B00FFLY64U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2021",
                "reviewTitle": "5.0 out of 5 stars Finally, a device that makes great cold brew",
                "reviewText": "I'm a cold brew aficionado. I have tried several products to make my own cold brew rather than getting store-bought cold brew and they have all failed and have been returned. Until now. I have had the large Takeya cold brew maker for less than two weeks, but I can tell you, this one is a keeper. I have already made about 10 batches and I'm now having fun trying different coffees. Right now, I am trying 2 blends and comparing.My process is simple, I fill up the pot with filtered water to about an inch from the bottom of the white rim. I load up the filter with coffee ground coarse to the top of the filter. I attach the extension and then the lid, and slowly dunk the filter in the water. I tighten everything and swirl the water around for a minute or two to wet the coffee. Don't shake too hard or tip it around, well, unless you like grounds in your coffee.I leave the Takeya on the counter for the day, swirling it one in a while. At night, I place it in the refrigerator and the next morning I transfer to cold brew to another jar, clean up the Takeya and either make another batch right away or just put it away until the next time. Usually, I start another batch because it doesn't last long.The clean up is pretty quick. I dump most of the grounds directly in the garbage. I know some people use the grounds for other purposes, I don't, but I also don't put them in the garbage disposal. I then clean and dry all the parts with soap and water, rinse, dry and assemble.My observations:1- The extension is sometimes finicky to connect to the filter.2- I'm not sure how sturdy the actual filter fabric is and I treat it very cautiously. Thankfully, it's not an expensive unit and it's made of plastic so it shouldn't shatter.3- Sometimes find a small amount of residue at the bottom, but since I've only been swirling and not shaking, that seems to have mostly gone away. I have had batches with no residue whatsoever. Just gotta be diligent.4- It's actually pretty neat to see the coffee permeate the water over a few hours. I go for about 22-24 hours because I really like my coffee.Highly recommended. Make sure you start with good water and coarse coffee.Update June 2022. I have been using the device every day since I bought it. It's solid and has stood up well. I now brew the coffee for 48 hours. The first 24 hr sees the coffee maker sitting on the counter. It then goes in the fridge for the next 24 hrs. I use very coarse ground coffee from the supermarket. I've tried different roasts and types and I have settled on dark French roast. I fill the maker up to about an inch from the top, put in coffee to fill the basket up to the start of the extension. This works well for me.",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Devanee Guruge",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETKWP4NUEOEAEBG53ZBH3HB4HIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14A6R1JSPXU09?ASIN=B00FFLY64U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Great tasting cold brew on a budget!",
                "reviewText": "This cold brew maker is phenomenal, the instructions however are misleading - do not fill up the entire filter section with coffee grounds, after tons of trial and error I found that filling it 1/3 up gave a great amount of strength and flavor. When I filled it up entirely my coffee turned out extremely bitter and overly strong, keep in mind I only use bold and dark coffee grounds as its the flavor profile I enjoy the most.It is super easy to use, and gives me two cups full of 24oz iced cold brew before I have to refill it! Highly recommend for making your own cold brew at home.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLWB4ZBMJTNYQYDFG7NVBE4AIUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FYFV8WIPS0N4?ASIN=B00FFLY64U",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Does exactly what I want with one downfall...",
                "reviewText": "It works. The spout is good. It is easy to use and easy to clean. I consistently use it all the time.Except it leaves coffee grounds in it. They are easy enough to filter out if you rebottle the coffee and use a funnel and coffee filter. They are also easy to leave in the coffee pitcher as they sink to the bottom and you can carefully leave a tiny bit of coffee in the bottom with the grounds.It would be a perfect piece if it kept the ground coffee out completely. That being said, I have never found a cold brew system that keeps coffee grounds completely out. Maybe that is simply the cost of making cold brew at home.The price is right, it works. I am satisfied with my purchase and will use it until the filter fails.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kwam!",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNOBSMENLEI6FP4LH5XBIZXL2WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HEBRLN04P1RY?ASIN=B00FFLY64U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Works Great!",
                "reviewText": "I was skeptical at first but it works great! Easy to clean. Easy to make. Easy to store. I’d recommend the bigger one if you need to make 40oz or more a day (1-3 people who drink coffee). I haven’t had any hassle and it’s made with a quality build!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dante",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 8, 2023",
                "reviewTitle": "Práctica y fácil de usar",
                "reviewText": "Es muy fácil e intuitivo su uso, el filtro funciona muy bien, los residuos del café en el líquido son nulos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "André de Sousa Costa Filho",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 1, 2023",
                "reviewTitle": "Excelente",
                "reviewText": "Comprei para fazer café gelado. Pare de comprar na Starbucks, muito melhor e obviamente mais barato",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "janis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 25, 2023",
                "reviewTitle": "Easy to use",
                "reviewText": "I have tried this a few times now and I am enjoying it very much. I did check on line for advice before starting and there were good ones on YouTube.The coffee is nice and smooth and can be drunk cold or heated up . Do ensure you can store it in your fridge. I found that it was helpful to decant into a jug before it was finished so that the coffee maker can be cleaned and the next brew started. I found 36 hours in the fridge was sufficient.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ross",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 26, 2022",
                "reviewTitle": "Looking for something more robust? This one fits pretty well!",
                "reviewText": "This is my second purchase of a cold brew coffee maker. But not the same as my previous one.The old one I had was made out of glass and unfortunately, it was pretty thin and lasted for a year and a half. It developed a crack near the lid on top. So I decided to get a new one before the crack propagates to the bottom of the glass jug. This was an item with a decent amount of reviews and was ranking 4.5 stars.This item exceeds the previous cold brew maker in terms of rating by the number of reviews and roughly the same ranking.What do I like?It is made out of plastic, but of high quality and should last longerThe lid completely closes the container so there is no chance of spilling.Much quicker to completely soak the coffee grounds all that is needed is to give it a good shake. Most items in this category usually need stirring.Everything just screws on.What I dislikeThe instructions mention if you want to make it more concentrated it is recommended to pull the filter out and drain the remaining liquid into the rest of the concentrate for 45mins. But there is no easy way to do that unless you have a separate container where you can pour the concentrate and for the filter to rest above it.Because this a close and shake cold brew maker would imagine the rubber seal will be the first thing to go. But im sure that can be easily replaced.I have not given a flavour rating as I think it is irrelevant to this item because you're never going to get apple to apple comparison between other individuals who have written a review. But what I will say in comparison to my old one, the ratio between coffee and water seems higher than my previous one which required 1.1L to 80g of coffee. The instructions for this item require around 950ML to 108g of Coffee so it is more concentrated.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meghan Hale",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 19, 2020",
                "reviewTitle": "A huge money saver!",
                "reviewText": "Honestly, I love this product.I’ve been spending so much money buying iced coffee at coffee shops when this helps my coffee taste even better, while also saving me a lot of money.Pros:- it makes a great tasting cup- it’s easy to clean and easy to use- it keeps coffee at good temperature and distributes it wellCons:- I wish it was bigger. It makes enough for about 3 cups each time.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$27.50",
                "sellerName": "AMN PRODUCTS",
                "sellerRating": "4.5"
            },
            {
                "price": "$27.98",
                "sellerName": "mlee's store",
                "sellerRating": "5"
            }
        ]
    }
}