{
    "remaining_requests": 35759,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Primula-Stainless-Steel-Espresso-Maker/dp/B00263JWD0",
    "body": {
        "name": "Primula Premium Stainless Steel Stovetop Espresso and Coffee Maker, 6-Cup",
        "price": "$29.99",
        "originalPrice": "$29.99",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Primula-Stainless-Steel-Espresso-Maker/dp/B00263JWD0",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09PN9XH9L"
        ],
        "asinVariationValues": [
            {
                "asin": "B00263JWBW",
                "variationName": "Style",
                "variationValue": "4-Cup Black Handle",
                "price": "$35.56",
                "variationImageURL": ""
            },
            {
                "asin": "B00263JWD0",
                "variationName": "Style",
                "variationValue": "6-Cup Black Handle",
                "price": "$29.99",
                "variationImageURL": ""
            },
            {
                "asin": "B095VJYR5S",
                "variationName": "Style",
                "variationValue": "6-Cup Wood Look Handle",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31t8OgdCuJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41vitMqzYHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518s3U-fQZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41edavzLiIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zecv 1UOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Z9mMzRxUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LFoJYE6LL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Primula Store",
            "link": "https://www.amazon.com/stores/Primula/page/E89DCA0C-875A-4969-A27D-A75BADDD08E3?ref_=ast_bln"
        },
        "brand": "Primula",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1631,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 8 hrs 26 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Note: 1)Too coarse a grind, too little coffee, or insufficiently tamping the grounds before brewing can all lead to inadequate pressure for a proper brew. 2)It is important to note that the amount of espresso extracted will vary depending on the grind size and amount and reprogramming may be needed when the size and amount are adjusted",
            "BETTER BREWING - Primula’s Premium Stainless Steel Espresso Coffee Maker is compact, easy to use and delivers 6 demitasse/espresso servings of fresh, aromatic espresso in one pot. Enjoy smooth, delicious stovetop espresso brewed within minutes from home",
            "EASY-TO-USE - Simply fill the lower chamber with water, fill the filter with ground coffee, and place it on the stovetop. Within minutes, delicious, bubbling espresso will fill your pot. Remove from heat and enjoy",
            "HIGH-QUALITY STAINLESS STEEL - Provides even heat distribution for enhanced flavor and aroma. Features a flip-top lid and temperature-resistant silicone comfort grip thumb press and handle for safe and easy pouring",
            "CRAFT ANY RECIPE YOU LIKE - Traditionally used for espresso, Cuban coffee or Moka, it can also be used as a stovetop coffee percolator for American coffee. Add steamed or frothed milk to craft cappuccinos, lattes, americanos, macchiatos, mochas and more",
            "WORKS WITH ALL STOVETOPS: Works on all electric, ceramic and gas stovetops, including propane, making it the perfect camping accessory. We recommend to hand wash with soap to ensure long-lasting quality"
        ],
        "description": "Primula’s stainless steel Espresso Coffee maker allows you to brew authentic robust espresso right from your very own stovetop. Stovetop espresso makers are popular because you can make quality espresso without the hassle of electric espresso machines. This Espresso maker takes up very little counter space, is easy to use, and delivers fresh, aromatic espresso within minutes. Primula’s stainless steel model includes an oversized silicone handle which keeps the soft grip cool and allows for easier handling and pouring. The stainless steel design provides even heat distribution for enhanced flavor and aroma. Included in each box are easy step by step instructions so even a beginner can make a perfect cup of espresso the very first time. Simply fill the lower chamber with water, Fill the filter with finely ground Coffee, and place on medium heat atop your stove. Within minutes, delicious, bubbling Cups of espresso will fill your pot. Remove from heat and enjoy, or add some milk for tasty cappuccinos, lattes or mochas. This Espresso maker features a safety-release valve to control the water pressure, A major factor in controlling the quality of your espresso. If there is not enough pressure delivered to your coffee grounds, your espresso will be under-extracted, while the flip side of Too much water pressure causes over-extraction. Primula’s design allows you to make the perfect shot of espresso without worry as the safety release valve controls the pressure at a set, pre-determined level. This sturdy espresso machine is carefully crafted of Stainless steel and features a stay cool silicone knob on the Flip-Top lid for easy, safe dispensing.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Stovetop Espresso & Moka Pots",
                "link": "https://www.amazon.com/Stovetop-Espresso-Moka-Pots/b/ref=dp_bc_aui_C_4?ie=UTF8&node=14163721"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "6 Cups"
            },
            {
                "name": "Special Feature",
                "value": "Easy to Use for Perfect Espresso at Home, Non-Drip Spout, Stainless Steel Valve, Fine Filter Funnel, Make espresso, Cuban Coffee, Moka or American Coffee, Makes 6 Demitasse/Espresso Servings, Ceramic, Gas and Electric Stovetop Compatible See more"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Moka Pot"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "American Coffee, Craft Coffee Maker, Home Brew, Espresso, Camping"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gift for someone who has everything, Moka Pot, Espresso, Coffee, Camping"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Wattage",
                "value": "1000 watts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Material",
                "value": "Stainless Steel, Silicone"
            },
            {
                "name": "Exterior Finish",
                "value": "Metallic"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Style",
                "value": "6-Cup Black Handle"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,631 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#156,651 in Home & Kitchen (See Top 100 in Home & Kitchen) #64 in Stovetop Espresso & Moka Pots"
            },
            {
                "name": "Brand",
                "value": "Primula"
            },
            {
                "name": "Included Components",
                "value": "Espresso Maker"
            },
            {
                "name": "Model Name",
                "value": "Primula"
            },
            {
                "name": "Model Number",
                "value": "Primula"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Product Dimensions",
                "value": "6.75\"D x 5.25\"W x 8.75\"H"
            },
            {
                "name": "Item Weight",
                "value": "1 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Capacity 6 Cups",
                "value": "Material Stainless Steel, Silicone"
            },
            {
                "name": "Item Weight 1 Pounds",
                "value": "Wattage 1000 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Espresso Your Love with the Primula Espresso Maker The Base of Many Coffee Drinks Espresso is the main ingredient in a variety of popular coffee drinks like lattes, cappuccinos, macchiatos, mochas, frappes and americanos. Save Money Save yourself from trips to expensive coffee chops and make your favorite espresso drinks at home. The Primula stainless steel espresso maker makes flavorful coffee in minutes! Easy to Clean and Easy to Use Even a beginner can make a perfect cup of espresso! The Primula Stainless Steel Espresso Maker is easy to clean and easy to use in a few simple steps. Fill the base with water, fill the filter with coffee, secure the top and then place on the burner until the coffee has percolated. Contemporary stainless steel design Safety release valve technology controls water pressure for perfect espresso Easy instructions included to make the perfect espresso Easy to clean",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b0c2a76-b692-496b-96b4-e30e4913dca8.__CR238,287,1538,1538_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "How to Make the Perfect Espresso Step 1 To start, unscrew the top part of the espresso maker with the handle from the bottom part of the espresso maker and remove the funnel that nests inside the base of the espresso maker. Step 2 Next, fill base with water to the level of the safety valve. Replace the funnel into the base and fill it with ground coffee; do not press coffee down. For best results, use fresh roasted, finely ground coffee. The recommendation is to use a 6-to-1 water to coffee ratio. For each tablespoon of coffee, use 3 oz. of water. Step 3 Tighten the top to the base. Make sure the top is completely secure on the base before putting on the stovetop. Step 4 Heat espresso maker on low to medium temperature until coffee bubbles on top. Remove from heat and serve.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/73f750f8-8977-4a7a-81fa-e01e3d8428c3.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a09560b9-9163-4e69-a94f-b57bbd4e0743.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fd24bab3-1cf1-4d7b-84ce-21886ab5aeaf.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/870d66a2-5a08-401e-967b-dd51405bbdd3.__CR0,0,2000,2000_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Make All of Your Favorite Coffee Beverages with the Primula Espresso Maker The novice coffee drinkers to the most serious coffee lovers will love this easy to use espresso maker- perfect for making all kinds of coffee drinks. Of course, you can visit your neighborhood coffee shop to enjoy some coffee, but making it at home is so easy and inexpensive, why not do it yourself? Using a moka pot/espresso maker is nothing more than filling the base with water, filling the filter with coffee and then percolating your coffee until it is ready to serve. From there, you can drink it straight as a shot or you can make affogatos, americanos, frappes and much more all with this espresso maker.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b98b981c-d269-41f1-be3f-80fb76b79331.__CR231,350,1538,1538_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d29bb6f8-106a-4fc0-9cfd-b9bbe8268721.__CR0,0,600,180_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b0c2a76-b692-496b-96b4-e30e4913dca8.__CR238,287,1538,1538_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/73f750f8-8977-4a7a-81fa-e01e3d8428c3.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a09560b9-9163-4e69-a94f-b57bbd4e0743.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fd24bab3-1cf1-4d7b-84ce-21886ab5aeaf.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/870d66a2-5a08-401e-967b-dd51405bbdd3.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b98b981c-d269-41f1-be3f-80fb76b79331.__CR231,350,1538,1538_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joseph",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNOSFIJQL3EFAH4EQYQJMHH7VSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20JWFRMJWLUY4?ASIN=B00263JWD0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2015",
                "reviewTitle": "5.0 out of 5 stars This review is for the Primula Stainless Steel Stovetop Espresso Maker 6 cup model, found a winner.",
                "reviewText": "Even though it has only been one day that I have had this, I feel confident in its build quality and am convinced that it is an excellent value at $23. I can tell the handle will not and is not meant to withstand any torque as a result of joining or dismantling the unit. It is meant to hold the unit, and allow pouring and that is it. The reservoir holds 8oz, no more on this 6 cup model. Do not put more than that in the reservoir or you may have problems such as leaks. It is the perfect amount for 2 cups with steamed or warmed/frothed milk. I used some old freezer beans for my first run, I was also using a new hand grinder so I am still getting used to the grind settings. It was a fine grind, I tamped lightly. The first pot smelled fantastic! but I dumped it down the drain and waited for things to cool down to clean things up and go again. This time with a french roast bean and a slightly more coarse grind but still fine. Assembled the halves being sure that there were no loose grinds to interfere with the 2 parts joining properly and put it on the heat. I preheated the water this time and it started brewing a little faster. It gives the same auditory signals that an electric espresso machine gives, the sputtering means it is about done and remove it from the heat when it is mostly silent. It was a fantastic cup of espresso, well cappuccino I suppose, just like I remember from my old machine. This type of coffee making takes some attention to detail and careful execution to be successful. It is not a set it and forget it kind of thing. You are committed to the process for about 12 minutes, depending on your heat source and barista skills. Of course once you have enjoyed your Java, you have to clean the unit and dry it for best results.I experienced no leaks, no surprises just a splendid cup of espresso. The unit is easy to clean, no soap just hot water and brush or cloth. maybe occasionally remove the silicone ring(takes a little effort) and give the filter a good cleaning especially if it ever gets left for extended periods after use. I use baking soda to remove any stains where coffee is involved.I will add any updated information as time goes by but for now I have full confidence in this product and recommend it to anyone who is looking for an economical way to make espresso that is full stainless steel. Seeing how things have changed in the last few years where old time quality has given way to new world garbage, it is refreshing to see that a quality item can still be had for a decent price amongst all the inferior options.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Japanese Chin lover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVRQ4FXDSSURCZBJ7TYSOGAHBMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S1AZKMYL9X8K?ASIN=B00263JWD0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 16, 2022",
                "reviewTitle": "5.0 out of 5 stars Good latte!",
                "reviewText": "I’ve used a French press for years, and have been very happy with it. However, I became interested in the possibility of acquiring an espresso machine, but the size, cost and complicated use of one discouraged me. I came across Moki pots and thought one might be a great alternative. I didn’t want one made of aluminum due to health risks. This pot is stainless steel. It cleans as easily as my French press with only water. An added plus is the coffee basket uses only half the coffee I have to use in my French press. While one can use espresso coffee, I am very pleased with the taste of medium roast 100% arabica beans. I have an Oxo coffee grinder capable of a very fine grind, a big help in getting full flavor. I’ve added a frothing machine and enjoy a latte every morning. The pot is well designed. The big plastic handle and ear on its lid have prevented my being burned. It feels substantial and easy to hold despite being small. I have a ceramic top stove, and wondered if it would heat properly given that the bottom is not flat. Instead, it has a circular outer ridge which slightly lifts the center area from the stovetop, but it heats up well. I hope it lasts a long time, as I do like it. I’d look for this brand again if I needed a replacement.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mitchbob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGU6EQRNTEIBRAOJYVSEFIZN4TWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R236KZLF6G6F61?ASIN=B00263JWD0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2018",
                "reviewTitle": "5.0 out of 5 stars A great, affordable \"moka pot\"",
                "reviewText": "My wife wanted a home espresso maker so she could quit her $4.50/day Peet's habit, and before spending big bucks on a fancy machine, she wanted to try a simple stovetop \"moka pot\" to see how she'd like it. She's delighted - at how simple it is to make espresso with the Primula, the quality of the espresso, and how much money *and* time she's saving vs. her daily trip to Peet's. And as the home dishwasher and repair person, so am I: the Primula is simple, solid, easy to clean, and I'm spared what could be endless headaches trying to keep a less than top of the line semi-automated espresso machine working. And now that we're sticking with the Primula, I wanted to find out if there are replacements available for the gasket, the one part that can wear out - and there are, available on Amazon, and they fit perfectly: Primula Replacement Silicone Gasket for Stainless Steel 6 Cup Stovetop Espresso Maker, Set of 3 . A very satisfying purchase! If you're in the San Francisco Bay Area, Caffe Trieste espresso grind is a good choice for coffee; it works well in the pot.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ismael ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYBYTAAV4X3KJS7KC34CO2ME5BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OYK0SFUSU4AG?ASIN=B00263JWD0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Makes really good coffee",
                "reviewText": "Dislike that handle get hot to handle. Used to make coffee",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KWF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4O4RKULKE5N5GLPVBRV6NH5JTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WBD9RV50005A?ASIN=B00263JWD0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Use this daily.",
                "reviewText": "Stainless steel is healthier than aluminum.Great quality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ShoppingMom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJKG7FO4YAHZIF3DA44AXTV3DCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VLHV0LSUBAKA?ASIN=B00263JWD0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2017",
                "reviewTitle": "5.0 out of 5 stars Espresso as good as any fine coffee establishment! You won't be disappointed. Easy for anyone to use.",
                "reviewText": "This is exactly what we needed! This little gem of an espresso maker works perfectly with easy clean up and the most important part, it's all stainless steel so it won't leach aluminum into your drinks or your body! IT is so easy to use. You fill the bottom with water, fill the removeable filter with espresso coffee like LavAzza which is awesome, and put it on the stove top for a few minutes, mine is a gas stove. It rinses clean in seconds and looks nice on the counter top for daily use. My son has made lattes with frothed milk and added syrups and a little whipped topping and says that it is as good as any he has purchased. I'm not much for sweetened drinks and I use only full fat cream, I use 2 oz full fat cream warmed and 3 oz espresso and it is fantastic! We couldn't be happier and from the reviews I read on counter top machines, this seems like the way to go. We have 4 coffee drinkers in the house so we use K-cups, a french press and now this. My poor old coffee pot sits unused unless we have a large gathering. Thank you for this quality Primula espresso maker!",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edgar Alberto Morales Gutiérrez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 13, 2022",
                "reviewTitle": "Café rápido",
                "reviewText": "Fue un regalo para mi mamá, dice que el café se hace muy rápido y hasta ahora ningún problema",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "padmasree Adsumillipadmasree Adsumilli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 26, 2022",
                "reviewTitle": "Why is the not yet picked as the scheduled date is 22nd Dec 2022",
                "reviewText": "The lid is not closing properly and it's a new piece, requested for return but not picked and no information regarding that which is an immediate requirement. Please respond and resolve the issue",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Zajj1nkqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "CAC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on September 9, 2022",
                "reviewTitle": "Coffee tasted diluted",
                "reviewText": "I’m not sure how this differs from the one I owned, before but my daughter and I both agree the brew results in a more diluted tasting coffee. Also sometimes the threads don’t line up great on top or bottom and the coffee bleeds through the middle instead of percolating through the top as it should, so I always have to double check.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ThomasF",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 22, 2020",
                "reviewTitle": "good quality",
                "reviewText": "solid steel, closes well, ideal size",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Fernando Perez Garza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 16, 2022",
                "reviewTitle": "Buen producto a un precio justo",
                "reviewText": "El cafe se prepara rapidamente con un excelente sabor y aroma.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}