{
    "remaining_requests": 35717,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Espresso-Professional-Removable-Cappuccino-Macchiato/dp/B09X3WGJ3R",
    "body": {
        "name": "CASABREWS Espresso Machine 20 Bar, Professional Espresso Maker with Milk Frother Steam Wand, Compact Coffee Machine with 34oz Removable Water Tank for Cappuccino, Latte, Gift for Dad or Mom",
        "price": "$139.99",
        "originalPrice": "$139.99",
        "rawPrice": 139.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Espresso-Professional-Removable-Cappuccino-Macchiato/dp/B09X3WGJ3R",
        "soldBy": {
            "sellerID": "APX7AIVJ8I4ES",
            "name": "CASABREWS",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=APX7AIVJ8I4ES&asin=B09X3WGJ3R&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CKXFN9GN"
        ],
        "asinVariationValues": [
            {
                "asin": "B09X3WGJ3R",
                "variationName": "Color",
                "variationValue": "A-Silver",
                "price": "$139.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41L7sFdNXGL._SS36_.jpg"
            },
            {
                "asin": "B0BQ6PPQGZ",
                "variationName": "Color",
                "variationValue": "Creamy",
                "price": "$169.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41OMT-1n0VL._SS36_.jpg"
            },
            {
                "asin": "B0CD7HS2DT",
                "variationName": "Color",
                "variationValue": "Deep Black",
                "price": "$169.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41LtrVq6+5L._SS36_.jpg"
            },
            {
                "asin": "B0CMSTQHMD",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "$159.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41fcDcdrcEL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "20",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/416gKJh19ML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51tbRRj7YJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PWI9ncoTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tne-PILtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YDkWIMTfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415umo3MW8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91LhMlbhNsL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1YPaB7T8bL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/913oBsueNEL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the CASABREWS Store",
            "link": "https://www.amazon.com/stores/CASABREWS/page/14F391A1-3BAC-4923-A9CF-C126B52803C3?ref_=ast_bln"
        },
        "brand": "CASABREWS",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1548,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 1 hr 19 mins",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "☕【Make Your Favorite Espresso Coffee At Home】: The CASABREWS coffee machine with milk frother allows you to prepare all your favorite espresso-based coffees. You can enjoy a barista-brewed latte, cappuccino or macchiato at home. Stainless steel appearance, stylish and durable, ideal for any size kitchen. This compact espresso coffee maker is not only perfect for home or office use, but also makes a great wedding gift, birthday gift, christmas gift, gift for mom, gift for dad and gift for wife.",
            "☕【Professional 20-Bar Pressure System】: Semi-Automatic 2-in-1 Espresso Maker, with 20-bar professional Italian pump and 1350W powerful boiler. This latte machine gives you top quality extraction, resulting in a more fragrant and rich aroma. The built-in pressure gauge on this cappuccino machine shows the exact pressure helping you make adjustments according to your personal taste preferences. You can create a cappuccino, latte or flat white at your home or office with our cappuccino maker.",
            "☕【Milk Frothing System】: Our espresso machine with milk frother has a powerful steam wand, so you can texture creamy, rich microfoam milk to create amazing milk foam art and enhance the flavor of your brews. Awaken your inner barista and create your own unique milk foam art. Don't pass us by if you are looking for an excellent espresso coffee maker.",
            "☕【COMPACT, STYLISH & PRACTICAL】: The beautiful and compact design makes this small espresso machine suitable for any size kitchen. Make single or double espresso shots with a beautiful layer of crema in minutes! The 34 oz water tank allows you to brew multiple cups, and it is detachable for easy refilling. Included components: Espresso Machine, 34 oz Removable Water Tank, One Cup Brewing Filter, Two Cup Brewing Filter, Portafilter, Tamper With Spoon, Instruction Manual.",
            "☕【Our Promise To You】: We are a US-based company and we care about our customers! If you're not happy, we're not happy. We want you to buy our espresso maker with confidence, so we provide 1 Year Warranty and if we can be of assistance in any way, please don't hesitate to contact us. Note: You can watch more INSTRUCTIONAL VIDEO by clicking Visit the CASABREWS Store.",
            "☕【Useful Tips】: Please kindly note that do not brew coffee immediately after frothing milk. The machine must cool down first otherwise the temperature and the pressure inside the machine will be too high, and the machine will go into over-heating protection mode. The lights for 1 cup or 2 cup will flash repeatedly and please follow the steps of included guide to cool down the machine. You can watch more INSTRUCTIONAL VIDEO by clicking Visit the CASABREWS Store."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Espresso Machines",
                "link": "https://www.amazon.com/Espresso-Machines-Coffee-Tea-Kitchen/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289748"
            },
            {
                "name": "Semi-Automatic Espresso Machines",
                "link": "https://www.amazon.com/Semi-Automatic-Espresso-Machines-Coffee-Tea/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14162661"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "34 Fluid Ounces"
            },
            {
                "name": "Special Feature",
                "value": "Latte Machine, Latte Maker, Brushed Stainless Steel Coffee Machine, Cappuccino Machine, Cappuccino Maker, Expresso Maker for Home or Office, You can watch more INSTRUCTIONAL VIDEO by clicking Visit the CASABREWS Store, Espresso Maker, Espresso Machine with Milk Frother, Espresso Machine With Milk Frother Steam Wand See more"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Espresso Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Hot Water Function: Please turn on the machine. When the machine has finished preheating, turn the knob on the side to the WATER position to let the hot water come out. When 1 cup and 2 cup buttons are alternately flashing and the machine doesn’t work, please use hot water function to let the hot water come out for 20 seconds to cool down the machine. When the pump can not draw any water from the water tank, please re-install the water tank, use hot water function to let the hot water come out for 20 seconds. When the machine won't stop beeping, 1 cup/2 cup/steam buttons are flashing simultaneously, please turn the steam knob back to the OFF position. If You Find the Pressure is Low, Please Adjust the Grinder to a Finer Setting, Add More Coffee Grounds Into Filter or Increasing the Tamping Pressure"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Valentines Day Gifts for Him, Valentines Day Gifts for Her, Valentines Day Gifts, Boyfriend Valentines Day Gifts, Mens Valentines Day Gifts, Womens Valentines Day Gifts, Husband Valentines Day Gifts, Valentines Day Gifts for Wife, Valentines Day Gifts for Daughter, Valentines Day Gifts for Mom, Valentines Day Gifts for Boys, Valentines Day Gifts for Girlfriend, Men Valentines Day Gifts, Valentines Day Gift for Her, Wife Valentines Day Gifts, Cappuccino Maker, Latte Machine, Latte Maker, Making Espresso, Cappuccinos, Lattes, Macchiatos at Home, Espresso Machine, Cappuccino Machine or Latte Machine for Home or Office Use, Makes a Great Wedding Gift, Birthday Gift, Christmas Gift, Gift for Mom, Gift for Dad, Gift for Wife, Gift for Coffee Lovers, Coffee Lovers Gift Ideas, Gift for Women, Gift for Men"
            },
            {
                "name": "Operation Mode",
                "value": "Semi-Automatic"
            },
            {
                "name": "Wattage",
                "value": "1350 watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts (AC)"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Product Dimensions",
                "value": "12.28\"D x 5.9\"W x 11.97\"H"
            },
            {
                "name": "Item Weight",
                "value": "8.59 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,548 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,078 in Home & Kitchen (See Top 100 in Home & Kitchen) #1 in Semi-Automatic Espresso Machines"
            },
            {
                "name": "Brand",
                "value": "CASABREWS"
            },
            {
                "name": "Included Components",
                "value": "1*Instruction Manual, 1*Espresso Machine With Milk Frother, 1*34 oz Removable Water Tank, 1*51mm One Cup Filter, 1*51mm Two Cup Filter, 1*51mm Portafilter, 1*Tamper with Spoon"
            },
            {
                "name": "Model Name",
                "value": "CM5418BC-UL"
            },
            {
                "name": "Model Number",
                "value": "CM5418-US"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "High Quality Box"
            },
            {
                "name": "Material",
                "value": "Brushed Stainless Steel"
            },
            {
                "name": "Exterior Finish",
                "value": "Stainless Steel"
            },
            {
                "name": "Color",
                "value": "A-Silver"
            },
            {
                "name": "Style",
                "value": "Button"
            },
            {
                "name": "Capacity 34 Fluid Ounces",
                "value": "Material Brushed Stainless Steel"
            },
            {
                "name": "Item Weight 8.59 Pounds",
                "value": "Wattage 1350 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Note: Please find the user guide and trouble shooting guide on our “Product guides and documents” page that will help you use our espresso machine correctly.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/41785e5b-48d9-4541-9182-45b1cb1d53be.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page Stainless Steel Design The beautiful brushed stainless steel design makes this latte maker suitable for any size kitchen Heated Cup Holder The heated metal plate on top of the machine can preheat two coffee cups at the same time 20-Bar Italian Pump Our espresso machine lets you make full-bodied, creamy espresso with its 20-bar pressure pump system Powerful Steam Wand The powerful steam wand allows you to adjust the milk temperature and texture to suit your tastes 34 oz Water Tank The water tank is removable, it is easy to refill and reattach, and the water level is visible Next page 1 Compact Design 2 Cup Warmer 3 20-Bar Italian Pump 4 Powerful Steam Wand 5 Removable Water Tank",
                "media_link": []
            },
            {
                "media_text": "Note: Too coarse a grind, too little coffee grounds, or insufficiently tamping the coffee grounds before brewing can all lead to inadequate pressure for a proper brew. The amount of espresso extracted will vary depending on the grind size and amount.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c068aff7-178d-41d2-89df-51074f74961a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Why Choose CASABREWS Espresso Machine CM5418! a.With 20-bar professional Italian pump, it gives you top quality extraction, resulting in a more fragrant and rich aroma. b.With built-in pressure gauge, it shows the exact pressure helping you make adjustments according to your personal taste preferences. c.It has a powerful milk foaming steam wand, so you can texture creamy microfoam milk to create amazing milk foam art and enhance the flavor of your brews. d.It makes a great gift for all of your loved ones. How to Cool Down the Machine? Why doesn't machine work, only 1 cup and 2 cup buttons are alternate flashing? If the 1 CUP/2 CUP indicators are flashing simultaneously and rapidly after the 1 CUP/2 CUP button is pressed, and you are unable to brew coffee, it indicates that the over-temperature protection is triggered. PLEASE turn the knob on the side of the machine to the WATER position to let the hot water come out for 20 seconds, and then return the knob to the OFF position. When the boiler is cooled down, you can brew the coffee again. PLEASE do not brew coffee immediately after frothing milk. How to Stop Beeping? Why won't machine stop beeping, 1 CUP/2 CUP/STEAM indicators are flashing? When turned it on, the machine won't stop beeping. 1 CUP/2 CUP/STEAM indicators are flashing simultaneously and buttons don't work. It may indicate that the knob on the side of the machine is switched to the STEAM position. PLEASE turn the knob back to the OFF position. Then the machine will stop beeping and work normally. How to Pump Water? Why does the machine keep running with no coffee or water coming out? If the espresso machine is running normally, but there is no coffee or water coming out, it means that the pump can not draw any water from the water tank. PLEASE re-install the water tank 2-3 times. Turn on the machine and turn the steam knob to the WATER position to let the hot water come out for 20 seconds. Then return the steam knob to the OFF position. How to Set the Volume? You can set the volume of the 1 cup and 2 cup according to your needs. Set the volume of 1/2 cup: 1.Press and hold the 1/2 CUP button for 3 seconds. Then hear a beep. Press the 1/2 CUP button again. The coffee will start to dispense. 2.When the desired amount is reached, press the 1/2 CUP button. You are done with the volume setting for a 1/2 cup. Reset the default volumes: Simultaneously press and hold the 1 CUP and 2 CUP buttons for 3 seconds to restore to default dispensing amounts.",
                "media_link": []
            },
            {
                "media_text": "What should I do if I have trouble with the espresso machine? If the package is DAMAGED or MISSING ACCESSORIES, or the machine is DEFECTIVE, please contact for help and we are always here to help you! Also please find the user guide and trouble shooting guide on our “Product guides and documents” page. How to get the ideal pressure? If the pressure is too low, please use finer coffee grounds, add more coffee grounds in the filter or increase the tamping pressure to try. If the pressure is too high, please reduce the amount of coffee grounds or reduce the tamping pressure to try. Is there a user guide for me? We will send some documents to help you maintain and use the machine better. Please find the user guide and trouble shooting guide on our “Product guides and documents” page. It will help you a lot. Any problem please feel free to contact for help. What should I do if I receive a used machine? Sometimes, the returned machine by other customer may be sent by mistake. If you have received a used machine, please contact for replacement in time! Don't worry, we will try our best to help you until the problem is solved. I pressed \"2 cup\" button for a few moment but no water is flowing out, why? If you can't brew coffee or water at first time, please make a first use cycle according to user guide. Also, this problem may caused by the water tank is not be placed properly, please remove the tank and install it again for a few times.",
                "media_link": []
            },
            {
                "media_text": "Choose the type of the CASABREWS espresso machine you like! 20 Bar Espresso Machine Add to Cart 20 Bar Espresso Machine Add to Cart 20 Bar Espresso Machine Add to Cart 20 Bar Espresso Machine See Details 20 Bar Espresso Machine Add to Cart 20 Bar Espresso Machine Add to Cart 20 Bar Espresso Machine Add to Cart Customer Reviews 4.4 out of 5 stars 1,548 4.0 out of 5 stars 24 4.3 out of 5 stars 258 4.3 out of 5 stars 23 4.4 out of 5 stars 481 4.4 out of 5 stars 116 4.8 out of 5 stars 8 Price $139.99$139.99 $449.99$449.99 $499.99$499.99 — $129.99$129.99 $139.99$139.99 $179.99$179.99 Pump Pressure 20 Bar Italian ODM Pump 20 Bar Professional ODM Pump 20 Bar Italian ODM Pump 20 Bar Professional ODM Pump 20 Bar Professional Pump 20 Bar Italian ODM Pump 20 Bar Italian ODM Pump Milk Frother Manual Milk Frother Steam Wand Manual Milk Frother Steam Wand Manual Milk Frother Steam Wand Manual Milk Frother Steam Wand Manual Milk Frother Steam Wand Manual Milk Frother Steam Wand Automatic Milk Frother Water Tank Capacity 34 oz 92 oz 92 oz 92 oz 49 oz 49 oz 49 oz Wattage 1350W 1500W 1500W 1500W 1350W 1350W 1350W Compatible Ground Coffee Ground Coffee Or Coffee Beans Ground Coffee Or Coffee Beans Ground Coffee Or Coffee Beans Ground Coffee Ground Coffee Ground Coffee Dimensions( inches) 5.9\" x 11.97\" x 12.28\" 12.8\"x11.2\"x16.5\" 12.8\"x11.2\"x16.5\" 11.3\" x 12.9\" x 16.3\" 5.7\"*12.6\"*12.2\" 5.7\"*12.6\"*12.2\" 8.7\"*12.6\"*12.2\" Steam Pipe Material Stainless Steel Stainless Steel Stainless Steel Stainless Steel Stainless Steel Stainless Steel Stainless Steel Gift Wrap Available ✔ ✔ ✔ ✔ ✔ ✔ ✔",
                "media_link": []
            },
            {
                "media_text": "Previous page Great Choice for Gift-giving! CASABREWS Coffee Machine - The Best Choice for Gift-giving!! Great Gifts for Men and Women! Gifts for Him, Gifts for Her, Anniversary Gifts, Boyfriend Gifts,Gifts for Husband, Mens Gifts. Great Gifts for Friends! Friendship Gifts, Graduation Gifts, Birthday Gifts, Tech Gifts, Electronics Gifts, Teacher Gifts. Great Gifts for Mom and Dad! Mom Gifts, Mom Birthday Gifts, Birthday Gifts for Dad, Gifts for Dad from Daughter, Gifts for Dad. Great Gifts for Holidays! New Year's Day Gifts, Valentine's Day Gifts, Easter Gifts, Thanksgiving Gifts, Christmas Gifts. Next page 1 Best Gift 2 Gifts for Men and Women 3 Gifts for Friends 4 Gift for Mom and Dad 5 Gifts for Holidays",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/41785e5b-48d9-4541-9182-45b1cb1d53be.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/976a8c70-ea80-4b4d-8843-04ba05015ad0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/32e1b6b9-1ca7-43d1-9275-4f9feaafaa70.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/acbfad77-d650-4d41-96f4-94badd1a18eb.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/694fb8e6-0d86-4271-ae39-0f87f83fb880.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fdacd9e1-7dfb-45db-877d-2933931a3eed.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c068aff7-178d-41d2-89df-51074f74961a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3fda133-ab3a-4af6-a5c5-015d034b053f.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/47268657-d370-451c-9e5a-2a1867dd6c50.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/818aa938-571f-4281-96fa-b8756938f20d.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1601e2b-8f7d-429d-8978-a8685098a103.__CR102,0,1636,1840_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a2863106-be64-4259-b41b-cfdb6c44aa32.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e8b9ff40-ba8e-4450-a87b-40ee523f546f.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/120df5b1-bc4f-4eb2-be7a-ec13b8b42645.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3436ad61-3054-41ba-8d97-f95f83c3e4fa.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42cf83e2-96ce-4f5d-86df-966be3b7afab.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/26f36bdd-f01c-46d5-9b6a-286b511a664e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/17284f26-1613-47ae-a276-cf8f8d75a183.__CR0,15,1600,656_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a40caa02-345b-4741-818a-f569e1b27602.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joellen SmithJoellen Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHC4F7YLODZD52FZR3DQG422DJKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17GNCGKTNF4Y7?ASIN=B09X3WGJ3R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Aesthetically Pleasing & Great For Micro Café Bars",
                "reviewText": "My kitchen is small and I have very limited countertop space to work with. I found this little espresso machine and decided to pull the trigger. Initial thought after unboxing is that it is sturdy, nicely packaged and sanitary. The metal components are all stainless steel and the plastic components have weight behind them. Which is great since it is quite a bit cheaper than name brands like Breville and DeLonghi. Tested it not even an hour after arrival and everything works great! Instructions are easy to follow and I was able to make my first ever homemade latte with zero experience . I will continue to use this moderately and update my experience with both the milk frother and espresso maker.Also note that is does NOT come with a pitcher for your milk so you will need to purchase that separately!! I got by with a measuring cup to start.",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/8188cjxrYUL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Schwartz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6SHY34WVSF2MMU27II5W3BM2QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12FZZTC72CUR0?ASIN=B09X3WGJ3R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Does everything right",
                "reviewText": "I',m in the specialty coffee marketing business and I've had several mid - low priced semi-automatic espresso machines like this from Delonghi, Capresso, and others over the last 10 years. So I know how to use these things pretty well to get what I want, a fast, rich full bodied cappuccino in the AM. This machine outperforms the other machines I have owned and takes up less space, is built better, has a more powerful pump, and it looks good (I bought the silver one). What's important is to get a decent burr grinder, one that specifically grinds fine for espresso and also a decent coffee bean. I prefer fresh small batch medium roast espresso which I get locally and sometimes online directly from a roaster I know, Klatch Coffee in Southern California. The steamer works great if you know what you are doing as it is mostly technique. Overall, I am enjoying this machine and we'll see how long it holds up.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marigolds14",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7KWTIRDSFXOXF6I3IK3B7JAX3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3T11R4CJOAGGQ?ASIN=B09X3WGJ3R",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars great little budget espresso machine",
                "reviewText": "I love this little guy. When I was researching espresso machines in my price range I was discouraged by people saying you couldn't get a good one in this price range. And maybe if you're a true espresso snob you won't be satisfied with this guy, but I consider myself fairly snobbish about my coffee and so far I love this machine. Not everyone can drop crazy amounts of money on an espresso machine, and for those of us with a budget, this is a fine option. It produces beautiful crema and espresso that does the job and tastes delicious. The steam wand is fine - I'm not expecting the same quality as a \"real\" fancy expensive machine. It does the job. I took off a star because no matter what I do, it very very rarely produces a dry puck of espresso, and that is annoying, but the drink itself tastes good so I don't care that much. I'm a former barista at a small family owned coffee shop where we knew our stuff, and this machine isn't going to compete with a real coffee shop but it's a wonderful little at-home espresso maker for the price. I did purchase a metal tamper because the plastic one it comes with is kind of a joke. The only major con of this machine is that I'm constantly wanting to make espresso all day long. The process is relatively simple and even if you've never used an espresso machine before, the manual it comes with is pretty clear. Again, my only real complaint is the lack of a true dry espresso puck at the end of the process, which my old and terrible and very low budget Mr Coffee espresso maker did produce. I see in other reviews that this is a common complaint. Nevertheless I am enjoying my daily espresso.Also, it is SO easy to clean. That's a huge huge plus for me. My old espresso maker was a nightmare to clean, but this one has a removable water tank and tray so it's super simple.We'll see if it continues to perform this well as time goes on of course, but about a couple weeks in, I'm pretty happy.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Me-Myself-and-Aye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4ZDKW653C7ZND2XSMS35RA7BNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y4NWQ1ZIWKAE?ASIN=B09X3WGJ3R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome Little Machine",
                "reviewText": "I’ve had this thing for a week now and love it! A very nice small size, and makes an awesome cup of espresso. The steamer also works great! A very good machine for the price!A couple of suggestions if you’re considering getting into espresso:1. Use a Burr Grinder and grind fresh beans. Espresso needs a very fine grind, and the whole beans ensure that the oils will brew out.2. You might want to use a scale to measure the right amount of grounds. These little espresso filters need more grounds than you might think.BTW: These filters have a little nub that has to be lined up with a groove in the handle to be removed. I didn’t see this in the instructions, and almost accidentally broke the filter before really looking close at the filter/handle setup.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris FischerChris Fischer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3BD5D5S2AEZDZKEUWCA7IRFHSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D8T18F1QVOGM?ASIN=B09X3WGJ3R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic value for entry level pump espresso machine",
                "reviewText": "I got this as a birthday present from my son. It is a real pump-driven espresso maker, not a cheap steam one. It is very compact. It heats up very quickly going from off to brew-ready in under 30 seconds. To steam milk, you need an extra 15-20 seconds for the steam to heat up. If you don't have a super-expensive grinder that can do very fine, even grounds, you aren't out of luck. This machine ships with a pressure-restricted portafilter. Espresso purists will scoff at this, but I didn't want to need to spend 400-500 more on a good grinder just to get a decent espresso. If you don't want to use the pressurized portafilter, you can get a traditional one at the manufacturers website. As for ease of use, it's very easy. Just a few buttons and one dial for steam. Altogether, I can go from \"hey, I'd like a latte\" to \"yum, this is tasty\" in about 3 minutes. That includes weighing and grinding 13 grams of beans, filling the portafilter, tamping, pouring milk, steaming the milk, pulling a double shot, filling the cup with espresso milk and foam. If you want to dip a toe into the world of espresso, you really can't go wrong with this machine.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61BxytNkOWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Q0qJlvSdL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "hsubinhsubin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 15, 2023",
                "reviewTitle": "A great budget espresso machine",
                "reviewText": "The media could not be loaded. I have this espresso machine about 2 weeks, would say it beyond my expectation!first, the design is slim and modern. The stainless steel construction not only adds a touch of elegance to my kitchen but also ensures durability. the pressure gauge adds point too.second, easy to use and make a good espresso. the coffee knob is not too tight and hold the position just perfectly. The tastes of espresso is above average, I didn't expect it could tastes like those made with a thousand dollars machine, but it dose!last, the product service is superb! I received warm message from seller the next day when I have the machine delivered. the message provided all the e-version of introductions and trouble-shotings. I asked questions and got responded always in hours., this give me confidenc for the long lasting use.all in short, I like this beautiful machine and would recommend it to every espresso lovers.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71YOOXCrQ4L.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/F1l3VAkmUoL.mp4"
                }
            },
            {
                "reviewerName": "Catherine S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 26, 2023",
                "reviewTitle": "Exactly what I was looking for",
                "reviewText": "I was looking for a good quality espresso machine for occasional at-home use (3-5 uses per week), at a reasonable price point. This machine exceeds my expectations. It's nice looking and solid. It worked *perfectly* straight out of the box. The shots I pulled were tasty and crema-heavy, just the way I like them. The steam wand frothed up my milk quickly with hardly any effort. The user-manual is sufficient because pulling shots is not rocket science. I also received an e-mail from \"Joanne\" at Casabrews containing a few helpful operating tips and an invitation to contact the company if I need customer support - thanks \"Joanne\" :) I feel like this was a great purchase (hopefully, the machine has some longevity).",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CHTP66",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 31, 2023",
                "reviewTitle": "Good Casual Use / Beginner Machine",
                "reviewText": "Bought this for the cottage and it’s pretty good value. You do have to preheat before brewing and manually cool after steaming if you want to brew again, but overall this produces decent coffee and the steamer is good too. It’s not a Breville in terms of build quality - and the plastic top feels a bit cheap - but it’s decent and certainly good value for money.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bellabella",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2024",
                "reviewTitle": "Great product for entry level user!",
                "reviewText": "As a entry user of espresso, I am very satisfied with it. It's very easy to use and this machine height is suitable for most of cup. Really enjoy it!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71P6gZcAlpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71SrYYlGKTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/716Mr0Iot8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 15, 2023",
                "reviewTitle": "The 20 Bars of Pressure Make This A Great Espresso Machine!",
                "reviewText": "I have had a lot of espresso machines over the years and this one is the best. It heats up very quickly - the coffee comes out very hot and you can adjust the flavour intensity to whatever you like given the professional level of pressure. The steaming wand works quickly and the pressure provides perfect froth. Also, I must commend the customer service team at the manufacturer - my machine developed an unusual issue with the steaming wand after several months of use - I emailed their customer service and received a very prompt response. After analysing the issue, the seller volunteered to send me a new machine - the new machine arrived just 4 days after my initial query - unbelievably GREAT SERVICE and I appreciate that the seller stands behind their product! I strongly recommend this espresso machine and the folks who are selling it on Amazon.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}