{
    "remaining_requests": 35932,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cuisinart-DCC-2650-Central-Programmable-Coffeemaker/dp/B004SOZVQ2",
    "body": {
        "name": "Cuisinart DCC-2650P1 Extreme Brew 12-Cup Programmable Coffeemaker, Black/Stainless Steel,Silver",
        "price": "$88.97$69.90",
        "originalPrice": "$88.97",
        "rawPrice": 88.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cuisinart-DCC-2650-Central-Programmable-Coffeemaker/dp/B004SOZVQ2",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B01KTJAI26"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "Thermal Carafe",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B004SOZVQ2",
                "variationName": "Style",
                "variationValue": "Coffeemaker",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BFQ1ZHXP",
                "variationName": "Style",
                "variationValue": "Coffeemaker + Burr Mill, Stainless Steel",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "10-Cup",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B004SOZVQ2",
                "variationName": "Size",
                "variationValue": "12-Cup",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41qKLdFKaBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61A76Q02-8L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71EJN8LYZSS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91yvziZuAFS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Cuisinart Store",
            "link": "https://www.amazon.com/stores/Cuisinart/page/9EA87106-FA2E-4134-BB4D-18194A61B989?ref_=ast_bln"
        },
        "brand": "Cuisinart",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2446,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 8 hrs 58 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Note: 1)Too coarse a grind, too little coffee, or insufficiently tamping the grounds before brewing can all lead to inadequate pressure for a proper brew. 2)It is important to note that the amount of espresso extracted will vary depending on the grind size and amount and reprogramming may be needed when the size and amount are adjusted",
            "EXTREME BREW: Feature uses re-engineered brewing technology to deliver coffee up to 25% faster",
            "FULLY AUTOMATIC COFFEE BREWER: 24-hour programmability with 1–4 cup settings, auto-off functionality (0-4 hours)",
            "12-CUP GLASS CARAFE: Features ergonomic comfort grip black handle, dripless spout, lid, and knuckle guard for added protection",
            "TEMPERATURE CONTROL: Variable heater plate for temperature control that is adjustable – low, medium, and high settings",
            "EASY-TO-FILL WATER RESERVOIR: Lifts up for quick fill-ups, and has a window on the side of unit to display water level",
            "ENJOY WITH EASE: Cuisinart’s trademarked Brew Pause feature lets you enjoy a cup of coffee before the brewing cycle has finished",
            "DURABLE FILTERS: Reusable gold-tone coffee filter included, and built-in charcoal water filter ensures only the freshest coffee flavor flows through"
        ],
        "description": "Product Description Get your first cup of hot fresh coffee up to 25% faster with our Extreme Brew® 12 Cup Programmable Coffeemaker! Cuisinart has re-engineered each step of the brewing process to deliver hot coffee faster without sacrificing that fresh taste at the boldness you love using our Brew Strength Control. As well as the 24-hour programmability and famous Brew Pause feature, the 12 cup carafe features a drip-free pour spout for ultimate convenience for your first cup of hot fresh coffee. LIMITED 3-YEAR WARRANTY: Refer to user manual for troubleshooting steps, and questions surrounding warranty policies – this product is BPA free. Brand Story By Cuisinart",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "12 Cups"
            },
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Espresso Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "personal"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Wattage",
                "value": "1100 watts"
            },
            {
                "name": "Voltage",
                "value": "110"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Product Dimensions",
                "value": "9.5\"D x 11\"W x 16.25\"H"
            },
            {
                "name": "Item Weight",
                "value": "8 Pounds"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,446 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#58,162 in Home & Kitchen (See Top 100 in Home & Kitchen) #124 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "Cuisinart"
            },
            {
                "name": "Included Components",
                "value": "Coffemaker, Carafe"
            },
            {
                "name": "Model Name",
                "value": "DCC-2650P1 Brew Central 12-Cup Programmable Coffeemaker"
            },
            {
                "name": "Model Number",
                "value": "DCC-2650P1"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Style",
                "value": "Coffeemaker"
            },
            {
                "name": "Capacity 12 Cups",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 8 Pounds",
                "value": "Wattage 1100 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Cuisinart Extreme Brew 12-Cup Programmable Coffeemaker Cuisinart PerfecTemp 14-Cup Programmable Coffeemaker Cuisinart 14-Cup Touchscreen Programmable Coffeemaker Cuisinart PerfecTemp 12-Cup Programmable Thermal Coffeemaker Cuisinart Brew Central 12-Cup Programmable Coffeemaker Model # DCC-2650P1 DCC-3200P1 DCC-T20P1 DCC-3400P1 DCC-1200P1 Carafe 12-Cup Glass 14-Cup Glass 14-Cup Glass 12-Cup Thermal 12-Cup Glass Hotter Coffee ✓ ✓ ✓ ✓ Strength Control ✓ ✓ ✓ ✓ Adjustable Carafe Temperature ✓ ✓ ✓ ✓ Controls Push Button/Dial Push Button Touchscreen Push Button Push Button/Dial 24-Hour Programmable ✓ ✓ ✓ ✓ ✓ Auto-Off 0-4 Hours 0-4 Hours 0-4 Hours ✓ 0-4 Hours Clean Function ✓ ✓ ✓ ✓ ✓ Gold-Tone Filter ✓ ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/974f6e00-561c-48a8-9fc1-d276c96674b0.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/70c9648f-618f-4c3f-ba9a-e5224439b7c6.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa689692-17d7-42ba-afa9-17bbecc5aed2.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c200cc81-1127-4c46-97d3-c4cdb160e591.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ad512f0-b85d-4653-b076-9df7e94afdda.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/13bb0653-19c2-4660-b660-50166286c137.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b6294c4-ac60-42d9-a148-7c6d8f222c82.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de0c8939-3206-4839-9a54-9521ed1a903d.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Agatha Coronado",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNFE6PSV7EDOCSNTAR2WVUQPYAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FYG1EUMHZLZD?ASIN=B004SOZVQ2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 20, 2012",
                "reviewTitle": "5.0 out of 5 stars Very nice product, looks fantastic, brews great coffee",
                "reviewText": "My existing coffeemaker was still working fine, but I had gotten tired of its small capacity. (I've written about it before--it's a Miallegro 1090, and its version of \"12 cups\" is apparently European, and MUCH smaller than us Americans think of 12 cups!) So I decided to order a replacement.My criteria included:1) Must have a larger capacity than the Miallegro.2) Must have excellent reviews from existing owners.3) Must be Prime eligible (hey, I paid for Prime, so I might as well get the 'free' 2-day shipping that comes with it).4) Must have basic features like auto-shutoff.5) Preferably includes a permanent filter (if it didn't, I'd purchase one myself--no need to waste paper filters).6) Preferably includes options such as brew strength and carafe heating temperature.With all that in mind I ended up narrowing down my possible choices to a couple of Cuisinarts, the DCC-1200 and the DCC-2650. I chose the latter and I'm glad I did.I noticed that some owners didn't think the 2650 was worth the extra $20-ish over the 1200, but, among other things, I liked the fact that the 2650 has a water level view window on its side.When I ordered it two days ago, its price was $89.69; I see that it's $95.45 today; in both cases, the list price was shown as $185.I placed my order late afternoon on Sunday and, much to my surprise, it arrived on Monday. :) I put it together and ran a cleansing cycle that day, then brewed my first pot of coffee with it this morning. It was FANTASTIC! And fast! Much, much faster than the coffeemaker it replaced--and especially so when you consider its larger capacity. Something I noticed yesterday when I ran the cleaning cycle, and again today with its first actual pot of coffee, is that the amount of water you put in is the amount of coffee you get out. Not so with the Miallegro--with it, if you filled the water chamber by using the carafe filled to its 12 cup mark, after brewing you'd end up with coffee at the 10 cup mark on the carafe. With this Cuisinart, what you put in is what you get out. I like that, a lot.Although it has several fancy-schmancy features, I don't expect or plan to use many/most of them. For one thing, I've had a decades' long aversion to leaving coffeemakers plugged in, after reading/hearing about many instances of fires being started by them. I don't know and, frankly, don't care if that's still something to worry about, it's just a habit I don't plan on breaking at this point!I set the brew strength to bold and the carafe temperature to high. Since I've only brewed one pot as of right now, I don't have anything to compare them to. But I'll update this review if I use other settings and they don't function as expected.I can't say enough about the carafe and its lid. Great! The carafe is large but very comfortable to hold/pour, and its lid is easy to get on/off, allows for easy pouring because you don't need to DO anything (like press a button or hold the lid up) but pour, and the best part is it doesn't spill all over the place! NO mess at all, not even a spilled drop. Love that.So far, and I know it's only been a day, I'm very pleased with this product. I'm keeping my previous unit as a backup (anyone who's had a carafe break can surely relate), and also to use when having company over that includes a lot of coffee drinkers. We can run two pots at the same time. So it's all good.UPDATE: Now that I've had this coffeemaker for a few days I want to heap some more praise on it.GOOD GRIEF, does it ever brew quickly! Its \"Extreme Brew\" feature was not something I even considered when I decided on this unit, but now that I've seen it in action I love it. It does, indeed, brew MUCH faster than any other coffeemaker I've personally used. From start to finish it brews a full 12-cup pot in just about 12 minutes; the Miallegro it replaced took at least twice that long even though it had a smaller capacity.I love being able to select varying amounts of time for the unit to shut off. I didn't think I cared as long as it had a basic 2-hour shutoff, but--again--now that I have it I really like this feature.The temperature of the brewed coffee is fantastic. It's actually so much hotter than we were used to with the old unit that it's taken some time to adjust. That first sip each morning is a little dangerous--but in a good way, you know?! I keep the carafe heat setting on high, so we just need to remember that it's a lot hotter than our previous unit's coffee.",
                "reviewVotes": "161 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hedley Lamarr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYEMJQDXUNWCDPXCUVR4U23IJSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L00IFZ1CTKQW?ASIN=B004SOZVQ2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 28, 2015",
                "reviewTitle": "5.0 out of 5 stars Good for the money. Slightly dated electronic controls but it still works.",
                "reviewText": "Honestly my review sits between 4 and 5 stars. It's not perfect but from what I can tell, it's very close.This is first coffee maker I've had since the old Mr Coffee of my father's that I took to college almost 20 years ago. Since then I've relied on Starbucks, Scooters, Monster Rehab and caffeine pills. The pills have 0 calories and are a great way to start your day with a measured dose of caffeine with your morning vitamins. My drinks of choice from Starbucks and Scooters are sweetened and calorie-laden. The Monster Rehab is relatively low-cal (20 calories per can) and high in caffeine (160mg per can) but costly and reliant upon artificial sweeteners which don't sit well with everyone. Now that I have a coffee machine, I'm free to experiment with brewed coffee without the added sweet-stuff. So far so very good.*** Pros ***It's relatively easy to set up. That's good because the instructions are terribly written. The small text box of First User instructions comes halfway through the pamphlet, after the instructions on brewing coffee.The brew cycle is very quick, giving you hot java in a very short period of time.It's sleek looking. It's stainless steel-plated plastic, not real metal. Still it looks good.The coffee pot pours without spilling or dribbling down the glass.The timer works as expected. It feels a little cumbersome at first, setting the auto on and auto off times. Then remembering to set the pot to auto brew the next morning. But you get the hang of it. The could stand. to give this unit a basic refresh and add more modern controls. What it has it decidely 5+ years old static logic electronics. It works though.*** Cons ***I can not figure out how to kick on the hot plate on-demand. It will run for 1, 2 or 4 hours after the brewcycle depending on what you chose. However I can't figure out to make it keep a pot warm longer than 4 hours. It takes me a while to get through 12 cups of coffee. I guess I'll have to start making 6 cups at a time and brewing a 2nd pot at lunch.Like I mentioned above, the instructions are poorly written. They need to hire a better technical writer. But you will figure it out in the end. It's not overly difficult.Also like a said above, the electronics are dated. The display is not back lit. That's a shame. It could certainly have a more intuitive setup method.It does not have a day of week scheduling option. So if you wake at 6 on week days and 8 on weekends, you'll either have to manually change your programming Friday for the weekend and Sunday night for the week days, or brew a pot on-demand come Saturday morning. Day of week programming could be available with newer electronic controls.*** Notes ***It does come with a gold tone filter. You don't have to buy a 2nd unless you want to have one clean and one in the dishwasher.It comes with 1 charcoal water filter. I recommend buying the ADX brand pack of filters to go with this coffee maker.I'm not a coffee expert at this point and I haven't used all the settings yet, but so far it works great for my needs. I'll report more later if that changes.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 26, 2023",
                "reviewTitle": "Good coffee maker",
                "reviewText": "As advertised. Makes a great tasting coffee as hot as you could possibly want (adjustable hot plate temp).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 20, 2023",
                "reviewTitle": "Love",
                "reviewText": "Excellent coffee maker. Have 2",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vanda ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 27, 2023",
                "reviewTitle": "I like this coffee maker.",
                "reviewText": "Great coffee maker.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 27, 2020",
                "reviewTitle": "Highly recommend it! We love this coffee machine and the no drip pot!",
                "reviewText": "This is a five star review from us! My husband and I used this coffee machine during our stay at an Airbnb. We fell in love with it and the no drip coffee pot! We loved using it so much that we wanted one in our home. It was delivered quickly and we’ve had it for a few months now with no issues! Would highly recommend it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gemini",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 21, 2020",
                "reviewTitle": "My Cusiniart Coffee Maker",
                "reviewText": "Cusiniart makes great coffee makers. This is my second one. I like that I can adjust the temperature setting to make the carafe hotter and adjust the brew strength. A feature that many coffee brewers don't have. The only issue I had was it took over a month to get delivered.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}