{
    "remaining_requests": 35940,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/JURA-Automatic-Coffee-Machine-Silver/dp/B07QX2YPV9",
    "body": {
        "name": "Jura Giga 6 Automatic Coffee Machine with P.E.P. (Silver)",
        "price": "$4,998.00",
        "originalPrice": "",
        "rawPrice": 4998.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/JURA-Automatic-Coffee-Machine-Silver/dp/B07QX2YPV9",
        "soldBy": {
            "sellerID": "A2RM3AECZXQTJA",
            "name": "LUXURY HOME STORE",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2RM3AECZXQTJA&asin=B07QX2YPV9&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31-uY-9mn9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31hgu8MvVZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uv8-qsQnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/215evOrfS3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41dQY2reZ4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KFWJgqEcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91C9aMI7 IL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Jura Store",
            "link": "https://www.amazon.com/stores/JURA+Anchor+/page/4E0922F6-521E-46FA-A0CE-DF3C9C5FC03E?ref_=ast_bln"
        },
        "brand": "JURA Anchor",
        "merchantInfo": "Ships from and sold by Lifestyle by Focus.",
        "customerReview": "3.0 out of 5 stars",
        "customerReviewCount": 26,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 9 hrs",
            "FREE delivery February 20 - 22. Order within 21 hrs."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Enjoy Americanos at the touch of a button and simultaneous coffee and milk preparation for the fastest caffè lattes ever",
            "The GIGA 6 combines the bean-to-cup magic of past GIGA models with innovative, convenient new features that save time, produce delicious results and expand the possibilities of a countertop coffee machine",
            "Twenty-eight specialty drinks—including cortado, flat white, cappuccino, latte macchiato, caffè latte and espresso—are made hot and just the way you like with a single touch of a button from its intuitive 4",
            "3\" color touchscreen display",
            "Two Thermoblock heating systems and two pumps brew coffee and dispense milk simultaneously for the quickest caffè lattes yet"
        ],
        "description": "﻿Delivering perfection, precision, and professionalism Jura is redefining the concept of automatic coffee machines with the GIGA 6. This professional machine for household use is brimming with the latest technology for outstanding results. The J.O.E. (Jura Operating Experience) brings amazing operation to your smartphone or tablet. Equipped with Smart Connect, the GIGA 6 wirelessly syncs to J.O.E. via Bluetooth. Impressive Design Constructed using top quality materials and with Swiss precision, the GIGA 6 features clear design with radiate power and expertise. The impressive quality of this automatic coffee machine is emphasized by the solid front section made of 3 mm-thick aluminum and the substantial aroma preservation cover made of chrome-plated, die-cast zinc. It is equipped with two ceramic disc grinders with Automatic Grinder Adjustment (A.G.A.) for perfectly ground coffee every time. User-Friendly Functions This completely intuitive coffee machine is easy to operate, thanks to the large 4.3\" high-resolution touchscreen color display and the Blue Crystal Rotary Switch. This coffee machine features a self-learning algorithm that identifies each user’s personal preferences and adapts the Start Screen accordingly, showing two, five or eight preferred specialties. It offers 28 different specialties to choose from to the coffee lovers. This machine offers 5-star handling even during cleaning and maintenance with the artificial intelligence and the ingenious design. This coffee machine prepares coffee and hot milk / milk foam simultaneously to create flawless trend specialties.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "5.4 Pounds"
            },
            {
                "name": "Special Feature",
                "value": "Coffee Grinder"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Espresso Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coffee maker"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Wattage",
                "value": "1450 watts"
            },
            {
                "name": "Voltage",
                "value": "230 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Customer Reviews",
                "value": "3.0 3.0 out of 5 stars 26 ratings 3.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,297,959 in Home & Kitchen (See Top 100 in Home & Kitchen) #1,296 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "Jura"
            },
            {
                "name": "Model Number",
                "value": "GIGA6"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Product Dimensions",
                "value": "18.9\"D x 12.3\"W x 16.3\"H"
            },
            {
                "name": "Item Weight",
                "value": "35 Pounds"
            },
            {
                "name": "Capacity 5.4 Pounds",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 35 Pounds",
                "value": "Wattage 1450 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Why JURA is the leader in Automatic Coffee Machines Individual cup brewing Automatically grinds whole beans, tamps and freshly brews each cup for optimum flavor and aroma One-touch preparation Prepares perfect coffee specialties at the touch of a button, in less than 60 seconds Programmable and adjustable Personalized brewing strengths, volumes and height adjustable coffee spout Perfect milk foam Produces perfectly rich milk foam for one-touch cappuccino, latte macchiato, flat white Cost savings Prepares professional coffee shop beverages at a fraction of the cost",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d57490cd-f09d-4fcd-8b2f-269e3a465feb.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Double power, double action The GIGA 6 features completely new inner workings including two thermoblocks, two pumps and two fluid systems. Can prepare two perfect barista standard coffee or milk specialties simultaneously at the touch of a button – always freshly ground, not capsuled Two ceramic disc grinders Two electronically adjustable ceramic disc grinders can grind coffee to the optimum fineness. JURA's exclusive Automatic Grinder Adjustment (A.G.A.) delivers consistent results every time over the grinders' entire service life. Two grinders allow for an infinite number of variations –beverages can be programmed to grind from an independent grinder or mixed. Coffee can be selected in increments of 25% to ensure you always brew the perfect blend Ultimate coffee quality Pulse Extraction Process (P.E.P.) optimizes the extraction time of short specialties facilitating the superb development of flavors. Intelligent Water System (I.W.S.) with RFID technology automatically detects the CLEARYL Smart filter. A world’s first, Intelligent pre-heating technology ensures that even after long pauses between preparing short specialties, the very first coffee is piping hot when it is poured into the cup Parallel preparation, times two The combined power of two thermoblocks and two pumps allow coffee and milk / milk foam to be prepared simultaneously. Can prepare two milk specialties at once. Automatic switchover from milk to milk foam eliminates all guesswork and perfectly tops all milk specialties",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/332bf83e-7be9-46f4-9179-11f11ee612ac.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1ae0903e-9667-4b74-a532-19b5576b3659.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb7d241d-cc2a-4396-8b31-42e3d7a3dd5e.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7cfb631-2dcc-4664-a21e-6deb7817d281.__CR0,0,220,220_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Unprecedented range of specialties 28 specialties to choose from including Cortado, Caffè latte, Espresso doppio, one-touch Americano and even an 80 oz Jug of coffee. A special preparation method is used for Americano, Caffè Barista and Jug of coffee that combines the coffee with added hot water during the extraction process to produce full-bodied, delicate, delicious coffee specialties. Designated hot water functions for tea lovers. Artificial Intelligence A self-learning algorithm identifies each user’s personal preferences and adapts the Start Screen accordingly, showing two, five or eight preferred Specialties. The 4.3\" high-resolution touchscreen color display only shows the user’s favorite specialties. Images and symbols are self-explanatory, well thought-out and reduced to the absolute essentials. Rename specialties, use initials or remove the names for a minimalist look. JURA Cockpit A centralized notification center that provides the most intuitive and simplest operation yet. The Cockpit can be accessed by pressing the center button on the Rotary Switch. Only the maintenance programs that are due immediately are shown in the Cockpit, leaving the Start Screen clean and simple. The maintenance program can be initiated immediately by touching the message 5-star handling JURA engineers redesigned the drip tray for improved handling. The dishwasher-safe drip tray can be easily removed, emptied and reinserted with just one hand. The center of gravity on the drip tray is ideally located to prevent any spills. Maintenance is simple, clean, quick and convenient.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/600a2564-8ae7-4910-b833-55fc84fc5a90.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a8d43516-be4a-4e4d-b4a8-bd17c8311b36.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c37e8e2-3731-4943-a53c-9480eaa069b0.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a7176f9d-a083-42fa-9c3a-2ff3817b6c1a.__CR0,0,220,220_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "GIGA 6 Beverage Reference Espresso / 2 x Espresso Espresso doppio Caffè Barista / 2 x Caffè Barista Americano / 2 x Americano Coffee / 2 x Coffee Jug of coffee (80 oz. max) Macchiato / 2 x Macchiato Cortado / 2 x Cortado Caffè latte / 2 x Caffè latte Flat White / 2 x Flat White Cappuccino / 2 x Cappuccino Latte macchiato / 2 x Latte Macchiato Portion milk / 2 x Portion milk Portion milk foam / 2 x Portion milk foam Hot water for white, green, herbal, black and oolong teas.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/209543cc-e936-4775-a69c-99255eb89621.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d57490cd-f09d-4fcd-8b2f-269e3a465feb.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/332bf83e-7be9-46f4-9179-11f11ee612ac.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1ae0903e-9667-4b74-a532-19b5576b3659.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb7d241d-cc2a-4396-8b31-42e3d7a3dd5e.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7cfb631-2dcc-4664-a21e-6deb7817d281.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/600a2564-8ae7-4910-b833-55fc84fc5a90.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a8d43516-be4a-4e4d-b4a8-bd17c8311b36.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c37e8e2-3731-4943-a53c-9480eaa069b0.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a7176f9d-a083-42fa-9c3a-2ff3817b6c1a.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/209543cc-e936-4775-a69c-99255eb89621.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AlbertoAlberto",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESNB2Y2QN4XEJW7GCUFVOZYTPWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33FOCHJ9WOZI8?ASIN=B07QX2YPV9",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2023",
                "reviewTitle": "1.0 out of 5 stars A $4,500 Lesson in Regret and Frustration - Not Worth It!",
                "reviewText": "I am writing this review after more than 6 months of persistent struggles with the Jura GIGA 6, a high-end coffee machine that I regret investing my hard-earned money in. I wish I could pack it up and send it back, but the absolute lack of customer support makes this a Sisyphean task. The customer service from Jura is, simply put, non-existent. Calling them leads to endless waits on hold, and emails go unanswered. They do, amusingly, seem to accept faxes, a mode of communication I thought was left behind in the previous century.The machine itself, while aesthetically pleasing, is riddled with frustrating software and hardware issues. Randomly, the touch screen will start reacting as if there is a ghostly finger pressing it - and this happens regardless of whether the screen is dry or wet (refer to the attached photo). This has me standing around, waiting for the phantom touches to stop, before I can even start making my coffee.Another particularly annoying design flaw is with the pre-ground coffee system on top of the machine. One would expect that for this price point, Jura would have a system in place to prevent coffee grounds from spilling over. But alas, my hope was misplaced. More often than not, using this system results in a mess of coffee grounds at the bottom of the machine, which then requires cleaning before the tray can be refitted.Moreover, the water tray sensor seems to have a mind of its own. Despite being emptied, the machine will persist in displaying the 'tray needs to be emptied' alert. After some trial and error, I figured out a work-around - strangely enough, adding water back into the 'empty' tray seems to quell the machine's erroneous alerts.I understand that no machine is perfect, and some quirks are to be expected. But when I invested almost $4,500 in a premium coffee machine, I expected far better performance, less frustration, and most importantly, competent and helpful customer support. The Jura GIGA 6 has sadly fallen short on all fronts. It has turned what should be a delightful daily ritual into an exercise in exasperation.Think twice, or maybe even thrice, before spending your money on this machine. And if you decide to take the plunge, I suggest you also invest in a fax machine. It seems you might need one to communicate with Jura's customer service.In summary, I deeply regret my decision to purchase the Jura GIGA 6. It's a beautiful piece of design that's hampered by numerous frustrating quirks and abysmal customer service, which altogether makes it a poor investment for coffee lovers.Rating: 1 out of 5 stars.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/6139bTX00UL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian Dartnell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3CSEMX6C7EWSZAQ7MB7ERPFDXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I6CELT279IEK?ASIN=B07QX2YPV9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 23, 2021",
                "reviewTitle": "5.0 out of 5 stars MAKES GREAT COFFEE",
                "reviewText": "Expensive but well worth the price if you are a coffee lover",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CharlotCharlot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV2UIGLLQB4MBAIBE5GOC2LCU4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19Y8A2XFBEN9X?ASIN=B07QX2YPV9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2019",
                "reviewTitle": "4.0 out of 5 stars Really nice machine so far. The App is a nice twist too.",
                "reviewText": "Very fun to use but a few issues that should be tweaked. Menu touch screen too sensitive to start the drink when I only wanted to slide to the right for more drink options. It starts the drink and really no way to cancel very effectively, keep having to press cancel during the drink pouring out. As of right now I don’t see a way to custom create my own drink. There is only one way to change the preset drinks. Example would be to have 14 seconds milk foam with 30 seconds of milk so I can add my own hot chocolate. I know it’s a coffee machine but it’s really handy for a nice foamy chocolate. Just would like a feature to turn off the coffee grinder completely.Update:Love the machine so far. Customized my own Hot Chocolate by setting to the lowest setting of coffee. The cancel feature is terrible though, must get fixed, it keeps going and I have to keep pressing cancel. The way you have to edit and customize your drinks is very awkward. If you don’t hold down just right, it will make a drink instead of going into edit mode, wasted many drinks this way trying to get into the edit mode. I wish we could update with new firmware from the website as improvements are made.The app would be nicer if you could customize the drinks that are on the machine and not just App drinks. A few more spaces for labeling drinks are needed, we have to abbreviate especially if we want to show decaf icons. But over all still happy with machine. I wonder if Jura would allow us to send in for these corrections when they get fixed?",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71USH1SePyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Airspacegeek",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENCHQLOVOQ7WMJWVGSKMDCD4QCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17Z1FHTO1S9LB?ASIN=B07QX2YPV9",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 4, 2023",
                "reviewTitle": "2.0 out of 5 stars You will never be able to make a cup of coffee from bed",
                "reviewText": "The Giga 6 was quite expensive. A *very* big reason for this purchase was fully expecting to be able to start a perfect cup of coffee from bed in the morning. This turns out to be Not At All Possible. * You must completely reconnect, from the beginning, the app to the machine Every Single Time you use it.The connection experience is beyond terrible and the reliability of that connection is even worse. This makes the experience awful. The Giga 6 machine itself remains reliably connected to my wifi. The app however, has advanced Alzheimer's and must be reintroduced to the machine every single day. Like \"50 First Dates,\" but a heck of a lot less funny. Really pisses me off. Every day.*For everyone else who has the same terrible problem, go to your Jura coffee machine that is probably already reliably connected to your wifi. To re-introduce your Jura to JOE, tap the top round button on your Giga 6 to enter Jura settings. Rotate the dial until you get to Wi-Fi connections, then, tap disconnect, and then start your reconnection procedure all over again. You'll have to do this every single time you want to use the app. The first several times it will tell you it's unsuccessful and require you to turn that 40 pound machine around so you can reach the back, unplug it, unplugged the Wi-Fi, connect, and plug it back in to restart yet again.It's not worth it. I've deleted the app. I'm debating whether or not to return the giga six, I'm still within the return window. That app was very important to me that it works.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raymond C. OlsenRaymond C. Olsen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIHJOHWK3ELBZJDNYJBNEFEENSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CJQSVPMZTA76?ASIN=B07QX2YPV9",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2023",
                "reviewTitle": "1.0 out of 5 stars Don’t by a Jura Capresso Giga 6. Two duds in a row",
                "reviewText": "I have purchased 15+ Jura coffee makers over the years, including two Giga 5s which performed flawlessly. I should have kept the Giga 5. I bought the first Giga 6 from Amazon and it had numerous problems, not the least of which was the near impossibility of reseating the drip tray after emptying the grounds container. This Giga 6 also had brewing problems & was returned to Jura for replacement. The second Giga 6 exhibited the same drip tray reseating problem. I later traced the problem to coffee grounds accumulating in the back of the machine preventing the drip tray from reseating properly. The Jura Capresso rep who called me this morning would not acknowledge a problem. He insisted I merely needed to readjust my grinding, and everything will be fine, which is total nonsense. Stay away from these machines. This once fine company has lost its way.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81ELiNsygeL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81kwnKZRESL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81yufDGOlUL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$4,999.00",
                "sellerName": "Kitchen Kapers",
                "sellerRating": "5"
            }
        ]
    }
}