{
    "remaining_requests": 35899,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BUNN-CSB2G-Speed-Elite-Coffee/dp/B07B9BNLHM",
    "body": {
        "name": "BUNN 52700 CSB2G Speed Brew Elite Coffee Maker Gray, 10-Cup,Grey",
        "price": "$139.99",
        "originalPrice": "$149.99",
        "rawPrice": 139.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BUNN-CSB2G-Speed-Elite-Coffee/dp/B07B9BNLHM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07Q769KSR"
        ],
        "asinVariationValues": [
            {
                "asin": "B07MY3CTQC",
                "variationName": "Style",
                "variationValue": "High Altitude",
                "price": "$149.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07B9BNLHM",
                "variationName": "Style",
                "variationValue": "Regular",
                "price": "$139.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $21 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41m Ek10fZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/310nfXcBcWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MJ14kyTxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31vU1kXrVeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uieDQSlYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31QE98cQ0fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IOEt9nbNL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BUNN Store",
            "link": "https://www.amazon.com/stores/BUNN/page/CBF838CB-A39F-4EAE-8509-F490064A2B2D?ref_=ast_bln"
        },
        "brand": "BUNN",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3928,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 51 mins",
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Saturday, February 17. Order within 7 hrs 51 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "BUNN BREWS DIFFERENTLY - The BUNN Speed Brew uses an internal commercial grade stainless steel hot water tank that keeps 70oz of water always hot so you can quickly brew at the flip of a lid.",
            "SIMPLE TO USE - Pour-in bowl features a water level indicator to show you how much water has been added.",
            "MATTE GREY FINISH with black gloss accents and high-polished stainless-steel backsplash and top-band accent.",
            "DESIGNED AND ASSEMBLED in the USA.",
            "EXCLUSIVE DRIP-FREE CARAFE delivers the cleanest pour on the market with a proprietary lid and spout design that arcs the coffee into the cup and wicks the rest back into the carafe.",
            "SWITCH ACTIVATED warmer plate keeps your coffee at optimal serving temperature.",
            "FASTEST 10-CUP HOME COFFEE MAKER* - Our technology allows our coffee maker to brew a full carafe of coffee in 4 minutes, half the time of typical coffee makers. *Based on internal testing of BUNN Speed Brew coffee makers to other similar coffee makers.",
            "CAFÉ TASTE AT HOME - Commercial style multi-stream sprayhead evenly showers hot water over the coffee grounds to maximize the flavor of your coffee similar to your favorite café.",
            "BREW A TRAVEL MUG OR A CARAFE - Brews 20oz to fill a travel mug in 2 minutes, or a full 50oz carafe in 4 minutes.",
            "BUILT TO LAST - 3-Year Warranty on all Speed Brew models."
        ],
        "description": "The fastest home Coffee makers in America, now with an updated design. Speed brew coffee makers can brew 10 cups of coffee in about 4 minutes because they store hot water in a stainless steel commercial grade tank allowing them to brew coffee on demand. They're always on your counter, always plugged in and always ready to brew the perfect cup of coffee.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "50 Fluid Ounces"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific instructions for use",
                "value": "Coffee maker"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Wattage",
                "value": "900 watts"
            },
            {
                "name": "Voltage",
                "value": "120"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Style",
                "value": "Regular"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,928 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#39,909 in Home & Kitchen (See Top 100 in Home & Kitchen) #93 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "BUNN"
            },
            {
                "name": "Included Components",
                "value": "Filter basket, Brewer, Carafe"
            },
            {
                "name": "Model Name",
                "value": "CSB2G"
            },
            {
                "name": "Model Number",
                "value": "52700"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Product Dimensions",
                "value": "7.8\"D x 12.5\"W x 14\"H"
            },
            {
                "name": "Item Weight",
                "value": "7.2 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Capacity 50 Fluid Ounces",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 7.2 Pounds",
                "value": "Wattage 900 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Speed Brew Technology The BUNN Speed Brew uses a commercial grade stainless steel internal hot water tank that keeps 70oz of water always hot so you can quickly brew at the flip of a lid. Drip-free Carafe Exclusive carafe delivers the cleanest pour on the market with a proprietary lid and spout design that arcs the coffee into the cup and wicks the rest back into the carafe. Brew a Travel Mug or a Full Carafe Brew as little as 20 ounces to fill a travel mug, or brew a full 10-cup carafe.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/804bc369-e804-402c-b6d9-93df2eedfd9d.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a47af0f2-93a2-4316-aade-acd6bd8be097.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f90ce2ef-74e0-47d8-bc89-4b12726cb7b2.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "The Brand Trusted by Restaurants & Cafés Worldwide Some of the world’s largest foodservice brands rely on BUNN equipment to serve high quality beverages every day. Our reputation is built upon BUNN innovations in coffee brewing. Today, the BUNN equipment portfolio is designed, engineered and managed by teams headquartered in Springfield, IL USA. Whether it’s equipment for the most demanding commercial settings or the best cup at home in your kitchen, we are driven by an entrepreneurial DNA to relentlessly pursue the highest quality in the cup for every serving occasion and to use our success to make the world a better place for our customers and our families. Our home coffee makers are built from this tradition and passion. BUNN home coffee makers bring the flavor and quality of the café-style coffee you love directly to the comfort of your home.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffa26514-b50b-459a-aa90-e64031c563c5.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Coffee Focused It all started with coffee. From the first commercial pourover brewer, to our coffee makers in homes today, our passion has always been brewing the best cup of coffee possible. Since the 1950’s, we’ve dedicated ourselves to making advances in the field of coffee brewing. Whether that’s inventing the first-ever flat bottom coffee filter or designing a unique water displacement brewing process that makes coffee available faster than any other 10-cup home coffee maker, our list of industry-leading innovations continues to grow.* BUNN home coffee makers are built to do one thing: brew a delicious cup of coffee reliably…. every day. Every feature is engineered with a focus on that final pour of coffee from a coffee maker that brews purely and without gimmicks. *Based on internal testing of BUNN Speed Brew coffee makers to other similar coffee makers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1e89bb3-0d16-46d3-bf81-5b970e09b9c6.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/025097f7-8c0d-404b-9d19-631bd2536f2c.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/804bc369-e804-402c-b6d9-93df2eedfd9d.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a47af0f2-93a2-4316-aade-acd6bd8be097.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f90ce2ef-74e0-47d8-bc89-4b12726cb7b2.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cc603d89-3470-49b4-b127-d51c6bdf1b1a.__CR142,0,3550,1098_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffa26514-b50b-459a-aa90-e64031c563c5.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1e89bb3-0d16-46d3-bf81-5b970e09b9c6.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Deep Thought",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF47MDVURHHMYHIYMNERNFHZGNWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R6L5VZ7ZBDHR?ASIN=B07B9BNLHM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2019",
                "reviewTitle": "5.0 out of 5 stars Explainer on how Bunn's work",
                "reviewText": "Bunn coffeemakers are designed and work differently than any other coffeemaker you've ever owned. Before you purchase one, it's important to understand how and why. It took me quite a while reading their site and reviews, and even then it took owning one for me to really understand. This will hopefully save you some time.Let me start by saying I purchased this machine on my own with no discounts or incentives. Bunn... you owe me!I purchased my first Bunn several months ago after considerable investigation and I am thrilled with it. For the past 10 years I've had multiple Mr. Coffee's and a Nespreso machine, and have drank coffee from various other machine's at friends homes. I thought all at-home coffee tasted bad and burnt and blamed the coffee bean companies. Only now do I understand it was the machine designs ruining things.To understand Bunn you must first realize the functional design of every other coffeemaker on the market is wrong. Those coffee machines wait dormant for you to indicate that you want a cup of coffee, and then go about boiling the water and channeling boiling water over the ground coffee. The result of this process is that you wait around endlessly... literally waiting for water to boil... for 5 to 10 minutes and then drink the result of boiled water poured over coffee grounds (bitterness).The Bunn approach is thata) you shouldn't have to wait for water to boil; andb) boiled water (212F) is the wrong temperature for making good coffee.Bunn's carafe (at least for my model) holds roughly 10 cups of water, but the water tank in the machine holds 20. And THAT is the genius of their design. Why does the machine hold twice as much water as the carafe can handle? The Bunn coffeemaker has a stainless steel water heater tank inside of it that ALWAYS has exactly 10 cups of water at the perfect temperature for making coffee. When you Fill the carafe and pour it into the machine, the machine uses the new cold water to displace the existing hot water. The result is that the existing hot water immediately starts pouring over the grinds. Within around 5 seconds coffee starts pouring at a steady flow into the carafe, and those first 5 seconds are the time it takes to soak through the coffee grinds/filter. It's immediate. The flow is also somewhat heavier/faster, and within 2 minutes (faster if you're not filling the whole pot) you're completely done. The speed of this machine will blow you away.Further, the temperature the machine holds the water at is around 195F... the correct temperature for making good coffee. Why does the coffee out of your existing machine always taste burnt? The design of those machines relies on the water boiling... that's how the water moves through the system. Boiling water is 212F, and at that temperature the water scalds the beans resulting in a bitter taste. No it's not the beans or even the plastic... it's the water temperature ruining your morning brew.Immediately all those bitter store coffees tasted amazing. Smooth... delicious... with flavors I had never noticed before. I suddenly had to go back and re-purchase every coffee brand/type I'd ever written off so I could re-evaluate them. It's literally changed my entire view on coffee. Now, not every coffee you buy at the store is going to be amazing... luxury beans will still be better, but by and large this machine significantly moved the needle on every one. Previously I'd rate every coffee I'd ever made at home from a C to an F. Now it's A to C, with even the worst cup of store-brand being nearly as good as the top luxury beans with previous coffeemakers.Between the speed of brew and the amazing results, this machine is AWESOME.There are some more notes with design points you should understand:- There is no \"On\" button for starting the coffee making process. Remember the water is already hot and waiting, and the process uses displacement, so nothing electronic needs to happen to make a pot of coffee. There are two on/off toggles (they glow blue when on) that do other things as follows: a) In the way back of the machine there is an on/off toggle that controls the water heater on/off. This should always be set to on, unless you're going on vacation (and even then you could just unplug it). That's likely why they stuck this toggle so far back. You won't even see it unless you're looking for it. b) On the front of the machine there is an on/off toggle which everybody will think starts the coffee making. It does not. This on/off toggle simply controls the hot plate below the carafe. You can turn it on if you want, or not... it doesn't matter unless you're trying to keep the coffee already-made hot for a long time.- The coffee making process starts by closing the lid to where you pour in the new water. I haven't opened up the machine to see exactly how it works, but it appears the lid pushes down on a small lever which opens up the inner mechanism allowing the new cold water to push out the existing hot water. This is the hardest part of getting use to this machine. First off you'll want to be pressing some button to start the process... it will feel awkward not to. Seconds... you have to remember not to close the lid until the carafe is in place or coffee will start pouring out.- However much water you pour in, the machine will put out the exact same amount, to the drop. The machine always has precisely 10 cups of water in it... if you pour in 3 more cups, it will dispense exactly 3 cups of hot water. I've tested this and the accuracy is spot-on.- Remember what I said earlier... the carafe holds 10 cups and there are 10 cups of hot water already waiting for you in the machine, but the internal tank holds up to 20 cups. So you can fill up the carafe completely and pour it all in at once, and the machine will not overflow. Also... the pour-in area of the machine is great. Right up front and easy to access (unlike the Mr. Coffee) and the water just goes straight-in with no splashing, missing or over-pouring.- About 5 mins after your coffee is done being made, the machine will automatically kick in heating up the new water to the necessary temperature. It's not overly loud or annoying but you can hear it if you're in the same room. It's another 5 minutes or so to heat the coffee up.- The pour-over on the grinds is great. The flow is very fast, and yet when you take the grounds basket out there is no ride-up of grinds on the filter. I've never seen a single ground make it through into the coffee pot. Also, I should turn the basket upside down over the garbage and the used filter/grounds come right out clean. I usually pour a spritz of water over the empty basket out of habit... but I probably don't even need to do that. There is never residue.- The manual says to pour a minimum of 4 cups of water into the machine for any batch. The carafe also has a minimum indicator at 4 cups. This worried me as I often just want to make a single cup. I fill up a mug of water everyday, pour it in, and then put the mug where the carafe is supposed to go and the machine works flawlessly filling it with coffee to the exact same level. I don't know why they said there is a 4 cup minimum and maybe I am somehow slowly damaging the machine by not obeying them, but it works just fine to do it.If I had a complaint about this machine it would be the hot plate. The hot plate gets too hot (just like every other machine on the market). The result of leaving it on too long is... you guessed it... thick dark bitter coffee. I recommend using the hot plate only for short period of 20-30 minutes max. Also it would be great if the hot plate turned off on it's own after some amount of time.Overall I cannot recommend this machine enough. The coffee is so smooth and delicious you'll never go back.",
                "reviewVotes": "890 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KMac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHB24WGQAFNC7HHDLFLU64XQLDHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2293GZP6C5MJQ?ASIN=B07B9BNLHM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2022",
                "reviewTitle": "5.0 out of 5 stars Decent coffee super fast",
                "reviewText": "Our Keurig lasted 10+ years, amazingly. But we were tired of its limitations and the expense of buying pods. The problem was that it met our needs in every other way. We are a day-shift and night-shift household, so there is no time that a full pot of coffee would be used. That also means setting up a pot the night before doesn’t work for us. That means we need something stupid-simple and quick for our separate morning coffee times.After having pod coffee for 10 years, we were ready to get back to really good coffee and willing to spend whatever it took to get it, but it HAD to be quick and easy. We found out that’s not an easy combination.I read and watched all the coffee snob opinions for a few months and considered all the machines they talked about. We have made coffee with various methods over the years before our schedules made the Keurig our preferred choice. We did pour-over and French press for years. We loved the coffee, but right now, we were not willing to sacrifice our need for fast coffee on work days. So we evaluated everything that would give us a decent upgrade in coffee quality (better than Keurig!) quickly.In the end, nothing compared to the Bunn’s speed. It looked possible to make a travel-mug-sized serving (4 cups) at a time (and it is). The water reservoir is heated and ready to go. We only have to plop in a filter and a couple of scoops of coffee, and pour the correct amount of water into the reservoir. Out comes great coffee immediately. Each of us dumps the used coffee/filter and rinses the pot after each use, so it’s always ready to go.No more pod coffee. This is much better, but it took some tweaking for me to get there. I started trying to use some cheap medium roast coffee that I had been using in the Keurig, and it was terrible and undrinkable in the Bunn. I switched brands, and it took me about a week to get the right amount of coffee to make the perfect cup. It was worth some time experimenting for me though, because now I get exactly what I like every time. I went to a finer grind espresso-type coffee, and now I get a smooth cup that is sufficiently strong.My husband, who likes a darker brew, was fine from the first cup using his Starbucks dark roast.I have made great iced coffees too. They are strong but not bitter using the same finely ground coffee. That was impossible with the Keurig.Other than coffee, my next favorite thing is making a gallon of iced tea at a time by running a whole pot of water over a gallon-sized tea bag. I can brew a whole pot of tea, add sweetener, and fill up the rest of the gallon with water, all in less than 5 minutes.We got the glass carafe because the reviews on most stainless steel carafes seem mediocre. We are happy with our choice. The glass pours perfectly without spilling a drop and performs better than anything I have ever poured before. It has a plastic piece that extends slightly beyond the spout to help guide the pour. The glass is as sturdy as regular glass can be, not particularly fragile, although we know chances are it will meet its demise by getting broken some day. Hopefully replacements are easy to get.We have each made the mistake of trying to use the heated plate, and both of us forgot to turn it off and baked our coffee in the pot. We learned our lesson — just don’t use it. With fresh coffee less just a minute away, there's really no need for it.We love the Bunn and feel like it’s the perfect machine for our household because of our crazy work hours. We get a very decent cup of coffee, super fast and easy. The coffee snob ideas were helpful, but in the end, speed won in our household.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley Lounsbury",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 23, 2022",
                "reviewTitle": "The coffee is great and brewed very fast!",
                "reviewText": "I love my bunn coffee maker! I had purchased 2 coffee makers in 2 years which didn’t last and finally spent the money on this quality appliance! Wish I had of done it years ago! The coffee is brewed very quick and the flavour is great! I would highly recommend this product!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ladybee ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 8, 2022",
                "reviewTitle": "Fast and easy and looks great",
                "reviewText": "Love my Bunn Coffee Pot. Great tasting Coffee brews fast and easy to clean everything I ever wanted in a Coffee Pot and looks great sitting on my Counter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 21, 2023",
                "reviewTitle": "Bunn...for great coffee.",
                "reviewText": "Love my Bunn. Keeps the water extremely hot. Makes a great cup of coffee. My last Bunn lasted for 15 yrs. Will always buy Bunn.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DRNR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2022",
                "reviewTitle": "Love this coffee maker",
                "reviewText": "It's always ready to make coffee. It's fast, delicious brew because the water is at the right temperature. Looks sleek too on the counter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eileen Sim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 24, 2023",
                "reviewTitle": "BUNN Coffee Maker is the best on the market.",
                "reviewText": "It is exactly what I wanted. It brews very quickly; no mess. The heating plate for the carafe fits very well; much better than my previous BUNN coffee maker. It is all but perfect!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$139.00",
                "sellerName": "Erin's Tshirts",
                "sellerRating": "0"
            }
        ]
    }
}