{
    "remaining_requests": 35923,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Auto-iQ-Frother-Baskets-Thermal-CP307/dp/B07FX73Y7H",
    "body": {
        "name": "Ninja CP307 Hot and Cold Brewed System, Tea & Coffee Maker, with Auto-iQ, 6 Sizes, 5 Styles, 5 Tea Settings, 50 oz Thermal Carafe, Frother, Coffee & Tea Baskets, Dishwasher Safe Parts, Black",
        "price": "$149.99",
        "originalPrice": "$199.99",
        "rawPrice": 149.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Auto-iQ-Frother-Baskets-Thermal-CP307/dp/B07FX73Y7H",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41TLS4jV2aL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/517oAowCloL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Cfd4Ye87L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QaScFl2bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418SCMT296L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510IHT4qH5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AKMAqcpGL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ninja Store",
            "link": "https://www.amazon.com/stores/Ninja/page/4D837C13-1334-44EE-AD50-9586EE0F3873?ref_=ast_bln"
        },
        "brand": "Ninja",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 7720,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 5 hrs 41 mins",
            "FREE delivery Sunday, February 18. Order within 7 hrs 56 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "COLD BREW: Brew tea or coffee at a lower temperature over ice for smooth, naturally sweet flavor in 10 to 15 minutes..BPA Free : Yes. Cord Length : 2.5 ft",
            "SEPARATE BASKETS: Keep flavors separate with different baskets for brewing coffee and loose or bagged tea.",
            "SMART BASKET RECOGNITION: System recognizes what's in the basket and automatically displays coffee or tea options.",
            "6 BREW SIZES: Brew anything from a single cup to an XL cup, travel size, XL travel size, and half or full carafe with your coffee maker.",
            "5 BREW STYLES: Choose your style with Classic, Rich, Over Ice, Cold Brew, or Specialty.",
            "TEA TYPES: Select your tea type, and the system will know the right temperature and number of steps needed.",
            "KEEPS IT HOT: The 50 oz. (10-Cup) Thermal Carafe is double-walled to keep your coffee and tea hot for up to 2 hours. No warming plate required.",
            "FOLD-AWAY FROTHER: Turn hot or cold milk into silky-smooth froth in seconds with the Hot and Cold Frother. Flips into the machine when not in use.",
            "DISHWASHER SAFE PARTS: The water reservoir, frother whisk, brew-through lid, coffee and tea permanent filters, removable filter holders, flip-top lid, and scoop are all top-rack dishwasher safe. Thermal carafe should be hand-washed only.",
            "WHAT'S INCLUDED: Ninja Hot & Cold Brew System, 50 oz. (10-Cup) Double-Walled Thermal Carafe, Separate Coffee and Tea Brew Baskets, Coffee Permanent Filter, Tea Permanent Filter, Removable Water Reservoir, Ninja Smart Scoop, & Fold-Away Frother."
        ],
        "description": "Go beyond the coffeehouse with the Ninja Hot and Cold Brewed System. This brewing system gives you the ability to brew hot, flavorful cups of coffee and tea or over-ice beverages, all powered by Advanced Thermal Flavor Extraction Technology with Auto-iQ. 2 Ways to Enjoy Over Ice Coffee and Tea – Choose between smooth, naturally sweet Cold Brewed coffee or tea and vivid, authentic flavored Hot Brewed iced coffee or tea that's never diluted. Specialty Coffee and Tea Favorites – Combine super-rich coffee and tea concentrates with hot or cold frothed milk to create delicious coffeehouse-style drinks.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Ninja"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "10.01\"D x 11.81\"W x 15\"H"
            },
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Style",
                "value": "5 Brew Styles & 5 Tea Settings"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Cold Brew"
            },
            {
                "name": "Included Components",
                "value": "Separate Coffee & Tea Brew Basket, Coffee Permanent Filter, 50 oz. (10-Cup) Double-Walled Thermal Carafe, Fold-Away Frother, Recipe Book"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Voltage",
                "value": "120"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Unit Count",
                "value": "1.00 Count"
            },
            {
                "name": "Item Weight",
                "value": "11.73 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "SharkNinja"
            },
            {
                "name": "ASIN",
                "value": "B07FX73Y7H"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "CP307"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 7,720 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,846 in Home & Kitchen (See Top 100 in Home & Kitchen) #25 in Coffee Machines"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "August 1, 2018"
            },
            {
                "name": "Capacity 50 Fluid Ounces",
                "value": "Material Plastic, Metal, Rubber"
            },
            {
                "name": "Item Weight 11.73 Pounds",
                "value": "Wattage 1500 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/501620b0-f303-48bf-8700-9e330525d680.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08dafa5e-09fc-4105-b21f-beabf2f1cd3a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a8e29f1-6156-4685-84b3-51f87eeb8402.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0a906f0-a67f-40ad-bfb5-4e024a8f180c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/54aea31a-ed2b-49b7-b262-8d03148da5d0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4595e57e-7f24-4ea6-ab28-0a7ddac3dde5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/873fc7ac-d28b-4961-8a7b-961b9f207a2c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5914eb86-13f7-4052-8359-4ab8935c88b8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BrendanBrendan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQL4Q3ICXYE4ACP64NLQ33HDFSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHWN6MCCA3Z24?ASIN=B07FX73Y7H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Best coffee maker. Ever.",
                "reviewText": "I am the type of person to over research everything and still be super indecisive about what I purchased, but let me tell you, this thing RULES. I could not be happier with this coffee maker. Between the regular, hot coffee, and the cold brew / iced coffee, you are getting a steal with this purchase. Listed out some of my favorite things about this coffee maker below. Overall though, you need not look further.. this is the GOAT.- The coffee is HOT. Like piping hot. My old keurig would get the coffee hot, but like... this thing keeps it at the best temperature.- I make usually 1-2 cups daily, and have no problem with the amount of grounds per cup of coffee. It's really really good coffee. I also love that it has a small \"stand\" for when you're making a single cup. It really is the little things haha.- If you like your coffee strong, this has a feature \"Rich\" that make it extra strong for you.--- It also has an espresso option \"Speciality\" great for use when you need a quick jolt of caffeine or a latte- The cold brew feature works great. I would make a full pot of it during the summer and keep it in the fridge for future use.- The frother works amazingly well too. It does not heat up the milk that you froth, but honestly, the coffee is so hot that I don't even need it.- Cleaning is a breeze. I use paper filters because it's easier clean up and the filter provided does unfortunately let some grounds come through. It's barely noticeable thoughTwo cons:1. The amount of space it takes up. I went into buying this knowing full well how big it was though, so it's more of something to just keep in mind2. Occasionally when I grind my coffee too fine, the water has a hard time making it through the filter. This can lead to water build up in the filter, and if you leave it, water dripping down onto the base of the coffee maker. The clean up is very easy though and does not splash around the coffee maker.All in all though, I cannot be happier with this purchase. The value for your money is A+. I would buy this 100 times over if needed.",
                "reviewVotes": "49 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61hYYvjmXkL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71kqO647p+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71rSFY6Or9L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3K7EDWQA6TVCZBWSRKN2JFXOLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HI11VCCEOX8G?ASIN=B07FX73Y7H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 25, 2023",
                "reviewTitle": "5.0 out of 5 stars I love this thing!",
                "reviewText": "Coffee and Tea Back to Back:So... a lot of times when you hear about coffee makers that also make tea, all I think about is the awful taste of having coffee grounds in your tea >_<. Tea is often an afterthought for a lot of manufacturers. That's not the case with this machine.They really thought this design through and I am able to use it for both coffee and tea back to back without any extensive cleaning. The trick? The entire brewing basket comes off and they have two separate brewing baskets, one for coffee and one for tea. At no point will the water will touch any component that has touched any coffee grounds when you have the tea basket in, and vice versa. I've seriously made a cup of tea immediately after my husband brewed a cup of coffee without having to clean or even rinse anything. I just swapped the baskets.Tea Basket:So, one thing I will say is that the tea basket is a pain in the ass to clean when brewing loose leaf tea. There's a filter that clips into the bottom to prevent tea leaves getting into your cup, but it doesn't do that great of a job at keeping the leaves out. Granted, I've been brewing maté that's been cut very fine so that is definitely a factor. I'm sure if you were brewing green tea or earl grey, it'd be fine.The other problem is that the brew basket does fill most of the way up, and the tea will tend to float up with it, then stick to the sides when it drains. This is what makes it hard to clean. They don't really concentrate on the bottom (again, this also may be more pronounced with the maté) so you really have to clean the whole thing, and dumping the tea can be difficult.However, I did come up with a great solution that fixes all of this. I just remove the filter at the bottom and use my old tea infuser in the basket. This solves all of these problems completely. No mess and no leaves in my cup. I just dump the tea from the infuser straight in the trash when done and then rinse the infuser and basket. Way, way easier to clean and it's how I recommend brewing cups of tea in this machine. If you're brewing a half carafe or a full carafe, then the cleaning hassle would be worth it for that large quantity.Coffee:We bought this machine after a lot of research when our Keurig broke. We were done having to buy pods. I We definitely didn't feel good about the amount of plastic we kept having to throw away (we don't have recycling where I live) and it's also much more expensive. However, I don't think, with the cost of this brewer, we're going to make up the cost of pods anytime soon.It brews a great cup of coffee, though. We found that the reuseable filter it came with doesn't do a good job, so we switched to unbleached paper filters instead and we have been able to reproduce the consistency and flavor that we liked from our K-cups with it. My husband drinks his coffee black, no sugar, and very much enjoys the flavor of the coffee now with the paper filters. For the record, we were a big fan of the Dunkin' Original, medium roast k-cups and are using the same brand and flavor ground coffee from a bag.The paper filters also make it easier to clean. Just throw the filter out and rinse the basket. It's only slightly more inconvenient than using a pod because we have to scoop out our own coffee, but even then, the included scoop makes that super convenient as well.Features:This machine has a ton of great features. I've used all but the cold brew feature with both tea and coffee and it works great. Want an iced tea? You can have it in minutes. Same with iced coffee. It's really simple to use and everything works as advertised. We bought the version with the thermal carafe because we're not big fans of how coffee tastes when it's been sitting on a burner for a while and the thermal carafe does a great job at keeping the coffee warm for a while.Overall:I highly recommend this brewer. I find it worth the $200 we paid for it and its been a huge upgrade to our mornings.",
                "reviewVotes": "79 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Armando Critic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 10, 2023",
                "reviewTitle": "Súper Wow!!!!",
                "reviewText": "Es la primera vez que adquiero un producto de la marca Ninja y honestamente es la mejor cafetera que he comprado en mi vida. Me encanta porque cuenta con aditamentos de primera, materiales súper robustos y de excelente calidad y tanto las variedades de preparación para café o té, te hacen del momento una experiencia bastante agradable. Su monitor digital se ve de primera y es muy fácil de usar, a pesar que a primera vista impone . El espumador es de lo mejor y te permite jugar con sabores y diseños de barista. La jarra térmica es de la mejor calidad y efectivamente, puede estar extremadamente caliente el líquido en su interior y por fuera está fría, sensacional!!!!. Excelente compra, la recomiendo al 100, de lo mejor en cafeteras.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Drifa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 24, 2024",
                "reviewTitle": "Wonderful coffee maker",
                "reviewText": "Makes good coffee and has so many options.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Selene Cecilia Robles Gonzalez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 15, 2024",
                "reviewTitle": "La mejor cafetera",
                "reviewText": "La recomiendo muchísimo, es una gran experiencia cafetera, variedad de opciones ya sea te o café, todas las funciones son fáciles de usar. Cómo dato extra la primera vez que la pedí no funcionó y la caja venía maltrata, pero la regreso y sin problema me hicieron la devolución y la volví a pedir y para nada me arrepiento, la segunda vez llegó bien empacada y funcionó a la perfección. Recomiendo comprar con la garantía de dos años por cualquier cosa",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tashia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 3, 2024",
                "reviewTitle": "Love this",
                "reviewText": "Best coffee maker I have bought has a very cool tea feature as well. The only thing that would make this better is if the pot was heated from the burner as well but the we usually finish the pot before it gets cooled off.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "patricia peña",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 19, 2023",
                "reviewTitle": "La amé",
                "reviewText": "Estoy encantada con mi cafetera. Además de bonita es muy práctica en razón de que puedo hacerme desde una taza regular, una grande, termo, media jarra o la jarra entera. Frío o caliente!!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}