{
    "remaining_requests": 35929,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BUNN-CSB3T-Platinum-Thermal-Coffee/dp/B07GY6PHYZ",
    "body": {
        "name": "BUNN 55200 CSB3T Speed Brew Platinum Thermal Coffee Maker Stainless Steel, 10-Cup, Black",
        "price": "$169.99",
        "originalPrice": "",
        "rawPrice": 169.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BUNN-CSB3T-Platinum-Thermal-Coffee/dp/B07GY6PHYZ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07N6VRNGR"
        ],
        "asinVariationValues": [
            {
                "asin": "B07MY32DZS",
                "variationName": "Style",
                "variationValue": "High Altitude",
                "price": "$169.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07GY6PHYZ",
                "variationName": "Style",
                "variationValue": "Regular",
                "price": "$169.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/410OAfModtL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31VqjWBOuLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sb8bFwglL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31j5jjIfiPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DB4n4-nSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41R3dNkry0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IOEt9nbNL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BUNN Store",
            "link": "https://www.amazon.com/stores/BUNN/page/CBF838CB-A39F-4EAE-8509-F490064A2B2D?ref_=ast_bln"
        },
        "brand": "BUNN",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 7127,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 8 hrs 58 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "BUNN BREWS DIFFERENTLY - The BUNN Speed Brew uses an internal commercial grade stainless steel hot water tank that keeps 70oz of water always hot so you can quickly brew at the flip of a lid.",
            "SIMPLE TO USE - Pour-in bowl features a water level indicator to show you how much water has been added.",
            "MATTE BLACK FINISH with high-polished stainless-steel backsplash and top-band accent, DESIGNED AND ASSEMBLED in the USA.",
            "VACUUM-INSULATED, double walled thermal carafe maintains ideal serving temperature for 2+ hours",
            "CAFÉ TASTE AT HOME - Commercial style multi-stream sprayhead evenly showers hot water over the coffee grounds to maximize the flavor of your coffee similar to your favorite café.",
            "BREW A TRAVEL MUG OR A CARAFE - Brews 20oz to fill a travel mug in 2 minutes, or a full 50oz carafe in 4 minutes. TALLER FUNNEL - Our funnel is engineered to accommodate BUNN filters which are ¼” taller than other filters. This unique design allows for the quick flow of water and prevents overflow of coffee grounds."
        ],
        "description": "The Fastest Home Coffee Makers in America, now with an updated design. Speed Brew Coffee Makers can brew 10 cups of coffee in about 4 minutes because they store hot water in a stainless steel commercial grade tank allowing them to brew coffee on demand. They’re always on your counter, always plugged in and always ready to brew the perfect cup of coffee.Taller funnel - Our funnel is engineered to accommodate BUNN filters which are ¼ Inch taller than other filters. This unique design allows for the quick flow of water and prevents overflow of coffee grounds.Tank - Compared to the other home coffee makers that “burp” water over your coffee grounds as it boils, our tank keeps 70 oz of water at an instantly brew-ready temperatureTemperature - Competitor systems can exceed the recommended standard of 200ºF, resulting in a burnt flavor. Thanks to the temperature regulated tank, the speed brew delivers a consistently ideal brewed pot of coffee.Speed brew is the only home coffee maker designed, engineered, and manufactured with the same commercial practices as the BUNN equipment trusted by cafes and restaurants worldwide.The BUNN Speed Brew uses an internal commercial grade stainless steel hot water tank that keeps 70oz of water always hot so you can quickly brew at the flip of a lid.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "10 Cups"
            },
            {
                "name": "Special Feature",
                "value": "Thermal,Removable Tank"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Paper"
            },
            {
                "name": "Specific instructions for use",
                "value": "Coffee Maker"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Voltage",
                "value": "110 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Product Dimensions",
                "value": "8.3\"D x 13.9\"W x 14.9\"H"
            },
            {
                "name": "Item Weight",
                "value": "10.4 Pounds"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 7,127 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,500 in Home & Kitchen (See Top 100 in Home & Kitchen) #52 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "BUNN"
            },
            {
                "name": "Included Components",
                "value": "coffee maker, thermal carafe"
            },
            {
                "name": "Model Name",
                "value": "CSB3T"
            },
            {
                "name": "Model Number",
                "value": "55200"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Style",
                "value": "Regular"
            },
            {
                "name": "Capacity 10 Cups",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 10.4 Pounds",
                "value": "Voltage 110 Volts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Speed Brew Technology The BUNN Speed Brew uses a commercial grade stainless steel internal hot water tank that keeps 70oz of water always hot so you can quickly brew at the flip of a lid. Vacuum-Insulated Carafe Double walled stainless steel thermal carafe maintains ideal serving temperature for 2+ hours. Brew a Travel Mug or a Full Carafe Brew as little as 20 ounces to fill a travel mug, or brew a full 10-cup carafe.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f6ac4f12-4fee-4650-8ef5-6129c1dbfced.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dceeddfe-fced-452a-9920-de88be224bd6.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c2f7a91-9611-45d8-b3b5-3a2d521e0f63.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "The Brand Trusted by Restaurants & Cafés Worldwide Some of the world’s largest foodservice brands rely on BUNN equipment to serve high quality beverages every day. Our reputation is built upon BUNN innovations in coffee brewing. Today, the BUNN equipment portfolio is designed, engineered and managed by teams headquartered in Springfield, IL USA. Whether it’s equipment for the most demanding commercial settings or the best cup at home in your kitchen, we are driven by an entrepreneurial DNA to relentlessly pursue the highest quality in the cup for every serving occasion and to use our success to make the world a better place for our customers and our families. Our home coffee makers are built from this tradition and passion. BUNN home coffee makers bring the flavor and quality of the café-style coffee you love directly to the comfort of your home.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffa26514-b50b-459a-aa90-e64031c563c5.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Coffee Focused It all started with coffee. From the first commercial pourover brewer, to our coffee makers in homes today, our passion has always been brewing the best cup of coffee possible. Since the 1950’s, we’ve dedicated ourselves to making advances in the field of coffee brewing. Whether that’s inventing the first-ever flat bottom coffee filter or designing a unique water displacement brewing process that makes coffee available faster than any other 10-cup home coffee maker, our list of industry-leading innovations continues to grow.* BUNN home coffee makers are built to do one thing: brew a delicious cup of coffee reliably…. every day. Every feature is engineered with a focus on that final pour of coffee from a coffee maker that brews purely and without gimmicks. *Based on internal testing of BUNN Speed Brew coffee makers to other similar coffee makers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24334d32-a1d2-4532-94a6-703fdf522289.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fe781d23-ab2a-4d2a-bed7-a0ac3490a11f.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f6ac4f12-4fee-4650-8ef5-6129c1dbfced.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dceeddfe-fced-452a-9920-de88be224bd6.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c2f7a91-9611-45d8-b3b5-3a2d521e0f63.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/639e75df-5b69-42cd-9fd4-b1c3e9bc8e9f.__CR142,0,3550,1098_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffa26514-b50b-459a-aa90-e64031c563c5.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24334d32-a1d2-4532-94a6-703fdf522289.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "B. Bordelon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2AJZUF3L7AJ5QHFZFUNNFIGLOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W58KBJOSTRC1?ASIN=B07GY6PHYZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 24, 2022",
                "reviewTitle": "5.0 out of 5 stars Simplicity at its finest",
                "reviewText": "Sometimes you just want coffee. This coffee maker fits that bill. Simple, fast, reliable, good coffee.Most drip style coffee makers work pretty much the same way. They have a little plastic one-way valve in a tube that lets cold water flow in (towards a heating element). When the water reaches that heating element, it heats and expands. Since it cannot go backwards, it goes forwards - through the tube, up, and out into the coffee grounds. More (cold) water then flows in through that little plastic valve, until all the water has been heated and ejected through the coffee grounds.The problem is with that little plastic valve. It can get \"dirty\" over time, so that it no longer properly prevents water from going backwards. Once water can flow backwards through that valve, it has no need to flow forwards. Brew times increase, and eventually stop altogether.While there is a lot of info all over the internet about how to remove, clean, and reinstall this little valve, you still have to do it - or replace the entire coffee maker.After contemplating doing this teardown yet again on my last coffee maker, I decided \"No more\", and bought this one.This type of coffee maker works differently. There is no valve to malfunction. The water is heated ahead of time, and kept warm until you want a pot of coffee. Then, you pour a pot of cold water in. That water flows in in such a way that it \"pushes\" the already hot water out and over the grounds, resulting in a very fast pot of coffee (3-4 minutes).There are no timers, clock, bells, or whistles on this one. Just a single switch that you leave on (unless going away for days). The brew process simply \"starts\" when you close the filler lid - so just make sure the pot is in place before closing the lid :)",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY43VW5KQWUWKR567CQXPMIRIKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1315N9AN12GKB?ASIN=B07GY6PHYZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Just makes good coffee!",
                "reviewText": "After owning several coffee makers over the years, all with the requisite bells and whistles, I was really looking for something simple and fast. This Bunn is perfect for us.It doesn’t have a built in timer because one isn’t needed. I just get it ready at night, leave the fill lid open, and flip the lid down in the morning. By the time I’ve fed the cat and taken my meds, I have a full pot of hot coffee. The thermal carafe is well insulated - will keep coffee plenty hot for a couple of hours.Be sure to use the Bunn filters if you are used to brewing a full carafe, as those are slightly deeper & may save you from cleaning up an overflow mess.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurel J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMQUBFHNLALWA2C6R7YQP7W5FZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HCPT186D8324?ASIN=B07GY6PHYZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2018",
                "reviewTitle": "5.0 out of 5 stars Quick & Easy -- Makes Great Coffee",
                "reviewText": "For the last several years, I've had a fancy \"grind & brew\" coffee machine. When it quit on me, I almost re-ordered the same machine because it was familiar, fancy and high end. I figured, grinding my own beans seconds before they were brewed had to make the best possible cup of coffee. Then I had coffee at my sister's house, made with a Bunn Speed Brew coffeemaker (different model), and I realized my fancy \"grind and brew\" coffee machine didn't make very good coffee at all. And the more I thought about it, it made sense. That fabulous cup of joe from the local diner is made with a Bunn machine. The convenience store \"air pot\" coffee is made with a Bunn machine. Most likely the after dinner cup from your favorite high-end restaurant is made with a Bunn machine. So I bought the Bunn Speed Brew Platinum Thermal Coffee Maker, and I couldn't be happier. I use knock-off \"donut shop\" blend coffee from my local warehouse club store, Bunn brand coffee filters (a must, because they're taller and you need that for this machine) and plain old tap water and I get a rich, dark, complex cup of coffee every time.I bought the thermal carafe style because I'm the only coffee drinker in the house and I didn't want my coffee \"cooking\" on the burner all day. It keeps the coffee piping hot for a few hours, long enough for me to get through most of the pot. There is no heating element/burner on this model. The glass carafe models have a warming burner, so I can't speak to that.And FAST! This machine makes a full pot of coffee in about three minutes. It has a reservoir that keeps water at a temperature just off the boil at all times, so when you fill the machine with cold water, the hot water is displaced out of the reservoir and immediately starts to brew your coffee. There is no \"brew stop\" feature on this machine, so you have to wait for the entire pot to brew before you can serve yourself, but with a three-minute brew time start to finish, waiting is hardly a problem.Highly recommend this and other Bunn fast brew products.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BriGuy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVHGKS4HJNGA23DUIJGT4R2KBFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KK145YSOY3NS?ASIN=B07GY6PHYZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Great diner coffee at home",
                "reviewText": "Question for the people saying this takes 15-20 minutes to brew a pot of coffee, are you following the instructions properly? You're supposed to leave the power button for the water heating element ON all the time. If you turn it off after every pot, then yes, it's going to take 15-20 minutes to warm back up. This isn't a traditional coffee maker that needs to be turned ON and OFF. Leave it on and you get a pot of coffee in three minutes.Had a commercial Bunn in our house for about 12 years before it passed away. Loved it, but that sucker was huge and I had to disconnect the warmer plates so we could use a thermal carafe instead of the glass ones that came with it. This model gives the simplicity of that commercial brewer with a MUCH smaller footprint, no warmer plates, and a thermal carafe. Works just as well so far. Makes excellent diner-style coffee. If you're looking for some barista Starbucks brew, this isn't your machine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 15, 2023",
                "reviewTitle": "Buen producto",
                "reviewText": "En general BUNN siempre bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 30, 2021",
                "reviewTitle": "Almost perfect coffee maker",
                "reviewText": "Very easy to use. Does exactly as it says and will Brew in 3 minutes.Only improvement I would ask for would be a larger carafe. The 10 cups it makes go much too quickly with regular size mugs.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brig A",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 2, 2021",
                "reviewTitle": "Excellent coffe maker",
                "reviewText": "I purchased this model to replace my Bunn velocity brew, which I had previously owned for about 10 years. I wanted the update of the thermal carafe to stop throwing away coffee that has been on the burner too long. This coffee maker makes excellent coffee very quickly - full pot brews in about 3 1/2 minutes. The carafe works very well to keep my coffee very hot for two hours and drinkably hot for up to 4 hours. I am very pleased with this product and love Bunn coffee makers in general. I had my doubts about the ability of the carafe to keep coffee hot, but no worries - the coffee stays hot and I am throwing away a lot less coffee now. Love it very much.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ian G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 30, 2023",
                "reviewTitle": "Consistent really good coffee",
                "reviewText": "Enough has been published about the unique way in which Bunn is engineered so if you are ok with that you are going to get a really good cup of coffee time after time. We have been using our Speed Brew for a month now and gone is the bitter taste we had become used to. After experimenting on a few different coffees the determination is this coffee maker will give you the very best of whatever beans you choose.A side note about the insulated steel carafe, we had always had a glass carafe which stayed warm on a heat plate. The Bunn Carafe is very good at keeping coffee hot and the fact you can bring it to the breakfast table without loosing heat is a plus.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorena Ponce",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 5, 2022",
                "reviewTitle": "100% recomendable",
                "reviewText": "La ventaja del equipo es que se puede usar constantemente y además que la jarra termo puede guardar el cafe y no se enfria y te puede durar 2 horas sin que pierda su temperatura.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$169.99",
                "sellerName": "Atlantic Waters Inc",
                "sellerRating": "5"
            }
        ]
    }
}