{
    "remaining_requests": 35977,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ninja-12-Cup-Programmable-CE251-Stainless/dp/B07S98411N",
    "body": {
        "name": "Ninja 12-Cup Programmable Coffee Brewer, 2 Brew Styles, Adjustable Warm Plate, 60oz Water Reservoir, Delay Brew - Black/Stainless Steel",
        "price": "$79.99",
        "originalPrice": "$79.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ninja-12-Cup-Programmable-CE251-Stainless/dp/B07S98411N",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BSWWPR5L"
        ],
        "asinVariationValues": [
            {
                "asin": "B07S98411N",
                "variationName": "Color",
                "variationValue": "Stainless Steel",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41SOX63H-GL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/417z+KFuxAL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Copper",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41a55ybKN5L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41SOX63H-GL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/416hMyS5HSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EBTsdsq2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415ILL2oKML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51tEKYdSkeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51APmHdwUYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4147NkHALuL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ninja Store",
            "link": "https://www.amazon.com/stores/Ninja/page/4D837C13-1334-44EE-AD50-9586EE0F3873?ref_=ast_bln"
        },
        "brand": "Ninja",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 24627,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 11 hrs 5 mins",
            "FREE delivery Monday, February 19. Order within 11 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "2 BREW STYLES: Classic or Rich, each brew is flavorful and never bitter with custom brew strengths.",
            "12-CUP GLASS CARAFE: Brew small or large batches of coffee – perfect for day to day or entertaining.",
            "HOTTER BREWING TECHNOLOGY: Delivers even saturation and temperature control for ultra-flavorful coffee.",
            "SMALL BATCH FUNCTION: Ensure your coffee is never diluted when brewing a small batch (1-4 cups).",
            "WAKE UP TO HOT COFFEE: 24-hour programmable delay brew allows you to prepare your brew up to a day in advance.",
            "ADJUSTABLE WARMING PLATE: Keep coffee fresh and flavorful up to 4 hours.",
            "REMOVABLE WATER RESERVOIR: Conveniently carry the 60-oz removable water reservoir to your sink for easy filling.",
            "MID-BREW PAUSE: Pour yourself a cup before the brew is complete.",
            "CLEAN SETTING: Descale your coffee maker at the touch of a button.",
            "WHAT'S INCLUDED: Ninja Programmable Brewer, 12-cup Glass Carafe, Permanent Filter, Ninja Integrated Scoop, & 60-oz removable water reservoir."
        ],
        "description": "Ninja Coffee brewer is a 12 Cup programmable Coffee maker with custom brew strengths and a hotter brewing advanced boiler to make hot, flavorful, and never-bitter Coffee. From a small batch (1-4 Cups) to a full carafe, classic or rich strengths, you can expect the same great taste. Enjoy ultimate convenience with 24-hr delay brew, an adjustable warming plate, and a removable water reservoir.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "60 Fluid Ounces"
            },
            {
                "name": "Special Feature",
                "value": "Removable Water Reservoir,Programmable"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Espresso Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coffee maker"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Camping"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Wattage",
                "value": "1100 watts"
            },
            {
                "name": "Voltage",
                "value": "110 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 24,627 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#664 in Home & Kitchen (See Top 100 in Home & Kitchen) #2 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "Ninja"
            },
            {
                "name": "Included Components",
                "value": "Ninja Integrated Scoop, Removable Water Reservoir, Permanent Filter, 12-cup Glass Carafe"
            },
            {
                "name": "Model Name",
                "value": "CE251 Coffee Maker"
            },
            {
                "name": "Model Number",
                "value": "CE251"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Product Dimensions",
                "value": "8\"D x 10\"W x 14\"H"
            },
            {
                "name": "Item Weight",
                "value": "7 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.00 count"
            },
            {
                "name": "Material",
                "value": "Glass, Plastic"
            },
            {
                "name": "Capacity 60 Fluid Ounces",
                "value": "Material Glass, Plastic"
            },
            {
                "name": "Item Weight 7 Pounds",
                "value": "Wattage 1100 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/75c2f14f-41e1-4111-87a0-80d189b9e4f1.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45b42441-0606-4657-8058-98e1c839ad15.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1995b8c8-15ab-4c82-872c-a2cdf14ea177.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8c0e87cc-b2c9-4cbd-9250-91fa427f90ad.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e78b2fa5-001a-467c-a30f-617951697f5f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/230f0e96-88d5-4e34-ae2e-880ec7a5f042.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2bb15e93-9778-424f-93f6-b16bc23acbdc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6d63a35c-e048-4ca1-9637-879952101eea.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "parm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZBPH6WKEJQZMWZKZKSTDHIIMUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R338KUFF01KCB4?ASIN=B07S98411N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Coffee Maker!",
                "reviewText": "I bought the Ninja coffee maker for the programmable feature. It really makes good, hot coffee and is easy to program. I got the 14 cup size since we make a pot every morning and pour it into a thermal carafe to drink throughout the day where it stays very hot. It is easy to make less if desired but nice to have the option for more. It looks great on my counter, does not take up too much space and can be pushed under the cabinets after brewing. I brew it on the rich cycle which makes a delicious and smooth cup of rich coffee, not at all bitter. I have found that I can use less coffee, six level scoops for twelve cups, than in our previous coffee maker, saving us money. The included attached scoop is very handy. I drink my coffee black and I do not like weak coffee so I am very happy with this ratio. The sprayer head evenly moistens the grounds so there aren't any dry spots in the basket. The higher temperature really extracts the most flavor from the beans. I program it at night so I do not have to wait for the coffee to be made. I do use the paper filters rather than the included gold filter, personal preference, since our coffee is finely ground and I do not want any bits of coffee in my mug. I haven't even tried the gold filter, so it may work perfectly. I plan to clean it monthly since we are using good well water rather than filtered water, which is recommended. The cleaning process is simple and it has a cleaning cycle. I use white vinegar as recommended. Daily I rinse out the carafe, filter basket and water container and leave them upside down to drain which another reviewer recommended. I want to take good care of this machine since we value good coffee. I did get the 4 year warranty since I know coffee makers don't last too long. Hopefully this Ninja will hold up!",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RUKiddingMee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG63KDADEKPMERE3HCBZCYAPNOAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JFYJJ16OC3R8?ASIN=B07S98411N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Very good so far",
                "reviewText": "I bought this coffee maker after going through both a Moccamaster and a Bonavita in less than a year. I have very hard water and the Moccamaster clogged up after I descaled it. It was my fault that I did not descale it often enough, but I misjudged how often it needed it because you can't use reverse osmosis water in it, like I could with my previous brewers. This resulted in a $100 repair in less than a year. I decided to give the Bonavita Enthusiast instead. I tried it because Wirecutter recommended the thermal carafe model (I don't like thermal carafes -- too hard to keep clean), thinking that the glass carafe/hotplate model would be comparable. Big mistake. What a waste of time and money -- they don't pay for free shipping for returns, even when you keep the brewer less than 30 days. The coffee wasn't particularly hot, and then was cold within a short period of time. The hotplate was less than 125 degrees. So next I tried this Ninja model, and my, my, my. Great, perfectly hot coffee for a much lower price. The carafe doesn't drip when you pour. It all goes in the dishwasher or is easy to wipe clean. It has a setting for \"classic\" coffee which I really prefer and the attached scoop accurately measures the appropriate amount of coffee without my having to weigh it. If you want a stronger cup, it has a setting for that. I haven't tried it, but it's there. If you want to brew a smaller amount, it still makes a very tasty pot of coffee.The hotplate heats the carafe before brewing begins, and keeps it hot for at least 2 hours after. You can program it to keep the pot heated for a longer period of time if desired.The built in filter works very well, or you can replace it with paper filters, which is probably healthier. The filter basket has high sides and fits #4 paper filters snugly so that you are less likely to have the paper filter collapse and have a mess all over your counter.All in all, this is an excellent coffee brewer for a reasonable price. It is thoughtfully designed and brews a reliably great cup of coffee. I don't know how durable it is, but I am very pleased so far. It isn't as fast as the Moccamaster, but the coffee tastes better and is just as hot. I'm sticking with the Ninja.",
                "reviewVotes": "57 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "eclaire",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBG4J6MO5SZ657U7ENXW4BFTTFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DYEV0SCIAZ6L?ASIN=B07S98411N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Clear, detachable reservoir separates this coffee maker from the masses.",
                "reviewText": "I've owned this coffee maker over a month now and love it. Intuitive-to-operate controls and a very attractive appearance are among its virtues. Of course, hot water dripping over coffee grinds isn't rocket science and is something most coffee makers do comparably well, and the Ninja likewise makes excellent-tasting coffee.Other reviews were mildly critical of the \"sneak a cup\" functionality, but I've found it on par with that of my last two coffee makers (Krups and Cuisinart). Yes, a couple of drops of coffee will still splash on the hot plate while you pull the carafe out, but I've never used or seen a pot yet that didn't do that, and the spring mechanism on this carafe is at least as robust as any I've seen on other coffee makers.Where this pot really shines is in the clear, detachable water reservoir. That obviously offers you the (completely?) unique option of detaching the tank to fill it over the sink before brewing, which I've done a few times and anticipated doing regularly. Frankly, however, I find it unnecessary because the reservoir itself provides an unusually large opening/target for pouring directly from my filtered water pitcher.But there are other benefits to the reservoir design, including the fact that it allows you to easily monitor the conditions inside . . . i.e., when the moist environment inevitably leads to mildew, you will know it (and, because the reservoir is transparent to any ambient sunlight, mold/mildew should theoretically take longer to manifest in many kitchens.) More importantly, you'll be able to easily clean the reservoir in a sink of hot soapy water (with a little bleach) without repeated electric cleaning and rinse cycles for the whole brewer, followed by awkward attempts to wipe the nooks and crannies of the integral, typically black reservoir with a white paper towel to see if any undesirable residues remain.But perhaps the greatest advantage of this design is in what it will save you if you should *ahem* forget to put your carafe in place before you hit \"brew.\" I've only done this twice in my life but, ironically, both times occurred within the last six weeks: once with my last Krups pot and once with this new Ninja. (Put aside for the moment what such forgetfulness might be saying about me.:-) At the very least, I gained valuable, first-hand experience in how the Ninja's design saved my a$$ while the typical integral design on the Krups resulted in a ruined coffee maker, which prompted my purchase of the Ninja in the first place.)When you fail to put the carafe under the filter spout on a coffee maker that offers the increasingly ubiquitous \"sneak a cup\" feature, the spring mechanism on the filter holder is never engaged and the water that's dripping down over your grinds to make coffee is never given proper egress below. So your mistake may go unnoticed for quite some time since you won't hear the kind of gushing and sizzling sound that an older model without the sneak a cup feature would produce when dripping coffee is merrily dispensing and burning on the naked hotplate below. Instead, the water stays in the filter holder, eventually having nowhere to go but over the sides, which, on the vast majority of drip coffee makers, means that the brewed coffee--complete with floating grinds--will spill over and back into the reservoir itself. That is exactly what happened to my Krups, and, despite hours of repeated cleaning cycles and an aborted effort to dismantle the innards, I realized the pot was shot (no pun intended) and would never process water properly through its (clogged) pump pathway again.Enter the Ninja. After making delicious coffee for a week or so, I, once again, got distracted by something (probably my Yorkie yapping to get out for a morning pee) and neglected to actually seat the carafe on the coffee maker before hitting brew. When I got back in, I noticed the problem just before the brewing coffee was about to overflow the filter holder. The difference was, even had I been a bit later, I would have only had to deal with a messy countertop and not a ruined $80+ coffee maker. In other words, if the Ninja coffee filter overflows, the brewed coffee will NOT go back into the reservoir because the latter is physically higher and isolated from the former in a way that would not permit that. So, should you repeat my negligence, you will hear coffee suddenly dripping on your hotplate and counter top, but you won't have to buy a new coffee maker.The only \"negative\" to the pot is that the carafe lid does not flip up via the common thumb depression above the handle. You have to slide/turn it to remove, which is more easily done with two hands. But this is a very, very minor ding in my view and not worth deducting a star for an otherwise very well-designed, highly practical, and elegant-looking appliance.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kalon schenk ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "Love the colour!",
                "reviewText": "Works great!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 14, 2023",
                "reviewTitle": "Muy rápida.",
                "reviewText": "Prepata el café muy rápido y lo mantiene muy caliente.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 5, 2023",
                "reviewTitle": "Great size for family!",
                "reviewText": "Love this great looking coffee maker, perfect for the whole family! It also has an easy to use programmable feature and makes up to 14 cups, I love it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LUIS OROPEZA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 4, 2023",
                "reviewTitle": "Cumple",
                "reviewText": "Lo que más me gustó es que la capacidad de la jarra es de dos litros; es programable y cómoda de usar. Lo que menos me gustó es que la jarra se siente relativamente frágil, cómo todas las de este mecanismo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MNKER17",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 19, 2023",
                "reviewTitle": "Not power convertible",
                "reviewText": "It is brought to the UK with a two pinned plug, you have to buy a US to UK adaptor for around £11 which blows your electrics,",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}