{
    "remaining_requests": 35914,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/OXO-Cup-Coffee-Maker-8718800/dp/B07H9G93WK",
    "body": {
        "name": "OXO Brew 8 Cup Coffee Maker, Stainless Steel",
        "price": "$177.99",
        "originalPrice": "$199.95",
        "rawPrice": 177.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/OXO-Cup-Coffee-Maker-8718800/dp/B07H9G93WK",
        "soldBy": {
            "sellerID": "AV6M50AA86WE8",
            "name": "Pure Commerce LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AV6M50AA86WE8&asin=B07H9G93WK&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31wVxw3p vL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Z6xUQdPzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41l5NW67ucL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41H7t 0Qc9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41dryK5YjlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ygbCEK wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51W8EXP9n0L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the OXO Store",
            "link": "https://www.amazon.com/stores/OXO/page/58FC57D0-38D8-4C7B-ACEF-9C6CD042DED6?ref_=ast_bln"
        },
        "brand": "OXO",
        "merchantInfo": "Pure Commerce LLC",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 3843,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 8 hrs 53 mins",
            "FREE pickup Sunday, February 18. Order within 8 hrs 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Gold-standard coffee certified by the Specialty Coffee Association (SCA). Brew by the cup or the carafe.",
            "Single-serve capability with optional brew basket accessory optimizes flavor",
            "BetterBrew precision controls water temperature and brew cycles; meeting the Specialty Coffee Association's Golden Cup standard",
            "Rainmaker shower head evenly distributes water over grounds",
            "Double-wall, vacuum-insulated thermal carafe with brew-through, pour-through carafe lid",
            "Removable well cover elevates short mugs or makes room for tall mugs",
            "Features convenient cleaning mode",
            "Sized to fit under cabinets",
            "Includes 10 paper coffee filters and a coffee scoop"
        ],
        "description": "Whether you're brewing a single mug or a full pot, the OXO Brew 8-Cup Coffee Maker ensures a better-tasting cup—every time. Engineered with BetterBrew™ precision brewing to control water temperature, water volume and brewing time, the 8-Cup Coffee Maker is certified by the Specialty Coffee Association (SCA) for meeting its rigorous home brewing standards. The Rainmaker™ showerhead distributes water evenly over coffee grounds, while the integrated bloom cycle allows for optimal flavor extraction.The double-wall, vacuum-insulated thermal carafe keeps your coffee hot, and the brew-through, pour-through lid means you don't have to fuss with opening the carafe lid before pouring. The sleek, stainless steel Coffee Maker has a space-efficient design that fits under cabinets when not in use. Easily run the convenient cleaning mode to keep the machine in tip-top shape. The Coffee Maker can also brew a single cup of coffee right into your favorite travel mug. You can flip the well cover to elevate shorter mugs or remove it to make space for tall travel mugs. The Coffee Maker comes with an optional single-serve accessory to enhance the flavor of one-mug brewing: Add a filter to the accessory and then place it in the large basket to brew.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "40 Fluid Ounces"
            },
            {
                "name": "Special Feature",
                "value": "Thermal,Auto Clean Function"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Vacuum Coffee Pot"
            },
            {
                "name": "Filter Type",
                "value": "Paper"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coffee"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Wattage",
                "value": "1400 watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "10.5\"D x 7\"W x 13.5\"H"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 3,843 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20,032 in Home & Kitchen (See Top 100 in Home & Kitchen) #59 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "OXO"
            },
            {
                "name": "Included Components",
                "value": "Base, Carafe, 2 Baskets, Coffee Scoop, Rainmaker"
            },
            {
                "name": "Model Name",
                "value": "OXO"
            },
            {
                "name": "Model Number",
                "value": "8718800"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Color",
                "value": "Black, Stainless Steel"
            },
            {
                "name": "Style",
                "value": "Casual"
            },
            {
                "name": "Capacity 40 Fluid Ounces",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Wattage 1400 watts",
                "value": "Voltage 120 Volts"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d7dc3375-54fd-4eef-81c8-61f1bc84d2c5.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/b739df6a-0df1-4787-a1c4-0fead991eb68.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4701477-caaa-4d21-a4ba-6ffd49147cf4.__CR0,2,979,303_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbb7cd32-a72d-46d4-9da2-a8d38aa837ce.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "anonymouse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3J4URFBZBEJLJIDNTX6PI7HRHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2F2MD9ZST7LYA?ASIN=B07H9G93WK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Great coffee maker, but pricey.",
                "reviewText": "Warning, this is a critical review. I give this a 5 star because overall product merits an excellent rating. However, if I was to rate this based on value, I rate it a 3 star.I'm not a coffee snob. I like my cheap coffee. I've watched several coffee snob reviews on this product prior to purchase, and this is my take. What the heck is the difference between a $30 drip coffee maker and a $300 drip coffee maker? Well, it's the same difference between a 900watt microwave and a 1400watt microwave. This $300 coffee maker has a higher wattage heating element. Which means it'll heat the water of faster and hotter. Does it make that big of a difference? That's something only a coffee snob can tell you. I'll say this: I can tell the difference. It's not earth shattering, but it does make a difference. Does it make a $200+ difference? Most will say 'no'.So now I move onto rating the coffee maker on overall quality. This is where I get a little more critical. Why? Because it's OXO. I own lots of OXO products and I love them all. I'll be honest and say, this feels more like an OXO product in the making. It's not the user experience I'd expect from OXO. Translation, this misses the mark on being sensational. The insulated carafe is nice, but OXO could have done better. It's a quality carafe, but like some reviewers point out, it leaves about a table spoon or more of liquid when done pouring. It's a minor inconvenience. But ever day use will add up that frustration. Means when you clean the carafe, you'll have that fair amount of water left inside as well. I admit, it is annoying. Very surprised OXO couldn't have designed that better...for $300.The other complain perceived by many is the filter basket. This is my biggest complaint. For $300 and being OXO, this is really were they missed the mark. The basket is flimsy. Not the $300 quality I'd expect. The snap into place operation is clunky. It doesn't just easily slide into place. Little details you'd expect from a brand like OXO are completely missing here. I personally find the selection of 2-4 cup vs 4-8 cup a garbage design. I've used both modes. Makes little to no difference. I recommend using the carafe at all times. The 2-4 cup operation is a waste. And because of that waste, it adds to the frustration of the lacking filter basket design. The sliding lever you use to select 2-4 vs 4-8 doesn't lock into place. That will annoy you. The big difference between 2-4 vs 4-8 is having a choice of which type of filter you want to use. THAT is where OXO could have made a killing on their design. For whatever reason, most expensive coffee makers opt for basket style filters. I personally hate them. They're a pain to use and tedious to fiddle with in the morning. Conical filters are superior in my opinion. It's great that OXO created an option to use conical filters. However, as pointed out their filter basket design is garbage. Not worth using conical filters in the 2-4 cup mode. My advise to OXO, fix this aspect of your coffee maker! The filter basket design will make you crave your Mr. Coffee simplicity. This filter basket will make your $300 coffee maker feel cheaper than a $30 coffee maker. The coffee snob channels will detail how wonderful the filter basket design disperses the water and so on. Garbage observations. Even a $30 coffee maker does the same job.The last complain is so trivial, and yet surprised OXO could have designed this better. Why the two power buttons? You turn on power, then you actually need to select 2-4 vs 4-8 for brewing? Why? Maybe it needs to sense you're boiling less water vs more water. It couldn't have been designed to sense that? The fact that the coffee maker will auto shut off really hammers home the uselessness of having two buttons.Why am I complaining so much right? It's because it's OXO! You expect something different with OXO. You expect great quality and super simple operation. And I admit you don't feel that with this coffee maker. It should have been a one button design from the start. You expect OXO to be innovative. There's nothing innovating in this design. Nothing at all. It's just a quality coffee maker with seemly more complexity in it's cheap filter basket design than what's needed. OXO had a great idea in allowing both conical filters and basket style filters. It's a shame they couldn't have executed on that design better. I personally would prefer conical filters. Especially for an OXO product. Why? Because conical filters are always easer to work with. People buy OXO because they like simple quality and easy. Saying that, they may want to cater their next design to those that prefer conical style filters.I definitely have some criticism for this product. Keep in mind the harsh criticism is do to the $300 price tag and it having the OXO brand. You expect something different from both. Do I recommend buying the product? Oddly yes. I admit in the world of automatic drip coffee makers, no one really rises to the challenge of nailing the perfect design when it comes to quality and simplicity. That surprises me to this day. It's just a coffee maker! I commend OXO for it's styling. To be honest, that's why I bought it. I would have bought the Brawn if it had the better heating element. Overall it's a 5 star compared to competition. A solid 3 star in falling short of OXO expectations.",
                "reviewVotes": "100 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maryann S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECQRUIQVPE2RWJHWFDT5CSCSAHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B5NU9UKRPM2R?ASIN=B07H9G93WK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars I love OXO, but almost $200 for a Coffee Maker??",
                "reviewText": "I love OXO. I have many of their products. They are good quality and generally inexpensive. My favorite item is the OXO Good Grips Kitchen Appliance Cleaning Set, 2 little brushes with scrapers. So handy! Recently I decided to replace my 20-year-old Mr. Coffee maker. It was just too difficult to clean, and the coffee was blah. I had read many great reviews for the OXO 8 Cup Coffee Maker. It just seemed so expensive, almost $200. A few years ago, I purchased the OXO Brew Single Serve Pour Over Coffee Maker. I just love this product. Less than $20 and makes the perfect cup of coffee. Even with the Pour Over I still wanted a regular coffee maker. One morning in November I woke up and realized life is too short not to have a good coffee maker. I really like a good cup of coffee, so I ordered the OXO 8 Cup Coffee Maker before I could change my mind. It makes a great cup of coffee. FYI - it recommends filtered water, so I had to buy a pitcher with a filter. Another expense, but for that great cup of coffee I felt it was worth it. Also, I treated myself to several bags of my favorite blend, because I now had the best coffee maker. Likes: it brews fast, I make only 4 cups in the morning, and it is done in under 5 minutes. It is easy to clean, I can get my hand inside the coffee pot to clean it. Dislikes: no brew delay so you cannot sneak a cup before it’s finished, but it is fast; no timer (I’m retired, so I don’t really need that) no clock (I kinda miss that, but not a deal breaker). Should you spend almost $200 for a coffee maker? If it has the features you want and it’s in your budget maybe you should.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon Stephenson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5F5HBLOWSU5IJEM6TWRPFB2RGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38DY8OITK8QV0?ASIN=B07H9G93WK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2021",
                "reviewTitle": "4.0 out of 5 stars Love my OXO!",
                "reviewText": "There’s really nothing I truly dislike about this coffee maker. I purchased this 3 months ago after getting tired using a single cup brewer and having to set it all up again anytime I wanted a 2nd cup. I love how beautifully sleek the OXO is and fits my minimalist design style (it’s gorgeous on my counter!). I love that the entire water reservoir is visible and it’s easy to eyeball the amount of water you’ve poured in. I love that there’s no warming plate that eventually peels and looks gross when coffee drips on it over time, and lends to burnt and bitter tasting coffee when the pot sits on that plate too long or the plate temp is too high. I don’t find the coffee stays that hot for very long after brewing in the thermal carafe, but we don’t need it to since we usually drink all the coffee within 60-90 min of brewing it. I also love that the outside of the thermal carafe is cool to the touch…no worry of accidentally touching a hot glass carafe and being burnt, and I can take the carafe across the kitchen to fill my cup and put it down on the counter if I really wanted to w/out worrying about the heat from the carafe damaging my counters. Similarly, I don’t have to worry about my little one accidentally touching the carafe or the plate it sits on in the machine and getting his little fingers burned. I also love that I can remove and wash the piece where the water drips through onto the grounds. That’s amazing since the holes in my last machine would get clogged and I could never seem to clear them. And most importantly, it consistently makes great tasting coffee.My only reasons for not giving it 5 stars is that the carafe doesn’t allow you to pour out all the coffee…the interior rim prevents this. Same reason why drying it upside down after washing it out will always leave water inside…the water can’t fully drain out because of that rim. So I always have to towel dry the inside. Annoying but not a deal breaker. It would also be great if it had a programmable timer so I could set it up to brew from the night before, but honestly this isn’t detrimental since it brews a full pot so incredibly quick. I do wish it had a water filter component like other machines so I could fill it up with tap water rather than needing to use the filtered water from my fridge’s dispenser, which takes longer than the sink’s faucet. I do wish there was a slight slant to the bottom of the reservoir tank so that all the water would get funneled through. Instead, it’s flat and a few small puddles always get left on the bottom that requires me to wipe it out when it’s done brewing. And finally, For some reason there’s a plastic-y taste in the coffee the times I’ve used the smaller basket accessory to brew just 2 cups, despite washing and rewashing the basket. I also find that flipping the base over to bring the cup closer to the top is insufficient as it’s still too far away and coffee splashes around the counter anytime I’ve tried it.Overall, I’m extremely pleased with this purchase and am so glad I did some research and didn’t just get a bulky cuisinart because that’s what most people have!",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 19, 2023",
                "reviewTitle": "Muy buena",
                "reviewText": "El café sabe espectacular. Yo lleno casi toda la cuchara por cada taza. Pero eso depende de como le guste a cada uno. La jarra completa tarda 5 minutos en hacerse.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Can Con (Canadian Consumer)",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 11, 2023",
                "reviewTitle": "Now THAT’s a fine cuppa joe!",
                "reviewText": "OXO 8 Cup Coffee Maker Review updateWe have now had the unit for about two weeks and as a result I can give a more complete review.The unit is a smaller coffee maker, unlike many other more conventional home brewers. It is able to brew anywhere from two to eight coffee industry standard 5 ounce cups, or 40 fluid ounces in total. I point this out as the Amazon description still lists it as making 64 fluid ounces. I sent in a note to Amazon about correcting that mistake but nothing has changed yet.Interface:- The interface is uncluttered and intuitive, with none of the stuff I don’t want.- It has only 4 buttons: Power, 2-4 cups, 5-8 cups, Clean.- No unnecessary clock or timer functions.- Two brew baskets: the standard “main” basket and an insert for making lesser amounts- The base has a recessed pedestal which can be flipped over to lift a mug up when brewing directly into the mugUsage:- I have now used all options for making a brew:- 2-4 cups setting into both a pot and a mug, 5-8 cups into a pot.- Water comes in hot and FAST. Initial bloom phase (flow then pause) lasts about 30 seconds to a minute.- Coffee is ready in 7 minutes or less, depending on amount being made.- No spills or leaks seen at any time.- A few small drips and spatters when making the brew into a mug. Use a tall mug. Note: the included pedestal is your friend here. Make use of it.- Coffee is hot. The pot keeps it between low 170s and mid 180s (°F) for at least an hour.Quality of brew:- Flavourful, especially at the larger volumes (5-8 cups).- Flavour intensifies as it cools. This was expected.A note on the coffee grind & amount:- Grind: - Medium, i.e. use as directed by the manual to start. - Too coarse or not enough coffee and the flavour will be thin. - Too fine or too much coffee and the resulting brew might be over extracted. It might even clog. See note on water flow above. I never saw this happen but I suppose it is possible.- Amount: - Use as directed (~ 8 gm / 5 oz cup) for larger amounts to start. - Use slightly more for lesser amounts (2-4 cups), especially when brewing into a mug (~ 2 cups).Once you’ve played with it for a while, I have no doubt the sweet spot will be found for your favourite coffee beans and the amount of coffee you like to make.The one feature I have yet to use is the “Clean” function. That won’t be for another two months or so, given our use of the brewer.All in all, a great coffee maker, well worth the price of admission.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karrenola",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on June 5, 2023",
                "reviewTitle": "DELICIOUS coffee FINALLY",
                "reviewText": "So after my beloved National brand coffee maker (which I bought off a guy leaving Japan three decades ago) finally died at age 30, I went through the hell of trying to find a simple coffee maker to do the same great job. Yup, it took another five years to find one after failing with several costly others. This one by OXO was rated by several people on the web so of course it's easy to be skeptical, but one review convinced me to try it. Lo and behold...delicious coffee SO simple to make is BACK! Keeps the coffee HOT without burning it like my beloved National used to do, so it one upped it lol. Yeah it's great, Alice. Worth every penny. Get one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bukbuk",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 22, 2023",
                "reviewTitle": "Very easy to use, low power consumption, makes great coffee",
                "reviewText": "Been using this coffee maker for about 3 weeks. It works great, very easy to setup and use, carafe cleans easy. The defuse dripper comes off for each cleaning if you get any splash back.I decided to try out this unit because I was burning out the heating elements on my previous 4 coffee makers that use a glass pot and keep a heating element on for hours while I slowly go through my pot of coffee. I found no coffee maker of that heating element style could last more than 2-5 years of daily use before the heating element failed. This OXO unit only keeps the heating element on for 15 min, the insulated carafe will keep the coffee steaming hot for 3-4 hours, and luke warm even 8 hours later. My hope is that the heating element in this unit will last many times longer running a fraction of the time my old ones did.Two things to note:The carafe, does not completely drain all of its liquid with a straight pour. The lip will hang onto a couple table spoons of coffee or water unless you give it a little shake it slightly.For the people that find it overflows when making coffee spilling coffee and grains around the lip of the carafe or down the sides, I made the mistake of not removing the 2-4cup filter insert from the unit and tried to brew a full pot. The 2-4 cup insert can't handle the volume of water the maker releases towards the end of it's full pot cycle. I suspect the other reviewers that complain about overflow issues have likely made the same mistake I did. The unit should not overflow as long as you don't brew a full pot with the 2-4 cup insert installed. :D",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": ":)",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 7, 2023",
                "reviewTitle": "excelente cafetera",
                "reviewText": "Prepara rapidísimo el café. (menos de 4 minutos para 6 tazas)Además, ahorra energía con su jarra, pues conserva el calor por más de dos horas...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$177.99",
                "sellerName": "Pure Commerce LLC",
                "sellerRating": "4.5"
            }
        ]
    }
}