{
    "remaining_requests": 35897,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BUNN-Classic-10-Cup-Coffee-Brewer/dp/B000FFILRO",
    "body": {
        "name": "BUNN BX Speed Brew Classic 10-Cup Coffee Brewer, Black",
        "price": "$119.98",
        "originalPrice": "$139.99",
        "rawPrice": 119.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BUNN-Classic-10-Cup-Coffee-Brewer/dp/B000FFILRO",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41s7JAmjR1L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51IOEt9nbNL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BUNN Store",
            "link": "https://www.amazon.com/stores/BUNN/page/CBF838CB-A39F-4EAE-8509-F490064A2B2D?ref_=ast_bln"
        },
        "brand": "BUNN",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 6359,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 8 hrs 50 mins",
            "FREE delivery February 21 - 23",
            "Or fastest delivery February 19 - 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "BUNN BREWS DIFFERENTLY - The BUNN Speed Brew uses an internal commercial grade stainless steel hot water tank that keeps 70oz of water always hot so you can quickly brew at the flip of a lid.",
            "CLASSIC SPEED BREW look with a stainless-steel faceplate and tank wrap design.",
            "DESIGNED AND ASSEMBLED in the USA.",
            "EXCLUSIVE DRIP-FREE CARAFE delivers the cleanest pour on the market with a proprietary lid and spout design that arcs the coffee into the cup and wicks the rest back into the carafe.",
            "SWITCH ACTIVATED warmer plate keeps your coffee at optimal serving temperature.",
            "FASTEST 10-CUP HOME COFFEE MAKER* - Our technology allows our coffee maker to brew a full carafe of coffee in 4 minutes, half the time of typical coffee makers. *Based on internal testing of BUNN Speed Brew coffee makers to other similar coffee makers.",
            "CAFÉ TASTE AT HOME - Commercial style multi-stream sprayhead evenly showers hot water.",
            "BREW A TRAVEL MUG OR A CARAFE - Brews 20oz to fill a travel mug in 2 minutes, or a full 50oz carafe in 4 minutes.",
            "WE ARE HERE TO HELP - Customer Service Team Located in Springfield, IL, USA to take your calls and emails.",
            "BUILT TO LAST - 3-Year Warranty on all Speed Brew models.",
            "Brews 4 to 10 cups (20 to 50 oz) in about 3 minutes",
            "Glass carafe and porcelain-coated warming plate with lighted on/off switch",
            "Unique sprayhead ensures even, complete coffee flavor extraction",
            "Stainless steel internal hot water tank keeps water heated to optimal brewing temperature of 200 degrees F",
            "Product Built to North American Electrical Standards"
        ],
        "description": "With Velocity Brew - our traditional quick brewing brewers - water is kept at the optimal brewing temperature in an internal hot water tank. This means it's ready to brew when you are and deliver delicious, hot coffee in about 3 minutes.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "10 Cups"
            },
            {
                "name": "Special Feature",
                "value": "Fastest 10-cup home coffee maker*"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Paper"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Hot Coffee"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Wattage",
                "value": "900"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Product Dimensions",
                "value": "7.1\"D x 13.8\"W x 14.3\"H"
            },
            {
                "name": "Item Weight",
                "value": "8 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1 Coffee Brewer"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 6,359 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,918 in Home & Kitchen (See Top 100 in Home & Kitchen) #45 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "BUNN"
            },
            {
                "name": "Included Components",
                "value": "Funnel, Drip-Free Glass Carafe"
            },
            {
                "name": "Model Name",
                "value": "BX"
            },
            {
                "name": "Model Number",
                "value": "38300.0066"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Capacity 10 Cups",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 8 Pounds",
                "value": "Wattage 900"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Speed Brew Technology The BUNN Speed Brew uses a commercial grade stainless steel internal hot water tank that keeps 70oz of water always hot so you can quickly brew at the flip of a lid. Brew a Travel Mug or a Full Carafe Brew as little as 20 ounces to fill a travel mug, or brew a full 10-cup carafe. Drip-free Carafe Exclusive carafe delivers the cleanest pour on the market with a proprietary lid and spout design that arcs the coffee into the cup and wicks the rest back into the carafe. (models with glass carafe) Thermal Carafe Vacuum insulated, double walled stainless steel thermal carafe maintains ideal serving temperature for 2+ hours. (model with thermal carafe)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d905298f-4dd7-4adf-8891-3ac824852908.__CR0,0,928,928_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/92eb93e6-f0e2-4e49-adf3-3c77469e2d4e.__CR0,0,928,928_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/99167d37-4f22-45b5-bb89-b3d980de9600.__CR0,0,611,611_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5af02efa-bf69-4296-b2b7-2a714899aa98.__CR0,0,300,300_PT0_SX220_V1___.png"
                ]
            },
            {
                "media_text": "The Brand Trusted by Restaurants & Cafés Worldwide Some of the world’s largest foodservice brands rely on BUNN equipment to serve high quality beverages every day. Our reputation is built upon BUNN innovations in coffee brewing. Today, the BUNN equipment portfolio is designed, engineered and managed by teams headquartered in Springfield, IL USA. Whether it’s equipment for the most demanding commercial settings or the best cup at home in your kitchen, we are driven by an entrepreneurial DNA to relentlessly pursue the highest quality in the cup for every serving occasion and to use our success to make the world a better place for our customers and our families. Our home coffee makers are built from this tradition and passion. BUNN home coffee makers bring the flavor and quality of the café-style coffee you love directly to the comfort of your home.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffa26514-b50b-459a-aa90-e64031c563c5.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Coffee Focused It all started with coffee. From the first commercial pourover brewer, to our coffee makers in homes today, our passion has always been brewing the best cup of coffee possible. Since the 1950’s, we’ve dedicated ourselves to making advances in the field of coffee brewing. Whether that’s inventing the first-ever flat bottom coffee filter or designing a unique water displacement brewing process that makes coffee available faster than any other 10-cup home coffee maker, our list of industry-leading innovations continues to grow.* BUNN home coffee makers are built to do one thing: brew a delicious cup of coffee reliably…. every day. Every feature is engineered with a focus on that final pour of coffee from a coffee maker that brews purely and without gimmicks. *Based on internal testing of BUNN Speed Brew coffee makers to other similar coffee makers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10c25934-f720-4d08-b047-cfeb56033b9f.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/122c194a-8a96-4416-af6e-80111eec44ee.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d905298f-4dd7-4adf-8891-3ac824852908.__CR0,0,928,928_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/92eb93e6-f0e2-4e49-adf3-3c77469e2d4e.__CR0,0,928,928_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/99167d37-4f22-45b5-bb89-b3d980de9600.__CR0,0,611,611_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5af02efa-bf69-4296-b2b7-2a714899aa98.__CR0,0,300,300_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/563bf9f6-4097-41a6-9301-90cb40a0dc78.__CR142,0,3550,1098_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffa26514-b50b-459a-aa90-e64031c563c5.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10c25934-f720-4d08-b047-cfeb56033b9f.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kira-Lynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3P44SUUQDG6WUZYIGA47IVZTLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25EZLID5QOURZ?ASIN=B000FFILRO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 22, 2016",
                "reviewTitle": "5.0 out of 5 stars **UPDATE: Smell DOES disappate, worth the wait.**",
                "reviewText": "Updated review, now 5 stars and would give more if I could:The metallic/burning plastic smell from the liner of the water tank did indeed disappate completeley after about 3.5 weeks (longer than Bunn's claimed 1-2 weeks) and we are so glad we stuck with it. Seriously if the thing broke today, I'd pay for same day delivery, instant replacement. Coffee is *perfect* every single time without exception. Flavored, unflavored, regular, decaf...it matters not. Consistent, hot, delicious and done in 2 minutes flat.The other issue with the grounds spewing everywhere was fixed by a promt, free package from Bunn supplying different water flow restrictor sprayheads to pop in. Issue has never recurred. Problem solved.We've had it for 2 years now and haven't really ever done a deep clean on it. We only put filtered water in so build-up is minimal. At first we thought it might be scary having an appliance that is \"on\" and warm all the time, but it isn't. You shut the whole thing down if you're going to be gone for more than 48 hours. The fun part is trying to remember to turn it back on when you return from vacation...it does take several hours to fully warm back up so you're in for a sad surprise in the morning if you forget.We can't live without it._____________________Previous review:Bottom line: I'd give it five stars for the quality and consistency of the coffee it brews but the smell people are complaining about? Yeah, that's real and it is a real problem.But I can only give it three because we are among the unfortunate buyers experiencing the powerful metallic (some call it burning plastic which I understand) smell that has radiated from the stainless steel water tank since the day we set it up three and a half weeks ago. The smell was nauseating at first and headache-inducing. Bunn assures that it goes away after a week or two. It has not. It has dissipated over time, though not to our satisfaction. You can read other reviews about the nature of the smell (an epoxy lining of the water tank that needs to seal before the smell goes away) which is why running vinegar through it does not help...I don't think it is *in* the water tank itself or touching the water, but rather within the lining of the tank.We also experienced the issue with the water and grounds overflowing the first pot we made as so many 1 and 2-star reviewers have noted. It was literally a hot mess that took too long to clean up and was a very disheartening first go with an expensive coffee maker. We ordered the free alternative spray head from Bunn which arrived promptly and solved that problem. (Note: that issue is caused by too-fine coffee grounds/decaf which I assume is because decaf is generally more finely ground than regular coffee. My husband can't have caffeine so we primarily brew decaf).I can't believe we have stuck with it this long, honestly. For the money we spent we would expect perfection from any other product and an industry leader like Bunn should be ashamed of themselves for a sub-par product. Sadly we've now been seduced by the quality and the *consistency* of the coffee it brews each & every time after years of Mr. Coffee makers which make a great pot one day, an awful one the next. We've decided to stick with it and see if the smell truly does go away over time because not enough people have hung in there longer than two weeks to testify to its disappearance. So we're doing it for you--ha ha.We'll keep you posted on the dissipation (or not) of the smell.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AmazonGirlAmazonGirl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6XVBZRNGDLWL3A47RR44BZTBMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBV2KQAW2A9QM?ASIN=B000FFILRO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2016",
                "reviewTitle": "5.0 out of 5 stars Love My Bunn!",
                "reviewText": "I purchased the Bunn BXB Velocity Brew coffee maker to replace my old 1989 Bunn which started leaking at the bottom. Yes, 1989. My coffee pot was only a few years younger than me and I loved that thing. But, it was leaking so I thought it was done for and ordered this Bunn to replace it.The first two I received were either broken or scratched so I sent them back. The third time was a charm though, because the third one that arrived wasn’t broke, scratched, or had anything else wrong with it that I could tell. Also, no burning smell like other people have had. That’s not normal imo and if you have that problem, I recommend sending it back.We got it set up and so far it’s working as a Bunn should. I would like to note though, that after the initial set up, quite a bit of water kept dripping from the nozzle. I ran another pot of water through and it stopped the dripping. I haven’t had anymore issues with it dripping from the nozzle.If you are new to Bunn you should know… - These are not like your typical standard coffee makers. I’ve seen a lot of complaints and low ratings in the reviews because some people weren’t quite aware of what they were purchasing. You shouldn’t give bad ratings when the product is doing what it’s supposed to do. Which brings me to my next few points… - A Bunn coffee maker holds and heats water in the tank 24/7. That is how you have coffee or hot water in 2-3 minutes. I have used a 1989 Bunn for many years. I assure you, it’s safe, and you can leave the house or sleep without unplugging it. The only time we turn it off is when we’re not going to be home for a couple days. As the water heats, it also evaporates, so if you don't use it for several days the water level can get low. - Even though it heats water 24/7 it doesn’t significantly increase the electric bill. To check this, I went to my energy dashboard on FPL and took a look at my daily electric usage since I was without a Bunn for a week while I waited on a new one to come in. There’s no difference in electricity usage during the week I had no Bunn plugged in. - Because it heats the water 24/7, this isn’t the best coffee pot for someone who doesn’t plan to use it every day or every other day. Again, the water will slowly evaporate.Why I love my Bunn… - I’m not a morning person and I have hot coffee within a couple minutes. It’s super fast compared to your standard coffee maker. - It keeps the water hot but not boiling hot so I can drink my coffee as soon as it’s made. - You get out as much water as you put in. Perfect for when I only need a small amount of hot water.What I use my Bunn for other than coffee… - Hot water for tea & hot chocolate - Hot water for cleaning - Hot water for cooking (especially bullion cubes or other powdered sauce mixes that need to be mixed with hot water)What I don’t like about my Bunn… - Emptying out the tank isn’t fun - Cleaning the tank isn’t fun either - Both are much more time consuming than cleaning a standard coffee pot. - With this newer model I don’t like that the nozzle that came with the coffee maker comes out so fast you can’t brew decaf. That’s why people have coffee grounds shooting out of the basket. It’s a huge failure on the company’s part for this even being an issue. I should be able to brew decaf without having to worry about an over flow or spending money on another part. My old Bunn brewed decaf and finely ground coffee with no problems so I expected the same with this one.You can order another nozzle for decaf or more finely ground coffee so the water comes out slower and doesn’t over flow the basket, but that’s the nozzle that should’ve been included with the coffee maker to begin with.Overall, I’m happy with this Bunn so far, though I have zero faith it will last anywhere near as long as my old one. Hopefully, for as much as I paid for this thing, it’ll meet my expectations, but if not I have a backup as I had my husband fix my 1989 Bunn and it’s now back in perfect working condition :)***UPDATE 1/11/18***I planned on doing an update at one year, but our mobile home in the lower Florida Keys got a direct hit from Irma and I was pretty sure my Bunn died. Miraculously, the house and my Bunn survived! The house shook so violently, my microwave was on the floor when I got home, but this guy didn't move an inch! Even the carafe was still in place!Even after all the trauma my poor Bunn went through, it survived the storm. It's still working great and is still in perfect condition. No funny smells and I've never once had an over flow, even when brewing decaf Foldgers. And that's with using the standard nozzle that came with the unit. I also haven't had any issues with the nozzle dripping water when it shouldn't be. Actually, I haven't had any issues. It works perfectly.I have my routine. I pour my water in to brew my coffee. I get my coffee cup, and add the cream and sugar. Stir. By the time I do this, my coffee is usually ready to be poured. Just to give you an idea of how quick this thing is!Also, I know a few people have asked, but my husband and I cannot remember how he fixed my 1989 Bunn from leaking. It's still kicking though :)",
                "reviewVotes": "144 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71FcsH1rZ8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71Pmcu4NjoL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71QTeWN0ldL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie O'Connor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 7, 2024",
                "reviewTitle": "Needs Cleaning OFten",
                "reviewText": "This is my third bun pot.It did not come with the cleaning stick the previous two had.I find that I need to clean this monthly while my other pots were every two months at best.My water hasn't changed, so something in the pot must have.That said, the fast coffee is worth the effort and this is a top quality pot.Will buy again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TravelPro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 3, 2022",
                "reviewTitle": "Best coffee maker you will ever own",
                "reviewText": "This is my second one and only because I lost the first to my ex LOLThey are fast And make delicious coffee.Make sure you buy the bunn filters or it will overflow from the filter if it can’t drain fast enough",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy Noel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2024",
                "reviewTitle": "Bunn coffee maker",
                "reviewText": "The funny carafe works amazingly, no drips",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mike",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 26, 2023",
                "reviewTitle": "Fast and consistent good coffee",
                "reviewText": "I love how this machine works and the concept of it. Different but so simple and no frills. It's so fast it doesn't even need a timer. I start it and it's done by the time i get my cup out of the cupboard and put cream in it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doreen Williams",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2024",
                "reviewTitle": "Bunn delivers",
                "reviewText": "This is a fast reliable coffee machine. Worth the price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$117.00",
                "sellerName": "everything_anything",
                "sellerRating": "4.5"
            }
        ]
    }
}