{
    "remaining_requests": 35933,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Breville-BDC450-Precision-Brewer-Thermal/dp/B078RQVQF1",
    "body": {
        "name": "Breville Precision Brewer Thermal Coffee Maker, 60 oz. Brushed Stainless Steel, BDC450BSS",
        "price": "$329.95$281.06",
        "originalPrice": "$329.95",
        "rawPrice": 329.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Breville-BDC450-Precision-Brewer-Thermal/dp/B078RQVQF1",
        "soldBy": {
            "sellerID": "A1RHZSN6VRQHCL",
            "name": "Everything Kitchens",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1RHZSN6VRQHCL&asin=B078RQVQF1&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Ja26jZ2jL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51XJ49jjMZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uGhS3sxnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-yvuPO1kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F9emhIsaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WH6IByCUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mxaGexsAL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1pyDiObgpL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1pyDiObgpL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Breville Store",
            "link": "https://www.amazon.com/stores/Breville/page/EBBDE160-83A6-4DE3-A1B2-C27D03CABFF6?ref_=ast_bln"
        },
        "brand": "Breville",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2327,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 22 hrs 59 mins.",
            "FREE delivery Monday, February 19. Order within 8 hrs 59 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Earn up to $200 cashback with a Beanz coffee subscription when you purchase a selected Breville espresso machine. Valid Aug 1, 2023 until Jun 30, 2024",
            "The Breville Precision Brewer Thermal is a 60 oz drip coffee maker with thermal carafe that allows you to brew third wave specialty coffee at home, automatically; Experience your favorite coffee at its best with precise temperature and brewing time",
            "AUTOMATIC PRESETS AND CUSTOMIZABLE: 6 unique brewing modes ensure you enjoy the perfect balanced coffee every time; Preset modes include Gold, Fast, Strong, Iced, Cold Brew and My Brew, all so you can experience your favorite coffee at its best",
            "PRECISE & ADJUSTABLE TEMPERATURE: Coffee maker with precise digital temperature control (PID), 3 different flow rates to optimize contact time and Thermo Coil Heating System delivering water that is more pure than typical brewing systems with aluminium",
            "GOLD CUP STANDARD: In Gold Cup preset mode the Breville Precision Brewer Thermal automatically adjusts the water temperature and brew time to meet the standards set by the SCA (197 to 204 degrees)",
            "AUTO 'STEEP AND RELEASE' TECHNOLOGY: Breville's patented Steep & Release valve holds the water in contact with the coffee when small cup volumes are being brewed without the thermal carafe in place automatically",
            "MY BREW SETTING: Allows you to customize parameters like bloom time, brew temperature, and flow rate to suit your coffee needs; create a perfect coffee that is floral, fruity, earthy, and so on to match your preference",
            "DUAL FILTER BASKETS: Brew any volume of coffee exactly how you like it with the Flat Bottom & Cone Filter baskets both included",
            "POUR OVER ADAPTER COMPATIBLE: Designed to suit your favorite pour over dripper such as Hario V6 and Kalita Wave",
            "INCLUDED ACCESSORIES: Thermal Carafe, Coffee Spoon, Cone filter basket insert, Mesh basket filter, Flat bottom basket filter paper pack (10 pieces) and Water hardness test strip"
        ],
        "description": "Brew craft filter coffee automatically.The world's first 60 oz. drip coffee maker with the precision required to brew craft filter coffee, automatically. Experience your favorite coffee at its best regardless of its origin, age or roast with precise temperature and brewing time.Automatic Presets and CustomizableWith 6 unique brewing modes you can enjoy the perfect, balanced coffee exactly the way you like it. Preset modes include Gold, Fast, Strong, Iced, Cold Brew and My Brew. With My Brew you can fine tune to your taste by adjusting bloom time, flow rate and brewing temp. Or brew pour over using a drip adapter with your favorite pour over device.Precise & Adjustable TemperatureGreat tasting coffee requires precise control over temperature, flow rate and contact time.1. PID Control: Adjustable and precise digital temperature control.2. Pump: Select from 3 different flow rates to optimize contact time.3. Thermo Coil Heating System: delivers water that is more pure than typical brewing systems that use aluminum.Gold Cup StandardIn Gold Cup preset mode, The Breville Precision Brewer automatically adjusts the water temperature and brew time to meet the standards set by the SCA.Auto 'Steep and Release' TechnologyBreville's patent pending Steep & Release valve holds the water in contact with the coffee when small cup volumes are being brewed without the carafe in place, automatically.My Brew Setting.Allows you to customize the parameters like bloom time, brew temperature and flow rate to suit the particular coffee you’re using whether its more floral, fruity, earthy and so on.Dual Filter Baskets.Brew any volume of coffee exactly how you like it with the Flat Bottom & Cone Filter baskets, both included.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Breville"
            },
            {
                "name": "Color",
                "value": "Brushed Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "9\"D x 14\"W x 16\"H"
            },
            {
                "name": "Special Feature",
                "value": "Programmable, Thermal, Jug"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Paper"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Espresso"
            },
            {
                "name": "Included Components",
                "value": "Flat bottom basket filter paper pack (10 pieces), Mesh basket filter, Thermal Carafe, Cone filter basket insert, Water hardness test strip, Measuring Spoon"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Voltage",
                "value": "110120 Volts"
            },
            {
                "name": "Model Name",
                "value": "Precision Brewer Thermal"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Item Weight",
                "value": "3.15 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Breville"
            },
            {
                "name": "ASIN",
                "value": "B078RQVQF1"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "BDC450BSS1BUS1"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,327 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,246 in Home & Kitchen (See Top 100 in Home & Kitchen) #81 in Coffee Machines"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 30, 2017"
            },
            {
                "name": "Capacity 3.8 Pounds",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 3.15 Pounds",
                "value": "Wattage 1650 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Brew Craft Filter Coffee Automatically The world's first 60oz drip coffee maker with precision to brew craft filter coffee automatically Discover Your Perfect Brew New research confirms different basket shapes deliver different flavors Customise Your Coffee Adjust bloom time, brew temperature and flow rate to suit your coffee and flavor preferences Including Gold Cup Standard Presets include Gold, Fast, Strong, Iced and Cold Brew Includes Flat Bottom & Cone Filter Baskets Brew any volume of coffee exactly how you like it all at home Next page 1 Precise Drip Coffee Maker 2 Precision Control 3 My Brew 4 6 Presets 5 Brew It How You Like It",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/67159b95-2318-4354-90b6-fb2883e3b08d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/93e5fbbd-b576-4ced-89a1-402c0990f83f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/13e6cb0c-668a-4611-a938-654c96a99b71.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9b806aea-a66b-464c-95d2-9d9d066c4554.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4632df4e-85c1-46d1-9708-01558ddb279b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/94a57ae1-966d-4a91-8e57-d7219462e2b1.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f1b4e35-e167-476e-b09f-41bb6edaa24a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d862da40-23a1-4370-9d42-4dbae4d72f37.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LaneM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFE5272CPA3ROUZLHA42WRXN2DKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2N48MR1WXQGAH?ASIN=B078RQVQF1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 12, 2019",
                "reviewTitle": "5.0 out of 5 stars Best Quality Brewer I've ever used!",
                "reviewText": "The media could not be loaded. I've put the Breville Precision Automatic Coffeemaker to the test!What I discovered was amazing coffee in every batch! I was very hesitant to spend $300 on a coffeemaker. I was hoping that for that price, it would also wash, dry and fold my laundry, but no such luck. Instead, I settled for a perfect cup of coffee, which I think is a pretty good trade-off if you ask me.This well-made brewer impressed me at almost every step. I fell like the price is worth the money for this coffeemaker. I'll give you a simple run down and you can decide for yourself!Sturdy designThe water reservoir and body are hard sturdy plastic.The thermal carafe is large with a large opening for easy cleaningThe lid is very sturdy and very easy to use with a flow-through brew and no adjustments before pouring.The filter basket is deep, wide and sturdy and moves in and out of the machine as smooth as butter.OptionsThis baby has all the options you could ever want! Seriously, there is something for EVERYONE.You like a mesh filter - comes with oneYou like a cone filter - comes with oneYou like cold brew - does itYou like iced coffee - doneYou like strong coffee - there's a setting for thatYou like your coffee exactly as it's recommended by the SCA - yeah, you guessed it, there's a setting for that!You like it hotter, cooler, faster, slower, longer bloom time, no bloom time - you can you the \"My Brew\" settings and get EXACTLY what you want! I LOVE THIS.Oh did I mention that it's also got an auto-start?Do you think the only way to brew perfect coffee is a pour-over method? Well, my friend, it can do that too! (but this does require additional equipment)Features worth mentioning:Due to the unique water boiler design, the water remains at a steady temperature throughout the brewing cycle so all of your coffee is perfectly extracted, and you CAN tell a difference.The fact that the brewer gets the water to 195 - 205 is another reason the coffee turns out so amazing.The water reservoir has lines that are easy to read, so you know exactly how much coffee you're about to brew. This tells you how much ground coffee to add to the filter.It comes with a scoop that coincides with the number of cups that are marked on the water reservoir. You are brewing 4 cups, use 4 scoops... 6 cups, 6 scoops and so on.Selecting the options using the dial are very intuitive and easy to use.What it's missing from this machine:The maid/butler to deliver you a hot cup of coffee in bed.A telepathic genie that will push the button for you.A grinder to grind the beans.Someone to sit with you and chat while you're enjoying an amazing cup of coffee.A coffee subscription to Bean Hoppers coffee (that would be a perfect world).My personal cons (but are really small gripes):The water reservoir does not come off for filling up the water to your desired level, and it would really make it easier to clean the reservoir. But since the opening is really wide, it's easy to wipe out from time to time, plus I could descale it.The lines on the reservoir are in 5 or 10-ounce increments. In the USA, 6 ounces is considered a cup and we're used to measuring 2 TBSP of coffee per 6 oz of water, but in the UK, 5 oz. is a cup. But they do provide you with a scoop that holds less than 2 TBSP and I've used it (heaping) and it really does taste great using their measurements too!The lid to the carafe gets water stuck inside it and potentially it may not dry out.Cost - very expensive, but I also think it's very well made and the cost is justified by the experience and the quality of the brewer and the amazing coffee it makes.It doesn't wash my laundry... just sayin.MY FAVORITE THINGS ABOUT THIS MACHINE:The water temperature is perfect and EASY to adjust.The settings are intuitive and easy to figure out and navigate.The water reservoir is easy to open, easy to see and has multiple methods of measure. (which is amazing!)The carafe is easy to clean.The filter basket is easy to clean.It really makes amazing coffee.It literally has something for everyone, no matter how you like your coffee.Overall I highly recommend the Breville Precision Brewer and would rate it a 9 out of 10 even at this price.Only because I haven't tried some other really nice brewers on the market that I'm still going to try. But I'm not sure how it could get much better.",
                "reviewVotes": "251 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d86afdd-1e6a-4a96-9169-e69940fbe228/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Shane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2L6W3C7OPTODMOI2VANELT2L7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN1LLSG1OBZ3E?ASIN=B078RQVQF1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 24, 2023",
                "reviewTitle": "5.0 out of 5 stars If you love coffee, buy this machine",
                "reviewText": "Do you love coffee? Do you love drinking a lot of it? Do you want the option to fine-tune your brew? This is the coffeemaker for you.In truth, I've had it for a month and haven't messed with all the settings. I just set it to \"Gold\" mode and brews an amazing pot of coffee every time. Setup is not as difficult as some would have you believe (a popular review site didn't recommend it for this reason), and once you've decided on the right coffee-water ratio, the gold brew mode is really all you need. I haven't tried the Fast mode as Gold produces 60oz of coffee in less time than it took my old machine (Oxo) to make 45oz. I suspect that's due in part to the boiler/pump, which sounds like the one Breville uses in their espresso machines. The noise seemed a bit odd at first, but hey, if they're going to share parts to save on production costs, I'm not complaining. It's like buying a Fiat and finding out they use engines from Ferraris.The carafe has a wide mouth so it's easy to clean, and the spout doesn't dribble, unlike most of the thermal brewers I've owned. It keeps the coffee hot for several hours, but if you're down to the last 10oz and it's been 4 hours since you brewed it, you might find the temperature a bit lower than you'd prefer. The 10oz before it are still piping hot 3 hours after brewing. Blame the laws of thermodynamics, I guess.Regarding the coffee-water ratio, I don't know how Breville/SCAA decided on it, but it's truly an absurd amount of grounds for the volume of coffee you want to make. Seriously, my coffee snob friend who roasts his own beans says it's ridiculous to use 99g for 1.8L/60oz of water. I experimented with different ratios, but oddly enough, the timed presets on the Breville grinder I bought a week later seem to produce the best coffee, and they're far less than what the coffee maker manual suggests.The only other (minor) annoyance I can think of is the fact that it requires commercial-sized paper filters, if you'd rather not have solids in your coffee. Regular basket filters will overflow, as will the included reusable filter. Fortunately, the commercial filters are less than $.02/each on a popular website you've probably heard of, if you buy 1000 at a time. On the plus side, I won't need to remember to buy more of them for 2-3 years, and it's not like they'll spoil before I've used them all.",
                "reviewVotes": "52 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roger Feighney",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 17, 2019",
                "reviewTitle": "Hot coffee",
                "reviewText": "Love the HOT coffee",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Norma Juarez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 4, 2018",
                "reviewTitle": "Muy buena!",
                "reviewText": "Es perfecta tanto para una taza como para toda una jarra. Me encantó, tiene el tamaño justo y luce genial en la cocina",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Walter R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 27, 2020",
                "reviewTitle": "Dobla el filtro de papel con la presión del agua",
                "reviewText": "Si pudiera, la devolvería de inmediato. Estaba entre esta y la Moccamaster. Compré esta máquina al ver los reviews en youtube y acá. Por favor, vayan por una moccamaster, por algo las cafeterías de especialidad de TODO EL MUNDO las ocupan. Gran error cometí al comprar esta Breville... La presión del agua/vapor que genera la configuración \"gold\" es tan fuerte que dobla el filtro de papel sobre la cama de café en AL MENOS 8 de 10 veces. Tengo que tener un limpia pipa de metal y una linterna al lado de una máquina de 8000 pesos para hacer café, para cuando el vapor doble el filtro y yo lo pueda corregir. Eso implica que si no estoy poniendo atención, en varias ocasiones queda un café \"a medias\" muy aguado... eso implica café $$$ y filtros $ que se van directo a la basura.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$329.95",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            },
            {
                "price": "$329.95",
                "sellerName": "La Cuisine Shop",
                "sellerRating": "4.5"
            },
            {
                "price": "$329.95",
                "sellerName": "Seattle Coffee Gear",
                "sellerRating": "4.5"
            }
        ]
    }
}