{
    "remaining_requests": 35915,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Breville-BDC650BSS-Control-Brushed-Stainless/dp/B00VGGVQCI",
    "body": {
        "name": "Breville Grind Control Coffee Maker, 60 ounces, Brushed Stainless Steel, BDC650BSS,Silver",
        "price": "$349.95",
        "originalPrice": "",
        "rawPrice": 349.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Breville-BDC650BSS-Control-Brushed-Stainless/dp/B00VGGVQCI",
        "soldBy": {
            "sellerID": "ASH1H6YCFH4EF",
            "name": "Electronic Express",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ASH1H6YCFH4EF&asin=B00VGGVQCI&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41e58Eqo9NL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41J DQnOsLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AOKIc6cwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21AF3km5WTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MwpG-RoAL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Breville Store",
            "link": "https://www.amazon.com/stores/Breville/page/EBBDE160-83A6-4DE3-A1B2-C27D03CABFF6?ref_=ast_bln"
        },
        "brand": "Breville",
        "merchantInfo": "Electronic Express",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 5664,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 21 hrs 54 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The Breville Grind Control creates third wave specialty coffee by capturing freshness and essential oils from beans by grinding before you brew with Steep and Release technology; Choose to brew directly into a carafe, tall cup or travel mug for on the go",
            "PROGRAMMABLE AUTO START: Set the time you'd like your coffee and the Grind Control will start the brewing process automatically; Delivers brew water at the right temperature from the start to the finish of the brewing process",
            "INTEGRATED AND ADJUSTABLE GRINDER: Adjust the grinder output to suit any bean from anywhere and customize the grind size to suit your taste",
            "STEEP AND RELEASE TECHNOLOGY: Brew your coffee directly into a large carafe, tall cup or travel mug with equal balance and flavor profile",
            "LCD DISPLAY: A clear and concise LCD screen shows grind setting, grind time and number of shots or cups you have selected",
            "INCLUDED ACCESSORIES: Gold Tone Filter, 12 Cup Dual Wall Stainless Steel Thermal Carafe and Cleaning Brush",
            "BEAN HOPPER CAPACITY: 1 by 2 lb; Water Tank Capacity: 60 oz-12 cup"
        ],
        "description": "Contains stainless steel blurs, bean hopper has a locking system for easy removal, storage and transfer. In case of the coffee basket dripping or other issues , please do the following to minimize it . After each use, wash the coffee basket, taking particular care to rinse the chute area. Dry thoroughly (especially the chute area). Ensure there are no grinds in the coffee basket before lining the coffee basket with the Gold tone or paper filter and in case of carafe overflowing issue , please ensure that the carafe is Completely empty before the start of the brewing. Voltage 110–120 Volts.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Breville"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Product Dimensions",
                "value": "8.5\"D x 12.5\"W x 16.3\"H"
            },
            {
                "name": "Special Feature",
                "value": "Integrated Coffee Grinder, Jug, Programmable, Thermal, Timer"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Home"
            },
            {
                "name": "Exterior Finish",
                "value": "Stainless Steel"
            },
            {
                "name": "Included Components",
                "value": "Coffee Maker"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Voltage",
                "value": "120"
            },
            {
                "name": "Model Name",
                "value": "Grind"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Item Weight",
                "value": "16 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Breville"
            },
            {
                "name": "ASIN",
                "value": "B00VGGVQCI"
            },
            {
                "name": "Item model number",
                "value": "BDC650BSSUSC"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 5,664 ratings 3.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,015 in Home & Kitchen (See Top 100 in Home & Kitchen) #79 in Coffee Machines"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "April 30, 2015"
            },
            {
                "name": "Capacity 3.8 Pounds",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 16 Pounds",
                "value": "Wattage 1100 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Set the time you’d like your coffee Grind Control will start the process on its own to ensure it’s ready and waiting Clear and Concise LCD Screen Shows grind setting, grind time and number of shots or cups you have selected Customize Grind Size and Coffee From Brazilian to Colombian and Sumatran, adjust the grinder output to suit any bean from anywhere Consistent and Precise Particle Size Delivers optimum flavor potential Steep and release technology Brew directly into a large carafe, tall cup or travel mug with equal balance and flavor profile. Next page 1 Programmable Auto Start 2 LCD display 3 Integrated Grinder 4 Stainless Steel Burrs 5 Volumetric Control",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a224b09f-8628-4817-ad45-b548455d025e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4039b3b7-3340-4405-934e-fad9bf0246e6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/413372d7-91c5-44d0-a706-af032b2fbde7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a66a77a8-17d5-41a2-8282-ae770e86121d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/662919f5-d0f3-41cc-8495-5b8a81820804.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/637dedb0-de54-43e8-984d-6921d43b7227.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e6d21048-fab7-42ff-86a9-a67d6c634b2b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "steven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMYOGDHDKVDMXQ2HDPPYWXFEUMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PVUELEYLR224?ASIN=B00VGGVQCI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Really Awesome once you figure out some of its quirks",
                "reviewText": "I never write reviews, but this thing gets a bad rep in so many reviews I had to put this out there.Ive had this coffee maker over 4 years. It took me a few years to figure out what it does great and what it does alright. I'll come out and say it right off the bat, I do really love this coffee pot. I can come downstairs and have freshly ground and ready to drink coffee the minute I get up in the morning. The coffee will stay hot in the Carafe for an hour+ and pleasantly warm for 2-3 hours depending on how much you make. The ability to change the grind size for different types of beans and coffee amounts are great at this price point. Also have to shout out the user interface being easy to understand, program, and use on a day to day basis. the burrs have held up extremely well and ive never really done anything to clean them out other than an occasional wipe down when doing a full cleaning on.It has some quirks, for example, you have to basically turn it upside down to get that last cup of coffee out of the pot. You also have to calibrate the grinder before use, which will require a kitchen scale to weigh the output from the grinder. I didn't know this for the first 2 years and always thought the brew came out weak, so the strength was always set to the max.NOW....The downsides to this machine are the cleaning and the maintenance. If you run super dark roasts or cheap coffee (Looking at you bulk bag Costco Coffee) through this thing its A PAIN IN THE ASS. The dark roasts or beans with lots of oils will jam this thing up so bad. You'll be taking it apart after ever every other pot to clean out the chute and get it working properly. Once I had more money to throw at getting roastery true light and medium roasts I only have to clean it out like every 10 pots or so, its crazy how much of a difference it makes. It also really struggles to very small or very large amounts of coffee. Due to needing to calibrate the machine it will make more or less coffee then it does stock. When I first got it and didnt calibrate, it would make super weak small 2 cup runs. Once calibrated though, it grinded through more coffee than the basket would hold and grinds would flow over into my brewed coffee. A little annoying to say the least.If 4.5 stars was an option thats what I would give it. It really shines when your making 4-8 cups of coffee with decent beans, but it doesn't do everything it advertises.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TeeOhDblDeeTeeOhDblDee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSNWB555CXVW5SMKEH4BIXR3DOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V9OY78FMJ6X?ASIN=B00VGGVQCI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2016",
                "reviewTitle": "5.0 out of 5 stars So, yeah, I, talk to my coffee brewer...",
                "reviewText": "UPDATE: FIVE (5) Years Later... I Still use this machine daily, usually for at least 2 single serve cups of various size, depending on the mug I'm using that day. Occasionally I'll brew a pot, either when I have guests, or the day after I run the Decalcification cycle, which I just ran today. The machine has a censor that tells when to clean, but rather than waiting, I prefer to clean every 6 weeks. In addition to the brush provided, I use a bamboo picnic knife to scrape inside of the chute to remove more grinds. Compressed Air is useful as well when doing a deep clean of the machine which I do twice a year ((OUTSIDE)). With the hopper removed (and excess beans) I spray the compressed air through the chute and the grinder (top half removed). Vinegar-soaked paper towels help remove ground coffee built up around the grinder and in the chute. Allow to air-dry, and reassemble. ...(End of 5 Year UPDATE)...The Breville Grind control is the best product with an electric cord I have ever purchased. I first saw it at the mall, and upon inspection it was clear it was designed for people who really enjoy coffee, by people who really enjoy coffee. The display model was the only one in stock, and the next store did not have it either. I logged onto Amazon when I got home, and 4 days later it arrived. The next morning, just over 2 weeks before my 42nd birthday, I tasted the coffee I always wanted but never was attainable.The ability to brew as few as one to as many as 12 cups is awesome. Before work I only have time for one cup, usually 350 ml. On days off I fill the entire carafe, and after more than 3 hours, the last mug is still a very drinkable and tasty temperature. For a single cup, which I enjoy black, I use strength setting 8 (strongest), and grind setting 1 (finest). For a carafe I use 3 on the grind setting.For after work, I found it quite easy to make an even stronger brew by starting the machine just long enough to grind beans for a 295 ml cup. Stop, open and close the brew basket door, adjust the grind for 235 ml cup, and within a few minutes I have a great base for whatever espresso type drink I have attempted to make. I purchased a separate milk frothing/steaming machine, so now when I visit the local Coffee House it is only to buy beans.Clean up is easy. Barely 2 minutes of rinsing and wiping. The longer it sits, the tougher it is to wipe the release disk, but I've not been so lazy yet that it has been bothersome. This past weekend I performed the descale process for the first time. It was simple and the machine is programmed to allow plenty of deep cleaning time. The previous brewer I owned was a single cup grind and brew system. It made a decent cup of coffee, but was no where near as hot or good. Clean up was tougher as the actual grinders had to be rinsed and dried after each cup. After a few months, the pressure point on the lid of the grinder popped off, cracking the lid. I made it work for a few weeks until I found the Breville Grind Control.Honestly, the coffee is so tasty I actually thank the machine as soon as the brew process is complete. The only downside? I work at a Diner and usually allow myself whatever coffee I can manage to sip until 10 a.m. I just can't taste it anymore. It tastes vaguely like that sip of decaf I mistakenly had a couple years ago, and as such, leaves me asking, why? Why would anyone drink this? Well, I for one, am currently devising an iced coffee recipe for my Grind Control so I will no longer have to.I paid full price for my Breville Grind Control, and have neither requested nor received compensation for my honest review. It has had no performance issues so far and I am extremely satisfied with the purchase.The photos are of a latte macchiato, from start, to beginning of the end, made using the Grind Control and separate frothing machine. If you need a new coffee brewer and you really enjoy coffee, this is the machine you need.",
                "reviewVotes": "184 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61wAjknzFsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71GMpVSpBPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71PVAiWhe+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71p7gqlAVRL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mihail Minkov",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 18, 2022",
                "reviewTitle": "Cambió mi experiencia del café americano",
                "reviewText": "Aunque es una máquina premium, vale cada centavo. El hecho de que no se necesita de la jarra le agrega muchisimos puntos porque he perdido ya por lo menos 4 cafeteras porque se rompe la jarra de vidrio. Y además el hecho de que la jarra es de acero hace que esta máquina me durará mucho más que las anteriores. El café se mantiene super fresco y caliente en la jarra y no sabe quemado porque no se calienta externamente sino aprovecha la jarra térmica. El único inconveniente que le pondría es que es un poco complicada de limpiar, especialmente la jarra. Sin embargo, ampliamente recomendada.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 9, 2021",
                "reviewTitle": "Excellent coffee maker, worth it for the end product - a fantastic cup of coffee.",
                "reviewText": "I was on the fence about purchasing this coffee maker based on the reviews and price. I had excellent luck with my previous coffee maker (Cuisinart) but was looking for something with a built-in grinder that also offered single-serving options. I read countless reviews on Amazon, the Breville website, and many others. I also have an espresso machine (just happens to be a Breville as well), along with a Keurig single-serve (that barely gets used since my purchase of the Breville Grind Control). Here is my honest opinion...The good - It makes an excellent cup of coffee. I really look forward to getting up in the morning and having freshly ground beans without having to take the time to grind them myself. You can skip the grinding and use a pre-ground if you don't have whole beans on hand (a nice option as backup, or if you don't want to wake anyone else in your house up with the grinder in the morning). This coffee maker also gives you the option of making several different sizes of single-serving coffee (eg: regular mug to travel size). Being able to pre-load the bean hopper and water tank allows the unit to be self-sufficient for several uses before a reload (water, as the beans tend to last a while). The coffee maker gives you plenty of options with respect to strength etc, you can really hone the cup of coffee to your desired taste. I have yet to explore the calibration feature for different types of whole beans.Cleaning - clean-up is less than a minute. You simply need to empty and rinse the gold filter basket, along with the carriage the basket sits in. The outlet of the bean hopper needs a quick wipe. Not sure why so many people complain about the \"excessive clean up\" etc, its pretty damn simple. The coffee maker does not leak or make a mess everywhere, as some reviews stated. For best results yes you do need to let the filter basket and carriage dry prior to its next use. Yes a soak and light scrub of the carriage is required every so often.The so-so - many reviews have had an issue with the carafe design (pouring the coffee). This is completely justified. Yes it is somewhat annoying that you can never get the last few drops of coffee out of the carafe (~10mL), but overall that's not a dealbreaker for me. In the future maybe Breville will re-think the carafe to allow for easier pouring.Warmth - many reviews complain about the warmth of the coffee. A freshly made cup is plenty hot enough. After leaving the carafe sitting for ~30 minutes the temperature does cool down, but at the most your second cup of coffee needs a 15 second zap in the microwave. Again, not a deal breaker for me. People complaining about the temperature not being hot enough must enjoy regularly burning their tongues on extremely hot coffee.Grinder noise - yes the grinder is somewhat loud, but I have yet to come across a quiet coffee grinder.Overall - it is worth spending the money on. I really enjoy coffee, and part of what gets me out of bed in the morning is knowing this coffee maker is going to deliver a great cup of java. For me the quality of the coffee outweighs the small inconveniences of carafe design and temperature maintenance.Hope this helps other coffee lovers out there make an informed decision on purchasing the Grind Control.",
                "reviewVotes": "55 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rylan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 23, 2019",
                "reviewTitle": "Make a great cup of coffee, enjoy not having to fill up water to the amount of cups I want.",
                "reviewText": "I have had this coffee machine for a year now and it gets used everyday. It makes a great cup of coffee whether it's a single cup or filling the carafe.Hasn't stalled or crapped out on me once yet either!Single cup brewing steeps the coffee for about a 2 minutes~ depending how how big a cup you're filling, you an change it from oz's or ml's and your brew strength which is nice for sizing to your cup and taste. Flavors come out a bit more full and smooth with this selection capturing all the oils in the coffee beans.Carafe mode is also a sinch, selection again is amount of carafe cups and brew strength. The flavor isn't as smooth as when it gets steeped with single cup mode but still make a great cup none the less!It does require routine maintenance which is extremely easy to do and is expected with a machine that has a built in grinder! Just take a couple paper towels with hot water on them and you can rub away the crusty coffee grinds from the slider inside the machine, I do this about every two weeks and it takes maybe 5 minutes max.The one thing I do find annoying is that it does not fit really tall mugs for single serve use even with the bottom piece of platform taken out, but don't worry you can still use the single serve mode to get that smooth cup of coffee! I just take off the carafe top so it does not push against the flow release and put the carafe under the dispenser so it will still steep the beans instead of letting the coffee flow out instantly when water enters the grind chamber.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EliBZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 31, 2018",
                "reviewTitle": "Una maravilla",
                "reviewText": "Esta cafetera, es una de las mejores compras que he realizado en Amazon. Tiene todo: molino incluido, el cual puedes graduar para definir el grueso de la molienda, su tanque de agua se llena fácilmente, es amigable con el ambiente ya que tiene su propio filtro reutilizable, incluye su propia tetera o puedes programarla para hacer diferentes tamaños de bebidas individuales. Y, que decir del sabor del café... Simplemente, delicioso!!! Ya que puedes incluso regular la intensidad del mismo y lo mejor de todo... recién molido. Es una máquina extraordinaria!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "observator_ro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 31, 2021",
                "reviewTitle": "Overall a very good coffee maker",
                "reviewText": "I previously had a KitchenAid coffee maker that I liked a lot but that model is discontinued. As I like coffee strong (not dark roasted), I'm always looking for a machine that has the Bold feature, so water is poured at 205F, over the coffee, this way ensuring that you extract as much of coffee strength and flavor. I also grind the coffee right before making it, in order to keep most of its flavor. I tried this machine as I tried to get rid of the separate coffee grinder.First thing to mention is that this machine is quite large (check dimensions) and somehow looks bulky. It is stainless steel, unfortunately, is a fingerprint magnet.I liked that you set how much coffee you want to make and the only thing to worry is to have more water than you need. I also liked that you can make individual cups and in this case the machine functions a little differently as it infuses coffee but for this reason it takes a little longer.I like you have different grinding sizes and personally I go with 2 (finer) in order to get more strength and flavor from the coffee.I was disappointed with Strength as I hoped this was about the temperature of the water but it is about the quantity of coffee that is grinded (based on selected quantity). This is the main con, in my opinion for this machine, that you cannot change the temperature of the water that is poured over coffee. Initially, even on max strength (8), I was visible getting less coffee than wanted and coffee was weak. Normally, I fill a coffee filter basket for 9 cups of coffee. With original setting, I was filling the basket only 2/3. I ran the calibration and indicated that I get 15g of coffee while the machine thought there are 22. After this, the quantity of coffee grinded was OK and I set for strength 7. The grinder is a flat burr but this is expected. I don't think there is any coffee machine with a grinder integrated, having conical burr because conical burrs need more height and as the grinder must be above the coffee filter, would make the machine too tall. As I'm not using oily coffee, I don't really have issues with the grinder clogging. The coffee tank, if full, will grind coffee for 2 full coffee filters. I liked that the brush to clean the grinder has its place in coffee tank, so you don't misplace it.Normally I like coffee machines having the water tank detachable but in this case is quite the opposite: the only access to the water tank is the small space, on top of the machine, to pour water through. The level of water is displayed on LCD. As per instructions, you should always keep the tank full. The only way to empty the tank is by running the machine until empty. What I like, is that they recommend descaling the machine using vinegar, as opposed to selling you some expensive descaling liquid.The thermal carafe, holds coffee warm for hours. Personally, I don't like coffee hot but if you so, it is highly recommended to warm the carafe before making coffee (by holding 30 seconds hot water into it). Otherwise, the coffee temperature will be 20% lower right from the beginning. What I don't like about the carafe is that is hard to clean it as your hand will not fit through its opening. It is advised you do not hold coffee overnight as the stainless steel will stain the carafe. As a personal advice, to clean such stains on stainless steel, use a sponge, a wooden spoon and Vim cream with bleach: it will make it as new. To descale it, use vinegar.Yes, there is some maintenance, after each run, but it shouldn't take more than 3 minutes to do it. You have to empty the coffee basket and wash it with water and let it dry before replacing it. Clean the grinder chute and the grinder catcher. At the end of the day, empty the carafe and wash it with water. Every week, wash the carafe with Vim. Every month, clean the machine with vinegar: this is not for descaling but more importantly for disinfecting it. The water tank, being completely closed, may favor creating bacteria in time and vinegar will disinfect it completely.In conclusion, this is a very good coffee maker. The main reason I substracted 1 star is that it doesn't let you set the temperature of the water and although, I cannot measure the temperature, I do not believe is 205F but rather closer to 195F - but this is just a guess.Update 04/04/2021: I forgot to mention one important thing. The manual specifies this: \"Never use Distilled, De-mineralized or highly filtered water as this will affect the electronics and the taste of your coffee.\" I know there is people using distilled water, thinking they won't need to descale the machine. Once again, you should still periodically run vinegar through the machine, in order to disinfect it.",
                "reviewVotes": "41 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$349.95",
                "sellerName": "Peppercorn",
                "sellerRating": "5"
            },
            {
                "price": "$349.95",
                "sellerName": "KitchenUniverse",
                "sellerRating": "5"
            },
            {
                "price": "$349.95",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}