{
    "remaining_requests": 35793,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Urnex-Espresso-Machine-Cleaner-Cleancaf/dp/B000FDDU8G",
    "body": {
        "name": "Coffee Maker and Espresso Machine Cleaner Cleancaf Powder - 3 Packets - Safe On Keurig Delonghi Nespresso Ninja Hamilton Beach Mr Coffee Braun",
        "price": "$11.73",
        "originalPrice": "",
        "rawPrice": 11.73,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Urnex-Espresso-Machine-Cleaner-Cleancaf/dp/B000FDDU8G",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B072SJYB3X"
        ],
        "asinVariationValues": [
            {
                "asin": "B002C1LG1W",
                "variationName": "Size",
                "variationValue": "0.1 Ounce (Pack of 9)",
                "price": "$27.54",
                "variationImageURL": ""
            },
            {
                "asin": "B0089R3FXU",
                "variationName": "Size",
                "variationValue": "0.32 Ounce (Pack of 3)",
                "price": "$12.98",
                "variationImageURL": ""
            },
            {
                "asin": "B07NBVFTRN",
                "variationName": "Size",
                "variationValue": "0.33 Ounce (Pack of 6)",
                "price": "$19.97",
                "variationImageURL": ""
            },
            {
                "asin": "B008A1B76C",
                "variationName": "Size",
                "variationValue": "1 Ounce (Pack of 2)",
                "price": "$12.98",
                "variationImageURL": ""
            },
            {
                "asin": "B000FDDU8G",
                "variationName": "Size",
                "variationValue": "3 Packets",
                "price": "$11.73",
                "variationImageURL": ""
            },
            {
                "asin": "B00CLXUO96",
                "variationName": "Size",
                "variationValue": "4 Count (Pack of 2)",
                "price": "$17.98",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Nj8cBYYWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51hreRqTQYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SzYAchqqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41u fT2728L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51r04LJSwkL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Urnex Store",
            "link": "https://www.amazon.com/stores/Urnex/page/AECA25DA-964D-438E-BCCC-2BCBBD8125C6?ref_=ast_bln"
        },
        "brand": "Urnex",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 6964,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Cleancaf Coffeemaker Cleaner eliminates residual coffee oils and buildup that can turn rancid to prevent bitter tasting coffee",
            "Proudly made in America; odorless and non toxic; contains 3 single-use treatments (3-month supply)",
            "Gently removes lime scale and oil residue buildup in automatic coffee makers and espresso machines; brew faster, better-tasting coffee",
            "Simple, effective and easy to use; cuts buildup without harsh chemicals or odors; non-toxic. No Vinegar odor!",
            "Using Cheancaf is as easy as brewing a pot of coffee; made in the USA"
        ],
        "description": "Cleancaf Coffeemaker Cleaner eliminates residual coffee oils and buildup in automatic coffeemakers and espresso machines that can turn rancid and cause brewed coffee to taste bitter. Simple and effective, using Cheancaf is as easy as brewing a pot of coffee. The dual-action formula eliminates coffee oils and dissolves mineral deposits. Proudly made in America, Cleancaf is odorless, non toxic, and cuts buildup without harsh chemicals. Each box contains 3 single-use treatments (a 3-month supply). Made in the USA.",
        "breadCrumbs": [
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliance Parts & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=1267449011"
            },
            {
                "name": "Coffee & Espresso Machine Parts & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=3115648011"
            },
            {
                "name": "Coffee & Espresso Machine Cleaning Products",
                "link": "https://www.amazon.com/Coffee-Espresso-Machine-Cleaning-Products/b?ie=UTF8&node=3115626011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6 x 4 x 0.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.06 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Urnex"
            },
            {
                "name": "ASIN",
                "value": "B000FDDU8G"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "0021PF"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 6,964 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,984 in Home & Kitchen (See Top 100 in Home & Kitchen) #9 in Coffee & Espresso Machine Cleaning Products"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "May 18, 2006"
            },
            {
                "name": "Brand",
                "value": "Urnex"
            },
            {
                "name": "Item Form",
                "value": "Powder"
            },
            {
                "name": "Scent",
                "value": "Fragrance Free"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coffee"
            },
            {
                "name": "Material Feature",
                "value": "Biodegradable"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "At Urnex, we dedicate a huge amount of care and effort into our cleaning products for one reason: the passion of individuals who are part of the creation of a cup of coffee. Through the seed-to-cup journey, farmers and producers carefully pick and process the coffee cherries, importers and exporters ensure the preservation of the coffee during transit, and roasters roast the green coffee to perfection. Then in a café or home setting, using the latest and greatest equipment technology and tools, you can produce a delicious brewed coffee or a delicately balanced espresso. But if your coffee is made from dirty equipment, then all the care, effort and dedication put forth throughout the coffee chain is wasted. Clean and maintain your equipment with Urnex and taste the difference.",
                "media_link": []
            },
            {
                "media_text": "The Professionals Choice Urnex products are used by the world’s leading coffee equipment manufacturers, cafes, and baristas in more than 70 countries. Professional Quality at Home Urnex’s household products utilize the same expertise that goes into developing solutions for commercial equipment to ensure people at home can enjoy great tasting coffee from a clean machine. Made in the USA Since 1936 For more than 80 years, Urnex products have represented the highest standards of quality, consistency and effectiveness. From R&D to Manufacturing, Urnex is proud to be based in America.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42eeeb6a-a6ed-4fb2-9316-d7c61c66d936.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/26230964-eeb6-4f53-91bb-8670eedca29d.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bea1799a-4c8c-45c1-95ec-490028d5f82e.__CR0,0,1600,1600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/6d22490b-4fd1-49ee-b05a-e961ca42a2b3.__CR55,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4df9fcbc-cf88-465a-a2b1-0c40685e583f.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42eeeb6a-a6ed-4fb2-9316-d7c61c66d936.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/26230964-eeb6-4f53-91bb-8670eedca29d.__CR0,0,1600,1600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bea1799a-4c8c-45c1-95ec-490028d5f82e.__CR0,0,1600,1600_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SBayJJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE77WCADSHK7S7EYZHWXW3QDRBTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D1JSXY3UKIT?ASIN=B000FDDU8G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great and is easy",
                "reviewText": "Wish I had purchased this earlier. I've used the white vinegar method, and this is so much easier and more effective. No smell or weird chemical aroma. My coffee brewer is much cleaner now. Buy it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DavidG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEK4H7YKQUKQISK4FBOGEPE5LHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE1198SQVIOMS?ASIN=B000FDDU8G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing. Just amazing what the right formula can do.",
                "reviewText": "I purchased Urnex Dezcal to clean / descale my 10-year old Technivorm Moccamaster. The plastic water reservoir had hard water stains and the stainless steel carafe was stained inside from the many years of making coffee. I tried cleaning the carafe many times over the years, including with a stainless steel cleaner, with limited success, I used to use white vinegar to run through the coffee maker - I always felt it did nothing. So, I read the Moccamaster manual to see what they recommend and this product came up. It's simply amazing. Running a single packet through the coffee maker cleaned it out 90% of the way. I used part of a second packet mixed with water for spot cleaning - and now the coffee maker is 99% clean. I'll consider the remaining 1% permanent stains from the years of use. I'll use Dezcal every few months to keep the coffee maker clean. It's really amazing stuff and I find it hard to believe I've lived this long without it. Science is amazing.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chusy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETF5OX5ARHTFCURUYLTIV353LUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CM7GN433AYC5?ASIN=B000FDDU8G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Magic clean and no scrubbing needed",
                "reviewText": "Used this product, recommended by the manufacturer, to clean a Moccamaster stainless steel coffee carafe that had years of coffee residue build up that could not be cleaned due to the narrow carafe opening. Used one packet and let it soak for several hours. When I pour it out of the carafe, the liquid was so dark, it was like coffee itself! The carafe was SPARKLING CLEAN and LIKE NEW! There is no bad odor from the solution, but rinse well before using. The box only comes with 3 packets. It’s pricey but was worth it because it really cleaned out the build up in the carafe without any scrubbing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dulcimer Dave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7M4JZ3PI2ALANZYEEA4HBW2WGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EXLTQIEP7YWL?ASIN=B000FDDU8G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Does the job",
                "reviewText": "The instructions say mix a packet with 32 ounces of water which would work fine for an 8 cup coffee maker. The instructions should indicate what to use for a 12 cup maker. That said the product did a reasonably good job. It could have done even a better job with more product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patty K.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBCBD2KWCOFIESI7ZP6TPWSF3AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F8GKVV7MH12W?ASIN=B000FDDU8G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2015",
                "reviewTitle": "5.0 out of 5 stars The brush was like scrubbing on my hands and knees",
                "reviewText": "After reading many reviews, I decided to follow the lead and purchase this coffee maker cleaner. Vinegar is a thing of the past thanks to Urnex. I have a home Bunn coffee maker, and live in an area with a lot of lime in the water. This surpasses the old way of cleaning with vinegar. Just empty envelope into water and allow it to drift tWow! I don't know where to begin. Think I own as many mops and vacuums, as some women own cologne, shoes and purses. I read many reviews for days, researched online and watched all Mopnado YouTube videos. All of this before purchasing a simple mop and bucket? No, all of this before purchasing a (yikes) $70.00 mop and bucket. It's not a simple mop and bucket, it's an ingenious mopping and dusting system. Mopnado is a very impressive company, similar to amazon. Oh, I, also, contacted Mopnado prior to making my purchases. They replied in a timely manner, answering my questions, and included important information regarding the Mopnado and it's use with helpful suggestions.As a member of Amazon Prime, I welcomed my friendly UPS driver, as he pulled up to the house two days after placing my order. I was so excited to receive the highly rated Mopnado.Within a few minutes, it was out of the box, and all I had to do was screw the handle together, fill the handy detergent pump bottle, attach the mop head and fill the bucket.I used, both, the brush and microfiber heads. Having a textured tile floor, I believed the only way to actually clean it, was to have it professionally cleaned. The brush was like scrubbing on my hands and knees, only I was standing up, applying less pressure and my hands never touched the floor, scrub brush, rag or filthy water. After scrubbing, I went over the floor with the wonderful microfiber mop head. Unlike many mops, no plastic dragged across the floor. The floor was finally spotless.My seven year old inquisitive granddaughter watched as if viewing Mind Craft videos. She asked if she could try it, and I explained the process. Within a few minutes, she had the process mastered, and began mopping the floor. I wanted to continue the enjoyable process of floor mopping, so I wrestled my mop away, and proceed on. In a short length of time, I had completed the entire floor. To my surprise, it was spotless, and DRY! I moved on to the tile bathroom floor, and within a few minutes, the floor was clean and DRY!I will admit $70.00 is a sizeable expense for a mop and bucket. However, as the Mopnado is well constructed with a metal spin basket and a handy handle to simplify moving the bucket, I believe it has paid for itself simply by ease of use, and a spotless textured tile floor. Plus the fact, that there is no waiting for the floor to DRY. No more shouting, \"Stay off the floor, it's wet!\" Today, I am going to mop the hardwoods, and I actually look forward to it.I can say in all honesty, there is nothing I would change about the design of the Mopnado. It is easily, the best mopping system I have ever used.There is no doubt in my mind, you will love it as much as I do. And remember, Mopnado is available, should you ever have any questions or concerns. In closing, all I can add is, I wish I would have come up with this ingenious floor cleaning system.I hope this lengthy review has helped in your decision making process.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "been there",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHD3IVUDGHSMLAWCPSYNI5ED6XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17LB1NH3D2T62?ASIN=B000FDDU8G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars they really help",
                "reviewText": "one star for flavor...you use this your machine, you don't drink it. it does not impact coffee flavor after using as it actually helps keep your coffee tasting super",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LOgalfromOR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFE42AR57XEM2IPONODFEEJWI4YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXGIABEQ5OF42?ASIN=B000FDDU8G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Great product that actually works!!",
                "reviewText": "Do not hesitate to purchase this product!! It will have a permanent place in my kitchen, from now on. My coffee maker/grinder had many years of coffee grime build up. Not only did the inside of my insulated stainless steel carafe sparkle and shine, it also cleaned the permanent coffee filter and filter basket!! I only wish I had purchased this product years ago. Very easy to use, and then use regular water to flush for 2 cycles.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6WXNJMKBK4ON2L5VY2IVT3PD5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P5LXQX5MM7JY?ASIN=B000FDDU8G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Cleans the coffee oils and sediments out of your coffee maker",
                "reviewText": "I have been using this urnex cleancaf product for a few years now. It cleans out the grot that limescale dissolvers alone don't touch. I first use a de-scaler then this. What pours out of the carafe after using this is dark and grotty water. Be sure to rinse multiple times (I do 7 rinses through the zojirushi coffee maker).Thanks urnex!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kirk",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Cleans My Expresso Machine",
                "reviewText": "I use this regularly with my Bambino machine and it works like a charm.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "andmechanic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 26, 2023",
                "reviewTitle": "Cleaned well",
                "reviewText": "Must for moccamaster. I run it through the machine after I use durgol descaler. It helps keep my machine going",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 28, 2023",
                "reviewTitle": "effective product for e61 group head and boiler",
                "reviewText": "product works well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gabriel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 23, 2022",
                "reviewTitle": "Great product",
                "reviewText": "I really like the multi pack allows change of filters and cleaning for a long period.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "liquidrawhideliquidrawhide",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 27, 2022",
                "reviewTitle": "Really freaking great",
                "reviewText": "Saw this product recommended by Tecnivorm/Moccamaster to clean out their coffee makers and saw the glowing reviews here, so decided to purchase. I've clearly been a negligent owner of this machine because despite regularly descaling it with powder over the years and then running cycles with pure vinegar to (I thought) give it a decent cleaning, this filled my coffee pot with brown water *just after* descaling it. Gone are years of brown residue both in the drip-over arm as well as the brew basket after just a single use, and as an added bonus, I poured that pot of brown solution into my stainless travel coffee mug that had also been stained brown over the years... after letting it sit for five minutes and then just giving it a light scrub with a dishcloth, BAM, essentially as good as new, as shown in the pic. So yeah, I'm a believer in this product!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61v1JkJLW+L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.73",
                "sellerName": "AMCAN",
                "sellerRating": "4.5"
            },
            {
                "price": "$11.80",
                "sellerName": "TBEJA",
                "sellerRating": "4.5"
            },
            {
                "price": "$11.95",
                "sellerName": "Essential Products!",
                "sellerRating": "5"
            }
        ]
    }
}