{
    "remaining_requests": 35873,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Famiworths-Single-Coffee-Ground-Classic/dp/B0BC8PYLQC",
    "body": {
        "name": "Famiworths Single Serve Coffee Maker for K Cup & Ground Coffee, With Bold Brew, One Cup Coffee Maker, 6 to 14 oz. Brew Sizes, Fits Travel Mug, Classic Black",
        "price": "$42.99",
        "originalPrice": "$69.99",
        "rawPrice": 42.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Famiworths-Single-Coffee-Ground-Classic/dp/B0BC8PYLQC",
        "soldBy": {
            "sellerID": "A10424B41M3FB",
            "name": "Famiworths online store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A10424B41M3FB&asin=B0BC8PYLQC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CRRJB6RS"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BC8PYLQC",
                "variationName": "Color",
                "variationValue": "Classic Black",
                "price": "$42.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41WUP0SaHqL._SS36_.jpg"
            },
            {
                "asin": "B0C73K8M1K",
                "variationName": "Color",
                "variationValue": "Fresh Green",
                "price": "$43.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41OaMrjlY7L._SS36_.jpg"
            },
            {
                "asin": "B0CT2ZKTT4",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "$69.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/416CyCTRJtL._SS36_.jpg"
            },
            {
                "asin": "B0C73VKJBN",
                "variationName": "Color",
                "variationValue": "Navy Blue",
                "price": "$44.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41QGhPSnXZL._SS36_.jpg"
            },
            {
                "asin": "B0C8J9QBLT",
                "variationName": "Color",
                "variationValue": "Vibrant Red",
                "price": "$44.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41M8pMk57pL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $4 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41WUP0SaHqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41kN KXohbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41n3-a0lFDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TTyXTqHRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ntas7M6AL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FdrBrp-HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/816gsEIN5eL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Famiworths Store",
            "link": "https://www.amazon.com/stores/Famiworths/page/98305E79-85F3-4914-BBB6-722FA9677865?ref_=ast_bln"
        },
        "brand": "Famiworths",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 3088,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 44 mins",
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 7 hrs 44 mins",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Thursday, February 15. Order within 7 hrs 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Your Perfect Coffee Maker for Ground and Pod Coffee - This coffee maker is compatible with K-Cups and includes a reusable ground basket so that you can brew your preferred brand of coffee powder or tea. Brew any size cup between 6 and 14 oz for a smooth cup of coffee to kick- start your day. Its large capacity powder basket can hold more coffee powder (max 0.88oz), allowing you to get the tastiest cup of coffee or tea.",
            "Simple Push Button Controls and Bold Brewing - A hot cup of coffee will be ready for you at the push of a button. The Bold setting on this single cup coffee maker activates a unique brewing process that extracts more flavor and aroma, resulting in stronger, richer coffee. It is important to note that the flavor of the coffee will vary depending on the amount of coffee and water used. Adjust these two amounts according to your taste preference.",
            "Compact Size and Perfect for Cups On The Go - This mini coffee maker doesn't take up a lot of counter or cabinet space and is easy to transport, so you can take it with you when camping and traveling. This small coffee maker accommodates travel mugs up to 6.7\" tall and the removable drip tray can hold a full accidental brew for easy cleanup.",
            "Coffee Brewed in Minutes - A 6 oz cup of coffee brews in 3 minutes at the optimal temperature (185F), which is ideal for drinking hot coffee with added cream or milk. The coffee that comes out is almost equal to the amount of water you pour, ensuring that each fresh cup is enjoyed to the fullest.",
            "Easy Cleaning and Descaling Reminder - The two buttons flash a red light alternately to remind you to descale, and you only need to press the button for 2 seconds to activate the descaling mode. Even better, the heating descaling mode will improve the descaling effect and extend the life of the coffee maker."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Single-Serve Brewers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=2474054011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Famiworths"
            },
            {
                "name": "Color",
                "value": "Classic Black"
            },
            {
                "name": "Product Dimensions",
                "value": "5.6\"D x 8.2\"W x 12\"H"
            },
            {
                "name": "Special Feature",
                "value": "Permanent Filter"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Style",
                "value": "Bold&Regular"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Personal"
            },
            {
                "name": "Included Components",
                "value": "Filter"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Voltage",
                "value": "120"
            },
            {
                "name": "Model Name",
                "value": "Coffee Maker"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Item Weight",
                "value": "2.64 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BC8PYLQC"
            },
            {
                "name": "Item model number",
                "value": "1"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 3,088 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,114 in Home & Kitchen (See Top 100 in Home & Kitchen) #13 in Single-Serve Brewers"
            },
            {
                "name": "Date First Available",
                "value": "August 29, 2022"
            },
            {
                "name": "Capacity 14 Ounces",
                "value": "Material Stainless Steel, Plastic"
            },
            {
                "name": "Item Weight 2.64 Pounds",
                "value": "Wattage 1000 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Bold setting on this coffee machine is able to extract more flavor from the coffee beans and tea leaves, resulting in stronger, richer coffee and tea.",
                "media_link": []
            },
            {
                "media_text": "KEY FEATURES 2-In-1 Brewing Style This 2 in 1 coffee maker is compatible with K-Cups or your own ground coffee. You can use either coffee filter or k-cups holder that come with the coffee maker for a smooth cup of coffee just the way you like it. The 25g (0.88oz) large capacity basket allows you to get a richer cup of coffee or tea. One-button Easy Operation This single-serve coffee maker brews a smooth, hot cup of coffee with an effortless push of the BOLD or REGULAR button. The simple operation and cleaning function allow you to save time and enjoy a hot cup of coffee at any time.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb00baa8-2336-471a-ba94-57cb8d362ad5.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa0d96e5-c6b7-4f77-9d8d-81c8a5926c29.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            },
            {
                "media_text": "Fast & Bold Brewed Get your 6 oz cup of coffee in just 3 minutes with this one cup coffee maker, whether you're at home or in the office. Coffee comes out as hot as 185°F, which is the ideal temperature for drinking hot coffee with added cream or milk. Fits Any Small Space With a compact design and durable stainless steel panel construction, this small coffee maker is perfect for offices, apartments, dorm rooms, travel, etc., taking up minimal counter space! This compact coffee maker, it is also a good option to take it camping with your friends or family.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0c52b9b8-2618-48b6-9c46-8d978a48edb2.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/23f1062f-9c4f-4daa-9db3-beda9b0c51dd.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            },
            {
                "media_text": "How to descale the coffee maker correctly? Step 1: The two function keys flash red alternately, indicating that the coffee machine needs cleaning. Step 2: Pour 14 oz of prepared descaling solution into the water reservoir. Step 3: Press two function keys for 2 seconds at the same time to start the descaling process. Step 4: Use the hot water descaling function for more efficient cleaning.",
                "media_link": []
            },
            {
                "media_text": "How much water is added to brew coffee with the best taste? *It is recommended to add no more than 10 ounces of water when using capsules and no more than 14 ounces of water when using coffee powder. *If you feel the coffee is too weak, you can reduce the amount of water in moderation. What is the difference between Bold and Regular setting? *The coffee brewed in Bold mode allows more flavor to be extracted from the beans, resulting in a stronger, richer coffee. *Regular can brew a cup of hot coffee with a normal taste. You can choose according to your favorite coffee taste. Why are the accessories not in the box of the coffee machine？ *The coffee filter and k cup holder are placed on both sides of inner carton, please check whether they are complete after unpacking. *In case of loss or additional purchase, please contact our after-sales service personnel. How to quickly add the right amount of water to the tank? *The water tank is in the shape of a ladder, and each level on the inside is marked with a corresponding scale. *Using a cup with a spout will reduce the chance of water splashing when pouring into the tank. Is it a function fault that the two function keys flash red alternately? Please don't worry that it's not a fault prompt. This is the regular descaling reminder function of the coffee maker. You only need to add the descaling agent and press two function keys at the same time for 2 seconds to start the cleaning function.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb00baa8-2336-471a-ba94-57cb8d362ad5.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa0d96e5-c6b7-4f77-9d8d-81c8a5926c29.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0c52b9b8-2618-48b6-9c46-8d978a48edb2.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/23f1062f-9c4f-4daa-9db3-beda9b0c51dd.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/05e96ab6-40a2-40e9-94a9-7dfe7df975ac.__CR0,0,1464,600_PT0_SX1464_V1___.jpeg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J Grant",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL6GLNTJC4CHBFXMOA2WP2IJD6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5561J80BRVUJ?ASIN=B0BC8PYLQC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Small Footprint, Easy to Use, Great Cup of Coffee",
                "reviewText": "This review is for:Famiworths Single Serve Coffee Maker for K Cup & Ground Coffee,With Bold Brew, One Cup Coffee Maker, 6 to 14 oz. Brew Sizes,Fits Travel Mug, Classic Black -- (Amazon Item: B0BC8PYLQC)==================================================BLUF (Bottom Line Up Front)This turned into a long review so I'll summarize it here:* I'm happy with the machine and if asked, would recommend it to friends and family. And you. *---------------------------------• MY EXPERIENCEFor many years I used a (carafe-type) Keurig coffee machine along with a third-party Eco-Carafe filter so I could use my own choice of loose grounds. That combination also allowed me to use over twice the amount of grounds found in a K-cup, making for a very strong single cup of coffee. When the Keurig machine died I started using an Aeropress, which makes an excellent cup of coffee. I'd recommend the Aeropress to anyone who enjoys their coffee and wants a full-flavored cup. Although I very much like my Aeropress I switch back and forth between it and this machine when I want a cup of brewed coffee faster or with a little less fuss.That brings me to this Famiworths Single Serve Coffee Maker. I've been using this machine along with my Aeropress for several months and am happy with the purchase. On most days I make my first cup of coffee with the Aeropress and make any subsequent cups with the Famiworths machine. There's a distinct difference in flavor between the coffee produced by these machines. Coffee from the Aeropress is similar to that produced by a French Press, and allows you to let the grounds steep to your liking. Using the same amount of grounds, I've found the Famiworths makes A DARNED GOOD CUP OF COFFEE but does not extract quite as much flavor as the Aeropress. However, I expected that as the grounds spend much more time in contact with the hot water when using the Aeropress.• OPERATION & POINTS OF INTEREST:1. As stated, the Famisworths brewer does not extract as much flavor as the Aeropress but it's pretty darned good - and since I use my own favorite grounds, it produces coffee at least 2 heads and 4 shoulders above any Keurig-type pod-only brewer you'll find.2. It has a very small footprint, so occupies minimal counter space in my small kitchen.3. I have a collection of short to tall coffee mugs and travel mugs, and all of them easily fit under the brew basket of this machine.4. The water reservoir is emptied each time a brewing cycle is completed. So, the water reservoir should be filled according to how much coffee you want to brew. There are measurements inside the reservoir so you know how much water you have poured in.5. To brew your cup of coffee, there are two interchangeable... 'modules' I'll call them. First, there's a removable filter basket to hold your loose grounds. The other module is a removable K-cup holder. Both work well for their intended purpose.6. The filter basket has a 'maximum' line marked inside. I found that 2.5 rounded Tbsp of grounds just about reaches that line, and is what I use for a 14 oz. cup of coffee.7. It's simple to operate. Just add a pod or coffee grounds, add water, then press one of the brew buttons.8. There are two brew buttons. One is labeled 'Regular' and the other button is labeled 'Bold'. The difference between them is how fast water is pumped through the grounds.9. What happens when one of the brewing buttons is pressed (14 oz. water in the reservoir):a.) When pressing the Regular button -Water is pumped through the grounds at a steady rate until the water reservoir is emptied. 0:00-3:10 - Water in reservoir is heated 3:10-4:13 - Heated water is pumped at regular speed until the reservoir is emptiedb.) When pressing the Bold button -Water is pumped through the grounds at perhaps half speed for about 45 seconds before switching to regular speed until the reservoir is emptied. 0:00-3:10 - Water in reservoir is heated 3:10-3:55 - Heated water is pumped at slow speed 3:55-4:45 - The remainder of the heated water is pumped at regular speed until the reservoir is emptied10. Button Lights -The two buttons are located on the side and are situated vertically, with the Regular button situated above the Bold button.- One Button: When either button is pressed to start a brew cycle, that button will flash while the water is heated, stop flashing but stay lit while water is being pumped, and turn off when the brew cycle is completed.- Two Buttons Flashing at the Same Time: Indicates the coffee grounds chamber lid is open.- Two Buttons Flashing Alternately: This occurs every 150 brew cycles and serves as a descaling reminder. The buttons will continue to flash whenever the brewer is plugged in - until a descaling cycle is run.11.Descaling -- Pour 14 oz. of descaling solution into the water reservoir.- Press both brew buttons for 2 seconds to start the descaling process.- Run 14 oz. of plain water through the brewer (3) times to ensure all of the descaling solution is removed.=====================================• TIPS TO CONSIDER:1. Reducing splatter during the brew cycleIf you've previously owned a drip coffee maker you know that dropping a small stream of coffee into a cup results in accumulating coffee splatter on the front of the brewer. I found that a small can of tuna fits nicely in the depression of the drip tray of this brewer, and that will raise my coffee mugs enough to reduce splatter.Also, the shape of the tuna can bottom prevents it from easily sliding around or off of the drip tray. And the lip on top keeps the mugs from sliding off. (All of my mugs fit inside the raised ring on top of the can.) It's almost a perfect solution, but I may remove the label and spray paint the can black in the near future.2. Containing drips and splatter after the brewing cycle has completedFrom what I understand all K-cup brewers follow the Keurig design of pushing air through the K-cup at the end of the brewing cycle. The air helps to push out the last few drops of water from the K-cup, as well as helping to clear and dry the needle and other parts. This brewer is no exception, ending every brew cycle with a short period of forced air. That works great for K-cups but has little to no effect when you're using the brewing basket for loose grounds. So like all drip coffee makers, occasional drops of water will continue dripping from the grounds for several seconds after completion of a brewing cycle. I never use K-cups and usually switch out the full cup of coffee with an empty cup to catch those last few drops. This prevents the drops from hitting the drip tray and producing a light splatter.At the end of the brew cycle I also open the front lid and bounce the coffee filter up and down a few times to help the last of the drops to pass through the grounds.3. Simplifying the task of adding water to the reservoirI'm over 6 ft. tall but I still got annoyed at having to lean over the top of the brewer - peering into the water reservoir to see how much water was in the reservoir - every time I wanted a cup of coffee. To eliminate this small annoyance I marked a plastic water bottle with a 14oz line so I can measure the water out of the tap and then blindly pour it into the reservoir.=====================================• OBSERVATIONS:As stated above, I like and recommend this coffee maker, but here are some additional observations that may be of interest to you.1. Third-party baskets for loose grounds won't fit.I love my stainless steel Ekobrew reusable filter which fit two Keurig machines I've used previously, but it will not fit in this machine.Why? On the module that accommodates K-cups, the sharp needle that pierces the K-cup tops is not in the 'standard' center position, which (as far as I'm aware) prevents the use of all after-market reusable filters/baskets for K-cup machines.2. Errant flavorComparing the flavor of coffee brewed in my Aeropress to coffee from this machine, there's more to the story than just how long the grounds are steeped. There's something else subtle in the flavor - and I think it's the very faint taste of plastic. Either I'm becoming accustomed to the subtle flavor, or it's slowly dissipating. I believe it's the latter. Keep in mind that since it's subtle and I can't definitively identify the rogue flavor, I could be wrong as to the source.* UPDATE, One month laterAfter daily use that faint errant flavor has disappeared.3. BPA FREE (I didn't base my purchase on BPA content, but just wanted to check.)Based on responses to posted questions, the product description used to state the machine is BPA-free but I could not find that info on the product page. It seems the product materials have changed, and to ensure the brewer is still BPA free I sent an email to the seller/mfr. Here is part of their response: \"All plastic parts in contact with food are free of BPA and other toxic chemicals.\"Based on that response it's reasonable to assume there is BPA in some of the brewer's plastic, but not in any of the plastic that contacts water or coffee grounds. But since every bit of plastic on this brewer appears to be the same material, I'd feel better if their response was more detailed and that the BPA-free claim was still part of their public product description and specifications.4. Auto Shutoff for an Empty Water ReservoirLike most coffee drinkers, I sometimes make coffee when I'm half asleep. And in those instances I have very occasionally forgotten to add water to the water reservoir. So I asked the seller if there is an auto-shutoff to protect the heating coils when no water is present in the reservoir. The response I received seems to indicate there is indeed an auto disconnect to protect heating coils when no water is present. Still, I wouldn't want to make a habit of testing this fail-safe feature. Here is the seller's full response:\"Our unit working in the state of no water 15-40S temperature controller will be disconnected, the heat pipe will no longer continue to heat. After the temperature of the thermostat returns to normal, the user adds water and starts the machine again, and can continue to work.\"",
                "reviewVotes": "127 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AJWheeley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELVGVPU23YX2A5V2YRMTIZ66QOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ52H025DV9Y4?ASIN=B0BC8PYLQC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Best purchase in a long time",
                "reviewText": "I am SO GLAD I bought this! My Mr. Coffee brewer was disappointing me and I seem to prefer just making one cup at a time instead of a pot - but I hate the taste of k-cups, I prefer fresh ground coffee so I decided to give this a try. I LOVE it! Makes the perfect cup of coffee, easy to use, easy to clean, instructions easy to follow. Coffee comes out hot, not too noisy, doesn’t take long. Perfection.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alice S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7QLILGABMTTFK3U2Y6LPYTVWHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKT944AD2JN6Z?ASIN=B0BC8PYLQC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Good rating for the first 3 months, sadly now it's a 2 - Updated to 4",
                "reviewText": "2ND UPDATE: Two days after I spoke to support on the phone, a new machine arrived at my door. So once I was able to get a hold of support, they were very helpful! Hopefully, this new machine will last longer than 3 months. I have changed my rating to a 4.UPDATE: I still have not had a response to my email, but I finally was able to get through to support on the phone. I told her what the problem was and she took all of my information. She said they would send me a new machine and I should have it in 5-7 business days. I'll be back to update again once I receive it.I purchased this 3 months ago and really liked it. It made a good cup of coffee, it was easy to use, and I can use kcups or my own coffee. I would have rated it at least a 4 at that point. However, 2 weeks ago it started only dispensing a small portion of the water that was added to it. Sometimes I could push the button a second time and it would finish the brew. Other times, I had to start all over. Very annoying. It supposedly has a 1-year warranty, great! At first, I could not find any contact info for the company. I looked all through the documentation sent with the unit. I finally realized it was written on top of the front of the unit. My mistake for not seeing that. I emailed the company with all the info they requested. I have not heard back. I tried the phone number listed with the email. Their mailbox is FULL. Not a good sign. So for now, the rating is a 2. If I ever do hear back from them with a satisfactory answer, I will update my review and my rating.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frank WeirFrank Weir",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCWBD6OA74AOGTYWOLC3EP2QGQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X6Y6ZHIITYLQ?ASIN=B0BC8PYLQC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Best reusable basket design",
                "reviewText": "This machine by far has the best and largest reusable basket for using your own ground coffee. ALL Kcup machines should use this but then suppliers would sell far fewer overpriced Kcups!I filled it to the max line, only slightly tamped it, then weighed the coffee amount: 27 grams! Most others are 10 to 15 grams. Used 6 ounces, impossibly strong.Attached photo shows this basket on the left with a typical Kcup reusable on the right.In addition, the Bold button works very well and standard Kcups taste very good especially at 6 or 7 ounces. I measured water temperature and it was 165 F. which some may say is too low but I thought it was sufficient for good flavor extraction.The unit is considerably lighter weight than another non-Keurig machine I have and brewing time seems a bit longer so internal elements may be less robust, I don't know.Too early to tell about durability but this is an excellent performer out of the box and KUDOS to this company for finally designing a machine that performs extremely well using much cheaper ground coffee. Even Starbucks ground is SO much cheaper than their Kcups.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Y-RIyDEsL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greselda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5NFEDDC7JLQ7G5GKDVOOJDKETQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQS39PTGUO3QJ?ASIN=B0BC8PYLQC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars GREAT COFFEE MAKER",
                "reviewText": "This single use coffee maker is wonderful. I read all the reviews which were all positive. One fellow even wrote a super long detailed review in, which was appreciated by me. I love this coffee maker. It is easy to use, makes a great cup of coffee, choice of regular and bold cup, and is so easy to use. Would recommend to anyone looking for a small unit like this one. Order it! It's reasonably priced and although it is my first purchase of this kind, am super pleased, and donated my old coffee maker. I have a small kitchen w/limited counter space, so this maker is perfect for my use. Highly recommend it!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$69.99",
                "sellerName": "FM Coffee Story",
                "sellerRating": "5"
            },
            {
                "price": "$69.99",
                "sellerName": "Brewling",
                "sellerRating": "5"
            },
            {
                "price": "$69.99",
                "sellerName": "ClearDay",
                "sellerRating": "5"
            }
        ]
    }
}