{
    "remaining_requests": 35930,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BUNN-Velocity-10-Cup-Coffee-Brewer/dp/B000FFRZ26",
    "body": {
        "name": "BUNN GRB Velocity Brew 10-Cup Home Coffee Brewer, Black",
        "price": "$118.99",
        "originalPrice": "",
        "rawPrice": 118.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BUNN-Velocity-10-Cup-Coffee-Brewer/dp/B000FFRZ26",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Ga6Sm-LtL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Q684X9oqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IOEt9nbNL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BUNN Store",
            "link": "https://www.amazon.com/stores/BUNN/page/CBF838CB-A39F-4EAE-8509-F490064A2B2D?ref_=ast_bln"
        },
        "brand": "BUNN",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 14824,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 8 hrs 58 mins",
            "FREE delivery Monday, February 19. Order within 8 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "BUNN BREWS DIFFERENTLY - The BUNN Speed Brew uses an internal commercial grade stainless steel hot water tank that keeps 70oz of water always hot so you can quickly brew at the flip of a lid..Note: 1)Too coarse a grind, too little coffee, or insufficiently tamping the grounds before brewing can all lead to inadequate pressure for a proper brew. 2)It is important to note that the amount of espresso extracted will vary depending on the grind size and amount and reprogramming may be needed when the size and amount are adjusted",
            "CLASSIC SPEED BREW look with a black finish and stainless-steel faceplate.",
            "DESIGNED AND ASSEMBLED in the USA.",
            "EXCLUSIVE DRIP-FREE CARAFE delivers the cleanest pour on the market with a proprietary lid and spout design that arcs the coffee into the cup and wicks the rest back into the carafe.",
            "SWITCH ACTIVATED warmer plate keeps your coffee at optimal serving temperature.",
            "FASTEST 10-CUP HOME COFFEE MAKER - Our technology allows our coffee maker to brew a full carafe of coffee in 4 minutes, half the time of typical coffee makers. *Based on internal testing of BUNN Speed Brew coffee makers to other similar coffee makers.",
            "CAFÉ TASTE AT HOME - Commercial style multi-stream sprayhead evenly showers hot water over the coffee grounds to maximize the flavor of your coffee similar to your favorite café.",
            "BREW A TRAVEL MUG OR A CARAFE - Brews 20oz to fill a travel mug in 2 minutes, or a full 50oz carafe in 4 minutes.",
            "WE ARE HERE TO HELP - Customer Service Team Located in Springfield, IL, USA to take your calls and emails.",
            "BUILT TO LAST - 3-Year Warranty on all Speed Brew models.",
            "Fastest 10-Cup Home Coffeemaker brews a full pot of coffee in about 3 minutes",
            "An always hot internal hot water is ready to brew hot coffee on deman. Item dimensions is 14.8 high x 7.1 wide x 13.8 deep inch. Note-replace sprayhead and brew funnel. Pour additional carafes of fresh, cold water into the brewer as needed until water has no vinegar smell or tasted",
            "Exclusive drip-free carafe with a proprietary lid and spout design that arcs the pour of the coffee into the cup and wicks the coffee dribbles back into the carafe preventing a mess on cup or counter",
            "Multi-stream spray head showers hot water evenly over the coffee grounds",
            "Large flat bottom filter and funnel allows greater interaction between hot water and coffee grounds for superior flavor extraction",
            "Brews 4 to 10 cups (20 to 50 ounce). 3-year warranty",
            "Backed by BUNN customer service in Springfield, Illinois",
            "Based on internal testing of BUNN Speed Brew/ Velocity Brew coffeemakers to other similar coffeemakers"
        ],
        "description": "With BUNN Speed Brew Technology, making great tasting coffee is not only fast, but simple. After the one time initial set-up process, simply add your favorite coffee to the filter basket, pour in fresh water, close the lid and the coffeemaker begins to brew immediately. The secret is that BUNN Speed/Velocity Brew home coffeemakers feature a stainless steel water tank that is always on and ready to brew hot coffee on demand. In fact, they brew a 10-cup pot of coffee in about three minutes. That’s fast!",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b?ie=UTF8&node=7740213011"
            },
            {
                "name": "Coffee Machines",
                "link": "https://www.amazon.com/Drip-Coffee-Machines-Makers/b?ie=UTF8&node=289745"
            }
        ],
        "productInformation": [
            {
                "name": "Capacity",
                "value": "50 Fluid Ounces"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Reusable"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coffee Brewer"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Wattage",
                "value": "900 watts"
            },
            {
                "name": "Voltage",
                "value": "110 Volts"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Product Dimensions",
                "value": "7.1\"D x 13.8\"W x 14.3\"H"
            },
            {
                "name": "Item Weight",
                "value": "0.5 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Material",
                "value": "Stainless Steel, Plastic"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 14,824 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,042 in Home & Kitchen (See Top 100 in Home & Kitchen) #21 in Coffee Machines"
            },
            {
                "name": "Brand",
                "value": "BUNN"
            },
            {
                "name": "Included Components",
                "value": "Coffee maker, carafe"
            },
            {
                "name": "Model Name",
                "value": "Velocity Brew 10-Cup"
            },
            {
                "name": "Model Number",
                "value": "GRX-B"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Style",
                "value": "Casual"
            },
            {
                "name": "Capacity 50 Fluid Ounces",
                "value": "Material Stainless Steel, Plastic"
            },
            {
                "name": "Item Weight 0.5 Pounds",
                "value": "Wattage 900 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Speed Brew Technology The BUNN Speed Brew uses a commercial grade stainless steel internal hot water tank that keeps 70oz of water always hot so you can quickly brew at the flip of a lid. Brew a Travel Mug or a Full Carafe Brew as little as 20 ounces to fill a travel mug, or brew a full 10-cup carafe. Drip-free Carafe Exclusive carafe delivers the cleanest pour on the market with a proprietary lid and spout design that arcs the coffee into the cup and wicks the rest back into the carafe. (models with glass carafe) Thermal Carafe Vacuum insulated, double walled stainless steel thermal carafe maintains ideal serving temperature for 2+ hours. (model with thermal carafe)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d905298f-4dd7-4adf-8891-3ac824852908.__CR0,0,928,928_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/92eb93e6-f0e2-4e49-adf3-3c77469e2d4e.__CR0,0,928,928_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/99167d37-4f22-45b5-bb89-b3d980de9600.__CR0,0,611,611_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5af02efa-bf69-4296-b2b7-2a714899aa98.__CR0,0,300,300_PT0_SX220_V1___.png"
                ]
            },
            {
                "media_text": "The Brand Trusted by Restaurants & Cafés Worldwide Some of the world’s largest foodservice brands rely on BUNN equipment to serve high quality beverages every day. Our reputation is built upon BUNN innovations in coffee brewing. Today, the BUNN equipment portfolio is designed, engineered and managed by teams headquartered in Springfield, IL USA. Whether it’s equipment for the most demanding commercial settings or the best cup at home in your kitchen, we are driven by an entrepreneurial DNA to relentlessly pursue the highest quality in the cup for every serving occasion and to use our success to make the world a better place for our customers and our families. Our home coffee makers are built from this tradition and passion. BUNN home coffee makers bring the flavor and quality of the café-style coffee you love directly to the comfort of your home.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffa26514-b50b-459a-aa90-e64031c563c5.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Coffee Focused It all started with coffee. From the first commercial pourover brewer, to our coffee makers in homes today, our passion has always been brewing the best cup of coffee possible. Since the 1950’s, we’ve dedicated ourselves to making advances in the field of coffee brewing. Whether that’s inventing the first-ever flat bottom coffee filter or designing a unique water displacement brewing process that makes coffee available faster than any other 10-cup home coffee maker, our list of industry-leading innovations continues to grow.* BUNN home coffee makers are built to do one thing: brew a delicious cup of coffee reliably…. every day. Every feature is engineered with a focus on that final pour of coffee from a coffee maker that brews purely and without gimmicks. *Based on internal testing of BUNN Speed Brew coffee makers to other similar coffee makers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10c25934-f720-4d08-b047-cfeb56033b9f.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/122c194a-8a96-4416-af6e-80111eec44ee.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d905298f-4dd7-4adf-8891-3ac824852908.__CR0,0,928,928_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/92eb93e6-f0e2-4e49-adf3-3c77469e2d4e.__CR0,0,928,928_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/99167d37-4f22-45b5-bb89-b3d980de9600.__CR0,0,611,611_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5af02efa-bf69-4296-b2b7-2a714899aa98.__CR0,0,300,300_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/563bf9f6-4097-41a6-9301-90cb40a0dc78.__CR142,0,3550,1098_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffa26514-b50b-459a-aa90-e64031c563c5.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10c25934-f720-4d08-b047-cfeb56033b9f.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SuzyQZ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOHE2ID7PXBPS3I47VTC336KERQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3A3H374V3ZEGC?ASIN=B000FFRZ26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Fastest coffee maker around",
                "reviewText": "We are coffee drinkers - gotta have it first thing in the morning. After many years we got really tired of waiting 10-12 minutes for a pot of coffee to brew, and started looking around for one that could brew faster. We found reviews for the Bunn Velocity and decided to try it. Success! This baby makes a full 10-cup pot of hot coffee in 3 minutes flat, and partial pots even faster. I like my coffee strong and my hubby likes it medium (weak lol) so we each make ourselves about a half pot and it works out great. (we have extra carafes because this isn't out first Bunn) The flavor is good, not weak - guess this is because it keeps a reservoir of hot water at all times.It's easy to use once you **read the instructions**; just set the carafe on the warmer BEFORE you close the lid where you put the water in. And buy the Bunn brand filters - other brands are mostly not quite tall enough and can overflow. A few other reviewers mention the basket overflowing if the coffee is ground too fine but we've never had any issues with that; we've always just used regular medium roast ground coffee from the grocery.Cleaning any coffee maker can be a chore, but this one's not too labor intensive unless you need to deep clean it for storage. We have naturally soft tap water so it doesn't get much sediment buildup, but I still run the coil thingy through about once a month.This is our 4th one in about 15 years. After 5 years, our last one was still making coffee just fine, but the warmer plate switch quit working. This happened to our first one as well.Overall a great fast-brewing coffee maker. We will definitely keep buying them until Bunn (heaven forbid!) stops making them.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie Paul",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7CS2ZZM5D7VCTZBJ5CJTY6LFZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ASI50YRS2XLN?ASIN=B000FFRZ26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Best coffee maker ever!",
                "reviewText": "Who knew a coffee maker could affect the way your coffee tastes? I didn’t! I received this yesterday for my birthday and this morning was the first pot made. This brews the best tasting coffee I’ve ever made. Yes, it’s pricey but so well worth it! Set up is super simple. The coffee is brewed in 4 minutes and is really hot. If you are on the fence about buying this, just do it. You can always return it but I bet you won’t.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SamnMickSamnMick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBP7JMIXWIOQOKMBWH5QEGAEUHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GYUXHKTNJ9TO?ASIN=B000FFRZ26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Great purchase",
                "reviewText": "Best coffee pot I’ve ever owned. I read a ton of reviews. Decided to order in spite of them. The two legitimate issues people have mentioned (disregarding the ones who simply don’t understand how it works, FYI if you read the instructions it’s easy) are the pouring issue for the carafe and the splashing of grounds which do not appear to be an issue any longer. People mentioned having to ask company for an extender, per the pic I’m including it appears they have fixed that as mine has it built in to the lid of the carafe. As far as the grounds going over the edge because of how fast the coffee sprays out, I took that seriously as I was gonna search for a reusable filter. I have not used a paper one so I can’t speak to that but, I did find a filter from the Összefut store here and it works perfectly. Folks said coffee needs to be ground differently from store bought but I have not had a problem with store ground coffee using this filter and we use a whopping 5 scoops. No grounds have gone over the edge at all.Coffee is fast, very hot and clean tasting. Highly recommend this coffee maker.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71j2wC5smvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "wms",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRWTLL45GYEREYGMYR375KYG2NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20ELDRV9MDBCQ?ASIN=B000FFRZ26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Fast and easy",
                "reviewText": "This Bunn replaced my other Bunn that i have had for 10 years. I was not sure i would like the canister because my old one was different and did not have the hook like cover to the canister. To my surprise, i love it!! The coffee taste great, it brews fast and taste wonderful!!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edward",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERZSSAX7WASAGUBOP6VGHY2H27A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BF4AP5A48GXG?ASIN=B000FFRZ26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice Coffee Maker",
                "reviewText": "This is a great coffee maker. Sturdy commercial technology made in USA! Works well, and makes good coffee fast. Read instructions thoroughly before plugging it in!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yum yum turnips",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFKPLJWU2LEI2GWZSX3PYII7XSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NCAAAGHSO94O?ASIN=B000FFRZ26",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2023",
                "reviewTitle": "4.0 out of 5 stars Tricky, but excellent coffee, and fast UPDATE 1/2024",
                "reviewText": "I've been using this coffee maker, which is new to me, for about 5 days. I've learned a few things. It's a really good coffee maker, but you have to read the instructions carefully. And even if you do, you still have to tweak it. I used to work in a convenience store and got very close to buying one of those machines with the double warmer and the two carafes, etc. I'm kind of techy like that. If you want a machine that \"just works\" and you don't mind kind of medium-OK coffee, then this isn't what you want. I want, and am getting, high quality, \"tastes like I bought it in a convenience store or fancy cafe\" coffee. But here are my tips, so far:1. The first mistake people make, including me, is buying pre-ground coffee. That stuff is WAY too fine. You can mix some pre-ground in, but you MUST grind the majority of the coffee yourself from whole bean coffee. Try counting to 10 while grinding. Turning it off. Shaking the grinder. Then grinding for another 10 seconds. That's all. No more. If you ever used a percolator, you know it's more like 2x5 seconds. This is 2x10 seconds. An ordinary coffee machine, the slow kind... is 3x10 seconds. Grinding your own coffee is the first tip.2. If you must have flavored coffee (I have to have my pumpkin spice seasonally and I love blueberry coffee), For a full pot, you put three heaping ordinary tablespoons of your own ground coffee. Then two tablespoons of flavored coffee (which will probably be ground too fine to use alone). Mixing the fine coffee with the less finely ground coffee is how you prevent the coffee from spilling out of the funnel. You don't need the next tip if you grind your own, and mix with the finely ground coffee.3. The alternative sprayhead (which is available by simply filling out a form on their website, like a \"contact us\" type of form), is important. It's free. You don't have to hassle with it unless you want to, as long as you grind your own coffee, not too fine. But I got it anyway and it prevents the spillovers.4. Don't use the table for \"how much coffee\" that's included in the instructions. Or follow it but use teaspoons, not tablespoons to measure. For some reason that table is totally wrong and will cause spillovers, especially with finely ground, or pre-ground coffee.5. For warranty repairs, or their excellent customer service, you will need your \"date code\" which is, crazily, on the bottom of the coffee maker. That's just awful design. Think about it: I have a half gallon tank of very hot water, and now you want me to turn it upside down, to look at a number on the bottom, to get help with it? Loony. Take a picture of that date code before you fill up your coffee maker with water. Or place the coffee maker on a glass table and then look at it or snag a pic. Then use the customer service contact page to ask them nicely to put the date code on the side of the machine.You can get high quality cafe coffee from this coffee maker. But you have to be techy and fiddle with it. It helps if you've worked in a store or cafe where Bunn machines are in use all day. Then you know what it could look like, taste like and what changes to make. If you get stuck, call them up. It can't hurt. USA made products from a family business are a wonderful thing indeed.1/2024 Update: Still works great, no spills at all. I fill it up to the 8 cups mark, makes 3 huge mugs of coffee (I only have huge mugs, no time for little teacups). I use about 4 Tablespoons of coffee, 2 T regular home-ground (coarse) coffee, and 2 T regular store bought (fine) ground flavored coffee. This is with the alternate spray head that pours more slowly. It takes about 7-8 min to get my coffee. I've had no problems with hard water, or with softened water. I have softened water. Using bottled water seems to result in a slightly larger volume of water released. Not sure why. So if you're making maximum size pots of coffee, you might want to keep that in mind.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joe Joe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5YRFOQTQRRVQYXRROMPQXSBFLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTI2V546SPQ0Q?ASIN=B000FFRZ26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Best ever",
                "reviewText": "This is the best coffee machine out there. If you’re looking for a reliable, easy to use coffee maker, this one is for the!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFXPG4MSUIQQ7NKQQ63YVQR32JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MIH8BJ0EMQ6T?ASIN=B000FFRZ26",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars It is a Bunn! No more info needed!",
                "reviewText": "Simple, fast and easy to maintain. I bought this as a present knowing how great of quality it is as I have owned one for years. You won't be disappointed.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ame",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 26, 2023",
                "reviewTitle": "I'm very happy with this coffee maker.",
                "reviewText": "Very quick coffee, which I love. Coffee tastes great! Set up is easy. I had a Tim Horton's Bunn years ago and loved it too. Overall, I am very pleased with it but there are a couple of things I like to see improved.I really wish there was a timer for the burner switch. We have been careful about turning it off when the coffee pot is low or empty but the timer would be an added protection for not forgetting to turn it off.Also, I am not too happy about the price of Bunn coffee filters. I prefer the non bleached kind, I didn't see any Bunn non bleached filters although I may have missed them. For this type of coffee pot you need have to have a thinner filter because the water comes through pretty fast and needs to flow through the filter easily. Otherwise it will back up and you will have coffee grounds and hot water overflowing and making a huge mess. This hasn't happened to me yet as I am using the filters that came with coffee pot.Edit. I did try a different brand of non-bleached filters. Didn't work.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge Castillon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 5, 2021",
                "reviewTitle": "Imagine que era más versátil el producto",
                "reviewText": "Es rápida pero demasiado austera para el precio, un poco complicado ajustar el ciclo viene muy general el instructivo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelli S",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 3, 2022",
                "reviewTitle": "We love it",
                "reviewText": "We had our bunn Tim hortons pot for years but it kicked the bucket. I knew I needed another one similar to it. And this is it!! It's easy to use, makes a pot of coffee in about 2 minutes and it's HOT! Not sure why it has negative reviews because I couldn't be happier with it.Yes if you like super strong coffee it might shoot some grinds out because the force of the water coming out. 3 heaping tablespoons(kirkland brand) is plenty strong enough for me with ZERO ISSUES. I hope it lasts as long as my Timmie's one did. Buy it, you'll love it. I was sceptical with the ad reviews but I'm glad I did. 10 stars",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ziad Almaloul",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 12, 2022",
                "reviewTitle": "Works good but...",
                "reviewText": "The product works good, but the lid where you pour water in broke off the first week, it's extremely fragile that piece. Pay a little more and get the better version of this machine",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MrDeeGee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 19, 2022",
                "reviewTitle": "Water is Not Hot Enough!",
                "reviewText": "This unit stores one pot of water in a rear reservoir that it is supposed to keep heated, so that you get an instant pot of coffee in less than five minutes.The problem is, the water in the rear reservoir is NEVER heated hot enough to get a good pot of coffee from. And there is no thermostat to allow you to turn up the temperature.If coffee water is not near boiling, then the coffee is more acidic and can cause acid reflux and other digestive issues. This is exactly the problem that I have with this unit.You can also not make a pot for a few days with it, and the water in the rear reservoir will cool right off, you never hear it heating the water back up.Useless if you have issues with acidic coffee acid reflux.I use good coffee with my unit, the McDonalds grind, and I get acid reflux from this unit but not from the coffee that I buy from the drive-thru. The drive-thru coffee will burn your lips, this coffee maker is nowhere near that hot. A total waste of money.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}