{
    "remaining_requests": 35944,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cuisinart-DCC-3000-Coffee-Programmable-Coffeemaker/dp/B005IR4W7W",
    "body": {
        "name": "Cuisinart Coffee Maker, 12 Cup Programmable Drip, DCC-3000P1, Black",
        "price": "$89.04",
        "originalPrice": "$119.95",
        "rawPrice": 89.04,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cuisinart-DCC-3000-Coffee-Programmable-Coffeemaker/dp/B005IR4W7W",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B01M3RTF68"
        ],
        "asinVariationValues": [
            {
                "asin": "B005IR4W7W",
                "variationName": "Style",
                "variationValue": "Modern",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "Standard",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B005IR4W7W",
                "variationName": "PatternName",
                "variationValue": "Coffeemaker",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "PatternName",
                "variationValue": "Coffeemaker + Burr Mill",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "PatternName",
                "variationValue": "Coffeemaker + Filters",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-kAxsZjUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Kwj48fmdL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Cuisinart Store",
            "link": "https://www.amazon.com/stores/Cuisinart/page/9EA87106-FA2E-4134-BB4D-18194A61B989?ref_=ast_bln"
        },
        "brand": "Cuisinart",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 12117,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 8 hrs 1 min",
            "FREE delivery Monday, February 19. Order within 8 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Please refer to user guide or user manual or user guide (provided below in PDF) before first use"
        ],
        "description": "Coffee Without the Carafe!Cuisinart lets you have your coffee on demand! The Cuisinart DCC-3000 Coffee on Demand dispenses one cup at a time with an easy to use actuator. Hold up to 12 cups of coffee in the double-wall coffee reservoir. The easy to read coffee gauge lets you know how many cups of coffee are left, and the included charcoal water filter keeps your coffee tasting great. The DCC-3000 makes coffee easy-- its fully programmable with 24-hour advance brew start, programmable auto shutoff, self-clean, and a 1-4 cup setting to brew smaller amounts that still taste delicious. Remove both the coffee and water reservoirs for easy clean up. Note:Coffee grounds/particles are accumulating coffee container where the brewed coffee exits the container, which prevents the gasket from sealing correctly when the dispense lever is released. When/if this happens, the valve needs to be rinsed with tap water while holding the valve (located on the bottom of the container) open to flush any grounds/particles out.Features and BenefitsRemovable Water Reservoir Detaches from unit for easy filling. Drip Tray Plate Removable plate which holds the drip tray in place. Drip Tray Removable tray with grate to catch any excess coffee that does not dispense into mug and residual condensation from the brewing process. Coffee Reservoir Removable double-wall reservoir keeps up to 12 cups of coffee hot for hours. Charcoal Water Filter Charcoal water filter eliminates chlorine, bad tastes and odors from tap water. Coffee ScoopCoffee Gauge Displays amount of brewed coffee remaining in reservoir. Hour and Minute Buttons Used to set time of day and set time for automatic functions. Function Knob Used to initiate programming of automatic functions – Auto On, Auto Off, Program, Clock, and Brew. Clean Setting Tells you when it's time to clean your coffeemaker. Remove built-up calcification from the water reservoir to help extend the life of your coffeemaker. 1–4 Cup Setting Improves extraction, flavor and temperature when brewing fewer than 5 cups. Dispenser Lever For dispensing coffee into mug or travel cup. Showerhead Distributes water evenly over coffee, reducing temperature loss as water passes through grounds. Dispenser Light Light comes on when dispensing lever is pressed and coffee pours into cup. Power Loss Back-up System One-minute protection against losing your programmed settings in case power fails, breaker trips or unit is unplugged. Ready Tone Signals the end of the brew cycle with five beeps. Gold-Tone Cuisinart Commercial-Style FilterFilter Basket Holds our commercial-style permanent filter or a paper filter. Removable for easy cleaning. BPA Free All materials that come in contact with liquid are BPA free. Easy to Use Control PanelCoffee Gauge Displays amount of brewed coffee remaining in unit.Clock Display Displays time of day and Auto On and Off times. Hour and Minute Buttons For use in setting hour and minute for time of day, Auto On time, and Auto Off time. Function Knob Auto On The Auto On setting programs the coffeemaker to turn on at the time selected, up to 24 hours in advance. See “Program” below for instructions on setting time. Auto Off The Auto Off setting lets you program coffeemaker to shut off 0 to 4 hours after brew cycle ends. Holds selected time until you change it. Program The Program function is used to set the Auto On time. Select brew start time with hour and minute buttons – LCD displays “PM” for afternoon and nighttime brew starts. Holds selected time until you change it. Brew The Brew function is used to start the brew cycle directly. Clock Used to program the time of day. Audible Tone An audible tone sounds 5 times when the coffee has completed brewing. Auto On Indicator LightClean Setting Indicates time to clean coffeemaker to remove calcium buildup. 1–4 Cup Setting Improves extraction, flavor and temperature when brewing fewer than 5 cups. On/Off Button Used to turn your coffeemaker on and off. Unit must be on to program functions.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Coffee, Tea & Espresso",
                "link": "https://www.amazon.com/coffee-tea-espresso/b/ref=dp_bc_aui_C_3?ie=UTF8&node=915194"
            },
            {
                "name": "Coffee Makers",
                "link": "https://www.amazon.com/Coffee-Makers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7740213011"
            },
            {
                "name": "Single-Serve Brewers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=2474054011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Cuisinart"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "11.25\"D x 8.75\"W x 14.7\"H"
            },
            {
                "name": "Special Feature",
                "value": "Programmable, Removable Tank, Auto Clean Function, Automatic Shut-Off, Water Filter, Removable Drip Tray See more"
            },
            {
                "name": "Coffee Maker Type",
                "value": "Drip Coffee Machine"
            },
            {
                "name": "Filter Type",
                "value": "Paper"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Personal"
            },
            {
                "name": "Included Components",
                "value": "Hot Beverages;Coffee Machines;drip coffeemakers"
            },
            {
                "name": "Operation Mode",
                "value": "Fully Automatic"
            },
            {
                "name": "Voltage",
                "value": "110"
            },
            {
                "name": "Model Name",
                "value": "DCC-3000P1 12-Cup Programmable Coffee Maker"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Mouse, Buttons"
            },
            {
                "name": "Package Type",
                "value": "Standard Packaging"
            },
            {
                "name": "Item Weight",
                "value": "9 pounds"
            },
            {
                "name": "Department",
                "value": "Unisex"
            },
            {
                "name": "Manufacturer",
                "value": "Cuisinart"
            },
            {
                "name": "ASIN",
                "value": "B005IR4W7W"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "DCC-3000P1"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 12,117 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,618 in Home & Kitchen (See Top 100 in Home & Kitchen) #20 in Single-Serve Brewers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "June 15, 2010"
            },
            {
                "name": "Capacity 12 Cups",
                "value": "Material Stainless Steel, Plastic"
            },
            {
                "name": "Item Weight 9 Pounds",
                "value": "Wattage 400.6"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Cuisinart DCC-3000 Coffee-on-Demand 12-Cup Programmable Coffeemaker Fill up your Cuisinart Coffee on Demand 12 Cup Programmable Coffeemaker once and enjoy fresh brewed cups throughout the day! This incredible carafe-free coffeemaker uses unique Coffee on Demand technology to brew cup by cup, ensuring fresh hot coffee is always on hand. With the removable water reservoir, Coffee Gauge counting down cups remaining, 24-hour programmability, and adjustable auto shutoff, fresh coffee has never been so convenient!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/7899136b-0b0b-4541-8a57-1b27ab0b0f22._CR1,0,1500,1500_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/7899136b-0b0b-4541-8a57-1b27ab0b0f22._CR1,0,1500,1500_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "EdNAtl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZP65EZ2RI3YAAKFCJB6YKS3Y3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYG2QLU2IR4IG?ASIN=B005IR4W7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 22, 2014",
                "reviewTitle": "5.0 out of 5 stars Makes a great cup of coffee!",
                "reviewText": "I've only had this coffee maker for about a month so I can't attest to it's longevity. It's my first Cuisinart product but it seems so far to be living up to the brand's reputation for quality. The coffee comes out at the perfect temperature (piping hot, not scalding hot) and tastes absolutely delicious! I don't know how well the water filter works since I always use filtered or bottled water to begin with. The tap water in Atlanta has a lot of chlorine in it which can make the coffee bitter, so the water you use is just important as the coffee you use. I set the keep warm timer to 4 hours and the last cup is as good as the first. If there is coffee left over I pour the rest into a thermal carafe and save it for later. If I empty the pot before the timer cuts it off, I make sure to turn the unit off to avoid burning any remains at the bottom. The handy \"gas gauge\" on the front is a great way to tell approximately how much is left. You'll need to make sure the tank is completely empty before brewing a new pot. Although the water reservoir is removable, I find it easer to use a pitcher or large plastic cup to fill it from the top. The LED light above the dispensing alcove is a handy feature to let you know when your cup is almost full.Other reviews I've read complained of leaks and drips. I've not had any major problems with this but I did experience some water on my counter top one morning. I discovered that the drip pan had run over. I emptied the pan and dried everything off. Then I ran the unit again without the coffee. I small amount of water (no more than a tablespoon) runs into the pan near the end of the brewing cycle. Once brewing stopped, I opened the lid and observed that the steam generated during brewing had condensed into water droplets on the lid and shower head. As I tilted the lid back more droplets ran down the rear inside of the unit and out into the drip pan. My conclusion is that there is not anything wrong with the unit and that the water running into the drip pan is just condensation and not a leak. I just have to remember to check the drip pan every couple of days and empty it. Problem solved.I have been using the included wire mesh basket to hold the ground coffee. The cons to this are that the basket is a bit difficult to clean and it allows more of the fine grounds to pass through resulting in a fine sludge at the bottom of the pot. If you use the mesh basket you'll need to clean the unit more often. The pros to using the mesh basket are that you are saving trees and I think the coffee actually has a bit more flavor, and isn't that what it's all about?The unit is a bit bigger than it looks in the photo and does take up a good bit of counter space. It's billed as a 12-cup unit but they are basing it on 5 oz cups. An actual cup is 8 oz so you are really only getting 7.5 cups from a full pot. I've had many coffee makers over the years but this is my first with a dispenser instead of a carafe. So far I've been very happy with it.In conclusion, while the unit is a bit bulky, it is very attractive. It is easy to use and maintain. Most importantly, it makes a great-tasting cup of coffee!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Retirednlovingit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCU2XZ2IKYC3ITO5BLYYNQVJSLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R68J1OCQSWQYZ?ASIN=B005IR4W7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2014",
                "reviewTitle": "5.0 out of 5 stars I'm very satisfied with the Cuisinart DCC-3000",
                "reviewText": "After one day of use and two brews, I'm very satisfied with the Cuisinart DCC-3000. Like another user said, it's tall! But there is about 1 3/4\" clearance to my cabinets. Like another Cuisinart I've owned, I had to pull it out from under the cabinets anyway to prepare it to brew, so what's the problem? Slide it out, throw in the coffee and water, and then slide it back. Haven't most of us done it that way for years?I really like the controls. They are simple...like the Cuisinart DCC-1200, but better arranged. A button replaced the on/off toggle on this new model, but it is otherwise quite similar. If you've own other Cuisinart's like me, you will be instantly at home with this unit.Somebody must actually read these reviews at Cuisinart, because they did increase the size of the clock to the point you can comfortably read the black numerals on the electronic blue background from about five feet away. No longer must your squat down or get on your knees to program it with your reading glasses on. (But I'm still waiting for one I can see from across the room at the dining table. I know you techs at Cuisinart can do this!)The setup for the clock is almost identical to the DCC-1200 I purchased several years ago, and that made an already easy task very simple perform. With that done it was time to put this jewel to work.Pull it out from under the cabinet, Open the left reservoir and pour in H2O to the 12 cup line (water reservoir is scaled 3-12 in 1 cup increments). Want to make a 3 or 4 cups really fast...yes you can. There is a button for that.You have your choice of filling it on the machine or lifting the reservoir off and taking it to the water source where it might be more convenient for your particular setup. Lifting the hatch on the right hand side of the brewer exposes the coffee reservoir and coffee basket carriage in which sits one of those gold screen baskets. In this instance it is nice to lift the basket out and load it on the counter, otherwise I'd have coffee all over the counter and brewer. There isn't much more to do to remove the coffee reservoir when time for cleanup later. I use a paper filter in the basket to keep the grounds in the coffee to a minimum.A full 12 cup brew was just under 10 minutes without some of the loud steam sounds familiar in the DCC-1200. That's an unexpected plus. Put in your favorite mug or cup, press the dispense button and...Holy moly...what is that? A light came on above the cup so you can see how full you are pouring! Awesome!!! A nice little LED light that should outlast the coffee maker. (I tell you folks, they'll get that clock up to the right size. You just wait and see!)And the acid test...taste. It was really quite good. I didn't have anything in the house except some classic roast Folgers, but it was very good...way better tasting than average. Yep...a keeper. I drank the reservoir dry after several hours. I did not experience burnt tasting coffee as mentioned by some other reviewers. I would probably have appreciated it if they had kept the three position switch for the carafe temperature from the DCC-1200, in this model, but as I said, no burnt taste so far.Cleanup was very simple and I've already got it programed for Auto-Run in the morning. Do I miss the carafe from my old DCC-1200? Nope! In all seriousness, you will be happy with this coffee maker too. Cuisinart has designed and produced another excellent coffee maker. Is it perfect? No...But what is? They certainly have made some major improvements and I can almost promise you that Cuisinart is not through designing and building great coffee makers that last a long time so you can get your value from them.Don't forget that you are getting the added protection and customer service from Amazon who have gone out of their way to make you happy and keep you there time after time.Update on March 02, 2015: I've had this Cuisinart DCC-3000 for 8 months now and am still extremely pleased with it. For those who asked about filling tall cups in this thing...yes you can. Secret? This coffee maker has a long enough electrical cord that you can pull the unit out to the edge of the counter. Actually, I pull it until it's hanging 1/3 over the edge. Pull out the drip tray and set it to the side, and then you can fill up that giant mug from the 7-11 store. Really! I do it nearly every week before going to a bible study where we drink lots of java. If that clearance issue was stopping you from buying this great coffee machine, wait no longer.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amy J. Leigh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2T7BC62B63EYLGLAIHCRROCWKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R225G2SXSGHP4?ASIN=B005IR4W7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Decent machine, happy with purchase",
                "reviewText": "I purchased this machine after having a Keurig type machine for several years. I was tired of using the pods and the difficulty with descaling the machine. I like that this has a lever so I can fill up my coffee cup based on how large a cup it is; some cups are larger or smaller than others and this lets you control the perfect amount. I do find the programming buttons to input the time for the clock and the auto Brew Cycles difficult to use. Sometimes I push them and the interface doesn't work and so I have to tap it some more or push harder and I worry that these will break in time. I appreciate that I can set this on a timer and it keeps the coffee warm. Unfortunately it only keeps it warm for maybe 2 hours and when you have two people using it who wake up at different times of the morning it is a little dismaying to wake up 2 hours after the machine has brewed and the warming feature has already shut off. It seems to be easy to clean and easy to fill and set the coffee and water. I like that there is a light that shines on the cup so you can see in a dark room. I think that the measurements are a bit off for us because our coffee cups are larger and when I program the machine to brew 6 cups of coffee for example we get maybe three and a half cups out of the machine so I have to brew more. Perhaps that's because our cups are larger. This machine could be improved with a electrical cord that was a few inches longer as I have accidentally unplugged this a couple times trying to pull it out to access the top of the machine without running into my cupboards above it. Having the option to increase the warming cycle would also be nice.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin SinclairKevin Sinclair",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 12, 2023",
                "reviewTitle": "I was skeptical when I ordered it, but this coffee maker is honestly even better than I expected.",
                "reviewText": "The media could not be loaded. My coffee maker suddenly broke so I read several consumer reports and this model was in most of them if not all of them, ranked No. 1 via one report from the official \"Consumer Reports\" brand.I was intrigued by the notion of no coffee pot. I thought it was a really nice-looking machine. But in theory, I felt like there would be more cleaning to do because the coffee is stored inside the machine in a reservoir, and I assumed it would be tricky to clean that out every day.I decided to just give it a shot. It arrived and right away, I thought it looked a lot more impressive than I'd expected. It's a very sharp looking machine. Also, it keeps a pot of coffee hot longer than your typical coffee pot, in my experience. This is important to me as I drink coffee for hours after I wake up.First night, I set the coffee maker to brew a pot 10 minutes before I would be waking up. I got up that morning, came to my kitchen, viola. Fresh brewed coffee, no pot, just a convenient tab you press down like when you're getting coffee in a hotel lobby.Have had it for about a week now. Cleaning the coffee filter out and the coffee reservoir (the chamber that holds the whole pot of coffee inside the machine, is much easier than I expected. Both the coffee filter and the coffee reservoir/chamber have convenient little handles, and they slide right out of there with ease. And then it's really easy to rinse them.I can honestly say that so far, this coffee maker has been much better in general than I expected. It looks nicer than I expected, it's easier to operate and clear than I anticipated, the coffee stays hotter and taste better than I'd expected.Really good buy here.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Dsvh9hr4L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71qe-cPC9EL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/D1gFzfe9n8L.mp4"
                }
            },
            {
                "reviewerName": "Enrique",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 8, 2021",
                "reviewTitle": "Muy buena calidad",
                "reviewText": "Muy fácil de limpiar, se puede usar con filtro permanente o desechables.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon カスタマー",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on March 31, 2020",
                "reviewTitle": "予備の保管用に購入しました",
                "reviewText": "同じものを使用中なのですが、延長保障が切れたのと故障した時に販売終了だと嫌なので、予備の保管用に購入しました。（クイジナートはアメリカのメーカーのため、修理の際は保障期間中は代替品と交換になるはずです。）味はお湯を沸かして手で淹れるのと明らかに違い、このコーヒーメーカーで淹れたコーヒーはまろやかで飲みやすいと思います。温度が低いという意見もあるようですが、私はちょうど飲み頃の温度で満足しています。大勢で集まる時も大活躍で、飽きのこないデザインも注目の的です。味も満足ですが、このデザインは国産メーカーにも見習って欲しいですね。",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 19, 2023",
                "reviewTitle": "Great coffee maker",
                "reviewText": "I had this coffee maker for many years and when it was time to get a new one I thought I would try another brand name . That one was horrible and after having to change out the other brand name twice within a year I went back to the Cuisinart. The only negative thing is that the plug on my unit was extremely hard to get out . Once we got it out the coffee maker is easy to use and the coffee is always hot . I would highly recommend this coffee make and plus it was on sale after black Friday which was a bonus because I saved around $80.00 .",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrés Antonio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 29, 2018",
                "reviewTitle": "Excelente cafetera la recomiendo ampliamente",
                "reviewText": "Excelente cafetera, me ahorré mucho dinero como siempre al comprar en Amazon.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}