{
    "remaining_requests": 12008,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/MINGKIDS-Montessori-Toddlers-Colorful-Christmas/dp/B0CFKKTBXZ",
    "body": {
        "name": "MINGKIDS 7 in1 Montessori Toys for Toddlers 1 Years,Shape Sorter Colorful Stacking and Pull String Toys,Car Travel Toys Christmas Birthday Gifts for Toddler Stocking Stuffer",
        "price": "$19.79",
        "originalPrice": "$21.99",
        "rawPrice": 19.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/MINGKIDS-Montessori-Toddlers-Colorful-Christmas/dp/B0CFKKTBXZ",
        "soldBy": {
            "sellerID": "AKEVROO531UGT",
            "name": "KidsGiftsStore",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AKEVROO531UGT&asin=B0CFKKTBXZ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CQCBFV73"
        ],
        "asinVariationValues": [
            {
                "asin": "B09BB1VS14",
                "variationName": "Style",
                "variationValue": "Cube",
                "price": "$9.98",
                "variationImageURL": ""
            },
            {
                "asin": "B0CFKKTBXZ",
                "variationName": "Style",
                "variationValue": "Montessori 7 IN 1",
                "price": "$19.79",
                "variationImageURL": ""
            },
            {
                "asin": "B09HWTDJ7T",
                "variationName": "Style",
                "variationValue": "Rectangle",
                "price": "$13.49",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51n6K97tr1L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51n24hRX1yL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AnLQb9AhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416gI5KS3kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HDD4dPFvL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the MINGKIDS Store",
            "link": "https://www.amazon.com/stores/MINGKIDS/page/E345E609-8C62-4122-9DF0-1083E87B6DFE?ref_=ast_bln"
        },
        "brand": "MINGKIDS",
        "merchantInfo": "KidsGiftsStore",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3566,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 21 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "7 in 1 Montessori Toys:This learning toys allows your kids to play 7 games in 1 toy:sensory bins toy can be used for elastic rope space exploration for toddlers, activity blocks shape matching, stacking blocks, pull string toy, rotating gears, rotating beads, baby xylophone.",
            "Safe Material:The educational toy frame made of high quality ABS plastic has rounded corners and is soft. All edges and patterns are polished to a smooth and round shape, which is comfortable and skin-friendly.",
            "Develop Fine Motor Skills:Baby tries to push shapes through the elastic band,sort the shapes in the correct holes, pull the silicon strips,rotate the gear,play the xylophone and bead maze,stacking the shaped blocks which can wiggles to make a crisp sound helping baby develop multi- sensory,fine motor skills and hands-on practice, making it an excellent early education toy.",
            "Suitable Size,Safe Material,Durable and Smooth Design:The shapes are colorful and just the right size for little hands to hold and manipulate.this is a lightweight and colourful toy,the edges are smooth.Made of safe material(Silicon pull string toy,ABS material for shaped blocks and smooth container cube ).High quality durable elastic strips",
            "Toys & Gifts for Babies: This baby activity cube is ideal for children's birthday / holiday / Christmas gift. Best gifts for little boys and girls."
        ],
        "description": "[7 in 1 Toddler Activity Cube] : This interactive toy allows your kids to play 7 games in 1 toy: baby xylophone, rotating beads, shape sorter, spinning gears, pull string activity, sorting & stacking blocks,colorful elastic pull strings put in and take out block. The multi-functional baby activity cube toy will attract their attention for hours as they will rotate from one side to another.",
        "breadCrumbs": [
            {
                "name": "Toys & Games",
                "link": "https://www.amazon.com/toys/b?ie=UTF8&node=165793011"
            },
            {
                "name": "Baby & Toddler Toys",
                "link": "https://www.amazon.com/Baby-Toys-Preschool/b?ie=UTF8&node=196601011"
            },
            {
                "name": "Early Development & Activity Toys",
                "link": "https://www.amazon.com/b?ie=UTF8&node=21490695011"
            },
            {
                "name": "Activity Cubes",
                "link": "https://www.amazon.com/b?ie=UTF8&node=21490696011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "6.1 x 6.06 x 5.98 inches"
            },
            {
                "name": "Item Weight",
                "value": "15.2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CFKKTBXZ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#103 in Toys & Games (See Top 100 in Toys & Games) #1 in Activity Cubes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,566 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Manufacturer",
                "value": "MINGKIDS"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Federica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGY5LE772M5GCUX3JMLMQS3HH3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11M91VJ2G4X0L?ASIN=B0CFKKTBXZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars A Perfect Blend of Education and Fun",
                "reviewText": "I recently purchased thia Montessori Toy for my three-year-old niece, and I must say it has exceeded all my expectations. As a parent who emphasizes education and cognitive development, I am always on the lookout for toys that promote learning while still being enjoyable. This Montessori toy does exactly that and more.Firstly, the toy is beautifully crafted with attention to detail. The colors are vibrant, and the materials used are safe and durable, ensuring longevity. It immediately caught my nieces attention with its attractive design, captivating her interest in exploring further.Moreover, this Montessori toy encapsulates the Montessori philosophy perfectly. It encourages hands-on exploration and promotes independent learning. The varied activities included are engaging and stimulating, fostering creativity, problem-solving, and fine motor skills development. Each component is carefully designed to aid children in learning key concepts such as shape recognition, color differentiation, counting, and logical reasoning.What impresses me the most is the versatility of this toy. It offers multiple ways to play, ensuring prolonged engagement. Whether my niece3 is matching shapes, assembling the puzzle, sorting colors, or counting beads, the possibilities seem endless. It challenges and stretches her cognitive abilities, keeping her entertained for hours on end without feeling repetitive.Another outstanding aspect of this toy is its adaptability to different skill levels. It allows my daughter to progress at her own pace, making it suitable for children from various age groups. The incremental difficulty levels help foster continuous growth and adapt the learning experience to the child's individual needs.I also appreciate the inclusion of a small guidebook that illustrates different game ideas and activities. It not only serves as a great resource for parents who may be new to Montessori methodologies but also provides inspiration for additional educational activities outside of the toy itself. This thoughtful addition has helped me bond with my little one and learn alongside her.As an added bonus, the [Montessori Toy] promotes the development of important life skills such as patience, concentration, and perseverance. These invaluable qualities will undoubtedly benefit my daughter beyond her early years.In conclusion, the [Montessori Toy] has become an everyday favorite for my daughter. Its educational value, durability, and endless hours of entertainment make it a worthwhile investment. Watching her learn and grow while having a blast is truly rewarding. I highly recommend this Montessori toy to all parents seeking a truly innovative and enriching play experience for their children.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDVGHEHEAHIOUMEVRII4WUJC53A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FQ4M1LE92TIB?ASIN=B0CFKKTBXZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Montessori Toy for Developing Fine Motor Skills!",
                "reviewText": "I recently purchased the MINGKIDS Montessori Toys for my 1-year-old, and I must say, it has been an absolute delight watching my little one engage with this toy. Not only is it entertaining, but it is also highly educational and perfect for developing fine motor skills in toddlers.The colorful cube and the 6-piece multi-sensory shapes included in this set are thoughtfully designed to capture the attention of young children. Each shape has a unique texture and vibrant color, which immediately draws their curiosity. My little one loves exploring the different shapes, feeling the textures, and figuring out how they fit into the corresponding holes in the cube.One of the standout features of this toy is its size and durability. The cube and the shapes are perfectly sized for tiny hands, allowing my child to easily grasp and manipulate them. The materials used are of high quality and can withstand the rough play of an active toddler. I appreciate the attention to detail and the sturdiness of the toy, ensuring that it will last for a long time.The developmental benefits of this toy are remarkable. As my child tries to fit the shapes into the cube, it promotes hand-eye coordination, spatial awareness, and problem-solving skills. The repetitive action of placing the shapes in the correct slots also helps refine their fine motor skills, enhancing their dexterity and precision.Moreover, this Montessori toy encourages imaginative play and fosters cognitive development. My little one loves to experiment with different combinations and patterns, which stimulates creativity and critical thinking abilities. It's incredible to witness their growth and confidence as they master new skills and accomplish each challenge this toy presents.As a parent, I appreciate that this toy is made from child-safe and non-toxic materials, ensuring my child's well-being during playtime. The smooth edges and absence of small parts eliminate any concerns about choking hazards. Additionally, the bright colors and engaging shapes make this toy visually appealing, keeping my child entertained and engaged for extended periods.Overall, I highly recommend the MINGKIDS Montessori Toys for 1-Year-Olds to all parents looking for an engaging and educational toy that focuses on fine motor skill development. It's an excellent investment in your child's early learning journey. Not only will it provide hours of entertainment, but it will also lay the foundation for essential developmental skills. This toy has exceeded my expectations, and I am confident it will do the same for other families.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melody Souders",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBWOX3KJBJTTVIC2J32QM35TLRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BJAMV7E2554X?ASIN=B0CFKKTBXZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "My son loves this thing. It is great for problem solving, motor skills, hand eye coordination, color identification...gets played with every day!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZWFI27WCKMLYHOAZYVNRODCRSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15MOSY6K3MWZE?ASIN=B0CFKKTBXZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Great toy for 1 year old",
                "reviewText": "Good quality and easy for small kids to push the pieces through. It is smaller than it looks though.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KristinaKristina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOT6I7HODHICCTSMSUEVRZDHTEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FNMI1QEFBGLA?ASIN=B0CFKKTBXZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Safe for littles",
                "reviewText": "I got this for my son when he was around six months. He loves to play with it. My two year old enjoys it too. The balls are a little flimsy, but they’ve held up fine. The strings are well attached and the pieces are a good size for safe handling.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61yCymi2uNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ZxDgSHjAL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chandini",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVWAO2HW2QIAI7AEAL7N5WPSPKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZJMSUMKQ3VXG?ASIN=B0CFKKTBXZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for gifting!",
                "reviewText": "Bought this toy for my 10mo niece and she loved the shapes. She then discovered the box with stretchy strings on all sides. Few sides have strings close together so the shapes easily get in but taking them out is a task. This is an amazing toy with a good level of problem solving for the little minds! Infants and toddlers may get frustrated trying to get the shapes out of the box but that’s the most fun part for the parents! :) I personally like to watch the babies figure it out and do it on loop! Bought another one to gift as well! Highly Recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shane Quinlan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2FFKJK4NGBZ5ANWLCNAF6HSALA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KN77CWZY2YDT?ASIN=B0CFKKTBXZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Entertaining",
                "reviewText": "This toy keeps my baby entertained for so long! It’s silent and not stimulating, but it’s also easy to clean. This is a great price point, too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Spunky Mama C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTCTRUT2NSPM65WGYTFX6G3JM7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W1R4DO5K3QC6?ASIN=B0CFKKTBXZ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "3.0 out of 5 stars Baby-Tot toy",
                "reviewText": "The toy itself is good and keeps baby content but it's a lot smaller than I expected. I'm keeping it but if I had to do it again I would not pay the asking price for it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amber Delaney",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 25, 2023",
                "reviewTitle": "Keeps Baby Busy",
                "reviewText": "My baby really enjoys pulling the blocks in and out of this cube. Great little toy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "peeyush paingoriya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 9, 2024",
                "reviewTitle": "Satisfied",
                "reviewText": "Happy to buy.... ☺",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Syed ghouse",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 3, 2024",
                "reviewTitle": "Best toy",
                "reviewText": "The media could not be loaded. Value for money",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/C13sPyEO35L.mp4"
                }
            },
            {
                "reviewerName": "Caroline",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 13, 2023",
                "reviewTitle": "Bon produit",
                "reviewText": "Mon fils aime jouer avec ce produit",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeevanjot ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 28, 2024",
                "reviewTitle": "Nice product",
                "reviewText": "Quality of this product is good ..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}