{
    "remaining_requests": 12155,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Crayola-Double-Doodle-Drawing-Toddler/dp/B077VYSXB3",
    "body": {
        "name": "My First Crayola Double Doodle Board, Drawing Tablet, Toddler Toy, Gift",
        "price": "$10.99",
        "originalPrice": "$13.89",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Crayola-Double-Doodle-Drawing-Toddler/dp/B077VYSXB3",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BN37BDQM"
        ],
        "asinVariationValues": [
            {
                "asin": "B09JHGRC5V",
                "variationName": "Style",
                "variationValue": "Color & Erase",
                "price": "$7.18",
                "variationImageURL": ""
            },
            {
                "asin": "B077VYSXB3",
                "variationName": "Style",
                "variationValue": "Double Doodle Board",
                "price": "$10.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "25",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51zFpbDOgeL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51A-rwyhbqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511N-EZrJEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SToycixSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mohV2b8hL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Kckads3LL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51B0MXcWPzL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Crayola Store",
            "link": "https://www.amazon.com/stores/Crayola/page/62526C66-0AEE-4925-829D-D35A73DCD4C3?ref_=ast_bln"
        },
        "brand": "Crayola",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 10397,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Sunday, February 18. Order within 3 hrs 55 mins",
            "FREE pickup Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest Same-Day pickup Today 10 AM - 3 PM. Order within 9 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "DOUBLE DOODLE BOARD: Features 1 Double Sided Doodle Board and 3 Washable Crayola Crayons for mess free, creative fun!",
            "TODDLER TOY: One side features a sealed gel surface for mess free doodling while the other side has a reusable drawing surface for use with Washable Crayons.",
            "TRIANGLE CRAYONS: Includes 3 washable, Triangular Crayons for toddlers that help guide little fingers to a proper writing grip.",
            "TRAVEL ACTIVITY: Sturdy and compact, this drawing kit makes a great car activity for kids!",
            "CRAYOLA MY FIRST: My First Crayola art supplies are designed to make creativity accessible at an early age, with tools designed for stages so that kids can progress at their own natural pace."
        ],
        "description": "Give your toddler twice the creative fun with the My First Crayola Double Doodle Board. One side has a sealed gel surface for mess-free doodling and tactile play. The other side has a reusable drawing surface for creating scribbles with the included Ultra Clean Washable Crayons. Simply wipe the surface to Doodle again and again! This fun art set features 1 Double Doodle Board and 3 Tripod Grip Crayons. The specially designed crayons help beginner artists find a comfortable grip so they can color as long as they like. Safe and nontoxic for 24 months and up, the Double Doodle Board makes a great gift for boys and girls.",
        "breadCrumbs": [
            {
                "name": "Toys & Games",
                "link": "https://www.amazon.com/toys/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165793011"
            },
            {
                "name": "Arts & Crafts",
                "link": "https://www.amazon.com/kids-arts-crafts-easel-paper-marker-stamp/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166057011"
            },
            {
                "name": "Drawing & Writing Boards",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=19431267011"
            },
            {
                "name": "Doodle & Scribbler Boards",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=19431269011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "11\"W x 10\"H"
            },
            {
                "name": "Item Weight",
                "value": "5.3 ounces"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "ASIN",
                "value": "B077VYSXB3"
            },
            {
                "name": "Item model number",
                "value": "81-1399"
            },
            {
                "name": "Manufacturer recommended age",
                "value": "24 months - 10 years"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,284 in Toys & Games (See Top 100 in Toys & Games) #31 in Kids' Doodle & Scribbler Boards"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 10,397 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Release date",
                "value": "December 15, 2017"
            },
            {
                "name": "Manufacturer",
                "value": "Crayola"
            },
            {
                "name": "Brand",
                "value": "Crayola"
            },
            {
                "name": "Color",
                "value": "Assorted Colors"
            },
            {
                "name": "Material",
                "value": "Wax, blend, paper, blend"
            },
            {
                "name": "Included Components",
                "value": "1 Double Sided Doodle Board, (3) Ultra Clean washable tripod grip crayons, Gel side and Reusable side See more"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "At a Glance: Stage 2: For daring doodlers discovering swirls, line, and shapes Two-sided portable drawing board combines crayon doodling with tactile play Colorful sealed gel surface offers mess-free doodling Reusable drawing surface easily wipes clean Triangular crayons encourage proper writing grasp Recommended for ages 24 months and up My First Crayola Double Doodle Board Double the Creative Fun in One Board The My First Crayola Double Doodle Board allows kids to doodle with crayons and engage in mess-free, tactile play on a single portable drawing board. With two sides to play with, this board provides young artists with double the doodling fun. It features a sealed gel surface on one side that simulates the feeling of finger painting, but without the mess of real paint. The other side provides a more traditional crayon-and-paper drawing experience--kids can flip the doodle board over and doodle on the drawing surface, which easily wipes clean for reusable fun. This set includes three washable Tripod Grip crayons that easily wash from hands, clothing, and walls. What's in the Box: 1 Double Doodle Board 3 Washable Tripod Grip Crayons",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/17e33788-2a56-4f41-a3cf-720a6e46bfd9._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6d523f54-c93e-4523-b97b-8ee356f2797c._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "A Portable Art Studio The My First Crayola Double Doodle Board has a portable design so kids can play comfortably anywhere they go. Take the doodle board to Grandma's house, to restaurants, on the road, and more. Reusable, Two-Sided Doodle Board for Versatility Kids can enjoy hours of creative fun with the doodle board's two reusable sides. One side features a wipe-off surface for doodling with the included crayons. Cleaning up after drawing is easy: simply wipe the surface clean with a cloth to remove all crayon traces. The other side has a sealed gel surface for mess-free doodling and tactile play. Tripod Grip Crayons for Proper Writing Grip With their triangular shape, the included Tripod Grip crayons help encourage little fingers to develop a proper writing grip. The color easily washes clean from skin, clothing, and walls.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f8ebb10e-c46e-4154-8ffc-70c882919939._SL300__.jpg"
                ]
            },
            {
                "media_text": "Exploring Color with My First Crayola My First Crayola offers uniquely designed tools and activities for toddlers' little hands to spark their first creative experiences. Each item in the My First Crayola lineup is specially made for each stage of a young child's creative development, exploration, and expression. Look for the stage that's right for your toddler. Stage 1: For little scribblers making their first colorful marks Stage 2: For daring doodlers discovering swirls, line, and shapes Stage 3: For budding artists ready to express their imaginations",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7e4599f8-5850-42d0-bca2-906ed72e580c._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/8cebd4b7-730c-4d0a-b961-0893e06d697c._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/17e33788-2a56-4f41-a3cf-720a6e46bfd9._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6d523f54-c93e-4523-b97b-8ee356f2797c._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f8ebb10e-c46e-4154-8ffc-70c882919939._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7e4599f8-5850-42d0-bca2-906ed72e580c._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Yanky",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP3PAUTZXTBGQR7BX3RDZTS7DTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R193KBELEUQNZA?ASIN=B077VYSXB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Great activity toy",
                "reviewText": "As a parent seeking engaging and creative activities for my young kids, I decided to try the Crayola Color and Erase Reusable Activity Board, and it has become an instant hit in our household!The activity board's design is child-friendly and thoughtfully crafted. It comes with a sturdy drawing surface that allows kids to draw, doodle, and explore their imagination freely. The quality of the board is excellent, and it can withstand the enthusiastic scribbles and erasures of young artists without any signs of wear or tear.The highlight of this activity board is its reusability. Unlike traditional paper coloring books, this board enables kids to draw and erase as many times as they want, offering endless hours of creative fun. Not only does this save paper, but it also helps kids develop their artistic skills and boosts their confidence without any fear of making mistakes.The set includes four vibrant and washable markers, providing a broad range of colors for kids to use in their creations. The markers are easy to grip, making them suitable for small hands. The accompanying eraser is effective in clearing the board for a fresh canvas, though a larger-sized eraser would have been a nice addition.The Crayola Color and Erase Activity Board are ideal for children between the ages of 3 and 6 years. It caters to their developmental stage, allowing them to practice fine motor skills and express their creativity. The simplicity of the board and markers makes it accessible for young kids to use independently.The activity board's compact size makes it highly portable, perfect for keeping little ones entertained during car rides or when dining out. The markers' washable feature ensures easy cleanup, sparing parents from worrying about stains on clothing or furniture.Beyond being a source of entertainment, this activity board also offers educational benefits. Drawing and coloring aid in refining hand-eye coordination, stimulating imaginative thinking, and enhancing color recognition skills. It fosters a positive learning experience while keeping kids entertained.Considering the reusability and the included markers, the Crayola Color and Erase Activity Board offer excellent value for money. It's an economical and sustainable option compared to constantly purchasing paper coloring books.The Crayola Color and Erase Reusable Activity Board are an absolute delight for young kids. Its durable design, reusability, and washable markers make it a practical and entertaining choice for parents and children alike. The board's educational value and affordability further solidify its position as a must-have gift for kids aged 3 to 6. Whether it's for creative play at home or on-the-go fun, this activity board is sure to bring joy and smiles to your little artist's face!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED3JJCTAMSN7V2ZBNKLQKKWJCZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34YB07F7M9GKZ?ASIN=B077VYSXB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "Great for use with washable crayons",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7KZV4NJ5GBDVFTB7PEEUN4U53A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZACIH6MIQUHT?ASIN=B077VYSXB3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2022",
                "reviewTitle": "4.0 out of 5 stars Grandson likes it",
                "reviewText": "My grandson likes it. It’s fun for him and it’s pretty resilient. My only thought on this is that it could use a little more gel inside of it. Not too much but the amount it has doesn’t allow it to be completely cleared.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "the_necropantser",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFNFCRRYPC27OSUBDP4P6PNQDFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UUJEYBNZL1Z2?ASIN=B077VYSXB3",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2022",
                "reviewTitle": "3.0 out of 5 stars It’s ok; Gel side is pretty useless",
                "reviewText": "It’s ok. It’s size is convenient for travel and restaurants. The washable crayons wipe off fine. The crayon clip/storage mechanism isn’t good for travel; seem crayons will pretty easily break attached in the clip provided if jostled. I was mostly drawn to the gel side when I chose to purchase this, but it’s pretty useless. Markings/colorations disappear as soon as your finger moves off of the spot directly under your finger. It’s doesn’t hold drawings.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAHUXIJOHBFPJGFYWBMUBWV4ARQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VLIY1L5N4NDX?ASIN=B077VYSXB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect for young toddlers",
                "reviewText": "Bought this for my almost 2 year old niece and she loves it. It is mess free and gives her the chance to confusing loving art without needing paper and crayons.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karrie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQMKYQ3EHYCYHK4NNSGCKCNELIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U4ZARAM6MK63?ASIN=B077VYSXB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Great present for littles",
                "reviewText": "My grandsons love these. Great for home or traveling.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2YKS6TOYFB5CT2FBCDM3IWGMTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZZGCY9XPZ3ZA?ASIN=B077VYSXB3",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "1.0 out of 5 stars ended up not even gifting it",
                "reviewText": "Opened all of my granddaughter's gifts before wrapping them. Was excited for to have this one, and had especially bought Crayola for the quality, but found this to be ridiculously useless! The doodling pad just smeared and would not hold a formation. Didn't even give it to her.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRJXJG6YZRVZOBCWF5H47R4NO4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CTIYF50D42QS?ASIN=B077VYSXB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for occupational therapy",
                "reviewText": "This product serves to work with your children's fingers and hands.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yatty",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on January 30, 2024",
                "reviewTitle": "Not easily erased once drawn",
                "reviewText": "Once drawn on the surface of the board, it is not easily erased. After multiple drawings, there are a lot of residues. Should have a feature to erase and start over.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on June 15, 2021",
                "reviewTitle": "Very average product",
                "reviewText": "The colours provided are very soft and mess up hands and everything else they come in contact with , even though they are washable. The reverse side of the white board is quite useless and my child has shown no interest in it at all. Overall a very average product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}