{
    "remaining_requests": 7716,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pander-Set-Packing-Cubes-Organizers/dp/B0CJ9QVG6L",
    "body": {
        "name": "Pander Set of 6 Packing Cubes - Travel Organizers for Clothes, Luggage, Storage, Laundry, and More - Premium Nylon Fabric (Set of 6, Olive Green)",
        "price": "$24.99",
        "originalPrice": "",
        "rawPrice": 24.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pander-Set-Packing-Cubes-Organizers/dp/B0CJ9QVG6L",
        "soldBy": {
            "sellerID": "ANZMW3AL0TS0P",
            "name": "PANDER SPORTS",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ANZMW3AL0TS0P&asin=B0CJ9QVG6L&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJ9SJDCG"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CJ9RPHM8",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$24.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/410oMFYzubL._SS36_.jpg"
            },
            {
                "asin": "B0CJ9SL42L",
                "variationName": "Color",
                "variationValue": "Dim Grey",
                "price": "$24.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41AYvtg2MVL._SS36_.jpg"
            },
            {
                "asin": "B0CJ9QVG6L",
                "variationName": "Color",
                "variationValue": "Olive Green",
                "price": "$24.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41W6lI7IYXL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41W6lI7IYXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/4172LPtdWiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZlvUmJLyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31SPV7dEo3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pfz1jlyZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OAta-SDDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41N1veRRHDL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Pander",
            "link": "https://www.amazon.com/Pander/b/ref=bl_dp_s_web_120580082011?ie=UTF8&node=120580082011&field-lbr_brands_browse-bin=Pander"
        },
        "brand": "Pander",
        "merchantInfo": "PANDER SPORTS",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 28,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Sunday, February 18. Order within 4 hrs 58 mins",
            "FREE pickup Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 17. Order within 4 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "MULTI PURPOSE: Use the packing organizers for clothes, undergarments, accessories, shoes, toiletries, and more. The set of 6 comes in 6 different sizes: small cubes (11.75\" x 8.5\" x 4\"), medium cubes (14\" x 10.5\" x 4.5\"), large cubes (15.5\" x 12.25\" x 5\"), drawstring bag (14\" x 19.75\"), zipper pouch (10\" x 7.5\") and shoe bag (16\" x 6.25\" x 6.5”). See description for full measurements.",
            "DURABLE & QUALITY: The packing organizers are made with high-quality, lightweight, and durable materials. The fabric is water-resistant and easy to clean with a damp cloth. Mesh design for breathability and visibility.",
            "ORGANIZED: Use the packing cubes to separate and organize items in your suitcase, rucksack, or backpack. The set of 6 comes in 6 different sizes to fit all your travel needs. No more digging through a disorganized suitcase.",
            "VERSATILE: The packing organizers can be used for more than just travel. Use them to organize your dresser drawers, shelves, closet, and under the bed. The possibilities are endless.",
            "TRAVEL ESSENTIALS: Our packing cubes are designed for travel but can also be used for other purposes such as organizing clothes in your dresser, gym bag, or backpack. These packing cubes will turn packing nightmares into a simple, organized dream."
        ],
        "description": "If you're looking for packing cubes that are lightweight, durable, and easy to use, then look no further than the Pander set of 6 packing cubes collection. These cubes are perfect for organizing your clothes, shoes, and accessories while traveling, and they come in a variety of colors to help you keep everything sorted. The Pander Set of 6 Packing Cubes Collection is made from high-quality materials that are designed to withstand the rigors of travel, featuring a mesh design and they feature a sturdy zipper that opens and closes easily. The set includes a small cubes, a medium cubes, a drawstring bag, a zipper pouch and a large cubes, so you can customize your packing according to your needs. The cubes are also collapsible, so they take up less space when not in use.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9479199011"
            },
            {
                "name": "Travel Accessories",
                "link": "https://www.amazon.com/Travel-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15743971"
            },
            {
                "name": "Packing Organizers",
                "link": "https://www.amazon.com/Packing-Organizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15744041"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Pander"
            },
            {
                "name": "Color",
                "value": "Olive Green"
            },
            {
                "name": "Product Dimensions",
                "value": "12\"L x 8.25\"W x 4\"H"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight, Water Resistant"
            },
            {
                "name": "Closure Type",
                "value": "Zipper"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Number of Items",
                "value": "6"
            },
            {
                "name": "Size",
                "value": "Set of 6"
            },
            {
                "name": "Number of Sets",
                "value": "6"
            },
            {
                "name": "Manufacturer",
                "value": "‎PANDER SPORTS"
            },
            {
                "name": "Item Weight",
                "value": "‎1.3 pounds"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Special Features",
                "value": "‎Lightweight, Water Resistant"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0CJ9QVG6L"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 28 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,037,255 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #1,075 in Travel Packing Organizers"
            },
            {
                "name": "Date First Available",
                "value": "September 19, 2023"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stormwaterpro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTGCO42ZS3TNSAUG7UCJ466GEMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R377CS3XBVPNPW?ASIN=B0CJ9QVG6L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Lightweight soft organizers making from a suit case much easier.",
                "reviewText": "This is a set of lightweight fabric cases that are designed to isolate and contain associated items in your suitcase so you can find them easier later on.The set consists of 6 different size fabric organizers.3 look like small suitcases made from very light fabric. They all have handles and close with zippers. The sizes are: 11 3/4 x 8 1/2 x 4; 14 x 10 1/2 x 4 1/2; and 15 1/2 x 12 1/4 x 5. These flat rectangular cases are perfect for packing clothing: pants, skirts, dresses, shirts, undergarments etc. You could use all 3 in a big suitcase or select say any 2 for inclusion in a small suitcase.When you're packing you organize your clothes into these cases. Maybe dress outfits in one and more casual in another. Depending on the size and space available in the cases, maybe you also put under clothes with the casual dress. And use the smaller case for dress clothing and accessories. When you arrive at your destination, instead of having a suitcase where everything is mixed together, you can pull these organizers free and know what you have in your hand.The other 3 cases consist of a zippered pouch: 10\" x 7 1/2\". A draw string bag 14\" x 19 3/4\" and a shoe bag.The zippered pouch could be used for bathroom items, toothbrushes, floss, shampoos, make up and other supporting items.The drawstring bag would make a good laundry bag and the shoe bag is of course easy to understand.These are just some very simple examples that come to mind. The organizers help you pack so you know where things are when you arrive.Packing like this helps you keep track of what you are bringing and helps prevent mistakes.The cases are made from lightweight, thin very flexible material. The cases don’t have to be strong as they are protected by the outside suitcase. All 6 weigh a little less the 21 ounces. So, they take up no space and add very little weight you your suitcase.These organizers come in a variety of sizes. They can accept many different clothing items. It’s just a matter of folding the clothing so it fits. Of course, you still have the room around these cases once they are put into your baggage to stuff in other items like phone chargers, hair dryers, extra shoes and what have you. And none of this gets mixed up with the high priority items in the organizer case.These cases are a great idea that the work and don’t cost an arm and a leg. They will change the way you pack and make life easier once you arrive. I would recommend them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thinking In The Dark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVCHE7C5FCI4BEXYUPKK3HSQRDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUTP1KGDFJUAP?ASIN=B0CJ9QVG6L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Nicely made, great quality, and very useful",
                "reviewText": "It may be a bit deceptive to call this a “set of 6 packing cubes,” as they are not all cubes, however this set is really nice. I received the “dim gray” set. It’s almost a silvery color, and stands out against the black lining of my suitcase. The set is made of lightweight, high quality materials and it does not feel cheap at all. A plus is that they are water resistant and easy to clean. The handles are a soft, silky smooth, thick woven nylon. They seem very durable. The double zippers are easy to grip and the cubes open and close easily. They all fold up to conveniently fit in the smallest of the cubes. Part of each of the 3 main cubes is mesh, which lets clothing breathe. I would be careful packing clothing with items that could be caught on the mesh, and make sure to roll or fold them up with those parts on the interior of the fold.There is also a small zippered bag for cosmetics or other small items, a drawstring bag, which can be used for laundry or other items, and a shoe bag. I like that the drawstring bag has silver cord adjusters. The shoe bag expands sort of like a paper bag does and lays flat when folded. When expanded it measures approximately 6” x 9” x 6”. The shoe bag can easily fit a few pairs of flip flops or summer slippers, or a pair of everyday shoes, given that they are not too incredibly bulky. Of course how much you can fit really depends on the shoe and shoes size. It doesn’t even have to be used for shoes.These packing cubes could also be used in an overnight bag or a backpack or hospital bag, for camping, or to help store extra or seasonal clothing when not in use. Other uses may include storing washcloths or small towels, fabric for sewing projects, or a plethora of soft cat toys for your spoiled kitty! I really like them and I think they will stand up over time. If not, I will definitely come back to this review and make a remark. I’m giving them 5 stars for their quality, ease of use, visual appeal, and functionality. I hope this review can help you with a decision for your purchase.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AekawinAekawin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEM3GZZ5BMM6WVQI6LSYAV26NHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2F65NAQ1ES33L?ASIN=B0CJ9QVG6L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful packing cubes great for organizing stuff for travel",
                "reviewText": "I recently took a trip to Thailand for a month, and these packing cubes set has been very useful and helpful in packing and organizing all my clothes and other stuff. They were very lightweight and durable. The material that is used to make these are of excellent quality. I find it very easy to organize my shirts, shorts, tees, pants, underwear, and socks in different cubes and they made it very neat to pack the cubes into my luggage. The price is affordable, and I find them especially useful for traveling. Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Bh2cAGQpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81CSaMtUWGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Q06w7QWLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kyle Lord",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIB5AAP636WKQ33TH7TVLF5BEZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QA2LYBQ94PVC?ASIN=B0CJ9QVG6L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for space efficiency!!",
                "reviewText": "These packing cubes are fantastic! I purchased the 6 piece set in preparation for a 2 week vacation abroad! My clothes stayed organized throughout my trip rather than becoming a jumbled mess in my suitcase. I could quickly grab what I needed on travel days without unpacking everything.The fabric is lightweight yet durable and keeps contents neatly packed. The zippers glide smoothly and the handles make the cubes easy to transport. They are sturdy and well-made, fitting neatly into various travel bags. Cleaning them is a breeze, which adds to their overall convenience. The zippers held up well and didn't give me any trouble during my trips.I give these 5 stars! Highly recommend!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}