{
    "remaining_requests": 7852,
    "original_status": 301,
    "pc_status": 200,
    "url": "https://www.amazon.com/eBags-Packing-Cubes-3pc-Set/dp/B07DKXHQF4",
    "body": {
        "name": "eBags Classic Packing Cubes 3pc Set",
        "price": "$15.00",
        "originalPrice": "",
        "rawPrice": 15.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/eBags-Packing-Cubes-3pc-Set/dp/B07DKXHQF4",
        "soldBy": {
            "sellerID": "A1MPSLFC7L5AFK",
            "name": "eBags",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1MPSLFC7L5AFK&asin=B07FXQGG7T&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07DKXHQF4"
        ],
        "asinVariationValues": [
            {
                "asin": "B07FXQGG7T",
                "variationName": "Color",
                "variationValue": "Aquamarine",
                "price": "$15.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/416lYo1T0fL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0013KDS96",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$15.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41hQY6GlPwL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B005LXPSFS",
                "variationName": "Color",
                "variationValue": "Eggplant",
                "price": "$15.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Kqf9bvFTL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0BQ8L6Z6B",
                "variationName": "Color",
                "variationValue": "One Color",
                "price": "$15.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/51sGjpafhKL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B079YYJB9N",
                "variationName": "Color",
                "variationValue": "Titanium",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41efCh8sKhL._SX38_SY50_CR,0,0,38,50_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In stock",
        "couponInfo": "Apply 20% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/413KQ1scwxL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41bC 8LWtBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZNgQ5LttL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wXXQ4H 9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hcdYglLYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41K5mQWiZJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the eBags Store",
            "link": "https://www.amazon.com/stores/ebags/page/0DDBC5D3-87BF-44AF-960A-43D9CB7DE6ED?ref_=ast_bln"
        },
        "brand": "ebags",
        "merchantInfo": "eBags",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 2274,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$5.95 delivery March 4 - 5."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fabric type Techlite Diamond Nylon",
            "Origin Imported",
            "Country of Origin Mexico",
            "INCLUDES 3 VARIOUS PACKING CUBES: 1 Large (17.5\" x 12.75\" x 3.25\"), 1 Medium (13.75\" x 9.75\" x 3\"), 1 Small (11\" x 6.75\" x 3\")",
            "SUPERIOR QUALITY: Highest construction standards utilized, making it a customer-favorite, packing cube of choice. Includes premium self-healing zippers with corded pulls for a lifetime of opening and closing.",
            "DURABLE & CONVENIENT: Interior seams fully finished for durability and soft mesh tops won't damage delicate fabrics or dress clothes. Mesh allows for easy identification - no more digging around!",
            "STAY ORGANIZED: eBags travel packing cubes make the best possible use of valuable packing space and keep everything contained. No more wrinkled clothes and gain more room in your luggage.",
            "LIMITED LIFETIME WARRANTY*: Protects against defects in materials and workmanship. eBags products are made with high quality materials and forward-thinking design."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b?ie=UTF8&node=9479199011"
            },
            {
                "name": "Travel Accessories",
                "link": "https://www.amazon.com/Travel-Accessories/b?ie=UTF8&node=15743971"
            },
            {
                "name": "Packing Organizers",
                "link": "https://www.amazon.com/Packing-Organizers/b?ie=UTF8&node=15744041"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 17.5 x 12.75 x 3.25 inches; 12 Ounces"
            },
            {
                "name": "Department ‏",
                "value": "‎ unisex-adult"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 13, 2006"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ ebags"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07DKXHQF4"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#203,105 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #324 in Travel Packing Organizers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 2,274 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Classic 3 piece Classic 4 piece Light 5 piece Large 1x 1x 2x Medium 1x 1x 1x Small 1x 1x 2x Slim - 1x",
                "media_link": []
            },
            {
                "media_text": "Lots of sizes for all your travel needs!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/16975006-d910-4408-80c0-06b11c84fb99.__CR0,464,1500,464_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b3823d9-1c7a-4490-894a-5c2f91c1765a.__CR0,0,600,180_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5118d439-c9ff-4f23-a1a2-33b433f6471e.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f01cb585-2998-472e-9a09-a9e1ad9152fd.__CR500,0,1000,2000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8feeddef-bbe6-4a41-ad97-525eaf7fc54b.__CR500,0,1000,2000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b820e02-1000-475c-ba29-1e98b9d99598.__CR500,0,1000,2000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/16975006-d910-4408-80c0-06b11c84fb99.__CR0,464,1500,464_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MightyDwighty",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESDWCQZZYQ6JRLBNKQGMAKIVMLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36OZE5C0IIGQZ?ASIN=B07FXQGG7T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2015",
                "reviewTitle": "5.0 out of 5 stars eBags vs Shacke Pak! Quality construction, Great design, EXCELLENT ZIPPER...made me a BELIEVER in PACKING CUBES!!",
                "reviewText": "Pros:- Quality build- Excellent zipper quality and durability- Strong seams- Lightweight- Open netting design allows for visibility of contents and easy compression- Attractive but simple colors and design- Comfortable zipper pulls- Excellent customer serviceCons:- None at this time, but there are strong competitors now that offer similar packages at potentially more competitive pricesPersonal Experience:Ask me a year ago whether I would ever have packing cubes and I would have scoffed at you and declared that it was illogical to try to save packing space by using packing cubes that forced the cube shape. Now...I'm a believer!!Packing cubes have changed the way I packed forever. Not only does it organize everything I pack (underwear, socks, pajamas go in one; shirts and pants go in another, etc), it allows me to pack 2-3 times more than I used to be able to because you are able to squeeze everything into a packing cube and then zip it up. Packing cubes don't add any appreciable weight to your luggage because they are so lightweight anyway. And for longer trips, I simply take out my packing cubes from my duffel bag/suitcase and they serve as drawers for all my travel items.In terms of eBags specifically, I referenced in my \"Pros\" why I think eBags is generally superior to other brands. In addition, I have used eBags' other products (lunch box, etc) and have had wonderful experiences with their customer service. That is definitely one thing to consider when purchasing packing cubes from competitors that have less reputable names–they may also make quality packing cubes, but if something goes wrong a few years down the line, will they take care of you as well as a more established and reputable company like eBags?**Update: I also own two sets of Shacke Pak packing cubes (you can read my other reviews) and have had the opportunity to compare them directly to eBags. In all honesty, both brands make exceptional packing cubes and you really wouldn't be disappointed either way. But to be nit picky, I will share a few of my observations:- Shacke Pak uses a material with a matte finish compared to the more shiny honeycomb design of eBags. The Shacke Pak material stretches ever so slightly, whereas the eBags material has very little give. As a result, it appears that the material eBags uses is slightly more durable, but Shacke Pak looks slightly more premium.- Shacke Pak uses hidden stitching beneath the zippers, whereas eBags uses a double stitched design in most places. After owning the Shacke Pak packing cubes for about a year, I am noticing that the hidden stitching under the zipper pulls a little more and actually becomes visible when I pack the cubes tightly. This concerns me slightly and makes me question the long term durability whereas eBags' double stitched design seems to hold strong regardless of how tightly I pack the cubes.- The depth of Shacke Pak packing cubes is .75\" to 1\" more, so you can pack more.- The zipper pull handle (not the zipper itself) on one of my packing cubes from Shacke Pak fell off after one month. I contacted Shacke Pak and they immediately sent me an entire new packing cube. Shacke Pak demonstrated excellent customer service, but at the same time I am a little concerned that something like that happened so quickly in the first place. Since then, I have had no issues with my two sets of packing cubes from Shacke Pak. I have had no issues with eBags in terms of the zippers or zipper handles in the 6 months that I have owned them.- Shacke Pak packing cubes gives you 4 for the price of approximately 3 from eBags. Also, Shacke Pak includes a pouch with the packing cubes that can be conveniently used as a dirty laundry bag when you're travelling. You seem to get a little more for your money with Shacke Pak.- Zipper quality for both is excellent, as they both use YKK zippers.- Overall: You can't go wrong with either and each brand has slight advantages over the other in a few areas. I personally think eBags is slightly more durable, but that Shacke Pak is slightly more attractive and gives you a little more for your money.Conclusion:If you want a well priced, high quality, attractively designed, and backed by a reputable company with outstanding warranty set of packing cubes, the eBags packing cubes are definitely for you.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CJ Navan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFEZA7DJ27HGSBSKVZ62B5LGKHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYKITQ8UL87HN?ASIN=B07FXQGG7T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2015",
                "reviewTitle": "5.0 out of 5 stars Excellent Luggage Accessory - Wouldn't Leave Home Without Them Anymore",
                "reviewText": "I travel frequently for work and pleasure, so I've spent years packing and unpacking luggage; I like to pack some extra articles of clothing to account for the unexpected (e.g. travel delays due to inclement weather) and want to keep clean and dirty clothes separated on the return trip; I've also seen what happens on luggage carousels when someone's luggage has been damaged and everything spills out everywhere (thankfully not mine, but still ...). I love organization, convenience and minimizing unnecessary laundering, so these packing cubers are perfect for me.Advantages:- Easier to organize clothing by type (e.g. underwear/socks/lingerie in smaller bag, tops in medium bag, slacks and sweaters in larger bag)- Easier to pack luggage since cubes fit nicely and can be stacked in ways that allow sufficient room for toiletry bags, shoes and other items- Easier to keep clothes wrinkle-free; shifting of luggage content does not affect clothing contained in the packing cubes- Easier to find articles of clothing while staying at a hotel; no need to dig through the entire suitcase--everything is organized very neatly and the mesh in the cover makes it easy to see what's in a particular packing cube- Separation of clean and dirty laundry is a snap with these containers (I always have some clean laundry)- I use the zippers to indicate whether the cube is \"ready to go\", or still missing a few articles; I never forget anything I meant to take with me- Packing cubes independently makes it easier for me to keep the cats (and their hair) out of my luggage (I have four and they LOVE getting into the suitcase when I'm packing)I would highly recommend these packing cubes to anyone who travels frequently, or anyone who loves organization. When I first saw these, I thought they were silly and a waste of money, but I decided to try them just because they might have potential. I'm so glad I did--I wouldn't want to travel without them anymore.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ActiasLunaSeesItThisWay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYC76VU5RAC2M7DHEVPNTCD7V4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIQY85QIMQJ82?ASIN=B07FXQGG7T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2014",
                "reviewTitle": "5.0 out of 5 stars Genius solution for organized packing - saved my sanity on a recent trip.",
                "reviewText": "As advertised these packing cubes simplify the process of packing. I used them on a recent trip to organize clothing and toiletries, and they kept my suitcase from being a jumbled mess. Things that were neatly folded stayed that way, and the compression that you can achieve by folding or rolling and stuffing these full actually did keep my clothes mostly wrinkle-free throughout the trip. The mesh sides allow you to easily recognize what's inside.If you pack these intelligently (by clothing, accessory, or item type - for example I put my toiletries and electronic accessories in the smallest one along with some travel documents, socks and underwear in the medium sized one, and shirts in the largest one) you will find that you can travel light and find everything very quickly. They stack in many different configurations and should fit just about any suitcase, so you can snug them in so that they protect other items (shoes, cameras, etc.) at the same time they keep your things organized. I intend to get another set of these as they really made packing much easier, and travel seems less of a hassle when you can find things quickly and easily because you know what's in each cube.These also speed up luggage inspection as inspectors can pull these modules out and examine them and replace them. I noticed that my things did not get scrambled up by TSA like they have in the past and I can't help but think that is because these cubes made their jobs easier as well.When not in use, these fold flat and take up very little room. They are very light and well-made, with good zippers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philippe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 26, 2018",
                "reviewTitle": "Très pratique",
                "reviewText": "Très pratique pour bien ranger et compartimenter ses affaires dans la valise. Permet aussi de mieux défaire sa valise. Produit robuste de bonne qualité.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 30, 2016",
                "reviewTitle": "Klasse!",
                "reviewText": "Ich habe keine Erfahrung mit anderen Packwürfeln, darum beruht dieser Bericht lediglich auf den Eindrücken, welche die eBags auf mich machten. Die Packwürfel sind aus einem leichten, wasserfesten und teilweise luft- und blickdurchlässigen Material, die Reißverschlüsse wirken sehr stabil und allgemein vertragen die Würfel so einiges. Man kann stopfen wie man möchte: die Packwürfel halten! Das hat mich restlos überzeugt.Noch ein kleiner Tipp neben der uneingeschränkten Kaufempfehlung: Messen Sie vorab Ihren Koffer aus! Ich nutze einen 40 Liter Backpack und kann eigentlich nur die beiden kleineren Packwürfel nutzen. Der Große ist demnach überflüssig und ich wünschte, ich hätte eine andere Kombination gekauft. Das ist sehr schade!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ShirleyVal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 31, 2014",
                "reviewTitle": "Excellent for touring hols or backpacking!",
                "reviewText": "Wish these had been around 30 years ago! Bought them for my son to go backpacking round Asia....and he is delighted with them. They are actually bigger than they look here so a tip would be to measure out which sets would be more useful to you. I bought him this set (and kept the large one for myself) and a set of 3 small too. The large size would easily fit trousers, skirts, tops, cardies etc but is too big really for a rucksack....lovely for a case. The middle one fitted about 10 t.shirts (folded of course) and the small one is good for underwear, socks, leads and chargers etc. keeps everything in it's place.....and you don't have to take everything out of the case/rucksack every time. After 2 months constant use my son says they are holding up well!! Just need to buy some for myself now!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ragamuffin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 21, 2014",
                "reviewTitle": "Great Cubes - Here is recomendation on best sizes of cubes for hand luggage from a 10-year frequent flyer.",
                "reviewText": "I travel by air a lot. I mean a lot! A couple of flights a week on average with hand luggage only. Packing for 5 days at a time, I have to pack efficiently and cubes are the way to go. I've used them for years. These eBags cubes are fantastic quality and come in a good range of sizes. But.... which sizes to buy? Below I pass-on my hard-earned experience over 10 years of frequent flying.The luggage I am basing my recommendations-on are standard cabin size roll-on bags of 55cm the size typically allowed as hand luggage by almost all airlines. I use a Samsonite B-Lite 55cm x 38cm x 20cm 2-wheel roll-on bag (in my opinion the best size/weight/quality combination for hand luggage - 4 wheel bags have less internal space, every inch counts, hard cases weigh more). I'm a man so my recommendations are based on men's clothes.....LARGE eBags Cube - Fit my bag perfectly I just can't find a use for them.In reality I think the large cube is OK for dresses / larger items of clothing. As a man I have little use for this so don't use the large bag though It fits perfectly in the 55cm suitcase its dimensions are the same as the internal dimensions of the bag. I don't recommend the large size unless you are packing large flat items. If this size works for you, you could fit maybe three or four of these on top of each other in a hand-luggage case - though it would be full at this point.MEDIUM bag - the perfect bag for clothes / shirts / t-shirts etc.I can fold 5 (17inch collar) shirts into the medium cube - they are a perfect fit. The cubes length is the same as the width of my case, I can pack a second medium cube with casual-wear for a week a few t-shirts/and a pair of jeans. This is a fantastic size for normal clothing. Two of these fit perfectly on-top of each other in my roll-on bag filling just over half the bag.SMALL bag - perfect for a week's worth of smallsA week's worth of socks/underwear fit into one of these. I use a second to hold electrical/work items. The two small bags now fill 3/4 of the remaining space in my case, leaving just enough room for a separate, clear liquids/toiletries bag of the regulation size.In SUMMARY - Cubes needed for a standard roll-one hand-luggage bag.2 x Medium - for clothes2 x Small - for socks/underwear / electrical/other itemsLeaves enough room for a toiletry bag and to fold a jacket on-tip before closing your bag and heading for the airport.This means to get the perfect hand-luggage arrangement you either need to buy 2 of these eBags 3 piece sets (and discard the large bag), or a pack of medium and a pack of small which would give you a spare bag of each size. (which is what I ended-up doing).PS - Your Laptop. You can take this in a separate laptop bag to free-up space in your case. Buy the type that easily slide onto the handles of your roll-on bag (Better ones have loops/tubes for this) - then you don't have to carry it - it just sits on your bag - you can't lose it or drop it. ( I use a Samsonite network 2 bag as it is little-more than a sleeve with handles so is small and light-weight and never gets refused by airlines as too big)PS shoes - wear them don't carry them.Hope this helps!",
                "reviewVotes": "262 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen E.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 31, 2021",
                "reviewTitle": "Für mich perfekt",
                "reviewText": "Selbst im Alltag nutze ich diese Bags z. B. für die Mitnahme meiner Fahrradregenbekleidung, Wechselwäsche im Garten etc. Robust, praktisch, gut zu greifen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}