{
    "remaining_requests": 7821,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Durable-Compression-Packing-Cubes-Travel/dp/B0CL4T82BL",
    "body": {
        "name": "Durable Compression Packing Cubes for Travel - Compressible Travel Packing Cubes for Suitcase Luggage Organizer Bags with Shoe Bag Travel Accessories",
        "price": "$21.99",
        "originalPrice": "",
        "rawPrice": 21.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Durable-Compression-Packing-Cubes-Travel/dp/B0CL4T82BL",
        "soldBy": {
            "sellerID": "A13LS0L6OR9KE",
            "name": "Hengsen Online",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A13LS0L6OR9KE&asin=B0CL4T82BL&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 8% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41o0Zxjk43L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51F012UnChL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HbFwFuzdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416OMODryLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51n8jB-ZN3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FvXN-IXsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81rZetWfQlL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dcc07ab9-d592-40c6-8884-c03ce7f5c054/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the EuroBird Store",
            "link": "https://www.amazon.com/stores/EuroBird/page/D8A66D7A-4859-40B6-B6D4-7E47B88EC5D3?ref_=ast_bln"
        },
        "brand": "EuroBird",
        "merchantInfo": "Hengsen Online",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 28,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 6 hrs 12 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Save 55% of Space - As the blockbuster product, our compression packing cubes for travel keep your luggage organized, and also have the ability to expand and compress as it is needed. Just close the extra red zipper to compress, you can experience up to maximize the luggage space by 55%(unlike vacuum bags)! Pack the mementos without extra bulky! Truly use space more efficiently! 100% REFUND IF YOU ARE NOT SATISFIED, you can try with no risk!",
            "Built to Last - Made of light, soft and ripstop fabric with waterproof coating, double stitched with reinforced seams to make sure these compression packing cubes for travel can always hold up to the pressure, tear-resistance and last longer. Reinforced thickened zipper and extension rope always slide easily and smoothly.",
            "Organizer for Hassle-Free Access - Set of 4 different sizes packing cubes compression and 1 shoes bag, you can easily segregate different kinds of clothes, such as jackets, pants, t-shirts, etc. Each cubes has a interior pocket to separate small items in the top. Such as data cables, chargers, cosmetics, underwear, socks, etc. Everything has their dedicated space, well-prepared and organized, so you can find things the first time.",
            "Practical Design Details - Improved 180° large opening zipper closure makes it much easier to pack and access. The tag holder attached to each compression bags for identifying items quickly while also ensuring the privacy. Sturdy handle to provide heavyweight support, easier to lift or move it.",
            "Great After-Sales Service - Eurobird compression packing cubes for suitcase are the must have for travel, vacations, business trips, camping, etc, but also ideal for home storage, they are definitely worth your money. And we promise 100% refund if not satisfied, we are always here to provide great after-sales service, so you can try it without risk."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b?ie=UTF8&node=9479199011"
            },
            {
                "name": "Travel Accessories",
                "link": "https://www.amazon.com/Travel-Accessories/b?ie=UTF8&node=15743971"
            },
            {
                "name": "Packing Organizers",
                "link": "https://www.amazon.com/Packing-Organizers/b?ie=UTF8&node=15744041"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 12.5 x 9 x 1.9 inches; 1.32 Pounds"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 16, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ EuroBird"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CL4T82BL"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#391,425 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #560 in Travel Packing Organizers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 28 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "A great ideal for packing more efficiently when traveling.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4247fb06-7a30-4559-9e85-f4fb040d2d27.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Packing Cubes Compression for Suitcase",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9c8a364-bdc5-4b47-9f5c-0e55a606cf75.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Are you still looking for durable packing cubes for travel? we will provide you with the best economic and practical choice. Each set has 4 different size (S/M/L/XL) compression packing cubes with interior pocket and 1 shoes bag, which can keep suitcase more organized, and you can find what you want the first time. 1. Nylon with a diamond pattern that lends an elegant touch. 2. soft, waterproof and ripstop fabric, reinforced double stitched, combined with the premium extending zipper always slide smooth, ensure longer service life. 3. No any see-through mesh, so the contents are more protected, and with the tag holders attached to each cube, sorting and identifying your items also much easier. 4. Improved large opening makes it much easier to pack and access. 5. Each cubes has a interior pocket to separate small items in the top. Such as data cables, chargers, cosmetics, underwear, socks, etc.",
                "media_link": []
            },
            {
                "media_text": "The Most Powerful Compression Function The different color zippers are not just for looks. The yellow one is to close/open the bag and the red is compression. Experience up to maximize the luggage space by 55%(unlike vacuum bags)! PACK MORE WITHOUT EXTRA BULKY! Such as mementos!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6d06f2a1-9d0a-4c6b-a243-7225089292a0.__CR0,0,800,600_PT0_SX800_V1___.jpg"
                ]
            },
            {
                "media_text": "These packing cubes compression will let you pack and travel easily.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/085d4315-badd-44fb-a62e-58273ae51a50.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "For the best compression, fill bag up to 3/4 volume with clothes.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36e989cb-22f2-4fec-96ee-fa14582218dd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Versatile Uses of Compression Packing Cubes",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa4b99d8-7959-4f2b-95b0-5460d8948874.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4247fb06-7a30-4559-9e85-f4fb040d2d27.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9c8a364-bdc5-4b47-9f5c-0e55a606cf75.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6d06f2a1-9d0a-4c6b-a243-7225089292a0.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/085d4315-badd-44fb-a62e-58273ae51a50.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36e989cb-22f2-4fec-96ee-fa14582218dd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa4b99d8-7959-4f2b-95b0-5460d8948874.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sugarquill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY4RB3PHP7V2RURASZ6NLPZCIEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KQW49PMDPEN8?ASIN=B0CL4T82BL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Reasonably sturdy",
                "reviewText": "These travel compression packing bags feel pretty solidly made to me. The zippers zip smoothly, and my only complaint about the zippers is that both the ones to open and close the bags and the ones to expand it are the same color visually. The expansion zip track is lined with red (vs the yellow for opening and closing), but when you're reaching for a zipper it'd be nice to be able to ID which one you actually need without peering too closely.Luckily, that's an easy fix - the zipper leads are basic little cables that are loop-cinched and can be easily removed and changed with something else.They arrive all nestled Russian doll style inside the medium sized bag. I liked being shown how to store these when not in active use this way. (It's not obvious to new travelers, we all were new once to both packing for vacation and storing stuff between trips.)The little clear vinyl pockets for labeling what is in what are easy to access and don't flop around too much. I'm not sure how useful they are to me personally, as I tend to cram my stuff wherever there's space, rather than by outfit or item-type. Guess I could use them to list the contents: for example, pajamas, 3 pairs of socks, 4 t shirts, and a toothbrush lol.The large comes corded with the sort of cord you'd find on a drawstring backpack, complete with the little press button doohickeys that let you adjust the length. This is utterly useless to me as I can't stand the feel of cords on my shoulders, but I know there are plenty out there who would find this super useful as a built-in daybag for sight seeing.Problem for the rest of us is they can't be removed without cutting the cord, and they kind of get in the way when packing. This is somewhat less an issue when the bag is full and you've placed it where you intend to keep it for the time being, but when moving it around to fill up or put in the suitcase it's *really* annoying and catches on things.I've had other travel cubes over the years but these seem like a good bargain at about $20 for the set - but I've never had high end ones so I don't know if there's some level of quality I'm missing out on. These are better than some of the ones I've bought in the past, so I'm content.My one complaint applies to all such travel kits - there's nothing specifically made to pack bras. As it is, I pack them flat with socks and random clothing to support the cups so they're not ruined during travel, but in an otherwise neat suitcase, the orphaned make-do stack of bras never fails to irk me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Pritchett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIW2R34GWJQGOSAJPPZMXB7YHWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36NWCC4YPUBDU?ASIN=B0CL4T82BL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars These made us believers!",
                "reviewText": "We were a bit skeptical of these, but got them since we had a cruise vacation coming up. My wife packed everything she needed for a week in one carryon bag using these things! We were both pretty amazed. She would lay one on the bed, then roll up clothes and stuff them in so they were overflowing the top. Then she'd zip the first zipper, which somewhat compressed them, but not fully. Then we'd smash it down even more and force the second zipper to close, which would compress the contents even further. Then she had these nice compressed bags to drop into the carryon bag. Without a doubt these allowed her to carry MUCH more than she otherwise would have been able to fit in the suitcase.They are very strong and the zippers worked very well. We now just keep them in our suitcases so any time we go on a trip, they will be there when we pack.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HealthVitality",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJN7RUODJRF7UFQV3DXT6TB6AWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VEIJXSENU187?ASIN=B0CL4T82BL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Material is flexible and forgiving. Zippers are solid. Worked OK.",
                "reviewText": "Wish there were some way to see inside, but at least it had a tag attached with a clear insert to let you know what is inside each separate bag. There are 2 zippers. One to close the top of the bag. The second zipper, to reduce the size of the pack.They aren't like some of the compression devices I've used before. They are professionally done so would be a nice gift for the traveler in your life.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Netochka Nezvanova",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWF7KNP5V2MEL2DAB6YRPW4QNRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R337U3AVMV2JAG?ASIN=B0CL4T82BL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice Variety; Lightweight; Clever Details",
                "reviewText": "The media could not be loaded. In my video review, I compare these EuroBird packing cubes to premium packing cubes that cost twice as much. Surprisingly, this set of packing cubes come up on top in several ways:1. Weight — they're much lighter weight. These are the ones I will be reaching for if I'm concerned about airline baggage weight limitations.2. Design details — I like that the zippers are color coordinated, so you know which one opens the cube and which one is for compression. Small detail but it's a nice convenience to have. I like also that each back has a handle.3. Variety — Compared to the premium packing cubes, this set wins in terms of variety / multi-functionality. I like that a shoe bag is included, and that one of the packing cubes doubles as a backpack, and I can see myself using it as a bag to carry laundry or gym gear in while I'm traveling, saving myself the hassle of packing an extra bag for that.Overall, these packing cubes work well and I'd recommend them!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0a5e43ff-1123-45e5-99d1-8d90bfb6f311/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "JosephJoseph",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF46XZV25FPJ56V3FIGR422IZY3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18WTIN3QDAF2E?ASIN=B0CL4T82BL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice set with shoe bag, compression gaskets, and label slots",
                "reviewText": "My wife got a set of packing “cubes” recently. I liked the idea and wanted to try some. This set has some advantages over hers. These are all expandable and have a holder for luggage tags (aside from the one for shoes, which her set doesn’t include). Also, one of these has cords so that it may be used as a daypack. The one thing I like better about her set is that they have mesh windows so that you can see what’s inside. These are opaque. Now that I’m thinking about it, maybe the slots I thought were for luggage tags could be used to label what’s inside each bag. I think I’ll try that.I did a test run, planning for a 5 day trip. In the smallest cube I packed 5 pairs of socks and underwear. In the largest container: 2 pairs of slacks, jeans, and PJ pants. Next size down: 5 long sleeve shirts. Shoe container: hiking boots (I was impressed that they fit). I was left with one medium size, so I put a jacket in it, but it could be for toiletries or any miscellaneous electronics, etc. I could have fit more, but this is the length of trip I’m most likely to take, and I wanted to try compressing them. I was able to close all the gaskets with the red zippers. Then, I put everything in my overhead-size hiking backpack. It was a little tight, but they all fit. The exterior pockets of my bag were empty, so I could have carried a bit more. For what it’s worth, the cubes with these clothes weighed 14.4 lbs (not counting the backpack itself).The cubes were easy to empty and compress back down to one bag. I really like this set and recommend it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81H-MvvlLtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81OSWfkDBIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81XC3+Ys5HL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81bzAY3talL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81vFFRQTsfL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Smile",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3HOPWDRHKBYNXNOTGA5ZQFJQZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCA9GHKJS9L58?ASIN=B0CL4T82BL",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "3.0 out of 5 stars It compresses but not like a vac seal",
                "reviewText": "I like that it flattens the clothes. What I was wanting was that it would flatten like a vac seal. This works better with soft material like sweaters. It also helps organize my clothes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}