{
    "remaining_requests": 7905,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Eagle-Creek-Specter-Compression-Strobe/dp/B00BYFC4Z4",
    "body": {
        "name": "Eagle Creek Pack-It Specter Compression Packing Cubes S/M - Durable, Ultra-Lightweight and Water-Resistant Ripstop Fabric Suitcase Organizer Bags for Clothing and Gear, White/Strobe",
        "price": "$39.95",
        "originalPrice": "",
        "rawPrice": 39.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Eagle-Creek-Specter-Compression-Strobe/dp/B00BYFC4Z4",
        "soldBy": {
            "sellerID": "A7ULJO7NAWM0L",
            "name": "OutdoorEquipped",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A7ULJO7NAWM0L&asin=B00BYFC4Z4&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C3MXBYG3"
        ],
        "asinVariationValues": [
            {
                "asin": "B00OY893YI",
                "variationName": "Color",
                "variationValue": "Brilliant Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31phc6S+INL._SS36_.jpg"
            },
            {
                "asin": "B00BYFC4Z4",
                "variationName": "Color",
                "variationValue": "White/Strobe",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21Whl+EkPuL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/313VBHXqT8L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51mgihdJEWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ihGFe1GrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mD5Dp4RUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JiDSK5riL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41p33f4f TL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MpIrjbTEL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the eagle creek Store",
            "link": "https://www.amazon.com/stores/EagleCreek/page/E459D150-D953-425D-9015-88ED3F06BC92?ref_=ast_bln"
        },
        "brand": "EagleCreek",
        "merchantInfo": "OutdoorEquipped",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 889,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Sunday, February 18. Order within 6 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Silnylon Ripstop",
            "Imported",
            "SET INCLUDES two compression packing cubes for suitcases–all made with tough, lightweight silnylon ripstop material",
            "WATER-RESISTANT to protect all your travel essentials from the elements and from each other if need be",
            "COMPRESSION ZIPPER lets you compress these travel cubes to free up more room (Pro-Tip: Rolling your clothes maximizes storage further and reduces wrinkles)",
            "FULL MACHINE WASHABLE travel packing organizers so they’re easy to clean, because you never know what’s going to happen on the road",
            "PEACE OF MIND as Eagle Creek covers all these packing cubes for travel with the No Matter What lifetime warranty"
        ],
        "description": "Pack-It Specter Compression Cube Set S/M - Traveling light is important. And knowing where your things are when you're on-the-move makes all the difference. Use ultra-light Pack-It Specter™ Compression Cubes to organize your clothes in your travel bag, while also providing clothing compression so that you can bring more with you. Bag Dimensions: (S) 10 x 7 x 1.25 in / 1.5 oz | (M) 14 x 10 x 1.25 in / 2 oz. WHY EAGLE CREEK? Eagle Creek is a global tribe of travelers committed to preserving and protecting the places we live, work, and travel. From community partnerships to sustainable materials and solutions designed to last a lifetime, we're on a mission to unlock new ways to positively impact the cultures, environments, and planet for future generations to discover. We've been around for more than 40 years and, from city parks to exotic destinations, we take pride in equipping you with versatile gear to take you beyond your fears and outside your comfort zone.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9479199011"
            },
            {
                "name": "Travel Accessories",
                "link": "https://www.amazon.com/Travel-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15743971"
            },
            {
                "name": "Packing Organizers",
                "link": "https://www.amazon.com/Packing-Organizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15744041"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "eagle creek"
            },
            {
                "name": "Material",
                "value": "Nylon"
            },
            {
                "name": "Color",
                "value": "White/Strobe"
            },
            {
                "name": "Product Dimensions",
                "value": "14\"L x 10\"W x 1.25\"H"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight, Durable, Water Resistant"
            },
            {
                "name": "Load Capacity",
                "value": "30 Pounds"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Clothing"
            },
            {
                "name": "Closure Type",
                "value": "Zipper"
            },
            {
                "name": "Shape",
                "value": "Cube"
            },
            {
                "name": "Number of Items",
                "value": "2"
            },
            {
                "name": "Size",
                "value": "‎Small/Medium"
            },
            {
                "name": "Number of Sets",
                "value": "‎2"
            },
            {
                "name": "Item Weight",
                "value": "‎1.5 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "‎Eagle Creek"
            },
            {
                "name": "Part Number",
                "value": "‎EC-41186002"
            },
            {
                "name": "Country of Origin",
                "value": "‎USA"
            },
            {
                "name": "Item model number",
                "value": "‎EC-41186002"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Style",
                "value": "‎Pack-it Specter Compression Cube Set"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Special Features",
                "value": "‎Lightweight, Durable, Water Resistant"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B00BYFC4Z4"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 889 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32,711 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #78 in Travel Packing Organizers"
            },
            {
                "name": "Date First Available",
                "value": "August 4, 2013"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Pack-It Specter Silnylon Ripstop Ultra-Light Water-Resistant Translucent Fold It. Roll It. Stash It. Pack-It. Easy to use, but hard to quit. Eagle Creek’s Pack-It System lets you maximize your packing space while protecting your clothes and peace of mind. Packing organizers In ultra-light fabric… What are you waiting for? Fold it. Use packing folders to get where you need to be, wrinkle-free and looking your best. For collared shirts, pants, and dresses. This packing organizer comes with a folding board to help you pack your things nice and crisp. Roll it. Maximize space and simplify packing with Pack-It Cubes. Use them to organize t-shirts, shorts, and undergarments. Once you arrive, slip them in your hotel drawers to keep your personal items clean. Stash it. Organize all the small stuff that tends to slip down and get lost at the bottom of your bag. From lip balm to aspirin to cords and receipts, there are truly a million-and-one uses for Specter Packing Sacs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4e32c9ac-2b32-4214-9545-7a3d1adb6768._SR285,285_.gif",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3e96368c-a570-4479-b3d9-8d3f85f79922._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "Fully Expanded Compressed",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cd5a042d-112c-42d9-a868-eb0aeab47c3f._SR300,300_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/74a63916-9251-47a6-a967-89b370c4cadf._SR300,300_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/9665423e-6ef0-468a-8686-a9be372cb7d5._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/6bfd7859-934a-4636-8e84-399e569cd45a._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4e32c9ac-2b32-4214-9545-7a3d1adb6768._SR285,285_.gif",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3e96368c-a570-4479-b3d9-8d3f85f79922._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cd5a042d-112c-42d9-a868-eb0aeab47c3f._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/74a63916-9251-47a6-a967-89b370c4cadf._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9665423e-6ef0-468a-8686-a9be372cb7d5._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "IneshInesh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLVESRXSODKDI5VZLJFE2NYH56A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DQ56YSVR6Z67?ASIN=B00BYFC4Z4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 14, 2019",
                "reviewTitle": "5.0 out of 5 stars BEST BUY EVER FOR TRAVELLING!",
                "reviewText": "One word: WOW!I rarely write product reviews these days, but oh, as a travel lover I need to tell all fellow travelers about compression cubes. They will change your world!! Read below my five reasons on why these Eagle Creek compression cubes are life changing!Let's admit it, we all buy a lot of items for our trips that we really did not need to spend money on, but these will probably be one of your best buys for travelling ever! I had read that a lot of travelers and backpackers swear by travel compression cubes. I now know why!! I am an avid traveler, travelling with either carry-ons or backpacks, depending on the trip, and believe me: once you try them, I doubt that you'll go back to travelling without cubes!These ones by Eagle Creek are flawless, in my opinion. I've never been so happy to find a product that solves so many problems and frustrations that us travelers have had at some point during our trips, with just one simple product!Hands down, these Eagle Creek compression cubes are MY BEST BUY AS FAR AS TRAVEL GOES.HERE ARE THE 5 REASONS:1 - THE SPACE SAVING IS INCREDIBLE!(See photos of before/after. Both photos are of the small cube)I couldn't believe it. Throughout the years, I have used several strategies to save space inside my bags, like rolling the clothes instead of folding them, or binding them with elastic bands to keep them together and compress them a little bit, but nothing works like these cubes in terms of space saving. I believe I am not exaggerating if I say that these cubes reduced the space by 50% or even 2/3!For you to have an idea of how much it might fit, I was able to fit my whole clothes for two-week trip to a tropical destination in these two cubes (one small and another one medium).In the small cube: I was able to fit, 5 tops and 1 dress (I believe it would fit one or two more tops)In the medium cube: I fit 2 sweaters, 1 blouse, 1 pair of shorts (I believe it would have fit 1 or 2 more long-sleeved shirts or blouses or 1 pair of jeans even)If it's your first time using compression cubes (or depending on different types of clothes you might need for your trip) it might take you a couple of tries to see what's the best folding type, how many items you can fit inside each bag, and in which position you should place them, but I think it just takes a couple of minutes to figure it out - I found it quick, easy and intuitive. Just be careful, patient and USE the old good COMMON SENSE :). The Eagle Creek compression cubes are really good quality, incluing the plastic which is thick and the zippers. But again, use common sense - the bags do fit a lot, but if you see that the bag is not closing even if you're squishing it hard, don't force the bag and zippers. Maybe you have placed too many items inside? Maybe they need to be folded differently? Maybe you need to remove one item or try to include another piece of clothing that's smaller? Again, common sense. That goes for the plastic as well. While you're closing the bag, you got to make sure the plastic is not getting stuck in the zippers, but again that carefulness goes for any bag!2 - YOUR CLOTHES WILL NOT BE DANCING AROUND THE BAG AND THEY WILL BE SUPER EASY TO ACCESS!The clothes will not be moving around inside the bag, and once you get to your destination it is super easy to access them. Because the Eagle Creek bags are translucent (despite that, again, the plastic is thick and feels super good quality), you can easily see what you've packed inside the bags (I've order the white ones and you can clearly see the colors and patterns of the clothes you put inside). No more roaming around the bag searching for clothes! I'm so happy!!3 - YOUR CLOTHES DON'T GET ALL WRINKLED LIKE WITH THOSE TRADITIONAL VACCUM BAGSIf you've used the vacuum compression bags, you know the items might be wrinkly after you \"de-vaccum\" the bags. I found that these compression cubes by Eagle Creek do compress a lot and save so much space, but not to the point of getting your clothes all wrinkled to the point that you feel you cannot use them in public unless there's some serious ironing.4 - THE BAGS ARE WATER REPELLENTThis is a great added bonus in my opinion! I just never gave too much attention to the fact that the liquids I'm carrying in my clear liquids' bag might actually spill and get out of the bag itself, and have some of my clothes ruined. Something sometimes we don't think about until it happens. In case you have the bad luck of that happening to you, I am happy to think that my clothes might be a little bit more protected given that the bags are water repellent (not waterproof. A lot of people confuse waterproof with water-repellent. But still, much better to have this extra layer of protection, than the clothes just being there hanging around your bag completely unprotected).5 - THE BAGS ARE WASHABLETreated with love and care, they will last you for many trips, or even a lifetime.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71JGScSCGuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71KQ3ebA20L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oldster",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4XQ3ANJ3DJOYSJQPBXMVBEII6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZU822O0D08KQ?ASIN=B00BYFC4Z4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect for traveling.",
                "reviewText": "I love the Eagle Creek Compression bags. My suitcase is organized and I don't have to pull all the bags out all the time. Perfect for traveling. You don't have to pack a separate laundry bag, as you can use these for dirty clothes, too. Just wash the bag along with the dirty clothes.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robin O'Brien",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECPPYYXSCAPNWT6TRYSYU7CI6WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18QWAYYI9KPKS?ASIN=B00BYFC4Z4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Would buy again",
                "reviewText": "These worked great on recent Europe trip using only carry on luggage. I would definitely purchase more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEDYCMCIZGRCQJEPTTFXP46ZWGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ9V17QT8I50W?ASIN=B00BYFC4Z4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Favorite lightweight packing cubes",
                "reviewText": "I love these cubes. You should know they are very lightweight and flimsy which is why I love them but you won't if you are looking for something very structured. I like that they add to extra weight and are \"squishable\" That being said they are super durable and in the many years I've been using them for 4-6 trips a year, not a single one has frayed or split or had a broken zipper.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carolyn A stevenson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4MWYMRNW66NHWOCKUEL4Y5SLTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39AEJIWA61OUB?ASIN=B00BYFC4Z4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "5.0 out of 5 stars space saver",
                "reviewText": "i used in my suitcase. it pack a larger amt than i thought. i regret not initially ordering large ones as well, when i ordered these. instead i later ordered the non- compression large cubes by mistake",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF37T76RNFDAJHK3LEXZVTPXKCZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AD08WMSZBYLU?ASIN=B00BYFC4Z4",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2021",
                "reviewTitle": "3.0 out of 5 stars I don’t get the race",
                "reviewText": "I managed to pack a decent amount of clothes into these cubes. The quality is really nice and the compression is great but I had a few problems with the zipper getting stuck and this is without the pack being fully loaded.I just don’t understand the rave about these packing cubes. To me they actually take up more room than just laying my clothes flat. I guess they are somewhat useful if you are packing your clothes into a smaller backpack or some thing around that size but it makes no sense to use these packing cubes in any kind of carry-on luggage, duffel bag or standard check in luggage. I save way, way more room by just laying my clothes flat.If it wasn’t for the sticker getting jammed for no reason I may have kept them but there are other options out there. I think this brand is a little overpriced.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matt Collins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNCPPNNCQZBKRMBTQWVMZCII6AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJUURT95G78JG?ASIN=B00BYFC4Z4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2016",
                "reviewTitle": "4.0 out of 5 stars Almost perfect \"cube\"",
                "reviewText": "These are awesome. Almost perfect actually.Pros:LightweightWell made (they might seem cheap at first, because they are super thin, but once you use them you will see that they are well made)Good size for carry on luggageThey have \"compression\" (its a zipper, not vaccumn, so it won't shrink a lot, but definitely helpful for saving space)ConsPriceThey only unzip about halfway, so its more of a bag than a packing cube.Despite the two drawbacks I purchased a second set after once use.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nola  sox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2SZAEV375IFTJ4Y52AMF4NXUFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O2LGB8RCES2A?ASIN=B00BYFC4Z4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Best packing cubes",
                "reviewText": "I have no idea why Eagle Creek stopped making this model, but these are the best packing cubes. I've traveled all over the world with all types of gear and the only thing that comes with me on every single trip are these packing cubes. They are light weight, can compress your clothing down, and can act as dirty laundry holders as trips progress. Essential packing gear.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Huffman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 22, 2021",
                "reviewTitle": "As advertised",
                "reviewText": "Put three pair of pants in the larger bag and couldn't believe how little space they took up after compression. These bags are expensive but well designed and sturdy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dieter B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 11, 2024",
                "reviewTitle": "Meine Erfahrung: Bestnote",
                "reviewText": "Hatte mir im September unterschiedliche bestellt. Die hier sind von der praktischeren und robusteren Sorte.Grüße, Dieter",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Irene",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 2, 2021",
                "reviewTitle": "Excelente",
                "reviewText": "Perfecto para empacar y aprovechar mejor el espacio.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "aR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 22, 2018",
                "reviewTitle": "Travel organised!",
                "reviewText": "Must have for frequent travelers. This comes with compression n can avoid vaccum Cleaners to suck the air out. Super light weight!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annanon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 15, 2023",
                "reviewTitle": "Sehr praktisch",
                "reviewText": "Ich habe die Packtaschen für Wanderungen und Reisen in Verwendung und finde, dass sie wirklich gut komprimieren. Die Beständigkeit der Reißverschlüsse und des Obermaterials kann ich bislang nur positiv bewerten, hoffentlich bleibt alles so.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$39.95",
                "sellerName": "OutdoorEquipped",
                "sellerRating": "5"
            }
        ]
    }
}