{
    "remaining_requests": 7749,
    "original_status": 301,
    "pc_status": 200,
    "url": "https://www.amazon.com/eBags-Packing-Cubes-Travel-Aquamarine/dp/B016CIVHEG",
    "body": {
        "name": "eBags Classic 4 Piece Packing Cube Set",
        "price": "1 option from$20.00",
        "originalPrice": "",
        "rawPrice": 1,
        "currency": "option",
        "canonicalUrl": "https://www.amazon.com/eBags-Packing-Cubes-Travel-Aquamarine/dp/B016CIVHEG",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B08F3RFM24"
        ],
        "asinVariationValues": [
            {
                "asin": "B016CIVHEG",
                "variationName": "Color",
                "variationValue": "Aquamarine",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41oZdYbjE8L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B016CIVJ26",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$20.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Bxj4et0nL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B016CIVHYQ",
                "variationName": "Color",
                "variationValue": "Titanium",
                "price": "$20.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/4170+Mo5f1L._SX38_SY50_CR,0,0,38,50_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41AGoiUf2wL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41bC 8LWtBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512 iJd1xlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wXXQ4H 9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZNgQ5LttL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61zByhfUSEL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/baef4d72-97a0-4125-8453-2f3e8c80c1f2/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the eBags Store",
            "link": "https://www.amazon.com/stores/ebags/page/0DDBC5D3-87BF-44AF-960A-43D9CB7DE6ED?ref_=ast_bln"
        },
        "brand": "ebags",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 174,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fabric type THE ORIGINAL packing cube set",
            "Origin Imported",
            "INCLUDES 4 PACKING CUBES: Large (17.5\" x 12.75\" x 3.25\"), Medium (13.75\" x 9.75\" x 3\"), Small (11\" x 6.75\" x 3\"), Slim (14\" x 5\" x 2.75\")",
            "SUPERIOR QUALITY: Made with breathable, Techlite Diamond Nylon, premium YKK zippers, and fabric-bound interior seams that prevent snags from occurring",
            "DURABLE & CONVENIENT: Interior seams fully finished for durability and soft mesh tops won't damage delicate fabrics or dress clothes. Mesh allows for easy identification - no more digging around!",
            "STAY ORGANIZED: eBags travel packing cubes make the best possible use of valuable packing space and keep everything contained. No more wrinkled clothes and gain more room in your luggage.",
            "LIFETIME GUARANTEE: Guaranteed for life under eBags Lifetime Warranty. eBags products are made with high quality materials and forward-thinking design."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b?ie=UTF8&node=9479199011"
            },
            {
                "name": "Travel Accessories",
                "link": "https://www.amazon.com/Travel-Accessories/b?ie=UTF8&node=15743971"
            },
            {
                "name": "Packing Organizers",
                "link": "https://www.amazon.com/Packing-Organizers/b?ie=UTF8&node=15744041"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 17.5 x 12.75 x 3.25 inches; 1 Pounds"
            },
            {
                "name": "Department ‏",
                "value": "‎ unisex-adult"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 21, 2022"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ ebags"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B08F3RFM24"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#446,825 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #619 in Travel Packing Organizers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 174 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Pack like a neat freak. Even if you aren’t one. Once you’ve experienced eBags Packing Cubes, you’ll wonder how you ever traveled without them. Not only do they keep everything contained in your luggage but they maximize valuable packing space. And you’ll appreciate them immensely if ever randomly selected for TSA inspection – best to keep your unmentionables discreetly tucked into an eBags packing cube! Once you arrive at your destination they become drawers for your drawers – unpacking is a snap.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/40c60d92-3652-4145-a250-7d977b79d77f._SR300,300_.png"
                ]
            },
            {
                "media_text": "The Difference is in the Details Designed with premium YKK zippers, breathable nylon, fabric bound interior seams that ensure a snag-free inside that never frays & mesh tops to keep things breezy. There’s a cube for everything! Choose from 10 colors for yourself and your family - as soon as you open your suitcase, you'll know exactly whose is whose and what is where. Drawers for your Drawers eBags Packing Cubes are sized to fit perfectly in your luggage and hotel drawers. With so many size options, you’re sure to find the best fit.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/e4ffa1e2-cdd1-4601-9291-122fca96de66._SL300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/b63feb35-d5ef-4c48-9c79-fb6d5aca81d0._SL300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/6591896b-d838-4bb9-b36a-2ab084db75ec._SL300__.png"
                ]
            },
            {
                "media_text": "Guaranteed for Life. That’s a really long time. No matter what you pack into a product by eBags, you can be certain we put a lot of thought into it first. Like countless hours of design, quality materials, reinforced zippers, forward thinking, and customer suggestions. We compromise on nothing. So we can feel good about what we make, and you can feel good about what you buy. It’s why our products are guaranteed for life. And that’s a really long time.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/7fb756a6-71cf-401e-b677-f30bb0332a89._SR300,300_.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/40c60d92-3652-4145-a250-7d977b79d77f._SR300,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/mg/e4ffa1e2-cdd1-4601-9291-122fca96de66._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/mg/b63feb35-d5ef-4c48-9c79-fb6d5aca81d0._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/mg/6591896b-d838-4bb9-b36a-2ab084db75ec._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/mg/7fb756a6-71cf-401e-b677-f30bb0332a89._SR300,300_.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Vicki Nelson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOOKFE3GCBQRU6E3UV47J6GR4TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J3N45SYG74HM?ASIN=B016CIVHEG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2019",
                "reviewTitle": "5.0 out of 5 stars You need these for organizing your suitcase or backpack for travel",
                "reviewText": "I'm so glad I bought these. I bought them when I was going to Mexico and all I could take on the plane was what could fit under the seat, so a backpack. I used the second largest one to fit my clothes in, and the smallest one for my underwear. I had other things in my backpack, and having these just kept my backpack so clutter-free. It was so much easier to find my items in the bag while traveling since I didn't have to dig through clothes.I've used these for our other trips as well. I roll my son's clothes up in one of them, and it's so much easier for him to get his stuff. I unzip and put them in a drawer in the hotel or house we are staying at. I don't have to take anything out and unpack it, it just stays in the bag, gets worn, then goes to the dirty laundry bag.I LOVE THESE. I would prefer two of the 2nd largest ones, that is my favorite size. They are lightweight and easy to store when not using them.I highly recommend these.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B.R.H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOBVFDW7S5VZ5S7CR6IV547XMVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19Q5W9YZ8GWEE?ASIN=B016CIVHEG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2017",
                "reviewTitle": "5.0 out of 5 stars Great Bags!",
                "reviewText": "I really like these bags! I bought the 4pc classic set, plus bought extra medium bags. I was on a tour that stopped at a different hotel almost every night - 11 in all. Not once did I have to root through my suitcase to find something, because the bags enabled me to organize everything inside. I had a bag for PJs, one for socks, one for pants, one for tops, etc. While I didn't, I could have taken the bags out and put them into drawers each evening. I was able to fit 5 pairs of rolled jeans/slacks into the large, and the medium easily accommodated 5-8 rolled, lightweight tops. I put three rolled sweaters into a small. I also bought the pack it flat toiletry bag. It was really convenient because it could hang in the bathroom, and I could have my suitcase all packed the night before and just lay my toiletry bag on top in the morning.I had no trouble with the zippers, and I could easily see what was inside because of the mesh. They're lightweight, yet sturdy. I'll never go on another trip without them!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHLLXNTQWI5XJXLBFKUYLFOUVAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23H1D4ZSO14F0?ASIN=B016CIVHEG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 2, 2018",
                "reviewTitle": "5.0 out of 5 stars Great for staying organized!",
                "reviewText": "I have to admit, that I originally thought these would be useless. But after using them a couple of times I don't want to pack without them. I love how everything stays so organized and less wrinkled. It makes it so much easier to unpack and I can later keep all the dirty clothes separated from the clean. The variety of sizes works well. I hate sharing a suitcase with my husband, but using the cubes makes it work much better since nothing ends up in a big jumble.So far I've only used them for weekend trips, so I look forward to our week long trip to Europe to see how much easier it makes it when we need to switch hotels.I wold definitely buy these again and recommend them for any one who travels regularly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D.P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBNU62VTSFUGZ6ZX7ZP4ISTJBBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11IQRC7PCXMFP?ASIN=B016CIVHEG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2017",
                "reviewTitle": "5.0 out of 5 stars Handy for multi-mode travel",
                "reviewText": "These cubes were quite useful on a train recently. I had to pack a bigger suitcase for a long trip using planes and trains. The suitcase was an ordeal to use in a small Amtrack bedroom. So, I reorganized what was needed for the train into an eBag, and tucked it into a room cubby hole. It kept my essentials clean and easy to access. The bag quality is good so far, (no frays, seams intact, zippers work).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Didier",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ4L7HHPSK66ZSYZVCTDUEDTPHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YGL02RP7WZQF?ASIN=B016CIVHEG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2017",
                "reviewTitle": "4.0 out of 5 stars Never Going Back",
                "reviewText": "TL; DR: if you fit my description, buy these. They are of very durable material, I have never had a problem with the zippers in over a year of use (and I am clumsy), and the handles are more helpful than I initially thought they would be. If you hate wasted space, you will really get a kick out of these.I am obsessed with effiency but also don't typically take the time to keep my luggage organized while traveling, so my suitcase usually ends up a huge mess, which leads to me digging around for what I need (not to mention dirty clothes mingling with clean clothes...). Add in a tendency to overpack and I realized I needed a little organization to rein myself in. My husband shares some of my tendencies, so we both got this 4-piece set to see if packing cubes would change our lives as much as other folks said.We quickly went on a weekend trip and I found them very helpful when packing in a gym-bag-style sports duffel that I use for short trips. I stayed much more organized than normal. I've also used these babies in a large, shapeless duffel and they were my saving grace. I used them while camping and loved being able to stuff just the cubes under my cot and take them out as needed as if from a little chest of drawers under my bed.The real acid test was when we used them on a 7-day trip to NYC, New Jersey, and Philadelphia to visit with family and sightsee during the Christmas/New Years season. We stayed in three different locations, with only no more than 2 nights in a row in the same place. And we don't like to check bags, so we were sticking with carry-on size luggage. The cubes made it easy to pack for different destinations into a smaller bag, because the cubes act like drawers for compartmentalizing different types of clothing. I was able to pack all of my clothes into the medium packing cube for our 2-day, one-night foray into NYC, and stick the cube and my toiletries/cosmetics bag into my backpack (it's a Patagonia 28L Refugio, for size reference). When we got to the hotel in NYC, rather than fumbling through my pack for everything (as I have in the past), I just took the packing cube out, stuck it in a drawer, deposited my backpack in the closet, and presto, done. I should also mention that we are from the South, so we layered up with long johns, hats, scarves, long sleeves and wool coats (I do admit that the long johns wound up being excessive).Because I like to read how others use packing cubes, here's how we use ours:I roll just about everything (even my underwear... no kidding), and usually I eschew the largest size cube (more on that in the below paragraph), preferring to use the medium cube as my primary. After buying these cubes, I found a two-compartment lingerie bag (one side says \"wash me\" the other \"wear me\") from Lilly Pulitzer that I like to use for bras and underwear. On a typical weekend trip, I put a pair of jeans, a pair of sweatpants, 2-3 nice/casual tanks or tees, cotton or rayon skirt and/or dress, and a button down in the medium cube, and roll up my PJs (jersey cotton boxer shorts and large t-shirts) and stuff them in where I can find a crack. I roll everything except the button down (and sometimes the dress); that I fold neatly and place on top, because I can't seem to keep the collar looking decent when I roll button downs. Into my bag go the medium cube, my lingerie bag, and my toiletry bag, with a sweatshirt and jacket laid across the top. Shoes go in a separate compartment on my gym-style duffel. On longer trips (long weekends, e.g.) I do the same, but usually PJs have to go in the small packing cube, and I will often stuff the sweatpants in with the PJs to make more room for pants/another bulky item in the medium cube. After I wear clothes, I turn them inside out, fold and roll them, and put them in the left side of the cube that they go in; this keeps them from getting wrinkled when I (most likely) wear them again (so sue me).My husband always packs in a carry-on size rolling suitcase. He folds his clothes and does use the largest cube. He puts a few pairs of pants/shorts, a few shirts, and a button down or two in the large cube. Underwear and socks go in the medium or small cube, depending on how many days we're going. PJ pants and a few comfy t-shirts either go in the large cube with everything else, or in their own cube (again, depending on the number of days). He puts his shoes in a laundry bag that came with his suitcase, and in they go with the large cube at the bottom, then the medium cube and shoes, toiletry kit on top. He typically keeps his dirty clothes loose in his suitcase then packs 'em all in a plastic bag before we leave.Note on the toiletry kit: I found that my previous toiletry bag took up too much vertical space in my bag; I had a couple layers of nice, flat, uniform shapes, then an awkward bulk that made it difficult to zip my suitcase. I found the perfect antidote in the eBags Pack it Flat toiletry bag. It is quite long, longer than 12 inches, so when packing in my weekend bag I have to squish the ends to make it fit, but it is absolutely ideal for rolling suitcases. My husband and I both have one and love them. When staying with family (as we usually do), I just grab my pajama cube, stick the underwear I'll change into in the bag, and grab my toiletry kit, and carry both by the handles to the bathroom rather than stuffing clothes, shampoo, etc. in my arms and hoping I don't forget something.The one con of this set in particular is that, like other reviewers, I don't find the large cube to be all that helpful. The only time I have really used it was when we went on our NYC/NJ trip and used it for sweaters, but 2 medium cubes would have been more helpful. I like to stuff the cubes to compress my items a bit, and the large just isn't conducive to that in my experience. My husband, however, likes it, because he can stack folded pants easily as he would in his drawers at home. Also, note that having packing cubes will not magically make you happy to compartmentalize your clothes when changing rapidly and getting out the door; there is a lot of zipping and unzipping involved when you are getting outfits together, depending on how you use these cubes. I admit that I often end up with a third of my clothes organized and in cubes and the other 2 thirds stuffed in my suitcase above, and end up re-organizing intermittently when we have downtime (or just before packing up to leave). That being said, by planning ahead and getting out my outfit for the next day while getting my pajamas out each evening, I wind up a much happier (and more organized) camper.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KD-D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTJHMDATLDWZKGTPRCH4VJVYVFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17XNCHVMU5O1G?ASIN=B016CIVHEG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2022",
                "reviewTitle": "5.0 out of 5 stars Must-have for packing your suitcase",
                "reviewText": "We love to travel light, and these allow us to pack and organize a suitcase quite well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJFNBRSG6554EFQGS4TERBUI4VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3T336DHM5N32E?ASIN=B016CIVHEG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2018",
                "reviewTitle": "5.0 out of 5 stars Amazing and Durable",
                "reviewText": "These are my favorite things ever. I bring them with me everywhere. They have endured all sorts of wear, overstuffing and struggling to get the zippers closed, but alas they still survive. They are a great shape and sized for all types of luggage. They are also a nice set for anyone who has not used packing cubes before, but really wants to. Overall a good value. I got the aquamarine color and it looks exactly like it does in the pictures.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarita M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFO7XCOUHEBF4QGJRLQ62CSXFSEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2N9B7FSL4YFQ4?ASIN=B016CIVHEG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 26, 2022",
                "reviewTitle": "5.0 out of 5 stars Love the color",
                "reviewText": "Bought these for my daughter who loves the color. They are durable and make packing easier for a kid.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Disco Dreamer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 24, 2017",
                "reviewTitle": "EBAGS 4 piece packing cubes- A must have",
                "reviewText": "Why oh why hadn't I discovered these before now? They made packing so easy, especially when I needed to double check I had packed something-instead of scrambling around in the case to find where or if I had packed a pair of socks or certain they were all in their special bags which made it easy to take out and check without disturbing and messing up all the other packing. It also made it easy to take out and hang up as everything was organised and together rather than a shirt sandwiched in between a dress and a pair of shorts to limit creasing all shirts were neatly packed together! It was also a dream coming home from our holiday as I could pre-sort all the washing into relevant bags ready to empty straight into the washing machine. The zips appear strong and robust so should last a while. The packing cubes have a see through mesh area so you can see at a glance what is inside each cube. eBags Packing Cubes - 4pc Classic Plus Set (Aquamarine)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tammy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 17, 2016",
                "reviewTitle": "Praktisch und hilfreich",
                "reviewText": "Diese Packing cubes sind sehr hilfreich und super platzsparend für eine Reise. Durch diese cubes, die in unerschiedliche Größen geliefert werden, bleibt es im Koffer organisiert. Nicht nur bei Ankunft ist es schon das alles noch schön im Koffer geordnet ist, sondern auch am Flughafen sehr hilfreich. Manche Fluggäste werden gebeten den Inhalt ihres Koffers zu zeigen. Mit diesen cubes ist es einfacher und man ist weniger gestresst mit dem wieder einpacken der Sachen.Zur Qualität der cubes kann ich sagen das sie gut verarbeitet sind und ich sehr zufrieden bin. Nach mehrmaligen Gebrauch lassen sich die Reißverschlüsse immer noch super aufmachen und schließen.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna Caterina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 5, 2019",
                "reviewTitle": "Excellent... so useful and good quality too",
                "reviewText": "These are great for sorting your stuff. I am so glad I read all the reviews (thank you to people who take the trouble to write them). I recommended them to my sister who travels a lot with a backpack and she loves them too. Nets to see through and double zipper. No complaints.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim13",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 12, 2016",
                "reviewTitle": "These made packing so easy! Each member of the family had their own ...",
                "reviewText": "These made packing so easy! Each member of the family had their own set and everyone loved them. They meant we didn't have to keep unpacking everything each time we moved location and made it easy to locate items in the suitcase without taking out everything else! They are light and easy to pack away after the holiday and wash well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ALM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 7, 2017",
                "reviewTitle": "ABSOLUTE LIFE SAVERS!",
                "reviewText": "ABSOLUTE LIFE SAVERS! These are amazing, I bought them to travel America with and I could not believe how useful they were and how much you can fit in them (if you roll your clothes properly). I couldn't say a bad thing about them, extremely durable (I couldn't believe the zip didn't break with how much I crammed into them) and you're perfect travel organiser! I wouldn't be without them, great value for money too. 100% RECOMMEND!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}