{
    "remaining_requests": 8298,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BALM-Baby-Juice-Natural-Solution/dp/B00ZPXVUYW",
    "body": {
        "name": "BALM! Baby * Juice Those Wipes * All Natural Cloth Wipe Concentrated Solution | GLASS Jar | Made in USA",
        "price": "$19.99$19.99 ($2.50$2.50 / Fl Oz) $18.99$18.99 ($2.37$2.37 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BALM-Baby-Juice-Natural-Solution/dp/B00ZPXVUYW",
        "soldBy": {
            "sellerID": "A1RX2YOMLQ323M",
            "name": "Parent Faves",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1RX2YOMLQ323M&asin=B00ZPXVUYW&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41nVNjtulnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41FSv8zurRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/213F6iKGH6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lud-F39NL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BALM! Baby Store",
            "link": "https://www.amazon.com/stores/BALMBaby/page/0A5FF703-D2BB-47FA-97D3-C492FF70C7AD?ref_=ast_bln"
        },
        "brand": "BALMBaby",
        "merchantInfo": "Parent Faves",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 252,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 12 hrs 40 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 12 hrs 40 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "MAKE REUSABLE BABY WIPES: Use Juice Those Wipes to make your own reusable cloth baby wipes, or wet wipes for cleaning hands & face on the go. TO USE: Mix Solution, then saturate cloth wipes in solution, ring out, then place in wipe warmer or airtight container. Also keep mixed solution in a spray bottle and spray wipe at time of use (great for on the go!). Taylor’s Natural Liquid Castile Soap, along with herbally infused oils and yummy essential oils, to clean, moisturize and smell good!",
            "ALL PURE, NATURAL, GENTLE INGREDIENTS: Witch hazel, Organic extra virgin olive oil, Taylor's Natural Liquid Castile Soap (herbally infused saponified organic coconut & macadamia nut oils), pure essential oils (organic orange, French lavender, tea tree), Vitamin E (tocopherol).",
            "NO BAD STUFF: Vegan / Gluten Free / BPA Free / Cruelty Free (not tested on animals - Leaping Bunny Certified) / No synthetic fragrances or preservatives",
            "CONCENTRATED: Makes 24-48 16oz Batches 2+ Gallons depending on desired strength | Dilute & add to your Wipes Warmer, or in a spray bottle | Even in the most humid climates, where bacteria breeds, our wipes juice will not go bad!",
            "GLASS BOTTLE - No Plastic! HAND CRAFTED in small batches by Taylor’s Naturals (BALM! Baby and Elevated Body Care brands) in the USA - where high quality ingredients, sustainability and Good Manufacturing Practice (GMP) go hand-in-hand!"
        ],
        "description": "Juice Those Wipes - Natural Wipes Concentrate BALM! Baby All Natural Cloth Wipes Juice Concentrate is formulated with our ELEVATED liquid castile soap to be sure all those parts get clean! We blend herbally infused oils and yummy essential oils to moisturize and smell good! Even in the most humid climates, where bacteria breeds, our wipes juice will not go bad! Perfect for changing baby's precious bottom, or as reusable \"wet ones\" for wiping hands and faces! Concentrated (Makes 24-48 Batches!) Use for Cloth Diaper Wipes or Wet Ones! Cruelty Free - Leaping Bunny Certified (Ingredients and finished products NOT tested on animals). Comes in Leach-Free Glass container - NO Plastic!",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Diapering",
                "link": "https://www.amazon.com/baby-diapering-diaper-bag-wipes-liner/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166764011"
            },
            {
                "name": "Wipes & Holders",
                "link": "https://www.amazon.com/Diaper-Wipes-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166776011"
            },
            {
                "name": "Wipes & Refills",
                "link": "https://www.amazon.com/Diaper-Wipes-Refills/b/ref=dp_bc_aui_C_4?ie=UTF8&node=677974011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 7.36 x 2.83 x 2.6 inches; 8 Ounces"
            },
            {
                "name": "Manufacturer recommended age ‏",
                "value": "‎ 0 months and up"
            },
            {
                "name": "Department ‏",
                "value": "‎ baby-boys"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ BALM! Baby"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00ZPXVUYW"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,726 in Baby (See Top 100 in Baby) #139 in Diaper Wipes & Refills"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 252 ratings"
            },
            {
                "name": "Brand",
                "value": "BALM! Baby"
            },
            {
                "name": "Material Feature",
                "value": "Natural"
            },
            {
                "name": "Unit Count",
                "value": "8.0 Fl Oz"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Special Feature",
                "value": "All natural ingredients"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "All Pure, Natural, Gentle Ingredients! Taylor's Naturals - makers of BALM! Baby and ELEVATED Body Care brands - where \"All the Good Stuff and None of the Bad Stuff is used to make all natural & organic body care products for your family. All producs are Vegan & Leaping Bunny Certified. Made in the USA. Nothing artificial - No synthetic fragrances, preservatives or binders are ever used. All products are packaged in glass, recycled aluminum or eco-sticks. Juice Those Wipes - Natural Wipes Concentrate BALM! Baby All Natural Cloth Wipes Juice Concentrate is formulated with our ELEVATED liquid castile soap to be sure all those parts get clean! We blend herbally infused oils and yummy essential oils to moisturize and smell good! Even in the most humid climates, where bacteria breeds, our wipes juice will not go bad! Perfect for changing baby's precious bottom, or as reusable \"wet ones\" for wiping hands and faces! Concentrated (Makes 24-48 Batches!) Use for Cloth Diaper Wipes or Wet Ones! Cruelty Free - Leaping Bunny Certified (Ingredients and finished products NOT tested on animals). Comes in Leach-Free Glass container - NO Plastic!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/84950fad-e5f5-4611-b654-d2db41235fa5.__CR125,0,751,1001_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/62006cfc-05d7-4eb2-8cbb-ac70dce74338.__CR0,0,1500,750_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "How to Use Mix Solution, then saturate cloth wipes in solution, ring out, and place in wipe warmer or airtight container. Or keep mixed solution in a spray bottle and spray a wipe at time of use (great for on the go!).",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5267a0bd-8d45-4b9b-9aae-9dad43bdb0b7.__CR240,0,959,959_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Try Other BALM! Baby and ELEVATED Body Care All Natural Products! Quality - Integrity – Sustainability. That is what Taylor’s Naturals has always been about. Born in California, raised in Hawaii and continuing to grow in Arizona. Taylor’s Naturals has come a long way. Starting out with a single liquid soap - now with an extensive product line. One thing that has always remained the same is our commitment to Quality and Sustainability. As much as possible, we use organic ingredients and go the extra mile to provide product packaging with little to no plastic. All of our products are Vegan & Cruelty-Free (Leaping Bunny Certified). We don't use any synthetic unhealthy binders. We infuse all our oils in house. Our products are the real deal! Pure, Natural, Healthy! We are family owned and operated, hand-crafting all our products in small batches ensuring quality. Taylor's Naturals - makers of BALM! Baby and ELEVATED Body Care brands. Healthy Products from our family to yours!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a84d09a9-8c93-47be-8d51-c764a31d1fbf.__CR0,132,2016,1247_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/84950fad-e5f5-4611-b654-d2db41235fa5.__CR125,0,751,1001_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/62006cfc-05d7-4eb2-8cbb-ac70dce74338.__CR0,0,1500,750_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5267a0bd-8d45-4b9b-9aae-9dad43bdb0b7.__CR240,0,959,959_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a84d09a9-8c93-47be-8d51-c764a31d1fbf.__CR0,132,2016,1247_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cameron Michael Perry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW5XYJ2HVJ3KAFGQ3Z7PDQAKQRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H7MDIUY5UVJE?ASIN=B00ZPXVUYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Convenient, Affordable, and Delightfully Effective!",
                "reviewText": "I recently started using Balm Baby Juice Baby Wipe Concentrate, and I’m absolutely thrilled with this product. It ticks all the boxes for what I look for in a baby wipe solution – convenience, great value for money, a pleasant scent, skin-friendly, and ease of use.First and foremost, the convenience factor is a standout feature. The concentrate format means I can create my baby wipes whenever I need them. This not only saves me money but also helps reduce waste, which is a win-win for both my wallet and the environment.The cost-effectiveness of this product is hard to beat. A little goes a long way, and the concentrate bottle lasts a surprisingly long time, making it a fantastic value for the money.The scent of the Balm Baby Juice is delightful. It’s not overpowering, yet it leaves a fresh, clean fragrance on my baby’s skin. I appreciate that it’s not loaded with artificial perfumes but still manages to make each diaper change a pleasant experience.One of the most significant benefits is how gentle this product is on my baby’s skin. It leaves the skin feeling soft, moisturized, and free from irritation. I’ve noticed a considerable improvement in my baby’s skin health since using these wipes.Lastly, the ease of use is worth mentioning. Mixing up a batch of baby wipes is a breeze with the provided instructions, and it’s a quick process. Plus, the product doesn’t leave any residue on the wipes, ensuring a clean and comfortable diaper change every time.In summary, Balm Baby Juice Baby Wipe Concentrate is a game-changer for parents seeking a cost-effective, skin-friendly, and convenient solution for baby wipes. It’s an outstanding product that delivers on its promises and has become a staple in my baby care routine. I highly recommend it to fellow parents looking for a reliable and pleasant baby wipe solution.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "southernbelle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYUONJMVJLCQVOHNMP56QP2MX3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FGJ6139JIMK4?ASIN=B00ZPXVUYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2022",
                "reviewTitle": "5.0 out of 5 stars Best Cloth Wipe Juice",
                "reviewText": "Of all the things I discovered with my third baby, cloth wipes are by far my favorite. From wiping faces, to runny noses, to ear gunk, to messy hands/knees/bums, to even wiping down the changing table or a restaurant table...these suckers do it all! And the reason I love mine so much are 100% bc of juice those wipes. It smells good and it cleans so well but is super gentle on skin. I've used it with different brands of wipes (my fave are the more washcloth-like ones) and I use the max amount of water on the instructions with the solution. One batch over a stack of wipes fills my ubbi wipe holder and lasts me a week. The bottle lasts me months as you only need a tiny bit per batch. Make sure you mix your solution and water before pouring over folded wipes in your wipes holder. You won't regret this stuff!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYQPAWGZJNJWYAOK5G67NA7FZ5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZA4VUK22NT5Y?ASIN=B00ZPXVUYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "I've been using this with my cloth wipes because I didn't want them to get a funky smell (which will happen if you use plain water) but I wanted them to be pre-wetted.I use it in our compact wipe warmer with cloth wipes and it's been wonderful!I love that it's a concentrate. It's lasted me 6 weeks now and I still haven't emptied the bottle. Plus we live in an RV full-time so it's a huge bonus that it takes up very little space!There's a very faint lemony smell. I find it pleasant. I have not had any issues with diaper rash or skin irritation.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brittany T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPMGU6MVS7CRC662RQQMKH5NWUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H7TCVSNBEY8R?ASIN=B00ZPXVUYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2021",
                "reviewTitle": "5.0 out of 5 stars Clean, smells great, great on sensitive baby butts and easy to use!",
                "reviewText": "I use reusable wipes and diapers with my son, he’s almost 2 months old and we started using these after the wipes from the hospital were gone, so about a week after he was born. I still have almost a fourth of the bottle left so it has lasted almost 2 months! Highly recommend! The fragrance is citrusy (made with all natural ingredients) so it smells great and it’s perfect for super sensitive skinned babies (my son broke out with huggies wipes and we gifted our box of those to a fellow new parent that used them) I bought a spray bottle and keep my mixed solution in that(good for 3 pack of wipes approx) and open and pour the mix directly into the reusable wipe cases I have and voila! Wipes for the day💕✨",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristen Lawrance",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC6W76JDYDW4RDDRTSRTZFFKAOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36F4T0W1PGY78?ASIN=B00ZPXVUYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Smells Great!",
                "reviewText": "My daughter's booty has never smelled so fresh after a diaper change. Love it! Easy to use and smells great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patty Arrigo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVLG4PEMCZQZOWEJAWUTRGKWK2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RARHMQKSSJSAI?ASIN=B00ZPXVUYW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 17, 2022",
                "reviewTitle": "4.0 out of 5 stars Make DIY flushable wipes!",
                "reviewText": "I purchased tiny little spray bottles and diluted this stuff with water to use for “flushable wipes.” Flushable wipes are so expensive and drain clogging…a few sprays of this solution on my toilet paper, and I’m left feeling fresh and clean! Also to note- I have insane sensitive skin and this doesn’t irritate my skin at ALL. I even made a tiny to-go spray bottle for my purse…so when I’m out and about running errands I am able to freshen up!I would give this a 5/5 if the scent was better! It’s not that the scent is bad- it’s a nice clean scent- but I don’t LOVE it. On the other hand…if it had more of a perfume scent it would probably irritate my skin.I forgot to mention: it totally comes with a tiny little funnel so it’s very easy to use to fill the tiniest of bottles! The funnel was the icing on the cake!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAMWVL7NACRJ7QPTAO5EUQ5YTPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FA7NDWV6WB0E?ASIN=B00ZPXVUYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Bigger bottle than I expected",
                "reviewText": "Good product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5F3I4YZ3UBPDG3BMFSHFNOYPCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SOXGAFSE2NN3?ASIN=B00ZPXVUYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2018",
                "reviewTitle": "5.0 out of 5 stars Perfect Cloth Wipe Companion",
                "reviewText": "I went the first 4 years of my cloth diaper journey (2 1/2 of those years cloth diapering two kids, 6 months cloth diapering 3 kids at the same time, somebody potty train, PLEASE!) before I tried this. I shouldn't have waited so long. First I tried pre-wetting wipes and have them in a wipes container ready to be used. But in only a few hours they didn't smell awesome, and forget using them the next day. Then I went to only wetting wipes as we needed them. Kept them fresh, just plain water, could make them warm which was nice, but it was a pain in the butt since the changing table isn't near a sink. Did that for several years. Then tried wipe solution cubes/wafers that you dissolve in water. They worked well once dissolved, but had to use near boiling water to get them to dissolve, not great when you need a wipe RIGHT NOW. Then I saw this liquid. I was skeptical because it cost more than the ones you dissolve. But it takes such a small amount for so many wipes that it has lasted over 2 months of cloth diapering 3 kids and I still have half a bottle. I use 1 tsp for 24 wipes. SMells good, keeps them fresh, I like that there's some additional cleaning power for the dirty jobs.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$19.99",
                "sellerName": "Parent Faves",
                "sellerRating": "5"
            }
        ]
    }
}