{
    "remaining_requests": 8446,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/HUGGIES-Unscented-Sensitive-Disposable-Flip-top/dp/B07MHTN4HW",
    "body": {
        "name": "Huggies Natural Care Sensitive Baby Wipes, Unscented, 6 Flip-Top Packs, 48 Count (Pack of 6)",
        "price": "$21.99",
        "originalPrice": "$24.99",
        "rawPrice": 21.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/HUGGIES-Unscented-Sensitive-Disposable-Flip-top/dp/B07MHTN4HW",
        "soldBy": {
            "sellerID": "A1M632U123SXE1",
            "name": "GlobalTechLlc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1M632U123SXE1&asin=B07MHTN4HW&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "19",
        "stockDetail": "In stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51wCffbJwLL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51cmha m-VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EER0Qby-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rgJh9llgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419k626LRmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51T4Oru2CcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51T3mNQmn4L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the HUGGIES Store",
            "link": "https://www.amazon.com/stores/Huggies%C2%AEWegotyoubaby/page/26569287-DCD8-4BB8-9718-5630FD1776B0?ref_=ast_bln"
        },
        "brand": "Huggies®Wegotyoubaby",
        "merchantInfo": "GlobalTechLlc",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 14194,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 28 - March 1."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Pure & Gentle Wipes – Natural Care Sensitive Wipes contain 99% purified water and 1% skin essential ingredients for a gentler clean"
        ],
        "description": "Huggies Natural Care Sensitive Baby Wipes are made with plant-based ingredients, 99% purified water and 1% skin essential ingredients to provide a gentle clean for your baby's soft & delicate skin. Natural Care Sensitive Wipes are infused with aloe & vitamin E to help keep baby's skin healthy and moisturized. They're also hypoallergenic, dermatologically tested & pH-balanced to help maintain healthy skin. Natural Care unscented baby wipes are safe for sensitive skin with no harsh ingredients. They're fragrance free, alcohol free, paraben free and do not contain phenoxyethanol or MIT. In addition, our unique base sheet absorbs, locks-in and retains the mess to help ensure your baby's skin is clean & healthy. With the #1 branded wipe* you can feel confident you're giving baby a safe, gentle clean every time. Don't get caught without Huggies wipes! Sign up for Subscribe & Save to ensure you always have Huggies Natural Care Sensitive Wipes on hand. Join Huggies Rewards to earn 10 points for every dollar spent on Huggies diapers and wipes. Points are redeemable for products, gift cards, sweepstakes and more. You'll also receive exclusive diaper coupons, offers and updates. (*Based on US and Canada Nielsen data ending 7/20/19)",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Diapering",
                "link": "https://www.amazon.com/baby-diapering-diaper-bag-wipes-liner/b?ie=UTF8&node=166764011"
            },
            {
                "name": "Wipes & Holders",
                "link": "https://www.amazon.com/Diaper-Wipes-Accessories/b?ie=UTF8&node=166776011"
            },
            {
                "name": "Wipes & Refills",
                "link": "https://www.amazon.com/Diaper-Wipes-Refills/b?ie=UTF8&node=677974011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8.97 x 9.91 x 7.94 inches; 0.09 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 10036000501473"
            },
            {
                "name": "Department ‏",
                "value": "‎ baby-girls"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ September 25, 2018"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07MHTN4HW"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,491 in Baby (See Top 100 in Baby) #131 in Diaper Wipes & Refills"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 14,194 ratings"
            },
            {
                "name": "Brand",
                "value": "HUGGIES"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive"
            },
            {
                "name": "Material Feature",
                "value": "Natural"
            },
            {
                "name": "Unit Count",
                "value": "288.0 Count"
            },
            {
                "name": "Number of Items",
                "value": "6"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cowboy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESEHBT3JQXLRKIR53OCZH3P7WAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17PIZ4ECYAVQO?ASIN=B07MHTN4HW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2019",
                "reviewTitle": "5.0 out of 5 stars Excellent wipe for picky parents.",
                "reviewText": "We've had kids in diapers for the past five years so we know a few things about wipes and diapers. Numerous brands have been tried, yet we always come back to Huggies for their quality and value. For the past 1-2 years we have been loyal to the Huggies Natural Care wipes because they are soft, strong, unscented, easy to pull from the package, and a good value.I recently came across Huggies Refreshing Clean wipes and they were a tad bit cheaper and slightly more satisfying than the Huggies Natural Care. I thought we'd give them a try, knowing that Huggies hasn't disappointed us yet. These wipes are exactly the same with a mild and pleasant scent. They come in the same package, same size and thickness, with the same design on the wipe. The scent is pleasant and clean, not the unpleasant baby powder smell that other wipes have. They are also one cent cheaper per wipe than Huggies Natural Care, which adds up if you go through as many wipes as we do.To sum it up, the Huggies Natural Care are excellent wipes and won't disappoint. The Huggies Refreshing Clean are the same wipe with scent but slightly cheaper. Either way you can't go wrong with Huggies wipes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI2TWH7BUSHC5YVK4KCCYPPMXZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21XW0SAGEATFN?ASIN=B07MHTN4HW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2019",
                "reviewTitle": "5.0 out of 5 stars Great!",
                "reviewText": "These are my very favorite wipes. I’m actually an adult and I use them to wash my face. They work great for removing grime, but they are very gentle, so they won’t strip your skin or make it tight and dry. I’ve been using them now for a couple years and my skin looks better than ever. I don’t usually get these smaller packs - normally I get the bulk packs with the refillable tub - but these came out cheaper per wipe this time so I got these. Either way they’re the same wipes, although I have to say I prefer getting the bulk packs with the refillable tub instead of these only because the bulk refills seem like they retain moisture a bit better. It could just be the way they are sealed and how the tub keeps the wipes fresh differently from how these little plastic baggie containers keep the wipes fresh...who knows. Beyond that small issue, these wipes will always be great. If you have allergy issues or sensitive skin where you react to face washes, I would highly recommend trying these to wash your face. They work GREAT.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIIYWLNC3HQD5HY4UUDZDOXJV4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17B3ZZ7FYY8JQ?ASIN=B07MHTN4HW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 21, 2019",
                "reviewTitle": "5.0 out of 5 stars Great wipes, better than Amazon Brand.",
                "reviewText": "Last time I bought bulk baby wipes, I bought the Amazon brand. I think these are a lot better. I admittedly use them on my face when I'm too lazy to wash my face. Not sure if they break me out because other factors are at play HOWEVER I know they don't break me out like the Amazon brand. When something irritates my skin or makes me break out, I get these tiny white blemishes that are right at the surface of my skin. They don't look like \"whiteheads \" but they appear when say I have been touching my face too much or a dog licks my face. These baby wipes have NOT caused these blemishes to appear at all. Which is awesome. They are also not as wet as the Amazon brand. They are wet enough, the right amount. They're not chemically, they don't have a scent, they don't leave my skin red or dried out like the Amazon ones. I am buying Huggies brand over the Amazon brand from now on.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CG Buckeye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK2I3VVQBGMTTOBNWULEDAKXLAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OFJ2CTQ7BM6R?ASIN=B07MHTN4HW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2019",
                "reviewTitle": "5.0 out of 5 stars Great product and great price - recommended for the entire family!",
                "reviewText": "I actually ordered these to use with a foster kitten, they worked very well while the little one was quite small. They are a nice large size and uniformly moist, so they were great for tidying up all kinds of kitten messes, including paws and faces that ended up covered with food!Because the kitten outgrew the wipes while I was still on the second container, I tried these myself and find them to be a great wipe for the whole family. Great for the prescribed use, also for freshening up face and hands. There is no scent and no allergens that I have detected. Highly recommended for all members of the family!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne Leong",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYJH76HWGY4GKQ7C3MYNK77A6EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NN336SCJ1MXU?ASIN=B07MHTN4HW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2020",
                "reviewTitle": "5.0 out of 5 stars Best wipe on the market",
                "reviewText": "After trying just about every wipe on the market, my husband and I settled on these wipes as being our favorite. They are now part of our Subscribe & Save as we have two boys under two at our house. We like these wipes because they are durable, come out one at a time, and work for our sensitive-skin children. They certainly are not the softest wipe on the market, but as you know, when choosing a wipe it’s convenient to have something that comes out one at a time. We can hold a baby’s legs and grab wipes instead of risking a mess by letting go of legs.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angel-mom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2WNHA4GGZITAQ46APWQIZIM46A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZAIFTHR3376H?ASIN=B07MHTN4HW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Value",
                "reviewText": "This product is indeed great value for your money",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "InnocentBystander",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXP2IBYPZQKMOVKNYX53XVBX5BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RY7M4R4QIQAKX?ASIN=B07MHTN4HW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2019",
                "reviewTitle": "4.0 out of 5 stars Got what I ordered",
                "reviewText": "I ordered the 6 pack, and got 6 quality packages. Nothing is opened, nor looks opened. They came in a fully sealed Huggies box. The price wasn't horrible. They were $8.98 when I got them. Something tells me they won't stay that price consistently, but for now thats what I paid.I do not plan on buying these forever, especially if they go up in price, bc there are so many options out there where you get like 1,000 wipes for $15. (Kirkland, or Walmart brand, for ex). I am not a brand-tethered person, so budget is a big deal to me. But I obviously also don't want to sacrifice quality or safety, so it can be hard. I am glad I found these at a cheap price for now. My baby boy is due in Sept so we are putting final touches on nursery and changing station. I have another son, who say passed away from complications of chemotherapy and high dose steroids, but during his beautiful life, we used many many many brands of wipes, spanning all the $ amounts and company names. Huggies was one of them, and these sensitive versions were used. They seemed fine and did not cause any irritation, which was a problem for our little boy w very sensitive genital and butt-area skin. I am erring on the side of caution and assuming his soon-to-be-brother will also have sensitive skin (thanks to Dad), so hopefully these are nice start to his changing time at home.Overall, I got what I ordered, and have experience with them in the past to know that they are quality and minimize skin irritation during changes. Pro-tip: When things got really bad with irritation, and we noticed rash, we smeared diaper cream into the wipe and then wiped up his butt, so it wasn't as abrasive as with just the cloth. There are many other brands out there, offering more wipes, for cheaper. But since I happened to get these at a good price, it was worth it. :)",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J RJ R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 13, 2023",
                "reviewTitle": "Por mucho, las mejores!",
                "reviewText": "Las recomiendo ampliamente, son las mismas que consumía en Estados Unidos, con una textura suave, sin fragancia y perfectas para piel sensible!Desde que descubrí que las traía Amazon Mx no he dejado de consumir este producto en Mx.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719HuWdSMnL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71JmT8Hk93L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "GWG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 22, 2020",
                "reviewTitle": "Bests wipes I've found",
                "reviewText": "And a smaller size so they don't dry out as fast as the 68 packs. No babies around any more, but they are a much better size than the standard small package wipes. Cotton so you can't flush them, otherwise no issues.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 2, 2022",
                "reviewTitle": "Súper buenas",
                "reviewText": "Mi bebé es de piel delicada y solo con estas toallitas está perfecto! Si le cambio de marca se roza!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shawna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 14, 2020",
                "reviewTitle": "Not just diaper wipes",
                "reviewText": "I use these for multiple uses. Wash my face with them and during messy menstrual cycles. These are a god send and aren’t filled with harsh chemicals",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "morgan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 29, 2019",
                "reviewTitle": "Great product",
                "reviewText": "These are my go to product when I am on my period!Work great, no scent, nice for sensitive skin.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}