{
    "remaining_requests": 8250,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BabyKicks-Baby-Wipes-10-Pack-Ivory/dp/B001NAAQOG",
    "body": {
        "name": "Baby Wipes - 10-Pack, Ivory",
        "price": "$12.07$12.07 ($1.21$1.21 / Count) $11.47$11.47 ($1.15$1.15 / Count)",
        "originalPrice": "",
        "rawPrice": 12.07,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BabyKicks-Baby-Wipes-10-Pack-Ivory/dp/B001NAAQOG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0024NJY6W"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "Only 9 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31vhogF9zOL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Zl1z4A63L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Kkh79X2rL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: BabyKicks",
            "link": "https://www.amazon.com/BabyKicks/b/ref=bl_dp_s_web_20272103011?ie=UTF8&node=20272103011&field-lbr_brands_browse-bin=BabyKicks"
        },
        "brand": "BabyKicks",
        "merchantInfo": "",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 46,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 11 hrs 32 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 11 hrs 32 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "10 pack of soft hemp fleece re usable baby wipes with beautiful ivory stitching trim",
            "A must have for every diaper bag make a great baby shower gift",
            "Great, re usable all purpose wipes super practical",
            "75\" x 95\" ovals",
            "Hand made with certified organic cotton"
        ],
        "description": "Product Description BabyKicks Hemparoo Baby Wipes are made out of the same fleece used for our best selling BabyKicks Prefold diapers and doublers. They are 7.5\" by 9.5\" ovals. The soft fleece is ideally suited for thorough cleanups. They are a must have for the bath tub, changing table, high chair and diaper bag. Keep a pile of these on your changing table along for a gentle, economical cleanup. Our Baby Wipes are truly an all purpose product we even heard that dad's started using them because they cleaned their camera and photo lenses better than anything else they previously used. You just cannot go wrong with these little things. Country of origin USA and PRC. From the Manufacturer BabyKicks Hemparoo Baby Wipes are made out of the same fleece used for our best-selling BabyKicks Prefold diapers and doublers. They are 7.5\" by 9.5\" ovals. The soft fleece is ideally suited for thorough cleanups. They are a must have for the bath tub, changing table, high chair and diaper bag. Keep a pile of these on your changing table along for a gentle, economical cleanup. Our Baby Wipes are truly an all purpose product - we even heard that dad's started using them because they cleaned their camera and photo lenses better than anything else they previously used. You just cannot go wrong with these little things. Country of origin USA and PRC.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Diapering",
                "link": "https://www.amazon.com/baby-diapering-diaper-bag-wipes-liner/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166764011"
            },
            {
                "name": "Wipes & Holders",
                "link": "https://www.amazon.com/Diaper-Wipes-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166776011"
            },
            {
                "name": "Wipes & Refills",
                "link": "https://www.amazon.com/Diaper-Wipes-Refills/b/ref=dp_bc_aui_C_4?ie=UTF8&node=677974011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "‎9.5 x 7.5 x 1 inches"
            },
            {
                "name": "Item model number",
                "value": "‎AMZ1005"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Material Type",
                "value": "‎Cotton,Fleece,Hemp"
            },
            {
                "name": "Number Of Items",
                "value": "‎10"
            },
            {
                "name": "Item Weight",
                "value": "‎4 Ounces"
            },
            {
                "name": "Country/Region of origin",
                "value": "‎USA"
            },
            {
                "name": "Age Range Description",
                "value": "‎Baby"
            },
            {
                "name": "ASIN",
                "value": "B001NAAQOG"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 46 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#146,066 in Baby (See Top 100 in Baby) #677 in Diaper Wipes & Refills"
            },
            {
                "name": "Brand",
                "value": "BabyKicks"
            },
            {
                "name": "Material Feature",
                "value": "Organic"
            },
            {
                "name": "Unit Count",
                "value": "10.0 Count"
            },
            {
                "name": "Number of Items",
                "value": "10"
            },
            {
                "name": "Age Range (Description)",
                "value": "Baby"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Monkey Momma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMHF7NE27AOYSQWPI7LPZM4AIOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R273405ZTNS0NH?ASIN=B001NAAQOG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2010",
                "reviewTitle": "5.0 out of 5 stars Perfect for those who are cloth diapering!",
                "reviewText": "I love these wipes! They are amazingly soft, but yet easily clean up messy newborn stools. I know one reviewer commented on the tags getting in the way. I do sort of wish they weren't there, but they don't bother me too much - and they definitely wouldn't deter me from buying these. I also like these better than other cloths I have tried. I feel they are worth the money. It is so much easier to just use these and throw everything into the diaper pail at once - and they should make up their cost within a couple months. I had purchased 3 packs of these, but since they are large and work well, I could have gotten by with 2 packs as I wash diapers every 1 - 2 days.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabrielle A. Padro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7TUIIMQFQD6P6O4LHBH66P6JSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36GDEDL7TQQL4?ASIN=B001NAAQOG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2009",
                "reviewTitle": "5.0 out of 5 stars These wipes are wonderful!",
                "reviewText": "I just want to start off by saying my daughters do not use cloth diapers, they are in disposables. With that said, I was looking forward to making the leap to cloth diapers but was a bit concerned about the wiping issue. I wanted to find the perfect set of cloth wipes; needless to say these are it. These wipes are so absorbent, even with my daughters' occasional diaper blowouts (sorry if TMI). I have been using them for two months and they are still in brand new condition! No stains, and I purchased the ivory wipes. I also suggest using the original blue Dawn dish detergent, if you hand wash them. I prefer hand washing to just throwing them in the washing machine, since it's a major waste of water, and I hang dry them.Another great thing about this is that my twin daughters love them! They both had a bad case of yeast diaper rash, and nothing I was doing would help. Regular baby wipes just irritated their behind, and I was getting exhausted having to take them both to the tub to wash their behind instead of using baby wipes. A little spray of wipe solution, which you can make at home with water/baby oil/and some baby wash, and these wipes and your baby will be rash free! I also love how one side is soft and fuzzy which is great for patting the diaper area dry before you apply any creams or corn starch, and the other side is more textured for grabbing as much of the bowel movement up as possible.Needless to say I am in love with these wipes and am ordering another pack right now. :) I will be using these for many years.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFQHSB2XFXBJSCRUMDMQDCPY4AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IYLR2VNCFJ8N?ASIN=B001NAAQOG",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 5, 2011",
                "reviewTitle": "1.0 out of 5 stars Fuzzy pills stick to my baby's skin",
                "reviewText": "These wipes are very soft, but the fleece pills and they don't wipe off any wetness. I use a bum spray to help get my baby clean and these wipes are the opposite of useful--they leave little fuzzy pills stuck to my baby's bottom and it's almost impossible to pick them off, even using my finger nails. I have some plain flannel wipes that I absolutely love and are super reasonably priced ( Reusable Flannel (15) Baby Wipes 100% Cotton Bleached and Unbleached (Unbleached) ), and could probably make myself or find a friend to make really easily--just cut up soft, quality flannel and serge the edges. These ones are just not worth the money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bolton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRUZETQBPE5POCFROEM4Q2HUHZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF4PVQ8GHWQQC?ASIN=B001NAAQOG",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2013",
                "reviewTitle": "2.0 out of 5 stars I thought they would be softer",
                "reviewText": "It has a soft side and a rougher side. The soft side does get softer when you wash them, but it's not nearly as soft as my satsuma cloth wipes (which I absolutely LOVE), and I think the rougher side is too rough on the skin to be used multiple times everyday.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFEKHUK56EPLIHGNLRGN55FO4VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14LTRTUYHRO4Y?ASIN=B001NAAQOG",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2009",
                "reviewTitle": "3.0 out of 5 stars great wipes but the tag is annoying",
                "reviewText": "Small problem - these wipes work great but there is a rather large tag on each wipe that I find annoying. The tag always seems to be in the way. I tried cutting one off but then I have that abrasive edge. Other than the tag I agree with all the above - launder great, wipe swell, soft (except that darn tag). some of the other wipes I order did not have a tag on each wipe.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Khalid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKGRKHABYY5IOYAMKEDZN725OMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20LT94GBBUEQZ?ASIN=B001NAAQOG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2009",
                "reviewTitle": "4.0 out of 5 stars not sure why ppl have issues with the tag...",
                "reviewText": "i just received these wipes in pink, i purchased 2 of the packs based on user reviews. i do intend to use these as both wipes and washcloths. the size is perfect, any bigger and they would get in the way, all over the place. the size is perfect to wipe the bum a few times..or to use for sponge baths and first sink baths. a lot of ppl seemed to mind the tag, and when i ordered them, i assumed they would be huge, whereas in fact they are not too cumbersome at all. they are about 1/2 inch wide on each wipe. mine had a tag on each wipe. they are located on the bottom of the long end, so u can easily work around it. and once the child is about 2 months old, they arent so sensitive and wont even be bothered if the soft tag brushes against their toosh. all in all, i would definatly recommend these. one side is rougher, im guessing it makes it easier to wipe up mess from #2, whereas the soft side iss just for a wipedown. i use my own wipe/bath solution using cetaphil, baby oil, and water. just a squirt of the first 2 and fill the rest of the squirt bottle with water. after openning the diaper, just squirt a few times, and wipe. easy. i gave this 4 stars only because i sort of wished the company would make a slightly darker color...perhaps a khaki or brown. just a bit more appealing with the pink or blue sttitching. also they shrink very slightly in the wash, so that was another point lost for these wipes. but i still would buy again if needed to.oh! one more thing, these arent perfect circles, they are elongated...which is better than what i expected! gives u more surface area to use when wiping!***UPDATE***I've been using these wipes for about a month and a half and found them useful for EVERYTHING!!! I use some as wipes, some as washcloths, and a few are designated as cloth diaper liners to use during rash time, or jjust to make cloth diaper clean up easier! cheapest cloth diaper liner u can find!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adriane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHECEW7HBAFX546UOCCI2NZIWJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REANABYNRJVQT?ASIN=B001NAAQOG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 3, 2010",
                "reviewTitle": "5.0 out of 5 stars Been Using for clothe diapering for 9 months",
                "reviewText": "We love these wipes. Really love them! Unlike others, the tag really doesn't bother us. They wipe stuff up well, and that is what matters most to us. We use a mixture of these and old baby washclothes. But when there is a super bad diaper, we always grab for one of these because they wipe it up the best.I love the oval shape. It hasn't bothered us for storage at all, since we put all our baby wipes in a old wipes container and pull them out as we use them (why bother folding them when you're going to use them later that day?). The oval shape makes it easier for us to clean with them.Also, they are absorbent and soft. They only get softer the more you wash them.We've used them for 9 months as we've dove into clothe diapering. Now that my sister-in-law is trying out clothe diapers, we have gotten them for her to use also.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}