{
    "remaining_requests": 25146,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pursonic-Laundry-Dryer-Balls-Bundle/dp/B0C6NKNZMN",
    "body": {
        "name": "Pursonic Laundry Wool Dryer Balls Bundle - Reusable Dryer Balls Made from Pure New Zealand Wool - Natural Fabric Softener Balls with Lavender Oil & Peppermint Oil - 2.75\" Diameter, 4-Pack",
        "price": "$14.99$14.99 ($14.99$14.99 / Count) $14.24$14.24 ($14.24$14.24 / Count)",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pursonic-Laundry-Dryer-Balls-Bundle/dp/B0C6NKNZMN",
        "soldBy": {
            "sellerID": "A2CNY107LI2EOG",
            "name": "Mitch Mel Corp Same Day Shipping",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2CNY107LI2EOG&asin=B0C6NKNZMN&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BRJWWSW1"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BRJY7P8B",
                "variationName": "Size",
                "variationValue": "3 Wool Dryer Balls",
                "price": "$12.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0C6NKNZMN",
                "variationName": "Size",
                "variationValue": "4 Dryer Balls with Lavender & Peppermint Oils",
                "price": "$14.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BRJVTP18",
                "variationName": "Size",
                "variationValue": "4 Wool Dryer Balls",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BRJXKFB8",
                "variationName": "Size",
                "variationValue": "6 Wool Dryer Balls",
                "price": "$14.50",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51paon3rBGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Hgi3kqoaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XjZJKR2uL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oBseK8zqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51D9QucYfWL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Pursonic",
            "link": "https://www.amazon.com/Pursonic/b/ref=bl_dp_s_web_5457078011?ie=UTF8&node=5457078011&field-lbr_brands_browse-bin=Pursonic"
        },
        "brand": "Pursonic",
        "merchantInfo": "Mitch Mel Corp Same Day Shipping",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 43,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 6 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Faster Drying Time: Our wool laundry balls for dryer remarkably reduce drying time. As your clothes tumble, these dryer wool balls lift and separate each garment, facilitating a consistent and even distribution of hot air. This wool softener laundry bundle not only saves energy but also preserves the integrity of your fabrics, ensuring they last longer.",
            "Natural Aroma Boost for Freshness: Our laundry supplies don't just stop at efficiency; it caters to your senses too. Included are two 10ml bottles of premium-quality lavender and peppermint laundry essential oils for dryer balls. By applying just a few drops onto the wool balls for dryer, your laundry will emerge with a gentle, refreshing scent that lingers, making every wear a rejuvenating experience.",
            "Skin-Friendly, All-Natural Solution: Many commercial fabric softeners and dryer sheets contain chemicals that could be harsh on sensitive skin. Our dry balls for dryer are free from synthetic dyes and potential irritants. This natural approach guarantees a gentler and safer laundry experience, especially for those with allergies or skin sensitivities.",
            "Eco-Conscious Choice for Our Planet: By choosing our reusable wool dryer balls scented, you're not only reducing the demand for plastic packaging but also decreasing the use of disposable products. Each laundry softener ball is designed to be used for over 1,000 loads, making it a green alternative to regular fabric conditioners or disposable dryer sheets.",
            "Effortless Application for Every Load: Our hypoallergenic fabric softener has been designed for maximum convenience. Regardless of your laundry size, just toss in the desired number of dryer balls wool with your clothes. Their hypoallergenic properties ensure safety for all fabric types. Each pack comes with four robust drying balls for laundry, ensuring consistent results for countless loads to come."
        ],
        "description": "Pursonic New Zealand Wool Dryer Balls with Essential Oils for Laundry 2.75\" Diameter (4-Pack): Imagine cutting down those tedious drying times; our all natural fabric softener ball masterfully lifts and separates garments for even air circulation, ensuring not only swift drying but also preserving fabric quality for longevity. But that's not all. Infuse a touch of nature into each laundry session with our included lavender and peppermint wool dryer balls essential oil. A few drops in our essential oil dryer balls and your clothes emerge with a captivating fresh aroma, turning mundane chores into a sensory delight. Prioritize both your skin and the planet with our chemical-free, dye-free laundry dryer balls reusable, ideal for those with sensitivities and a keen sense of environmental responsibility. Each dryer ball promises over 1,000 uses, championing sustainability and reducing needless waste. And the cherry on top? Their sheer simplicity. Regardless of your load size, toss in our dryer balls laundry and watch them transform your laundry. Upgrade today to a seamless, efficient, and eco-friendly laundry routine with our premium wool dryer balls laundry reusable. — Package Includes: 4 dryer balls and 2 10ml bottles of lavender and peppermint wool dryer ball laundry essential oil. — About Us: Pursonic is a family-owned business with roots in manufacturing since 1971. Based in NYC the PURSONIC brand was launched in 2012 and it was geared to offering premium products at a value price. Our commitment is to introduce new, innovative and exciting products that all can afford.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Laundry",
                "link": "https://www.amazon.com/Laundry-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15356111"
            },
            {
                "name": "Dryer Balls",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=21567861011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 9.96 x 7.36 x 2.95 inches; 11.68 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ May 30, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ PURSONIC"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0C6NKNZMN"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#37,617 in Health & Household (See Top 100 in Health & Household) #46 in Dryer Balls"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 43 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "alan brady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4V4BBPSZVN2WPQ2ATLN22ZWIUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HEQYJGL88A09?ASIN=B0C6NKNZMN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars That they work well",
                "reviewText": "I like that they work well and I can get away from dryer sheets and adding the oil and put on air fluff makes them smell wonderful.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina Aiken",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5GQWIGQFWUVJFKSPMRL7ICUZQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RG880YGLAPQTX?ASIN=B0C6NKNZMN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Drys fast",
                "reviewText": "Works very well makes my clothes smell so good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ravenskya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTDWS37LHENP5HHWVV7LFQGY3SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JLO65UFJ6SUL?ASIN=B0C6NKNZMN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "3.0 out of 5 stars Odd selection of packaging",
                "reviewText": "Okay so the dryer balls themselves are a tad smaller than the ones I already owned which isn’t any sort of an issue. They work great. I love the smell of the lavender sent with the package.My only real complaint is that I ordered these in an attempt to be more environmentally conscious and cut down on the plastic and other waste that I produce. It’s a slow process but im working on it.The amount of unnecessary plastic packaging (non recyclable type in my area) was astounding. I couldn’t think of any reason to have used that much plastic on an eco friendly product when the same could have been accomplished with cardboard.So, the wool balls work great, the packaging is my only complaint.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rae",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECJHD6RZUAOCZQF6T6OUMDSPGCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R242LKJUN5H2CP?ASIN=B0C6NKNZMN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Good quality, be sure to read up on essential oil safety if you plan to use those for other purposes",
                "reviewText": "I really have no major complaints about these. I have used multiple brands of dryer balls varying in prices, and these are on par in terms of quality to more expensive brands that I have used. The packaging is pretty and ensures that the dryer balls maintain their shape during shipment. I have had some shedding during the first couple of uses with other brands, but this is not an issue that I have had with these at all. I anticipate that they will last a long time, and I am happy with theseThe inclusion of oils is nice, even though I prefer not to add those. Another reviewer has gone in-depth regarding the use of these oils, and I highly recommend giving their review a read if you plan to use them for anything outside of on the dryer balls themselves (as it appears that important safety information has been excluded regarding using the oils on your skin or oral use. It is my understanding that essential oils should never be ingested, so I wouldn't recommend using them in any way that could result in you potentially swallowing the oils, such as in the oral rinse mentioned. Essential oil safety is important and, like that reviewer, I would recommend reading up on essential oil safety if you intend to use these for any purpose other than with the dryer balls. I also second their mention that essential oils should never be used directly on the skin without proper dilution. I encourage you to do your own research, though, as I am not an expert on this).",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yuna kim ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2Z53YUVUTPDW73J67OVQEMCG6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBC7G9BPMQWSI?ASIN=B0C6NKNZMN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Good",
                "reviewText": "Good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYAVIOGF22CC7GE6VXF5KVZSMTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KYG80S1UQC6V?ASIN=B0C6NKNZMN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Love this set!",
                "reviewText": "This set is great! The dryer balls are really well made. They last so long and help to really get your laundry good and dry. The oils smell great and leave your laundry extra fresh!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ds",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5IT7B2UZ53EBPG6OT7AYZMHKCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17BTOLU8WOWWX?ASIN=B0C6NKNZMN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Naturally soften clothes and speed up drying time",
                "reviewText": "This review is for Pursonic Wool Dryer Balls Bundle – 100% pure New Zealand wool dryer balls, 2.75\" diameter, 4-pack, with 2 bottles of oil fragrance Lavender & Peppermint. The dryer balls are made of soft felt in a natural off-white color, are slightly larger than a tennis ball, and have no odor as received. They work to reduce drying time and soften clothes without fabric softeners. The essential oils can be used to scent the balls and therefore scent the clothes in a dryer load. The essential oils are 0.34 oz (10 mL) each; lavender source in France and peppermint source in USA. This is a high quality bundle that reduces the need for commercial fabric softeners that often contain artificial scents and chemicals. You can use the natural essential oils in tailored amounts of your choosing or just omit the oils for unscented drying. The oils can also be used separately for a multitude of essential oil uses, so the bundle is a good value. This set would make a good gift.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rottisnot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUV5Q6WD2L4PQAIV4GEPSF43HIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37F299NP24N1N?ASIN=B0C6NKNZMN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Pursonic Wool Dryer Balls set",
                "reviewText": "True to description, nicely packaged. I've wanted to try these for years to replace fabric softener and they really do work! My issue was static electricity than needing additional fragrance (I like the smell of my \"manly\" laundry detergent, lol). They worked great alone and did seem to dry the clothes a little faster. I especially like the sustainability aspect as well as not having to clean the fabric softener residue out of the washer and dryer anymore- it leaves a waxy coating- liquid in the washer compartment that builds up and the sheets leave it on the sensor and lint screen.Both of the included essential oils smelled as stated. Tried the lavender on a load of towels and it did impart a slight fragrance that remained after drying but smelled heavy coming out of the dryer exhaust outside. Tip: rub the oil drops in. If its just sitting on top, the oil will transfer as oil blotches to the laundry.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.99",
                "sellerName": "Mitch Mel Corp Same Day Shipping",
                "sellerRating": "5"
            }
        ]
    }
}