{
    "remaining_requests": 25137,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Laundry-Detergent-Dispenser-Softener-Container/dp/B0C7MHG2MS",
    "body": {
        "name": "Half Gallon Laundry Detergent Dispenser Bottle with Pump,Bamboo Tray,Fabric Softener Dispenser Laundry Bottles,Laundry Soap Dispenser for Liquid Detergent,Large Storage Container Jar for Laundry Room",
        "price": "$29.99$29.99 $28.49$28.49",
        "originalPrice": "",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Laundry-Detergent-Dispenser-Softener-Container/dp/B0C7MHG2MS",
        "soldBy": {
            "sellerID": "A3HG3C9CC16K0B",
            "name": "JOYONLY",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3HG3C9CC16K0B&asin=B0C7MHG2MS&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "12",
        "stockDetail": "Only 12 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41H9TeZ OnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Dmf16F85L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51z0zuP L7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VHcxou3sL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dfNuVoAdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5117FKzR06L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: SEARUB",
            "link": "https://www.amazon.com/SEARUB/b/ref=bl_dp_s_web_121175808011?ie=UTF8&node=121175808011&field-lbr_brands_browse-bin=SEARUB"
        },
        "brand": "SEARUB",
        "merchantInfo": "JOYONLY",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 6,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 6 hrs 47 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Laundry Detergent Liquid Dispenser:The Laundry Liquid Dispenser is a must-have accessory for any laundry room.Equipped with a 1/2 gallon bottle,a Bamboo Tray, two pump heads, a set of waterproof labels and a funnel. It allows you to store and dispense your laundry detergent, fabric softener, or other cleaning solutions in a neat and organized manner.",
            "Fabric Softener Dispenser: This versatile laundry dispenser is not limited to laundry liquids alone. It can also be used to store and dispense fabric Softener, dishwashing detergents,liquid soap, dish soap, lotion, aromatherapy essential oil blends, shampoo, body wash, hand sanitizer and much more.A large capacity helps to avoid frequently refilling the bottle.The transparent design lets you see the liquid level, so you'll know when it's time for a refill.",
            "Precise Dispensing: The laundry soap dispenser for liquid detergent features a durable pump mechanism that ensures precise dispensing every time.We designed the detergent container bottle with lock-down pump to protect laundry detergent or fabric softener from dripping or spilling.With just a simple press, you can dispense the perfect amount of liquid directly into your washing machine or measuring cup, eliminating any guesswork or wastage",
            "Durable and Long-Lasting Liquid Detergent Dispenser: Made from high-quality PET, BPA-free materials, this detergent dispenser for laundry room is built to last. It can withstand regular use without cracking or leaking, ensuring that your laundry room stays clean and mess-free.Say goodbye to bulky detergent bottles cluttering your laundry area. The compact and sleek design of the dispenser bottle allows you to maximize your storage space, making it ideal for small laundry rooms or apartments.",
            "Stylish and Functional: The Empty Laundry Liquid Dispenser adds a touch of elegance to your laundry area with its modern and minimalist design. It complements any decor style and enhances the overall aesthetics of your space while serving its practical purpose.This vintage style liquid soap dispenser complements your home, kitchen and bath decor, whether shabby chic, farmhouse, industrial loft or ultra-modern."
        ],
        "description": "Introducing our exquisite Durable and Recyclable Laundry Soap Dispenser. Crafted with precision and care, this dispenser offers a range of remarkable features that will elevate your laundry experience to new heights. DURABLE LAUNDRY DETERGENT LIQUID DISPENSER Embracing innovation, our dispenser is meticulously crafted from high-quality PET, BPA-free material. Unlike glass or metal alternatives, our dispenser is resilient to rust and breakage, ensuring its longevity. Plus,our laundry detergent storage container bundle includes a genuine bamboo tray. THOUGHTFUL PUMP DISPENSER DESIGN Say goodbye to messy spills and wasted detergent. Our dispenser boasts a lock-down pump mechanism, expertly engineered to prevent dripping and spilling. With this thoughtful feature, you can effortlessly dispense liquid without any unnecessary waste, ensuring every drop of your cherished laundry detergent or fabric softener counts. GENEROUS CAPACITY FABRIC SOFTENER DISPENSER Designed with your convenience in mind, our detergent dispenser flaunts an impressive 2000ml capacity. Bid farewell to frequent refills and embrace the luxury of ample storage.Not only will it enhance the aesthetics of your laundry area, but it will also ensure clarity and organization. LAUNDRY ROOM ORGANIZATION JARS Embrace versatility with our laundry soap dispenser. It effortlessly adapts to your ever-changing needs. Utilize it as a liquid laundry detergent dispenser, fabric softener dispenser, hand soap dispenser, dish soap dispenser, or even more. PACKAGE INCLUDES 2 x half gallon(2l) empty bottle. 1 x bamboo tray. 2 x pump heads. 1 x set of waterproof labels. 1 x collapsible silicone funnel. Indulge in the exquisite craftsmanship of our laundry containers for organizing. Uniting durability, functionality, and aesthetic appeal, this dispenser transcends the ordinary, bringing a touch of elegance to your laundry room. Experience the epitome of convenience, practicality, and style – a testament to our unwavering commitment to excellence.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Laundry",
                "link": "https://www.amazon.com/Laundry-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15356111"
            },
            {
                "name": "Laundry Detergent",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17572415011"
            },
            {
                "name": "Liquid Detergent",
                "link": "https://www.amazon.com/Liquid-Laundry-Detergent/b/ref=dp_bc_aui_C_5?ie=UTF8&node=15342931"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "10.2\"L x 4.5\"W x 4.5\"H"
            },
            {
                "name": "Item Weight",
                "value": "2.14 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0C7MHG2MS"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 6 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#495,173 in Health & Household (See Top 100 in Health & Household) #2,446 in Liquid Laundry Detergent"
            },
            {
                "name": "Date First Available",
                "value": "June 10, 2023"
            },
            {
                "name": "Color",
                "value": "Transparent"
            },
            {
                "name": "Material",
                "value": "Bamboo"
            },
            {
                "name": "Brand",
                "value": "SEARUB"
            },
            {
                "name": "Number of Sets",
                "value": "1"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kimberly D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELNY52KMV4TJOCZKAJSKWXEWPRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO7PJRNZT7AQZ?ASIN=B0C7MHG2MS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Overall good",
                "reviewText": "One of the bottles arrived in with a dent at the top side but the dent would pop in and out. It was not cracked. The pumps are nice. It came with detergent and laundry sticker labels. I was hoping it came with shampoo and conditioner labels but did not. The bamboo tray is my favorite part of the set. Overall it’s a good product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Xraytechie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHU6WCHB32TSKA7N3VZ367L3RHWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RQLV4OLYQM93?ASIN=B0C7MHG2MS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "4.0 out of 5 stars Great Products-Labels Useless",
                "reviewText": "I liked the tray, cup, funnel and bottles, they are half gallon bottles, smaller than I expected, but still a nice size. However, the labels they added were useless to me. I was looking for a bleach label and a sanitizer label. Or a blank one, and I can add sanitizer. But there were 3 detergent labels and 3 softener labels. That was disappointing, but not enough to return the whole set. I will probably just use my label maker to put over it but that's a hassle, I may just go with the detergent and softener labels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danielle ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF57IYVEBOKJOFUG4EYK2UUXZGAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JCYZTYMLRP65?ASIN=B0C7MHG2MS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Work Great!",
                "reviewText": "These bottles work great. I like how they came with stickers for the bottles. They look really good in my laundry room.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Davis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3GXVLE33OEYTTJEYBLOVBW2DLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CDQVTCC8XXLC?ASIN=B0C7MHG2MS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy and convenient",
                "reviewText": "Love the pumps it comes with makes it easy and convenient to use especially when you can only use one hand!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}