{
    "remaining_requests": 25187,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Eco-Squares-detergent-technology-efficiency-Unscented/dp/B0BRFL6KQN",
    "body": {
        "name": "Eco-Gals Eco-Squares laundry detergent sheets with zero waste dry soap technology for cleaning linen and clothes in regular and high efficiency top or front load washing machines, Unscented",
        "price": "$13.29$13.29 ($0.22$0.22 / load) $12.59$12.59 ($0.21$0.21 / load)",
        "originalPrice": "",
        "rawPrice": 13.29,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Eco-Squares-detergent-technology-efficiency-Unscented/dp/B0BRFL6KQN",
        "soldBy": {
            "sellerID": "A27S05ZPR1TTIF",
            "name": "Silver Maple Mercantile",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A27S05ZPR1TTIF&asin=B0BRFL6KQN&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BRFLHSQL"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BRFL6KQN",
                "variationName": "Scent",
                "variationValue": "Scentless",
                "price": "$13.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BRFJ7QL2",
                "variationName": "Scent",
                "variationValue": "Lavender",
                "price": "$13.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41n8 7JBFRL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41FBtT1bMTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rGNO1oQaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419MpxFUF-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51B9juH15LL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Uh4LPdnXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jw1o-9sZL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the ECO-GALS Store",
            "link": "https://www.amazon.com/stores/Eco-Gals/page/489B4C4D-B4C7-45B7-83E0-F3C358236BDF?ref_=ast_bln"
        },
        "brand": "Eco-Gals",
        "merchantInfo": "Silver Maple Mercantile",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 35,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 8 hrs 56 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 8 hrs 56 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Compact by Design (Certified by Amazon) products remove excess air and water, which reduces the carbon footprint of shipping and packaging."
        },
        "features": [
            "Imagine a fresh, clean closet of clothes that are ready to wear. They are wrinkle free, have the perfect scent, and are looking expensive and new. That is the power of Eco-Squares. Our natural laundry detergent formula contains powerful cleaning agents that get your clothes like new.",
            "Eco-Squares are the most efficient laundry sheet out there. A concentrated, plant based, dry soap strip, Eco-Squares are over 34 times lighter that a gallon of generic liquid detergent, making Eco-Squares easy to travel with. Plus we use zero plastic in our packaging so that you can rest easy knowing you are getting an environmentally friendly product that is biodegradable.",
            "Get your laundry the refreshing care it needs, and delight yourself at the same time with our genuine lavender scented sheets. Looking for something with a low odor? No worries, we offer unscented sheets as well so that you can feel clean.",
            "What kind of washing machine do you have? Eco-Squares are best because their super concentrated formula makes them compatible with High Efficiency (H.E.) washers as well as front loading and top loading machines. Eco-Squares are all about making your life simple.",
            "At Eco-Gals, we create cleaning supplies that people love. Since 2019, we have created many different cleaning products from washing machine cleaner to dishwasher and disposal cleaner. Check out our Amazon store to see all of our great home essentials!"
        ],
        "description": "One gallon sized bottle of detergent can weigh up to 9 pounds and carry a lot of plastic. When we thought of creating an eco friendly laundry detergent, we wanted a product that would be light weight, efficient to ship, and a detergent that people would fall in love with. After some trial and error we came up with a product that is 34 times lighter than traditional detergent containers and contains zero plastic. In the process we also made it easier to use without having to measure anything in a plastic cup. We recognized people's need for fragrance free and made that an option from the start in addition to our classic lavender scent. Each box of Eco-Squares comes with enough strips for 60 loads. Eco-Squares are vegan, cruelty free, and not tested on animals.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Laundry",
                "link": "https://www.amazon.com/Laundry-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15356111"
            },
            {
                "name": "Laundry Detergent",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17572415011"
            },
            {
                "name": "Liquid Detergent",
                "link": "https://www.amazon.com/Liquid-Laundry-Detergent/b/ref=dp_bc_aui_C_5?ie=UTF8&node=15342931"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 6.61 x 5.28 x 1.06 inches; 3.84 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 31, 2022"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Eco Gals"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0BRFL6KQN"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#244,448 in Health & Household (See Top 100 in Health & Household) #1,308 in Liquid Laundry Detergent #10,168 in Climate Pledge Friendly: Health and Household"
            },
            {
                "name": "#10,168 in Climate Pledge Friendly",
                "value": "Health and Household"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 35 ratings"
            },
            {
                "name": "Brand",
                "value": "ECO-GALS"
            },
            {
                "name": "Item Form",
                "value": "Sheet"
            },
            {
                "name": "Scent",
                "value": "Scentless, Fragrance Free"
            },
            {
                "name": "Unit Count",
                "value": "60.0 Count"
            },
            {
                "name": "Material Type Free",
                "value": "Unscented"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ms. Beck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY53QMCDVUGELWGYMO4IZ77CJFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZUXF8P54QRLW?ASIN=B0BRFL6KQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful",
                "reviewText": "Dissolves completely. I love ecos as I have a skin problem and fine its one of the few detergents that I don't breakout with",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHADJSRUE74DK62OFVU463HB4STA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N5HX7N9HLL1E?ASIN=B0BRFL6KQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Gentle Scent",
                "reviewText": "I've ordered this product a few times already, and I'm impressed with the quality.The price is good and its easy for our kids to use as well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Texas Shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP2DBUOPFQXYAITDH3ZYLXJ6ZYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZV35I5UUMWEC?ASIN=B0BRFL6KQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Work well and the scent is lovely",
                "reviewText": "These Eco-Gals laundry detergent sheets work well to clean my laundry. The lavender scent is great when you open the box, but after washing, the scent is somewhat faint although the clothes do smell fresh and clean. No matter what detergent I use, I have found that dryer sheets provide the main source of scent for my clean laundry, so I am not bothered that this detergent's scent is faint after washing. The detergent sheets are small but mighty as far as cleaning goes. The directions say to place a sheet inside the washer tub with your clothes, and that works well to dissolve the soap and clean the laundry. I have a top-loading washing machine with a little pull-out soap dispenser drawer, and by habit did a few loads of laundry by placing the detergent sheet in the dispenser, and that worked fine, too. Either way, the sheet quickly and fully dissolved and there were no traces of it left in my machine, in the dispenser, or on my clothes.I love that these detergent sheets are so small and there's no ugly red plastic jug cluttering up my laundry room, and no worry of the trash a big plastic jug puts out into the world. The little paperboard box these come in is easy to fit in a drawer or cabinet and doesn't take up much room at all. The box is incredibly lightweight and small compared to a large and heavy jug of liquid detergent. These sheets would be perfect for someone in a dorm or apartment who has to take their laundry and supplies to a laundry facility since the box is so lightweight and small. Plus they work great, so there's that, too.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vorpal hamster",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGBHPAXKU6OS7SM3I33SO5FSMPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FMDQI9HVF9M6?ASIN=B0BRFL6KQN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 15, 2023",
                "reviewTitle": "3.0 out of 5 stars half the size is not double-strength",
                "reviewText": "I've been using laundry sheets for a couple years now in my front load HE machine. A typical load for me is two pairs of jeans, a set of pajamas, 3 t-shirts, 2 pillow cases and 1 towel, along with asst underwear/socks/hand towels/wash cloths/etc. Basically a 'medium' load that I wash on cold. I typically use a whole 'regular' sheet and I'm used to seeing a small amount of suds on the door during the wash cycle.I read this box and interpreted it as each half-size sheet being the strength of a whole sheet for another brand. This is not true. They are simply half-size sheets. I washed a normal load that had a rag which I had mopped up a coffee spill with and it was still brownish and smelled of coffee after it was washed and dried. I rewashed it using two half-sheets in the next load and it came clean the second time.If you wash a lot of little loads then it is convenient to not have to rip a full-size sheet in half, but these are not as cost effective as the full-sized sheet brands because there are only 60 sheets, which is 30 loads. My preferred brand will do 50 loads.They are unscented. The box is a little stubborn to slide open.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dana O.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2KLPAOGCE3J46AJXOJBOGD6WRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22JD1C9FLXM4P?ASIN=B0BRFL6KQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Compact and lightweight, cleans well too",
                "reviewText": "I really love laundry detergent sheets. They are so much easier to use and they aren't heavy and take up a lot of space. These work great in my top loading washing machine. The lavender scent is not heavy. I am one who doesn't really like unscented laundry detergent because I like to smell something when I open the washing machine lid and smell a clean scent. Whenever I use unscented, I wonder if anything happened in there. This is especially true because my washer has a tank to fill with liquid laundry detergent, and I'm never really sure if it dispenses anything unless I can smell it. Anyway, this sheet detergent is great for travel and I always pack some of this stuff when I go on any trip just in case.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nayseal Graziano ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA257VHHK4QRB5H3TFKUVKOSDIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A0UII7TNRH7H?ASIN=B0BRFL6KQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Eco Squares laundry detergent",
                "reviewText": "I did not think I would like this detergent however I do. I have done two loads so far and pleasantly surprised. I don’t think though that for the laundry I do for boys I square is good I have been using two per load. I love the lavender scent it’s light but not overbearing so if you are into heavy scented clothes it may not be what you like. I like there is no mess, no waste and my clothes are clean. 👍🏽👍🏽👍🏽👍🏽👍🏽",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ZbornakAttack",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEA3JWIEZIY53X7BLBEJ4P4IYF7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RCHLLRETFT43?ASIN=B0BRFL6KQN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Does the Job, Weak Scent",
                "reviewText": "These laundry sheets are a nice option to save space, reduce environmental waste, and wash your clothes without lingering irritants. The quick synopsis: the smell great in the box and even in the water, but the scent was non-existent when they came out of the dryer. This isn't a bad thing, but worth noting.To give an idea of this wash process, I used 1.5 sheets for a dirty large load (dirty in the sense that clothes had actual dirt from gardening and definitely full day of sweat and grime). I figured this was a great test for this product. I did not any additional products that I normally would (vinegar, fabric softener, etc) in order to truly test the effectiveness of the product. The clothes definitely came out clean but as mentioned, did not have any added clean scent. This alone is the reason I gave it 4 stars. If the scent wasn't going to be there in the end, no need to really bother including it at all in the product. If this matters to you, this can be overcome by adding your own scent boosters.On a side note, these are SUPER travel friendly if you're looking for an option to do a quick handwash of bathing suits, underwear, etc when traveling.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}