{
    "remaining_requests": 43785,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/RAM-Quick-Grip-Phone-Holder-Ball/dp/B07V6ZS2HG",
    "body": {
        "name": "RAM Mounts Quick-Grip XL Phone Holder with Ball RAM-HOL-PD4-238AU with B Size 1\" Ball",
        "price": "$26.99",
        "originalPrice": "$33.05",
        "rawPrice": 26.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/RAM-Quick-Grip-Phone-Holder-Ball/dp/B07V6ZS2HG",
        "soldBy": {
            "sellerID": "A12YZTIFC29MMB",
            "name": "RAM MOUNTS",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A12YZTIFC29MMB&asin=B07V6ZS2HG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B7VM5RSV"
        ],
        "asinVariationValues": [
            {
                "asin": "B07V6ZS2HG",
                "variationName": "Style",
                "variationValue": "Large Phones",
                "price": "$26.99",
                "variationImageURL": ""
            },
            {
                "asin": "B01N6L600S",
                "variationName": "Style",
                "variationValue": "Small Phones",
                "price": "$24.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41S3098RSqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41cXX 67WcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51WuoCCCbaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413AaQgdwiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FeEpXNmtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41N8tIs6Z-L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81gHb25EFuL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81gHb25EFuL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the RAM MOUNTS Store",
            "link": "https://www.amazon.com/stores/RAMMounts/page/46B7427E-6C9D-48FB-ACEE-C3973B91DD65?ref_=ast_bln"
        },
        "brand": "RAMMounts",
        "merchantInfo": "RAM MOUNTS",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 3274,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 13. Order within 1 hr 2 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Product Type: Powersports Vehicle Part"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "GPS System Accessories",
                "link": "https://www.amazon.com/GPS-System-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=559942"
            },
            {
                "name": "Vehicle Mounts",
                "link": "https://www.amazon.com/GPS-Vehicle-Mounts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=764574"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5 x 5 x 5 inches"
            },
            {
                "name": "Item Weight",
                "value": "5.8 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07V6ZS2HG"
            },
            {
                "name": "Item model number",
                "value": "71-7153"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 3,274 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7 in GPS Vehicle Mounts"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Special features",
                "value": "Warning: Exposure to vibrations, like those generated by high-powered motorcycle engines, might impact iPhone cameras., Assembly Hardware Included"
            },
            {
                "name": "Other display features",
                "value": "Automotive Parts and Accessories"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Whats in the box",
                "value": "Assembly Hardware"
            },
            {
                "name": "Manufacturer",
                "value": "RAM MOUNTS"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Date First Available",
                "value": "October 29, 2019"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "This version of the spring-loaded RAM Quick-Grip holder provides a secure fit for a variety of large phones and other devices. The adjustable side keepers ensure that devices like GPS units and Bluetooth speakers within the listed compatible dimensions will also fit in the holder. Included is a RAM diamond ball base featuring a B size ball and hardware.",
                "media_link": []
            },
            {
                "media_text": "Technical Specifications Part Number RAM-HOL-PD4-238AU Hardware Included Assembly Hardware Holder Dimensions Height Range: 5.75\" - 7.25\", Width Range: 2.625\" - 3.625\", Max Depth: .72\" Ball/Socket Size B Size (1\") Weight Capacity Standard Use: 2 lbs, Heavy-Duty Use: 1 lb Materials Marine-grade aluminum, High strength composite Packaging Type Poly Bag Weight 0.4 lbs.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/75f22ca4-6c7c-47d1-a8d6-54f1dccafaae.__CR0,0,1920,576_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d59ebba2-b357-439b-9fe8-e648630a7659.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CCCL350",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWZE5LGZEF6Q6TJC2LJKOSKIWQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12HCRY8R1BQ9U?ASIN=B07V6ZS2HG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Trucking Companion That Delivers - RAM Mounts Quick-Grip XL Phone Holder",
                "reviewText": "As a trucker who spends countless hours on the road, the RAM Mounts Quick-Grip XL Phone Holder with Ball RAM-HOL-PD4-238AU has become an indispensable part of my journey. This phone holder isn't just a tool; it's a reliable ally that combines ruggedness, adaptability, and practicality.From the moment I unboxed the Quick-Grip XL, I could tell it was built to withstand the rigors of trucking life. The B Size 1\" Ball, a symbol of RAM Mounts' reliability, guarantees a secure attachment to various mounts, providing unwavering stability even on the bumpiest roads.The design of the Quick-Grip XL speaks to truckers' needs. The adjustable arms with rubberized grips securely cradle my phone, regardless of its size. What sets this holder apart is its ability to accommodate various phone dimensions. Whether I'm using a smaller device or a larger smartphone, the Quick-Grip XL ensures a snug fit, making it an excellent choice for truckers who use multiple devices.The quick-release mechanism is a game-changer during my long hauls. I can effortlessly mount or dismount my phone with one hand, a crucial safety feature when navigating unfamiliar routes. The 360-degree rotation adds to the convenience, allowing me to position my phone exactly where I need it for navigation, hands-free calls, or music control.On the road, the Quick-Grip XL stands firm. It's reassuring to know that my phone remains securely in place even during tight turns or sudden stops, ensuring minimal distractions and helping me maintain my focus on the road ahead.Whether I'm following GPS directions, managing calls, or simply keeping up with communication, the RAM Mounts Quick-Grip XL Phone Holder has become an invaluable companion in my truck. Its robust construction, versatility, and user-friendly design make it a top-tier choice for truckers seeking a reliable and adaptable phone holder. With the Quick-Grip XL, RAM Mounts has truly delivered a superior tool tailored to the needs of truckers like me.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ptkid2",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCYGWSMMXYVKRQUQK3U256DTVVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HZ2H4CGORW64?ASIN=B07V6ZS2HG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2021",
                "reviewTitle": "5.0 out of 5 stars There's nothing better out there",
                "reviewText": "Bought the Quick-Grip for an S20 FE. I also have an X-Grip, bought a couple of years ago for another phone. I find the Quick-Grip far more secure for car or bike installation, and the X-Grip better for holding my phone on my desk, for example when making video calls, reading instructions when I needed both hands, etc. I reviewed the comments in depth before buying the Quick-Grip, and I'll address what I found myself now that I have one.Material and assembly: This is not cheap construction. I have been using Ram mounts for GPS units for years and none have broken or given me trouble. The materials are strong, and if you are breaking it during assembly or use, you are using too much force. Mine came with multiple length screws for assembly, so you will be able to adjust for your situation. I used the medium length screws so that the jam nuts were secure but the screws did not extend beyond the back of the case when assembled, for the ball and the side arms. Assembly was intuitive. Some may want more explicit instructions, but the pictogram instructions where more than enough for this simple product.Usefulness: The Quick-Grip is definitely more secure than an X-Grip in any vibration environment. The spring is quite strong, but I have no problem installing or removing the phone with one hand. Hook your index finger on a side support arm then press up and out on the bottom/center of the phone with your thumb. You do have to be careful or you might drop the phone when the bottom pops out of the case, but it's a learning experience and easy to do once you get the hang of it. Because the side arms have multiple slots you can choose for assembly, I have access to all screen functions, fingerprint sensor, side buttons and the charging port. The camera still works with one exception. Because of the multiple camera lenses, at 1X or greater, the camera works fine. At 0.5X (zooming out), there is a slight dark area at one edge of the image because of the wide angle view. Not an issue for me. My phone is mounted for ease of access to the phone functions, maps, navigation, etc, and not for photography. The X-Grip would be my choice if I wanted a mount just for photography. My older phone with a different camera layout works fine in the Quick-Grip. I think there was a review where someone had modified the Quick-Gripfor their needs. I don't see why this can't be done without compromising the integrity if that's what you want to do. I'm happy with it as is.Overall, the Quick-Grip is a great holder.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DarthfinkDarthfink",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH42UL6L4XKKQFXD7CS2J5KRLRVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36M7NR2SLM9RJ?ASIN=B07V6ZS2HG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Holds my 23 Ultra W Otterbox",
                "reviewText": "Experience the durability of this Ram Mount product – reminiscent of my decade-old Ram Mount laptop mount. Quality craftsmanship shines through, proving that corners were not cut in its construction.Rest assured, once your phone is snug in the mount, it's practically immovable – a steadfast companion in any journey.Even with a popsocket-clad case, the phone finds a secure home in the holder after a socket detachment – a feat that's nothing short of remarkable, especially for those acquainted with the bulk of Otterbox and popsocket combos.Opting for a size B ball, you'll be pleasantly surprised to find screws long enough to accommodate a size C attachment, catering to diverse mounting needs.For those requiring size C compatibility, the part number to remember is RAM-238U. Meanwhile, the B size mount can be identified by Part#:RAM-B-238U. Elevate your mounting game with these reliable Ram Mount solutions.Important note: This phone mount doesn't work solo – you've got to pair it up with a mounting solution.Here are a few options.1. **RAM Suction Cup Mount with 12\" Flex Arm** - Part#: RAP-105-12D224U2. **RAM Handlebar U-Bolt Mount** - Part#: RAM-B-149ZU-COr, if you're vibing with my choice:3. **RAM Pod™ I Vehicle Mount with 18\" Rod and Socket Arm** - Part#: RAM-B-316-1UChoose your mounting adventure wisely!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ZnDIXwQ7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "DeanDean",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW4S44JSSJVZGLEC5X74V5VTC3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BRQE1QDJCT00?ASIN=B07V6ZS2HG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars great product!",
                "reviewText": "Great product. very secure and easy to remove and install phone. great adjustability. I put these on several of my bikes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zTJo-LiBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81dojM3YwzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 15, 2022",
                "reviewTitle": "La mejor opción para sujetar tu celular",
                "reviewText": "Tengo un iphone 11 pro con funda plástica. Compré este accesorio después de haber usado el XGRIP, porque el xgrip no era nada práctico para usar en mi moto. Este es robusto, de fácil instalación y pones y quitar el celular con mucha facilidad y rapidez. El accesorio sujeta muy bien el celular, veo muy difícil que se pueda caer.Sin duda la mejor opción de RAM.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Larry Roes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 3, 2022",
                "reviewTitle": "Excellent!!",
                "reviewText": "Mounted on my motorcycle handlebar and the mount was perfect for my Galaxy S10. No concern with the quality of the product and all features of the phone are available. Great deal of adjustment possible so many cell phones should fit. Self locking screws will prevent loosening of the fingers. This is a good product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on February 6, 2024",
                "reviewTitle": "Great piece of kit",
                "reviewText": "Best generic holder I've had, nice to be able to place the side arms in the best position so they don't interfere with the phone buttons.I trust RAM quality over the rest of the competition,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ram Quick Grip XL Phone holder is not compatible for iPhone, hence needs refund so that I can purchase some other product ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 2, 2023",
                "reviewTitle": "Compatibility issue",
                "reviewText": "This product is not compatible for iPhone",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Geoffrey John Stewart",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 14, 2023",
                "reviewTitle": "Easy to install",
                "reviewText": "Sturdy piece of kit and holds the phone securely. Not sure if it would be any good on long trips with your phone as a GPS as there is no vibration damper with the kit.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$35.09",
                "sellerName": "Performance Pros",
                "sellerRating": "4.5"
            }
        ]
    }
}