{
    "remaining_requests": 43673,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ram-Zodiac-Occult-Serial-Thriller-ebook/dp/B01BCXHRCM",
    "body": {
        "name": "The Ram: Cycle 1 of The Blood Zodiac (The Blood Zodiac: An Occult, Serial Killer Thriller Series)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ram-Zodiac-Occult-Serial-Thriller-ebook/dp/B01BCXHRCM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91N3PcnSE7L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Erica Crockett",
            "link": "https://www.amazon.com/Erica-Crockett/e/B00O4CUTPQ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.2 out of 5 stars",
        "customerReviewCount": 113,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "What if the question What's Your Sign? could get you killed?Myth, murder and mayhem rule in this psychological, paranormal serial killer thriller.The days of Aries have arrived.The first message is a belated birthday card. Riley Wanner ignores the strange missive from an unknown sender, instead focusing on his unraveling life. An accident has him questioning his work, relationships with women, and sordid addictions. He obsesses over a stripper to escape his miserable circumstances. But the unsettling notes keep coming. Fate plays out in the stars overhead.Peach Barrow yearns to lead a life of ritual and spirit. Stunted by self-doubt and her past, she struggles to create a new personality. An intriguing woman invades her thoughts, inspiring Peach to take daring action to change her life. However, her transformation will be anything but easy.Hidden connections simmer under lifetimes of lies. The woman they crave is one and the same. As they vie for her attention, their hometown erupts with bizarre events, strange signs and spontaneous chaos. There is no telling who will win when the game is just beginning.Some must die in order for others to thrive.Interview with the Author:Q - What can readers expect from this book and The Blood Zodiac series?A - The Ram is a fast-paced, addictive read. Fans of paranormal thrillers, psychological suspense, crime thrillers and occult fiction will be hooked from the start. If serial killer novels are your thing, look no further. The first book establishes the dark and disturbing worlds of the main characters and the subsequent books will delve deeper into ritual magic, astrology, the zodiac and god and goddess mythology.I've been working on this series for the past three years and it's finally ready for the world. I can't wait for people to live vicariously through the wild world of my strong female, Peach, and my flawed alcoholic, Riley. I'm excited for readers to meet a true zodiac killer! Q - Is it true there will be twelve books in the series? Do they have an order?A - Yes, there will be twelve books, to mirror the traditional twelve zodiac/horoscope signs. I will release a book every three months, so readers can enjoy the story without waiting years between releases. The books must be read in order, just like watching an episodic television show. The Ram starts it all off during the Aries cycle. The Bull, the second in the series, will be released in June 2016.Q - Why should people give this series a chance?A - Because The Blood Zodiac promises to keep you awake at night, turning pages and wondering which character is the craziest and who holds the cards. Secrets will come to light and jaw-dropping twists and events are guaranteed. You'll never look at astrology, metaphysics or serial killers the same way again!The Blood Zodiac Series eBook Categories:Serial Killer NovelsPsychological SuspenseAstrology FictionOccult SuspenseParanormal Mystery Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B01BCXHRCM"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Corvid Tear Media LLC; 1st edition (March 23, 2016)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ March 23, 2016"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 937 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 306 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#33,389 Free in Kindle Store (See Top 100 in Kindle Store) #30 in Occult Suspense #55 in Mythology (Kindle Store) #9,595 in Nonfiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.2 3.2 out of 5 stars 113 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "bethcross",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUUXVP6GQOMZ5R6P5K25DP4EFFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8N0XHTMKOUMZ?ASIN=B01BCXHRCM",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2016",
                "reviewTitle": "3.0 out of 5 stars In the Beginning. . .",
                "reviewText": "I have to agree with other reviewers, this is certainly setting itself up to be an ambitious work. It is also intriguing - so much so that I immediately purchased the second book.So, why only 3 stars? Because 5 star books are pretty much unforgettable classics of their genre, 4 stars are getting close.This book, for all of its well-thought out plan lacks the execution and polish of a higher rating. The storyline literally doesn't start rolling until the last 4 pages of Cycle 1. Fine with me, because I'm a dedicated reader. However, this could cause others frustration and they might not give the series the chance it deserves.For all but those last few pages, this book reads like a fever dream, weird images and events piling onto each other. This is not a bad thing - it's what prompted me to go ahead and purchase Cycle 2.Still, the pace is slower than I expected. The writing in parts is clunky and awkward. There is a tendency to misuse \"whom\" in places. Like all indie pubs (and all books I've read in the recent past), it needs better editing. Where are all the editors? Someone should do an expose on their disappearance.One indie series I started reading started with a 5-star bang and then dwindled to 2 by the end of book 4 and my following of it. Though this series starts with 3 stars, I fully expect it to rise as it goes along.True rating: 3.5 stars",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Thorne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV34GEB4O56NSQMEHKCWHNHN4VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI9FQQN4UYMS3?ASIN=B01BCXHRCM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2016",
                "reviewTitle": "4.0 out of 5 stars A Chilling Beginning to an Ambitious Series",
                "reviewText": "The Ram is the start of an ambitious twelve-part series, patterned after the mythology of the Zodiac. It is a dark tale, intended for mature readers, for its language, adult themes, sexual situations, and graphic violence. The writing is careful and beautiful as the two central characters--the story alternates between their perspectives--explore their separate identity crises.On one side we have Riley Wanner, a former lawyer, who at the start of the novel has a job in an industrial plant. An accident which leaves him injured prompts him to make some changes in his life. Feeling less a man after the accident, he obsesses about an exotic dancer and feels that seducing her will help him hold onto his masculinity. In the meantime, someone has set a site on him, sending him a series of ominous cards in the mail.On the other side of the story, Peach Barrow, a young social worker, decides that she must undergo a transformation, signaled first by the shaving of her hair. From the beginning I suspected there was something sinister about this change. Erica Crockett has the gift of careful, detailed description, and when she applies this talent to such subject matter, the result is dark and eerie. In her quest for self-realization, becoming \"Perfect Peach,\" Peach also latches onto the same dancer that Riley's targets.So who is this dancer? Does Riley connect with her? Or does Peach? What's up with the strange cards? How do all these seemingly disparate elements intersect?Throughout the story Erica Crockett also carefully lays references both to the biology and mythologies surrounding rams. The greatest image is lambs used as sacrifices--which leads to the final chilling scene. The Blood Zodiac promises to be a grand, disturbing series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael D. Durkota",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6XV6G6PZIOIAHXVTLX6SZRXF2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G6YK5EK7C8NJ?ASIN=B01BCXHRCM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 23, 2016",
                "reviewTitle": "5.0 out of 5 stars An enigma wrought with suspense",
                "reviewText": "I was eagerly anticipating the next offering from Erica Crockett from the moment I finished her stunning debut, Chemicals. Her latest novel, The Ram, is the first volume of The Blood Zodiac series. The series will span twelve books to cover each of the zodiac signs. A series of that magnitude is a daunting challenge that Erica is certainly equipped to meet.ramThe Ram follows the perspectives of two main characters, Peach and Riley. The intertwining of their perspectives is exhilarating and rewarding. Peach is a troubled counselor at a crossroads in her life. By choice, or by natural force, she is propelled to make changes. The internal struggle is poignant and real. The fear and apprehension is captured wonderfully in Crockett’s precise prose and imagery. Riley, an ex-attorney, is forced to make changes in his life as well. Although his change begins out of necessity, but he embraces it.Developing characters is truly Erica’s superpower. She crafts them honestly. She doesn’t judge them or sympathize with them or make excuses for them. She delivers them with clarity, their flaws revealed. The supporting cast is equally intriguing. One of my favorites was Sev, a surly bouncer with the heart of a poet. He spends his time watching his girlfriend dance and penning poems on bar napkins. The juxtaposition is sometimes ironic, sometimes comical, but always entertaining.Erica once again delivers a plot that is packed with delicious mysteries. Lambs released in the city. Symbols painted on the road. Ominous greeting cards. The birthing of a ram. A partial tattoo. A dangerous patient who mouths a cigarette, but never smokes. A stripper and her poet boyfriend. All of these are intertwined. By chance? By design? Destiny? So much to ponder.Erica also continues to deliver beautifully crafted prose that could make any writer jealous: “Riley lies back on the concrete floor and watches the chains sway overhead, a solitary link bent and open, jangling and dancing, apart from all the rest.” “She hopes the process will be invigorating, completed with aplomb, and then she will take her time getting home, simmering in the spectacular events of the evening.” “Peach is speechless and not just metaphorically.” “It is fate, meaningful in its synchronicity. Peach does not believe in coincidence anyway. Her world is one of omens and relationships, energy and connections. Causes will always have effects, but those two things can be separated by vast amounts of time and space.” “You never know when you’ll get trampled by misplaced sheep or incinerated in a vehicle.” “He shoots his arms straight into the air, clenches his fists at nothing but holds on tightly, until his nails put little crescent moons into his flesh.”Bottom line: The Blood Zodiac is an enigma wrought with suspense; it begins in spectacular fashion with The Ram. This thriller is most highly recommended.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaileigh Dorrier",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHS4TFYD7K6OSSGNX3IYBUJKAZOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV0OCRHUT5Q45?ASIN=B01BCXHRCM",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 25, 2021",
                "reviewTitle": "1.0 out of 5 stars The Ram",
                "reviewText": "Too slow of a story, I tried reading this book about 4 times before I was able to make it through.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alice G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCUQUP4C4XZ6DUXY5U5BXFA2X4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J2P5GGRDVJHQ?ASIN=B01BCXHRCM",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2017",
                "reviewTitle": "2.0 out of 5 stars disappointing characters",
                "reviewText": "Why write a book where the main characters are completely unlikeable? Rilkey and Peach are just that and they become even more unlikeable by the end of the book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon Ovaska",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM6SB5EK3CB5QWTUNO3EMSFPBQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MT8JQK3EXQD4?ASIN=B01BCXHRCM",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 30, 2017",
                "reviewTitle": "3.0 out of 5 stars Not my cup of tea.",
                "reviewText": "Though I try to find redeeming qualities in all books, I came away feeling I wasted my time with this story, and it makes me sad to turn in a bad review. It's just my opinion, and I am not trying to hurt the author. It was just so depressing and without any positive conclusion.... Sorry, thumbs down on this one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 27, 2017",
                "reviewTitle": "Ok",
                "reviewText": "It was a OK book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 28, 2017",
                "reviewTitle": "Good read",
                "reviewText": "The Ram is a story about a psychologist with issues, big issues. I won't spoil the plot but she believes the stars will help her find the person she is destined to be no matter the sacrifice. I am looking forward to reading the Bull and finding out what happens next.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 29, 2020",
                "reviewTitle": "Gripping",
                "reviewText": "Wow a great story that teases so much to get you hooked and then the book ends, leaving you wanting to read more and I will. Great book and I can't wait to find out more about the characters.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "margaret Hamilton-Adams",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 13, 2021",
                "reviewTitle": "Not my thing",
                "reviewText": "Found this book really drawn out & hard going for me personally therefore had to abort halfway through my sincere apologies to the author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}