{
    "remaining_requests": 526,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Keyboard-Universal-Keyboards-Calculators-ColorCoral/dp/B07GW9TJ3G",
    "body": {
        "name": "COLORCORAL Cleaning Gel Universal Dust Cleaner for PC Keyboard Cleaning Car Detailing Laptop Dusting Home and Office Electronics Cleaning Kit Computer Dust Remover from 160g",
        "price": "$5.98",
        "originalPrice": "$11.99",
        "rawPrice": 5.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Keyboard-Universal-Keyboards-Calculators-ColorCoral/dp/B07GW9TJ3G",
        "soldBy": {
            "sellerID": "A2RL5NIVWI06VE",
            "name": "COLORCORAL",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2RL5NIVWI06VE&asin=B07GW9TJ3G&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "Buy any 2, Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ZqEVGrmNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51NOaARmfhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FcPDEvIIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vulWHw2fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Lj4hBEiKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gl0KyXKQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Ano397qmL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the COLORCORAL Store",
            "link": "https://www.amazon.com/stores/ColorCoral/page/EB06F1DA-00B9-4D40-989C-B696A0F684B7?ref_=ast_bln"
        },
        "brand": "ColorCoral",
        "merchantInfo": "COLORCORAL",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 54468,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 23 hrs 34 mins",
            "Or fastest delivery Wednesday, February 14",
            "FREE pickup Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 12. Order within 19 hrs 34 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Universal Fit】ColorCoral cleaning gel, simple and convenient cleaning kits for PC/laptop keyboard and other rugged surface, such as the car vent, camera, printer, telephone, calculator, Instrument, speaker, air conditioner, TV and other appliances.",
            "【Safe Cleaning Gel】The keyboard cleaner gel is made from natural gel, no sticky to hands, smells sweet with lemon fragrance, no stimulation to skin.",
            "【Easy Dust Cleaning】Make sure your hands are dry and clean, knead the cleaning gel into a ball, press the cleaning gel slowly into the keyboard, car vent and rugged surface till the cleaning gel could touch the bottom and then pull out, the dust would be carried away with the cleaning gel.",
            "【Reusable】The keyboard cleaning gel could be used repeatedly till the color turn to dark or it become sticky, then you have to replace the cleaning gel with a new one. After cleaning, please stock the cleaning gel in cool place. (📌Don’t wash the gel in water.)",
            "【In the package】1* universal cleaning gel, we provide the cleaning gel with brand new, if you find the package broken, the cleaning gel dirty, or any other quality issues, please email us through message, we provide you a replacement soon."
        ],
        "description": "Multifunctional Cleaning Gel Office Dust Cleaning Every one want a tidy and clean work environment without dust problems, then you may need this cleaning gel. It will remove all the dust in your keyboard, calculator, desk and printer. Home Dust Cleaning Tired of dirts on the fan and airconditioner, the dust on your table and sofa, or the debries in your drawer? Go for your ColorCoral. Pet Hair Cleaning We all love pet, at the same time we are quite bothered with your beloved puppy or kitten hair. Now you need ColorCoral, it provided an easy way to remove these hairs, just roll around.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Cleaning & Repair",
                "link": "https://www.amazon.com/Computer-Cleaning-Repair/b/ref=dp_bc_aui_C_4?ie=UTF8&node=281501"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "COLORCORAL"
            },
            {
                "name": "Special Feature",
                "value": "Dust Cleaner"
            },
            {
                "name": "Included Components",
                "value": "Instruction Guide"
            },
            {
                "name": "Is Cordless?",
                "value": "No"
            },
            {
                "name": "Item Weight",
                "value": "0.16 Kilograms"
            },
            {
                "name": "Color",
                "value": "Yellow"
            },
            {
                "name": "Noise Level",
                "value": "80 dB"
            },
            {
                "name": "Manufacturer",
                "value": "ColorCoral"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Product Dimensions",
                "value": "2.69 x 2.69 x 2.35 inches"
            },
            {
                "name": "ASIN",
                "value": "B07GW9TJ3G"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "8541676808"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 54,468 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2 in Computer Cleaning & Repair"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Specific instructions for use",
                "value": "Personal"
            },
            {
                "name": "Mildew-resistant",
                "value": "Alcohol Free"
            },
            {
                "name": "Perfume",
                "value": "Lemon"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Surface Recommendation Laptop, Car, Computer",
                "value": "Power Source No Power"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "ColorCoral universal cleaning gel, simple and convenient cleaning kit for keyboard cleaning, car interior detailing, home and office electronic dusting, such as the car vent, camera, printer, telephone, calculator , speaker, air conditioner, TV and other appliances.Made of natural material, this cleaning gel is not sticky to hands, smells sweet with lemon fragrance, totally no stimulation to skin.Take a piece of the cleaning gel, knead it into a ball, press the cleaning gel slowly into the keyboard, car vent and other rugged surface and then pull out, the dust would be carried away with the cleaning gel.This cleaning gel could be used again and again till the color turn to dark, then you have to replace the gel with a new one. (NOTE: don’t wash the cleaning gel in water.)In the package: 1* universal cleaning gel.",
                "media_link": []
            },
            {
                "media_text": "ColorCoral Universal Dust Cleaning Gel",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/40a80256-85b2-4c92-9c01-87b5f2f54474.__CR0,0,1500,928_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Dust Cleaning Gel for Mechanical keyboards ColorCoral keyboard cleaning gel was originally designed for keyboard cleaning. Help to remove the dust, dirt, debries between the keys. Simply pick up the cleaning gel, knead it over, press it into the keyboard surface, and pull out, the dust will be carried away with the cleaning gel. For mechanical keyboards, all you need is press a little harder.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/e750cf00-8774-45f6-a0a3-f38583236c96.__CR0,0,1529,1529_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Universal Cleaning Kits for Car Interior Dust Removing There are always some blind corners in your car that can't be cleaned with a traditional wipe. ColorCoral cleaning gel will help you out on this, it could reach the dust in vent, dashboard and cup holders easily. And as we have updated our formula accordingly, ColorCoral now works much better in car cleaning.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/52cda970-e8f5-48ae-b6d0-ae48de954858.__CR1,0,999,999_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Multifunctional Cleaning Gel Office Dust Cleaning Every one want a tidy and clean work environment without dust problems, then you may need this cleaning gel. It will remove all the dust in your keyboard, calculator, desk and printer. Home Dust Cleaning Tired of dirts on the fan and airconditioner, the dust on your table and sofa, or the debries in your drawer? Go for your ColorCoral. Pet Hair Cleaning We all love pet, at the same time we are quite bothered with your beloved puppy or kitten hair. Now you need ColorCoral, it provided an easy way to remove these hairs, just roll around. Provided by ColorCoral Universal Dust Cleaning Easy to Use Repeatedly Used No Stimulation",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/50b1c908-cda0-4385-9f0c-b6239025daa9.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Name Universal Dust Cleaning Gel Brand ColorCoral Net Weight 160g Package Sealed Package",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A2RL5NIVWI06VE/1f9cc41c-1782-48a8-a132-83f8c7ed8e3d._CR0,11,900,270_PT0_SX600__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/40a80256-85b2-4c92-9c01-87b5f2f54474.__CR0,0,1500,928_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/e750cf00-8774-45f6-a0a3-f38583236c96.__CR0,0,1529,1529_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/52cda970-e8f5-48ae-b6d0-ae48de954858.__CR1,0,999,999_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/50b1c908-cda0-4385-9f0c-b6239025daa9.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6UKB3ZE5CHFSGISEFHDK6VILCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT1QT0FXINLML?ASIN=B07GW9TJ3G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Surprisingly good product",
                "reviewText": "This stuff works surprisingly well. I don't know how long it will last; I don't know when it's time to throw it out; and I don't know for sure if it's leaving any kind of residue. It doesn't seem that it is but I'm just not certain. But it cleans really well!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JenBen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMY3DAQOVKZ4TGSNYFZZX33T5SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1204Y3SQM3561?ASIN=B07GW9TJ3G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 6, 2020",
                "reviewTitle": "4.0 out of 5 stars EDITED REVIEW - Do yourself a favor and buy this, but replace often",
                "reviewText": "EDITED REVIEW on 6/24/2020 - About two months have passed since I purchased this product and I am changing my review from 5 stars to 4. After about a month, it seems like the integrity of the product began to decrease. Where previously the goop would tend to stay in a ball shape (unless intentionally stretched), after a month or so of use it feels more \"liquid-y\" and leaves sticky residue behind. Now I am cautious when using it on my keyboard because it has left little sticky blobs behind. SO, this product works great at first, but after you open it the lifespan of the product is about a 4-6 weeks before it starts to be more of a hassle to use. Since there is no way to clean this stuff, you'll have to throw it away and get a new one. I wish the lifespan of the goop was longer.This stuff has literally changed how I clean my desk and keyboard. I used to use a combo of canned air (not always very effective) and a Swiffer, but even still the dust would just blow up in the air and then resettle on my keyboard again later. This stuff reminds me of the slime that kids are really into playing with right now, but it's not really sticky in a tacky way, so it doesn't leave any residue behind. I can squish this in between my keyboard keys and get out all of the cat hair and crumbs.(I probably would not use this if I had to deep clean my keyboard because some of the goopy stuff might get stuck under the keys.)this stuff is nice because it also doesn't really have a noticeable smell, so after handling it your hands and desk don't have a chemical smell.if you have a dusty office or cats that like to shed in the keyboard, this product will change your life. It'll make cleaning the keyboard kind of fun instead of a gross task. I will definitely be buying more of this stuff around Christmas time for my coworkers.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B Harbour",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXFADZ77JUBYVQMN6UCMHU4MWCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PUIOFZKYL07Y?ASIN=B07GW9TJ3G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2023",
                "reviewTitle": "5.0 out of 5 stars a game changer for cleaning crystal clusters and rough stones",
                "reviewText": "This stuff is genius. I have a quite large collection of crystals and many of them are incredibly hard to clean thoroughly - regular dusting is rarely sufficient and many are not suitable for cleaning in water and, even with those that are, it's still hard to get into all the cracks and crevices of clusters and then there's the drying time. I've also tried hand vacs and blow dryers with super long cords - again, not at all ideal. I saw this product and immediately thought of my collection and I wasn't wrong. I felt like Handel's Hallelujah Chorus should have been playing when I first used it on my sphalerite and rough azurite/malachite pieces. Just genius! And with quartz clusters it is, obviously, perfect. I will say that it does stick a bit occasionally, but that it's easy to get it to pull off. It also needs to be replaced relatively frequently during cleaning sessions (a palm sized piece will only go for 3 or 4 large trays), but it's cheap enough that I don't care. And, clearly, there are some stones I am hesitant to use it on, such as astrophylite or thomsonite with mesolite needles - anything with very delicate parts that could be dislodged, although, I will say that I have used it very gently and successfully on some of my astrophylite pieces. But, in the end, what matters is that I've finally found something that works.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SMTSM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBNKFQ7CPY23QNLE74G2E4BMNMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22QI788NAS9FG?ASIN=B07GW9TJ3G",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "3.0 out of 5 stars Doesn't clean well in the corners",
                "reviewText": "I had high hopes for this. I had a lot of sand in my center console, and thought this would pick it right up. It did on the flat surfaces, but where the \"wall\" meets the \"floor\" of the compartments, it only got about 80%, and in the corners where two \"walls\" and the \"floor\" meet, it left maybe 40% behind. I have better luck with a car detailing hose on a portable vacuum followed by a cleaning wipe.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "god",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETBYH5FHNGZSBHSHPYPB74OP4ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBRHXLMM88OUC?ASIN=B07GW9TJ3G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Works pretty well Better than q tips LOL!",
                "reviewText": "It is easy to use.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jamie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDADFOZOX4PKLXBFSN7I6IEH5JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V3Z7ZKBZ0J8C?ASIN=B07GW9TJ3G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Effective Cleaning Solution and So fun to Use!",
                "reviewText": "This item has earned a stellar five-star review for its exceptional PC keyboard cleaning, car detailing, and electronic maintenance performance. Here's why it stands out:-The cleaning gel proves its versatility by effectively removing dust and debris from various surfaces, including PC keyboards, laptops, car interiors, and home electronics. Its universal application makes it a go-to cleaning solution.-The gel's ability to reach and clean intricate spaces sets it apart. It conforms to the contours of keyboards and other devices, ensuring a thorough cleaning process that leaves no nook or cranny untouched.-The gel's user-friendly nature makes it a convenient choice. Its malleable texture allows for easy application, and its dust-absorbing properties make the cleaning process efficient and satisfying.-It's safe for Electronics and gentle on delicate surfaces. It effectively removes dust without causing damage to electronic components, making it a reliable choice for maintaining the cleanliness of valuable devices.This item has proven itself as a precise and efficient cleaning solution for various surfaces. Its universal applicability, attention to detail, and safe cleaning properties make it a must-have for maintaining the cleanliness of electronic devices. Five stars – because cleanliness has never been this effortless! 🌟🧼💻",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Drum Guru",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCW5JNGFOPSCHN5MK4VTVIUO6MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWW36ZJZ3NL27?ASIN=B07GW9TJ3G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Takes a while to get the hang of using this thing.",
                "reviewText": "I wish it was a little bit more malleable, but it works to clean the keyboard and the computers and other things in my house that have dirt and dust tucked into corners. Good product.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBLFVM4ZSHZGAQXMRKYWBKOHXCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36Q6RLIP3KHYN?ASIN=B07GW9TJ3G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for keyboards",
                "reviewText": "Bought this to help my give my keyboard a much needed deep clean. Took the keys off, and used this along with some q-tips and toothpicks to clean everything up. This cleaning gel works very well to lift dust and other items out of recesses and clean around complex shapes like the key bases. It sticks well to itself and debris but doesn't get stuck in the keyboard. Don't expect it to be able to lift off stuff that's well stuck down - but that's ok, because if it was that sticky it would just get everywhere.I was able to do the keyboard with a small chunk, and have ~80% remaining for future cleaning projects. I foresee me using it in my car to clean the dashboard, steering wheel, etc.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pierre C",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 4, 2023",
                "reviewTitle": "Works great!",
                "reviewText": "I was dubious that this would work - but it cleans everything that is difficult to clean! Keyboard- phone - TV remote etc. This is a wonderful product!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danitzia Guerrero-Tortolero",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 11, 2021",
                "reviewTitle": "Limpiador universal tipo gel..",
                "reviewText": "Muy buen producto, fresco y práctico para la limpieza en áreas difíciles de teclado de portátiles y en carro. Muy satisfecha con el producto.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arijeet Dey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 14, 2023",
                "reviewTitle": "No doubt useful thing it is",
                "reviewText": "It's a useful thing no doubt. But, Not sure how long it'll last.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kenneth C Fisher",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 17, 2021",
                "reviewTitle": "Good but beware",
                "reviewText": "I bought this product after seeing it used on YouTube. One of the keys on my lap top was sticking. The gel did the trick. However, not long afterwards, my laptop had a serious problem and had to go away for a repair. The keyboard had to be replaced on a two-year old laptop. Not sure whether using the gel caused this, but I am loathed to use it for cleaning my keyboards again.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on May 11, 2021",
                "reviewTitle": "Good product",
                "reviewText": "have been using for 3 weeks with light usage, it cleaned the dust in computer and keyboard well, hope it last longer for light usage.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}