{
    "remaining_requests": 26223,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Better-Battery-Alkaline-AAA-Batteries/dp/B0BYTH96ZZ",
    "body": {
        "name": "Better Battery Alkaline AAA and AA Batteries – Long Lasting Performance Carbon Neutral with Storage Box Recycling Program 20x Batteries, (BBCAA20AAA20)",
        "price": "$26.99$26.99 ($26.99$26.99 / Count) $25.49$25.49 ($25.49$25.49 / Count)",
        "originalPrice": "$37.99",
        "rawPrice": 26.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Better-Battery-Alkaline-AAA-Batteries/dp/B0BYTH96ZZ",
        "soldBy": {
            "sellerID": "A1MRDUP3QVWTDX",
            "name": "Better Battery Company",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1MRDUP3QVWTDX&asin=B0BYTH96ZZ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51s0ZW6jOfL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/512-1HTQC1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XXuqBX-2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NVu9OyigL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VxOmFXC L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41U1u0mcLeL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d7d240a-5e4c-48c6-8a43-cd2281ebde9f/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Better Battery Co. Store",
            "link": "https://www.amazon.com/stores/BetterBatteryCo/page/3C50C91C-C5D2-40A8-A83F-23BB54A048E1?ref_=ast_bln"
        },
        "brand": "BetterBatteryCo",
        "merchantInfo": "Better Battery Company",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 58,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 15. Order within 2 hrs 19 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 15. Order within 2 hrs 19 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbonfree Certified determine the carbon footprint of the product, and associated carbon emissions are offset with reduction projects."
        },
        "features": [
            "WORLD'S 1ST CERTIFIED CARBON NEUTRAL BATTERY- Our bulk batteries and packaging are made from scratch to be fully recyclable: a unique innovation in the household battery space. Instead of ending up in landfills, every recycled battery is broken down and their components are repurposed creating zero waste!",
            "HIGH QUALITY AND RELIABLE POWER – At Better Battery Co., we make carbon neutral alkaline batteries that deliver reliable, long-lasting power which are 100% recycled by us when depleted at no extra cost to you! Every battery is made from sustainable, high-quality components that can power your household for the same amount of time (if not longer) than other leading battery brands for a fraction of the price!",
            "LONG-LASTING POWER FOR EVERYDAY USE OR EMERGENCY SITUATIONS – From tv remotes and gaming controllers to smoke detectors and flashlights, you can count on Battery Battery Co. to deliver long-lasting and reliable power every time. Our powerful batteries AA size and batteries AAA size are also completely leak resistant meaning you can store them for a long period time without losing power.",
            "HIGH PERFORMANCE BATTERIES WITHOUT THE MARKUP – Not only are our batteries sustainable for the environment, but also for your wallet as well! Better Battery Co. delivers batteries that are on average 30% cheaper than the leading brands, without any compromise on quality and performance. You can expect your digital cameras, toys, electronic games, portable lighting, clocks and much more to be juiced up for just as long but for much less!",
            "INCLUDES REUSEABLE STORAGE BOX ALSO USED FOR RECYCLING – Every combo pack comes with 20x Double A batteries and 20x Triple A batteries in a beautiful storage box made with recycled material to eliminate drawer clutter! Once you've used up your batteries, simply pack them up in the same box you received them in and send them back to us for recycling. We will take care of the rest. 100% carbon neutral and zero waste!"
        ],
        "description": "Introducing our latest High-Performance Sustainable Alkaline Batteries - the perfect solution for all your battery needs! These batteries are made with eco-friendly materials that are carbon neutral and 100% recyclable, making them the perfect choice for anyone who wants to minimize their carbon footprint and reduce waste. Our High-Performance Sustainable Alkaline Batteries are designed to deliver reliable and long-lasting power, so you can power your devices with confidence. Whether you're using them for your electronic devices, toys, or any other household item that requires batteries, our batteries are up to the task. To make storage and transportation easier, we've included a reusable storage box with our High-Performance Sustainable Alkaline Batteries. This box is perfect for keeping your batteries organized and protected, so they're always ready to use when you need them. We also understand the importance of responsible disposal, which is why we've included the return box for recycling. Once you've used up your batteries, simply pack them up in the same box you received them in and send them back to us for recycling. This helps ensure that the batteries are disposed of in an environmentally responsible way, and that the materials can be repurposed for future use. And last but not least, we've also included a sticker pack with our High-Performance Sustainable Alkaline Batteries. These stickers are a fun way to decorate your storage box, your device, or any other item you choose. It's just one more way we're making your battery experience even better!",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Household Batteries",
                "link": "https://www.amazon.com/Household-Batteries/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15745581"
            },
            {
                "name": "AA",
                "link": "https://www.amazon.com/AA-Batteries/b/ref=dp_bc_aui_C_4?ie=UTF8&node=389577011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7.16 x 6.5 x 2.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.79 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BYTH96ZZ"
            },
            {
                "name": "Item model number",
                "value": "BBCAA20AAA20"
            },
            {
                "name": "Batteries",
                "value": "20 AA batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 58 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#71,540 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #380 in AAA Batteries #726 in AA Batteries #4,893 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Date First Available",
                "value": "November 4, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "Better Battery Co."
            },
            {
                "name": "Number of Batteries",
                "value": "20 AA batteries required. (included)"
            },
            {
                "name": "Brand",
                "value": "Better Battery Co."
            },
            {
                "name": "Battery Cell Composition",
                "value": "Alkaline"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming Console,Smoke Detectors,Tv Remotes"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Meet the world’s most positive batteries! Technical Specifications Includes 20 count AA and 20 count AAA Batteries High Performance Sustainable Alkaline Batteries Carbon Neutral and 100% Recyclable Includes Reusable Storage Box Includes Return Shipping Box for Recycling Includes Sticker Pack Our batteries are carbon neutral and are delivered to your door. The box is designed to keep the batteries organized, and comes equipped 20x AA and 20x AAA batteries to keep you fully charged for many months. And, when your batteries are used, send them back to us and we’ll recycle them for you, for free! A better recycling process All of our batteries are Alkaline batteries, which helps us ensure that the battery sorting is accurate when it’s sent to Raw Materials Co., our partner battery recycling plant.Our packaging is fully recyclable. The paper and plastic used to ship your batteries is also recycled after the batteries reach Raw Material Co.'s facilities.Worried about carbon emissions? So were we! We’ve calculated all of the carbon associated with your battery’s life and then partnered with CarbonFund to ensure we can offset every last bit of carbon emissions associated with your batteries.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0cd3320e-9815-436a-9d21-e6b6d9ccfb23.__CR0,0,1000,1000_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Better recycling, better battery, better world Once you have used all your batteries, we offer free battery collection and recycling. You simply replace spent batteries in the original subscription box, print the shipping label from our website. From there, we’ll make sure your batteries are shipped to our recycling partner, Raw Materials Co., for free. Our partners are equipped to sort and properly dispose of the alkaline batteries. Instead of ending up in landfills, batteries are broken down and their components repurposed. Components may be reused for any number of things, including fertilizer, sunscreen, pavement, and more.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4fdea1f1-ad05-47ee-be55-5d176d8db1c7.__CR0,0,500,500_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Better Means... + Better Value Better means competitive prices to make sustainability the easy choice. + High Performance Better means high quality, long lasting alkaline batteries designed for all of your everyday needs. + Free Recycling Better means we deliver fresh batteries to you, you send them back when you’re done, and we recycle them for you at no extra cost. + 100% Carbon Neutral Better means buying the only carbon neutral batteries on the market so you can feel good about your environmental footprint.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/91ff7da8-f64c-4f2c-8041-5f428348040f.__CR0,0,1333,1333_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6f90af48-d428-437d-8132-15d41f604c54.__CR0,0,1333,1333_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/256408ed-4410-48f9-8e41-55baf1200071.__CR0,0,1333,1333_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ab8ce978-376e-4b59-83c0-78a5767238fd.__CR0,0,1333,1333_PT0_SX220_V1___.png"
                ]
            },
            {
                "media_text": "Made better to reduce carbon emissions It’s one of those things that everyone needs and uses and that’s kind of where the story ends. Right? Well, not really. They end up in landfills. They end up seeping into our oceans, lakes, soil. So, we ended up saying, we’re going to change that. We manufacture our batteries in a carbon neutral facility, lowering our carbon footprint right from the start. From there, we offset the CO2 emissions released by the production, distribution, and disposal of our batteries by investing in carbon reducing projects like wind farms, tree planting and truck stop electrification.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0715c646-007b-48a5-aabe-9fe7af4ea3c2.__CR0,0,600,600_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a4db2854-ad4f-47a9-a4c3-467e955214c1.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0cd3320e-9815-436a-9d21-e6b6d9ccfb23.__CR0,0,1000,1000_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4fdea1f1-ad05-47ee-be55-5d176d8db1c7.__CR0,0,500,500_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/91ff7da8-f64c-4f2c-8041-5f428348040f.__CR0,0,1333,1333_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6f90af48-d428-437d-8132-15d41f604c54.__CR0,0,1333,1333_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/256408ed-4410-48f9-8e41-55baf1200071.__CR0,0,1333,1333_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ab8ce978-376e-4b59-83c0-78a5767238fd.__CR0,0,1333,1333_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0715c646-007b-48a5-aabe-9fe7af4ea3c2.__CR0,0,600,600_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JB239",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTNFLOWKEFZBIQT5E4IO2CCWFLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TX6LIG05BF35?ASIN=B0BYTH96ZZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Long lasting batteries",
                "reviewText": "I've been using these batteries for several months, mostly in remote controls, and so far I have had no problems with them. I can't say how long they would last in other products because most of what I own can be recharged via a USB port.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6FMNQEW5YG5WVNKICLZVZ7HIOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3W17L3IAYGOC7?ASIN=B0BYTH96ZZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great with electronics",
                "reviewText": "No complaints they work well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. JamesonC. Jameson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AER7XGZ4GSGWN6KNBV2QWZ2YOLIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWMKCX9WY714C?ASIN=B0BYTH96ZZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2023",
                "reviewTitle": "4.0 out of 5 stars More Expensive but Environmentally Friendly",
                "reviewText": "If you're committed to recycling, these are the batteries for you. If not, you'll find these to be a bit pricey. I really only recommend these if you plan to follow through to send them in for recycling.They test out with a consistent 1.6 volts for both the AA and AAA batteries. They aren't oversized and didn't have any problems fitting into the various devices I use them for.They come in a nice box that helps you store them both before and after they're used up. The ends are a different color, so when you use one up you can place it back in the box upside down and you'll be able to see which are good and which are bad by color. When you've gone through them all, they provide you with a website address to go to in order to send them in for recycling. Unfortunately, I can't provide much information on this process because the website still says \"coming soon!\" for the service. I gather this is a brand new product and they are just getting up-and-running.They seem committed overall to using recycled materials in their packaging and production. If you're trying to live a more \"sustainable\" lifestyle and looking for a battery that can help you achieve that goal while recognizing there is a cost to being more environmentally responsible, you can't go wrong with these.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51TNU0DW5ML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61X1Cyd0CnL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jody",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPAKPXMLGH3ZBNWU6CI5Z2XRGGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8Z82779CSCS0?ASIN=B0BYTH96ZZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2023",
                "reviewTitle": "5.0 out of 5 stars They are batteries",
                "reviewText": "Who doesn't run out of batteries when you least expect it?!This is a great value for the amount of batteries that you get. So far they are working great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4HT5DJPKSQCLGNADBUXHUQWMWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BTFXWU3VVS5N?ASIN=B0BYTH96ZZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Premium long lasting batteries, what more do you want?",
                "reviewText": "I have these in all my controllers and will probably last for a long time before having to send them back using the recycling program. Once that happens just simple put them upside down in box to avoid mixing them up with new batteries.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AvaAva",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERLMN7DD4EN5B7KI5WWHYUPOGMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32YLRBDQE12C3?ASIN=B0BYTH96ZZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Great performance and easy recycling",
                "reviewText": "These batteries are the correct size for AA and AAA batteries. They fit correctly in all appliances and gadgets that I use these sizes of batteries in. They work as well and as long as brand name batteries. They come in a sturdy box in which they are standing vertically, each in its own vertical slot. The ends of the batteries have two different colors and once the battery is used you put it back in the box with the opposite side up. That way you can easily see how many good batteries are left and the used batteries are neatly stored until the whole box has been used. Once all batteries are used you go to the company’s website where you can generate a free shipping label to ship the whole box of used batteries for recycling.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ACVmoH2DL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81HNms+GgaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81YCAFvL9jL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tim H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCIKESM5NZEKP7DP6C763SAETXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZO5FCPU01YI?ASIN=B0BYTH96ZZ",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "2.0 out of 5 stars batteries are trash",
                "reviewText": "they don't last long at all and the whole little thing they got going on inside the box about Recyling the batteries and putting them upside down, follow a path and all that stuff is just to much. We get it you recycle batteries. they make it out like its a little kids board game or something i just know when i opened the box and saw that, it made me not want to recycle batteries but actually it gave me the urge to want to throw a bunch of batteries in a landfill. ( just a feeling that i got). so they can ramp that on down and actually make good batteries and they might have something going on. but Duracell and Energizer don't have anything to worry about from this battery company.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AllenAllen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFU3OZVM7DT5BYNOSENWS5AF7D3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZLQEJ4GXCO4N?ASIN=B0BYTH96ZZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Good set of batteries with recycling service",
                "reviewText": "These batteries seem to perform as well as any other alkaline battery. They come in a nifty little box that allows to the recycling of used dead batteries. Probably the coolest thing is the ability to ship these back when you've finished using the complete box. This is definitely a plus for someone who wants to look out for the environment or if there's no feasible battery recycling in your local area. I've attached a photo of the box here.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71sazM9V-ML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 5, 2023",
                "reviewTitle": "Innovative & 100% Recyclable Carbon Neutral Alkaline Batteries",
                "reviewText": "I love anything innovative and eco-friendly so naturally i gravitated towards this amazing AA/AAA set of carbon neutral alkaline batteries. It'll definitely come in handy since my household goes through a ton of batteries fairly quickly with just the Roku/TV controller 😅 It probably doesn't help that we use mostly cheap dollar store batteries lol. Hopefully these do offer long-lasting and high performance power 🤞It arrived in a nice, reusable storage box(made from recycled material) with 20 x AA batteries and 20 x AAA batteries along with cute, positive energy stickers. Inside the box is printed information on how to keep track of your used and unused batteries and how to return when fully depleted at no cost to you. You simply go to the website: betterbattery.co, select recycling and tap on the \"Recycle your batteries +\" bar and it'll generate a prepaid recycling label for you(not officially available yet but will be in a couple of weeks, should you require one sooner contact: hello@betterbattery.co). Located behind the box is a spot for the shipping label and according to the description each box comes with a convenient return shipper polymailer as well. I recently used 3 x AAA batteries for a domino train with steam feature and it works incredibly well so far but time will tell how long-lasting the power truly is and if it's indeed leak-proof 🤞Overall it's certainly pricey with a 2026 expiration date(3 years) that's quite short in comparison to other brands like Duracell and even Amazon that are cheaper with a significantly longer shelf life of 10 years. On the big upside these are sustainable carbon neutral batteries that are fully recyclable including the packaging so no waste equals a better 🌏 for all 🙂👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deegirl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 3, 2023",
                "reviewTitle": "ECO friendly check✅🔋♻️🔋✅ - longlasting check ✅",
                "reviewText": "HI everyone,Today I'm reviewing carbon neutral batteries.The packing on this product is outstanding, it's not only nice to look at but educational 🍃📚🤓🍃. On the insert the package educates the consumer of the proper disposal of the battery and comes with an assortment of AAA & AA batteries.I've haven't had to replace the batteries of of yet, and it's been almost two months, so the life expectancy has been very good thus far. The price is $44.99 which is about $1.13 per battery, which is reasonable, and cheaper than going to one's local big box store.Overall I'm very happy with the product.I hope this review help's ♻️🤓♻️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "zen4ever",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2024",
                "reviewTitle": "Works Great",
                "reviewText": "I love these Better Battery Alkaline AAA and AA Batteries. They work great, and have been made out of old batteries I believe to remove our carbon footprint. They work really well, and so far I have had no issues with them compared to regular batteries. The longevity seems good and the value for the money is good. So over I recommend these batteries.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Positive VibesPositive Vibes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 28, 2023",
                "reviewTitle": "Expensive but carbon neutralyou",
                "reviewText": "The Better Battery Alkaline AAA and AA Batteries make impressive claims of being carbon-neutral and fully recyclable, which caught my attention. I have experienced leaks with alkaline batteries from well-known brands in the past, so I was hopeful these batteries would address that issue.The batteries were well-packaged in a recyclable cardboard box with informative printed information. I appreciated the inclusion of 12 stickers and a designated space on the back of the box for attaching a shipping label to return the batteries for recycling.One aspect that concerned me was the relatively short shelf life indicated by the date stamp on the bottom, which appears to be 2026. This is notably shorter compared to other batteries that offer a longer shelf life.With a current sale price of $44.99, these batteries are pricier compared to a typical 40-pack of batteries. While the cost reflects their environmentally friendly features, it may be a consideration for those who frequently purchase batteries.In conclusion, the Better Battery Alkaline AAA and AA Batteries offer commendable eco-friendly attributes and address the issue of leaks. However, potential buyers should be aware of the shorter shelf life and higher price point when making their purchasing decision.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71m-yrKiB2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71kMw0bxkYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71tUEjzSIuL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "𝒜𝓊𝓇𝑜𝓇𝒶𝒜𝓊𝓇𝑜𝓇𝒶",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 28, 2023",
                "reviewTitle": "greening the way we use batteries",
                "reviewText": "The batteries are made in Belgium and the quality seems impressive as well. I have installed them in various devices, including my smart door lock, wireless mouse, and wireless game controller, and have been using them for two weeks without encountering any issues. The battery's performance has been consistent and reliable.In my household, we always seem to have used batteries lying around, and every time when I come across battery collection boxes in supermarkets or stores I suddenly realize that I should bring end-of-life batteries for recycling. As far as collecting and recycling batteries goes, I think this product is a much better and more efficient way. After using up the batteries, you can download recycling labels online and send the batteries back to a recycling facility. No more worrying about finding a physical recycling center. I like the battery box, it is designed to avoid short circuits, prevent damage from leaking batteries and help the environment.PS: currently, the recycling labels can only be obtained by email and cannot be downloaded directly from the website or the QR code on the box.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61abnhkF3-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Xe6Zi6nTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81zVMkdT1QL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}