{
    "remaining_requests": 26150,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Optima-Batteries-8004-003-Starting-Battery/dp/B00075OSC4",
    "body": {
        "name": "OPTIMA Batteries 8004-003 34/78 RedTop Starting Battery",
        "price": "$279.99",
        "originalPrice": "",
        "rawPrice": 279.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Optima-Batteries-8004-003-Starting-Battery/dp/B00075OSC4",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07BT8FHR1"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41BOVDRCsBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41KaXP U0wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31b0V0JVURL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31TvBDkPu-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31pzG7cHS4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vxsHlWO6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ayUi BCQL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/e357026c-f509-59e7-bd9d-dbf5b9aed46b/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/44d64965-f8fc-4f69-861d-819eceba72ce/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1sePg4EvLS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1r47ScOTyL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the OPTIMA Store",
            "link": "https://www.amazon.com/stores/Clarios/page/B9A52BB9-B62E-4D89-AB69-6737B61444EB?ref_=ast_bln"
        },
        "brand": "Clarios",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1556,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20. Order within 9 hrs 36 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "12-Volt, 800 Cold Cranking Amps, Size: 10\" x 6 7/8\" x 7 13/16\" tall, Weight: 38.8 pounds, Dual SAE & GM Posts",
            "Reserve capacity of 100 minutes for constant performance",
            "Optimal starting power even in bad weather",
            "This item is not for sale in Catalina Island. Battery Charger:13.8 to 15.0 volts, 10 amps maximum, approximately for six to twelve hours. Alternator:13.3 to 15 volts, no amperage limit",
            "Fifteen times more resistant to vibration for durability. Mountable in virtually any position. May include convenient carrying handle for ease of placement in battery holder.",
            "Completely spillproof, mountable in virtually any position"
        ],
        "description": "Optima 34/78 RedTop is designed to deliver high power cranking ability even in harsh weather conditions. This battery is great for heavy use by hot rods and off-roaders with its leak-proof, high power, and starting ability. The unique SpiralCell design provides a strong and clean power source, ensuring the safety of you, your family and the environment. The higher reserve capacity gives you a longer shelf-life to give you the power when you need it, where you need it.Tested to exceed a continuous 200 amp load. For dual cable installation. Use with 6v or 12V Batteries. Long side Bolt Battery Terminal. Although these battery trays are used to replace stock battery trays, they are often used when relocating the battery to the trunk of the vehicle as well.",
        "breadCrumbs": [
            {
                "name": "Automotive",
                "link": "https://www.amazon.com/automotive-auto-truck-replacements-parts/b?ie=UTF8&node=15684181"
            },
            {
                "name": "Replacement Parts",
                "link": "https://www.amazon.com/Replacement-Parts-Automotive/b?ie=UTF8&node=15719731"
            },
            {
                "name": "Batteries & Accessories",
                "link": "https://www.amazon.com/Automotive-Replacement-Batteries-Accessories/b?ie=UTF8&node=15719911"
            },
            {
                "name": "Batteries",
                "link": "https://www.amazon.com/Automotive-Replacement-Batteries/b?ie=UTF8&node=15719921"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "OPTIMA"
            },
            {
                "name": "Size",
                "value": "10 x 6-7/8 x 7-13/16 inch"
            },
            {
                "name": "Product Dimensions",
                "value": "6.88\"D x 10\"W x 7.81\"H"
            },
            {
                "name": "Number Of Cells",
                "value": "6"
            },
            {
                "name": "Terminal",
                "value": "SAE Terminal"
            },
            {
                "name": "Manufacturer",
                "value": "‎Optima Batteries"
            },
            {
                "name": "Model",
                "value": "‎34/78"
            },
            {
                "name": "Item Weight",
                "value": "‎38.8 pounds"
            },
            {
                "name": "Country of Origin",
                "value": "‎Mexico"
            },
            {
                "name": "Item model number",
                "value": "‎8004-003"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Manufacturer Part Number",
                "value": "‎8004-003"
            },
            {
                "name": "OEM Part Number",
                "value": "‎8004-003"
            },
            {
                "name": "ASIN",
                "value": "B00075OSC4"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,556 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,594 in Automotive (See Top 100 in Automotive) #33 in Automotive Replacement Batteries"
            },
            {
                "name": "Date First Available",
                "value": "October 19, 2005"
            },
            {
                "name": "Vehicle Service Type Passenger Car",
                "value": "Voltage 12 Volts"
            },
            {
                "name": "Battery Cell Composition Lead-Acid, AGM",
                "value": "Item Weight 38.8 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "RedTop 34-78 shown above Our Promise Ultimate Power, for the ultimate professionals, for the ultimate enthusiasts. And for the ultimate experience. That's our goal each and every day. We look for every technological advantage to push the limits of what's possible and leave pretenders in our dust. We manufacture our own batteries in our own facilities to our demanding standards.To ensure quality and consistency in our batteries, no matter where they are being sold - our batteries are never re-labled or re-spec'd. Gentlemen, Start Your Engines The RedTop high-performance AGM battery is the ultimate starting battery designed to deliver a powerful burst of ignition power for a reliable start-up every time. It will withstand hard launches, extreme corners and is race proven for every road every day whether it's used as a truck battery, automotive battery, or for other applications. Its reputation as a truck battery or automotive battery is unsurpassed. Strong starting burst More than 15 times the vibration resistance Spillproof, mountable in virtually any position Maintenance-free with up to 2x longer life Faster recharging With impressive high-power delivery and extreme resistance to the most common causes of battery failure, the RedTop is ideal for trucks, SUVs, hot rods, street cars.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/631e6757-4723-451d-88bd-db106b4a462f.__CR0,250,3450,4600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/12251466-b04a-45b9-ad11-6f776de2a26f.__CR0,207,3970,1985_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "SpiralCell Technology At the heart of every OPTIMA battery is a series of individual spiral-wound cells comprised of two pure (99.99%) lead plates coated in a precise coating of lead oxide. One coated plate is positive and the other is negative. The unique manufacturing process of spiral winding continuous lead plates is far more precision-controlled and expensive than building traditional flat plate AGM batteries. Custom automated cell-winding machines are required to maintain the close tolerances required to maintain quality and performance. Critical tolerances, temperatures, humidity and automated processes are maintained and constantly monitored. OPTIMA has built over 100 million individual spiral cells since the early 1990’s.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/8e703077-5de7-4c2c-9b39-dd0236269834._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "What's the difference between OPTIMA RedTop, YellowTop, and BlueTop Batteries? RedTop For normal engine starting where an alternator immediately monitors the state of charge and provides energy to the battery whenever it is needed. This would describe most stock vehicles, including: automotive and RV underhood starting, heavy equipment where starting is the primary function, and diesel vehicles without aftermarket electronics. YellowTop Use this when electrical loads are higher than average, or when the discharge cycle is more than typical engine starting, such as vehicles with multiple electronic accessories and vehicles without alternators. This can also include vehicles with a lot of factory electronics such as power sliding doors and a DVD player. Examples also include: racing vehicles without a charging system, dedicated drag racers, diesel powered vehicles with aftermarket electronics, and vehicles with inverters, winches, or other accessories. BlueTop The BlueTop starting battery (dark gray case) is to be used when a dedicated starting battery is required and it should never be used for cycling duty. Use a BlueTop starting battery for marine applications and RVs when the battery's only function is engine starting. The dual purpose BlueTop (light gray case) can be used for both starting and deep cycling -- it is a true deep cycle battery with extremely high cranking power. Uses include: trolling motors, marine applications with heavy electrical accessories, and RVs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/db99dfe1-83e5-46c2-a576-19a040bfde0e.__CR39,0,3410,3410_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/28031579-2360-4f6d-962a-31276cf70672.__CR0,0,3450,3450_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/df1b37ce-8973-4fcb-bcca-e0d7aa3ea5cf.__CR0,0,3450,3450_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/305d1d39-2507-4eba-8d72-9f35cca0bfbd.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/631e6757-4723-451d-88bd-db106b4a462f.__CR0,250,3450,4600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/12251466-b04a-45b9-ad11-6f776de2a26f.__CR0,207,3970,1985_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/8e703077-5de7-4c2c-9b39-dd0236269834._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/db99dfe1-83e5-46c2-a576-19a040bfde0e.__CR39,0,3410,3410_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/28031579-2360-4f6d-962a-31276cf70672.__CR0,0,3450,3450_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/df1b37ce-8973-4fcb-bcca-e0d7aa3ea5cf.__CR0,0,3450,3450_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Unspoken Yum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2JCQEWME2H6ZGCDIRIQWUKHSRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BKPCVQ2FJP8Y?ASIN=B00075OSC4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Unrivaled Power and Reliability",
                "reviewText": "I recently installed the OPTIMA Batteries 8004-003 34/78 RedTop Starting Battery in my vehicle, and the experience has been outstanding. This battery isn't just a replacement part; it's a significant upgrade, offering exceptional power and reliability that goes beyond standard car batteries.The first thing I noticed was the RedTop's impressive starting power. It delivers strong and consistent cranking power, which is especially noticeable in cold weather when my previous batteries struggled. This reliable starting power gives me confidence, knowing that my vehicle will start smoothly every time, regardless of the weather conditions.Another standout feature is the battery's durability. The OPTIMA RedTop is designed to withstand harsh conditions, including vibrations and impact that would typically shorten the lifespan of regular batteries. This toughness is crucial for me, as I often drive in challenging environments where a robust battery is essential.The maintenance-free aspect of the RedTop battery is a significant plus. It's a fit-and-forget solution, which is perfect for someone like me who prefers a hassle-free car maintenance experience. The sealed design means there’s no need to worry about checking water levels or dealing with leaks and corrosion.The versatility of the OPTIMA RedTop battery is also commendable. It fits a wide range of vehicles, including cars, trucks, and SUVs. This compatibility, combined with its exceptional performance, makes it a suitable choice for various automotive applications, from daily commuting to more demanding driving conditions.The design of the battery, with its distinctive red top and clean, modern lines, adds an aesthetic appeal under the hood. While looks might not be the primary concern for a car battery, it’s a nice bonus, adding a touch of style to the engine bay.TL;DR: The OPTIMA Batteries 8004-003 34/78 RedTop Starting Battery is a standout choice for any vehicle owner seeking power, durability, and reliability. Its impressive starting power, rugged construction, maintenance-free design, and versatility make it a superior option compared to standard batteries. This battery isn't just a component; it's a key to a worry-free and powerful driving experience.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Austin Callahan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCMN35FQYTYO5L73MAXTJEFQILA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MMKAQMALC9C3?ASIN=B00075OSC4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Gentlemen, Start Your Engines!",
                "reviewText": "Researched and purchased this battery specifically for my Ram that is no longer my daily driver and current battery had issues wanting to start after sitting for more than a couple of days. This battery is not only strong but started my truck after sitting a week and in single digit temps. Impressed and would highly recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex Hsu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3PNTTC46S7L5NLXVDBVBSLKTWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VKPLMGMR5KC?ASIN=B00075OSC4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 4, 2016",
                "reviewTitle": "5.0 out of 5 stars Super fast delivery and with good build quality",
                "reviewText": "Super fast delivery and with good build quality. Come with 77% of battery left and now is charging. Preparing to install it to my RV.after one and half years use (connecting with a 5w solar panel and a solar charger controller), the battery dead. the battery is still able to be charged by a Black Deckor 15A battery charger but not able to hold the charge (still have cranking capability after tested with an electric battery tester). after contacting with optima, they are not able to honor the warranty (the technical said the one of the cell of the batter might dead) but i have to consult with the original re-seller which is Amazon. After calling Amazon, they can send me a replacement or a full refund. i choices a refund then to get another one from costco coz I do not want to wait. the price i purchased in the past is about 80 dollars cheaper then current price. so, i think that i got a very good deal in the past. basically, i like Optima and I like Amazon! The one fails may just because the discharging speed of the battery itself is bigger then the charging rate i provided from a tiny 5w solar panel.. i bought a 40w bendable solar panel instead. hope this time works!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "W. Pike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHW3LGTCRSLLZDKACPO33RHICEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R203EM9NM67TST?ASIN=B00075OSC4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Optima batt",
                "reviewText": "Very good results with this battery. If Optima had quality issues I don’t see it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Acefire",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3L6FTIUOWX3KAGNJHGRMIHDMVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HUCMHOV1YZWQ?ASIN=B00075OSC4",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 12, 2023",
                "reviewTitle": "1.0 out of 5 stars This BS is a total scam",
                "reviewText": "This thing is a total dog compared to walmart batteries for 1/3 the price. The reserve capacity is terrible, the CCA is only 800 - yet I wanted something to last.With that said - I am not happy. I thought \"hey buy the best of the best and you'll finally be happy.\" This is not the case. An $80 walmart battery outperforms this battery in nearly every aspect. I am within my return period and I am literally seconds away from returning it. I could buy 3 walmart batteries and put them in parallel/series and see some serious business for the same price.I have some parasitic drain and my 2 year old no-name battery usually takes a week or two to run flat. This thing dies overnight. Additionally, the cheap no name battery does 950cca easily - where this POS only does 800. This company at this point is literally scamming people on name alone.There are BETTER batteries for MUCH LESS.My only saving grace IF I KEEP THIS BATTERY is that it will last for way longer. But with the results I've gotten in the past couple days I would not trust that or invest this way. I could buy a new BETTER battery every couple years and have a better outcome. This thing would have to last over a decade to be worth it. But with my current results I am not convinced the reduced performance and lackluster results are boding well for this battery.Frankly, I will most likely return this thing within the week.Be a smart person!!!If you're looking for output - there are better batteries for WAY LESS. If you're looking for capacity there are better batteries FOR WAY LESS. If you're looking for longevity - for the same price you could just buy several of the other better (and cheaper) batteries over time FOR WAY LESS.This thing is an utter disappointment overall. I regret buying it and having a hint of red under the hood is not enough to justify the cost.In conclusion if you want the name, or flare of color under the hood at any expense - get this. Essentially, \"I want red in my engine bay.\"If you care about performance, capacity, or frugality THIS IS NOT YOUR BATTERY.DO NOT BUY THIS. This company is literally running on scams.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daryl Reaume",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 9, 2023",
                "reviewTitle": "well built",
                "reviewText": "good quality",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "terence invest",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 23, 2020",
                "reviewTitle": "all good",
                "reviewText": "power a bobcat",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isaac",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 9, 2018",
                "reviewTitle": "Working good",
                "reviewText": "Just like",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mymondi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 19, 2016",
                "reviewTitle": "Starts you up.",
                "reviewText": "Great price shipped quick to my door. Best automotive battery going.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave Russell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 10, 2023",
                "reviewTitle": "Big Optima Fan",
                "reviewText": "I bought this one to be a spare in case one of the 3 other Optimas I have dies. The oldest is at least 10 yrs and still does the job. I have a red top in my daily driver Tacoma and another in a 55 Studebaker that is on a battery maintainer and a Yellow top in a 65 Lemans that has a ton of stereo stuff, also on an Optima maintainer. Any battery that is not in frequent use should be on a maintainer (charger) if you want it to last. Visit the Optima website before you buy to make sure you are getting the one you need, They are not cheap but they can last twice as long as a cheapo unit if they are in daily or frequent use or on a maintainer if not.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}