{
    "remaining_requests": 26414,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ACDelco-48AGM-Professional-Automotive-Battery/dp/B008FWCLHU",
    "body": {
        "name": "ACDelco silver, calcium Gold 48AGM 36 Month Warranty AGM BCI Group 48 Battery For Truck , Black",
        "price": "$177.77",
        "originalPrice": "",
        "rawPrice": 177.77,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ACDelco-48AGM-Professional-Automotive-Battery/dp/B008FWCLHU",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B01HB1KGXG"
        ],
        "asinVariationValues": [
            {
                "asin": "B008FWCLHU",
                "variationName": "Style",
                "variationValue": "Battery",
                "price": "$177.77",
                "variationImageURL": ""
            },
            {
                "asin": "B00PM7IRN8",
                "variationName": "Style",
                "variationValue": "Battery and Cable",
                "price": "$241.88",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41J-seT7KFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/418ad9N2tYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/314Z75d566L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41t0q7V54lL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vIMJ8PnAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rCvuMyntL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/d60a51a7-71f7-58f5-a80f-1c8d25346c8c/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/417ZueXIdfL.pdf",
            "userManualLink": "javascript:void(0)"
        },
        "byLineInfo": {
            "name": "Visit the ACDelco Store",
            "link": "https://www.amazon.com/stores/ACDelco/page/C8EE70A9-B6C7-4C7A-9EF9-4F6E3150108C?ref_=ast_bln"
        },
        "brand": "ACDelco",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1107,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20. Order within 9 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "High density negative paste, improves performance and increases battery life",
            "Enhanced life alloy or Silver Calcium stamped alloy increases cycle life and improves performance",
            "Calcium lead positive grid, maximizes conductivity and allows for low resistance",
            "Robust envelope separator with puncture resistant back, allows for increased acid circulation and prevents shorts. Improved acid circulation, helps the battery to remain cool, and extend battery life",
            "Vent cap design that resists acid leakage",
            "Battery comes with 7 year warranty"
        ],
        "description": "ACDelco Professional Automotive AGM Batteries have high cycling capabilities, are remarkably charge-receptive, and are necessary for ‘start/stop’ vehicle applications. The Absorbed Glass Mat design is 100% leak and spill proof because the Electrolyte is permanently held in the glass mat separator instead of free flowing within each cell. Oxygen recombination reduces water loss and reassures maintenance-free performance. ACDelco Professional Automotive AGM Batteries have longer life expectancy in traditional vehicle applications, due to a maintained pressure on the plates which significantly reduces the amount of active mass lost from the grid. ACDelco Professional Automotive AGM Batteries also have a 36 month Free Replacement Period. PROPOSITION 65 WARNING: Battery posts, terminals and related accessories contain lead and lead compounds, chemicals known to the State of California to cause cancer, birth defects and other reproductive harm. Batteries also contain other chemicals known to the State of California to cause cancer. Wash hands after handling.• MAINTENANCE TIPS:Check the auto battery as part of regular vehicle maintenance.Keep auto battery terminals clean and free of corrosion. To remove corrosion from terminals use a terminal brush. Check the alternator and make sure that it is not charging too high or low – if the alternator is not charging properly it will cause the battery to not charge correctly and cause deterioration.Avoid exposing the auto battery to extreme heat whenever possible.Turn off other electrical accessories (stereos, internal lights, etc.) as soon as they are no longer required to save electrical energy.",
        "breadCrumbs": [
            {
                "name": "Automotive",
                "link": "https://www.amazon.com/automotive-auto-truck-replacements-parts/b/ref=dp_bc_aui_C_1?ie=UTF8&node=15684181"
            },
            {
                "name": "Replacement Parts",
                "link": "https://www.amazon.com/Replacement-Parts-Automotive/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15719731"
            },
            {
                "name": "Batteries & Accessories",
                "link": "https://www.amazon.com/Automotive-Replacement-Batteries-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15719911"
            },
            {
                "name": "Batteries",
                "link": "https://www.amazon.com/Automotive-Replacement-Batteries/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15719921"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "ACDelco"
            },
            {
                "name": "Size",
                "value": "Standard"
            },
            {
                "name": "Product Dimensions",
                "value": "7.5\"D x 7.6\"W x 11.9\"H"
            },
            {
                "name": "Number Of Cells",
                "value": "6"
            },
            {
                "name": "Resistance",
                "value": "0.02 Ohms"
            },
            {
                "name": "Manufacturer",
                "value": "‎ACDelco"
            },
            {
                "name": "Item Weight",
                "value": "‎45.5 pounds"
            },
            {
                "name": "Country of Origin",
                "value": "‎USA"
            },
            {
                "name": "Item model number",
                "value": "‎48AGM"
            },
            {
                "name": "Manufacturer Part Number",
                "value": "‎48AGM"
            },
            {
                "name": "OEM Part Number",
                "value": "‎88864541"
            },
            {
                "name": "ASIN",
                "value": "B008FWCLHU"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,107 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,014 in Automotive (See Top 100 in Automotive) #16 in Automotive Replacement Batteries"
            },
            {
                "name": "Date First Available",
                "value": "June 28, 2012"
            },
            {
                "name": "Vehicle Service Type Truck",
                "value": "Voltage 12 Volts"
            },
            {
                "name": "Battery Cell Composition Silver-Calcium",
                "value": "Item Weight 45.5 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "ACDelco Absorbed Glass Mat (AGM) Battery The ACDelco AGM range represents the very best in advanced battery technology for the most highly developed luxury cars and most advanced fuel-saving technology, including Stop/Start and regenerative braking. AGM Plate separators reduce internal resistance, providing significant improvement in all performance criteria, including increased cycling ability, faster recharge acceptance and improved cranking power in Partial-State-Of-Charge (PSOC). The AGM Range is ideal for highly-advanced stop-start vehicles, high-end luxury vehicles that have higher electrical accessory loads or performance vehicles that require a higher CCA starting battery with improved cyclic ability. Battery Benefits ACDelco Full Frame positive & negative charges 100% Maintenance-Free Spill & leak-resistance Highest corrosion-resistance Highest Cold Cranking Amps (CCA) for Stop/Start Applications Pressurised internally for vibration resistance Mandatory replacement for cars fitted with AGM batteries as original fit Ability to be retro fitted as a \"higher performance\" option in high load applications",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/144c03be-1121-4976-acd5-77a956511de4.__CR0,0,450,450_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b1542308-ced7-4522-879b-b8aa9a9c97e8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f2a9dc68-6f88-44ac-98c8-6f209b63ad84.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/144c03be-1121-4976-acd5-77a956511de4.__CR0,0,450,450_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/412bfb90-5a66-4253-8661-d1adb1d01384.__CR0,42,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9869a8c0-f462-45f0-ac0f-6e81a07ce1f8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEZGGQV257EZ57ESV3A2YHE2H2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OTZ0R5GLD41F?ASIN=B008FWCLHU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2016",
                "reviewTitle": "5.0 out of 5 stars Solid Performer",
                "reviewText": "I have had this battery for 18 months now, and I'm very happy with it thus far. I've been using AGM batteries in my work for quite a few years (stand alone solar powered automation and control systems) and they are very good performers when treated properly. I've seen them last as long as 7 years in 24/7 duty which to me is quite impressive considering that they're maintenance free. I live in the high desert of NM, about 3200 feet above sea level, and the dry climate and extreme temperatures, regularly above 110 degrees in the dead of summer, wreak havoc on traditional flooded lead acid batteries. They require constant acid level checking and even still always seem to die an early death. In the application I've implemented this battery in, my 2011 Suburban Z71, I'm constantly off road and my truck sits idling regularly on job sites, with underhood temps at very high levels. My \"wet\" batteries prior to this one generally last a year to 18 months, and the last 3-6 months of their lives are generally indicated by slower cranking and extremely fast discharge with small current loads like my cell phone charger being left on overnight, which honestly is the norm for me. I also run a large inverter for power tools on a regular basis; it's hard wired in and mounted on the floorboard of the vehicle. At 18 months in service this battery still performs like new, which it makes it the best battery I've had in my primary work vehicle in many years. For reference, I've been using the top grade (most expensive) WalMart batteries and my results have been somewhat disappointing, as previously stated. I live in a small town and don't have a lot of choices with things like automotive batteries. The 3 year free replacement warranty gives me a warm fuzzy but I'm betting (and hoping) I won't need to use it. I'm preparing for my second winter with this battery but I'm confident it will hold up based on its performance thus far. Chances are I will own this vehicle until this battery finally fails, and at that point I will update this review. For the time being, it's everything I could ask for in a battery, with lots of cranking power and reserve capacity, and it has done very well with the somewhat extreme workload I've placed upon it. Some big strides have been made in AGM technology in recent years, namely higher current output which makes it more appropriate in automotive applications, and this battery bears that out nicely. I'd say that it's everything I had hoped it would be when I made the switch to AGM for my primary/work vehicle, worth the extra cost in extended life and less hassles with maintenance. I switched to AGM with my Honda GL1800 motorcycle a couple of years ago and the results there have been stellar as well. I hope that my review helps with your purchase decision.Update 10/2/17: Still going strong at 2-1/2 years in service and zero maintenance. Chances are that ACDelco Pro AGM will be my new battery of choice, in spite of the higher price than conventional batteries. Well worth it to me; it appears that longevity will more than offset the price differential. And the less I have to extract a dead battery from my engine compartment, the happier I am.Update 9/7/2018: Still performing as new, 41 months in. It's a keeper.Update 2/27/19: Made it through another winter with no issues. I'm so happy with this battery at almost 4 years in service.Update 11/8/19: This battery is still happy and healthy at 4.5 years in service. Starts my 5.3L V8 Suburban reliably in recent subfreezing weather. I should also mention that my battery terminals are clean, shiny, and corrosion free; it looks like the battery terminal posts are very well sealed against acid and fumes leaking out and destroying cable ends and clamps.Update 4/22/20: 5 years in service without so much as a hiccup. Still plenty of cranking power and zero issues. The extreme workload I mentioned earlier in this review has diminished somewhat these days. My Suburban is more of a daily driver now, although I still use the large inverter regularly for this and that. I replaced the factory alternator at about 105K miles in this vehicle; it was still charging just fine but the bearings were starting to get dry and a little noisy, and I didn't want it failing on me at an inopportune moment (like being many miles from home). But I digress...I'm super pleased with this AGM battery purchase 5 years later. It's been awesome, and shows no sign of giving up anytime soon.Update 10/19/20: 5.5 years in service and still going strong.Update 12/15/20: With subfreezing temps in the teens over the next couple of days here, I thought it best to do a quick health check of this battery considering it's age. I used a carbon pile load tester and it's putting out about 395 Amps at 50 degrees F, which is probably double what I need for cranking. I'll be keeping an eye on its freezing weather performance but I think it will do well.Update 3/1/21: This ACDelco AGM battery made it through the recent Arctic blast with no issues; reliably started my Suburban at 5 degrees F. It's 2 months shy of 6 years old and still going strong.Update 5/24/21: Just passed 6 years since installation, and still working great. Possibly the longest lasting automotive battery I've ever owned.Update 11/5/21: 78 months / 6.5 years in service and still going strong. Temps in the 30s here this morning, and it's still cranking with power to spare.Update 12/12/21: Subfreezing weather has arrived, and this battery is finally showing its age. Slower than normal cranking this morning at 26 degrees F. I conducted a load test and it's down to 340 amps max output. I've seen a lot of sudden failures from traditional flooded batteries over the years, and the failure curve on this one seems to be much more gradual. It's nice to have some warning of impending failure, instead of having to arrange a jump start. I'll run it for a while longer as it's still doing the job, but a battery purchase is in my near future. This has been a really great purchase and has lasted for more than double the 3 year warranty. I highly recommend it, and have zero complaints.Final update 12/16/21: I ordered a replacement today. It's the same brand ACDelco Gold AGM, but I ordered the Group 94R/H7 instead of this Group 48/H6. It has much better cranking amp rating, reserve capacity, and AH rating, and it's $18 less at the time of writing this at $164. It's a little longer by about .6\", but otherwise is almost identical and will drop right into my 2011 Suburban with room to spare using the factory battery holddown clamp. These 94Rs are factory equipment on the '14 and newer Chevrolet full size trucks and SUVs, and have the higher capacity to keep up with the ever increasing electrical loads as option sets continue to increase (I.E. higher power infotainment systems, auto pilot systems, heated seats and steering wheels, etc.). I hope it lasts as long as this one did, and I'm convinced that it's the absolute best deal on the market if you want a long lasting premium battery.",
                "reviewVotes": "235 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wayne Wehner Sr.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2GWAZQTJFIV4KOKZLF5C4WIYJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CSXX22ZIBBU2?ASIN=B008FWCLHU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Got what i paid for 👍",
                "reviewText": "Its just a nice battery. Perfect fit and performs great. It came as promised. I would buy again if i had to.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tom B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNJT6N4H3SQZD7MOTYBEXODTMGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NOV24OS6XJDC?ASIN=B008FWCLHU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars AC Delco Battery",
                "reviewText": "Nice OEM replacement, reasonably priced, quick delivery",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQUOAZ4P74TNFY5YUPRSMTFMVMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21PKKOCM55MY?ASIN=B008FWCLHU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great for Duramax",
                "reviewText": "Despite Amazon \"Does Not Fit\" recommendation for my 2008 LMM, this is a Group 48 battery and is appropriate for NBS Duramax trucks (2007.5 and newer). This will not fit Classic Silverado/Sierra body style trucks as they were side post battery applications. Batteries were well packed, and charged on arrival. The batteries I received were Made In China. Big bummer as AC Delco batteries used to be manufactured in the USA.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "whizzywhizzy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVANZ6XWJ4B2ASTWBILNDY4MJNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YE8UPY9UJROA?ASIN=B008FWCLHU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars 2015 Chevy Traverse battery",
                "reviewText": "The fitment tool states that this does not fit a 2015 Chevy Traverse. However, it is the direct replacement for the OEM 4180 AC Delco, 48 HPG lead acid battery. I double checked a thousand times prior to rolling the dice on it. The same battery is on Rock Auto with the correct dimensions.The best part is that you get an AGM battery that has less dangerous than the OEM lead acid battery pictures in the review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CM9Ir9OHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jerry McFarland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGF35XC3MFSKX2KTZGZA7J36TB6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OCTGCV2BI0S2?ASIN=B008FWCLHU",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "1.0 out of 5 stars RIP OFF",
                "reviewText": "This Battery Has Gone Dead, And? I Don't Really Drive My Truck.. It Went Dead On January 31 2024.. It Was A Good Thing I Kept My Old Battery, Or Otherwise? I Would Have Been Stranded... I Don't Know If You Knew It Would Go Dead By That Date? But That's The Day It Went Dead.. I Resend On Any Prior Rating I Made.. Because AMAZON Has Always Been Pretty Much On The Mark.. I Can Not, And Will Not Recommend This Battery To Anyone... What A Disappointment... 😯😯😯",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF5HVWT6LON2FF6RPVZG5O3EK5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O0MZJU26WNIX?ASIN=B008FWCLHU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "4.0 out of 5 stars Exact fit for 2017 CAMARO, so long verry satisfied.",
                "reviewText": "👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Camaro man",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSBJMPOQ3HBSUXTJKPOYL2SFG5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFQMO8JBBST2T?ASIN=B008FWCLHU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Battery",
                "reviewText": "Received quickly and packaged very well. I checked it's battery CCA and was impressed that it was holding 980 amps. You won't find an AGM battery for less and it's a great value.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$182.57",
                "sellerName": "Autoplicity ✅",
                "sellerRating": "4"
            }
        ]
    }
}