{
    "remaining_requests": 26394,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Optima-Batteries-8025-160-Starting-Battery/dp/B000MSBU9U",
    "body": {
        "name": "OPTIMA Batteries 8025-160 25 RedTop Starting Battery",
        "price": "$249.99",
        "originalPrice": "",
        "rawPrice": 249.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Optima-Batteries-8025-160-Starting-Battery/dp/B000MSBU9U",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00CS6J3CA"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "90",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Xy0zz DeL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31sXVsa2sQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31b0V0JVURL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31TvBDkPu-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ayUi BCQL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/e357026c-f509-59e7-bd9d-dbf5b9aed46b/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81Br9ve+6UL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1r47ScOTyL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the OPTIMA Store",
            "link": "https://www.amazon.com/stores/Clarios/page/B9A52BB9-B62E-4D89-AB69-6737B61444EB?ref_=ast_bln"
        },
        "brand": "Clarios",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1281,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 12 hrs 20 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "12-Volt, 720 Cold Cranking Amps, Size: 10 5/16\" x 6 13/16\" x 7 5/8\" tall, Weight: 39.5 pounds, SAE Posts",
            "Reserve capacity of 90 minutes for constant performance;Up to 3X longer life",
            "Optimal starting power even in bad weather",
            "Fifteen times more resistant to vibration for durability.This item is not for sale in Catalina Island",
            "C20 Capacity:44 Amp hour"
        ],
        "description": "Optima 25 RedTop is designed to deliver high power cranking ability even in harsh weather conditions. This battery is great for heavy use by hot rods and off-roaders with its leak-proof, high power, and starting ability. The unique SpiralCell design provides a strong and clean power source, ensuring the safety of you, your family and the environment. The higher reserve capacity gives you a longer shelf-life to give you the power when you need it, where you need it.",
        "breadCrumbs": [
            {
                "name": "Automotive",
                "link": "https://www.amazon.com/automotive-auto-truck-replacements-parts/b/ref=dp_bc_aui_C_1?ie=UTF8&node=15684181"
            },
            {
                "name": "Replacement Parts",
                "link": "https://www.amazon.com/Replacement-Parts-Automotive/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15719731"
            },
            {
                "name": "Batteries & Accessories",
                "link": "https://www.amazon.com/Automotive-Replacement-Batteries-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15719911"
            },
            {
                "name": "Batteries",
                "link": "https://www.amazon.com/Automotive-Replacement-Batteries/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15719921"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "OPTIMA"
            },
            {
                "name": "Size",
                "value": "10-5/16 x 6-13/16 x 7-5/8 inch"
            },
            {
                "name": "Item Weight",
                "value": "32 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "6.81\"D x 10.31\"W x 7.63\"H"
            },
            {
                "name": "Terminal",
                "value": "SAE Terminal"
            },
            {
                "name": "Manufacturer",
                "value": "‎Optima Batteries"
            },
            {
                "name": "Model",
                "value": "‎Optima Batteries 8025-160 25 RedTop Starting Battery"
            },
            {
                "name": "Country of Origin",
                "value": "‎Mexico"
            },
            {
                "name": "Item model number",
                "value": "‎OPT8025-160"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Manufacturer Part Number",
                "value": "‎8025160"
            },
            {
                "name": "ASIN",
                "value": "B000MSBU9U"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,281 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#17,468 in Automotive (See Top 100 in Automotive) #52 in Automotive Replacement Batteries"
            },
            {
                "name": "Date First Available",
                "value": "January 18, 2007"
            },
            {
                "name": "Voltage 12 Volts",
                "value": "Battery Cell Composition Lead-Acid, AGM"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "RedTop 34-78 shown above Our Promise Ultimate Power, for the ultimate professionals, for the ultimate enthusiasts. And for the ultimate experience. That's our goal each and every day. We look for every technological advantage to push the limits of what's possible and leave pretenders in our dust. We manufacture our own batteries in our own facilities to our demanding standards.To ensure quality and consistency in our batteries, no matter where they are being sold - our batteries are never re-labled or re-spec'd. Gentlemen, Start Your Engines The RedTop high-performance AGM battery is the ultimate starting battery designed to deliver a powerful burst of ignition power for a reliable start-up every time. It will withstand hard launches, extreme corners and is race proven for every road every day whether it's used as a truck battery, automotive battery, or for other applications. Its reputation as a truck battery or automotive battery is unsurpassed. Strong starting burst More than 15 times the vibration resistance Spillproof, mountable in virtually any position Maintenance-free with up to 2x longer life Faster recharging With impressive high-power delivery and extreme resistance to the most common causes of battery failure, the RedTop is ideal for trucks, SUVs, hot rods, street cars.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/631e6757-4723-451d-88bd-db106b4a462f.__CR0,250,3450,4600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/12251466-b04a-45b9-ad11-6f776de2a26f.__CR0,207,3970,1985_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "SpiralCell Technology At the heart of every OPTIMA battery is a series of individual spiral-wound cells comprised of two pure (99.99%) lead plates coated in a precise coating of lead oxide. One coated plate is positive and the other is negative. The unique manufacturing process of spiral winding continuous lead plates is far more precision-controlled and expensive than building traditional flat plate AGM batteries. Custom automated cell-winding machines are required to maintain the close tolerances required to maintain quality and performance. Critical tolerances, temperatures, humidity and automated processes are maintained and constantly monitored. OPTIMA has built over 100 million individual spiral cells since the early 1990’s.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/8e703077-5de7-4c2c-9b39-dd0236269834._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "What's the difference between OPTIMA RedTop, YellowTop, and BlueTop Batteries? RedTop For normal engine starting where an alternator immediately monitors the state of charge and provides energy to the battery whenever it is needed. This would describe most stock vehicles, including: automotive and RV underhood starting, heavy equipment where starting is the primary function, and diesel vehicles without aftermarket electronics. YellowTop Use this when electrical loads are higher than average, or when the discharge cycle is more than typical engine starting, such as vehicles with multiple electronic accessories and vehicles without alternators. This can also include vehicles with a lot of factory electronics such as power sliding doors and a DVD player. Examples also include: racing vehicles without a charging system, dedicated drag racers, diesel powered vehicles with aftermarket electronics, and vehicles with inverters, winches, or other accessories. BlueTop The BlueTop starting battery (dark gray case) is to be used when a dedicated starting battery is required and it should never be used for cycling duty. Use a BlueTop starting battery for marine applications and RVs when the battery's only function is engine starting. The dual purpose BlueTop (light gray case) can be used for both starting and deep cycling -- it is a true deep cycle battery with extremely high cranking power. Uses include: trolling motors, marine applications with heavy electrical accessories, and RVs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/db99dfe1-83e5-46c2-a576-19a040bfde0e.__CR39,0,3410,3410_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/28031579-2360-4f6d-962a-31276cf70672.__CR0,0,3450,3450_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/df1b37ce-8973-4fcb-bcca-e0d7aa3ea5cf.__CR0,0,3450,3450_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/305d1d39-2507-4eba-8d72-9f35cca0bfbd.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/631e6757-4723-451d-88bd-db106b4a462f.__CR0,250,3450,4600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/12251466-b04a-45b9-ad11-6f776de2a26f.__CR0,207,3970,1985_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/8e703077-5de7-4c2c-9b39-dd0236269834._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/db99dfe1-83e5-46c2-a576-19a040bfde0e.__CR39,0,3410,3410_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/28031579-2360-4f6d-962a-31276cf70672.__CR0,0,3450,3450_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/df1b37ce-8973-4fcb-bcca-e0d7aa3ea5cf.__CR0,0,3450,3450_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "cntrymom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFVSJOR3DBTDC7OSI7RIEQHTVYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REI1YPUGVQVRF?ASIN=B000MSBU9U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Great battery",
                "reviewText": "From the high 90’s to -2 it never failed to start my car.Great battery!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FormosaTiger ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDVRHABAFBNBP25XJLIDDOCKFMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CZI1Q7FHF96L?ASIN=B000MSBU9U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2014",
                "reviewTitle": "5.0 out of 5 stars Battery died again 1 Jan 2017 and it is no longer under warranty.",
                "reviewText": "I bought this battery back in July 2012, it stopped charging and was diagnosed with a dead cell. I contacted Amazon who immediately sent me a replacement under warranty at no cost to me; how great is that? The battery failure was probably related to a bad alternator that I replaced after the battery died.Never had a problem with the battery before the alternator failure. I often use an inverter to run my laptop, printer, and charge items and I can do this for quite a while without running the car.Well its now Mar 2016 and the battery died again after being replaced in 2014, and again Amazon replaced it free of cost, no shipping or any other hassles.Well it's 1 Jan 2017 and the battery is dead again. Alternator and electrical system checks out. I was told at a local parts place that the Optima batteries are junk since they moved their manufacturing to Mexico. Amazon will no longer replace it or refund on the thing. Just as well, tired of having to replace it so often.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "W Wagner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETGO2YM2BD3J7PXKOIQ52LO4NOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R205CHCSTTYIMO?ASIN=B000MSBU9U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Battery",
                "reviewText": "My old car battery died right in the middle of a starter problem I was having. Batteries seem to have gotten much more expensive since I last purchased one so I decided to get the best (OPTIMA) so I wouldn't have any worries for a long while. The OPTIMA fit my battery holder with the bottom spacer that came with it installed and it starts my car much faster. Plus I think it will last longer than a standard car battery. My experience with regular car batteries is that as soon as the warranty period is up, the battery can be expected to die within a couple months. So, a regular 36 month battery seems to die right around 38 months or so. I'm hoping the OPTIMA lasts a lot longer.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dustin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHB6IWCKVYWMBJPSIX6DTQEIBRIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P5B9ZAP9JH2J?ASIN=B000MSBU9U",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "1.0 out of 5 stars Warranty is a joke",
                "reviewText": "This battery has a 3-year warranty (for residential use), but that warranty is apparently only good for 30 days. If you are thinking that doesn't add up, well, I don't either. Let me explain it to you as it was explained to me by the manufacturer, and by Amazon customer service.Let me start by stating that I was a long-time Optima battery proponent. I have owned a lot of vehicles and Optima has been my go-to battery brand for about 25 years. I have probably bought a dozen of them over the years, and have had as many friends buy them as replacements for their vehicles on my recommendation. A recommendation I will no longer make. I heard from others in the automotive community that Optima is not the company that they once were and that their batteries are no longer made as well nor lasting as long. In hindsight it seems that is actually accurate.I purchased the battery a year ago (it lasted literally a few days longer than a year before it suddenly failed). I looked up my order on Amazon, clicked the \"Get Product Support\" button on the order details page which then directed me to contact the manufacturer, so I did.The manufacturer responded stating that \"warranties are handled by the original retail location\" and advised that Amazon would assist with the warranty as the authorized retailer. I responded back to the manufacturer to let them know that the Amazon site sent me to them. The manufacturer doubled down and stated that they sent a message to Amazon to request that they assist me and that they will do nothing else and that it is up to Amazon to take action.The manufacturer was even \"kind\" enough to provide a link to Amazon's \"About Our Returns Policies\" page which states:\"If you've purchased a defective automotive item, shipped from and sold by Amazon.com, that is covered by a published manufacturer warranty, Amazon honors the warranty. Amazon will either replace the item or refund the cost of the item for the life of the published warranty.\"So, I contacted Amazon customer service and detailed the steps that I have taken and what the manufacturer said. The representative then \"checked with a supervisor\" and came back to advise me that Amazon only accepts return or replacement of items within 30 days of purchase. The representative offered to have me speak with a supervisor since she was unable to assist further.After the original representative transferred me, I spoke with a representative stating to be a supervisor and rehashed everything to that point. The supervisor then regurgitated the same 30-day return policy statement. I then pointed out the return policy published on Amazon's site (that the manufacturer pointed me to) stating that Amazon would refund or replace defective automotive items under warranty for the life of the warranty. The supervisor again regurgitated the 30-day return policy. I ultimately asked point blank if the policy meant that the manufacturer's warranty is only honored by Amazon for 30 days. She confirmed that it was. A bit taken back by her response, I then asked if that meant that any items that have a manufacturer warranty longer than 30 days should be purchased from a brick-and-mortar competitor's retail location instead of from Amazon. Amazingly, she said yes to that as well.Long story short, Amazon is pointing at Optima who is pointing at Amazon who is pointing at Optima, and I am stuck in the middle holding the bill, literally and figuratively. I recommend you save yourself $150-$200 and buy a cheap battery from Walmart. At least you know that they will give you a prorated replacement in store when it fails.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tim McGuire",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7IEQ6JXFGUTAUIWHHG5QS7WLEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F8YJVOWC8DNM?ASIN=B000MSBU9U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Confidence is high",
                "reviewText": "I've stopped worrying about running my battery down here in the cold. ❄️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Loni C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVGFT4GDEUDTTNPXCFRUN7XBOTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLLKIGQ554Q9I?ASIN=B000MSBU9U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2022",
                "reviewTitle": "5.0 out of 5 stars Worth every single penny!",
                "reviewText": "I have used Optima batteries in the past. But recently, financially, I simply could not afford one. Then I found myself and husband stranded at the grocery store. I called a tow truck and he used his jump pack to jump start the car. I was flummoxed. I had the battery *and* alternator tested previously due to some starting issues. (failure start) They both tested fine. Thankfully, my insurance coverage pays for things like that so I was not out of pocket money to the driver. That was my clue it was time to stop fussing with cheap batteries and bite the bullet. I am not sorry, not one single bit. The warranty Optima has, the durability, the reliability! The cold starting in the dead of winter. This company has never failed me. If you want a battery that will get you through the winter months, go get one! You think everything is fine, I don't need that. My car starts. Well, remember back in the day when a battery was weak and cars didn't have all the electronics in them? If you are old enough, you know what I mean. It would drag and you'd know simply by trying to start the car. But no. Not new cars these days. If your battery doesn't have enough juice to start the car, it simply will not do a-n-y-t-h-i-n-g! No clicks, no starter grrs, nothing. You think to yourself, \"I'll just drive to the grocery store real quick to get the stuff I need to do the stuff I'm doing.\" Then BAM. Nothing. Stuck. OOOORRR.... you're at the grocery store. Seriously, get your stuff tested before colder weather hits. You do NOT want that tow bill!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$249.99",
                "sellerName": "4Wheel Drive Hardware",
                "sellerRating": "4"
            }
        ]
    }
}