{
    "remaining_requests": 26182,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Battery-Portable-Sparked-Technological-Revolution-ebook/dp/B003A7I2L4",
    "body": {
        "name": "The Battery: How Portable Power Sparked a Technological Revolution",
        "price": "$7.99",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Battery-Portable-Sparked-Technological-Revolution-ebook/dp/B003A7I2L4",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71lfBb-RwML._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Henry Schlesinger",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_ebooks_1?ie=UTF8&field-author=Henry+Schlesinger&text=Henry+Schlesinger&sort=relevancerank&search-alias=digital-text"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 66,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Engineering & Transportation",
                "link": "https://www.amazon.com/Professional-Technical-Nonfiction-eBooks-Kindle/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157626011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B003A7I2L4"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ HarperCollins e-books; Illustrated edition (February 27, 2010)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 27, 2010"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1382 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 324 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#872,983 in Kindle Store (See Top 100 in Kindle Store) #40 in Electromagnetic Theory #49 in Industrial Technology (Kindle Store) #93 in Electromagnetism (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 66 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marcello Malpighi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5FRTTAMYRVOT52EV4VMWL36MCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PUC676JGQ93M?ASIN=B003A7I2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 23, 2011",
                "reviewTitle": "5.0 out of 5 stars Extra energized",
                "reviewText": "This is how history of technology books should be written. Beyond the captivating narrative you can detect the depth of research that went into putting it together. Pretty much every page has a factoid, a tidbit of information that makes reading this book like a treasure hunt. We are so used to batteries that we probably don't stop and wonder why we have alkaline batteries while most of the technology evolution was about improving the acid. Why have batteries the shape they have. Why there is no \"B\" battery anymore. How consumers went from replacing battery fluids to hook up to the power grid. The - now - obvious design of a flashlight. This sounds awfully technical and even boring, but the author is master of his skill. He can feed you this information in one word, or one short comment. Sometimes the author winks at you as if to say: I will hide a whole drama under one single simple sentence, you know it and I know it, but would others get it? For example: he tells of two inventors of the transistor and their supervisor. Left unsaid was that the supervisor also got the Nobel prize for the invention after his frantic scramble to rewrite history and literally put himself in the picture. Same with Edison and the vacuum tube, or Marconi and the wireless. Well done!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr Battery",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6BEACLTQNIP2B2GLWWIR7JZRZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13LJ3HW7S5O69?ASIN=B003A7I2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2010",
                "reviewTitle": "5.0 out of 5 stars Mr. Battery",
                "reviewText": "The author does a superb job making technology entertaining for all types of readers. His book documents over 200 years of research and development throughout the world leading to the common commodity called \"the battery.\" This invention plays a very important part in almost everything we do. The author also paints, like all artists, a bright future for the battery. If you are in the energy business or thinking about buying one of those new electric cars you will see on the roads in the next few years - buy this book, it is worth the read.Learn about all the \"rock stars\" of science. This book is a must read for anyone who decides to contribute to solving our energy crisis.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Timothy L Mayer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE27VZCTERWTUI27L3AHAW5COPVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ESIT6FS947DR?ASIN=B003A7I2L4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2015",
                "reviewTitle": "4.0 out of 5 stars Juicy!",
                "reviewText": "The Battery: How Portable-Power Sparked a Technological Revolution is a good book to introduce people to the history of electric batteries. Not too technical or period specific, the book traces electric power evolution and its portable applications from the end of the eighteenth century to the present. Although the book fixes on the history of electric power, its principal emphasis is on battery development. I just wish the author had stuck to the topic.The first few chapters discuss the developments in science which showed how electricity could be generated and stored. There is a drawing of a Leyden jar and discussions of Ben Franklin’s experiments with a kite. Finally we get to Galvani who showed how chopped frogs’ legs could jump if sparked with electricity. This lead to the first battery by Alessandro Volta who discovered dissimilar metals could create electricity. Alternating pieces of silver and zinc separated by wet cards created electricity. In 1800, this became known as the voltaic pile.Soon the book turns to Michael Faraday, the bookbinder’s apprentice who became one the most prominent scientists of the 19th century. Faraday’s work on electrical power is important in the history of batteries, but Schlesinger felt he deserved an entire chapter. This is my one complaint of the book: historical characters close to the author’s interest get an inordinate amount of attention. I would’ve preferred to hear more about how John Daniell came up with his “constant battery” in 1836. At least the author gives Joseph Henry (who was a contemporary of Faraday) some credit for his work on electromagnets.Schlesinger spends a lot of verbiage on the history of the telegraph, Morse codes and transatlantic cable before returning to the reason for including them in the book: the need for portable batteries to power these systems. He does quote extensively from this 1880’s battery manual:“In renewing this battery the zincs should be scraped and well cleaned with a stiff brush, the porous cups thoroughly washed, and the old solution contained in them thrown out, with the exception of about one third of the clear portion, which should be returned, otherwise the battery will require some hours to recover its full strength. The copper deposit upon the zincs is valuable, and should be preserved.”The book returns on track by discussing the 19th century battery giant, Gaston Planté. Considered the inventor of the rechargeable wet cell battery, Planté spent 30 years on his goal of a reusable battery. I must give credit to the author for summing up how a rechargeable battery works with these precise few sentences:“Very simply, when a battery discharges, it releases electrons from a metal and through the negative electrode to external circuitry that powers a device and then back into the positive electrode. During normal use, a battery’s negative pole becomes oxidized, sending off electrons, while its positive pole gives up oxygen. When a storage battery is recharged, the positive pole is oxidized and the negative pole reduced, shedding the positively charged ions it accumulated during use.”The same chapter discusses the work of Alexander Gram Bell on the telephone and Thomas Edison on using batteries to power lights. Although it’s not widely known, Edison thought storage batteries were a waste of time. Most of his development work took place on primary (non-rechargeable) nickel iron batteries. Again, the book goes a little off track looking at the many charlatans who thought electricity was the cure for all ills.At the end of the 19th century the German chemist Carl Gassner hit on the idea of the “dry cell” battery. Schlesinger details how the Nation Carbon Company in Cleveland, Ohio adapted Gassner’s idea into the modern cylindrical battery so many of us use in our daily lives. Here was a battery perfect for the consumer market: it provided steady power and didn’t leak. National Carbon would later buy another company, known as Every-Ready, which made flashlights. This is where the popular battery name originates.The book runs off the track again for another few chapters discussing electrical development. Perhaps a better name for this book would’ve been The Electricity. Schlesinger’s style is up-beat and he enjoys writing about people such as Marconi and Edison. But, uhm, vacuüm tubes? Can we stick to the subject?A good example is Samuel Ruben, the self-taught inventor who came up with the trickle-charger, a device used to keep automobile starter batteries charged during long periods of inactivity. Ruben worked on the alkaline manganese battery which is still widely used today. But the book gives him only a few pages.The Battery really doesn’t get back into the subject until the Lithium ion battery in the 1970’s. Most of the chapters before this decade concern themselves with electricity, electronics, and transistors. There is a sense of wonder in what he writes about. I didn’t know anything about Texas Instruments production of the first transistor radios until reading about it in the book. The Battery concludes with a look at the many types of batteries under research and where they are headed. And from first paragraph of the epilogue:“Predictions far into the future are always dangerous. This is painfully evidenced by the legions of baby boomers who have grown to middle age and beyond still waiting for the arrival of flying cars and personal jet packs promised in the magazines of their youth.”As a book on batteries, it’s wanting. But as a general history of electricity, this book is excellent. It’s just too bad the author couldn’t keep the focus to make it an extraordinary piece of writing. The book’s style does make me want to find more books by the same author. It’s a very readable book as he writes with an entertaining style. Just wish he’d spent more time on batteries in particular and less on electricity in general.www.howbatterieswork.com",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Russ Wigglesworth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3QQUUSRXFGKZD5TIB3EPCJSQLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8QMEV7ZSMH0N?ASIN=B003A7I2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 22, 2020",
                "reviewTitle": "5.0 out of 5 stars What powers modern life?",
                "reviewText": "Really more of a history of electricity and the gadgets/technology created along the way. The battery was just around longer than the generator so it gets more of the credit. Needs an update as the past 10 years of battery technology, especially in the electric vehicle area, has grown considerably. Good read, not overly technical nor difficult to understand. Middle schooler would follow it easily.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Witzel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF66Y6NGH6HRQZBIEDSF5UGAXJ2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7YUYR19SRIER?ASIN=B003A7I2L4",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 1, 2010",
                "reviewTitle": "3.0 out of 5 stars Great reading as long as you are not an EE",
                "reviewText": "I thought this book was well worth the money even though the author really needed to run this past a technical reviewer before submitting it for publication; I can't believe the publisher HarperCollins didn't bother with this either. I will wait and pay more attention to others peoples reviews nexttime before I buy a technical book from HarperCollins.Being an Electrical Engineer I found the authors credibility sink lower each time I came across another of many technical errors. At the very least I expect any technical author to know the difference between voltage and current when writing a book on batteries; I found well over a dozen different technical errors in the 300 pages.Having said all that I also have to say I did very much enjoy the book, it was a good historical read and held my attention until the last pages. I would recommend it to others as long as they read it like a novel and not try and expand themselves technologically from it.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH35V2XWKD6VXUPIPRL6KX2P56IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NSOUYRLLPY9B?ASIN=B003A7I2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2021",
                "reviewTitle": "5.0 out of 5 stars Not just about batteries",
                "reviewText": "This is an entertaining and highly readable account of the harnessing of electricity and its eventual storage methods. A real page-turner, as they used to say, eventually touching on such related subjects as the telegraph, the vacuum tube and the transistor. An excellent book and a well-told story.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Krysi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 27, 2021",
                "reviewTitle": "Ich habs gern gelesen",
                "reviewText": "Hat mir gut gefallen.Das Buch handelt vor allem von der Geschichte der Batterie. Besonders an Beispielen vieler berühmter Erfinder und großer Technischen Leistungen der Geschichte (z.b. Telegrafenleitung durch den Atlantik, )Über die moderne Batterietechnologie wird fast nichts erklärt. Da müsst ihr was anderes lesen :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colin Feltham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 27, 2014",
                "reviewTitle": "Technology buffs must read.",
                "reviewText": "This book is the precursor to all of our new technology, well worth the read. Well be off interest to all electronics students.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H. Bolten",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 4, 2014",
                "reviewTitle": "Excellent book",
                "reviewText": "I enjoyed the book very much. It describes the exploration and development of electricity, electrical applications and batteries and provides very interesting biographies of the scientists and engineers involved.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}