{
    "remaining_requests": 30654,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sauder-Select-5-Shelf-Bookcase-Cherry/dp/B006R9VNSG",
    "body": {
        "name": "Sauder Miscellaneous Storage 5 Bookcase/Book Shelf, L: 35.28\" x W: 13.23\" x H: 69.76\", Select Cherry finish",
        "price": "$165.99",
        "originalPrice": "$189.99",
        "rawPrice": 165.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sauder-Select-5-Shelf-Bookcase-Cherry/dp/B006R9VNSG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CHZT9DNP"
        ],
        "asinVariationValues": [
            {
                "asin": "B079HBQHBR",
                "variationName": "Color",
                "variationValue": "Chalked Chestnut Finish",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51NP8wkXlSL._SS36_.jpg"
            },
            {
                "asin": "B01FYC2DOO",
                "variationName": "Color",
                "variationValue": "Lintel Oak",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51eLVWPywjL._SS36_.jpg"
            },
            {
                "asin": "B01FG92PD4",
                "variationName": "Color",
                "variationValue": "Salt Oak",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51LGHHoUiCL._SS36_.jpg"
            },
            {
                "asin": "B006R9VNSG",
                "variationName": "Color",
                "variationValue": "Select Cherry Finish",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31hXngZ6ggL._SS36_.jpg"
            },
            {
                "asin": "B00AHPRMW2",
                "variationName": "Color",
                "variationValue": "Washington Cherry Finish",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51dU+Lzo30L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71JQRFfhsIL._AC_SX569_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Sauder Store",
            "link": "https://www.amazon.com/stores/SAUDER%C2%AE-DROPSHIP/page/EAA9D34A-4FF0-4564-B6D4-AC0522168368?ref_=ast_bln"
        },
        "brand": "SAUDER®-DROPSHIP",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 7882,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 6 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1",
            "Three adjustable shelves for flexible storage options",
            "Quick and easy assembly with patented slide-on moldings to save you time",
            "Select Cherry finish",
            "Engineered wood construction",
            "Assembled dimensions: L: 35.276\" x W: 13.228\" x H: 69.764\"",
            "Five open storage shelves for your favorite home décor.",
            "Finished on all sides for versatile placement anywhere in your home."
        ],
        "description": "Give your home a fresh new look with this 5-shelf bookcase from the Sauder Select collection. With three adjustable shelves, it is perfect for storing and displaying books, magazines, candles, bins, or your collection of action figures. Finished in Select Cherry, this library is a versatile fit for the living room, bedroom, or office.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Home Office Furniture",
                "link": "https://www.amazon.com/Home-Office-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063312"
            },
            {
                "name": "Bookcases",
                "link": "https://www.amazon.com/Bookcases-Furniture-D%C3%A9cor/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10824421"
            }
        ],
        "productInformation": [
            {
                "name": "Mounting Type",
                "value": "Freestanding"
            },
            {
                "name": "Room Type",
                "value": "Living Room"
            },
            {
                "name": "Shelf Type",
                "value": "Barrister Shelf"
            },
            {
                "name": "Number of shelves",
                "value": "5"
            },
            {
                "name": "Special Feature",
                "value": "Adjustable"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Storage"
            },
            {
                "name": "Material",
                "value": "Engineered Wood"
            },
            {
                "name": "Finish Type",
                "value": "Select Cherry Finish"
            },
            {
                "name": "Care instructions",
                "value": "Wipe with Damp Cloth"
            },
            {
                "name": "Furniture Finish",
                "value": "Cherry"
            },
            {
                "name": "Product Dimensions",
                "value": "13.23\"D x 35.28\"W x 69.76\"H"
            },
            {
                "name": "Size",
                "value": "L: 35.28\" x W: 13.23\" x H: 69.76\""
            },
            {
                "name": "Item Weight",
                "value": "88 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 7,882 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,600 in Home & Kitchen (See Top 100 in Home & Kitchen) #27 in Bookcases"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Brand",
                "value": "Sauder"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Manufacturer",
                "value": "Sauder Woodworking"
            },
            {
                "name": "Included Components",
                "value": "Materials, Assembly instructions, Hardware"
            },
            {
                "name": "Model Name",
                "value": "Miscellaneous Storage"
            },
            {
                "name": "Target Gender",
                "value": "Unisex"
            },
            {
                "name": "Model Number",
                "value": "412835"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Style",
                "value": "Transitional"
            },
            {
                "name": "Assembly required",
                "value": "Yes"
            },
            {
                "name": "Number of Shelves",
                "value": "5"
            },
            {
                "name": "Product Care Instructions",
                "value": "Wipe with Damp Cloth"
            },
            {
                "name": "Material Engineered Wood",
                "value": "Mounting Type Freestanding"
            },
            {
                "name": "Shelf Type Barrister Shelf",
                "value": "Shape Rectangular"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b703f603-264b-4c12-a03a-ff184023f2ea.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/84f9f6d6-0472-4411-8bd1-1bafdb3da86b.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/810cd160-9674-4cd8-a526-101864e50d9e.__CR0,0,1940,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tessa STessa S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHG4FB5DVWXI6LT3V7GVN3VF73Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUHPP9N7ZUSSU?ASIN=B006R9VNSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 12, 2023",
                "reviewTitle": "5.0 out of 5 stars 4.5 Stars 🌟",
                "reviewText": "I love this bookshelf! It looks really nice. If Amazon had a half star option, I'd be giving it 4.5 stars. The reasons I'm docking off half a star are:1) There was a scratch on one of the top front pieces. However, it's not very large or super noticable, and I'm sure I could cover it with a similar colored Sharpie or something, so I didn't bother trying to get a replacement because that would just be a hassle. But the packaging the shelf came in wasn't damaged at all, so I'm guessing it happened when the pieces were being put in the box. But things happen, I'm not upset about is as it's an easy enough fix.2) I read a lot of reviews saying this was easy to put together, but I wouldn't necessarily say it was easy. I'm fairly handy with tools, having put together a lot of furniture and doing minor home repairs on my own. I put this bookshelf together by myself. It took a couple hours and some steps required a lot of arm/hand strength to get the screws in, and I ended up stripping a lot of the screws just trying to get them screwed all the way in. I'm thinking using a drill would have made things a lot easier, but the instructions say not to and I'm usually one to do things by the book, so I didn't. However, if I had to put together another one of these, I think I'd probably go ahead and just use a drill for some of the steps to save time and avoid getting frustrated.3) Some reviews say that the shelf doesn't seem sturdy on the sides, like it'll topple over onto itself, but I disagree. It seems very sturdy once put together and I'm not at all worried about it falling apart. BUT, I'm not so sure that it wouldn't fall forward if pulled on or hit. I have 2 dogs (50 and 60 lbs) that sometimes play rough, so I absolutely used the safety strap to attach it to the wall because I'm not confident that the shelf wouldn't fall forward if they were playing and rolled into it or something. I do have it on a carpeted floor, so maybe on a hardwood floor it would feel more stable. I don't like that the safety strap pokes through a big hole in the backboard of the bookshelf. I feel like the hole doesn't need to be so big. I ended up cutting the circle that comes off the backboard, leaving enough of a space for the safety strap to poke through, and then taping the rest of the circle back in place from the back so it's not as visible.Overall, I think this is a well made, beautiful piece of furniture. I'm glad this is the one I chose to purchase, and I have no regrets in buying it. I think it will hold up for quite a while.Also, props to the Amazon driver who delivered it! It was a little heavy, and I was home by myself and worried I wouldn't be able to get it inside on my own without opening it and carrying it in piece by piece. It was raining though, and that wouldn't be ideal, so he carried it inside and set it down in my living room for me. He was very nice and I appreciate him taking that extra step to make my life a little easier!",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61rW2r+QDML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715V1tMfeYL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Makala CharlesMakala Charles",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3ZEAIW6376VJMUHDJGCNNLL5FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O2IBP9WHBHZ4?ASIN=B006R9VNSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Best Bookshelves",
                "reviewText": "I have gotten multiple of this brand throughout the year. In total, I own 5. In the last 5 years, which is when I started buying them, they have not warped. They are sturdy, easy to assemble, they're not wobbly whatsoever. These are seriously the most gorgeous, best quality shelves I've ever gotten at a VERY reasonable price. I'd honestly pay double for this quality. As a book lover, I take pride in my books and these are the only shelves I've ever found that are suitable enough for them. The cherry wood gives them an elegant look and they're some of my most prized possessions. Highly recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7181bw4SWiL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Sp+LPBexL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Knoxpatch Norm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2P5TFPZR5LLMZHNOBQ2AG72VAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MDV0PGEERTAW?ASIN=B006R9VNSG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 8, 2023",
                "reviewTitle": "4.0 out of 5 stars Gorgeous Finish on Particle Board",
                "reviewText": "I bought and assembled three of theseshelf units. In my home office, they arevery useful and look really nice. I gotthe cherry finish, and it is justgorgeous, prettiest furniture finish Iever saw.From 15 feet away, one of the shelf unitslooks nice enough for nearly any office orliving room. But since the unit isdesigned to be assembled by the customer,up close it does not look quite as nice ashigh quality traditional furniture making.While the unit seems designed well enoughfor its intend purpose and usage, due tothe particle board, the unit does not lookas rugged as, say, some units I have insolid oak from about 100 years ago.There is an instruction book thatdocuments how to assemble the unit in 14steps. The 'technical writing' is verygood.Along with the particle board pieces,there are some small pieces, nearly allmetal. All these small pieces come in aplastic bag. Suggestion: Get 12 littlebowls and sort each piece type into itsown bowl.Some of the details of how the shelves areassembled are innovative. Mostly theshelves are held together with some 'pins'and 'cams'.For joining two pieces of the particleboard, say, X and Y, piece X has a holefor a pin and piece Y has a correspodinghole for the other end of the same pinand, at the end of that hole, a hole inthe surface for a cam. Then when pieces Xand Y are joined, one end of the pin willbe in the hole in piece X and the otherend in the hole and cam of piece Y.The pin is a little complicated: The endthat goes into the cam has a grove thatfits into the side of the cam and getspulled on as the cam is turned. The otherend has some tough, black plastic. Whenthe cam is turned, the pin tries to slideout of the black plastic, and the blackplastic expands and makes the pin tight inthe hole in piece X.Suggestion: Put the pin in the hole inpiece X and then move piece Y to slide itshole over its end of the pin.If the pin is in piece Y first, then asmove pieces X and Y into position and getthe pin in its hole in piece X, theplastic can be damaged and have its end ofthe pin no longer fit in the hole in pieceX. When this happened to me, I just useda knife to trim a little of the blackplastic. But, still, I suggest, put thepin in the hole in piece X first, makingthe black plastic safe, and then movepiece Y in position. The end of the pinwith the plastic is delicate; the otherend is not.Mostly the unit is to be assembled on afloor, on its back. You may want somegood knee pads -- not a joke.Okay, there is a risk of damaging the unitand, thus, have to be careful. In detail,there are 6 shelves, three are adjustable.For the other three, there is the top, thebottom, and one between those two.The top and the bottom have decorativepieces. Then to attach the back, flip theunit on its front and have the back up.The two decorative pieces will then be incontact with the floor, and due to thesedecorative pieces, the 'between' shelfwill NOT be in contact with the floor andwill be about 2 inches from the floor.THEN: Do NOT lean on the shelf unit!! Iflean very hard, say, using the unit tohelp stand, can have a pin be pulled outof its hole bringing much of particleboard surface of its hole along with it.Solution: Get two thick books, say, 1000pages each, and put one at each end of the'between' shelf and between that shelf andthe floor. Then can lean on the unitwithout damaging it.The back is thin, made of two pieces, andget attached with 3/4 inch long nails.Budget the use of the nails or might runout. I wanted more nails. The nails thatcome with the unit are good, and wouldhave to look carefully to find extras justas good.In attaching the back pieces, should gettheir position accurate within about 1/16of an inch everywhere. With lessaccuracy, might have some of the backextend beyond the unit. Also each of thenails has to go into the edge of a pieceof particle board, hopefully into thecenter of that edge. Else the nail canprotrud from and damage the surface of theboard. Also want each nail not too closeto the edge of the back. Such alignmentneeds the 1/16\" accuracy.One piece of the back, the 'upper' piece,covers from the 'between' board to the topboard. This piece attaches first. Theother piece, the 'lower' piece, coversfrom the 'between' board to the bottomboard and overlaps the upper piece wherethe upper piece already covers the edge ofthe 'between' board.Then, of course, the part of the unitwhere the upper piece attaches mayslightly fail to be a rectangle. So, getthe upper piece very carefully positionedso that its lower edge just covers theedge of the 'between' board and nail thepiece to the 'between' board. Then 'skew'the upper part of the unit so that it isaccurately a rectangle, put a nail in eachof the two upper corners of the upperpiece to hold the alignment achieved, andthen put in the rest of the nails in theupper piece. That is, to get the upperpiece attached within 1/16\", expect tohave to use some 'skew'.Similarly for the lower piece.There is a chance that, at the edge of the'between' board, a nail for the lowerpiece could hit a nail for the upperpiece. So, after nailing the upper pieceto the edge of the 'between' board, foreach of those nails mark on the upperpiece a little above the 'between' boardwhere the nail is so that when nailing thelower piece can avoid each nail already inthe upper piece.When nailing the lower piece to the upperpiece and into the edge of the 'between'board, for each nail need some way to knowwhere to start the nail to have it enterthe center of the edge of the 'between'board. At the ends of the 'between'board, it is easy to locate nailscorrectly. So put a nail at each end andhave a loop of kite string from one of thenails to the other and then to a hangingweight to make the string tight andstraight. Then put the rest of the nailsin the bottom piece between the two piecesof string. Or use a chalk line or draw aline using a yard stick as a straightedge.The 'between' board gets a piece of edgetrim. It is to be attached with rightangle brackets. Each bracket gets twosmall screws. The instructions say thatthis piece of edge trim should be attachedwhen the unit is on its back on the floor.With the unit in this position, the littlescrews are very awkward to install, wouldbe easier for someone the size of akitten. An easy solution is to lift theunit to the vertical with the top down.Then the screws are easy to install.There are several screws. They all need a#2 Phillips head screwdriver.For installing the nails, finally Idecided to use two extra tools, a pair ofneedle nose pliers and a strongflashlight. Then for each nail, hold itjust under its head in the tip of thepliers. Use the flashlight to remove allshadows from the desired location of thenail. Then position the tip of the nailcarefully, make the nail vertical, give atap or two with the hammer, move thepliers out of the way, and finish drivingin the nail. The unit comes with a littleplastic gauge for such positioning, butwhen I squeezed a nail, it would jump outof the plastic and land a foot or twoaway.",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michele Gauthier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 5, 2023",
                "reviewTitle": "S’aider 5 shelf bookcase",
                "reviewText": "The media could not be loaded. The instructions to build the shelf unit were the best I have ever seen. They were very clear. Great job!The shelf unit is beautiful and well made. I would highly recommend this product and I would buy it again in a heartbeat!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/B1iPFz82faL.mp4"
                }
            },
            {
                "reviewerName": "AS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 12, 2023",
                "reviewTitle": "Bueno",
                "reviewText": "Luce muy bien, solo no se fija mucho.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ペーター",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on August 14, 2022",
                "reviewTitle": "独りで組立しました。",
                "reviewText": "組立大変だった。二人以上で。出来上がりは、素晴らしい特に木肌の色が何ともいえない。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J JACOME",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 2, 2022",
                "reviewTitle": "Daños en transporte",
                "reviewText": "El mueble es bueno…. Su armado requiere habilidades y ayuda.Trajo dos detalles en las molduras seguramente provocadas por el mal manejo del paquete",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John R.John R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 12, 2020",
                "reviewTitle": "very heavy and sturdy",
                "reviewText": "took several weeks to come .it was very carefully packagedlot's of Styrofoam protection, but lot's of little bits sticking to everything.I opened on the porch and cleaned each piece with my vacuum.Instructions are clear and easy to follow.I like to think I'm handy and I do follow Instructions carefully.it took me around 4 hours I think.I did have few coffee ☕ so hard to say.it is heavy and very sturdy.I'm very impressed with the build and look.She has lots of hand bags and shoes in the closet so I'm thinking a second unit will be handy for them",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714ThsFpTUL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}