{
    "remaining_requests": 30635,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Winsome-Wood-99342-Studio-Shelving/dp/B000NPQLAU",
    "body": {
        "name": "Winsome Wood Studio Shelving, Honey",
        "price": "$74.69",
        "originalPrice": "$192.30",
        "rawPrice": 74.69,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Winsome-Wood-99342-Studio-Shelving/dp/B000NPQLAU",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08CNPW9LM"
        ],
        "asinVariationValues": [
            {
                "asin": "B000NPQLAU",
                "variationName": "Style",
                "variationValue": "Shelving",
                "price": "$74.69",
                "variationImageURL": ""
            },
            {
                "asin": "B08C7X62M9",
                "variationName": "Style",
                "variationValue": "Shelving + Home Office",
                "price": "$157.68",
                "variationImageURL": ""
            },
            {
                "asin": "B09R29WVRD",
                "variationName": "Style",
                "variationValue": "Shelving + Shelving, Natural",
                "price": "$166.72",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71TGwFiW6sL._AC_SX679_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Winsome Store",
            "link": "https://www.amazon.com/stores/Winsome/page/18A0FEAB-9A8E-4A09-A8D0-2BB4544B51AD?ref_=ast_bln"
        },
        "brand": "Winsome",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1326,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20. Order within 19 hrs 46 mins",
            "FREE delivery Tuesday, February 20. Order within 19 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Solid / Composite Wood",
            "4-tier bookshelf offers classic casual style",
            "Crafted of solid beechwood with warm Honey finish",
            "Rectangular shelves with ladder-style sides and narrow back rails",
            "Matching computer desk, corner table, printer stand, file cabinet, and bookshelf available",
            "Assembly required; measures 26-inch wide by 12-inch deep by 42-inch high"
        ],
        "description": "Product Description Showcase a favorite book collection, display photos and souvenirs, or organize a home office with Winsome Wood's four-tier bookshelf. Crafted of solid/composite wood, this simple style features deep shelves, open ladder-style sides, and narrow back support rails. The warm Honey finish brings out the wood's lovely grain and adds an inviting, casual glow to any room. The bookshelf also matches Winsome Wood's computer desk, writing desk, corner table, printer stand, and file cabinet. It measures 26 inches wide by 12 inches deep by 42 inches high. Assembly is required. Amazon.com Showcase a favorite book collection, display photos and souvenirs, or organize a home office with Winsome Wood's four-tier bookshelf. Crafted of solid beechwood, this simple style features deep shelves, open ladder-style sides, and narrow back support rails. The warm Honey finish brings out the wood's lovely grain and adds an inviting, casual glow to any room. The bookshelf also matches Winsome Wood's computer desk, writing desk, corner table, printer stand, and file cabinet. It measures 26 inches wide by 12 inches deep by 42 inches high. Assembly is required. --Kara Karll",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b?ie=UTF8&node=1063306"
            },
            {
                "name": "Home Office Furniture",
                "link": "https://www.amazon.com/Home-Office-Furniture/b?ie=UTF8&node=1063312"
            },
            {
                "name": "Bookcases",
                "link": "https://www.amazon.com/Bookcases-Furniture-D%C3%A9cor/b?ie=UTF8&node=10824421"
            }
        ],
        "productInformation": [
            {
                "name": "Room Type",
                "value": "Office"
            },
            {
                "name": "Shelf Type",
                "value": "Wood"
            },
            {
                "name": "Number of shelves",
                "value": "4"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Indoor, book shelf, display shelf and more"
            },
            {
                "name": "Material",
                "value": "Wood"
            },
            {
                "name": "Finish Type",
                "value": "Honey"
            },
            {
                "name": "Care instructions",
                "value": "Wipe with Damp Cloth"
            },
            {
                "name": "Furniture Finish",
                "value": "Honey"
            },
            {
                "name": "Product Dimensions",
                "value": "12\"D x 25.98\"W x 42.01\"H"
            },
            {
                "name": "Size",
                "value": "3"
            },
            {
                "name": "Item Weight",
                "value": "31.97 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Assembly required",
                "value": "Yes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,326 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#173,091 in Home & Kitchen (See Top 100 in Home & Kitchen) #447 in Bookcases"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Brand",
                "value": "Winsome"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Manufacturer",
                "value": "Winsome Trading, Inc."
            },
            {
                "name": "Included Components",
                "value": "See description"
            },
            {
                "name": "Model Name",
                "value": "Studio"
            },
            {
                "name": "Model Number",
                "value": "99342"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Style",
                "value": "Shelving"
            },
            {
                "name": "Back Style",
                "value": "Backless"
            },
            {
                "name": "Number of Shelves",
                "value": "4"
            },
            {
                "name": "Product Care Instructions",
                "value": "Wipe with Damp Cloth"
            },
            {
                "name": "Assembly Required",
                "value": "Yes"
            },
            {
                "name": "Material Wood",
                "value": "Shelf Type Wood"
            },
            {
                "name": "Shape Rectangular",
                "value": "Finish Type Honey"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Winsome Studio Bookshelf Offering substantial storage space with a polished and sleek look, the bookshelf is perfect for holding extra computer supplies. Mix and match with the rest of the Studio Home Office line. Specifications Overall dims 25.98\"W x 12.01\"D x 42.01\"H Shelf dims 22.83\"W x 11.14\"D Spacing between shelves 12.01\"",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b9bfe79-5e3e-4a0a-8988-a6b66a44f86d.__CR0,0,2000,2000_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f53e5675-9486-4cc0-86df-5024a493888c.__CR0,0,1800,540_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b9bfe79-5e3e-4a0a-8988-a6b66a44f86d.__CR0,0,2000,2000_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "~MS Warrior~",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZY7UUJONXI5P2DMFJSHG7RBLMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I9T1R7D4VD4W?ASIN=B000NPQLAU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2022",
                "reviewTitle": "5.0 out of 5 stars WOW!!! This is WONDERFUL!!!",
                "reviewText": "I'm very, VERY impressed with this!!! SO happy I bought it!!! I actually purchased it for my Mom, her husband passed a yr ago. She wanted to change her living room (it's a smaller living room) around! She had her husband's ashes, in a beautiful wooden box. As well as, the American flag, he was a Vietnam Veteran! And several other treasured items! I LOVE REAL WOOD!!! It's a must, if I'm buying furniture!! The color was fantastic!!! It's solid and, it IS very sturdy!! My Son assembled it, which we were all impressed with 1, how simple it was 2, how sturdy the assembling made it!! Meaning, the way the shelves lock together, the little \"wooden knob/pegs\", fit together perfectly!!My Mom has already ask, if I could order her another one, for her bedroom!! I too am also going to get one! I'm moving, right now but, coming back as soon as I get settled, to order me one, too!! My Son also wants one ordered!!I order alot online! This was the BEST item, I have EVER ordered!! Thanks to the seller!!! It arrived really fast!! Wrapped very, very well!! THANK YOU!!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colloquor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3UNOPVH7JLZ2ZHHSTMNG4IWYYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R398AIY1VDAG70?ASIN=B000NPQLAU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2012",
                "reviewTitle": "5.0 out of 5 stars Very Nice Bookshelf for the Price!",
                "reviewText": "Being senior citizens (both of us are a tick over 60), my wife and I have always bought the best furniture we could afford from the day we were married. Since we were into Early American and Traditional furniture, furniture makers such as Ethan Allen, Pennsylvania House, and Tell City were the sources we bought our wood furniture. Solid hard rock maple, cherry, and walnut, these types of wood furniture are what we've invested in over the years. These were not veneered plywood-based pieces, but solid hardwoods in the aforementioned woods. Expensive... yes (for example, $1,200 in the mid-'80s for a Queen Anne style sofa table), but they look as good now as they did when we purchased the majority of them 25 to 40 years ago. Ethan Allen is still around, but they've reinvented themselves, and both Pennsylvania House and Tell City no longer exist. It seems the younger generation desires cheap, e.g. throwaway furniture, thus great American furniture companies have gone away in favor of those in China, Thailand, Vietnam, and IKEA's many sources, which often tends to be Poland.Why did I discuss these companies, simply to lend some credibility that I know how good furniture is built, in terms of joinery, and overall construction and attention to detail. For the price paid for the Winsome Wood 4-Tier Bookshelf in Honey, this item is an excellent value. Is the joinery perfect? No, but it's certainly good enough for its use and $79 price! I'm not certain of the type of wood used here since the country of origin is Thailand, but its real solid wood, not a veneered form, and certainly not particle or flake board based. It's likely a wood that's plentiful in Thailand - if any other owner knows the wood type, please comment. The joinery on the upright side pieces is acceptable; the joinery on the individual shelves is excellent.The instructions, essentially graphically based, are very straightforward and easy to follow. The instructions recommend two people for assembly, but I assembled it by myself in less than 30 minutes. One area was, and still is, a bit cloudy, and that pertains to the three horizontal pieces that connect the left and right uprights at the rear of the unit. These pieces have two dowel pins on each end that fit into two holes at the rear of the left and right upright piece. The dowel pins are fluted, and this implies that wood glue should be used. Nothing was stated, or graphically implied, regarding the use of wood glue at these twelve strategic points. I submit that if you plan to never knock this down into its individual pieces again. you may wish to strongly consider the use of a bit of wood glue on the dowel pins. However, if you do plan to take it apart in the future, certainly don't use the glue. I didn't use wood glue, and have noticed these three horizontal pieces do rock a bit back and forth. I'm seriously considering taking it apart, and applying wood glue to the dowel pins, as I'm sure it would increase the structural strength at the rear of the unit.I did not use the 4mm Allen hex wrench supplied in the package to install the hex head wood screws. Rather I used a hand driver with a 4mm hex head for the initial \"loose\" tightening of the screws. I put some Bee's Wax on the threads of the screws, and this makes the process much easier as it lubricates the threads and wood during the tightening process. This is an old wood worker's trick to ensure that you don't crack the wood. A bar of hand soap, especially Dove, will work in a pinch. I performed the final tightening after all of the shelves were installed with a 4mm hex head extension on a 3/8\" socket and ratchet. This made the installation of the top very easy, as the supplied 4mm Allen wrench interferes with the upright side pieces when tightening the top shelf. I know many homeowner's don't have these various types of tools, but I used to work on European cars as a hobby, and I have tons of unique Metric tools, including socket sets with Metric hex head drivers.The color is a touch lighter in color or hue than viewed on Amazon's product page, but this could be the calibration of my LCD monitor. It's used in our finished basement with some oak office furniture that I hand finished with walnut Danish wiping oil, so the Winsome bookshelf is certainly a lighter shade than the oak, tending toward almost a light to medium maple color. But, it's totally acceptable for our application to hold photos, and other small items. The finish on the uprights and the tops of the shelves are fine with no roughness whatsoever. It's obvious there's a difference in finish of the top and bottom of each shelf, but the tops of the shelves on our unit were sanded smooth and the finish was even. All in all, very acceptable finishing of the bookshelf. We considered a leaning shelf, aka ladder shelf, for this application, but we have a cat, and we've been told that the leaning shelf becomes a new toy for any feline!Overall, this bookshelf is a serious bargain at Amazon's current price point. Go to Wally World or any other Big Box store and price out something similar in particle board. There is absolutely no question that this is superior to any particle board-based inexpensive bookshelf. What amazes me is given Amazon's profit margin, the margin of the importer (Winsome), what the cost of production of this product must be. No wonder American companies can no longer compete at the low end with this type of real wood product. This bookshelf probably hits incoming customs at a cost of less than $25 to $40 per unit (likely even less I'll wager), and that's simply unbelievable given the overall quality of this bookshelf.",
                "reviewVotes": "198 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMK6RGHHHEGZ6YCEP4TIBXRG2IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AH8D0FNR3VAK?ASIN=B000NPQLAU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Sturdy and good looking",
                "reviewText": "I am using these shelves to store clothes and they work well. The honey color matches my othee furniture. They took some time to assemble but i think they will be not bad to dissemble and move. They are small enough to pick up and i like the solid top for my airfilter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ZeeZee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECNEHUIF7VAZCXRKKYYNNMDNLQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RS75L9BA7796?ASIN=B000NPQLAU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2009",
                "reviewTitle": "4.0 out of 5 stars Good quality and priced well.",
                "reviewText": "This is a good quality bookshelf for a reasonable price. Like another reviewer, I loathe particle board \"furniture\", and it's vetoed in my house. This is made of above average quality solid wood. Very sturdy, well engineered, and made with quality parts. It's easy to assemble and can be done in 30 minutes. It's nice because there is only one type of screw, and there is very little guesswork to put the thing together. We purchased two of them, to sit side-by-side in our guest room, and both match without issue and look great.You can buy this shelf from Amazon at a cost that's comparable to cheap particle board junk in a big box store. I have not doubts that most people will like this product. It's just right for the price.The only drawback is the height, so be sure to break out a measuring tape if you want to be sure. It tops out at about 3.5'. If it were a foot or two taller, I'd gladly pay 2x what this costs. Another reviewer commented about how smaller peices have multiple parts that were joined together to save costs. I will describe this in better detail... Some of the back supports (the thin wood beams, above the shelves) are made of two peices that are glued in the factory, ripped (sawed) and then finished. Basically, if you look closely, you will see a jigsaw seam where two peices of solid wood were joined. It's not really an issue though, since you have to look closely to notice it, and the construction is still quite solid and well-built. This is only an issue with the small back-beams, and not the large \"shelf\" components.Amazon shipped it in only *2 days*. Can't beat that. Be aware that you'll be paying about 1/3 of the bookcase's cost in shipping. Still, it's well worth it. I'm very pleased with the bookcase and Amazon's service.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "eg3",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6JRCFJMIWBX56SLDLSKLCZ4EIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10GN6EIJVSEOK?ASIN=B000NPQLAU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice",
                "reviewText": "Easy to assemble, attractive, sturdy, seems great for the price. I filled it with books and no sagging so far. I even bought a second one. My only tiny complaint is that the pieces come wrapped in paper, which does prevent scratches, but the paper sticks to the wood. Had to go over it with a damp towel and rub stuck on paper off. Doesn't seem to have affected the finish much so just an inconvenience, I think it's still five stars.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steffi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEZLO7GGANS5VOD56DMUJXBRLGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22GZEKMKPQ2WV?ASIN=B000NPQLAU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Buy this!",
                "reviewText": "I love this bookcase! It's super sturdy and just the right size for the space we needed it for. Great price for real wood too! I would recommend this to anyone. Screws are a little difficult to screw in because I didn't have a drill bit that fit them and had to use the included tool. Still worth it. This piece will stay with us for years to come.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shafron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 5, 2022",
                "reviewTitle": "Awesome looking, solid piece of furniture.",
                "reviewText": "A great and versatile piece of furniture. Very mid century yet modern. Easy to assemble. No chips, all accessories were in place, super fast and safe shipping.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Enrique Buzo Cordoba",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 20, 2021",
                "reviewTitle": "Fuerte y excelente acabado",
                "reviewText": "Sólido, con muy buen espacio para libros y excelente acabado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vancouver Island ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 30, 2021",
                "reviewTitle": "Sturdy, attractive, easy to assemble",
                "reviewText": "This bookcase is the perfect size for the space needed. It's handsome in its simplicity. Unlike the labyrinthine directions that sometimes accompany such products, these were clear and straightforward. I like that air circulates around the entire shelf--far less dust settling behind the books, and what's there is easy to wipe away without removing all of them.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter Mardon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 17, 2020",
                "reviewTitle": "Well-designed",
                "reviewText": "Goes together easily - shelf finish is different (top and bottom) so check to make sure they are all the same way up. Nice unit - solid wood (banana wood?) with an excellent finish.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wendy pineau",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 11, 2022",
                "reviewTitle": "Easy assembly, sturdily made.",
                "reviewText": "Liked the simplicity of design. Bookshelf in family room.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}