{
    "remaining_requests": 38769,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BZZCAM-Wireless-Surveillance-Security-Detection/dp/B0CGX1PGDT",
    "body": {
        "name": "Mini WiFi Hidden Spy Camera Wireless Surveillance Nanny Cam Indoor Home Security Camera 1080P Small Video Recorder with Remote Live View Phone App Motion Detection Night Vision",
        "price": "$9.99",
        "originalPrice": "$19.99",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BZZCAM-Wireless-Surveillance-Security-Detection/dp/B0CGX1PGDT",
        "soldBy": {
            "sellerID": "A1U3YZKJWKSUKU",
            "name": "BZZCAM DIRECT",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1U3YZKJWKSUKU&asin=B0CGX1PGDT&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJBR7912"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41WZ7TYNbXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Z9RjX9PcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Gb2LFR2KL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515gSiZVc3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EQp7OFRqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZmTWxconL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/619OlwHX-uL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/33f5140b-5f98-4689-8e85-a00dd335433a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5aa40fd9-493c-4451-9d6e-56ec2422a0a8/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e65c8cea-8a97-416b-8d58-4005b6b8877a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a1d8eb4-229c-4ea0-8f6e-5686632fb4f2/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BZZCAM Store",
            "link": "https://www.amazon.com/stores/BZZCAMDIRECT/page/DCC23E63-77E5-4A68-BCC8-550C8D563BA5?ref_=ast_bln"
        },
        "brand": "BZZCAMDIRECT",
        "merchantInfo": "BZZCAM DIRECT",
        "customerReview": "3.2 out of 5 stars",
        "customerReviewCount": 30,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 16 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Rechargeable Small Camera: This covert camera is equipped with a small 300mAh Li-battery for emergency video record, a 1080P and 90° camera len for enough monitoring range, smart motion detection and night vision, FREE phone APP for live remote view and cloud storage.",
            "WiFi Remote Viewing: ONLY Support 2.4GHz WiFi for network to remotely send real time videos to your phone wherever you are. You can always watch real-time videos in the APP. It is a nice home security device to help you keep an eye on your house, baby kids, the elder parents, pets, housekeepers, nanny babysitters, roommates, unexpected intrude and burglary, etc.",
            "Instant Motion Detection: Our camera detects motion then it would push you notification with camera snapshots on your phone. You can check the snapshots in the APP anytime to find what has been captured. You can also set Sensitivity of this function to avoid unneeded information.",
            "Easy File Storage: Support MAX 32G micro SD card(not included). Recommend you to insert one sd card before use so that you can playback the recording files directly in the phone APP. What's more, FREE APP cloud storage is also provided. Files saved in the APP can be read, shared and deleted.",
            "Warm Tips: ①Please charge the camera before use; ②Recommend charging the camera while using for 7/24 continuous monitoring; ③Please set WiFi with the camera for live remote view and full APP function. ④Please feel free to contact us when you have any problems with the cameras before and after purchase. Thanks very much for your great attention."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b?ie=UTF8&node=502394"
            },
            {
                "name": "Video Surveillance",
                "link": "https://www.amazon.com/Video-Surveillance/b?ie=UTF8&node=7161091011"
            },
            {
                "name": "Surveillance Cameras",
                "link": "https://www.amazon.com/Surveillance-Cameras/b?ie=UTF8&node=898400"
            },
            {
                "name": "Hidden Cameras",
                "link": "https://www.amazon.com/Hidden-Cameras/b?ie=UTF8&node=12909791"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.18 x 1.18 x 0.98 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.06 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CGX1PGDT"
            },
            {
                "name": "Item model number",
                "value": "BZ23T28"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.2 3.2 out of 5 stars 30 ratings 3.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#628 in Hidden Cameras"
            },
            {
                "name": "Date First Available",
                "value": "October 10, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "BZZCAM"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Indoor Security"
            },
            {
                "name": "Brand",
                "value": "BZZCAM"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Special Feature",
                "value": "Mini WiFi Camera/Video Recording/Easy to Install/WiFi Remote View/Motion Detection/Night Vision"
            },
            {
                "name": "Compatible Devices",
                "value": "iPhone/Android Smartphone"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/17d06bca-5a92-408b-94dd-b6b67c57ba79.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b95655b-1be2-439d-9563-524f5f497269.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f13918b-34bb-45d7-8d18-73f8fec1abb9.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/716bb561-da0b-4339-8c04-0344c350f734.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7921f69-4fca-4dc0-a711-b64012312132.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0acc90b3-e53e-4843-b6fc-a053b789e529.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dc28bdaf-1295-4e39-8d63-4bc5334f8c56.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Inquisitively Indifferent",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZTOJVQT527X364VQMTTTS6NNSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R153WKOQN2Q1YG?ASIN=B0CGX1PGDT",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "3.0 out of 5 stars Wishing it was…",
                "reviewText": "UPDATE 12/19/23Well, that was close... almost made it to one month... actually, it has been non functional for over a week now... Wishing it was a cam that made it to 30 days.------------------------------------------------------------------------A lot better than what it is. However, for the price I suppose I shouldn't expect too much.The camera came nicely packaged and damage from shipping. The setup process is easy for anyone who has setup others cameras before. Connecting the camera to phone and to internet was painless and connected on first attempt.Aesthetically, the camera has a nice balance of mid tone black - not dull but not glossy. The magnetic backing isn’t something to brag about though. On a scale of 1 to 10, I’d give it a 2 on the strength of the magnet.On to the “free” app we go. Seriously, I don’t know why it’s called a free app. Isn’t that part of what we pay for to begin with? I have yet had to pay for an app, thats associated and required, with a product that I bought. Anyways, the app is Bland. The basic usuals (such as vert flip AND horizontal flip at the same time, mic usage, device ip) of camera controls arent available. Again, only very basic settings.Lastly, we go to the picture & video quality… I am not at all surprised at the blurriness of the camera module. Personally, I find it hard to believe this is a camera capable doing of 1080p. Also, there is this HUGE annoying of what seems to be a delay in live view. Ok, so there IS a delay, but on top of that it seems like the camera is disconnected at intervals - the live view would freeze and skip a few seconds and then back to a delayed view again.The battery life you ask? What battery life? Why bring that up? Its barely there, lets just leave it alone.One more thing, it does look like there is cloud recording on the camera, but again, there arent any settings or mention of, to be found on the app. If there is feee cloud storage, they are shorting themselves of a valuable promo on the app.Overall, I’d say you get what you pay for. I primarily base a lot of my expectations from product descriptions and product images, and the pricing as secondary point. Despite its wonderful outer looks and construction, the inner functions just arent there. 3 stars just because it IS a very nice looking camera.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darcy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDVTT36YDDHZMJBRSG5OOKWKBSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDQMMQ5CVLWHH?ASIN=B0CGX1PGDT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Spy cam",
                "reviewText": "Cool spy cam. Very impressive for its size. It has great video quality. You can also watch live stream using an app. There is audio as well. There is also a slot for an SD card. Easy to hide. Overall an excellent buy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4M6MOTQUEDVCVKZLOATDR5VR6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z2VNT9V8QZMQ?ASIN=B0CGX1PGDT",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "2.0 out of 5 stars Has promise, but doesn't live up to the advertising",
                "reviewText": "I thought I might have some kind of use for this camera, but I can't get it to work long enough to find out if it's a good fit or not.Hardware-wise, it's solid. Good build and design, straightforward controls etc. It powers up and *tries* to work, but falls short for me.Some of the issue is the compact build and size of it. It just can't stay connected to WiFi long enough to even set it up properly UNLESS you're within 10' of the router and even then it's hit or miss.My thought on this was to use this as a way to monitor traffic at the foot of a set of stairs. I have a shelf that's 15' away from the steps and also about 15' away from a WiFi extender. No dice. It will stay connected long enough to get an initial image on the app, but then it disconnects and won't reconnect.I don't know if the issue is the camera itself or the buggy as you-know-what app. Either way, it makes remote monitoring pretty much impossible unless you set the camera on top of your router.It seems reasonably reliable when it comes to local recordings to the SD card, but they aren't that reliable in that I can't scrub foward or backward in the files. If you play them from the beginning and let them roll, they're OK, but when you try to scrub, the player just locks up. And I use VLC which will play pretty much anything frontwards, backwards and sideways.The little bit I've been able to test, I've not been impressed with the video quality. I've got it set at 1080, but all the videos I've pulled from the SD card and remote recordings from my phone have been 640 x 472 and grainy as all. We're talking mid 2000's flip phone grainy. Maybe I'm missing something in the app, but it's set to record at 1080 in the settings.Speaking of the app - it's a shining example of something you probably don't want on your phone. The grammar in the app is just as atrocious as it is in the description here on Amazon.Android keeps telling me that it has to shut down because of a bug in the app (no kidding) and I'm fairly certain that any video this thing does record is sent directly to Xi Jinping's man cave. Be sure to smile and wave.'Merica",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BalukaBaluka",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKIZHRFDC4DWSEVVES4CME3D3EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RK02JEZ6A2F6?ASIN=B0CGX1PGDT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Decent camera but very tiny",
                "reviewText": "I ordered the BZZCAM Mini WIFI camera to see if I could possibly use it with either my 3D printers or my large CNC machine to make videos of them working. So far, I have not been able to figure out a way to mount the camera due to its small size and the included magnetic base not being compatible to my needs. All of my machines I wanted to use the camera with are made of aluminum and magnets will not stick to them. To properly use the camera with is tiny size it really needs to be mounted securely to be stable. I am now looking at the possibility of using strong two-sided tape to secure the mounting base. The camera does take decent video at the 1080P resolution but you do have to go through the proprietary App that is installed to your smart phone to access the camera. The App does work fairly well but I did have some minor issues with connections since they are made to the phone through the WIFI. I have a very robust WIFI setup throughout my home so I am not sure why the App had issues connecting to the camera at times. You also need to go through the App to view the live stream or to record to the Micro SD card that needs to be installed into the camera. (Micro SD card is not included with the camera) The camera also is limited to a maximum of a 32GB card. Overall, the camera is a decent camera but very tiny and so is limited on usability and functionality for me making it difficult to use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71IaAp7qhiL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}