{
    "remaining_requests": 38970,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Blink-Mini-White-1Cam/dp/B07X6C9RMF",
    "body": {
        "name": "Blink Mini – Compact indoor plug-in smart security camera, 1080p HD video, night vision, motion detection, two-way audio, easy set up, Works with Alexa – 1 camera (White)",
        "price": "$19.99",
        "originalPrice": "$29.99",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Blink-Mini-White-1Cam/dp/B07X6C9RMF",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BWD4WGJB"
        ],
        "asinVariationValues": [
            {
                "asin": "B09N6V1FHG",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01JRptgu8MS._SS36_.jpg"
            },
            {
                "asin": "B07X6C9RMF",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/0178+pOzqyS._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41iTPY6vIwL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31k4JysPQ5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iQH85g1MS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jqOZv4m-S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Wb-56yPIS.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Blink Store",
            "link": "https://www.amazon.com/stores/Blink/page/C5DECBBE-4F56-4C36-B933-E62144578691?ref_=ast_bln"
        },
        "brand": "Blink",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 275877,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 9 hrs 48 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 14. Order within 16 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Monitor the inside of your home day and night with our 1080P HD indoor plug-in smart security camera with motion detection and two-way audio.",
            "See, hear, and speak to people and pets in your home from your smartphone with Blink Mini’s live view and two-way audio.",
            "Get alerts on your smartphone whenever motion is detected or customize motion detection zones so you can see what matters most.",
            "Use Mini as an indoor plug-in chime for Blink Video Doorbell. Hear a real-time alert from Mini when someone presses your Video Doorbell.",
            "Choose to save and share clips with a free 30-day trial of the Blink Subscription Plan or locally with the Sync Module 2 (sold separately).",
            "Set up in minutes — plug in the camera, connect it to wifi, and follow the instructions in the free Blink Home Monitor app.",
            "Works with Alexa — pair Blink Mini with a supported Alexa-enabled device to engage live view, arm and disarm your camera, and more using your voice.",
            "Include 1 Blink Mini camera (white), mounting kit including stand, USB cable, and power adapter."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Field of view",
                "value": "110° diagonal"
            },
            {
                "name": "Camera resolution",
                "value": "Record and view in 1080p HD video during the day and with infrared HD night vision after dark"
            },
            {
                "name": "Camera frame rate",
                "value": "Up to 30 frames per second"
            },
            {
                "name": "Size",
                "value": "2 in. x 1.9 in. x 1.4 in. (50 mm x 49 mm x 36 mm)"
            },
            {
                "name": "Weight",
                "value": "1.7 ounces (48 grams)"
            },
            {
                "name": "CPU",
                "value": "Immedia Proprietary – AC1002B, 4 cores / 200 MHz"
            },
            {
                "name": "Power",
                "value": "2 meter micro USB and power adapter, electrical rating: 100-240V 50/60 HZ 0.15A"
            },
            {
                "name": "Wifi connectivity",
                "value": "Supports 2.4 Ghz 802.11g/n; does not support connecting to ad-hoc (or peer-to-peer), or paywall wifi networks. Minimum 2 Mbps upload speed required."
            },
            {
                "name": "Available colors",
                "value": "White, Black"
            },
            {
                "name": "Minimum smartphone requirements",
                "value": "iOS 15.0, Android 9.0, or Fire 9.0"
            },
            {
                "name": "Blink app",
                "value": "Blink Home Monitor"
            },
            {
                "name": "Included in the box",
                "value": "Blink Mini camera (dependent on quantity selected), 1 stand (attached), 2 mounting screws (per camera), 1 USB cable, 1 power adapter"
            },
            {
                "name": "Audio",
                "value": "Speaker output and 2-way audio recording"
            },
            {
                "name": "LEDs",
                "value": "One blue LED to help you know when it’s active (optional)"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty and service included. Use of Blink cameras is subject to the terms found here."
            },
            {
                "name": "Support",
                "value": "Click here to view more information on the Blink Mini support page."
            },
            {
                "name": "Generation",
                "value": "1st generation – 2020 release"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jewell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7PYTKHNNPOB4M26RC7ARF6NYRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P8BD8MMYI4BM?ASIN=B07X6C9RMF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars I use these in several rooms of our place",
                "reviewText": "This was a great buy. I love these cameras. Easy to use, great picture and quality long-lasting product. I pay $10/ month for recording and holding recordings and it works well. I would definately but then again. Motion detection is great. Night vision is great for an inexpensive camera.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauren Holmes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXOJ3G2EB2JKXI3KUSFVFWZNV3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R114THIKY3P50Y?ASIN=B07X6C9RMF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for baby/kids camera",
                "reviewText": "Great little camera to keep in an in room that you would like to monitor, especially for babies & young children. Great little camera to keep in an in room that you would like to monitor, especially infants and young children. Easy to set up and move around as needed. Has different options and great for alerts that you can connect to your other Alexa devices in your home and or on your cell phone and smart watch has live feed of video, and a great feature in which you can talk and be heard on the camera, which has been great, while trying to train my toddlers to remain in their bedroom at night. Great price and I have had it for about 2 to 3 years and have moved multiple times , so pretty durable, and easy to set up",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPVHD3XPOOLS2LAU2WBWB75NCMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B10J5SXGF5S4?ASIN=B07X6C9RMF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Blink Mini: Compact Security, Corded Convenience – A User's Take",
                "reviewText": "Dive into smart security with the Blink Mini – your compact indoor watchdog in a sleek black package. Offering 1080p HD video, night vision, and two-way audio, it's a powerhouse for monitoring your home day and night.Here's the lowdown – it's smaller, but the wire can be a bit of a drag. A trade-off, really. Personally, I lean towards the battery-operated version for its flexibility, but this one has a key advantage – no battery anxiety. No worrying about the battery going dead; it's a plug-and-forget situation.The setup is a breeze – plug it in, connect to WiFi, and follow the app instructions. Now, about that wire – if your outlet is close, this is a worry-free choice. No more stressing about windy days draining your battery. But if you're dealing with more wires than you'd like, the battery-powered Blink might be your hero.In a nutshell, it's all about the outlet proximity. If it's right there, go for this one; no fuss, no frills. If you need more flexibility, the battery version is your go-to. Security made simple!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF7QEISKLXW2T65FAHVB62X4NVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TJSUM36LONTC?ASIN=B07X6C9RMF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Peace of Mind in a Tiny Package - Blink Mini is a Winner!",
                "reviewText": "I've been on the lookout for an affordable and reliable indoor security camera, and I must say the Blink Mini exceeded my expectations in every way. Here's why this little gem deserves a solid five-star review:Setup (5/5):The setup process is a breeze! I'm not tech-savvy, but I had the Blink Mini up and running in less than 10 minutes. Just plug it in, connect it to the Blink app, and you're good to go. The app is user-friendly and guides you through every step.Video Quality (5/5):The 1080p HD video quality is crystal clear. I can now see every detail in my home, day or night. The night vision is impressive, providing a sharp and clear picture even in total darkness. I've got my peace of mind 24/7.Motion Detection (5/5):The motion detection feature is spot-on. I receive instant alerts on my phone when there's movement in the camera's field of view. You can adjust the sensitivity to suit your needs, which is a handy feature. It's a game-changer for security-conscious folks like me.Two-Way Audio (4/5):The two-way audio function is a nice addition. It allows me to communicate with family members or even my pets when I'm away. The sound quality is good, but sometimes there's a slight delay. Nonetheless, it's a useful feature.Compact Design (5/5):The Blink Mini is super compact, so it doesn't stand out in a room. It blends in effortlessly with my home decor. The camera can also swivel to get the perfect angle, ensuring you capture everything you want to monitor.Value for Money (5/5):The Blink Mini offers amazing value for the price. It's an affordable solution for home security, making it accessible to a wide range of users. You don't need a subscription for basic functionality, but if you want more, the subscription plans are reasonably priced.In summary, the Blink Mini is a fantastic indoor security camera. It's easy to set up, provides top-notch video quality, and offers all the essential features you need to keep an eye on your home. If you're looking for an affordable and dependable smart security camera that won't break the bank, this is the one. I can't recommend it enough, and I'm considering getting more to cover the entire house. It's a winner, hands down!",
                "reviewVotes": "108 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jesus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 25, 2021",
                "reviewTitle": "Muy sencilla de conectar",
                "reviewText": "Me gusta la simplicidad de conexión , no me gusta que no se puede expandir a que grabe en Dvr.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leonardo VazquezLeonardo Vazquez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 21, 2021",
                "reviewTitle": "No existe Skill de Alexa para México",
                "reviewText": "En ninguna parte advierte que la compatibilidad con Alexa esté supeditada al país. Por lo que, no cumple con lo que ofrece",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61V+HkkN7RL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}