{
    "remaining_requests": 38715,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rebluum-Security-Cameras-Wireless-Detection/dp/B0BW3BRKRL",
    "body": {
        "name": "2K Solar Security Cameras Wireless Outdoor, 3MP Battery Powered 360 Security Camera, 2.4Ghz WiFi Only, Color Night Vision, Smart Motion Detection, 2-Way Audio, SD Card&Cloud Service",
        "price": "$39.99",
        "originalPrice": "$69.99",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rebluum-Security-Cameras-Wireless-Detection/dp/B0BW3BRKRL",
        "soldBy": {
            "sellerID": "A6GUF9NZCM42W",
            "name": "Rebluum USA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A6GUF9NZCM42W&asin=B0BW3BRKRL&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/4151FWyt2YL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41VXEv65lNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Dav6sBwwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/414yYhojmzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413-myIUdXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41UDHPJck3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/B1dNoWBSCmL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eea80dcc-d91e-45bf-b1c0-f1041630ed01/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Rebluum Store",
            "link": "https://www.amazon.com/stores/RebluumSecurity/page/85375844-6786-4F8A-B235-E5D7D8EEAD23?ref_=ast_bln"
        },
        "brand": "RebluumSecurity",
        "merchantInfo": "Sold by Rebluum USA and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 29,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 6 hrs 2 mins",
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 14. Order within 8 hrs 47 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Solar Powered,Hassle Free】Rebluum Solar Security Camera Build in 9700mah Battery, Included Solar Panel offer Continuously Power for Outdoor Camera Wireless, which can Reduce the Times of Take Down the Rotating Wifi Camera for Charing, Easy Set up Without the Worry of Wiring Work",
            "【2K FHD, 360° Panoramic】1.5times Clearer than 1080P Solar Powered Security Camera, Rotate the PTZ Battery Wireless Camera from Side to Side 355° Horizontally, up and down 90° Vertically, Check the Activity on Cloudedge App while Away from Home, Cover the Area You Care with 3MP Sharp and Clear Image, Day and Night",
            "【AI Motion Detection, Smart Alert】 Rebluum Solar Outdoor Camera Support Alert for any Motion or only When a Human was Detected, Reduce the False Notification, Customized the Motion Area and Setting a Motion Plan to Meet Your Various Requirement of Home Security, Give You a Peace of Mind \"",
            "【Smart Alarms with Spotlight and Siren】3 Alarms Mode Optional, Audio Warning/White Light Warning/Audio Warning and Stroble Light, Ward off the Uninvited Visitors and Get Color Image at Night, Playback the Video Clips from Micro SD Card(up to 128GB, Not Included) or Open a Cloud Service to Storage(7 days trail free)",
            "【Family Share and After Sale Service】Rebluum 360 Degree Solar Camera Support your Family Members to Acess the Videos, 360 Days Warranty and 60days Refund of No Reason, Lifetime Technical Support with Local Phone Service, Rebluum Back up for Your no-risk Purchase"
        ],
        "description": "3.0MP Solar powered PTZ camera",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Video Surveillance",
                "link": "https://www.amazon.com/Video-Surveillance/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7161091011"
            },
            {
                "name": "Surveillance Cameras",
                "link": "https://www.amazon.com/Surveillance-Cameras/b/ref=dp_bc_aui_C_4?ie=UTF8&node=898400"
            },
            {
                "name": "Bullet Cameras",
                "link": "https://www.amazon.com/Bullet-Cameras/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14241331"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7 x 5 x 8 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.14 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BW3BRKRL"
            },
            {
                "name": "Item model number",
                "value": "RB-3PT1-5"
            },
            {
                "name": "Batteries",
                "value": "2 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 29 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#511 in Bullet Surveillance Cameras"
            },
            {
                "name": "Date First Available",
                "value": "March 15, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "Rebluum"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Outdoor Security"
            },
            {
                "name": "Brand",
                "value": "Rebluum"
            },
            {
                "name": "Model Name",
                "value": "RB-3PT1-5"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Special Feature",
                "value": "Night Vision, Motion Sensor"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Freddy C.Freddy C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHH6D3MZGWNYY522AYRQG22WP5MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R219DUJ6TOJTCP?ASIN=B0BW3BRKRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars I’m really happy with the cameras !!",
                "reviewText": "They have good connectivity, good resolution, the solar panel and the battery work wonderfully, I bought two first and then a third and they have helped me a lot on my property! I recommend them 100%",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/713mAijBFEL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kari31",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCPEWEWJJCJLCZWIJ2A333DO3EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LS5ZRQ8ONA7I?ASIN=B0BW3BRKRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Love this camera!",
                "reviewText": "This camera is great! Very easy to hook up to the app, and also easy to install. I love the fact that it's solar powered too instead of something we have to take down and charge constantly. The picture is nice and clear on it. Def worth it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diamond",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3KIX4OLQOE25BAWQBGERU3GDVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3XCEETLFD25D?ASIN=B0BW3BRKRL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "4.0 out of 5 stars This works well.",
                "reviewText": "This is easy to set up and it works well. It captures clear images both day and night. I found it pretty easy to set up and drill into the wall of my house. The app is easy to set up and use. I can check on things any time I want. I get notified when motion is detected and so no matter where I am, I know what's going on. The best part is that I installed it and I can forget about it as it's solar charged and doesn't need batteries or cables to be connected.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Hilarious Wordsmith ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGV2E2THVOC3DMHPNZSCD7CJ4Z6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CXMZGKKUCK2E?ASIN=B0BW3BRKRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2023",
                "reviewTitle": "5.0 out of 5 stars The Ever-Watchful Solar Sentinel: Adding Sunshine to Security and Sparkle to Surveillance!",
                "reviewText": "I have to tell you, setting up the Rebluum 2K Solar Security Camera was like hosting a welcoming party for a Martian rover. My backyard turned into a landing site for this extraterrestrial sentinel – packing some serious tech chops beneath its 'out-of-this-world' design. First things first, the camera speaks fluent 'Wireless' with a strong accent in '2.4Ghz WiFi.' The only cords you'll see here are the metaphorical ones attaching you to peace of mind. This little beauty loves nothing more than to chat with your router all day, sharing what it sees with seamless clarity.This sunny sentinel is a true green-thumbs-up for Mother Nature! Powered by our friendly neighborhood star – the Sun – it slurps up the rays by day and keeps a vigilant eye by night. It’s like a solar-powered owl that’s traded hunting mice for spotting mischief. Now, let's talk about its nocturnal vision. I switched off the lights and BOOM, my garden was drenched in an eerie, but reassuring glow. The Color Night Vision is like having a friendly raccoon that never sleeps, always alert and ready to squeal (or, you know, send alerts to your phone) at the slightest whiff of trouble.The motion detection feature is as keen as a border collie on espresso. It's smart, attentive, and doesn't waste time barking up the wrong tree. With precise and accurate alerts, you won't be bothered by false alarms set off by those rebellious autumn leaves blowing across your yard. What’s better than a security camera? A security camera with a voice, of course! The two-way audio turns this camera into the ultimate communicator. Whether you want to greet the delivery guy, startle a potential trespasser, or just remind your spouse they promised to water the plants - your voice now has range and reach!With the SD Card and Cloud Service, it's like having a personal scribe, diligently jotting down everything it sees, ready to replay at your whim. No more worrying about running out of memory - this Martian marvel has enough room to store your very own backyard soap opera. All in all, the Rebluum 2K Solar Security Camera is a perfect blend of advanced tech and eco-friendliness, acting as a faithful watchdog for your property, but without the slobber. Whether you're home or away, day or night, this camera shines as a beacon of safety, powered by the very star that nurtures life on our planet. Now that’s what I call bringing light to security!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leonard M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZ24R2YNHIE7K6UBMH72UVSAXNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZNZ1UJCH13QX?ASIN=B0BW3BRKRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Very easy to run",
                "reviewText": "As a 78 year old, and pretty ignorant about technology and cell phones, I am impressed with the ease of use of this security camera. I was concerned that the batteries would not be sufficient to last the night. But after the first couple of nights of use, there was absolutely no problem. Even in early April with longer nights, and short days, there was no shortage of power. I do live in the high desert, so the quality of sunlight is no problem. The angle of view is able to cover from the front door, the drive way, and to the edge of the street about 35 feet away. I did not set it for human detection, we get a lot of wildlife such as deer, horses, racoons, and even the occasional bear. I was interested in watching their activity. I wanted to be notified for any movement. I get notified with automobile passage, but we get so little traffic, that is not a problem. The night vision is very clear to at least 40 feet, which covers to the edge of the property. I have had no reason to use the two way audio, but I did test it, and I am sure any nefarious people would depart immediately when challenged. The wireless connection was the hardest part for me, I was not familiar with networks, and WiFi. Luckily, the next door neighbors son came over, and had me up and running in no time. He said I needed to connect 2.4. I am not using the cloud storage, just the memory card, which is working flawlessly. The quality of video is amazing in both day and night. The night capability is good enough, that I believe the identification of an individual would be possible from a significant distance. This is the security camera for the novice technical guy. No complicated wiring, and once the settings are made, it pretty much runs itself. I strongly recommend this camera for the value for money. I am showing it, and recommending it, to the neighbors.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg Dickens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP7G5YDDCV7H3MI6FJ5NVXYDGVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMVEM1USFZOAE?ASIN=B0BW3BRKRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "5.0 out of 5 stars A great addition to my home",
                "reviewText": "I have had this unit up for several weeks now, and it performs perfectly. The app setup on my phone was quick and easy, and the adjustable sensitivity makes sure that I don't miss anything without being bothered all the time by false alerts.Installation was very simple and straight forward, and the solar panel has kept the battery charged to 100% at all times. I highly recommend this unit for anyone who wants a dependable outdoor security camera that never has to be taken down for charging!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cara Clapsaddle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIDU4A4ZG65VM73JTVAQXJYTPMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24TNSYSOSJU72?ASIN=B0BW3BRKRL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Nice security camera to own",
                "reviewText": "This is a great little security camera for outdoors. There are several features that I truly like. The ability to not have to charge. It is wonderful. I wish everything had solar panels attached to them. This outdoor security camera gives you the ability to have two way communication, which is definitely a plus. You also have the ability to pan and tilt which gives you a much greater range to view and keep secure. This camera has night vision and the ability to store, images and videos on an SD card or directly to a cloud. This camera is easy to install and easy to set up as well. Love.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}