{
    "remaining_requests": 38866,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/WIWACAM-Wireless-Security-Surveillance-Detection/dp/B0CKYHG12D",
    "body": {
        "name": "WIWACAM Small Camera 4K HD WiFi Wireless Indoor, Ultra HD Video Home Security Cameras Surveillance Office Cams, Motion Detection, Night Vision, App Live Feed to Phone,SD Card Slot(MW3N-Pro)",
        "price": "$35.90$32.00",
        "originalPrice": "$35.90",
        "rawPrice": 35.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/WIWACAM-Wireless-Security-Surveillance-Detection/dp/B0CKYHG12D",
        "soldBy": {
            "sellerID": "A3PWTH7J7YVUP1",
            "name": "Mini Camera Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3PWTH7J7YVUP1&asin=B0CKYHG12D&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41UnVa M0NL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/610iiw9B3jL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iO9Shxz5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51b9-suyWTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jeOrLihML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZKW7QGLNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sOflXIuEL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the WIWACAM Store",
            "link": "https://www.amazon.com/stores/WIWACAM/page/B765FD61-29AA-4A06-8679-DCC74BDE8C46?ref_=ast_bln"
        },
        "brand": "WIWACAM",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 48,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 6 hrs 50 mins",
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 2 hrs 50 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Small Size, 4K Resolution, Enhanced Concealment】This small camera offers a small and compact design with great features, including WiFi, microSD card slot etc. It's as tiny as a small U Disk, yet the camera streams 2K Ultra HD 15fps live video and 4K snapshot to your phone . This cam comes with a removable cap that's crafted using WIWACAM Ultra 𝐇𝐢𝐝𝐝𝐞𝐧 Glass, this unique design provides better concealment while still provides good image.",
            "【High Qualiy Ultra HD Image Day and Night】This small camera captures clear Ultra HD pictures during the day. The camera equips with 940nm IR for night vision, no red glow that humans can see in the dark. With good optics and latest sensor, this camera provides good night vision that see clearly within 24 feet. It has resolved the issue that many small cameras only have poor night vision or no night vision at all.",
            "【Enhanced Concealment】 The small security camera comes with a removable cap that's crafted using speical WIWACAM Ultra 𝐇𝐢𝐝𝐝𝐞𝐧 Glass. The Ultra 𝐇𝐢𝐝𝐝𝐞𝐧 Glass providers better concealment to camera.While at the same time, this Ultra 𝐇𝐢𝐝𝐝𝐞𝐧 Glass allows 200% more light to enter the lens, the increased light results in still providing good image quality.",
            "【Continuous Recording with up to 256GB microSD Card Support】This small wifi camera can record continuously to a microSD card (card not included) with up to 256GB storage capacity. That's enough storage for 500 hours of footage on 256GB card, which the camera will automatically loop, so you don't miss anything important.",
            "【Power Options and Full Warranty】 For continuous 24/7 operation/recording, just plug the camera into a standard USB power adapter. If you want to record while you're moving around, just use a 10,000mAh power bank to extend recording for another 24 hours. (USB power adapter and Mobile power bank not included). We provide 60-day money-back guarantee, 1-year product warranty and lifetime tech support. If any questions about the product or your order, just email our customer service."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Video Surveillance",
                "link": "https://www.amazon.com/Video-Surveillance/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7161091011"
            },
            {
                "name": "Surveillance Cameras",
                "link": "https://www.amazon.com/Surveillance-Cameras/b/ref=dp_bc_aui_C_4?ie=UTF8&node=898400"
            },
            {
                "name": "Hidden Cameras",
                "link": "https://www.amazon.com/Hidden-Cameras/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12909791"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "5.83 x 3.66 x 1.97 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.87 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CKYHG12D"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 48 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10 in Hidden Cameras"
            },
            {
                "name": "Date First Available",
                "value": "October 13, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "WIWACAM"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Indoor Security"
            },
            {
                "name": "Brand",
                "value": "WIWACAM"
            },
            {
                "name": "Connectivity Technology",
                "value": "WiFi"
            },
            {
                "name": "Special Feature",
                "value": "Easy to Setup, Night Vision, Enhanced Concealment"
            },
            {
                "name": "Compatible Devices",
                "value": "BlueIris"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Introducing Our Compact 4K Camera with Impressive Features: It streams 2K Ultra HD live video and 4K snapshot to your phone.It captures clear daytime images with a 130° wide angle.Powerful night vision is included, effective within 20 feet.It has a microSD card slot for video recording, support up to 256GB microsD cardAdvanced Smart Motion Sensor included, with adjustable sensitivity and Motion Zone feature to ensure reliable monitoring Please note: This camera doesn't have a built-in battery. You can easily connect a mobile power bank for continuous 24-hour use and recording. ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣Important Note: This is a WiFi camera This product is a WiFi camera, so in order to access most of its features, you will need to install the WIWACAM app on your phone. This small camera only supports 2.4GHz WiFi, not support 5GHz WiFi. (since most 5GHz WiFi networks also offer 2.4GHz WiFi simultaneously, this camera should work with most of 5GHz WiFi routers.)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4aea37f-7db1-431a-ae5d-f03f9780f182.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "4K Resoluition, High Quality Image, 130° Wide Angle, Phone Access The camera captures high-quality images with 4K resolution. Its 130° wide-angle lens allows it to cover a broad area, easily capturing clear and detailed evidence. You could Access camera video feed from phone, whether you're home or away. The camera combined with UltraHidden Glass + 2 IR LEDs, ensures reliable night vision up to 20 feet. ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ Resolution: Snapshot: 4K Resolution Live Video: 2K Resolution Save to microSD card: 2K Resolution",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b982c533-dde9-4170-a6d7-2103932ab0eb.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Recording to SD card and Auto Loop This camera records real 2K Ultra HD videos onto a microSD card, unlike other similar models from different brands that only record 720P HD videos. Using this camera means you'll have clearer video evidence and better images of your baby or pet, as this camera saves 230% more pixel details. At Continuous Recoding mode, the camera will auto loop recordings to your micro SD card (supports up to 256GB, microSD card not included). Once the space is almost full, camera will auto overwrite oldest recordings by new recordings.The camera supports both Direct AP Mode and Connecting to Your Home WiFi Router. It is useful for recording in car, bike, camp or vocation house. We have prepared an easy but detailed guide about how to use this feature.Typically for 256GB microSD card (camera support max 256GB card), it could keep 500hours(20days) of recording in 2K Ultra HD. For Alarm Recording mode, it could keep 520days of footage. (assuming 10 alarm events in a day, record 3minutes for each alarm event). If you use a 128GB card, you can save half of the amount compared to a 256GB card.The camera supports Cloud Recording as an optional feature, but not mandatory. Cloud Recording could keep recordings in cloud for 7 or 30 days. FAQ: How do I open AVX files from a microSD card? Answer: AVX files offer enhanced data loss protection for video recording. If you access the recordings using the phone app, you don't need to care about this question, the app will automatically save the recordings as MP4 files. However, if you check the microSD card on your PC/MAC, use our provided tool from the Quick Guide to convert AVX files to MP4 format for easy playback with most media players.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/01a22b3a-404b-4a47-af28-7e868469c6db.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Enhanced Concealment The camera comes with a removable cap that's crafted using WIWACAM Ultra𝐇𝐢𝐝𝐝𝐞𝐧 Glass. The Ultra𝐇𝐢𝐝𝐝𝐞𝐧 Glass conceals the camera lens from external view. At the same time, the Ultra𝐇𝐢𝐝𝐝𝐞𝐧 Glass allows 200% more light through the lens. More light ensures exceptional night vision. You have the option to use the camera with the cap on, which is our recommended choice for better hidden. You'll still obtain a good image, but the hidden will be superior compared to other small cameras. Alternatively, you can remove the cap to achieve higher vision quality.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/878b6f8d-d9f1-4ebe-bde3-e753189e526c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Smart Motion Detection, with Adjustable Sensitivity and Detection Zones Advanced Motion Sensor: This sensor can detect movement within the camera's view. You can adjust its sensitivity to match your needs. Detection Zones: For instance, in the example above, the camera has three zones set up. It will only detect motion within those areas. (Optional) AI Person Detection Feature: This feature filters out non-human activity, focusing solely on human movements. Please note it's an extra option and not included by default. Alarm Notification: You'll receive alarms on your phone. You can also setup sending Email with movement snapshots to your Email box.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d64dfe28-5b0b-42b4-850b-1ca8daf6c2ce.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Power Options For continuous 24/7 operation/recording, please plug the camera into a standard USB power adapter(5V 1A or 5V 2A). If you want to record while you're moving around, just use a 10,000mAh power bank to extend recording for another 24 hours. If you're looking for a compact power bank, you can try with power bank like a lip sticker. These typically have 5,000mAh capacity, which is good for about 12 hours of recording. Important Note: this model has No Built-in Battery (USB power adapter not included in the box) ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ RTSP Support The camera supports RTSP, allowing access via other RTSP software such as Synology, Qnap, VLC, iSpy, etc. The camera can also be integrated into a suitable surveillance network via RTSP. Note: not support ONVIF, only support RTSP. ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ Packing List MW3N Pro Small WiFi Camera x 1 USB Cable x1 Product Quick Guide (English) x 1 (USB power adapter not included in the box) ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ Important Note1: Heat During Camera Running The MW3N Pro is air-cooled, which means that it is normal for the camera to feel warm or hot at touch while it is in operation. The surface material is heat resistant up to 248°F, so it is safe if you feel hot. In addition, the material used is flame retardant. ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ Important Note2: Not for Close-Range Shooting within less than 12 inches, such as reading text on screen Not for close-range shooting within a distance of less than 12 inches, such as reading text at close range. Designed For indoor surveillance, it performs best at distances ranging from 20 inches to 23 feet.",
                "media_link": []
            },
            {
                "media_text": "MW3N-Pro Small Size WiFi 4K Camera MW6 Charger WiFi Camera MW5L Small Lens Camera (No Night Vision) MW7-Pro WiFi Camera Resolution 4K Snapshot, 2K Video 4K Snapshot, 2K Video 4K Snapshot, 2K Video 4K Snapshot, 2K Video View Angle 130° wide angle 130° wide angle 130° wide angle 150° wide angle microSD Card Support Y, support up to 256GB microSD card. Save More with H.265 tech Y, support up to 256GB microSD card. Save More with H.265 tech Y, support up to 256GB microSD card. Save More with H.265 tech Y, support up to 256GB microSD card. Save More with H.265 tech Alarm Detection Smart Detection with Adjustable Sensitivity and Detetion zones Smart Detection with Adjustable Sensitivity and Detetion zones Smart Detection with Adjustable Sensitivity and Detetion zones Smart Detection with Adjustable Sensitivity and Detetion zones Speical Highlight Capture 4K Ultra HD in small body. Powerful Night vision and Better Images. Offers the highest resolution among models with a similar appearance. Compatible with U.S. power outlets. WiFi camera with an incredibly small lens that captures vivid 4K/2K high quality image with natural colors. Cloth Button Set included for DIY. (Note: No Night Vision) Pemium 4K/2K WiFi Camera, Unlock Superior Image with UltraHidden Glass.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4aea37f-7db1-431a-ae5d-f03f9780f182.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b982c533-dde9-4170-a6d7-2103932ab0eb.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/01a22b3a-404b-4a47-af28-7e868469c6db.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/878b6f8d-d9f1-4ebe-bde3-e753189e526c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d64dfe28-5b0b-42b4-850b-1ca8daf6c2ce.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df347e36-f749-458e-b49d-4b7bbc4d3a10.__CR0,1,312,624_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/12ebeb5b-abc5-46b0-bf8d-0166a74385e5.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8a6705ef-0930-4765-8b3d-4079b7bb7b7e.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e04dd9ba-72a1-4a46-aa0e-17cfed41434a.__CR0,0,384,768_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JasonJason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEGZ2SNX2TKPARC53MP26QMDONQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G0K4XFYJ3GLZ?ASIN=B0CKYHG12D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome camera!",
                "reviewText": "Camera works great! The night vision is very clear and the camera is smaller than a bic lighter (see pic). Easy to set up and watch on your phone. Would definitely recommend it.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71O71IJVFsL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ohs0fast",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKXEWMZLU2CKG5X25ABKONMPPMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MT4A50QS8TK8?ASIN=B0CKYHG12D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Great hidden camera",
                "reviewText": "I've tried several hidden cameras from Amazon and Wiwa has consistently had the best picture. This is MWN3 and it has great picture like the others I've tried. The app is better than the others as well (although I'm really hopeful for some more improvements). It is small, but may still be difficult to conceal depending on the requirement - its about the width of a 9v battery and half the thickness but a little longer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike D3.Mike D3.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFENESMXGRHAZZ5GZR6BC4VEICFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A9TC7BPSUFET?ASIN=B0CKYHG12D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Good spy camera for indoors",
                "reviewText": "This is another small camera that is good for surveillancing your home. It's about the size of a usb thumb drive. See pictures. It does get hot too just like its other model mw5l but it works fine. I use it 24/7. I like that it can resume its operation when power is restored. No need to reconfigure. Also i use its continuous recording then push alarm to my phone. The alarm is like my bookmark of what time an event happened then i can go back on the recorded video on that exact time and can see the whole event before it happened . During and after it happened. The other thing i like is that it records its videos in a 30 minutes interval and syncs to the 30minutes of the hour. Doesnt matter when you start recording it adjusts itself 30minutes so videos are organized and easy to search. The motion detection is also responsive but theres like a few seconds like 2 seconds before it starts sending alarm but thats why I use its continuous recording so i see the whole picture. Since this is a thumb drive size and no built in battery you need to plug external wire and that makes it a bit more visible. But you can always position it to hide the wire and itself. Night vision is good but i wish i could turn it off if not needed so that it can show me in color. It turns the video black n white when night vision is on. But overall I recommend this camera. It works.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Lqz51urvL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61VxmUn9DNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61edjwfuXlL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61j+6yaqOqL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+ZXBhKBlL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719s0RhFkkL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71EmqzT6N3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71b2HkrISAL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM3DEWTG4E4HQ3OU5DTXHRSJHXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RG2LVCR88DSC3?ASIN=B0CKYHG12D",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "1.0 out of 5 stars How are the reviews so high for this?",
                "reviewText": "I'll come back and change my review if it gets better. Initial impression: app or horrible (and rated as such in the store), camera is NOT HD from what I'm seeing. It's set to UHD, but with and without the cap, it has a red/purplish haze to the video. In a fully lit room, it jumped to night vision and now I cannot figure out how to get it off of it (just records everything in black and white now.I was planning to set this up in our front entryway, which is always lit (5000k/daylight), but if it's only going to record black and white, I'll just get another standard security camera. I just got this because I didn't want some large camera mounted on the ceiling.I also only had it plugged in testing it for about 15 minutes, and it was crazy hot when I turned it off. I'll test it more another day and update this if it's somehow way different than what I'm seeing initially.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nito",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNYAHMEK4E7QJXLOJTDWDYRID5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IQT50O05F6WI?ASIN=B0CKYHG12D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Powerful little camera",
                "reviewText": "This camera is ideal to use as a nanny cam or in my case, to watch my dog while I'm at work. I am able to see images in complete darkness as well with the night vision feature. It is fairly simple to connect on wi-fi and the app interface is easy to follow and make configuration changes or to play back videos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AirBear",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXJCUTHDNAS27NUMFHTYYLWY3XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EL1DNVUXRSZS?ASIN=B0CKYHG12D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Much better value thank I had expected...",
                "reviewText": "This was easy to set up and has all the good features like motion zones, push alerts and sound.The only improvement I'd recommend would be a 'clear' lens cap as opposed to the smoked or dark cover which impairs clear view. I'm using it without the lens cap and have a very good picture for the price.I would recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trent Davis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXYWPABRCIWWPQ7COTACJVLKU4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLRB5QV7YGA0W?ASIN=B0CKYHG12D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Very pleasantly surprised.",
                "reviewText": "I've been using this camera for a few weeks now and I am completely thrilled with it. The picture quality is great and the night vision is superb, especially if you add additional IR lights to help illuminate the area. The range with the provided IR lights is decent but if you want to view things further away, then you'll need additional light. That's pretty standard for cameras of this type.I love how compact it is and it really blends in well. If you have a few remotes for TV's or anything techy like that, this would probably not be noticed at all if it were sitting amongst them.I really don't regret this purchase at all and I plan to buy a few more.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX3XDYH6QIPN7ETTCWB6CAGJOLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HRSPK271GNTR?ASIN=B0CKYHG12D",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "4.0 out of 5 stars Great camera for price",
                "reviewText": "Purchased this camera to keep an eye on my elderly Mom. The picture is very clear and love that it has sound you can turn on or off as needed. It does heat up and hopefully that will not pose any issues in the future with the device. It did take a few tries to set up, but instructions were very clear and concise.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}