{
    "remaining_requests": 38849,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Viseefocu-Security-Wireless-Spotlights-Waterproof/dp/B0BQ31GC9G",
    "body": {
        "name": "Solar Security Cameras Wireless Outdoor for Home Security, Two Spotlights and 1080P Color Night Vision Battery Powered Camera with 2.4GHz WiFi, PIR, Two-Way Talk, IP66 Waterproof(Black)",
        "price": "$49.99",
        "originalPrice": "",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Viseefocu-Security-Wireless-Spotlights-Waterproof/dp/B0BQ31GC9G",
        "soldBy": {
            "sellerID": "A14T89XR6SQ8LG",
            "name": "Jimtech market",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A14T89XR6SQ8LG&asin=B0BQ31GC9G&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLNHKV91"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BQ31GC9G",
                "variationName": "PatternName",
                "variationValue": "Black",
                "price": "$49.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BKFT6C4L",
                "variationName": "PatternName",
                "variationValue": "White",
                "price": "$59.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CC4VLTJ8",
                "variationName": "PatternName",
                "variationValue": "White-2packs",
                "price": "$89.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "20",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $10 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51WLPyJqBhL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51udB1OUT3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fBsJG DJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EH9BQ3p7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lvWt5-VEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bTgH sAML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1KCIyqJnsL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0f1b32a4-1a6a-4d3e-8400-de0d0274e610/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B13lR5N3FYL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71aCTqf0KcL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Viseefocu Store",
            "link": "https://www.amazon.com/stores/Viseefocu--Asafechoice/page/9BD2BA37-86CE-4E33-BD29-32637E8FD98D?ref_=ast_bln"
        },
        "brand": "Viseefocu--Asafechoice",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2096,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 5 hrs 46 mins",
            "FREE delivery Tuesday, February 20",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Tomorrow, February 14. Order within 14 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Color Night Vision 1080P FHD: The solar security camera adopts an upgraded 1080P optical camera, which not only has good picture quality during the day but also can capture more things in low light or dark light, providing detailed and clear graphics and video, brand new The 2 high-power flashes and built-in infrared can better help you take excellent color pictures and videos at night, the night vision range is 23-33FT, you can see any surveillance corner you set in advance.",
            "Solar charging and large-capacity built-in battery: The solar panel is designed with polysilicon, and the solar-photoelectric conversion efficiency can be increased by about 30%. At the same time, the solar security camera outdoor has a built-in 5000Mah rechargeable battery, which can be charged 100% through the included USB charging cable or solar panel. The wireless and uninterrupted power supply, and the included 3 meters solar charging cable, meet your placement needs.",
            "PIR Motion Detection and Two-way Talk: The security camera Wireless outdoor adopts the more advanced PIR artificial intelligence motion detection technology, which can intelligently distinguish people, cars, pets, passing, staying, leaving, etc., reducing false alarms caused by leaves, wind noise, and rain, etc. You can draw a custom monitoring area, pay more attention to the places you want to pay attention to, and push the detection content to the APP \"Vicohome\" in real-time.",
            "IP66 Waterproof and Smart Sharing: The solar security camera indoor adopts the latest IP66 waterproof rating, which can be used safely in any weather conditions, and the temperature range is (-4°F~122°F), so you don’t need to worry about extreme cold and heat. At the same time, the camera supports multi-user connection and device sharing. When you have no time to take notice of notifications, you can share the camera with your family and friends to protect your home together.",
            "Easy installation: The solar security camera simplifies the installation steps, allowing you to get rid of the cumbersome installation process, and is equipped with a high-gain antenna and 2.4Ghz wifi transmission, with strong anti-interference ability, using 8-128GB micro SD card (not included) and 3 days cloud storage, let you have more choices. We focus on customer security and privacy protection, all images are encrypted, and no one can access the information without your consent."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Video Surveillance",
                "link": "https://www.amazon.com/Video-Surveillance/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7161091011"
            },
            {
                "name": "Surveillance Cameras",
                "link": "https://www.amazon.com/Surveillance-Cameras/b/ref=dp_bc_aui_C_4?ie=UTF8&node=898400"
            },
            {
                "name": "Bullet Cameras",
                "link": "https://www.amazon.com/Bullet-Cameras/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14241331"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6.3 x 3.94 x 4.33 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.19 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BQ31GC9G"
            },
            {
                "name": "Item model number",
                "value": "CG6X"
            },
            {
                "name": "Batteries",
                "value": "2 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,096 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#49 in Bullet Surveillance Cameras"
            },
            {
                "name": "Date First Available",
                "value": "December 14, 2022"
            },
            {
                "name": "Manufacturer",
                "value": "Viseefocu"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Outdoor Security"
            },
            {
                "name": "Brand",
                "value": "Viseefocu"
            },
            {
                "name": "Model Name",
                "value": "CG6X"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Special Feature",
                "value": "motion-detection"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page keep you safe 24/7 Strict waterproof test in compliance with the international standard of Seiko Manufacturing. Restore the scene. The high-performance sensor, together with a wide-angle lens, captures every detail for you. Solar-powered, uninterrupted security The built-in 5000 mAh lithium battery and solar panel get you rid of the trouble of charging. Dual Light Source with Color Night Vision Upgraded double white-light source. take color pictures at night. Night vision range is up to 33ft. Only supports 2.4Ghz WiFi Two-way audio for live communication For family and friends, live chat to experience interactions, regardless of time and location. Next page 1 IP66 Waterproof/Dustproof 2 1080P Image Quality 3 Battery and Solar Powered 4 Color Night Vision 5 Two-way Audio",
                "media_link": []
            },
            {
                "media_text": "Previous page One account, multiple devices you can enjoy adding and viewing multiple devices online at the same time. Send Real-Time Motion Alerts With the built-in microphone and Hi-Fi speaker, can warn to stop the loss in case of an emergency. The key area, the key focus. Draw customized activity zones in the app.Irrelevant information outside the area would be filtered Advanced AI technology,reduce false positives AI recognition and analysis algorithms intelligently distinguish no more redundant pushes. Easy to share access with family and friends. Access can be shared through the app. Family can scan the code to get camera access fast and easily. Next page 1 Watch Simultaneously 2 Motion Alerts 3 Activity Zone 4 Smart Notification 5 Multi-Users Remote Access",
                "media_link": []
            },
            {
                "media_text": "Viseefocu Solar Security Camera Wireless Outdoor Video Resolution 1080P Network Wireless Standard 2.4 GHz Wi-Fi (Not Support 5Ghz Wi-Fi) Network Protocols Supported TCP/IP, UDP/IP, DHCP, RTMP, MUTP Recording Method Alarm triggered recording, manual recording(does not support 24/7 continuous recording only supports live view and motion detection recording) Video Storage Cloud storage, local Micro SD card (up to 128 GB), and mobile phone memory AI Function Human detection, vehicle detection, pet detection, package detection, activitiy zone Wake-up Method PIR body induction wake-up and remote wake-up Alarm Notification Alarm push by mobile app''Vicohome'', white LED flashing and alarm sound warning Indicator RGB tri-color LED（Working mode-Blue Sleep mode-LED Off Charging mode-Yellow Fully charged mode-Green Battery Capacity 5000Mah Battery Working Time With solar panels, electricity every day. NO solar panels,6 months (recording 20 pieces of 10-second video per day; pan & tilt unused) Battery Standby Time 2 years supporting device ''Vicohome''on the phone or brand(The camera only supports this APP,download from Google Store or Apple Store),The camera does not support other devices such as computers, notebooks, streaming media, etc. Battery Protection Over-charge, over-discharge, over-current, short circuit and charging protection at high and low temperature",
                "media_link": []
            },
            {
                "media_text": "What comes in the box? Security camera, 1.6W solar panel, mounting bracket, screw set, charging cable, user guide. Does the wireless security camera support 24/7 continuous recording? This solar security camera does not support 24/7 continuous recording only supports live view and motion detection recording Does the camera support 5Ghz Wifi? The camera does not support 5Ghz WiFi, only supports 2.4Ghz WiFi Are there privacy risks in cloud storage? Cloud storage is a partnership with Amazon Cloud, and the storage is located where you purchased it,The security camera has military-grade encryption and no one can access the camera if you don't share your device with him. How to contact the seller with questions You can find us in QA or Amazon channel, we can help you solve any problem. Please feel free to find us",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2aa85b2e-3904-4fa6-a2d4-24d1e454c937.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95985423-a61b-454f-bb1e-808b7af5ab1c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a7167e1-1b8e-4787-a10b-62b9869942aa.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cfbe7f40-4e51-4272-96a8-f37128ecd4c3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24be0130-5b1a-49d1-b647-e33abe769d2c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a43c4eab-ebfe-4fdb-983a-e05fa09a6d8a.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/310c88fa-6589-40cb-963f-c43f9a4c9578.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0d6aed4-ec63-4722-ae1e-07b305cf4140.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b35e83b9-9f74-4057-8023-08a9e6895487.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b42c813e-ddc4-4bb9-8831-f137181c8b97.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30a2b93d-7093-4284-ace7-be206b8957ed.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0dbfa647-0610-438d-9e05-eabb446458f3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29c6b337-6b69-4322-aff3-d93d81d559a7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Timothy D. Runkel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUC4YCTN7ZH5TXAWYD54EBGPGYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SHAWAS9VEC94?ASIN=B0BQ31GC9G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Just what I was looking for.",
                "reviewText": "This solar security camera was exactly what I was looking for. A low cost with quality build. This thing is solid and does exactly what it is stated to do. Camera is bright and clear , motion detection is working as it should and at medium setting I get no false detection. At high motion detection I do get bird/squirrels setting it off because it reaches further, at medium it works very well for my situation. The view at night is very clear in b&w . I have not tried the color yet but will. Audio is unexpectedly pretty darn good also. The fact that I do not have to subscribe to a monthly fee unless I want the premium features is what sold me on this camera, all the other great things are a big bonus. The free program is just fine with me, it alerts when someone approaches the zone and records for the record. Ordered a second one which came overnight for the front door , need to install tomorrow, installation was a breeze and took about 10 minutes. Wifi signal is strong and has been connected constantly .......no problems there. If you are looking for barebones,no cost, simple hook up and reliable , this is it.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James JonesJames Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECFMGXOKDUKKGVJROEBQ33A7I6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX5F0P0UX0KK?ASIN=B0BQ31GC9G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2023",
                "reviewTitle": "5.0 out of 5 stars A-1 Performance",
                "reviewText": "I am very impressed with this camera. I have had cameras costing five times as much that can't come close. The picture quality is amazing. As you can see in the photos it has a good wide angle view and is clear for a long distance. I am very amaze at the distance the motion censor can reach. I get notifications every time a vehicle enters our road or a person walks down it. This is great as we have a drug dealer living down the road from us and traffic becomes extremely heavy a few times a month. We live in the middle of nowhere in a small community of right at 200. Our police officer is in with the drug dealers and thieves and that's the reason I needed better cameras. I can put the videos on my computer and expand them to get tag numbers of people going down to the drug house and give them to the Feds.At night it performs great as well. The lights can literally turn night into day. The alarm works great as well as the two way speaker.Solar panel works great with or without sun. The battery is always full.I get notifications sent to my phone every time the motion sensor is set off and I can see live video no matter where I am, even 300 miles away at my daughter's.We have had some extreme storms recently and a few days where the heat index reached 114. Neither reduced performance.As an ex police officer and security specialist I highly recommend this camera to everyone. Comes with everything you need for a fast and easy installation. It took me less than 15 minutes to set it up and installed. There is also a micro SD card slot. The app is easy to use and you can record and delete video any time you want.These cameras were well thought out when designed. You can't go wrong with these. I'm going to be ordering several more over the next month to cover my entire property. Two thumbs up to the manufacturer.",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61tiPyRnnWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/810M8OYx8QL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81y5PoWBwML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "GereshGeresh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTL5TEJ3G7HVLVZDPFKEMUFXKQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X0VCTLGWQSN2?ASIN=B0BQ31GC9G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Overall good",
                "reviewText": "I bought this camera to monitor my house entrances and I am very satisfied with its performance. The camera is easy to install and connect to the app. The solar panel keeps the battery charged and I don’t have to worry about running out of power. The camera has a clear picture quality, both day and night. The spotlights are bright and the color night vision is impressive. The motion detection is sensitive and accurate, and I get alerts on my phone whenever there is any activity. The two-way audio is also clear and loud. The camera is waterproof and durable, and it has survived some heavy rain and snow. The cloud and SD storage options are convenient and secure. The app is user-friendly and has many features and settings to customize the camera. The customer service is responsive and helpful. Overall, I think this is a great camera for the price and I would recommend it to anyone looking for a reliable and affordable outdoor security camera.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CzlRe+dFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pN61fGmBL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "C&DW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTA72MS7Y6XA2FP3MSNUUREQE6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IIIURUMHGH62?ASIN=B0BQ31GC9G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Camera at a GREAT PRICE!",
                "reviewText": "This camera caught my eye when I was looking at the different options. Was leaning toward some of the more common, but expensive systems until I found this. It is great quality, uses a solar panel, so it can be independent of power, has color image and great night vision imaging. It also has a speaker that can alarm, or you can talk through using the app. Also, the app is user friendly and alerts are quick. The ability to set your detection area patterns yourself helps if you don't want plants that blow in the wind to be detected. You can also set it to detect and alert for cars, people and animals. Also, you can pay a little extra for cloud storage or insert a mini SD card and jot pay anything extra. Cloud storage is a couple dollars a month and is worth it. You can also manually clear the videos or they will erase when the storage gets full, last video first. Been operating it for nearly a month and found it to be reliable and easy to use. Also, kinda fun messing with the cats when you speak through the camera and they don't know where it is coming from, or the stray cat that runs when I say \"here kitty kitty\"! It is a great system, expandable, and can't beat it for the price.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jimmy Q.Jimmy Q.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFVMEQRLDVBRNB6ZFUMIZYWQ53Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X5WEJ52024M?ASIN=B0BQ31GC9G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Great for the price just some details",
                "reviewText": "I must say that I am very impressed with the quality of this camera.Pros:-Price-Picture quality-Easy installation and setup-affordable cloud storageCons:-Not compatible with Alexa-activity zone good with notifications but still record movements out of zone, which keeps camera busy, storage full and consuming a lot of power",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/6189H+79BAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ka-YvZj8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71tCkF6TnkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexandra Franco",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRSUCCSA4CSE5C57Z5UDTZUHFTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QYUDTCIOKPSP?ASIN=B0BQ31GC9G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent !!!",
                "reviewText": "Is good resolution, good focus, always attentive to movement. Excellent price",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Win and Rachelle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQIEIWZV64A7XORJID7UW42ZBOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38YJWRDSVCQT?ASIN=B0BQ31GC9G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars The build quality is robust ensuring these cameras withstand all weather elements",
                "reviewText": "The integration of solar power is a game-changer – no more worrying about changing batteries or complicated wiring. The wireless setup makes installation a breeze, and the 1080P color resolution delivers clear and crisp video footage.One standout feature is the inclusion of two spotlights, providing not just surveillance but an added layer of security with enhanced visibility at night. The motion detection is highly responsive, alerting me promptly to any activity. The ability to customize the sensitivity and monitoring zones adds a level of control tailored to my specific needs.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}