{
    "remaining_requests": 38821,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ELEPRO-Surveillance-Tracking-Network-Security/dp/B0CLK9VFGF",
    "body": {
        "name": "[5MP/5G WiFi/IPv6 Surveillance Camera Indoor Camera with Color Night Vision, PTZ Auto Tracking Network Camera 2 Way Audio for Home Security/Pet/Elderly/Baby Monitor with Phone App",
        "price": "$29.90",
        "originalPrice": "$49.90",
        "rawPrice": 29.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ELEPRO%E3%80%905MP-Surveillance-Tracking-Network-Security/dp/B0CLK9VFGF",
        "soldBy": {
            "sellerID": "A2UVA2ZLLDQGZ5",
            "name": "ELEPRO Flagship Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2UVA2ZLLDQGZ5&asin=B0CLK9VFGF&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CM8JQMQC"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Hfp8ccpnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/4117Ctl4ytL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51b6rCh3Y5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51eTKH8PqAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5113i63zMkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XFhQ XBAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Rey4aeCjL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: ELEPRO",
            "link": "https://www.amazon.com/ELEPRO/b/ref=bl_dp_s_web_38674828011?ie=UTF8&node=38674828011&field-lbr_brands_browse-bin=ELEPRO"
        },
        "brand": "ELEPRO",
        "merchantInfo": "ELEPRO Flagship Store",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 943,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 16 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "**5 Million Pixels** - The latest 2023 upgraded version of our security camera boasts a high-quality 5 million-pixel 1920P (2560*1920 2.5K) lens, providing sharper images than 2MP/1080P, 3MP, and 4MP/2K pet cameras. It also features a digital wide dynamic range function for clear images even in challenging backlighting conditions. With a 355° horizontal pan and 75° vertical tilt, you can effortlessly monitor the entire room from your smartphone.",
            "**Clear Night Vision** - Our home security camera excels in night vision, offering starlight-grade lenses and three light modes to provide color video at night. It achieves exceptional night vision up to 8 meters, ensuring clear footage of your baby or pet even in dark environments with automatic night vision.",
            "**Two-Way Communication & 5G Wifi Supported** - Thanks to the built-in microphone and speaker, you can engage in two-way audio communication from anywhere via this pet camera indoor. Connect with your pet or family members no matter where you are. This camera supports dual-band Wi-Fi, operating on 2.4GHz and 5GHz wifi for seamless remote monitoring and smoother video streaming. Motion detection videos can be stored on a MicroSD card (sold separately) for online playback and download.",
            "**Motion Detection & Alert Function** - When human activity is detected and automatically tracked, you'll receive real-time alerts through the app,If you have activated both the sound and light alerts, even at night, when human motion is detected, the camera will emit a sharp alarm sound and capture a color video, ensuring the security of your home.",
            "**Remote Monitoring & Easy Sharing** - This wifi camera supports both Wi-Fi and AP connections, adapting to a wide range of security scenarios. You can monitor pets, elderly family members, children, home security, warehouses, and stores via your smartphone or tablets, receiving real-time alerts with AI person recognition and tracking recordings. The camera is easily shareable with family members, facilitating collaborative monitoring and enjoyable pet or baby watching."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b?ie=UTF8&node=502394"
            },
            {
                "name": "Video Surveillance",
                "link": "https://www.amazon.com/Video-Surveillance/b?ie=UTF8&node=7161091011"
            },
            {
                "name": "Surveillance Cameras",
                "link": "https://www.amazon.com/Surveillance-Cameras/b?ie=UTF8&node=898400"
            },
            {
                "name": "Dome Cameras",
                "link": "https://www.amazon.com/Dome-Cameras/b?ie=UTF8&node=14241151"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2.76 x 2.76 x 4.53 inches"
            },
            {
                "name": "Item Weight",
                "value": "11.3 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CLK9VFGF"
            },
            {
                "name": "Item model number",
                "value": "V9"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 943 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#528 in Dome Surveillance Cameras"
            },
            {
                "name": "Date First Available",
                "value": "October 22, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "ELEPROTECH"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Indoor Security"
            },
            {
                "name": "Brand",
                "value": "ELEPRO"
            },
            {
                "name": "Model Name",
                "value": "V9"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Special Feature",
                "value": "5MP 2.5K High Resolution/2.4G&5G Wi-Fi Supported/ IPv6 supported/Color Night Vsion Optinal"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "No.1 Best-Selling Indoor Home Camera in Japan This camera is equipped with a 5 million pixel high-definition camera, capable of connecting to 5G/2.4G WIFI. It offers two-way audio and night vision with color mode, making it ideal for monitoring pets, children, and security surveillance. Note: The camera is intended for indoor use only.The camera is not compatible with Alexa.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/60cc13bc-f176-4a91-840a-e0d57b1d0cd6.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Pet Camera Indoor Camera Baby Monitor With regards to storage, using a 128GB Micro SD card allows for recording of up to 20-25 days in HD high resolution (1920P: 2560X1920) or up to 70 days in SD standard resolution (360P: 480X360), with older recordings being automatically overwritten. Note: Note: Micro SD card is not included.Note: Not support cloud storage currently.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1cfb5c3c-c453-4ae6-94f7-9bb0d90f790b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Multi-View Feature in the Srihome APP You can monitor up to 4 cameras simultaneously in real-time with the four-screen display. You can manage multiple cameras on one device. Currently, there is no limit set, but there may be a limit set in the future. It's good to consider up to 20 cameras as the maximum. Note: If you're having trouble reading the small font in the instruction manual, you can scan the QR code on the manual to download an electronic PDF version.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29628030-5a35-4d9a-a7d5-168fce74757d.__CR0,0,970,600_PT0_SX970_V1___.jpeg"
                ]
            },
            {
                "media_text": "Note: Please ensure to be aware of blind spots in the camera's field of view, and install the camera appropriately based on the intended usage.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72b6fa83-5bcf-40be-9c6f-3b86b8e6fc63.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "*Depending on the app version, the layout may vary. What Is the Difference Between 5GHz Wi-Fi and 2.4GHz Wi-Fi? 2.4GHz and 5GHz are frequency bands used for wireless LAN communication. 2.4GHz can transmit over long distances, and its signal can spread over a wide range. However, because many wireless LAN devices use this frequency, it is prone to interference and signal congestion. Also, 2.4GHz can be affected by interference from other peripheral devices such as Bluetooth and microwave ovens, which can slow down the connection speed. In contrast, 5GHz provides high-speed communication with less interference, making it less prone to signal congestion. However, 5GHz has a shorter communication range compared to 2.4GHz, and its signal can be weakened by walls or obstacles, resulting in lower transmission speeds. If the 5GHz signal is weak in a certain area, it is recommended to switch to 2.4GHz Wi-Fi. Please note this.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9dd8ca6-fdc7-4491-a0e1-a84cad0b8521.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "[Important Notice] * Please Confirm and Understand Thoroughly Before Purchasing to Avoid Any Misunderstandings This camera is operated by a power source and needs to be connected to a power outlet. The lens may become about 50 degree during use.It is only compatible with Android OS, iOS smartphones, or tablets and requires the installation of a free app. As it is a network camera, it is not recommended to be used without Wi-Fi. When the camera is connected to Wi-Fi, it can be remotely monitored through a smartphone.Can only use our app - Srihome. To use the app, registration and login are required. A valid email address must be used as the username during registration. This is necessary to receive an authentication code if you forget or want to change your password. The email address will only be used for registration purposes and no personal information will be sought by the app. For the network camera, failing to allow access to location information may prevent Wi-Fi display and connection. However, the information provided is only an approximate location (at the city or town level) and does not pose any privacy issues.The Srihome app is used to playback videos or view saved videos by removing the SD card and playing them on a computer. You can also download and save videos to your smartphone, but this function is only available for Android devices, as Apple devices do not support it. The video files cannot be deleted, but the SD card can be formatted. Please note that the app does not support double-speed playback.The automatic tracking function only rotates horizontally and not vertically. This monitoring camera is equipped with an advanced AI function that can detect suspicious movements, but it may also have false detections depending on the environment, such as strong winds or reflections from light changes or window glass. Therefore, proper placement and settings are necessary.When rotating the lens, the sound of the motor turning may be heard at a distance of about half a meter. If the camera is placed on a relatively thin wooden table, the sound may become louder due to resonance. There may be some delay in the pan-tilt operation due to the internet speed.This camera does not support cloud storage and a separate SD card would be required to save the videos. If set to continuous recording, videos will be recorded every 10 minutes. If you want to prioritize the detected videos, it is recommended to set up an alert recording that is easier to review.You can manually record while viewing in real-time, with the recorded video saved to the smartphone (Android devices can download, but Apple devices cannot). It is recommended to set up continuous recording or motion detection recording.This surveillance camera is compatible with the ONVIF standard and recording is also possible with NVR devices. However, no NVR device is included and the connection method is not specified in the instruction manual.It can be used by placing it on a stand or by fixing it to a base on the ceiling. The camera and base are fixed with clips and can be easily removed.In full-color night vision mode, the spotlight will light up (red infrared mode is recommended for children's monitoring purposes as it can be dazzling when viewed directly), and in black and white light vision mode, non-dazzling infrared LEDs will light up. The camera is not recommended for use through glass as it may cause reflections in the lighting.This surveillance camera has a zoom function that allows you to pinch two fingers on the smartphone screen to zoom in. However, please note that this is digital zoom and not optical zoom. Therefore, the image quality may deteriorate as the screen becomes larger.When watching in real-time to display images quickly without being affected by the network, the default viewing quality is set to 360P. Although you can change to high-quality, it cannot be saved for real-time viewing.The camera will automatically switch between day and night modes according to the brightness of the environmental lighting. During this transition, a shutter sound may be heard, or the screen color may change. If the illumination changes frequently, the camera needs to switch between modes frequently, but this is normal operation.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/32c961fa-2768-4d38-8482-48a356467f27.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Specifications Sensor 1/2.7-inch 5-megapixel progressive scan CMOS Lens parameters Focus distance: 4mm, 5MP, Starlight lens Field of view Horizontal: 80°, Vertical: 58°, Diagonal: 110°; 3X Digital Zoom Recording standards HD mode (1920P: 2560x1920) / SD mode (360P: 480x360) Real-time viewing resolution 1920P, 1440P, 720P, 360P (default) Image frame rate 15fps~25fps Night vision Night vision IR up to 10 meters Pan & Tilt Pan: 355°, Tilt: 70° Tracking AI automatic motion tracking Motion detection distance 8-10 meters (may vary depending on the usage environment) Alarm notification Push alarm notifications to smartphones Wireless 2.4G (11 b g n) mixed or 5G 11a/n/ac mixed, support for WEP, WPA & WPA2 encryption, IPv6 supported. App iOS/Android ( SriHome APP) Recording mode Motion detection alarm recording, 7/24 continuous recording, Time recording Playback MicroSD card recording playback, PC recording playback, NVR recording playback Product information N.W. 190g, product size: 7070115mm (LxWxH), input voltage: 5V (1A/1.5A/2A), DC port specification power cable: 1.5m (compatible with extension cables up to 3 meters, but using low-quality non-genuine cables may cause power supply issues).",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/60cc13bc-f176-4a91-840a-e0d57b1d0cd6.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1cfb5c3c-c453-4ae6-94f7-9bb0d90f790b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29628030-5a35-4d9a-a7d5-168fce74757d.__CR0,0,970,600_PT0_SX970_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72b6fa83-5bcf-40be-9c6f-3b86b8e6fc63.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9dd8ca6-fdc7-4491-a0e1-a84cad0b8521.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/32c961fa-2768-4d38-8482-48a356467f27.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kris D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWSN7HNF6JNQVJDP3ALKDEK5ZAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14S1MZVOAUVDL?ASIN=B0CLK9VFGF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Camera",
                "reviewText": "Works well and easy to set up. App sometimes lags a bit, but nothing crazy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "High quality camera",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5YV4UOMZ32F5G4SNQ6QT2APHPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW4G0ROHE4A1E?ASIN=B0CLK9VFGF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Visual and voice perfect",
                "reviewText": "High quality camera",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SUTHNRSUTHNR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2NLADHRSX7O4BT433BK4UHBTPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R48BCI8WWM6DO?ASIN=B0CLK9VFGF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Good \"Eyeball\" Camera (as I call it)",
                "reviewText": "I got this to have a controllable camera in the downstairs of our house. The software installs easily and simply scan the QR code on the back of the camera and it loads it. Through the app, you have control to rotate and pivot up/down the camera. You can also speak through the app and it comes out of the camera, wherever you are. The app gives plenty of options, including 24x7 recording with a micro-SD card installed. A 64gb cars seems to hold about 9 days or so of recordings.The recording does so into 10-minute files, each about 60-70mb. The real problem with the files is they are not time stamped to match the camera's time settings. The time stamp IN the videos themselves is correct, but the time stamp of the files as they are saved on the SD card are NOT - they are off by about 8 hours. I can't find a setting to make the files' time stamp match the actual timestamp recorded in the video, so if you have to pull up a video for something, you'll be hunting a bit until you get the correct time range.My only real gripe about it is that it's motion tracking also tracks light changes, so in the living room right now, it constantly wants to point at the Christmas tree and its flickering lights.Overall, however, it seems to be a good little camera.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51HKRq-JgRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51KUwbYYDaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51OFZFzXvwL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51T4NfH6ioL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61-8AGkmPNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/618TScW8ahL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ENJ6z1WiL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61KCVKXt-qL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Kn-9-fxGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61WoXuwy8XL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61XAOnTUigL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Y46rf9waL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Z9lROeyLL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61arUwN5vnL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61eSmJwEJZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61t-JCeQauL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61tc4JFT8JL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61z-5aUdAnL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61zWbszx8cL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TKwasny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAQGOJA3I7MTNY7CF3M3YGIWWSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BBOHU926NKSJ?ASIN=B0CLK9VFGF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Follow the written directions",
                "reviewText": "Flawless, quick installation on a Motorola Android cell phone. Firmware already most up to date right out of the box. Great picture, good sound in both directions. Strong WiFi signal.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCVRZQVCRGEQMJAL6ZOPXUPOHXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29DSNJGWFS5J5?ASIN=B0CLK9VFGF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice pet camera",
                "reviewText": "I use this to monitor my pets while I'm at work . Good quality and easy to set up and use",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brock Samson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2SOV7OUBMMZ3JXES2NFGVB2UJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BGYM4S2YQHNY?ASIN=B0CLK9VFGF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Awesome picture",
                "reviewText": "I like the picture super easy to set up. You can also set the settings via a web browser.Unfortunately, you can't view the picture via a web browser and they do not have a computer client so you are stuck with using the phone app. Personally, I don't like having to install an app from a company I don't know on my phone so that was a disappointment.otherwise it is a great little camera",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKBMHPWND3YYZAFKXZUA4A7ZNHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2010KJEK7QY95?ASIN=B0CLK9VFGF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Better than similar models.",
                "reviewText": "I have wanted one of these to be set up in my living room but have been waiting for better technology. That technology has arrived with this 2023 upgraded model. 5 million pixels, top-of-the-line lens for the best possible images in all conditions, even those with challenging backlight situations. WI-FI, 5G, full-color night vision. It has a 2-way talk feature with a built-in microphone and speaker. Set it on a shelf or hang it upside down from the ceiling. When human activity is detected it will be automatically tracked with an alarm sound and video is recorded. The app operates smoothly making it easy to manipulate the device. Just add an SD memory card which is not included. 75-degree tilt and 355-degree pan feature to easily monitor the entire room. Glad I waited because this is the one to buy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marguerite",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGEGZBEG6BOKLMN3QJJWCFJ2VZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R80J6Q5WOEXTT?ASIN=B0CLK9VFGF",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "1.0 out of 5 stars Not working",
                "reviewText": "This device does not work. The instructions are in tiny writing and not helpful. There is a YouTube video that demonstrates the setup but it isn't very helpful either.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "なし",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 11, 2024",
                "reviewTitle": "画像良いです",
                "reviewText": "留守の間のペット(チワプー)の事が心配で購入しました。可動域も広くて画像もバッチリ綺麗です。置く場所を工夫して行動場所がよく見えるようにしてます。声かけは出来るのですが首を傾げてしまうのでかわいそう。今は時々外出先から様子を見ています。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "k.kubota",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 9, 2024",
                "reviewTitle": "設定が簡単‼️",
                "reviewText": "ペット監視ように購入思いのほか設定が簡単で直ぐに使えました。画像も綺麗、コントロール範囲も広くとてもいいです。コスパ最強",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ポテト",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 7, 2024",
                "reviewTitle": "使い勝手が良い",
                "reviewText": "手頃なお値段で機能も充分",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "おさむおさむ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 9, 2024",
                "reviewTitle": "画質が明るくて良い。",
                "reviewText": "操作は、慣れるまで少し大変ですが画質が明るくて良いです。ペットのゲージを映して、外出先で確認する事に使っています。アプリも安定していて、良いです。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61gKUJEgy5L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "久門友貴",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 9, 2024",
                "reviewTitle": "ベビーモニター用に",
                "reviewText": "赤ちゃん用のベビーモニターもして利用しています。画質も良く、設定も簡単だったのでこれから大活躍の予定です！",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}