{
    "remaining_requests": 38615,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Security-Rechargeable-Surveillance-Waterproof-Detection/dp/B01CW47EG4",
    "body": {
        "name": "Outdoor Security Camera Wireless, Kami by Yi Rechargeable Battery Powered 1080p Outside Surveillance Front Door IP Smart Cam with Waterproof, WiFi, Cloud, Night Vision, PIR Motion Detection Sensor",
        "price": "$65.00",
        "originalPrice": "$89.00",
        "rawPrice": 65.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Security-Rechargeable-Surveillance-Waterproof-Detection/dp/B01CW47EG4",
        "soldBy": {
            "sellerID": "A2F1W40PN5YHCS",
            "name": "Eclectic Mart",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2F1W40PN5YHCS&asin=B01CW47EG4&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Yb-RrVLmL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51N0S0 yWWS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kGn835 0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CWCmwClAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fOo51NltL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FfVIrzj0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wdPaKUPQL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e2a0862-1f82-4067-b1d4-b14eff1e1f4a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/870db59c-955d-4cf5-ae06-3a3f8a088147/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/92f665f3-6ba4-4c6d-95be-57382ceee3e4/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/894606b1-a0b2-4374-ac4c-1daf059c8fd4/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cdc841ba-5da1-48cc-a96d-d4c5614b6755/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the YI Store",
            "link": "https://www.amazon.com/stores/YI/page/0DA0268E-DDB5-4927-B064-51731EE49D70?ref_=ast_bln"
        },
        "brand": "YI",
        "merchantInfo": "Eclectic Mart",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 1729,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 15.",
            "Or fastest delivery Tomorrow, February 14. Order within 6 hrs 6 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% WIRE-FREE: The Kami Wire-Free Outdoor Camera doesn’t require any external hubs or monitors, just charge the included batteries, and your camera is ready to go. Thanks to 4 lithium rechargeable batteries, the Kami wireless free camera can be used for up to 2 months depending on your optimal settings or usage.",
            "WEATHER-RESISTANT, ALL YEAR ROUND COVERAGE: Thanks to this camera’s wide operating temperature range (14°F to 122°F) and IP-65 Weather-resistant rating, you don’t have to worry about rain, wind or snow. Your camera will work no matter the conditions outdoors.",
            "WORKS WITH YOUR SMART HOME DEVICES: It doesn’t matter if you prefer Amazon Alexa or Google Assistant, the Kami Wire-Free Outdoor Camera works wither both smart home devices (provided they have a screen) with one simple voice command you can view your camera’s live-feed from your device.",
            "ADVANCED PIR MOTION DETECTION: Spend less time checking “false alarms” and only receive alerts when it matters. Thanks to the state-of-the-art PIR sensor, this camera is less likely to send alerts from moving trees, flags, and cars.",
            "KEEP YOUR FOOTAGE SECURE: Getting a Cloud Service plan allows you to keep your clips safely stored away, no matter what happens to your camera. Pick the perfect plan for you from a varying selection and never worry about filling up a memory card ever again."
        ],
        "description": "The Kami Wire-Free Outdoor Camera doesn’t require any external hubs or monitors, just charge the included batteries, and your camera is ready to go. Enjoy minimal downtime thanks to the camera’s long-lasting battery life that provides up to 2 months of protection.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b?ie=UTF8&node=502394"
            },
            {
                "name": "Video Surveillance",
                "link": "https://www.amazon.com/Video-Surveillance/b?ie=UTF8&node=7161091011"
            },
            {
                "name": "Surveillance Cameras",
                "link": "https://www.amazon.com/Surveillance-Cameras/b?ie=UTF8&node=898400"
            },
            {
                "name": "Bullet Cameras",
                "link": "https://www.amazon.com/Bullet-Cameras/b?ie=UTF8&node=14241331"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7.6 x 5.5 x 4 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.98 pounds"
            },
            {
                "name": "ASIN",
                "value": "B01CW47EG4"
            },
            {
                "name": "Item model number",
                "value": "Kami-77010"
            },
            {
                "name": "Batteries",
                "value": "4 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 1,729 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#166 in Bullet Surveillance Cameras"
            },
            {
                "name": "Date First Available",
                "value": "February 11, 2020"
            },
            {
                "name": "Manufacturer",
                "value": "YI Technology"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Indoor Security"
            },
            {
                "name": "Brand",
                "value": "YI"
            },
            {
                "name": "Model Name",
                "value": "77010"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Special Feature",
                "value": "HD Resolution"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEK6HZ3EMVSDU7TZPV5JDMU5IYPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E8TVSID1S5CR?ASIN=B01CW47EG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2020",
                "reviewTitle": "5.0 out of 5 stars Firmware update fixed battery issue",
                "reviewText": "Before buying this I read the other reviews that talked of poor battery life. Rather, the problem was that the camera's firmware was displaying a lower charge than the batteries actually had. I, like many others, charged the batteries overnight before installing. When I initially powered up the camera and connected to it, the battery indicator was only at 3/4. However, there must've been a FW update since I bought it, because after the first recharge, the battery indicator showed 100% and I'm now getting the battery life that I expected from the beginning.As for functionality and quality, this camera is a great buy. It's very easy to install and set up/pair. The image quality is right on par with any other HD camera, and night vision works flawlessly as well. I wouldn't hesitate to recommend, and I may even order another one!",
                "reviewVotes": "68 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sample789",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIHZMIOKEEZMO2ZS4AWLRARVS7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RG4WW1OZTBXHZ?ASIN=B01CW47EG4",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2020",
                "reviewTitle": "1.0 out of 5 stars Junk",
                "reviewText": "Do not buy these cameras! I bought them because I already have some YI cameras and I liked the fact I could control them all from the same app. I also like the idea of battery powered because the one I have in my backyard is no where near a plug of any sort. I bought three of these cameras and they all work differently. The one in the backyard never picks up any motion at all except at night when it switches over to night vision. For some reason when it switches it sets it off as an alert and it will periodically cut to a fuzzy picture and set an alert again. Even when I mow the yard it doesn't pick me up walking back and forth and the alert sensitivity is set to high. The front door picks up motion just fine but for some reason the camera picks and chooses when it wants to save to the SD card. Probably 98% of the time it won't save anything and it won't let me look at the short clip that it saves to the cloud either. The weird part is I'm using the same SD cards in all three cameras so I don't know why this particular camera is having issues with it. The garage camera works the best out of the three but it highlights another problem these cameras have. There is no option to set up activity zones. The way my camera faces it picks up part of the street so I'm always getting alerts when cars drive down the road. It's odd to me that the cheaper YI cameras have activity zones you can customize but these more expensive Kami's don't give you that option. I assume they are made by the same company since they use the same app. Maybe they will fix some of these issues in a future update but as they are now I would not recommend these cameras.Update 9/8/20I'm changing my review to a one star because I've contacted the company about some of the issues I've been having and have received zero response. The cameras are only getting worse too. When it gets dark out my backyard camera sets an alert about once every three minutes until the battery just goes dead. It's not picking up motion it's just the camera losing focus and regaining it that's triggering an alert. Now we are receiving the first snow of the year here in Colorado and the temp dropped into the 30's and now none of the cameras are working. They just say can't connect to the server. Save your money and buy something else these cameras definitely aren't worth their asking price. Honestly I don't think they should be worth anything more than what you could scrap the parts for.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mauris Ortiz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQ7NLMBWGOFTCSNQXOSYXGQZCFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZZXOY98PLJRQ?ASIN=B01CW47EG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Excelente la calidad en la imagen",
                "reviewText": "Funciona perfectamente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIDOEQO64ZINZNS7OPCRXYGRWVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6JHOFE4O7DRD?ASIN=B01CW47EG4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2021",
                "reviewTitle": "4.0 out of 5 stars Good For The Most Part",
                "reviewText": "I got this camera to put on the outside of my home because it is wireless. I had recently bought the indoor wired ones, and just had one of them facing outside of my living room window into the front yard. I liked how it worked so much that I thought an actual outdoor one would be better due to no haze later in the night because of the indoor one being behind the window. (Pros) of the outdoor one is it is definitely a much clearer view, due to not being behind the glass. The view covers more area. It was easy to install and to set up. (Cons) It does not have the settings of the indoor cameras. It does not allow you to set an area detection range. It glitches and will catch a person going sometimes but will not catch them coming. Because is has no range setting it will only catch something once it passes directly in view of the PIR area so often you will catch something really late, like the back end of a passing vehicle. The camera is okay, but if you are looking for something that will catch everything coming and going I would not recommend this particular camera.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. H. Matheu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH47CV5Z7FVCSKJZYG22ZICDJIIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31ZHSHHZB8EP8?ASIN=B01CW47EG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2020",
                "reviewTitle": "5.0 out of 5 stars BEST \"Sleeper\" option in crowded security cam market",
                "reviewText": "Kami (and Yi) cameras are excellent. I don't know why they don't get more press / better reviews.Functionality is excellent, price is as low as it can get and picture quality is great.This is my second house that I am installing a system of Kami or Yi cameras in.I have over 14 of them. All work excellent.The wireless outdoor Kami is the latest camera I have added onto my system.I was skeptical at first, not sure if it would work as advertised. So I tested it carefully. Saved the packaging, thinking I might have to return it.But it was great! I ordered another two of them. Might get more.Pro's:- EASY setup via QR code scan from your phone- Work great. All functions as advertised.- INEXPENSIVE.- No need for monthly subscription fees. (optional)- Recordings go to on-board SD card- SD Card recordings can be reviewed via app, and remotely (off site)- iOS app is excellent. Been using it for 4+ years. Works great.Con's:None yet.I usually like to go with bigger, more stable brands (like Nest/Google, or Phillips)Let's hope Kami (Yi Technologies) stays around for a long time and keeps supporting these great security cameras.Security Cam footage of your house is pretty anticlimactic. Not much really happens!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "scott",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 10, 2021",
                "reviewTitle": "works well in the cold",
                "reviewText": "This is a great camera that is easy to install and an easy to manage program. Batteries last a long time. So far works well at -15C and batteries last about 2 weeks depending on when movement is detected and I have it at set at the longest record level",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dennis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 20, 2022",
                "reviewTitle": "Total garbage.",
                "reviewText": "Can't switch to home and away so it notify me when I'm in the back yard. Sometimes. Trees set ot off bit people don't most of the time. Will be selling and will never buy kami again",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Burt",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 30, 2021",
                "reviewTitle": "Facile à installer",
                "reviewText": "Tres bonne qualité viens avec chargeur et batterie très bonne qualité et facile à installer merci amazone",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Na",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 22, 2021",
                "reviewTitle": "Pas bon pour détection de mouvement.",
                "reviewText": "Cette caméra est excellente pour un visionnement en temps réel. Pas adéquate pour détection de mouvement: Quand la caméra détecte un mouvement, elle se met en opération. Ensuite s'il y a un autre mouvement elle va capter celui-ci. Par exemple, si quelqu'un passe devant ta caméra et quitte, tu n'aura pas d'image de cette personne (à moins qu'elle repasse ou bouge encore une fois la caméra allumée)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 20, 2020",
                "reviewTitle": "Batteries last ONE month only",
                "reviewText": "I got 2 cameras, both working well; however, one of the 2 seems to have defected batteries and again the seller / provider doesn't seem to be willing to help.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$65.00",
                "sellerName": "Eclectic Mart",
                "sellerRating": "4"
            }
        ]
    }
}