{
    "remaining_requests": 38654,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Blink-Indoor-Wireless-Security-Camera/dp/B07X4BCRHB",
    "body": {
        "name": "Blink Indoor (3rd Gen) – wireless, HD security camera with two-year battery life, motion detection, and two-way audio – 1 camera system",
        "price": "$79.99",
        "originalPrice": "",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Blink-Indoor-Wireless-Security-Camera/dp/B07X4BCRHB",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08F64YM6V"
        ],
        "asinVariationValues": [
            {
                "asin": "B07X4BCRHB",
                "variationName": "Configuration",
                "variationValue": "1 Camera System",
                "price": "$79.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07X27JNQ5",
                "variationName": "Configuration",
                "variationValue": "2 Camera System",
                "price": "$139.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07X5FCW3X",
                "variationName": "Configuration",
                "variationValue": "3 Camera System",
                "price": "$189.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07X13N8MY",
                "variationName": "Configuration",
                "variationValue": "5 Camera System",
                "price": "$279.99",
                "variationImageURL": ""
            },
            {
                "asin": "B086DL32QX",
                "variationName": "Configuration",
                "variationValue": "Add-On Camera",
                "price": "$69.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41uBSwbwhWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31eHinNcgGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 trgdqfeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vKse1imOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DSCFQKLJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QbAQ-KnpL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Blink Store",
            "link": "https://www.amazon.com/stores/Blink/page/C5DECBBE-4F56-4C36-B933-E62144578691?ref_=ast_bln"
        },
        "brand": "Blink",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 26856,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest Same-Day delivery Today 5 PM - 10 PM. Order within 1 hr 55 mins",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Tomorrow, February 14. Order within 16 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Blink Indoor is a wireless, battery-powered security camera that helps you check in on your home day or night with infrared night vision.",
            "With long-lasting battery life, Indoor runs for up to two years on two AA lithium batteries (included).",
            "Store video clips and photos in the cloud with the Blink Subscription Plan and save events locally to the Blink Sync Module 2 via a USB flash drive (sold separately).",
            "Get customizable motion alerts on your phone through the Blink Home Monitor app so you’re only alerted when you need to be.",
            "See, hear, and speak to people and pets in your home with live view in real time and two-way audio features in the Blink app.",
            "Designed so you can set up yourself in minutes. No wiring, no professional installation required.",
            "Works with Alexa – use your voice to monitor your home through supported Alexa-enabled devices.",
            "Includes one Blink Indoor camera and one Sync Module 2."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Field of view",
                "value": "110° diagonal"
            },
            {
                "name": "Video resolution",
                "value": "Record and view in 1080p HD video during the day and with infrared HD night vision after dark."
            },
            {
                "name": "Photo resolution",
                "value": "View captured images in 640 x 360 nHD"
            },
            {
                "name": "Camera frame rate",
                "value": "Up to 30 fps"
            },
            {
                "name": "Size",
                "value": "71 x 71 x 31 mm"
            },
            {
                "name": "Weight",
                "value": "48 grams"
            },
            {
                "name": "CPU",
                "value": "Immedia Proprietary – AC1002B, 4 cores / 200 MHz"
            },
            {
                "name": "Power",
                "value": "Camera battery: 2 AA 1.5V lithium metal (non-rechargeable) batteries Sync Module 2 power: 100-220V AC to 5V DC converter included. *Battery life of up to 2 years, based on 5,882 seconds of live view, 43,200 seconds of motion-activated recording and 4,788 seconds of two-way talk. Battery life will vary based on device settings, use, and environmental factors."
            },
            {
                "name": "Requirements",
                "value": "Always-on high-speed internet connection (such as broadband, fiber, or DSL). Wifi network: 2.4 GHz 802.11b/g/n."
            },
            {
                "name": "Connection",
                "value": "Power adapter"
            },
            {
                "name": "Available colors",
                "value": "White"
            },
            {
                "name": "Minimum smartphone requirements",
                "value": "iOS 15.0, Android 9.0, or Fire 9.0"
            },
            {
                "name": "Blink app",
                "value": "Blink Home Monitor"
            },
            {
                "name": "Included in the box",
                "value": "Blink Indoor camera (dependent on quantity selected), Sync Module 2, 2 1.5V non-rechargeable AA lithium metal batteries (per camera), mounting kit (per camera), USB cable, and power adapter."
            },
            {
                "name": "Audio",
                "value": "Speaker output and 2-way audio recording."
            },
            {
                "name": "LEDs",
                "value": "1 blue LED to help you know when it’s active (optional). 1 red LED when recording in night vision."
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty and service included. Use of Blink cameras is subject to the terms found here."
            },
            {
                "name": "Support",
                "value": "Click here to view more information on the Blink Indoor support page. Click here to see the setup guide."
            },
            {
                "name": "Generation",
                "value": "3rd Generation"
            },
            {
                "name": "Operating temperature",
                "value": "32 to 95° F"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "E.M.S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3VFQ7D4FXYA3RUTDJCORT2VANQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MPQJR71BECJK?ASIN=B07X4BCRHB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Great wireless indoor security cameras!",
                "reviewText": "These are the first indoor wi-fi security cameras I have ever purchased. So far I'm very pleased with these compact and lightweight, attractive, mod little cameras! I bought four of them before the holidays because I wanted to keep an eye on our three kitty children while we were out of state. Even though we had a 2x daily cat sitter friend come by, I wanted a piece of mind so we could see our fur babies to make sure they were okay when they were alone and because we missed them so much as any good pet parent would! Ha! But I digress.These cameras are very easy to set up, install, and connect with wi-fi. They use AA batteries and are still full of power after 1.5 months of use. Though it will give you a warning (when you are viewing through your Blink app) that you may risk draining your power quicker if you're constantly looking through the cameras or recording all the time. Anyway, I mounted one on a wall, but kept the others mobile to adjust around the rooms as needed. The picture quality is pretty sharp and clear. When it's daylight or well lit in the room, you get a full color picture. When it is dark or low light in the room, you get a black and white picture. There is a delay of a few seconds during live time viewing, but it is not a big deal at all and to be expected. The speaker feature works very well when speaking and listening through the app and cameras and is very clear and audible...my husband and I tested this out while one of us was out or from different parts of the house. We also tested it out by speaking to our cats through the app from another state and they perked right up and looked right at the cameras when they heard our voices! Awwww!You can either set your camera system to \"disarm or armed\". When you set it to \"armed\", it will automatically record when it detects movement with short video clips. You can vary and set the duration and sensitivity of movement detection of the recordings for each camera as well as tailor privacy settings for areas where the cameras are set up (but I haven't explored the privacy areas feature yet). And then you can view the clips afterwards and either choose to keep or delete them in your archive list stores in your app. I downloaded the Blink app onto my Android phone and it's very easy to use and see what's going on in my rooms in live time during any time of day.Note: You DO need a monthly Blink subscription for recording and storing those recorded clips after your 30-day free trial ends. But even without a subscription, you can still VIEW what's going on in your home in live time. But without the monthly subscription, you will not be able to arm your cameras to sense or detect movement to RECORD and SAVE the clips. Take it from someone who's never had indoor cordless wi-fi security cameras before...these are EASY BREEZY and well worth it!!So far I'm VERY happy I bought these!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JohnJohn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6PIPVFXVM2UIU2LKEGND4SN6GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FX2G3X3DZPTE?ASIN=B07X4BCRHB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars A Game-Changing Sentry for Your Sanctuary",
                "reviewText": "Blink Indoor (3rd Gen) Security Camera is not just a device; it's an unparalleled blend of innovation, reliability, and peace of mind. If I could, I'd give it ten stars for being an absolute game-changer in home security!Let's dive into the technical brilliance and user-friendly experience of this masterpiece. First and foremost, installation is smoother than a jazz improvisation. A seamless setup process that would make even the most technologically challenged feel like a tech wizard. Within minutes, you're connected and ready to watch over your sanctuary.Now, let's talk about the star of the show: the two-year battery life. Yes, you read that right - TWO YEARS! It's like having a security guard who doesn't need coffee breaks. I've had it for months, and the battery level is still casually lounging at 98%. I'm starting to wonder if it's powered by fairy dust or some cosmic energy source.The HD video quality? Crisp. Sharp. Clear. It's like having your own personal cinematographer capturing every detail in breathtaking clarity. Whether it's detecting a stealthy squirrel in your garden or identifying the delivery person's smirk as they leave your package, this camera won't miss a beat.Ah, motion detection! This little marvel alerts you faster than a caffeine shot in the morning. You'll know when the neighbor's cat thinks it's auditioning for a Cirque du Soleil show on your porch. And the best part? Customizable motion zones - you decide what areas trigger notifications, saving you from alert overload.But wait, there's more! The two-way audio feature is a hoot! I've had conversations with delivery folks, startled my cat, and even freaked out my roommate by pretending to be the voice of an omniscient house spirit. It's like having a megaphone to communicate with the world, all from the comfort of your phone.The Blink app? Intuitive and user-friendly. It's like having your security control center in your pocket. Access live feeds, customize settings, and arm or disarm with just a few taps. Trust me; you'll find yourself checking it just to admire its sleek interface and ease of use.In conclusion, the Blink Indoor (3rd Gen) Security Camera deserves a pedestal in the Hall of Fame of home security. It's a beacon of reliability, a guardian angel watching over your home, and a source of endless entertainment. Five stars? More like a galaxy full of stars for this outstanding product!Do yourself a favor and invest in this marvel. You'll wonder how you ever lived without it. I can't recommend it enough - your home deserves this level of protection and convenience. Bravo, Blink, for creating a product that truly raises the bar in the realm of security cameras.Five stars? Absolutely, and then some!",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51RMoSUWz9L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61x-r7DtJkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK7LXGFT56GZG7EBG7WALUB46KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO66W0ZWCDQ7I?ASIN=B07X4BCRHB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Had these for over a year now",
                "reviewText": "So overall they do the job I purchased them for which was to monitor my living room, kitchen, hallway. I originally purchased the subscription but decided to forgo the extra cost. This means the clips are stored on a thumb drive connected to the sync station. The side effect of this is that the clips take longer to load. The angle is a bit narrow but that works fine for me. The app is really pretty easy to use and set up isn’t difficult. The camera quality is good and the images are clear. Mount quality is good as well as simple to install.My biggest pain points with blink cameras: 1- When motion is detected and I want to live access the camera it takes 30+ seconds to load the view and often by then the motion is gone (pet, visitor, things that go bump in the night, etc.). 2 - The clips saved are short and sensors don’t pick up the motion until it’s close so if someone walks through the room it often misses them. I’ve adjusted sensitivity and settings but it hasn’t resolved the problem. 3 - I only use lithium batteries with the system but the battery life is awful. I’ve adjusted settings and it seems to be a trade off - battery life or regular monitoring.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}