{
    "remaining_requests": 38889,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Blink-Wired-Floodlight-Camera-White/dp/B0B5VLCL1N",
    "body": {
        "name": "Blink Wired Floodlight Camera – Smart security camera, 2600 lumens, HD live view, enhanced motion detection, built-in siren, Works with Alexa – 1 camera (White)",
        "price": "$89.99",
        "originalPrice": "$99.99",
        "rawPrice": 89.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Blink-Wired-Floodlight-Camera-White/dp/B0B5VLCL1N",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C7D8CMH7"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B5VGZTXH",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$89.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01YXlrtcRjL._SS36_.jpg"
            },
            {
                "asin": "B0B5VLCL1N",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$89.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01foO5OrR8L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/513P8v7k9 L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31T4IcIpYfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xu5UqIuiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VLtob2AgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yuyVEtyDL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Blink Store",
            "link": "https://www.amazon.com/stores/Blink/page/C5DECBBE-4F56-4C36-B933-E62144578691?ref_=ast_bln"
        },
        "brand": "Blink",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 6248,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 16 hrs 37 mins",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Help protect your home day or night with Blink Wired Floodlight Camera — a smart security camera with 2600 lumens of LED lighting, enhanced motion detection, and a built-in security siren.",
            "See and speak from the Blink app — Experience 1080p HD live view, night view in color, and crisp two-way audio.",
            "Get real-time alerts — Be alerted to movement with dual-zone, customizable motion detection and sound the security siren when needed. Set motion zones in the Blink Home Monitor app so you’re only notified when you need to be.",
            "See who’s there — Experience Blink’s new person detection feature with embedded computer vision (CV) as part of an optional Blink Subscription Plan (sold separately).",
            "Set up yourself — Follow the included instructions and connect to your home's existing outdoor wiring.",
            "Save and share clips — Choose to store events in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with a Sync Module (sold separately).",
            "Works with Alexa — Connect your Wired Floodlight Camera to Alexa to engage live view, arm and disarm your camera, and more using your voice.",
            "Includes one Blink Wired Floodlight Camera and one installation kit."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Field of view",
                "value": "143° diagonal"
            },
            {
                "name": "Camera resolution",
                "value": "1080p HD video"
            },
            {
                "name": "Camera frame rate",
                "value": "Up to 30 fps"
            },
            {
                "name": "Size",
                "value": "178 x 173 x 198mm"
            },
            {
                "name": "Weight",
                "value": "1.13 kilograms"
            },
            {
                "name": "Power",
                "value": "Hardwired. Neutral wire required. 100-240VAC, 50/60Hz, 45W"
            },
            {
                "name": "Wifi connectivity",
                "value": "High-speed internet connection (such as broadband, fiber, or DSL). Wifi network: 2.4 GHz 802.11b/g/n."
            },
            {
                "name": "Installation requirements",
                "value": "Mount to existing 4-inch round, UL listed, weatherproof electrical box on a wall or covered ceiling using included installation kit. Outdoor silicone sealant not included."
            },
            {
                "name": "Sync module compatibility",
                "value": "Camera compatible with all Blink Sync Modules."
            },
            {
                "name": "Available colors",
                "value": "White, Black"
            },
            {
                "name": "Minimum smartphone requirements",
                "value": "iOS 15.0, Android 9.0, or Fire 9.0"
            },
            {
                "name": "Blink app",
                "value": "Blink Home Monitor"
            },
            {
                "name": "Included in the box",
                "value": "1 Blink Wired Floodlight Camera 1 Installation Kit"
            },
            {
                "name": "Audio",
                "value": "Siren and 2-way audio"
            },
            {
                "name": "Lighting",
                "value": "2600 Lumen, 5000°K color temperature LEDs"
            },
            {
                "name": "Siren",
                "value": "105 decibels (level measured at 4 inch/10cm distance)"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty included. Purchase and use of Blink cameras are subject to the terms found here."
            },
            {
                "name": "Support",
                "value": "Click here to view the Blink support page."
            },
            {
                "name": "Generation",
                "value": "1st Generation"
            },
            {
                "name": "Software security updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites."
            },
            {
                "name": "Cloud video storage",
                "value": "To keep videos beyond your trial, subscribe to a Blink Subscription Plan, which allows videos to be stored in the cloud for up to 60 days. See Blink Subscription Plans for more information about your plan’s retention period. To keep important videos beyond this period, download them to your mobile device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. Emerson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEHIY4OXZASPBTLVR2FMCIOQKUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R275371Z8N82MR?ASIN=B0B5VLCL1N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Blink is Good Stuff",
                "reviewText": "So far I have the doorbell, sync module and this flood light. I installed this over an existing flood light setup, so it was pretty easy and the wiring was in place. My previous floodlight was mounted under the eaves, so I had to mount this one as such. The camera and lights are on swivels, so it was easy to manipulate them into place. My setup has the camera above the lights (because of the under-eave mounting), but it still works very well. The picture is great.You have to go in to the app if you want to manually turn on the lights, but you can also set the lights automatically for dusk to dawn. Also, within the app, you can talk back and forth and you can activate a siren on the camera. The lights have a brightness setting and do very well lighting up our driveway and front yard area.The only problem I have with Blink is the 2.4 ghz wireless only. I have a mixed 5/2.4 mesh wi-fi system and I have to go in to the router settings and turn off 5 ghz to connect these devices, and then go back in to the router and turn it back on. My garage door opener is the same way (2.4 only). It just adds more steps to the setup. Some newer routers have a new IoT network option where you can create a 2.4 only for these kind of devices while leaving your main wi-fi broadcast unaffected.We have had good luck with our Blink products. I'm glad this floodlight is wired. Our doorbell is not and we seem to go through the special AA batteries a lot :(",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Hunley Hurst",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWHFOMSNJRT3LHLUZIK55KQKZZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YAV0BLN59H91?ASIN=B0B5VLCL1N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent value",
                "reviewText": "I was quite surprised at how hardy this device is. Definitely well made. I installed three of them on the property and they're easy to setup and use. The lights are very bright but don't wash anything out. The cameras are decent and produce a good picture. I would recommend this device if you aren't wanting to spend a bundle on a great security light with a built in camera. The instructions are well written if you've never installed a hard wired light. Took about 10 to 15 minutes to install and then another 5 to 10 minutes to add them to the blink app.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donald Gross",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3WOFFRSWUDORVGWXRCLK6LY25A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R227OZJST0RN00?ASIN=B0B5VLCL1N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Camera",
                "reviewText": "We have an issue with one of our neighbor. The light for this is so bright and the motion detector works amazing. But the camera is a total Homerun. The clarity and details are superior to others that cost much more Our house is completely covered with the 4 that we have. If you need a security camera and light combo This is the one. I have a friend that paid almost double the price and he shakes his head when he sees how great these work. We also have a blink doorbell. Also bought the Alexa in the package and we know whenever there is anyone near our House. This is the best value and most amazing product on Amazon.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John D. Young",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7B35MQ5APNRMXMFIPDHWG5L6NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EVRXKY4JBYUP?ASIN=B0B5VLCL1N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Great lights and camera",
                "reviewText": "I ordered two of these a couple of weeks ago. They came very promptly and I installed them. The first one was replacing a motion detecting floodlight and installation was very simple. Just took the old light down and put this one up. Once up scanned the code on the front of the manual and added it to my existing Blink system. The second one I put in a new location. I had to run a 120 volt wire and electrical box and then install the camera. Once the electrical work was done, the installation was as easy as the first one. I do like the S hook that comes with the package to hold the light/camera while you connect the wires. Also the package has the bolts, wire nuts, and S hook, everything you need to install. I did have a minor problem and had to call Blink technical support. I got right through to them and they were very helpful and knowledgeable. I highly recommend the Blink system. I now have two doorbells, two wired lights/cameras, and two outdoor cameras. They all work well. When I drive in the driveway at night, the front and side of the house light up. A person cannot get into my house without being recorded. After a couple of weeks I want to add one thing. I had to get a new router and I set the WIFI name and password the same. But the Blink items would not connect without changing the WiFI on the Blink equipment. The wired floodlights have a reset button on the top of the camera. It has to be held for a few seconds to put the camera in the proper mode for resetting the WIFI. This is just STUPID. These cameras are made to be installed on the outside of houses up on walls. One my cameras requires a 24 ft extension to get to it to push the reset button. The engineers who designed the camera should have thought of this. So I still think these are great items, but just realize that if you need to change your WIFI you are going to be climbing up on a ladder to change the WIFI on these wired floodlight cameras.I just lowered the rating to 3. First after getting a new router I had difficulty connecting the 2 wired flood lights to it. On about the third call to support I learned for the first time that the Blink products only support 2.4 GHz wifi. This is a brand new product and I just can't imagine why they would design a product like this in 2022. I think it is a real design deficiency. Second, I normally have my iPhone on the 5 GHz wifi and I also just learned that in order to configure the blink products you have to be on the 2.4 GHz wifi. I wish I would have known this when I first got my units. It would have saved me a lot of time and frustration. I had to climb the 24 ft extension ladder again today to get one of the wired floodlights working.So I think these are good products with limitations. I think the biggest one is that the only way to connect to a different wifi or to reconnect if the connection is lost is to push the reset button. And since a lot of these will be mounted high on an outside wall, that will mean climbing a ladder.I just lowered my rating to one. They send me a replacement wired floodlight camera because the one would not work. I installed the new one and it still would not work. I called technical support and was on the phone over an hour with them. The conclusion was that I could not set the cameras to \"Best\" video mode, I had to reduce the resolution. So when I hung up it was working. That was at 8:47 p.m. AT 9:02 p.m it quit working. So the bottom line is that these wired floodlight cameras are just not reliable. In addition I bought them to get the best video I can because if someone is breaking into my house, I want the police to be able to identify them. If it can't produce quality video, then it is not worth having. At this time I suggest that everyone avoid these cameras. It may be that Blink will be able to fix the issues, but at this time the cameras are unreliable.A month or so ago Blink provided new firmware for my two wired floodlight camera's. Since getting the new firmware the camera's and floodlights have been working fine. They are working so good that I bought a third one and it is working fine. I now have two Blink doorbells, two wireless outdoor cams, and three wired floodlight cameras. I also have a sync module 2 which is required for the two wireless outdoor cams. Right now I am totally satisfied with these cameras. Also the last couple of times I called Blink I got good servcice. The tech people were knowledgeable and able to solve my problems. If it were not for all the initial problems I encountered and the lack of the ability of the tech people to solve those early problems, I would give this a five star rating.",
                "reviewVotes": "288 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Galina Strizheva",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTROT2M46S2D2LYNWRKRQ5LWQVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYHMD2B4A1J7B?ASIN=B0B5VLCL1N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy to install as a replacement of the old flood light, best performance among Blink cameras",
                "reviewText": "This is one of my 5 Blink camera options and it works the best. I also have a doorbell and three outdoor wireless cameras, but the picture quality from this flood camera is the best among all of them. It also connects to my network better than other cameras and, being wired, does not necessarily require a sync module, which sometimes has problems on its own.It detects motion extremely well - now I have a collection of night videos with rabbits who stall once the light turns on in response to the motion and then slowly escape. Fun to watch and good to know that if it were an intruder, it would be a) caught on the camera and b) likely not proceed with his dark plans into my property due to the nice illumination the camera gives to my property.Daytime pictures also feel of better quality than any of the other Blink cameras I have - colors are vivid, no fish eye, and resolution allows us to see details such as single grass stems, leaves on the bushes, or rabbit eyes.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}