{
    "remaining_requests": 30309,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Delta-Children-Canton-Convertible-Espresso/dp/B0031KMAJK",
    "body": {
        "name": "Delta Children Canton 4-in-1 Convertible Crib - Easy to Assemble, Espresso Cherry",
        "price": "$207.12",
        "originalPrice": "$279.99",
        "rawPrice": 207.12,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Delta-Children-Canton-Convertible-Espresso/dp/B0031KMAJK",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CT4H94D9"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Bianca White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21jMRcuYgOL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21EIOVOje6L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Dark Chocolate",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/3101rmB5GhL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Ebony Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21htFv3QFFL._SS36_.jpg"
            },
            {
                "asin": "B0031KMAJK",
                "variationName": "Color",
                "variationValue": "Espresso Cherry",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/316Hx86Zx4L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21nCuklQInL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Op6LLGwJL._AC_SX466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Delta Children Store",
            "link": "https://www.amazon.com/stores/DeltaChildren/page/D1A6D986-9B00-46FE-9A7B-3DCA1B3BAA9A?ref_=ast_bln"
        },
        "brand": "DeltaChildren",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1421,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 1 hr 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "CONVERTIBLE CRIB: Converts from a crib to a toddler bed, daybed and full size bed with headboard and footboard (Daybed Rail and Toddler Guardrail included; Full Size Bed Rails #0020 sold separately)",
            "GROWS WITH BABY: The 3 position mattress height adjustment on this crib allows you to lower the mattress as your baby begins to sit or stand.Care & Cleaning: Spot or Wipe Clean",
            "BUILT TO LAST: Strong and sturdy wood construction helps create a dream nursery where you’ll spend plenty of Mommy and Me/Daddy and Me time | Easy assembly",
            "WE PUT YOUR BABY’S SAFETY FIRST: This crib is JPMA certified to meet or exceed all safety standards set by the CPSC & ASTM | Tested for lead and other toxic elements to meet or exceed government and ASTM safety standards",
            "SIZE: 54.25\" W x 43.25\" H x 35.25\" D",
            "Fits standard size crib mattress (sold separately)"
        ],
        "description": "Product Description Truly timeless, the Canton 4-in-1 Crib from Delta Children is embellished with a sleek, sleigh-style headboard, beautifully curved legs, plus a versatile design that converts from a multi-positional crib to a toddler bed, daybed and full size bed. Creating a warm and welcoming space, it's not only aesthetically pleasing, it's extremely safe-JPMA certified, it has gone though rigorous testing to ensure your baby's safety for years to come. From the Manufacturer The Canton Crib is the ultimate in both style and functionality when it comes to cribs. With it's gorgeous finish and impeccable design, its sure to become a focal point in your home for years to come. This beautiful crib converts easily to a toddler bed, day bed and full size bed with headboard so its not only stylish it's functional and economic. The crib features a 3 position mattress support so your little one sleeps in ultimate comfort and is built of solid hardwoods with a non-drop side design for the ultimate in safety. This crib is JPMA/ASTM certified and contains no lead. Some assembly is required (tools included). Matches perfectly with the Canton Dresser in Espresso (sold separately online).",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Nursery",
                "link": "https://www.amazon.com/baby-nursery-bedding-cribs-furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=695338011"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/baby-furniture-crib-playpen-cosleeper-bassinet/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166809011"
            },
            {
                "name": "Infant & Toddler Beds",
                "link": "https://www.amazon.com/Cribs-Furniture/b/ref=dp_bc_aui_C_4?ie=UTF8&node=166812011"
            },
            {
                "name": "Cribs",
                "link": "https://www.amazon.com/Baby-Cribs/b/ref=dp_bc_aui_C_5?ie=UTF8&node=166815011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Espresso Cherry"
            },
            {
                "name": "Brand",
                "value": "Delta Children"
            },
            {
                "name": "Target Audience",
                "value": "Unisex-Babies"
            },
            {
                "name": "Product Dimensions",
                "value": "35.25\"L x 54.25\"W x 43.25\"H"
            },
            {
                "name": "Special Feature",
                "value": "covertible, Convertible"
            },
            {
                "name": "Material",
                "value": "Wood"
            },
            {
                "name": "Furniture Finish",
                "value": "Black"
            },
            {
                "name": "Style",
                "value": "Classic"
            },
            {
                "name": "Included Components",
                "value": "Instruction Manual, Hardware Bag, Headboard, Footboard, Back Rail, Front Rail, Mattress Support"
            },
            {
                "name": "Item Weight",
                "value": "57.9 pounds"
            },
            {
                "name": "Assembly Required",
                "value": "No"
            },
            {
                "name": "Product Care Instructions",
                "value": "Wipe with Damp Cloth"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "35 Pounds"
            },
            {
                "name": "Maximum Height Recommendation",
                "value": "35.25 Inches"
            },
            {
                "name": "Department",
                "value": "baby-girls"
            },
            {
                "name": "Manufacturer",
                "value": "Delta Children's"
            },
            {
                "name": "ASIN",
                "value": "B0031KMAJK"
            },
            {
                "name": "Country of Origin",
                "value": "Taiwan"
            },
            {
                "name": "Item model number",
                "value": "7888-205"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,421 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,460 in Baby (See Top 100 in Baby) #46 in Baby Cribs"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Warranty Description",
                "value": "1 year parts only."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Import",
                "value": "Made in USA or Imported"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Simmons Kids by The Bed City Sleeper Bassinet, Grey Tweed Delta Children 7-Piece Essential Changing Table Set Delta Children Gavin Nursery Glider Swivel Recliner Delta Children Canton 6 Drawer Dresser with Interlocking Drawers Revolve Reversible Stroller And Carriage/Pram Add-On Bundle Beautyrest Beginnings Sleepy Whispers Ultra Deluxe Crib and Toddler Mattress Shop Coordinating Items (sold separately) Keep your newborn close with the Simmons Kids By the Bed City Sleeper Bassinet. Create a cozy and organized place for your baby during diaper changes with this 7-Piece Essential Changing Table Set by Delta Children. Retreat to the supreme comfort of this stylish glider chair as you relax with your little one. Available in complementary finishes. A nursery must-have, the simply styled Universal 6 Drawer Dresser with Interlocking Drawers by Delta Children is crafted to coordinate with all the brand's cribs The ultimate stroller and carriage bundle allows the Revolve Stroller to effortlessly grow with your little one The Simmons Kids Beautyrest Beginnings Ultra Deluxe 2 in1 Crib and Toddler Mattress is a mattress that grows with your child, providing restful sleep for infants and toddlers.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/9066001b-e487-4770-97af-ba5bb9a124e9.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2b12414c-ea7f-4d2d-b752-2442488c2180.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9e9a0810-6893-491b-8855-119522f4afa9.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5df0c67b-13ee-45c4-ba18-2225c50eabd0.__CR0,0,2021,625_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca3beaf4-fc74-4366-97f8-c6e444195551.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4cf6a5a-a82c-496e-ab63-662c895b63bd.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6531fafd-7cf7-4cd9-bb73-91d58c7b3b6f._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d41ac713-d2a7-40fd-914b-ddc6d18e0dcc.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/acf77cd3-bf67-45cf-8241-0e0edf0c54c4.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/193c2e10-19b0-4625-a155-a39920c4c807.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Diana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEIXWQVYO322QGI3W2CAAJUQSXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UXOJBS08DESC?ASIN=B0031KMAJK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 3, 2014",
                "reviewTitle": "5.0 out of 5 stars Sturdy and beautiful",
                "reviewText": "This is a great crib. It's sturdy real wood that's stained, so no chipping laminate, and you can re-stain if it gets damaged. It was pretty easy to put together, if you follow the instructions. In particular, pay attention to the pins. They're small in the pictures and easy to miss, but they make life so much easier, by holding the rails in place while you align them and screw them in place! I didn't really notice a smell coming from the crib, just the smell of plastic and packaging, which went away after I threw out the packaging and opened a window for a bit. I love all the curves on this crib, and the smooth finish. It's beautiful! I also love the 4-in-1 setup, which will hopefully last crib to college! The espresso cherry finish is elegant enough to fit an adolescent just as well as a baby, unlike the white, which looks more like nursery furniture and may be outgrown at some point.The mattress support has 3 positions, which is useful for the different ages. Now that cribs don't have drop sides anymore, even the highest position of the mattress (which is still pretty low) is a bit hard to reach if you're pregnant with an Irish twin and trying to bend over the rail to pick up the first baby (and you don't have long arms). Especially because the top edge of the front side curves out a little and adds extra distance. But that's just how it is with these cribs.The sides of the crib curve up a little, which looks nice, but this way the width of that top horizontal bar is different along the length of it, and some mobiles will not fit along the wider parts. I didn't think to ask for the width of it beforehand and check with the mobile I was getting, so now it only fits towards the front, not really in the middle… but whatever, it's not too bad. Something to keep in mind though.People have mentioned that the screws have no covers. That is true, probably for safety reasons, but they are set so deep that it's really not noticeable. The screws themselves and the inside of the holes match the color of the crib, so they don't stand out. I really don't mind it at all.The only thing I didn't like is how the crib was packaged. There was no padding along the large sides of the box, and it seems that something sharp and heavy fell on it during transport, and tore a big hole in it. The wood in that spot was crushed. Lucky it was on the back side facing the wall, so you can't see. After having read about how difficult it is to return this (no spare parts, you have to return the whole thing), I'm glad the crushed part isn't visible, otherwise it would've been a major pain to re-pack and return such a large item, and wait for a replacement. If your box looks crushed, open it carefully so it would be easier to re-package and return if you have to.UPDATE: My daughter is 3.5 years old now and she still sleeps in this crib. I don't trust her loose at night, so I haven't removed the rails, and she plays along and doesn't try to climb out (after doing it and falling once, she decided it's not worth the risk, ha!) The crib still fits her with lots of room to grow! She loves her bed. I'm so glad I don't have to go through the drama of moving her to a toddler bed. She can stay in this crib until she starts grade school!When her brother was born, I got a second crib just like hers, so now they have matching cribs. He's 20 months old now and both cribs are holding up great. No problems whatsoever. Highly recommend!P.S. I see some people are having issues finding a mattress for this crib. I got the \"Safety 1st Heavenly Dreams White Crib Mattress\" for both of our cribs, and it fits perfectly! No gap whatsoever - it's really snug, you have to push it down in place, that's how tightly it fits. Perfect fit. The first mattress is 3.5 years old now and holding up great.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nikki M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTLLGHUC56MJK4QPDC44CADACHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14FOIYLR11MV2?ASIN=B0031KMAJK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2016",
                "reviewTitle": "5.0 out of 5 stars Very good value for the price. Durable crib with just a few minor drawbacks.",
                "reviewText": "This crib is really great - especially for the price. As any new parent is probably aware, cribs at the big box store can be VERY expensive (usually between 400-600 dollars). I did a lot of looking around at different cribs online and at brick and mortar stores before settling on this Delta crib. I actually got this one along with the dresser for less than the price I would have paid in the store for just the crib. It is worth noting that this crib is very sturdy, and was pretty comparable with the higher priced cribs. I also really like that this crib can be changed into a toddler bed and then a bed (it remains to be seen if it will last this long or not, however). As some of the other reviewers noted, the screw heads are not covered (I mean really, how much would it cost to throw a few caps in so you wouldn't see them). However, the screws are a dark color to match the crib, so you really don't notice them. You could go to your local hardware store to get some caps if this does bother you. Also, some reviewers noted that the wood is \"really soft\", but this has not been my experience. I really feel that this is a great value for the price.PROS:*#1, hands down is the value for the price - I looked all over and couldn't find a better deal*Finish (espresso cherry) is very attractive, I have had many compliments on it*Easy to assemble - my husband and I were able to set this up in under an hour*Convertible to toddler bed/crib*Numerous height settings - you can adjust how high the mattress is as your baby grows*Weight - this crib is relatively light, which some people might think is a con, but I can easily move it around the room and clean underneath it (something that happens more than you'll imagine with a baby!)CONS:*Screw heads are exposed - however, it is worth noting that they are sunk and not really obvious because they are dark colored like the crib*Stickers can be hard to remove - like most companies they put caution and labeling stickers on the crib which are near impossible to take off without leaving residue. Can't they put stickers on that can be easily removed????All in all, I would recommend this crib to a friend/fellow mommy and I will be getting another one when/if I have another child.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LRMD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4XPFCMTGVIUIMAEJL7RNLWOFSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VA3G2NHKJUTW?ASIN=B0031KMAJK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2022",
                "reviewTitle": "5.0 out of 5 stars High quality crib with solid let relatively light weight materials",
                "reviewText": "Very easy to assemble. Pieces are made from real wood with a beautiful stain. Stain reminds me of a sunburst Les Paul (google it). I ordered the cherry variant. I was worried it would be too red but it came in a beautiful dark brown with a shimmering cherry gold undertone depending on how light hits it. All holes were in the right places and directions were easy to understand and appear to be written by an actual human being with english as his first language. High quality at this price point. Couldn't ask for anything else more. At this point, if you spent any more, you would only be paying for increased weight. If you like heavy cribs that may take more than two people to move, spend more money. If not this is the perfect choice. Would buy again. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PamB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG366DHDUXDZWWHN34LAE63FFXYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y9LLBK2QZOE0?ASIN=B0031KMAJK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Going on 8 years old",
                "reviewText": "This crib is still going strong and still looks new after going through 3 wild boys, we currently have it in the toddler bed position but it's easy to put convert back into a crib. Great value for the money and very sturdy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 6, 2019",
                "reviewTitle": "Está increíble, muy elegante y fácil de armar",
                "reviewText": "Está increíble, muy elegante y fácil de armar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}