{
    "remaining_requests": 30275,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lotus-Travel-Crib-Lightweight-Comfortable/dp/B00AKKDSNG",
    "body": {
        "name": "Guava Lotus Travel Crib with Lightweight Backpack Design | Certified Baby Safe Portable Crib | Folding Play Yard with Comfy Mattress for Babies & Toddlers | Compact Baby Travel Bed",
        "price": "$229.95",
        "originalPrice": "$279.95",
        "rawPrice": 229.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lotus-Travel-Crib-Lightweight-Comfortable/dp/B00AKKDSNG",
        "soldBy": {
            "sellerID": "A3HVSGN6IU8F4H",
            "name": "Guava Family",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3HVSGN6IU8F4H&asin=B00AKKDSNG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51nqUmC7OaL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Ofq1MO bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51o3Go5Ww9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51O6dBlk5wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DkZ6XMO9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519ogBq-qVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61aVuH4-v6L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Guava Family Store",
            "link": "https://www.amazon.com/stores/Guava/page/C1FE9251-9005-4929-8EF5-F155B8C3CF40?ref_=ast_bln"
        },
        "brand": "Guava",
        "merchantInfo": "Guava Family",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2511,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Tomorrow, February 15. Order within 10 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【CERTIFIED SAFE & LOW-VOC】It’s surprising, but some baby products, including play yards, still contain harsh chemicals. That didn’t fly with our team, so we had the Lotus tested, and certified, GreenGuard Gold – one of the only portable play yards to do so. What does that mean? No PVC, lead, formaldehyde, mercury, arsenic, phthalates, or other dangerous chemicals. Whether resting or playing, the Lotus truly creates a safe and comfortable environment for your little one",
            "【WORRY-FREE AIRPORT TRAVEL】3D Z-Fold Technology allows it to fold compact enough to carry through airports, making the Lotus Travel Crib a baby travel essential. The durable yet lightweight design weighs only 15 lbs and can be set up in just 15 seconds! The foldable crib’s ability to be carried as a lightweight backpack allows you to travel hands-free with ease.",
            "【BUILD A BETTER BOND】Quietly and easily unzip the lockable side door to help your baby fall asleep or turn the portable crib into a play yard. With the door open, you can nurse or cuddle your little one to help them feel safe and secure in a new place and foster an even stronger connection. The updated insulated mattress has a thick, soft foam approved for overnight sleep (ages 0-3) making it a safe and comfortable environment for both resting and playing.",
            "【LASTING COMFORT AND CONVENIENCE】The Lotus Crib portable playard is made with high-quality aluminum and non-slip rubberized feet, making it travel-ready and easy to assemble. It’s perfect for parents on-the-go who need a reliable and convenient portable travel crib. Plus, our portable toddler bed features a full-height ClearView mesh design for better visibility & airflow.",
            "【WHAT’S INCLUDED】You get a complete travel crib with a portable crib mattress and a compact, airport-friendly backpack carrying case. This portable baby bed includes a removable, washable fabric and mesh cover for easy cleaning and maintenance – all backed by a two-year warranty and excellent customer service. Note that sheets are not included, but are also available in quilted and cotton form on Amazon!"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Nursery",
                "link": "https://www.amazon.com/baby-nursery-bedding-cribs-furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=695338011"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/baby-furniture-crib-playpen-cosleeper-bassinet/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166809011"
            },
            {
                "name": "Playards",
                "link": "https://www.amazon.com/Playards-Gear/b/ref=dp_bc_aui_C_4?ie=UTF8&node=166841011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "45.5 x 31.5 x 25.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "15 Pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Guava Family"
            },
            {
                "name": "ASIN",
                "value": "B00AKKDSNG"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 2,511 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,460 in Baby (See Top 100 in Baby) #21 in Baby Playards"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "December 7, 2012"
            },
            {
                "name": "Brand",
                "value": "Guava Family"
            },
            {
                "name": "Color",
                "value": "Grey, Black, White"
            },
            {
                "name": "Material",
                "value": "Aluminum"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "45.5 x 31.5 x 25.5 inches"
            },
            {
                "name": "Floor Area",
                "value": "9246.75 Square Centimeters"
            },
            {
                "name": "Age Range (Description)",
                "value": "Infant"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "15 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1fa375a5-e2a8-40a4-ad12-2357f4b85d48.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4933d9e-1920-4bc3-9056-c87733546d13.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9202f1f4-4072-4290-8083-1066476f577d.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bbdd12fc-5bb7-4945-8884-b8104180c7af.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bfcd89cf-614e-4ac1-a59b-0a6a6879984b.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d7d44782-1151-413c-8f8a-ee2a6cb9e222.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Frequent Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWICO7S6CSLJETX6O4DTDQIWUGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6Q3N684YROKN?ASIN=B00AKKDSNG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2013",
                "reviewTitle": "5.0 out of 5 stars SAFER than some other travel cribs, carry-on size case, going strong w/ second child (3 yrs later)",
                "reviewText": "(2013 and 2016 Updates at end)Really love this Lotus Crib. Here's why:Ease of use & portability:It's lightweight and very portable. Much lighter than our pack 'n' play. Setup takes me less than 1 minute (plus another 1-2 minutes to close all the velcro tabs) and requires no tools. Putting it all back into the case takes me about 2-3 minutes. It will probably go faster when I become accustomed to doing it.When it's set up, the shape and size are longer and narrower than our Chicco Lullaby LX play yard, and it's not as tall. It does not have wheels but it is very lightweight and easy to pick up and place elsewhere. Having it longer but narrower than a regular play yard means that it will fit a taller/longer baby until a later age (especially as there is no weight limit, unlike our play yard which has a 15 pound limit in the bassinet and 30 pound limit in the play yard). The narrower design and light weight also make this easy to move from room to room within the house, as it fits through doorways and is light and easy to carry (obviously take the baby out first). The narrower footprint also means that it's easier to find a place to set it up in a hotel room. (tip: When closing the crib to fold it up, the instructions tell you to press a button on each side of the top rail, that you can feel underneath the gray fabric. I think I was expecting something more round and sticking out, so it took me a minute to figure out what I was supposed to do, and I unzipped the gray fabric from the top rail to take a peak at the structure inside and look for the button I was intended to press. It was shaped more squarish and instead of being pushed in from the outside of the top rail as I had expected, you put your fingers under it and pulled up (towards the sky) on the button. Very simple and easy once you know what to expect.)The travel case is about the size of a roll-aboard carry-on suitcase but both narrower and deeper, less wide (more squared base, less flat). there are straps to tote as a big tote bag, and in the back is a zipper compartment in which are stored backpack straps that turn the case into a backpack. It's rather long for a backpack but that does free up a set of arms for carrying other luggage or baby, or pushing a stroller. My husband (6ft tall) could more comfortably wear it as such than I could (5'5\" tall).Safety/practicality:We had planned on using our pack 'n' play (Chicco Lullaby LX) as our normal bassinet and as a travel crib/bassinet. But then our little one came along and he's very big for his age. He quickly outgrew the 15 pound weight limit on the bassinet feature of the Chicco Lullaby before he was 2 even months old, but he was still too young to have him sleep in the pack 'n' play on its lowest setting (play yard instead of bassinet) because he could not yet lift his head up and the lowest setting of the play yard had a fabric border along the bottom of the mesh sides, which would be a suffocation hazard for such a young infant. And the way he can gradually scoot himself around the crib by kicking his legs out, I didn't want to take the risk that he'd wedge his face against the fabric. So using the Chicco play yard as a travel crib wasn't going to work while our baby was still just a few months old. We transitioned him to sleeping in a traditional crib at night at home, but still needed a travel option. We don't want to rely on hotel cribs, as they are often outdated (pre-recall) or may end up being a regular pack 'n' play which is not safe for our baby to sleep in at his current young age and heavy weight. We looked at basically every other travel crib available on Amazon and in the big box stores and found that the Guava Family travel cribs (Go Crib and Lotus Crib) are the only ones that are very high quality and sturdy, ultra portable, and most importantly, do not have any fabric border at what would be nose-level for our infant who does not yet have the ability to lift his head. It's disturbing to me to see how many travel cribs out there don't warn parents of younger infants not to use them. (*see update below on new competitor model)Also a nice safety feature is that the fitted sheet (we have the plain regular sheet not the quilted, since the quilted is not recommended for babies under 1 year old), has slots the edges. The velcro tabs on the mat connect from the mat through the slots on the sheet, and then to the bottom of the crib floor. This secures the mat and the sheet so baby can't grab it and pull it over his face.I also like that this travel crib will still be suitable for our baby as he grows into a toddler. Once he's older (over a year is the recommendation, but it depends on when he can lift his head), we'll use the quilted sheet to add a little more softness, and maybe insert one of our waterproof pads (from another company) under the sheet (the mat is already water resistant, but this would be just to add another layer).Sturdiness:The top rail of the crib (looks like gray fabric border around the top edge) is completely rigid and sturdy when set up. The legs are metal and fold upon themselves where you see the round joint in the leg. The mat and bottom of the crib rest on the floor, so there is no weight limit. This is a plus if you are like us and need a travel crib safe enough for a newborn but able to support a very heavy young infant who weighs over 20 pounds at just 3 months (or if you have an older tot who needs a travel play yard but will outgrow the 30 pound weight limit on the traditional play yard. The sides of the Lotus Crib are black mesh fabric. The floor seems to be a black nylon or other synthetic. The mattress is also a synthetic that seems easy to clean by wiping it off, in case of any accidents or diaper blow-outs. The mattress does not have a wood support under it like our Chicco, but that's not necessary here since the mattress is laying on the crib floor which is directly flat on the floor of the room. The Lotus Crib mattress has velcro tabs to hold it down onto the crib floor. The ends of the mattress turn up a bit even so, but the baby's weight pushes it flat.We pushed on the top rail ourselves to simulate an older tot pushing on it and found it remained stable. The top rail is rigid and the legs are also rigid and are set at a slight angle so the tops of the legs lean in towards the crib, so the base on the floor is wider and very stable.Other aspects:The mattress is thin, as noted by other reviewers. This is a legal requirement to prevent a suffocation hazard for infants in case they turn over and end up face down on the mattress.The shape seems a bit longer and narrower than our Chicco play yard, but in theory we could use a regular fitted play yard sheet on the Lotus Crib, but I wouldn't. I think it's safer to use the sheets sold by Guava Family specifically for this crib, because they have slots in them as noted above, for the velcro tabs to hold them down. This is not necessary for a regular play yard as the wooden subfloor of the crib or bassinet would hold the mattress down and the mattress edges would hold the fitted sheet edges down. With the Lotus Crib, the velcro serves this purpose, so you really need the open slots in the sheets to put the velcro tabs through.Also, the company is super responsive and excellent to deal with. I wouldn't hesitate to order from them again. You really get the friendly and attentive service of a small company.UPDATE May 2013: Since the time of my original review, phil&teds Traveller Crib has had a re-design and the new version looks similar to the Lotus crib, with mesh all the way down to the mat. I haven't tried it since I'm happily still using the Lotus but just wanted to mention in all fairness there's another all mesh-sided travel crib to consider in your due diligence.UPDATE May 2016: I noticed that Baby Bjorn has had a redesign and now the mesh goes all the way to the mat, similarly to Lotus Crib, if you're looking for a comparison. BB seems a little easier to get the sheet on due to the location of the straps. However, if I had to choose again I would still choose the Lotus Crib, because it's easier for traveling, in my opinion, and traveling is our primary use of it. The size and shape of the Lotus Crib carrying case mean that we can take it as a carry-on and not have to check it as a separate piece of luggage. (It also fits perfectly within a large suitcase leaving room for other things in there too). The Baby Bjorn travel case seems nice and a little sturdier but could be a problem if you try to use it as a carry-on luggage item, due to airline size restrictions. Overall they're both good choices but it depends on what your specific needs are. I would also like to note that the Lotus Crib is going strong for baby #2 now as a travel crib and an extra playpen around the house, and is also useful when we have visiting babies. Instead of buying the plush quilted sheet, when we are traveling if it will go on a wood floor I put a folded bath towel or blanket under it (wouldn't do that with an infant under 1 year old though).",
                "reviewVotes": "351 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patrick Lyon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXYCADDV7CTQKKLB6GZNMBT3A7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13BGGHLCG3TGZ?ASIN=B00AKKDSNG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 15, 2019",
                "reviewTitle": "5.0 out of 5 stars Used it to Transition from Cosleeping - And it Worked!",
                "reviewText": "The quick review: We use this travel crib as our daughter's main sleeping space, and it works great. She is 9 months old, and we transitioned her from cosleeping to this crib with minimal effort. If you are looking to transition from cosleeping (or like the idea but do not want/cannot have baby in your bed) this is the answer.The long review: My 9 month old was cosleeping with us, but she started trying to crawl out of the bed at night. We did not want to get rails because we were afraid she would get trapped in them, but she is too young to transition to a toddler bed. We have tried other play yards, but she would always wake up when we lowered her into them and then refuse to go back to sleep because no one was cuddling her. Our apartment is too small for a full sized crib, but I imagine we would have run into similar problems.The Guava Travel Crib was the solution we needed. After researching several similar travel cribs (ones that rest on the floor and have a side opening so you can snuggle baby to sleep), we decided on the Guava because it seemed incredibly sturdy and well-made. If we were going to use it every day, we wanted to make sure it would hold up. We were also impressed by other buyers' positive experiences with the company regarding replacement parts, etc. The Guava Family even answered several of the buyer questions, which we found helpful and professional.Pros:* It is small- the full sized crib is about 2 feet wide and 3.5 feet long. Our daughter is tall for her age, but she had enough room to sleep. It also does not take up much floor space, making it perfect for tiny apartments, small master bedrooms (for rooming-in babies), and travel destinations.* The side flap - This is great for so many reasons. If you are pregnant or have a bad back, it is easy to get baby in and out of the crib. If you are using the crib for travel, you can also use it as a play area at your home. Your child can use it like a fort. I like it personally because I can lay fully in the bed to snuggle or nurse baby. If you are a regular sized adult (I am only 5 ft tall), you can lay partially in the crib to snuggle with baby.* It rests on the floor - This goes along with the side flap. There is no weight limit, so you can lay in there with baby, or several children can play in it as a fort.* It is easy to set up - I am mechanically challenged, and I set this up in about 2 minutes with no problems.* It is lightweight - It is easy to move it from one room to another or take it with you on a trip.* It is well made - This was important since we planned to use the crib every day. The mesh is sturdy, and the design makes it virtually tip proof (my 5 year old niece even tested this).Some other reviews thought the zipper was noisy. It is a zipper... it's not particularly loud or particularly quiet. We have a white noise machine in baby's sleeping area, so it masks the sound pretty well if I zip it up when she is sleeping. I also did not find the mattress difficult to secure at all (that factored into the 2 minute set up time), but I do have small hands.The mattress is not \"too hard.\" It is actually much softer than other play yard mattresses. There are also strict safety standards that require baby mattresses to be firm to protect from SIDS. I fell asleep on it and thought it was fine. We have it down on the hardwood floor and there is no problem with it being uncomfortable.You do need to invest in the sheets, and this is the closest thing to a con that I can mention about this crib. We used a towel tucked under the mattress for the first few nights since we had ordered them separately from the crib. I would not recommend doing that with a younger baby as it is not in safe sleeping guidelines, but it was okay as a temporary solution for our older baby.Overall: This crib has been a life-saver as we transitioned our baby from cosleeping, and it might be the best investment in baby gear that we have ever made (on par only with our baby carrier). I will recommend this crib to anyone who will listen, and I think I will start out my future children on this crib from day 1. Thank you Guava Family!",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 6, 2024",
                "reviewTitle": "Product is excellent",
                "reviewText": "The material excellent",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorena",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 24, 2019",
                "reviewTitle": "Super compacta!",
                "reviewText": "Me encanta! Es súper compacta y justo lo que necesito para los viajes!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$249.00",
                "sellerName": "Guava Family",
                "sellerRating": "5"
            }
        ]
    }
}