{
    "remaining_requests": 23651,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Thai-Deodorant-Stone-Crystal-4-25/dp/B0716TPR7N",
    "body": {
        "name": "Thai Deodorant Stone Crystal Deodorant Stone Liquid - 4.25 oz",
        "price": "$6.99$6.99 ($1.64$1.64 / Ounce) $6.64$6.64 ($1.56$1.56 / Ounce)",
        "originalPrice": "$8.19",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Thai-Deodorant-Stone-Crystal-4-25/dp/B0716TPR7N",
        "soldBy": {
            "sellerID": "AMFY5WR9TF0D2",
            "name": "Beyond The Shop",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AMFY5WR9TF0D2&asin=B0716TPR7N&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41KOLzBTGcL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ff0e7COHL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Stone deodorant",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Stone+deodorant"
        },
        "brand": "Stone deodorant",
        "merchantInfo": "Beyond The Shop",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2810,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Compact by Design (Certified by Amazon) products remove excess air and water, which reduces the carbon footprint of shipping and packaging."
        },
        "features": [
            "The Thai Crystal Deodorant Stone is a 100% natural deodorant that will keep you as fresh as the ocean breeze without sacrificing your health.",
            "It is great for people with allergies, sensitive skin or those who are seeking a great alternative to commercial antiperspirants and deodorants.",
            "The Thai Deodorant Stone is made from natural minerals and it is completely free of harmful chemicals, propellants, fragrances, oils or alcohol.",
            "The Crystal Deodorant Stone may be the most effective and economical deodorant that you will ever use.",
            "One Crystal Deodorant Stone used daily by one person can last up to one year. Try it in your feet too - it works miracles!"
        ],
        "description": "Thai Crystal Deodorant Stone is a 100% natural deodorant that will keep you as fresh as the ocean breeze without sacrificing your health. It is great for people with allergies, sensitive skin or those who are seeking a great alternative to commercial antiperspirants and deodorants. NO aluminum chlorohydrate 24 hour protection Also works great for foot odor! Fragrance free Kills bacteria Non-staining Paraben-free NO animal testing or animal by-products Hypoallergenic The Thai Deodorant Stone is made from natural minerals and it is completely free of harmful chemicals, propellants, fragrances, oils or alcohol. The deodorant stone does not clog pores and does not cover up odors with a perfume. When applied it leaves a tiny layer of mineral salts on the skin that cannot be felt or seen, the stones combination of mineral salts has the unique ability to prevent bacteria from growing.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Personal Care",
                "link": "https://www.amazon.com/Personal-Care-Products-Health/b?ie=UTF8&node=3777891"
            },
            {
                "name": "Deodorants & Antiperspirants",
                "link": "https://www.amazon.com/Deodorants-Antiperspirants/b?ie=UTF8&node=3778451"
            },
            {
                "name": "Deodorant",
                "link": "https://www.amazon.com/Deodorants/b?ie=UTF8&node=702371011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 3.27 x 1.69 x 1.57 inches; 4.97 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ SG_B0716TPR7N_US"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Deodorant Stones, LLC"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0716TPR7N"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#17,176 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #233 in Deodorant #751 in Climate Pledge Friendly: Beauty"
            },
            {
                "name": "#751 in Climate Pledge Friendly",
                "value": "Beauty"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,810 ratings"
            },
            {
                "name": "Brand",
                "value": "Stone deodorant"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            },
            {
                "name": "Material Feature",
                "value": "Fragrance Free"
            },
            {
                "name": "Unit Count",
                "value": "4.25 Ounce"
            },
            {
                "name": "Item Volume",
                "value": "4.25 Fluid Ounces"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Thomas C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJVBT26GRCLN3KZYASYFZI3QEUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PGHODMC6IMCN?ASIN=B0716TPR7N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars It's actually the best deoderant I have EVER used and literally lasts 1.5-2 years. INCREDIBLE!",
                "reviewText": "Ok, so I am not the type of guy to typically be aligned with any deoderant brand. Before buying this one, I tried any man's deoderant that smelled good...then decided to start buying ones good for 24hrs...then 48hrs and then decided I would only buy aluminum free deoderants out of health and safety concerns. My wife bought one of these crystal deoderants for her mother and shipped it to Brazil but kept one for herself. I tried it and...no kidding...it worked better than any stick deoderant I had ever bought. I had her order me one and it literally has no scent to it but better than that, it completely wipes out any underarm odor. Like...totally! OK so if it lasted 2 weeks, I'd still buy it because it's so effective but this thing literally will lasy you 1.5 to 2 years (assuming you use it once a day...everyday). It is literally a crystal material that does round over and wear down ever so slightly but leaves absolutely no residue under your arm. If there is ever anysuch thing as magic, this is it. And I'm a guy who sweats a lot, works outside in the heat in the Southern US and I can smell...I promise you. If I'm going to endorse it, you'd better believe it works incredibly well.OK, so for those of you who buy it based on this (and any other) comments, here are 2 hacks you need to know. You will run a little water over the end of it before applying it under your arms. ALWAYS store it so the lid/cap side is down. This ensures that any residual water runs away from where the crystal is secured in the base. If you don't do this, the crystal can ultimately wear down and become loose or dislodged from the base. It's really that simple and takes no effort at all. if you're traveling, no biggie.. just go back to doing it when you get settled or back home. You'll thank me in the long run. The second hack is to use a little super glue around the crystal where it's secured in the base and it will hold it back in place perfectly. I had to do this to my wife's before teaching her to store it upside down. Her's has never come dislodged since then and mine has never either.That's all folks. Go get yourself one and you will never go back to using old traditional deoderants ever again!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christifidelis.com",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJO66VNSDKE6SLR5BWXQN52R3ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V84484PWBXII?ASIN=B0716TPR7N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars It works. Smell clean. No chemicals, metals, and perfumes",
                "reviewText": "The salt stick works very well in various climates. I have been using it for a long time. And its good for your body unlike chemicals and heavy metals. You do apply it differently though after showering. Thoroughly moisten underarm area in and around pit and up to elbow and down the side of body. Rub salt stick repeatedly over the whole area and coat the area heavily. Kills stinky bacteria and lasts a long time. The stick will last 2-3 months used daily.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariana ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFULZCNBSQIM3MHGFQ7VMGRSHA7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MQ2Y6V4DWBDG?ASIN=B0716TPR7N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "This deodorant is amazing! I’m never going to use another one in my life. There’s no smell, no irritation, and I don’t smell at all not even after a workout.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tyler Kershaw",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEV2BHF7Y6366GRDEKW7R5NCU2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH113P36GH6NT?ASIN=B0716TPR7N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2023",
                "reviewTitle": "4.0 out of 5 stars 30’s Male Approved",
                "reviewText": "Although there are conflicting opinions on whether or not this CoNtAiNs aLuMiNum, I am not going into that. It does not contain triclosan, propylene glycol, or any of the aluminum compounds associated with the big brand deodorants. I bought this on a whim, here’s why: It’s cheap ($6 for ~3 years supply in 4 ounce stick). It’s natural (no mystery chemicals synthesized in a lab). It’s fragrance free (does not interfere with my fragrance-only products). It works (applied once in the morning and it lasted all day even after watching a stressful Stanley Cup hockey game). No foul smell whatsoever. It’s not an antiperspirant but I don’t sweat profusely anyway so I don’t mind.To Use: Run the crystal under water then rub 20 times in your pit. Rinse off and repeat for the other pit. Rinse off again before storing. There’s no feeling at all, not soapy not foamy not anything. You can proactively reapply, and there’s nothing to get caked up into your clothing. My initial impression after 1 day of use is good, just make sure you apply after you are clean so it works best. It you apply to pits that already stink I don’t think it would work the same, but who knows. Just start off clean and you should be good. For $6 why not give it a try",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robust",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSWISEC7JPNDDPSR4KWATT5ARHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN6I2H5QRXZW6?ASIN=B0716TPR7N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "5.0 out of 5 stars A Good Replacement for Deodorant",
                "reviewText": "I have been using under-arm mineral stones for well over a decade and have used multiple brands (which are all suspiciously the same size). The price may seem high for the first time buyer, but consider that this will easily last a single user anywhere from 6-12 months.A few things to consider: if you drop this on the bathroom floor, it can shatter from the impact. While the remaining stick is still usable, it will be sharp until it's used a few times. Also, this is a -deodorant- and not an -anti-perspirant-. If you are expecting dry arm pits, pass on this item, don't look back, and don't feel bad. However, if you do not mind moist underarms, this does an admirable job keeping odors to a minimum. I recommend thoroughly washing under your arms and applying this immediately after showering. I lightly wet my under arms, quickly run the stick under water, and then generously rub this on my underarms. It may initially feel itchy (you're essentially rubbing salt on your skin), but dries quickly.Long story short, I would recommend this item to anyone looking for a natural deodorant and not concerned with potentially moist underarms. As an FYI to newcomers, keep in mind that all of the \"crystal deodorant stones\" are essentially the same thing, excluding any added fragrances. I have used this exact brand on and off over the years, but would not hesitate to recommend other brands as well.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shamnath Kamaludin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on August 4, 2020",
                "reviewTitle": "Worth the money",
                "reviewText": "And it lasts long. Go for it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.99",
                "sellerName": "ATREVO",
                "sellerRating": "5"
            },
            {
                "price": "$6.99",
                "sellerName": "Koneh Hakol",
                "sellerRating": "5"
            },
            {
                "price": "$8.80",
                "sellerName": "Kaizen8",
                "sellerRating": "5"
            }
        ]
    }
}