{
    "remaining_requests": 23799,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Old-Spice-Deodorant-Mens-Endurance/dp/B0017WKFQE",
    "body": {
        "name": "Old Spice Deodorant Men's Hi Endurance (Pack of 6)",
        "price": "$29.49$29.49",
        "originalPrice": "$33.59",
        "rawPrice": 29.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Old-Spice-Deodorant-Mens-Endurance/dp/B0017WKFQE",
        "soldBy": {
            "sellerID": "A1UWLDVGZSXGKG",
            "name": "VerSure",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1UWLDVGZSXGKG&asin=B0017WKFQE&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/412qqE9XTOL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41-ZbDK3kKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61eAPUzArUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Y8zN7kXPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EXO-DpIPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dy2iX3paL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81th8IT6o6S.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81th8IT6o6S.pdf"
        },
        "byLineInfo": {
            "name": "Brand: Procter & Gamble",
            "link": "https://www.amazon.com/Procter-Gamble/b/ref=bl_dp_s_web_2598995011?ie=UTF8&node=2598995011&field-lbr_brands_browse-bin=Procter+%26+Gamble"
        },
        "brand": "Procter & Gamble",
        "merchantInfo": "VerSure",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5137,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 1 hr 48 mins",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Friday, February 16. Order within 1 hr 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Old Spice Invisible Solid Men's Antiperspirant and Deodorant reduces armpit sweat, goes on invisible, and stays feeling dry",
            "So easy to use you might accidentally put it on and only later realize your man-nificence",
            "High Endurance collection boosts your man-smell and prepares you for success",
            "The masculine, citrus scent of success"
        ],
        "description": "Product Description Old Spice Men's Antiperspirant and Deodorant reduces underarm sweating and odor. To use, turn the base to raise the anti-perspirant and wipe armpits for lasting sweat reduction. What's better than smelling like man? I'm so glad you asked, because the only thing better than smelling like a man is smelling like a man who knows how to smell manly. I'm talking about the sophisticated scent of a man who uses Old Spice. Fresh is the ever-impressive scent of clean citrus. Old Spice Men's Invisible Solid Antiperspirant and Deodorant reduces armpit sweat, goes on invisible, and stays feeling dry. So get yourself some High Endurance collection and prepare for success, because it will find you no matter what. From the Manufacturer This is an Old Spice Anti-Perspirant & Deodorant you will find in the medicine cabinets of haunted houses. That’s because it’s spooky how good it works. It goes on clear, and lasts all day. Don’t be frightened by its manly, yet invisible power. Odor protection lasts all day, even into your graveyard shift at the plant. Old Spice High Endurace Anti-Perspirant & Deodorant.At a GlanceHidden underarm powerIt goes on clearHigh-performing odor protectionFor a True Olfactory Experience, Try Them TogetherYou can't get enough of this scent. But you can try.Long-Lasting Stick Anti-Perspirant & DeodorantLong-lasting. Stick.Body WashDrop-kicks dirt and odorClear GelLong lasting but clearLong-Lasting Stick DeodorantA scent with staying powerFrequently Asked QuestionsManly Scents to Choose FromWhat are the pros of procuring this product?It plants a flag of fragrance high atop your man mountainIt gives heart to the weak, while striking fear into your enemiesIt smells like cobra fangsIt allows you to mark large geographical areas with your scent and increase your dominionIt increases your ability to sense other dimensionsIt makes you feel like a delicious meatball sandwich for womenIt makes larger mammals fear youIt allows you to save small animals using only your man scentWhat are the cons of procuring this product?It incites an unmistakable urge to wrestle large animalsIt creates a desire to climb tall mountains simply because they existIt smells too manlyIts manly scent causes people to assume you’re an astronaut able to answer aerospace queriesWhat if my current soap isn’t manly enough?Try Old Spice Body Wash.What if I smell like a turtle cage?Try Old Spice Deodorant.What if I want to slap the smell of America on my face?Try an Old Spice fragrance in Aftershave or Cologne.What if my armpits spring a leak?Try Old Spice Anti-Perspirant.What if I’ve lost my man-smell?Try Old Spice Body Spray.Pure SportFreshPlaymakerOriginalGame DaySmooth Blast",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Personal Care",
                "link": "https://www.amazon.com/Personal-Care-Products-Health/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3777891"
            },
            {
                "name": "Deodorants & Antiperspirants",
                "link": "https://www.amazon.com/Deodorants-Antiperspirants/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3778451"
            },
            {
                "name": "Antiperspirant Deodorant",
                "link": "https://www.amazon.com/Antiperspirant-Deodorants/b/ref=dp_bc_aui_C_4?ie=UTF8&node=702372011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.25 x 1.25 x 5.75 inches; 1.13 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ Value not found"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 012044000243"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ P&G"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0017WKFQE"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,364 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #125 in Antiperspirant Deodorant"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 5,137 ratings"
            },
            {
                "name": "Brand",
                "value": "Procter & Gamble"
            },
            {
                "name": "Item Form",
                "value": "Invisible Solid"
            },
            {
                "name": "Scent",
                "value": "Fresh"
            },
            {
                "name": "Special Feature",
                "value": "Anti-Perspirant"
            },
            {
                "name": "Number of Items",
                "value": "6"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/7be8bfef-f5cf-4aa7-9420-d179eee7d914.__CR78,360,1164,360_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/ad8521a3-02a3-487a-96a7-8aa6b79993df.__CR14,0,1862,576_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/2f11869e-3d7b-4fde-af75-e5cd4dc9f430.__CR14,0,1862,576_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/ae5ce8a4-22a9-4de5-8c73-cc2f488bb956.__CR15,0,1862,576_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Heavy Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2XWFFDPGDBEMHZN2PJVXDQVFVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34XD94A8A1Z2I?ASIN=B0017WKFQE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Throw your hands in the air like you just don’t care.",
                "reviewText": "I used this product to reduce armpit perspiration and offending odor. It works like I ( and people that have their noses near me ) want it to perform. I now feel safe to participate in the wave at sporting events. Thank you Old Spice Men’s Hi Endurance Fresh Scent for making me comfortable.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jose Cortes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEG72WC2OWC4FF5N47O33TVWFS4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1STRPZ608EZF6?ASIN=B0017WKFQE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2022",
                "reviewTitle": "5.0 out of 5 stars Simply awesome savior kit",
                "reviewText": "I always buy this kit for the good price and because i can forget that have to buy this every month or so.The scent is kinda neutral bur my wife says it smells delicious.It has protected me since i was a teenager and still does. Any other odorant irritates me, this one does not.Great value for the money!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roberto Rojas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOQBQKT2UCQ2PKUIKOIJKSCCCNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N9Z3URDQ1I81?ASIN=B0017WKFQE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Excelente",
                "reviewText": "Lo mejor de lo mejor",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQCJ24JHUVZBQQRQQQAX64TAMSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E6BLCCDSLMZ2?ASIN=B0017WKFQE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2023",
                "reviewTitle": "5.0 out of 5 stars It's good stuff",
                "reviewText": "Works like a charm and it's Old Spice",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazonlover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG62UD7Q67DBARLYYTGSWHASW33Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D3U16M68CNNB?ASIN=B0017WKFQE",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Old Spice Men's High Endurance Deodorant - Nearly Perfect but With Room for Improvement",
                "reviewText": "Old Spice Men's High Endurance Deodorant is a product that has become a staple in my daily grooming regimen. Upon purchasing the pack of six, I found myself immersed in a world of invigorating scents and long-lasting freshness. The brand has been a household name for decades, and with this particular product, they've managed to elevate the standard deodorant game to a level that rivals even some of the more luxurious brands in the market.While my experience has been largely positive, I aim to provide a balanced review that not only lauds its strong points but also highlights areas where improvement could turn this already excellent product into the perfect one.🌬 The Fragrance Factor: A Symphony of Scents: When it comes to deodorants, scent plays a crucial role. Old Spice's High Endurance collection offers a delightful variety of fragrances that cater to different preferences. Whether you lean towards woodsy, citrusy, or more subdued notes, there's something in this pack for everyone. Each application feels like a refreshing splash that is both invigorating and comforting.💪 The Power of Longevity: Say Goodbye to Reapplications: One of the standout features of this deodorant is its lasting power. A single application in the morning has proven sufficient to last me through a long day at work, followed by a rigorous gym session. That's an accomplishment that only a handful of deodorants have been able to achieve in my experience.🌿 Skin-Friendly Formula: Kind to the Skin but Tough on Odor: Another commendable aspect is the formulation. Even with daily use, I haven't experienced any skin irritation or excessive dryness. The product appears to be free from harsh chemicals, which is reassuring for those with sensitive skin.🎯 Precision Application: No Streaks, No Drama: The deodorant stick is designed in a way that makes application easy and fuss-free. It glides on smoothly, leaving no residue or visible streaks on clothing. This is a highly underrated feature, as the last thing anyone wants is to ruin their outfit with unsightly deodorant marks.🌍 Eco-Friendly Packaging: A Step Towards Sustainability: It's heartening to see that Old Spice is making strides towards sustainability by opting for packaging materials that are more eco-friendly than most competitors. This adds an extra layer of satisfaction to the purchase.However, as with any product, there are always areas that could be better:🔄 Consistency is Key: Room for Improvement: While the pack offers multiple scents, I found that not all were created equal in terms of longevity. Some fragrances lasted throughout the day, while others seemed to fade more quickly. Consistency across the range would elevate this product to the next level.🔬 Ingredient Transparency: What's Really In It?: Although the product claims to be skin-friendly and hasn't caused me any issues, a more transparent list of ingredients would be beneficial for users who are more cautious about what they're applying to their skin.🏷 Pricing Conundrum: Is Bulk Buying Always Better?: The pack of six offers value, but it could be intimidating for someone who wants to try the product before committing to such a large purchase. An option for smaller packs or individual units sold at a reasonable price could attract more potential users.Taking everything into consideration, Old Spice Men's High Endurance Deodorant earns a strong 4-star rating. The fragrance variety, longevity, skin-friendly formula, precise application, and steps towards eco-friendly packaging are major pluses that outweigh the minor negatives of fragrance inconsistency, lack of ingredient transparency, and pricing concerns.If you're on the fence about which deodorant to choose for daily use or even for specific activities like workouts, this product is definitely worth a try. Its combination of performance, quality, and value is hard to beat.Thank you for taking the time to read this detailed review. I hope it assists you in making an informed decision and brings you a step closer to finding your ideal grooming product. With Old Spice Men's High Endurance Deodorant, you're not just investing in a deodorant; you're investing in a lifestyle upgrade. Happy grooming!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wisel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM4WLUNFUXTZTVSCB7GOLDUVYTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIA8CPZCOEOUC?ASIN=B0017WKFQE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Hard to find in the stores.",
                "reviewText": "My husband's \"go to\" for antiperspirant/deodorant. Tough to find in the stores.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Henry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFU5H3YSWQA6K2CYX3DKAGMA6JSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZKOOOJAX40Y3?ASIN=B0017WKFQE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 30, 2023",
                "reviewTitle": "5.0 out of 5 stars My favorite deodorant.",
                "reviewText": "This is a good price for my favorite deodorant.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWFH4YDSH47NRTEP67J7RDO2D4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RY23ADBNT5W51?ASIN=B0017WKFQE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Long lasting and a great scent too",
                "reviewText": "I like the original scent best. At times, I am forced to use a different scent because I ran out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alain Lamothe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 8, 2021",
                "reviewTitle": "ma favorites the FRESH",
                "reviewText": "Couldn't find that pack else where!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 5, 2019",
                "reviewTitle": "Excelente compra",
                "reviewText": "Me gusto mucho y llego a tiempo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "deputydog",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 12, 2020",
                "reviewTitle": "Large Size",
                "reviewText": "This is good stuff and comes in the larger US pack. Never understand why UK deodorant comes in such small containers which makes it more expensive and is bad for the planet and adds plastic into the system. Excellent service as well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marios Papadakis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 10, 2019",
                "reviewTitle": "Toller Preis",
                "reviewText": "Toller Preis, Richtiges Produkt, Zollamt reibungslos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 25, 2019",
                "reviewTitle": "Trusted brand",
                "reviewText": "Great smell",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$29.49",
                "sellerName": "The Great Savings",
                "sellerRating": "5"
            },
            {
                "price": "$29.51",
                "sellerName": "Zehrico LLC",
                "sellerRating": "5"
            },
            {
                "price": "$29.53",
                "sellerName": "My Great Goods",
                "sellerRating": "5"
            }
        ]
    }
}