{
    "remaining_requests": 23570,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Crystal-Mineral-Deodorant-Stick-Unscented/dp/B000L978FU",
    "body": {
        "name": "CRYSTAL Deodorant Stick, Unscented, 4.25 Ounce, White",
        "price": "$7.19",
        "originalPrice": "",
        "rawPrice": 7.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Crystal-Mineral-Deodorant-Stick-Unscented/dp/B000L978FU",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CGKJJ7X5"
        ],
        "asinVariationValues": [
            {
                "asin": "B00J5K6OU6",
                "variationName": "Size",
                "variationValue": "1.5 Ounce (Pack of 2)",
                "price": "$8.80",
                "variationImageURL": ""
            },
            {
                "asin": "B000L978FU",
                "variationName": "Size",
                "variationValue": "4.25 Ounce (Pack of 1)",
                "price": "$7.19",
                "variationImageURL": ""
            },
            {
                "asin": "B001E0YEIY",
                "variationName": "Size",
                "variationValue": "4.25 Ounce (Pack of 2)",
                "price": "$14.38",
                "variationImageURL": ""
            },
            {
                "asin": "B00GMPEVRK",
                "variationName": "Size",
                "variationValue": "4.25 Ounce (Pack of 3)",
                "price": "$19.88",
                "variationImageURL": ""
            },
            {
                "asin": "B002LN6HUQ",
                "variationName": "Size",
                "variationValue": "4.25 Ounce (Pack of 12)",
                "price": "$86.28",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "Save 15%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31cDrlepZES.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/310FF6LnCgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fTObwlFBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NH9TNV25L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hDBOPZSNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VWUU0YdeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91DAY7-QZ8L.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ca0a1fd-9ef7-4e43-80ef-68354e81c009/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/13d7c574-0c95-425d-bfc3-cdba079eafdc/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/78042a28-a8a6-4c2c-8804-f14aa9dfb246/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/650e8f87-5e3e-48ce-9288-319e8c5f39da/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aea6dae0-24e5-4caa-a528-c8b8d04e15d8/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4c4f22f3-cb43-46fe-b745-0c306ac707dc/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Crystal Essence Store",
            "link": "https://www.amazon.com/stores/CrystalDeodorant/page/7C9A0A72-9919-447C-BCD8-C83C5B9DB39A?ref_=ast_bln"
        },
        "brand": "CrystalDeodorant",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 27471,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 2 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "THE OG MINERAL DEODORANT: 35 years ago, we invented the original mineral salt deodorant, making it the first naturally-derived one ingredient deodorant on the market.",
            "CRYSTAL CLEAR INGREDIENTS: Crystal is the only deodorant brand to receive Clean Label Project Purity Award for ALL of our deodorants. We never use aluminum chloride, parabens, sulfates, phthalates artificial fragrances, or colors.",
            "GENTLE AND INVISBLE: Tired of rashes caused by other natural deodorant? Crystal body deodorant is dermatologist tested to be hypoallergenic, gentle on the skin, and dries quickly. Even better: no streaks, white marks, or staining.",
            "SMELL GOOD NATURALLY: Regular deodorant blocks your pores which is pretty gross when you think about it. Crystal doesn’t do that. In fact, Crystal deodorants allow the body to function naturally and control odors for up to 24 hours with natural minerals.",
            "GOOD VIBES ONLY: Crystal deodorant is vegan, cruelty-free, safe, and effective. We never test our products on animals and use the cleanest, safest ingredients available."
        ],
        "description": "The Original Mineral Deodorant, this powerful, one ingredient mineral stick eliminates and blocks odor before it starts; without using harmful or harsh chemicals. This effective mineral odor protection offers long-lasting, natural mineral protection for up to 24 hours. With daily suggested use, can last over a year. Product packaging may vary.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Personal Care",
                "link": "https://www.amazon.com/Personal-Care-Products-Health/b?ie=UTF8&node=3777891"
            },
            {
                "name": "Deodorants & Antiperspirants",
                "link": "https://www.amazon.com/Deodorants-Antiperspirants/b?ie=UTF8&node=3778451"
            },
            {
                "name": "Deodorant",
                "link": "https://www.amazon.com/Deodorants/b?ie=UTF8&node=702371011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.97 x 1.97 x 4.02 inches; 4.25 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 30003"
            },
            {
                "name": "Department ‏",
                "value": "‎ Body Hands & Feet"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 781549615312 885260165689 730158048066 885190547036 885781228542 086449300031 725873856409 610822543137"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Crystal Essence"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B000L978FU"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,580 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #33 in Deodorant"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 27,471 ratings"
            },
            {
                "name": "Brand",
                "value": "Crystal Essence"
            },
            {
                "name": "Item Form",
                "value": "Stick"
            },
            {
                "name": "Scent",
                "value": "Unscented"
            },
            {
                "name": "Material Type Free",
                "value": "Unscented"
            },
            {
                "name": "Special Feature",
                "value": "Non-Sticky; Non-Staining"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fc23c091-0072-4d90-a045-4d0b2afbf21f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d9e60355-8e99-4c18-9730-ecf0a9b8cf68.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/85c5bc1f-5d7e-4799-87af-7837d595096c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56cde93d-080a-4b70-92b9-6256981068b7.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "PennyDreadful",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK6OIWOQGBOURGTX5BDQR72HEBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GATMIMR4XA9O?ASIN=B000L978FU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2015",
                "reviewTitle": "5.0 out of 5 stars Awesome, Natural Way To Stop the Smell, Not the Sweat.",
                "reviewText": "NOTE: Salt deodorants work by killing the bacteria that cause odors under your arm. It is not an antiperspirant, it's more a natural antibacterial. You will absolutely not like this item if you are looking for something to stop you from sweating.I purchased 2 brands of salt crystal, both are identical and this review covers both from my experience.Pros: Last a long time, no odor, natural, no chemicals or additives, works great on under arm smell, lasts a couple days after applied,Cons: not an antiperspirant, some people find it ineffective, easily broken if droppedI purchased this for the first time after trying many, many different types of deodorants and antiperspirant. Between living in Florida and L.A. heat was a given, and sweat happens. I would notice that when I used most deodorants I would not sweat, and there wasn't a \"sweat smell\" under my arms, but there was a weird unpleasant smell that would happen sometimes. A sort of \"dirty deodorant smell\" that would appear towards the end of the day and the \"deodorant balls\" that formed under my arms (yuck) with some deodorants. I tried all sorts of brands, different scents, unscented, roll-on, stick, gel based. Most were fine, no sweat, no gross under arm sweat smell, but by the end of the day it was all the same, almost like the stuff had broken down and got funky. I have a sensitive nose, and even if no one else smelled anything, I did and it was gross.One day I was reading about using salt to kill bacteria that caused odors, and someone mentioned salt for deodorant. I was up for anything so I purchased some. I used it the day I got it, I was sure it would fail, and was actually amazed that it worked. While I did sweat in the heat, there was absolutely no odor, no sweat stains, no clumpy white stuff under my arms. The lack of smell was actually unbelievable. It took me a while to get used to feeling wet under my arms sometimes and not thinking \"Oh no! I am gonna smell!\" but after a while I just trusted I would not smell even while sweating.My husband, who is very manly and can kick some deodorant butt when working in the yard, tried it after a few months of seeing me use it. Let me tell you now that I really did not think it would work on him and was shocked when it did. When he uses it he can sweat like a pig, but there is no odor. Actually works better for him when he knows he is going to be sweating because most antiperspirant aren't going to stop you from sweating at the gym (or working in the yard) and fail you so why bother. The salt didn't fail and he was odor free... sweaty, but odor free.As an added bonus, I found this out a few times while camping, that if I couldn't put more salt on the next day, as long as you haven't washed it off or showered, it works just the same! I also learned on that same camping trip that if you did start smelling you could rub more salt stick under your arms and it killed the smell within moments (It was a LONG camping trip -lol-).For smelly feet folks it will work on your feet, too. Jump out of the shower, rub it on your feet and between toes if you can, and let it dry a bit before putting on shoes. Wives, get your hubby to do this and you will thank me later.When you first use it it feels like you are putting nothing on and it can be weird. There is no white or gel goop to show you everything is covered. Just make sure to wet the stick and rub it EVERYWHERE under your arms. I actually go up my arm a bit and down my side a bit, not just the center underarm. There is no such thing as using too much, so go to town. After a little while you will get the hang of it and it will be nothing. Putting it on after a shower makes it simple, I don't even dry under my arms, I just rub the salt bar while wet and make it easy. I also took mine out of the bottom part and rub it longways under my arms, it covers much more area per swipe and makes it much faster to apply.Be aware that if you drop this it can shatter and be useless. I dropped mine and had to purchase another after it broke into a million sharp pieces.Overall, I personally LOVE it. I use it everyday, and have never been let down, but I am ok with being wet under my arms on very hot occasions as long as I know I will not smell. For some people this will be a deal-breaker. It will not stop you from sweating, it will just stop you from smelling. If you are ok with that, you will absolutely love it.",
                "reviewVotes": "74 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer M. West",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMZHH4F36H26WZFXHKJG6CFKRNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFXC5ME9WNE1T?ASIN=B000L978FU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2014",
                "reviewTitle": "5.0 out of 5 stars Wasn't a fungal infection after all.",
                "reviewText": "(I'm going to keep saying deodorant...but I actually mean deodorant/antiperspirant)So, I bought this as my last resort, can't take it anymore, it's either this or I'm done cure.My underarms have been stained very dark for as far back as my teenage years. I have NEVER EVER been able to shave all the hair from under my arms. I'd get most...but not all. didn't matter if I shaved up, or down, or side to side, or with the assistance of a mirror, or a different razor (I could go on for days). Then about...3 years ago my underarms started itching horribly. I stopped shaving, figuring that they were irritated. Didn't help. I switched soaps. Nope. I changed laundry detergents...no. This went on for months while I tried removing one thing after the other to make this itch go away. Nothing was working. And now, it's getting worse because I can't help but to scratch it and I ended up ripping open my skin pretty badly. At this point, I'm starting to get abscesses forming under the skin of my underarms. They get pretty big, some of them about the size of a golf ball under the skin. Painful. I thought, maybe it was from the underwire on my bra rubbing that area. So, I bought unwired bras (another disaster!).This went on for...a little more than a year. FINALLY I went to see my doctor. He says I have a fungal infection...which I honestly believed had to be the issue. In order to treat the 'fungal infection', I had to wash and dry the skin well and use an anti fungal cream. I was supposed to do this twice a day for 4-6 weeks and the infection would go away. I was also put on 2 weeks of antibiotics to help clear up the abscesses, which ended up taking more than 9 weeks on antibiotics to clear.So, for 8 weeks I washed the skin under my arms, then applied the fungal cream twice a day. Since I couldn't wear deodorant during this time, there were days when I had to wash and apply the cream a few times because I would sweat and the sweat would cause the cream to kinda just 'slip' away. More than once I was in a public restroom with personal cleansing wipes trying to maintain my dignity while re-applying this cream. After 8 weeks of treatment, the itch was gone. The irritated skin was gone. The fungal infection was clear. YAY! I'd wait another week or two to ensure it wasn't coming back and then, as always before this fungal problem, I'd shower, and then put on my deodorant. And about 2-4 hours later, I was tearing at my underarms again...I couldn't help it.This went on for a year. A whole year of going through treatment, and it would go away and then it would come back again pretty much right away after I resumed normal hygiene practices. I'd see the doctor, he'd say it must not have been cleared completely and extend the medication for the next round. I spent A LOT of money on meds and doctor's visits that year. Still itching. Still getting abscesses.So, this left me scratching my head. I didn't want to keep paying $100 a month for the anti-fungal medication because there was no end in sight. I got desperate. I switched brands for a month, it didn't help. I switched to a different brand...didn't help. I switched from a stick to a spray, from a spray to a gel, hypoallergenic, no scent, no dye, no perfume, no frills...no change. In between every change I'd go through the anti-fungal medication regimen to ensure that I wasn't simply turning down another option due to carrying over the previous problem. At this point, I'm pretty close to desperation. Honestly...think about it. Do you want to be in your late 20's or early 30's, knowing you've still got AT LEAST 40 years left to go and you won't be able to wear deodorant at all? I was coming to the conclusion that I'd have to go the rest of my life without deodorant...and I didn't like that idea. My last talk with my doctor had him suggesting that my problem might be stemming from the antiperspirant because it's meant to keep moisture out and it does so...but from both sides. So, when you 'wash' your deodorant off (which I would do with a heavy bath sponge and then I'd rake my nails through my underarms to remove ALL of it) you're not really washing it ALL off and because it stays on the skin, it irritates the skin by clogging the pores which could cause itching and it was looking like this was the explanation of my problem because I'd been using deodorant for over 15 years at this point. But nowhere that I looked did I find deodorant without the antiperspirant, and without dyes, and perfumes, and hypoallergenic...blah blah blah. I had to get a prescription from my doctor to get it. Still no change. Non at all. I was so depressed. I was envisioning the rest of my life alone.So, I was telling a co-worker about all of this. And she says to me, \"Maybe you're allergic to something in the deodorant and it's not the antiperspirant.\" Hmm. I got home and checked my deodorant and saw the main ingredients included a heavy metal among other things. Finally, it occurs to me after all this time (funny how sometimes, we just don't think) to go online and do a search on allergy to deodorant. And there it was...page after page after page of people with similar complaints as me, with similar stories as me, etc. I even found a page that someone documented what they were going through in pictures and I realized that it was just like what my underarms looked like. They all recommended buying a deodorant 'stone'.I found several options for deodorant stones on Amazon. I kept looking for my own convenience because I knew that if I'd bought a crystal/stone that was just a rock...it would likely end up in my boy's aquarium tank with all the other 'odd' rocks he finds. I picked this one because it's packaged pretty much the same as the deodorant was. It didn't cost much...probably the equivalent of 2 sticks of my 'old' brand but those 2 sticks would last me 2-3 months. I've had and used the stone everyday for about 3 months now and it shows NO sign of use. This time though, I didn't transition between my 'old' brand to the new with medication in between to clear the infection. Nope. One day I used my deodorant, and the next I used this crystal brand. Within 2 weeks all my problems were gone. No more itching! After the final abscess drained about 3 weeks into using the crystal brand, there's been no more abscesses! After 2 months, I noticed that the dark 'stain' my skin had was lightening up considerably. I don't know if it will ever go completely away but from what it was to what it is now...I'm thrilled! Shaving is no longer hell...my skin is softer. I've noticed that my t-shirts no longer have that waxy layer to them under the arms. I'm SO happy with this product! Please don't ever stop selling it.Now, this part is important:This IS NOT an antiperspirant. Meaning, it WILL NOT prevent sweating. It will, however, neutralize the odor from the sweating so that, when you do sweat, it doesn't smell putrid. (I actually wonder how much that phenomenon is from the product or from the skin pores not being clogged/infected anymore).This product HAS to be applied directly after your shower. Shower, get out, apply product then do everything else. If you shower, then go down in your basement to check the dryer for clean pants, then sit on your bed talking to your dog, then apply lotion to legs and feet and then comb your hair and brush your teeth after you've air dried and half dressed yourself and THEN try to put it on, it's not going to work. Because your skin in that short period of time is already producing fluid. Might not be sweat...just oily lubricating type fluid. This oily type fluid makes it so that this crystal can't be rubbed directly against the skin like it needs to be. If you wait, you'll have to wash under your arms again (or you could use personal cleansing wipes, or alcohol but really, it's just easier to do it right after you step out of the shower).This product HAS to be used wet. I get out of the shower, and completely dry my underarms. I wet the stone and apply. Occasionally I have to re-wet the stone to complete one side, at the least I have to re-wet it to apply to the other arm. You should be able to tell when you need to wet it again. But if not...you wet it again when it no longer simply slides across your skin. If it's dragging...wet it.You have to apply this crystal generously. You may have only had to swipe the deodorant across a 2\" X 4\" patch. That's great. But this needs to go well beyond your deodorant borders to be truly effective. Hence the reason why you might need to wet it more than once to do each underarm.Now, I'm not guaranteeing you fabulous results. I'm not telling you that this WILL solve all your problems and boost your earning potential while bringing back your receding hairline after making you the world's greatest lover. I'm sharing with you MY personal satisfaction with this product in terms of what this product has done FOR ME.I'm a nurse. I'm not telling you that so you'll trust me medically. I'm telling you that because I want you to understand that I work, physically, pretty much everyday. Not only am I a nurse, but I am also in my final semester of nursing school for an advanced degree. All of this means that I pretty much every single day and/or night work or work in clinical for school. The units I've worked for clinical are kept at a balmy 76+ degrees with patient's room sometimes sitting in the upper 80's. Personally, I prefer cold climates. In these situations, I DO sweat. I DO NOT feel like it's excessive but I do sweat. I have not once since starting to use this product smelled the sweat the way I would when I was still using the 'regular' deodorant/antiperspirant. At my job, I bathe my client every day. That's everyday standing in an enclosure with him while the hot shower runs. Again, I DO sweat but I don't smell it. (And neither does anyone else). And I'd also like to tell you that there have been times that I was at home for a day or two in a row...maybe I didn't shower one day...maybe I showered but I didn't use my crystal...either way, no deodorant. If I'd done this prior to switching, I could smell myself and it had that putrid, acrid/infection smell. Since using the crystal...the sweat will have a slight odor (like...odor while still using old deodorant would be at an 8-10...now it's no more than a 2-3) but it's nowhere near as strong or noticeable as before.I'm heading into my first summer after the switch. I'm hoping it goes well. I'm certainly going to put it through the paces. I have a lot of yard work to do this year as well as several trips planned. Hopefully I won't have to amend my review. I guess I'll just have to wait and see.I want to say one more thing, very quickly, before I'm done here. Mass produced deodorant/antiperspirants contain magnesium (a heavy metal) as well as a list of other questionable ingredients. Who knows what a lifetime of use exposes you to. For the women out there, they think there might be a link between deodorant use and breast cancer, as well as lymphatic cancer (think about how close those parts are to your underarm). That's scary. This crystal is literally all natural. It's a rock. They don't add anything to it. There's no fragrances. If you want fragrance, puff a little (TINY BIT) of scented powder near your underarm. There's no white staining on your clothes because it doesn't leave a residue. Your pores clear out. There's no more 'work' to completely wash away the product you applied yesterday morning. The ONLY problem that I've had is that it's a stone, so if you drop it, it might break. Also, it's a pretty dense stone...meaning it's a tad heavy for its size. Depending on your counter top/flooring, if you drop it, it might break your flooring or counter top (or your toe). Mine was dropped once from about 5.5' from the floor and all that did was break the little nubby on the plastic container that make it stay in position after you turned the dial. But that's no big deal...my stone is still WELL above the stop of the container. At this rate, I expect it to last me 1.5-2 years, if not longer.If you're having issues (especially if you're like me, having issues in silence because they're embarrassing) then this is a cheap option to try. This cost WAY less than even a portion of a month's worth of the medications. It's cost WAY less than any of my 'normal' brands of mass produced deodorants. Before I ordered it, I told my husband that it was worth a shot. Thankfully it worked for all of my...'issues'...and I'm grateful that I tried it.",
                "reviewVotes": "1,048 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Me",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 9, 2024",
                "reviewTitle": "Safe and effective deodorant Stick",
                "reviewText": "I am an active person and sweat easily. I have been using a Crystal Deodorant Stick for more than 20 years and have never had an odor issue. The plus for a deodorant stick is that here are no chemicals and no scent, the product is natural and it should last for 5-7 years without having to repurchase - that is a huge savings in todays economy. Because it is solid, you can take it in your carry on luggage with no problems.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cesar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 4, 2023",
                "reviewTitle": "Muy durable y no mancha",
                "reviewText": "No mancha la ropa y su protección es muy buena así com o su durabilidad además de que no tiene aroma.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Valesca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 29, 2023",
                "reviewTitle": "Melhor.",
                "reviewText": "Eh o melhor q existe.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 2, 2023",
                "reviewTitle": "Good Quality Salt Deodorant",
                "reviewText": "Received in excellent condition.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos Eduardo Padilla",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 6, 2023",
                "reviewTitle": "BUEN PRODUCTO",
                "reviewText": "Excelente producto, cumplio mis expectativas, la ropa queda menos manchada que con otros productos similares, buena compra!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.19",
                "sellerName": "TDPEP",
                "sellerRating": "4.5"
            }
        ]
    }
}