{
    "remaining_requests": 23709,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Vanicream-Aluminum-Free-Deodorant-Sensitive-Gluten-Free/dp/B07BKCL9RR",
    "body": {
        "name": "Vanicream Aluminum-Free Gel Deodorant - 2 oz - Unscented Formula for Sensitive Skin",
        "price": "$9.36$9.36 ($4.68$4.68 / Ounce) $8.37$8.37 ($4.19$4.19 / Ounce)",
        "originalPrice": "",
        "rawPrice": 9.36,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Vanicream-Aluminum-Free-Deodorant-Sensitive-Gluten-Free/dp/B07BKCL9RR",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31xVM1uqwTL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/3109KJt uSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31oIgi4CbNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510g0lRX YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wk0nRDJkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MvTeQ1 KL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/78826dac-e5cd-42e5-a550-b242c40ca5e3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4c02a8cf-a731-4f14-b528-4157427b318e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/554787ad-1d37-4e69-ae24-fd726b558276/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/763c6cc7-3591-48fc-be8b-243c01135b1f/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Vanicream Store",
            "link": "https://www.amazon.com/stores/Vanicream/page/52812122-11B4-48A8-B5D7-A5DF989B0737?ref_=ast_bln"
        },
        "brand": "Vanicream",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 3892,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 2 hrs 34 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Non-irritating deodorant: Vanicream aluminum-free deodorant is also fragrance-free and gluten-free",
            "Unique gel formula: Our formula for sensitive skin has only 5 ingredients to fight odor before it starts; made with purified water, triethyl citrate, sodium polyacrylate, undecylenoyl glycine, and sodium hydroxide",
            "Free of common chemical irritants: Our products are free of dyes, fragrance, masking fragrance, lanolin, parabens and formaldehyde releasers",
            "Dermatologist tested: Vanicream products are formulated with ingredients dermatologists consider desirable and not irritating or sensitizing to the skin",
            "Directions: For best results, evenly spread a small amount to clean underarms daily"
        ],
        "description": "An Aluminum-free deodorant. A unique gel formula with only five ingredients. Free of common chemical irritants, unscented, no masking fragrance, with no botanical extracts which mask odor. Alcohol-free, talc-free, no baking soda. Formulated to fight odor before it starts. Apply even thin layer to clean under arms.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Personal Care",
                "link": "https://www.amazon.com/Personal-Care-Products-Health/b?ie=UTF8&node=3777891"
            },
            {
                "name": "Deodorants & Antiperspirants",
                "link": "https://www.amazon.com/Deodorants-Antiperspirants/b?ie=UTF8&node=3778451"
            },
            {
                "name": "Antiperspirant Deodorant",
                "link": "https://www.amazon.com/Antiperspirant-Deodorants/b?ie=UTF8&node=702372011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.25 x 2.25 x 5.5 inches; 3.5 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ B07BKCL9RR"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 345334306023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Vanicream"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07BKCL9RR"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,070 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #17 in Antiperspirant Deodorant"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 3,892 ratings"
            },
            {
                "name": "Brand",
                "value": "Vanicream"
            },
            {
                "name": "Item Form",
                "value": "Gel"
            },
            {
                "name": "Scent",
                "value": "Unscented"
            },
            {
                "name": "Material Type Free",
                "value": "Aluminum Free"
            },
            {
                "name": "Material Feature",
                "value": "Aluminum Free"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/771158b5-768f-40af-a928-411349263286.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ae92be54-8ce4-4a66-8dab-109b24e79096.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19e5d40f-7fa6-4e15-8e14-0a6fcf924baf.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0a779ab-cc0d-480f-be3d-addeb02acd49.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ecb0c596-fc14-484e-9382-8f5072c021fa.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "G. Terry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJVHB4YYPPCKXMCBBSTLBIYHROQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FLSI730T0FQ6?ASIN=B07BKCL9RR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2021",
                "reviewTitle": "5.0 out of 5 stars Finally, Something That Works and Doesn't Cause Rashes",
                "reviewText": "Update Edit: I've noticed it works better if rubbed in a bit. This isn't like most scented deodorants. It works by using antibiotic properties, not fragrance. If you rub it in well, perhaps it works in almost a long-lasting, \"dry\" soap kind of way. If only placing a 1-2 kind of gentle coating motion, it really doesn't work as well. So I would recommend working it into the skin with the applicator 7-10 passes worth. Dont use more product than normal, I just mean spread it around/rub it into skin.Works really great. No smell, but allows me to smell like me, just without B.O. :-)Note: I've never been much of a sweat-er, so if you're someone who gets very sweaty easily, not sure if this would still be effective for you...BUT I would still try it, if I were you, anyway. Because it's been really effective for me and it can't hurt.I've gotten NO rashes or itching from it. I've reacted to several common deodorant products in the past which is why I decided to try this one. No weird discoloration. No damage to clothing.It has lasted over a day for me, when I've forgotten to reapply the next day and didn't need a shower that morning (it was a busy day lol I have 3 young kids so sometimes shower time gets delayed!)The only thing I dislike about it is that it's a wet gel/paste texture. So it stays a bit wet and cold for a couple minutes. But you don't have to wait until it's dry to put your shirt on or anything. I just go about my day, if it gets a bit on the fabric I can't tell. Like I said, no damage to clothing. It isn't oil based. It's also not wet enough to soak into the fabric, so no weird wet underarm spots when applying.It's just really great. Sure, maybe sometimes I wish it had some fun, interesting scent like \"ginger green tea jasmine ylang-ylang sugar cookie forest\" or whatever, but I KNOW I would get a rash from most, or any, kind of fragrance ingredients lolTip: a lot of hippie dippy people like to say essential oils are safe for sensitive skin, but a lot of people get rashes from them. I don't understand how they are allowed to say on products with essential oils that they're sensitive or allergy safe. They just aren't. Even people who don't usually have what they consider to be \"sensitive skin\" sometimes react to essential oil. Just FYI. So if you DO have sensitive skin, you really should try to get fragrance free stuff. Essential oils are NOT hypoallergenic.Anyway, I love this deodorant. I hope they never stop making this because it's really the only one I've found that my skin gets along with. AND it works better than any other one I ever used. It's even better than a certain SUPER popular drugstore brand aimed at men that I was using before this. Not sure if I'm allowed to name the brand here in my review. Let's just say it's name is the name of a tool lumberjacks use ;-) I'm sure you know what I mean. Well, this works BETTER than that. At least in my experience.",
                "reviewVotes": "61 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Wendy Lady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQCD2GTQCYONE2XHGX3CRZMUQGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21BYKTHMTHYL9?ASIN=B07BKCL9RR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 20, 2021",
                "reviewTitle": "5.0 out of 5 stars In my MUST HAVE’s. Took 5+ years to find one that works!",
                "reviewText": "I’m allergic to many things and get painful cysts in my armpits that get infected and when lanced, hold a shocking amount of green or brown guck. It’s painful AF and so, not out of wanting to avoid aluminum, I just stopped using antiperspirants. This cut down the cysts (the size of my thumb under my skin in my armpit). So I began my “natural deodorant” journey. zOMG I have bought over 30 deodorants. Anything with grass or tree based eases risk oils or even Baking soda broke me out in a bloody rash that would take weeks to heal. Weeks of zero deodorant and hebacleanse followed by cetephil facial wash and no clothes that were not sift cotton or silk. It has been a hellish struggle. The few times I thought I found something that worked, after 4-6 weeks, I would start getting very red which was my cue to go back to cetaphil facial wash on my armpits and no deodorant. After many years I had an ok, but not great rotation. Kopari unscented coconut deodorant (the essential oils in the scented ones give me a bloody rash) when I was too sensitive for anything else, but it had to be reapplied 3-4x a day and if I was exercising or anxious, that meant showers too. So then sometimes, if I didn’t kind a white film on my clothes, I would use MagnoSol in Rose. Still is viscous as heck so use a thin amount and spread with facial massage stone. That stuff will kill the worst stench abd can be reapplied if you break through and make you smell great again. The minus, it is hard as heck to get off. I would use Dr. Bronners Peppermint soap l, followed by Cetaphil facial wash. After about 10 days I would get irritated skin again, I’m sure from the harsh soap I had to result to, to wash it off. Then I found Freedom Deodurant in CocoVan and that worked better than Kopari on smell, but still needed applied 2x a day and once you broke through, no reapplication would stop the stank. At day 10 I got irritation too. Piffle.Then I say this Dermatologist on YouTube called Dr. Dray. She suggested this and I checked with my actual dermatologist and got the green light. So glad I did.Now I will tell you at first I slathered this on abd it pulled up like crazy and didn’t seem to work well, my pits were wet all day, though no white residue on clothes. Next I wasted abd was shocked that it came off with my cetaphil sensitive skin bar soap. That soap is light weight and could not cut through any other deodorant but Kopari. So, pleasant suprize. Then I thought, just how little can I apply and have it work and that was the trick. I turn the bottom wheel that pushes up the irifuct until you just start to think you see product. It’s clear, so, before you see a full drop form on top. (When I flipped over the deodorant with the cap on and marked it in half’s until there were 8 marks, it seems to take about 1/8th turn to sometimes not quite a 1/4 turn to get the perfect amount of product.) it is not much at all! That thrilled me for the value. If your armpits are damp, there is no way you will feel if you are putting product on. So I blot just armpits and do the 1/8 to just under 1/4 turn, look to see if there is pricier there and then apply it smoothly. Making sure it covers my entire armpit area. Then by the time I finish moisturizing and spf’ing my face, my armpits are dry. I have never had to reapply (though I have not jogged on summer heat yet) I have been using this daily for over a month and ZERO irritation!!! Zero. No red, no bloody rash or lumps that will be so painful I can’t live my arm due weeks... just, smooth, calm, happy, no stank skin. I feel so great about this product that I bought the anti perspiration version to try for when I wear my dry Jean only silk ball gown after the pandemic is not as big an issue. So save yourself 5+ years and 20+ Products at over $5.00 each and just buy this. It may take a few tries to master the application, but you will adore it once you do!",
                "reviewVotes": "194 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 9, 2024",
                "reviewTitle": "Best deodorant on the market",
                "reviewText": "I was reacting to all the deodorants I tried finally this one was recommended to me and it's wonderful. No reaction at all and feels so smooth and cool. Highly recommended",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shubidoo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 12, 2023",
                "reviewTitle": "Worked for me",
                "reviewText": "Unsure when buying it, it was important to me to have no aluminium , scent , parabans etc . but really really pleased with it. It’s easy to put on and I’ve had no bo whilst using it and no skin reactions",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heidee Enclan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on February 23, 2023",
                "reviewTitle": "Worth buying!",
                "reviewText": "Its non-greasy and fragrance free, so its calm in my armpits. I usually put a thin layer of it in my underarms at night and the effect will last 24hrs, like it prevents excessive sweat and odor. It does a good job! Will repurchase!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ageorge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 13, 2019",
                "reviewTitle": "Overrated and expensive for the lack of benefits",
                "reviewText": "Not long lasting for odour control. I've used many other deodorants and antiperspirants, but this doesn't make the cut. Too expensive for the lack of benefits. Not worth the money. Just too overrated!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "River Ivory Barker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 20, 2023",
                "reviewTitle": "Hmm…",
                "reviewText": "Ordered the first time and LOVED the deodorant and the results, i re-order a second time not knowing they changed the formula to GEL… and it does not work for me at all i need the stick of antiperspirant rather than this awful gel stuff please. thanks. This was going to be my new deodorant for life but if you don’t bring back the stick goodbye….",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}