{
    "remaining_requests": 48330,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/FOXBOX-Bluetooth-Military-Smartwatch-Waterproof/dp/B0CKVGM9BQ",
    "body": {
        "name": "FOXBOX Smart Watch for Men with Bluetooth Call, 1.39\" HD Dial 100+ Sport Modes Activity Fitness Tracker 400mAh, IP67 Waterproof Smartwatch for Android iOS Heart Rate Blood Pressure SpO2 Sleep Monitor",
        "price": "$54.99",
        "originalPrice": "",
        "rawPrice": 54.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/FOXBOX-Bluetooth-Military-Smartwatch-Waterproof/dp/B0CKVGM9BQ",
        "soldBy": {
            "sellerID": "A3E8PU84LDY5NV",
            "name": "SMGF STORE",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3E8PU84LDY5NV&asin=B0CKVGM9BQ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CMCXXY3Z"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CQCDGX3K",
                "variationName": "Color",
                "variationValue": "Brown leather",
                "price": "$54.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/512fxoP79eL._SS36_.jpg"
            },
            {
                "asin": "B0CKVGM9BQ",
                "variationName": "Color",
                "variationValue": "black",
                "price": "$59.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51sWFajkIbL._SS36_.jpg"
            },
            {
                "asin": "B0CKW2XYYN",
                "variationName": "Color",
                "variationValue": "silver",
                "price": "$54.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51M-CAdV9uL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 30% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51sWFajkIbL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51fYv00Rb0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lsuETPywL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Q2relpN L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418rUanFT2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pxRnM-jRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NSVoBCPXL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ad3dacdc-590a-420e-8cba-8db28bf648c5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bac85a06-58eb-435e-8ed0-4324321ed900/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b0bb15c4-5bf5-49e0-9ead-89c1b0414a03/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9b3996d0-8eb7-461f-91f3-1ecbad3bab3b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/440ee26d-bb11-42fa-bbe8-d13fe1c72fb8/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the FOXBOX Store",
            "link": "https://www.amazon.com/stores/FOXBOX/page/79D4099E-35A1-4F26-8281-AD2C660B0F7A?ref_=ast_bln"
        },
        "brand": "FOXBOX",
        "merchantInfo": "SMGF STORE",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 39,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 6 hrs 20 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Clasp type Single Pusher Foldover Clasp",
            "Country of Origin China",
            "⌚[Rugged Military Smartwatch] This smartwatch is made of high-quality metal case and the outer ring of the watch dial is reinforced with four screws, which is resistant to drops, pressure, water and dust. The screen is made of tempered glass with a Mohs hardness of 7H, which is hard, scratch-resistant and wear-resistant, while the outer ring is raised to further prevent the screen from being scratched. The smartwatch has passed several durability tests and works well even under harsh conditions.",
            "📞[Bluetooth Call & Receive Messages] This men's smartwatch has a built-in hi-fi microphone and speaker. The Bluetooth watch is connected to the app and \"call audio\" is turned on, you can use the fitness watch to easily receive calls (incoming calls will show the contact name)/make calls/store contacts/view call logs, and also receive notifications and read messages from your phone and social apps.",
            "❤️[24H Health Monitoring] The FitClouPro app can monitor your heart rate, blood oxygen, blood pressure in one click and can continuously monitor health data. Steps/heart rate/calories/active distance can be visualized on some dials. It also monitors your sleep at night and during lunch breaks (fall asleep/deep sleep/light sleep/awake time), breathing exercises can help you relax and relieve stress, and thoughtful sedentary reminders and water reminders help you maintain a good lifestyle.",
            "⌚[1.39\" IPS Screen & 280+ Dials] 1.39\" HD full-color touchscreen large smartwatch with 360*360 high resolution provides a clearer and more comfortable visual experience. The watch is built-in 7 beautiful dials, the app has more than 280 dials for you to choose, you can even customize the dial to show your personality. The watch comes with two interchangeable bands.",
            "🚴[IP67 Waterproof & 100+ Sport Modes] This men's sports watch has more than 100 exercise modes, get personalized in the app and record exercise data (exercise time, heart rate, calories, steps, distance, step frequency, stride length, speed, etc.). It is IP67 water resistant so you can wear it while washing your hands or during outdoor activities.",
            "🌞[Multi-functional iOS Android Smartwatch] This smartwatch comes with a variety of useful features such as continuous monitoring, weather, alarm clock, stopwatch, music/camera control, voice assistant, find phone/watch, do not disturb mode, power saving mode, brightness and light up duration setting, vibration intensity setting, audio mode setting, flashlight, calculator, female physiological cycle, social apps business card and more. Compatible with Android 4.4+, IOS 8.0+."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Department ‏",
                "value": "‎ mens"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ November 2, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ FOXBOX"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CMCXXY3Z"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25,686 in Electronics (See Top 100 in Electronics) #743 in Smartwatches"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 39 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Military Grade Standard Smartwatch This FOXBOX military smartwatch is made of high-quality metal case, resistant to drops and bumps, pressure and water and dust resistance. The screen is made of tempered glass with 7H Mohs hardness, hard, scratch and wear resistant. The smartwatch has passed various durability tests to ensure that it works well even under harsh conditions. This men's smartwatch comes with a sturdy and durable stainless steel band and a soft and comfortable silicone band or a casual leather strap, suitable for different occasions such as business and sports. Comes with stainless steel band length adjustment tool, the size can be adjusted freely, suitable for all wrists. (If your stainless steel strap is not long enough, please ask us to send you some strap extensions.) (If you also need to buy other straps, the width of the strap for this watch is 22mm, please buy it by yourself according to the size.)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e3f73e9-e2e2-4e04-9559-f4f7ce6f3fcc.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Make/receive Calls and Message Notifications Voice Calling: Calls can be made from the dial pad/contacts/call logs. (Note: 10 contacts can be added) Turn on the call audio and you can quickly answer/dial calls on your wrist. Volume, microphone on/off can be adjusted during the call. Message Notification: Android smartwatches can synchronize message notifications from your phone in real time, including text messages, app notifications, etc. The FitcloudPro app can be set to notify messages only when your phone is off the screen. You can see messages on your watch without taking out your phone while walking or exercising. (Note: The smartwatch cannot send messages and retains up to 15 messages. The messages on the watch can be cleared or a passcode lock can be set so that you can protect your privacy when you take off the watch.)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0dc4b39-068b-4e4d-bd46-c00074c05f9a.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "400mAh High Capacity Battery - Superior battery performance This long-lasting smartwatch is built with a powerful 400mAh battery to give you extra long battery life. You can receive tons of notifications, measure your heart rate throughout the day, and log your workouts for extended periods of time without worrying about battery issues and frequent charging. Provides up to 7-10 days of normal use and 20+ days of standby time.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f25fbb4-863d-47a1-8900-dfebb9bda5b3.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Daily activity monitoring: heart rate, blood pressure, blood oxygen, sleep (fall asleep/deep sleep/light sleep/awake time), steps, calories, distance.One-click monitoring: The Fitcloudpro app measures 3 types of health data at the same time - heart rate, blood pressure and blood oxygen - giving you a quick overview of your health. (Note: The data on the smartwatch (heart rate, blood oxygen and blood pressure) cannot be used for medical purposes.)Built-in 21 exercise modes: Walking, Running, Hiking, Strength Training, Basketball, Badminton, Soccer, Elliptical, Yoga, Table Tennis, Jump Rope, Tennis, Baseball, Rugby, Cycling, Hula Hoop, Golf, Long Jump, Sit-ups, Volleyball, Indoor Cycling.More than 100 exercise modes can be downloaded to the fitness watch, and the high-precision sensor can accurately monitor and analyze the exercise: heart rate (average heart rate, real-time heart rate change), heart rate zones (warm-up/fat-burning/aerobic/anaerobic/extreme), exercise time, calorie consumption, steps, step rate, speed, distance, and other data, which can help you to train scientifically and achieve fitness goals. (If you need to record the exercise route, please turn on the GPS function of your cell phone, keep the Bluetooth connection between your cell phone and the watch, and then you can view the exercise distance and exercise route in the App after the exercise.)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3cd22d32-0884-4325-8d6d-637b9d7043de.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Smartwatch with 284+ Dials/DIY Dials - Practical and Aesthetically Pleasing 1. The smartwatch is built-in 7 beautiful dials, and the dial center of FitCloudPro app has 284+ multi-style dials for you to choose from, including Christmas dials. You can change dials according to different occasions and festivals, and the dial market will be updated from time to time. The dials are all free! 2. You can also upload your favorite photos to customize the dials and release your unique personality. Support customizing the font, color and position of date and time in the dial. 1.39-inch HD color touch screen, 360*360 high-resolution pixels, to provide you with a better visual and touch control experience.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e759474-9c6a-4570-80d8-c78e417af317.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Ultra-functional smartwatches to facilitate your life Weather: display real-time temperature and weather conditions. Alarm clock: you can add 5 alarms in the app, you can set the alarm name and repeat date. Music control: pause/play music, play previous/next song, increase/decrease volume. Remote photo control: Shake the watch or touch the watch screen to take a photo within the Bluetooth connection range. Drinking water reminder & Sedentary reminder: You can set the time between drinking reminders. If you are inactive for 1 hour, the watch will vibrate to remind you. You can set the start time and end time of the reminder. Breathing Exercise: Choose 1 or 2 minutes of breathing exercises and follow the prompted inhalation and exhalation to help you relax and relieve stress quickly. Find Phone: When you can't find your cell phone, find it through your smartwatch and it will ring. Power Saving Mode: When the watch is low on power, you can turn on the power saving mode and it will disconnect the Bluetooth connection. Do not disturb mode: the smart watch will not vibrate to notify the message, but the message will be kept in the watch for you to check at any time. The watch will vibrate to alert you of incoming calls. Dual Audio Mode: The smartwatch has call audio and media audio, turn on the call audio to make Bluetooth calls and turn on the media audio you can play your phone's audio through the watch. Down key settings: you can customize single click or long press to jump to the function page you want (e.g. menu, screen off, back, sport, data, heart rate, blood pressure, music, dialing, frequently used contacts, voice assistant, etc.). Menu styles: Four menu styles to choose from, the menu is very intuitive and easy to navigate. Raise to wake: Raise your wrist to wake up the screen. (can be turned off if you want to save power) Brightness setting: 5 levels of adjustable brightness, the screen is very high-definition, and can be clearly displayed in outdoor bright light. Brightness duration can be set from 5s-30s. Additional features: Stopwatch, Timer, Calculator, Flashlight, Passcode Lock, Social App Business Cards, Multi-Language, Female Physiological Cycle and more.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d612dd9b-94d2-4f76-9668-42b357a51754.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "FAQ Q: How do I use Bluetooth calling? A: Make sure your watch is connected to your phone via Bluetooth. Slide your watch screen down or to the right and click on the \"Call\" icon to open \"Call Audio\". Q: Why does the watch make a sound when I play a video or audio on my phone? How do I turn off watch audio? A: Swipe down or right on your smartwatch screen, click the \"Call\" icon, and then turn off media audio. Q: What if I don't receive message notifications? A: 1. Make sure Bluetooth is turned on and the watch is connected. 2. Grant permission to the app for notifications (Phone Settings - Find the \"FitCloudPro\" app - Turn on \"Notifications\"). 3. Enable \"Push Notifications\" in the app (FitCloudPro app - Device - Push Notifications - open the desired app). 4. Make sure the “Power Saving Mode” is turned off. 5. If you are still unable to receive notifications. Uninstall the app and delete the Bluetooth pairing on your phone. Then install the app and try again. Q: Can I wear this smart watch for diving? A: This watch is IP67 waterproof, only for life waterproof, can deal with hand washing, splashing water, rain and so on, please don't wear the watch to take a hot bath, sauna, diving and so on, to avoid damage to the watch's microphone and speaker, and to prolong the service life of the watch. Q: How to update the weather temperature? A: Make sure the APP positioning has been authorized, the phone network is normal, and the Bluetooth connection between the watch and the phone is normal. If all the above conditions are met, the weather temperature will be updated every hour.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/753868c0-daef-4821-ac1d-ddf27fbd6fee.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e3f73e9-e2e2-4e04-9559-f4f7ce6f3fcc.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0dc4b39-068b-4e4d-bd46-c00074c05f9a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f25fbb4-863d-47a1-8900-dfebb9bda5b3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3cd22d32-0884-4325-8d6d-637b9d7043de.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e759474-9c6a-4570-80d8-c78e417af317.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d612dd9b-94d2-4f76-9668-42b357a51754.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/753868c0-daef-4821-ac1d-ddf27fbd6fee.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "homer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHAWFALQXI24W3NFYRC7SUHFL7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXUYEVRB8A4NC?ASIN=B0CKVGM9BQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Very nice for the price!",
                "reviewText": "I bought this as a gift for my husband.He had already tried 2 other watches (in the $25 range) to monitor sleep vitals like oxygen levels, track deep sleep patterns, etc...but they didn't work as advertised. This one cost just a little more, but was still in the lower price point vs spending over $100.Definitely impressed with the watch! For starters, the box that it came in is very nice/nicely designed. The watch came with 2 bands - a silicone and a stainless steel, which is a nice weight and makes the watch feel strong and sturdy. It also came with a tool to adjust the stainless steel watch band, which was another surprise feature. Overall he is very happy with the quality of the watch and the functions that it provides.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antigone Walsh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH665SQ6SQF6DXAGYIQFCX76LALA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TP39986344FG?ASIN=B0CKVGM9BQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Basic",
                "reviewText": "This is an attractive watch. Overall if you are using it for calls, notifications and messages it is pretty good. The app works and it functions well. However the health and fitness functions are inaccurate. Heart rate and blood pressure are high, steps are way off. It comes with two bands and a tool to adjust. The screen is clear and readable and you can change the dial design. Not a bad basic smart watch but don't trust the health and fitness results. 3.5 stars",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adam Dimeo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESXA22UI7DG4F3XQEZXLXMKR7AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OEDLKMS1POT4?ASIN=B0CKVGM9BQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Great watch",
                "reviewText": "Love this watch…. So many different options and very stylish",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brett SchliekerBrett Schlieker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHTVCOJBBIXRJMLLBRPUWOKUSVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MJYB64YBG14B?ASIN=B0CKVGM9BQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Value",
                "reviewText": "Wasn't sure about the quality after seeing the price but was impressed with all aspects of the watch. the support seems to be on top of things too. Overall a great Value!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71awJsfjzeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TruthspreaderTruthspreader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZAT5TAMBN2N6KT42SF5OFTZIMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19VP4RK9UZ1T3?ASIN=B0CKVGM9BQ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "3.0 out of 5 stars Battery doesn't last as long as they claim.",
                "reviewText": "It's a decent watch for what you pay for. The blood pressure is off on it's readings, but I expected that. It's the battery, it's supposed to last 5-7 days regular use. It maybe last 2 almost a full 3rd day.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71VwPMrKGvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Hayward",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2MZQCTKARIARLU7QORQNKK2YGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19Y3P7BTEA7KL?ASIN=B0CKVGM9BQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "Really like this product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DENISE GOMEZ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNPEV7SMDGCGVQOI5WSQRCEIULA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24EP76Q24IQXU?ASIN=B0CKVGM9BQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice watch",
                "reviewText": "Good quality and Amazing look.If you are looking for a smart watch, this is it. You can receive calls and talk through the watch and receive messages. Battery last long and very bright display. It's amazing 👏.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kellygirlkellygirl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYW2GX64E5M4P6V3I4FPAEKVQSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VUA2LNFJYEON?ASIN=B0CKVGM9BQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Delighted with my FOXBOX Smart Watch & it's not just for men",
                "reviewText": "Amazing quality and functionality. I absolutely love my FOXBOX Smart Watch! And it works! Between my 2\" wide wrist, thin skin & lack of fat, I was uncertain if the watch could not make enough surface contact tomonitor vital signs. No problems at all.The first thing I did was change the skeletal gear watch face to something readable and set the screen time to 5 seconds. Unlike my smart phone, the watch time is even readable in the sun. The metal watch band is huge compared to my boney little wrist. Fortunately a nifty little tool to adjust the band length is included. The silicone band is perfect. It can easily be adjusted to comfortably fit my wrist and the watch actually stays in place. Plus the band doesn't irritate my skin like plastic bands do. This is my first smart watch and I'm unfamiliar with the symbols. Changing the menu setting to Style 2 was the solution. The symbols are now labeled. I've just started to familiarize myself with the watches many features. The pedometer, BP, heart rate & O2 monitors all work. The fitness tracker is great. So much to learn and explore. I'm a very happy camper.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/811AfZjVmqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Falkor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 11, 2023",
                "reviewTitle": "Make no mistake, this is a fantastic step above other mid-range smart-watches.",
                "reviewText": "The company may be called FOXBOX, but this is straight-up a LIGE smart-watch, identical to that particular name in the mid-range smart-watch rung that is well-known for being a step above in both physical quality, and function list of features.A lot of people will accept the mid-range class as \"it's great — for the price\" but I argue that most of them are not even remotely worth paying as much as you do, for what you get. At $65 bucks this watch is no more or less than most of those, but it offers a working feature set that actually does rival the $120-150 smart watch class.Let's just start with the weight and build of this watch. It's an all-metal, tactical round-watch design with an \"actual\" high resolution touch screen that actually responds properly to the smallest touch, and that covers the entire circumference of the interface, not just pretends to until you hold it up to the light. The watch also comes with both a matching all-metal strap (and complimentary adjusting tool) but also a high grade rubber strap (which I generally prefer most days, functionally) that has grooved designed to secure it in a way I don't often see on most of the cheaper straps.The software seems much improved also, offering a \"Pro\" fitness app that in and of itself is also of a higher caliber than the alternatives. A huge collection of watch faces, apps that seem responsive and connective to the watch monitoring. And on that note: the monitoring tools on the watch themselves... WOW. The moment I laid the watch across my wrist, it was already attempting to gauge my statistics, it is incredibly sensitive and responsive on all counts. I can't believe it offers a sensor chip that monitor not merely your heart rate, but also blood oxygen, and apparently blood pressure as well??? I don't even know how that's possible, but it does so quickly and, as far as I can tell, efficiently. I really did not expect such a wide variety of health conditions offered and, as it seems, with accurate proficiency.The options do not stop here. There are subtle features across the entire watch system that just make this feel so much more like a near-to-premium device, like password protection, a variety of app screen layouts, better vibration control, voice assistant and calling options that all seem generally superior to other brands in its price range.I have tried a lot of so-called \"smart\" watches in this class and, to date, this is now my favourite of the bunch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 13, 2023",
                "reviewTitle": "Good Place to Start!",
                "reviewText": "Pros:- Decent for a semi-smart watch- Extensive number of 'apps' or options, though a few are useful you still get the options for all the rest- Nice bands, they are good for the price, and you have two options to choose from. I prefer the metal bracelet though some have said it opens or digs into their wrist I did not find that at all in my case.- Easy to adjust metal bracelet, adjustment tool is included- Silicon strap is nice, though not my style, though it is still quite good and decent quality- Watch has a nice weight to it and feels much heavier than other smart watches. I understand the trend is to light as possible and also 'not feeling it on', but that isn't for me, and this has the heft I wanted.- Finish is nicely done, anti-reflective matt black that so far is staying on well and not scratched overly. There are some spots that have a mark, but that is me wearing it working outside and all around, so it is very durable and if you wear a watch to actually use it, I say this stands up very well. Not just a show piece.- Monitoring for sleep, blood pressure and beats all worked without any issues, even if the band is slightly loose, they seemed to work and matched pretty closely to a real pulse check and a standalone blood pressure cuff machine.- Display is nice and large for the size and other watches out there, it also is bright and crisp.- Watch faces are easily changed, though it does take time to get back to the old style if you change your mind.- Connectivity with the phone via Bluetooth is stable and once paired works flawlessly. This is not a truly independent smart watch; it relies on your phone and the BT connection to actually become smart. Less cost so good choice for entry level selections.- Includes charger, extra strap as mentioned above, link tool, screen wipe and all the paperwork you would expect.Cons:- Not truly smart or independent of a phone, but for the price who cares.Conclusion:If you like all metal bands, good heft and want a reasonably priced entry to wearing a smart watch then this is probably at the top of the options currently on Amazon. This is a solid 4.5-Star watch and I recommend it as excellent option.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GordenGorden",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 3, 2023",
                "reviewTitle": "Great Watch",
                "reviewText": "I really like this watch, unlike many other smart watches I have had this one has a metal strap that clips closed and not a silicone strap. It does come with a silicone strap though if you happen to like that style more. The metal strap can be adjusted in length by removing links, included is a nice tool to help you do this, simply line up the hole with the tool point then start to turn the tools handle, this will push the tool forward and push the pin out of the link enough that you can grab it and pull it out the rest. Watch has a nice weight to it due to being metal and the finish is beautiful flat black, does not feel \"cheap\" from what I can tell the quality is very good. What I like most about this watch is that I do not have to wear it overly snug to have the monitoring functions to work, unlike other smart watches I have had that you had to wear quite snug and even then sometimes the monitoring would not work, this one has worked perfect so far every option such as blood pressure, O2 levels, heart rate all work on first attempt, again unlike other watches I have had that you had to try once to be told the watch needed to be adjusted then try again to have same error. It also will monitor sleep workout records workouts daily steps etc. The display is sharp and screen is easy to see/read, it is also a bit larger of a screen than many smart watches. You can create a custom face if you wish to, or choose from 100's that you can get with the App. The App is easy to use and does not require internet once installed, the App and phone are linked through the Bluetooth, once the watch is paired with your phone you can get the current temp/weather, make phone calls, listen to music and more The watch even has a speaker that you can listen to your music or phone calls, It also has a mic that can be used to speak on the phone, or voice assistant and other features. In the box was the charger, which is a magnetic kind, a silicone strap, the metal strap, a screen wipe as well a small micro fiber cloth, warranty card, pin removal tool for the pins in the metal band and watch strap pins. I would for sure recommend this watch to anyone who likes this style (metal strap/military) as this has to be the best smart watch I have owned thus far. 5 out of 5 all day long..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61RFa56ovEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51GCKrYRc8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61FKSiIiu4L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71m0urc1GUL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ilijiamin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 9, 2023",
                "reviewTitle": "Sturdy - Stylish - Inaccurate",
                "reviewText": "This decently priced watch sits around the average mark for watches of this level.There are many different functions available, most of them novelty gadgets that offer a starting point to monitor some of your activities. The problem is that most of the health and activity features are not very accurate. It feels like you input an activity, cycling for example, and the app doesn't really monitor what you are doing, it just makes an internal estimate based on the time and an average.It doesn't take into account things like going uphill, riding an ebike, or tell the difference between rollerblades and walking.Still, it at least tracks something, and is almost ten times cheaper than the really good, accurate watch of this type.Again comparing to similar watch at this price range, I found that the battery life was a bit shorter than the average.The option between the two wristband is good, and the instructions along with the tool provided to change them is nice. However, bear in mind that the metallic bracelet tends to come undone if you do sports, like running or cycling. The clasp cuts right into the wrist and then comes undone.Furthermore, while the screen is responsive, I found that the ergonomy was a bit lacking. There are very few display options to choose from, and the settings menu is both very restricted and finicky. You can't preview any of the display functions, you have to try them, and then fight through them to get them back to how they were.Still, overall, it's a decent watch for the price. It isn't as bulky as some of the others of that type, and at this price it makes for a good entry-level 'smart' watch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dfletch",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 4, 2023",
                "reviewTitle": "Basic design but functional",
                "reviewText": "I already have a watch very similar. In fact, it is the same manufacturer that is supplied to different brands to retail. Virtually nothing is different, but nothing is then special either- which is ok as it is still value for your money.For starters, the watch looked good and is sturdy, based on a classic design. Although only two of the buttons actually work. The rest are just to look nice. It comes with a metal and rubber band. The rubber is comfortable and substantial and is what I use. A pin-press to take the watchband on and off is included.Connecting to the phone is not easy, but disconnecting is. It is a pain to reconnect every time. Also annoying is the tendency for the watch to play music through it rather than through much preferred Bluetooth earphones. You can switch to those of course. But as I said, annoying. Who wants to listen to music on their watch when you have a perfectly good phone with better sound and/or earphones?You need a proprietary app to link to your phone too. This is also where you can get more watch-face designs you can switch to. None of which is the design shown in the promotional photos. But some are ok. Some just look cheap. But you can get faces at off-site marketplacesSome of the apps are nice to have like built-in step and heart rate monitor. But I don't put much stock in the accuracy. As a general guide, they are fine to have however.Patience is required overall. Maybe this reflects my newness to the technology though as I have not had a smartwatch previous so have no benchmark to work from.Battery life is good though lasting days on one charge. So, a mixed bag technologically speaking. But given the base price and competing offerings on the market, I still give it reasonable marks for overall value.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}