{
    "remaining_requests": 48241,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amazfit-AI-Powered-Alexa-Built-Workouts-Marathons/dp/B0C7ZXCKK2",
    "body": {
        "name": "Amazfit Cheetah Pro Smart Watch AI-Powered with GPS, WiFi, Fitness Tracker, Music, Heart Rate Sleep Monitor, Alexa-Built In, 14 Day+ Battery Life for Workouts, Running, Marathons, Sports – Round",
        "price": "$299.99$231.76",
        "originalPrice": "$299.99",
        "rawPrice": 299.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Amazfit-AI-Powered-Alexa-Built-Workouts-Marathons/dp/B0C7ZXCKK2",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CF5YDK83"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C7ZXCKK2",
                "variationName": "Color",
                "variationValue": "Run Track Black (Titanium Alloy Bezel)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/616-FPo+AiL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Speedster Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51nOYZmEMOL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/616-FPo AiL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51AWr99BrsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511fedgtSOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/6120Fy2F40L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/516dsnQXvdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vp4mFyDvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cmhQT8yfL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/70f5cb05-e50e-4184-b33f-ef811ce56c1b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6516267-d50f-4d9f-9339-530e3e0776a5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d1927f5e-9782-4ba5-982b-bc3e58e84db3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d2c2e5a7-9e79-4c5a-9353-b46c78b8f0cd/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3a007bbb-c953-45a9-acf2-7676c60fa990/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eeec24a9-3f39-4a49-b9ef-5aacc71ec82a/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1iWIPZeM3L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91gxfTymacL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Amazfit Store",
            "link": "https://www.amazon.com/stores/Amazfit/page/118DA492-B719-4D4B-8EB6-A9D78D11AA96?ref_=ast_bln"
        },
        "brand": "Amazfit",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 49,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 6 hrs 7 mins",
            "FREE delivery Friday, February 16. Order within 6 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "MaxTrack: Industry-leading GPS Technology: Amazfit's dual-band circularly-polarized GPS antenna technology, named MaxTrack, enables this GPS smartwatch to pick up almost 100 percent of satellite signals. This technology reduces multi-path interference in order to track your position with the maximum amount of accuracy, even if you're running in dense cities with tall buildings or parks with high trees.",
            "Personalized AI-powered Running Coach: The Zepp Coach harnesses the power of AI to provide personalized running plans, which are generated based on your current level, target race type and date, and your goal for the race. To help you build up to race day in the ideal condition, Zepp Coach will intelligently adjust your plan every week based on your performance, and provide scientific guidance as you progress.",
            "Precise Route Navigation and Offline Maps: With this sport watch, you'll always know where to run. Download a color map of the area you plan to run from the Zepp App and import it to the watch, to enjoy a detailed understanding of your surroundings. Pair the map with a matching imported route file and navigate with incredible precision as you run.",
            "Bluetooth Phone Calls and Music Storage: Make and receive phone calls using the watch via Bluetooth connection to your phone, to keep up with personal and professional contacts while on the run. Store your running playlist on the watch and listen to music through the built-in speaker or your connected Bluetooth headphones.",
            "Premium Lightweight Design with Titanium Alloy: Decorated with a durable titanium alloy bezel, this smart watch is built from lightweight fiber-reinforced polymer, and comes with a comfortable nylon strap. The responsive crown and button allow easy control while running, while the bright and clear HD AMOLED display with Corning Gorilla Glass 3 is easy to read in any environment.",
            "Advanced 24/7 Health and Fitness Data: The BioTracker PPG optical sensor enables highly-accurate monitoring of your heart rate, blood-oxygen, stress level and sleep quality. Connect to a heart rate belt when you go running, thanks to the powerful Bluetooth connectivity of the health-centered Zepp OS 2.0.",
            "Ultra Long Battery Life: Enjoy up to 14 days of battery life with typical usage, or even up to 45 days in Clock Mode. Enable the Automatic GPS Mode and the watch will intelligently adjust GPS settings to save power when you're running in areas with strong satellite signals.",
            "Online and Offline Voice Assistants: Take the Amazon Alexa voice assistant with you on your runs to check the weather, set an alarm, and more! When you're without internet access, use the watch's Offline Voice Assistant to carry out hands-free operation of the watch.",
            "Connect to Fitness Apps: Share your workout data to adidas Running, Strava, Komoot and Relive - and even smartphone apps like Apple Health and Google Fit."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Personalized AI-powered Running Coach, Amazon Alexa, GPS"
            },
            {
                "name": "Compatible Devices",
                "value": "Android 7.0 and above, iOS 14.0 and above"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Supported Application",
                "value": "Sleep Monitor, GPS"
            },
            {
                "name": "GPS",
                "value": "True"
            },
            {
                "name": "Controller Type",
                "value": "Button Control"
            },
            {
                "name": "Battery Life",
                "value": "14 days"
            },
            {
                "name": "Battery Cell Composition",
                "value": "Lithium Polymer"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "Bluetooth"
            },
            {
                "name": "Screen Size",
                "value": "1.45 Inches"
            },
            {
                "name": "Display Type",
                "value": "AMOLED"
            },
            {
                "name": "Style",
                "value": "Cheetah Pro"
            },
            {
                "name": "Color",
                "value": "Run Track Black (Titanium Alloy Bezel)"
            },
            {
                "name": "Shape",
                "value": "Round"
            },
            {
                "name": "Band Color",
                "value": "black"
            },
            {
                "name": "Sport",
                "value": "Running, Fitness"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 49 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#77,274 in Electronics (See Top 100 in Electronics) #1,739 in Smartwatches"
            },
            {
                "name": "Brand",
                "value": "Amazfit"
            },
            {
                "name": "Model Name",
                "value": "smartwatch"
            },
            {
                "name": "Target Audience",
                "value": "adult"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Model Number",
                "value": "A2292"
            },
            {
                "name": "Whats in the box",
                "value": "User Manual, Magnetic Charging Cable, Smart Watch"
            },
            {
                "name": "Target Gender",
                "value": "Unisex"
            },
            {
                "name": "Weight",
                "value": "34 Grams"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "1.85 x 1.85 x 0.43 inches"
            },
            {
                "name": "Warranty Description",
                "value": "1 year manufacturer"
            },
            {
                "name": "International Protection Rating",
                "value": "IP67"
            },
            {
                "name": "Case Material",
                "value": "Titanium"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Amazfit Cheetah Pro revolutionizes smartwatch positioning with its dual-band circularly-polarized GPS antenna. Named MaxTrack, this technology enables the watch to pick up almost 100% of satellite signals, so it can track your position with the maximum amount of accuracy, wherever you run. This premium running watch also supports 6 satellite positioning systems for reliable global coverage, and uses L1 and L5 satellite signals for pinpoint dual-band GPS tracking.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b717555a-39c0-425b-a346-e5e4473d6a80.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Run with Intelligence. The Zepp Coach harnesses the power of AI to provide personalized running plans, tailored to you and your goals. Your intelligently crafted training schedule will adjust week-to-week, based on your performance. And to help you avoid overtraining, Zepp Coach will provide scientific guidance as you progress, so you can build up to race day in the ideal condition. Run with Direction. With the Amazfit Cheetah Pro, you'll always know where to run. From the Zepp App, download a color map of the area you plan to run and import it to the smartwatch. Pair it with a matching imported route file to navigate with incredible precision as you run. You can even store your favorite route files on the GPS watch for easy access, or save location points as you go and come back to them another time. Run Your Own Way. With dedicated modes for Outdoor Running, Treadmill, Track Run, Triathlon, HIIT and more, the Amazfit Cheetah Pro has a sports mode for every kind of runner. To see how you'd perform on race day, check out your Race Achievement Predictions in the Zepp App. When you're done, sync your running routes and performance data to adidas Running, Strava, Komoot and Relive - and even smartphone apps like Apple Health and Google Fit.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a45d8e28-5e73-44c3-85f1-c28a0b6dbb00.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/26253abb-0524-450b-9262-baad26a3378f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e788f60-95ae-4e8d-a87b-762d06584b96.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Run with Confidence. Track your VO₂ Max and get real-time performance scores during Outdoor Running and Track Run sports modes. Connect to workout devices like a heart rate belt, thanks to the powerful Bluetooth connectivity of the Zepp OS 2.0. Set the watch to keep your sports data on-screen during workouts, or even read out key performance metrics in real-time. Train with Purpose. Create training templates in the Zepp App and sync them to the fitness watch, so you can stick to a workout routine that helps you improve every session. Interval Training templates can even be created directly on the watch. Use the Strength Training sports mode, and the watch can auto-detect 25 strength exercise types. It will track your rest, sets and rest time, and provide a summary of exercises performed and muscle groups worked in the Zepp App when you're done. Engineered for Runners. This premium running watch is built with lightweight fiber-reinforced polymer, and decorated with a durable titanium alloy bezel. The crown and button enable easy control while running, and the HD AMOLED display is easy to read in any environment - with peak brightness that can reach up to 1,000 nits. Choose from 100+ watch faces with matching Always-on Displays, including options with a Quick-start Sports button and which show fitness data like VO₂ Max.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c1daf549-4207-43bb-b692-bc4d868e4048.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55bf9abc-f438-4009-85de-a212e390c9d1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/11bb97cb-d511-4f64-b88a-4501e0c5e2c4.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Run at Your Own Rhythm. Make and receive phone calls using the watch via Bluetooth connection to your phone. Store your running playlist on the watch and listen to music through the built-in speaker or your connected Bluetooth headphones. Connect to your Amazon Alexa account to enjoy convenient voice assistance when on the go. A Battery that Keeps Running. Able to last up to 14 days, the Amazfit Cheetah Pro has energy to match your own. Enable the Automatic GPS Mode, and the watch will intelligently adjust GPS settings to save power when you're running in areas with strong satellite signals. Run Toward a Healthier Life. Putting health at the center of everything, the Zepp OS 2.0 works with the BioTracker sensor to provide accurate 24/7 monitoring of your heart rate, blood-oxygen and stress level. Stay smart with alerts for abnormal health data like low SpO₂ or high heart rates. Set a sleep schedule that suits you, day or night, and maximize your recovery with in-depth tracking of sleep quality, sleep stages and sleep breathing quality, plus daytime naps.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/329dbda8-4ed9-4d29-a3e7-77dfc8cc4357.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b47d9ed6-c0e6-4c98-9038-2fbfcef19296.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9af193ec-a58a-481a-853d-50889ed8ca50.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Amazfit Cheetah Pro Amazfit Cheetah (Round) Amazfit Falcon Amazfit T-Rex Ultra Amazfit Active Edge Display Size 1.45\" AMOLED 480x480, 331 ppi 1.39\" AMOLED, 454x454, 326 ppi 1.28\" AMOLED, 416x416, 326 ppi 1.39\" AMOLED, 454x454, 326 ppi 1.32'' 360 x 360, 277 ppi Watch Body Material Titanium alloy bezel, Fiber-reinforced polymer middle frame Fiber-reinforced polymer Titanium Stainless Steel bezel, back panel, bridge, buttons & polymer alloy middle frame, Anti-mud bridge with mud-resistance design Dual-color plastic Strap Material Nylon Liquid silicone Liquid Silicone Silicone TPU + Spray sports strap Battery Life 14 days (Typical use), 24 days (Battery saver mode) 14 days (Typical use), 24 days (Battery saver mode) Typical use: 14 days; Battery saver mode: 30 days Typical use: 20 days; Battery saver mode: 25 days Typical use: 16 days; Battery saver mode: 24 days Offline Maps ✓ ✓ ✓ ✓ Bluetooth Calls ✓ Alexa AI Assistant ✓ ✓ Ultra-low Temperature Operation -30°C/-22°F 30m Freediving Support EN13319 & ISO 6245 certifications Built-in GPS Circularly-polarized GPS antenna, Dual-band & 6 Satellite Positioning Systems Circularly-polarized GPS antenna, Dual-band & 6 Satellite Positioning Systems Dual-band & 6 Satellite Positioning Systems Dual-band & 6 Satellite Positioning Systems 5 Satellite Positioning Systems",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df78c74a-4251-4fcd-88e0-aa9b3fab1849.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b717555a-39c0-425b-a346-e5e4473d6a80.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a45d8e28-5e73-44c3-85f1-c28a0b6dbb00.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/26253abb-0524-450b-9262-baad26a3378f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e788f60-95ae-4e8d-a87b-762d06584b96.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c1daf549-4207-43bb-b692-bc4d868e4048.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55bf9abc-f438-4009-85de-a212e390c9d1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/11bb97cb-d511-4f64-b88a-4501e0c5e2c4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/329dbda8-4ed9-4d29-a3e7-77dfc8cc4357.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b47d9ed6-c0e6-4c98-9038-2fbfcef19296.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9af193ec-a58a-481a-853d-50889ed8ca50.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f4170be-756f-44d5-b317-a473184d3f8b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5fceb36c-aebe-4597-b087-8e5df3f84973.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba7f0db6-16e6-4573-bbe4-699738b1048f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1abaae2f-6504-4ef5-88d3-6e4a3b950f2d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df277cd0-eb02-488d-b51c-aeaffbb6a1ac.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c68bb533-9120-496b-83f2-78470ec205b3.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LINDA E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESI4ANYZZPTP5ZF3TM6SKH46MUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24J4350FRW7C0?ASIN=B0C7ZXCKK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Buy this watch!",
                "reviewText": "If you want a smartwatch that does everything for a great price and doesn’t need to be charged every night then you need this watch. I have had several Amazfit watches all the way back to a Bip and I will not buy another brand. I have even given a couple as gifts.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randall Penland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7NPPTTAZT2LISPXGVJPIH4OENA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20E9QRVBSJZM9?ASIN=B0C7ZXCKK2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2023",
                "reviewTitle": "4.0 out of 5 stars Why no speaker?",
                "reviewText": "The watch is beautiful and the band is one of the best fitting with looks to match. I was so impressed with it all until I realized no speaker and the gtr 4 has a speaker,and ready to answer my calls but not this watch. I always enjoyed playing music straight from the watch of my gtr4 , but not the cheetah and all this said I did not return because it is a nice watch and mostly made for workouts. Just after a couple weeks I went back to the gtr4 so I can go outside and not take earphones",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chuck3rd22",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFO2BKZB2O6IQH72G2UXWXBBAXNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25TGNJBY7HFUY?ASIN=B0C7ZXCKK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Battery time is ok so far.",
                "reviewText": "So here's my best review I can give from having only had the watch for 5 days. Battery- charged it up to 96% when it first arrived, haven't charged it since and it's at 45% on the beginning of the 5th day. I've used alot for walking, adding apps and watch faces, and checking blood pressure, etc. So I feel like I've given it a good push for resource use. Looks like it might hold some type of charge for maybe 10 days before recharge is needed.Usage - the app \"Zepp\" is not very intuitive so I have to click around a bit to find what I want. Othere than that it's fairly a good application for what I need. I wish you could type sms replies from the watch but you can only use \"quick replies\" which is still ok. (I like typing from my phone anyway lol) Phone answers and can call from the watch via Bluetooth so that's a +Only thing I've found to NOT work is Alexa. Simply won't connect from Zepp and it just spins and spins.I came from a Galaxy watch 46mm, and this so far blows that out of the water in my opinion due to the battery life.Update: 1/24 After 7 days of heavy use I've not had to charge it and I have 25% battery left!!!! I'm going to push it to see how long it will last! The battery life for this watch is AMAZING!!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AbeAbe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXAKOYLDXKEPFHDHZMPQC7EEF2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RORG7IZHODXC1?ASIN=B0C7ZXCKK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Very thin and light",
                "reviewText": "Good for runners. There is no indoor biking option in the workouts though.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/611ML8QokCL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raul Raul ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKJALN63XB6CA2IRVWEC27L7BVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24BFQPTM0ZSFT?ASIN=B0C7ZXCKK2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Amazfit Cheetah Pro",
                "reviewText": "Buen reloj en general, con buena duración de batería. No es tan compatible con apple como lo llegue a creer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61JtHjFUFRL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg Norrell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNQE24T6YCNZMZMK5BMVCUID3PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22XJ4O0QOLSQ2?ASIN=B0C7ZXCKK2",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "1.0 out of 5 stars missing power bas",
                "reviewText": "Nothing in box but watch. No way to charge Can't find old chat link.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John C. Jahnke Jr.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLQKVXVTE2ZGEAY4O6O2NOM6EMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CRG1BA4XNCXB?ASIN=B0C7ZXCKK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2023",
                "reviewTitle": "5.0 out of 5 stars This watch does exactly as advertised.",
                "reviewText": "Wonderful watch. Sporty. All functions advertised work on this watch. No additional expense for software. I'd give it 5 stars. Very affordable.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6XLNLDT6ITXG76X4WYLNVPIEBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MPRJXTZQA0ER?ASIN=B0C7ZXCKK2",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "3.0 out of 5 stars Not for me",
                "reviewText": "This has some nice features, but none that are substantially useful to me that my Fitbit didn't have at half the price. The feel is kind of cheap, and it's bulky. The watch face itself is a bit large for my taste, and I feel like it really screams for attention that I really don't want it to scream for.I don't really care for it and I'm going to go back to my Fitbit, but this could be nice for someone who is younger who wants to make this part of their sportswear fashion statement while maintaining similar functions to a fitbit. I found that this watch seemed to capture data a little less reliably than I have experienced with Fitbit watches.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MIGUEL ANGEL OCADIZ QUINTANAR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 13, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Excelente producto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}