{
    "remaining_requests": 48266,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsung-Bluetooth-SM-R800NZSAXAR-Version-Warranty/dp/B07M6RWQXK",
    "body": {
        "name": "SAMSUNG Galaxy Watch (46mm) Heart Rate Monitor, Silver (Bluetooth) US Version (Renewed)",
        "price": "$64.34",
        "originalPrice": "",
        "rawPrice": 64.34,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samsung-Bluetooth-SM-R800NZSAXAR-Version-Warranty/dp/B07M6RWQXK",
        "soldBy": {
            "sellerID": "A3SBLQ9AF6CQVD",
            "name": "MOBILESUPPLY",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3SBLQ9AF6CQVD&asin=B07M6RWQXK&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ce tJqyVL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/514EGDKkq-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Tsu5jqNpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qB3XNCZQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21UeX7PvyGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41y  uRm qL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41l8h3U27nL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c62bc962-37de-4cbe-9ea7-1340d0bad701/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/75a2f976-3d3d-4148-825c-c5b21525be84/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "MOBILESUPPLY",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2948,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 14. Order within 18 hrs 10 mins."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "Live a stronger, smarter life with Galaxy Watch at your wrist Rest well and stay active with built-in health tracking and a Bluetooth connection that keeps everything at your wrist Plus, go for days without charging",
            "Go nonstop for days on a single charge. The wireless charger lets you power up without slowing down. (Average expected performance based on typical use. Results may vary)",
            "Available in two sizes and three colors, the Galaxy Watch offers stylish watch faces so realistic they hardly look digital. Plus, choose from a collection of interchangeable bands",
            "Pairs with both Android and iOS smartphones via Bluetooth connection",
            "Included in Box: Galaxy Watch, Additional Strap(Large and Small included), Wireless charging Dock, Travel Adaptor, Quick Start Guide, User Manual"
        ],
        "description": "PRODUCT OVERVIEWBLUETOOTH ONLY Live a stronger, smarter life with Galaxy Watch at your wrist. Rest well and stay active with built-in health tracking and a Bluetooth connection that keeps everything at your wrist. Plus, go for days without charging. LTE Live a stronger, smarter life with the watch that lets you break free from your phone and stay connected with cellular. Rest well and stay active with health tracking tools, and go for days without charging. With Galaxy Watch, everything you need is on your wrist. BLUETOOTH & LTE Live a stronger, smarter life with the watch that lets you stay connected without reaching for your phone. KEY FEATURESHEALTH & WELLNESS: Your most balanced life. Galaxy Watch makes it simple to balance mind and body. Improve the quality of your rest with integrated sleep cycle tracking. Stay hydrated and get reminders to keep moving throughout the day. Track calories burned and calories consumed. And when things get stressful, reset with guided meditation and breathing exercises.BATTERY: Go for days. Go nonstop for days on a single charge4. The wireless charger lets you power up without slowing down.LTE: Leave your phone behind. Leave your phone at home. With Galaxy Watch, you have the freedom to call, text, stream music and get notifications via cellular. You can even shop or grab lunch with Samsung Pay on your watch.DURABILITY: Made to last. Built with both military-grade durability and water resistance, Galaxy Watch takes on spills, splashes, unexpected rain, and even swim workouts. Plus, the Corning Gorilla Glass DX+ prevents the display from getting scratched.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4.15 x 5.25 x 3.35 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.24 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07M6RWQXK"
            },
            {
                "name": "Item model number",
                "value": "SM-R800NZSAXAR"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,948 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,179 in Amazon Renewed (See Top 100 in Amazon Renewed) #92 in Renewed Smartwatches #697 in Smartwatches #2,626 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "OS",
                "value": "Android Wear 2.0"
            },
            {
                "name": "Wireless communication technologies",
                "value": "Bluetooth, Wi-Fi, NFC"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth, GPS"
            },
            {
                "name": "GPS",
                "value": "Yes"
            },
            {
                "name": "Special features",
                "value": "Accelerometer"
            },
            {
                "name": "Display technology",
                "value": "AMOLED"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Scanner Resolution",
                "value": "360 x 360"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Whats in the box",
                "value": "Watch, Band, Charging Cradle, Charging Cable"
            },
            {
                "name": "Department",
                "value": "unisex"
            },
            {
                "name": "Manufacturer",
                "value": "Samsung"
            },
            {
                "name": "Date First Available",
                "value": "January 3, 2019"
            },
            {
                "name": "Weight",
                "value": "2.24 Ounces"
            },
            {
                "name": "Standing screen display size",
                "value": "1.3 Inches"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "4000 MB"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "1.5 GB"
            },
            {
                "name": "Brand",
                "value": "SAMSUNG"
            },
            {
                "name": "Model Name",
                "value": "galaxy"
            },
            {
                "name": "Style",
                "value": "Classic"
            },
            {
                "name": "Screen Size",
                "value": "1.3 Inches"
            },
            {
                "name": "Special Feature",
                "value": "Accelerometer"
            },
            {
                "name": "Shape",
                "value": "Round"
            },
            {
                "name": "Target Audience",
                "value": "Unisex Adult"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "umeweall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPCOMCUVBDYDYQ4QGEWHLMRSGJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZT15A63H0IZJ?ASIN=B07M6RWQXK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 11, 2021",
                "reviewTitle": "5.0 out of 5 stars Great Watch, Good Battery Time, Flawless Operation",
                "reviewText": "I bought this renewed item and have been very happy since. I have had no issues with the watch, and the watch looked like new. I was not totally sure as to how I might use the functions of the watch. Over time I have found that I like getting the notifications on my watch, phone calls, reminders, and calendar notifications, etc. . I use the stop watch and timer operations in the kitchen, or for other odds and ends. I can roam freely thru my house, without having my phone on me, and have my watch immediately let me know what's up. When I am at the end of my house, I do not have to RUN to catch a phone call, before it switches to voice mail. I answer my phone on my watch, and talk on my watch. The sound is clear and loud enough, and the people on the other end hear me o.k. Yep, LOVE this watch!One important thing though, if you want the timer & reminder apps, you went need to get them through the galaxy store, as they do not come with the watch. Some people have not seen that they can get other apps from the galaxy store, with the feature one being the timer app, and just thought the watch does not have it. Well, there are many other apps available through the store, but you just have to download them to the watch.UPDATE: Sept., 28, 2021Well, got a good one for you here! Do you want to know how OUTSTANDING this watch is against water/hard treatment? Well, get this. I found that I had accidentally WASHED my watch in my washing machine. It went through all of the cycles! I found in in the bottom of my tub, when I took all clothes out. I let it sit for two days, to give any water inside time to dry, and just turned it on. IT WORKS FINE!! Wow!!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aeroangel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR66QU2WEIZMIPECQAXXUJLF3LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ3CW028TW8XI?ASIN=B07M6RWQXK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2021",
                "reviewTitle": "5.0 out of 5 stars Perfect for my Lifestyle",
                "reviewText": "Wow I meant to write a review after having the watch for a month, but 5 months have slipped by! So for the past 5 months this watch has been amazing. It looked practically brand new when I got it, and I even used to have a manual labor job where it would bump into hard surfaces a lot and it never got scratched or blemished, but I did purchase a case, screen protector, and the rotating bezel protector just to be on the safe side and to protect this investment. There are some cons which aren't worth removing a star in my opinion, which are occasionally the watch has become unresponsive or very laggy which holding down the power button for about a minute has always fixed the issue. The other con is some apps like Spotify and the samsung pay I just never got to work unfortunately.BUT the benefits oh my. I almost never miss an important call because of this watch. Even if my phone isn't near by, but in another room for example I can answer and talk on the watch if necessary. It tracks my sleep and steps like a champ, and I adore the Samsung health app integration with the GPS where for example if I take a walk around the neighborhood (without my phone) it will still track where I walked and how fast I was walking, and my heart rate and everything. This has helped with my health a lot, and I love that I can check most of my phone notifications on my wrist without having to grab my phone every time. I also have used other functions such as a language translator app, calculator, to-do list, etc. I always want to have a smart watch going forward, and after 5 months this thing is still so durable, no problems with the wrist band or anything. On many other watches over the years by now the band would have started breaking or something. I would highly recommend this watch to anyone! It's my most favorite watch that I've ever owned hands down.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eyeconic",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUUWIFY7DIFIWQRWV2JKBCOWEIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHX1YB43LJ342?ASIN=B07M6RWQXK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 11, 2021",
                "reviewTitle": "5.0 out of 5 stars Splendid Watch",
                "reviewText": "Renewed? Mine is like brand new and came with 2 bands. Not so much as a scratch.I have several watches including an ancient Rolex Submariner. I doubt that any of them will ever see daylight again.This thing is incredible. I walk quite a bit. The watch has about 1.5gb of music storage and connects flawlessly to Sony earbuds. Now I can leave my phone at home and still enjoy music. Plus I expect that my gym will reopen soon..There are numerous watch faces built in and others are available at the Samsung store (I think for free). Unlike some other smartwatches this has many features that work independently of the phone it is connected to. It is loaded with goodies and a complete manual (PDF) is available at the Samsung website. I definitely recommend downloading the manual to take full advantage of the device.All of the faces are very easy to read. The sports face I am using (today - it's fun to change from time to time) shows time, date, heart rate, battery charge and two step counters. Other faces also show the day of week.There is some textual information provided by apps and notices. While it is small print it is surprisingly easy to read due to the quality of the display. I did have some trouble entering my wifi password as my finger doesn't always tap the intended target. (I am 72 and have a tremor.)I am using the setting that keeps the watch displayed at all times (with dim lighting). When my wrist is tilted to read the screen the face is fully lit. Battery life is fair. I am charging every other day. The charger, by the way, is magnetic. No plugs to fool with.If there is a downside it is the complexity. There are two buttons, bezel turns, swipes and touches that do various things. It is a learning process. A smartphone is much easier to use just by virtue of the difference in screen size. However, you can activate voice commands. It functions like Google Assistant or Alexis.All in all, most people will really love this watch. Presumably people who hate techie things won't buy it in the first place. As always, YOUR MILEAGE MAY VARY.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 17, 2023",
                "reviewTitle": "It looked new and it works great",
                "reviewText": "I own one but they don't make them anymore. I decided to take a chance and order one. I was surprised when I opened up the box it looked brand new and it looks great.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}