{
    "remaining_requests": 48274,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Receive-Watches-Waterproof-SmartWatch-Compatible/dp/B0BC9CBV62",
    "body": {
        "name": "Smart Watch (Call Receive/Dial), Smart Watches for Men 1.32\" HD Touch Screen Waterproof SmartWatch for Android iOS Phones Compatible Fitness Tracker with Heart Rate, Sleep, Blood Oxygen, Step Counter",
        "price": "$27.99",
        "originalPrice": "$29.99",
        "rawPrice": 27.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Receive-Watches-Waterproof-SmartWatch-Compatible/dp/B0BC9CBV62",
        "soldBy": {
            "sellerID": "A1LZX4TEKKAQNH",
            "name": "GIAOQ",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1LZX4TEKKAQNH&asin=B0BC9CBV62&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C7CTNS12"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 5% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51GQVPLLMQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51T95h06T6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qxXTsJGSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-VK5GmJzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vyjpPdaiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515LM5Yy07L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nuo5dWUmL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a8a4d528-5ce6-4f93-b2c7-8769f7bced73/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dcd65212-f619-47bd-bad4-a47aa7275269/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f5a3a2c-d1d0-4c2a-b41a-eab34a4513a4/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the GIAOQ Store",
            "link": "https://www.amazon.com/stores/GIAOQ/page/DCCBB4D2-0723-4FEB-8B26-037A17BB2987?ref_=ast_bln"
        },
        "brand": "GIAOQ",
        "merchantInfo": "GIAOQ",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 170,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 8 hrs 11 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Bluetooth Connecting & Multi-Function】After connecting smart watches with your phone, you can dial, receive calls, listen to music, SMS and SNS notifications(Instagram, Twitter, Facebook, WhatsApp, Skype, etc.).",
            "【APPS On Your Wrist】When you are running, driving or busy with other things, GIAOQ Watch will remind you through vibration. You don't need to take your phone out of your pocket and will never miss any important notification. More convenient watch dialing after adding contacts in App.",
            "【Advanced Health Features】GIAOQ Smart watches built in high-performance sensor to monitor 24/7 heart rate, blood oxygen and blood pressure. Wear digital watch to sleep, automatically track your sleep and analyze sleeping quality(deep sleep, light sleep and awake).",
            "【A Powerful Fitness Partner with Multiple Sports Modes】Accurately record all-day activities such as steps, distance, calories burned, and miles walked. Fitness watch supports multiple sports modes(walking, running, skipping, cycling, basketball, badminton, football) and help you develop good exercise habits. All data can be synchronized to your phone for analysis, helping you exercise scientifically and achieve fitness goals. The best equipment for fitness enthusiasts.",
            "【Easily Customized】Available in a range of sizes and materials, with dozens of bands to choose from and watch faces with complications tailored to whatever you’re into.",
            "【Custom Dial】App has more than 200 free dials, you can also choose your favorite photo to customize the watch face, such as your family, pet, etc. Mens watch come with 2 materials bands(stainless steel & silicone) to suit your fitness and daily life. The round smartwatch is covered with an ultra-thin metal frame and 1.32-inch HD touch screen, which brings comfortable touch and excellent visual experience.",
            "【Waterproof and Long Standby】Men watches has large capacity of 320 mAh, A full charge (1.5 hours) gives it up to 10 days of working time(depends on individual usage) or 30 days standby time, you will get rid of power anxiety. IP67 waterproof watch, rain, hand washing and sweat are not problems.",
            "【Support Multiple Languages】Simplified Chinese, Traditional Chinese, English, Russian, Spanish, German, Italian, French, Portuguese, Polish, Dutch, Greek, Turkish, Romanian, Japanese, Hebrew, Danish, Swedish, Czech, Slovak, Hungarian.",
            "【Worry-free Shopping】30 days money back service, we provide sincere service within 24 hours to solve your problems."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "5.47 x 3.54 x 1.54 inches"
            },
            {
                "name": "Item Weight",
                "value": "8.1 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0BC9CBV62"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 170 ratings 3.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#67,225 in Electronics (See Top 100 in Electronics) #1,564 in Smartwatches"
            },
            {
                "name": "Wireless communication technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Special features",
                "value": "9 Motor Functions: Heart rate detection, Blood pressure test, Blood oxygen detection, Detection of sleep, Step motion meter, Burn calories, Movement distance, Multiple motion mode, Breathing training, 2 Safety Features: Looking for mobile phone, Combination lock, 20 basic functions: Smart NFC, Smart split screen display, Custom dial, Bluetooth phone Calling, Call records, Music Control, Contact information, Offline payment for alipay(only), Menu Style switch, Screen time settings, Adjustable screen brightness, Adjustable Vibration intensity, Wallet function, Raise your hand to brighten the screen, Calculator, Stopwatch, Voice assistant, Weather display, DND mode, Remote photograph, 4 Reminder Functions: Phone calls reminding, Message to remind, Sedentary remind, The alarm clock to remind"
            },
            {
                "name": "Human Interface Input",
                "value": "Dial, Touchscreen"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Whats in the box",
                "value": "band"
            },
            {
                "name": "Manufacturer",
                "value": "GIAOQ"
            },
            {
                "name": "Date First Available",
                "value": "August 29, 2022"
            },
            {
                "name": "Standing screen display size",
                "value": "1.32 Inches"
            },
            {
                "name": "Brand",
                "value": "GIAOQ"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Screen Size",
                "value": "1.32 Inches"
            },
            {
                "name": "Special Feature",
                "value": "9 Motor Functions: Heart rate detection, Blood pressure test, Blood oxygen detection, Detection of sleep, Step motion meter, Burn calories, Movement distance, Multiple motion mode, Breathing training, 2 Safety Features: Looking for mobile phone, Combination lock, 20 basic functions: Smart NFC, Smart split screen display, Custom dial, Bluetooth phone Calling, Call records, Music Control, Contact information, Offline payment for alipay(only), Menu Style switch, Screen time settings, Adjustable screen brightness, Adjustable Vibration intensity, Wallet function, Raise your hand to brighten the screen, Calculator, Stopwatch, Voice assistant, Weather display, DND mode, Remote photograph, 4 Reminder Functions: Phone calls reminding, Message to remind, Sedentary remind, The alarm clock to remind See more"
            },
            {
                "name": "Shape",
                "value": "Round"
            },
            {
                "name": "Target Audience",
                "value": "Unisex Adults"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "GIAOQ Multi-functional Smart Watches Classic circular design -- 1.32-inch HD touchscreen smartwatch with a thin metal frame. Bright and round full touch display, elegant watch face, bring more comfortable viewing experience. Receive/make calls - You can make and receive calls directly on your watch when connected to Bluetooth. GIAOQ smartwatch, with text and call function, support fast communication, Message Notifications - Turn on the message alerts on the APP and the smartwatch will sync your text messages and social media information (Facebook, WhatsApp, Instagram, Twitter, etc.). Supported operating systems -- iOS 10.0 or later, Android 5.0 or later, Bluetooth 5.0",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b473d5e0-b6f1-4e12-87c8-e9fc3505d268.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "DIY Smartwatch Dial 100 + Free Watch Faces: There are more than 100 free watch faces in the app for you to change. The dials are available in various styles to match the needs of people of different ages. DIY Dial: In addition, our smartwatch also supports custom watch faces, you can upload your favorite pictures as your watch faces, such as your family, pets, idols, etc. Tips：The watchfaces in the watch face store will be updated from time to time, and more surprises are waiting for you to discover!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/142dc769-a756-49fd-b40b-f92265269b40.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Muti-Function Smartwatch IP67 Waterproof:1 meter deep, 30 minutes. The waterproof design is perfect for sports enthusiasts. You can wear this watch for daily hand-washing and rainy days. Note: Please do not use in diving, hot water or corrosive liquid and hot steam environment. Waterproofing is not permanent and protection may be reduced due to daily wear and tear. Multiple sport modes: As a fitness watch, our fitness tracker supports multiple exercise modes: walking, running, badminton, skipping, basketball, soccer, cycling, etc. Activity tracker: A personal fitness trainer on your wrist can use the fitness tracker to check your distance, speed, heart rate, calories consumed, etc., to help you record the data during exercise, so that you can live a healthy life and exercise more professionally. Sleep monitoring: Sleep tracker will automatically monitor sleep status from 9pm to 9am while wearing a watch and provide comprehensive analysis of sleep quality (deep sleep, light sleep and wake). The data will be recorded on the APP, and you can use the data to learn about your sleep quality and adjust your daily routine. 24/7 heart rate monitor: The heart rate monitor automatically monitors your heart rate throughout the day. Blood oxygen monitor: Using the latest photoelectric sensing technology, according to the principle that the amount of light absorbed by the artery blood changes with the pulse of the artery, optical measurement. The Exercise watch monitors blood oxygen saturation during periods of discomfort or high intensity exercise to instantly understand your physical condition and help you lead a healthier lifestyle. Blood pressure monitor: Smartwatch has blood pressure monitoring function.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19d32734-bfe2-4383-ac2b-0c46ba2adcc8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "How to connect smart watch? 1. Long press the side button of the watch for 3-5 seconds, turn it on, open the QR code on the setting page, scan the QR code to download the ‘RDFit ’APP. 2. Turn on the phone's Bluetooth and location services, and make sure that the smart watch is not bound to other phones. 3. Open the RDFit APP on the phone, set personal information, enter the device \"interface\", click \"add device\", swipe to the right on the main dial interface of the bracelet, you can view the Bluetooth MAC address of the bracelet, you can use the MAC in the device list Address to determine your device, select the searched device name and the corresponding MAC address, click pair, the bracelet is connected successfully. How do I use the call function? 1. Swipe down the watch home page to find the Bluetooth marker and open it. 2. Go to your phone's Settings, turn on Bluetooth, find the \"T M Audio\" option, and click Connect. 3. Wake up your watch, enter phone number for calling.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c40ce64-5617-4984-93a6-df7f09f76ffc.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b473d5e0-b6f1-4e12-87c8-e9fc3505d268.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/142dc769-a756-49fd-b40b-f92265269b40.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19d32734-bfe2-4383-ac2b-0c46ba2adcc8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c40ce64-5617-4984-93a6-df7f09f76ffc.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Abdullah AbidAbdullah Abid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXQU42LXLE5PGD7VX6OCFGT3KGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CW34RGO860I3?ASIN=B0BC9CBV62",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Surprisingly Great Gadget for the Price",
                "reviewText": "Not really a smart watch person but thought to give a try to a reasonable price before purchasing any branded expensive watch.Some cool features as advertised.1. The watch comes with two bands. The bands are adjustable and can fit anyone easily. It also comes with two screen protectors which is impressive.2. Easy to setup and connect with a phone. The message and call feature is super convenient and my favourite.3. Great metal frame gives a sturdy and stylish look.4. Battery life is great, initially i am not using it a lot but it lasts few days and charges super fast.5. There are multiple fitness related features as well, the one i am impressed with is calculating the heart rate which is a great tool for elders to monitor continuously.6. There are several options to select dial display, means you can a new watch everyday with different styles.I am really impressed with all the features and functions for such price as a new user for a smart watch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61lxIaHqERL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pW9SuxOEL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "bclogman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5XCDV6RJD6CFDKQIQFNAGXV4CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V9IVLN7Y8ZP1?ASIN=B0BC9CBV62",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Great for the price.",
                "reviewText": "I wish I could figure out how to make the notifications of text and emails stay on the screen longer. By the time I raise my wrist I have about 1 second to read the notification before it goes away.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPBH65XXB32N4IGRN7SUT5U7HHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AGTKM9RFTJCC?ASIN=B0BC9CBV62",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "My son loves to work out. He says this watch works really great. A gifted it to his brother and now his younger brother is using it. Holds a good charge and has been paired with multiple devices. The boys have had it for a little while now and it still works just like it did when we first got it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6ASFHIER4OSKRJL2DT4WRN6NRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M7VD52GII6C2?ASIN=B0BC9CBV62",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "1.0 out of 5 stars Doesn't last long",
                "reviewText": "Worked great until it didn't. Lasted all of 10 months. Simple to use, cheap price but now it's dead. Easy to get lured in by the price but not a long term item.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jose f.jose f.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDCKB2LXG2ZXK2F3RATYG2U33CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RPO7FDZYX4GC?ASIN=B0BC9CBV62",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2023",
                "reviewTitle": "3.0 out of 5 stars Good smart watch with one flaw and parts missing",
                "reviewText": "Yes this is a good smart watch but to start of as I have gave it 4 star ⭐ then to give it five stars is for one when I receive the order from my Amazon hub locker my package box was cut open with a blade and put upside down as I go to receive it my watch almost felt out of the delivery box I'm very disappointed with that kind of service for one and then after I get my smart watch home I try to charge it and it wasn't working I first thought it was the Wall USB outlet but still wasn't working even so I have tried a few of them and still nothing until I tried the magnetic charger from the second smart watch and then this smart watch started charging that's when I noticed the cable magnetic charger that came with this watch was defective and the second thing about this smart watch is that as you see in my pictures the matel wrist band it supposed to come with a tool in the box and that wasn't in my box not at all and plus the the wrist band didn't come with the pins either.And the most thing I'm disappointed about this smart watch is the speaker 🔊 is so so low you can't not hear it not on phone calls or music 🎶 as the watch works well but speaker sounds so low you have to put it right on ur ear 👂 come paired with the other smart watch I have the speaker is loud so I'm quite surprised so many people giving good reviews to this when I got the bad hand out this service I'm very disappointed for one bad experience with the the delivery.Bad experience with the missing items in the package.Bad experience with a defective magnetic charger.And needs improvement on the speaker.Otherwise good smart watch.Update: now I'm upset as the watch has died on me the screen started acting wierd and then it started flickering like crazy then as I cut it off for a few seconds and turned it back on the whole screen got dark and nothing came back on all I saw was a slight yellow line it was a done deal with this watch I'm so so disappointed 😞 with watch from the beginning I got bad service even the dealership supposed to send me a magnetic charger and they never did I'm so so disappointed the watch and the company needs to improve everything 😞😡",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/616Cv9-H1AL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61L1PmO90uL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arslan SarwarArslan Sarwar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO72GVONFIAK557PVORR5GGVXUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SZFUJNA155JC?ASIN=B0BC9CBV62",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Stainless steel android watch",
                "reviewText": "I received the package in time and intact shape. It contains an extra strip in the box. The strap was easy to attach. Few best things I found in this watch are; stainless steel strap, good battery life, its style looks different from ordinary watches. If we compare its price particularly with leather and stainless steel strap I think it worth its price. I would recommend this watch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61TEZk1My8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61kqiAeH9gL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71L-gQT1b6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pierre DuBose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWNPTSXG5CVA7F5FUFIK4XCJOKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SO5QAMNRN4DR?ASIN=B0BC9CBV62",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "2.0 out of 5 stars It works well for only a few months",
                "reviewText": "It worked well for me for 9 months and didn't work again!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ocampo ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKE26Y7TVT4J4GL4GPZQY2L63IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTDX23F9WACVL?ASIN=B0BC9CBV62",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Garantizado",
                "reviewText": "Muy buena calidad excelente lo recomiendo esta súper bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}