{
    "remaining_requests": 48242,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsung-Frontier-Smartwatch-Bluetooth-SM-R760NDAAXAR/dp/B01M7MDK5S",
    "body": {
        "name": "SAMSUNG Gear S3 Frontier Smartwatch Pedometer (Bluetooth), SM-R760NDAAXAR",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Samsung-Frontier-Smartwatch-Bluetooth-SM-R760NDAAXAR/dp/B01M7MDK5S",
        "soldBy": {
            "sellerID": "A39YHAI3NCE75F",
            "name": "Celltraders",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A39YHAI3NCE75F"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07T221JPC"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/519UqgqEQwL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/516y6ndXujL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/9d5d8a43-fa6c-5061-b5fd-a3072d1b5560/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98d84489-61ec-45e1-bd47-278d008c4692/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46e8a95f-fa2d-42dc-9135-adf7b4299bb0/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71W3sF2HvVS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1ouJPjjBzS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the SAMSUNG Store",
            "link": "https://www.amazon.com/stores/Samsung%C2%AE/page/F50AFABA-4CDE-4A95-84D0-CA4C61819FEB?ref_=ast_bln"
        },
        "brand": "Samsung®",
        "merchantInfo": "Celltraders",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 9059,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A distinctive steel bezel that you can rotate to access apps and notifications, strap with buckle: 2.76 inches, large strap with holes: 5.12 inches, small strap with holes: 4.33 inches",
            "Text, call and get notifications directly from your watch through your bluetooth connected smartwatch. Battery charging method - Wireless charging dock",
            "Make payments with Samsung pay almost anywhere you swipe or tap a credit card; Battery type and Size: 380mAh Li ion",
            "With military grade performance, the Gear S3 resists water, dust, extreme temperatures and the occasional drop; Typical usage: Up to 3 days",
            "Compatible with Android and iOS smartphones (compatible with select Bluetooth capable smartphones using Android OS 4.4 and later with at least 1.5GB RAM as well as iPhone 5 and later with iOS 9.0 and above; Gear S3 supported smartphones may vary by carrier and device; For a list of compatible smartphones and features"
        ],
        "description": "Stay in touch, without reaching for your phone (1), with the smartwatch that's engineered for adventure. With the Gear S3, you can pay right from your wrist, track your location, and withstand any weather (2). Enhanced Connectivity: The Gear S3 is Bluetooth connected (1), so you can receive texts, emails, and alerts without reaching for your phone. With a built-in speaker and microphone, you can also make and answer calls hands-free.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1/000-0000000-8675309?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2/000-0000000-8675309?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3/000-0000000-8675309?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Activity Tracker, Heart Rate Monitor, Sleep Monitor, Touchscreen, Alarm Clock, GPS, Pedometer"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            },
            {
                "name": "Compatible Phone Models",
                "value": "Samsung Galaxy S3"
            },
            {
                "name": "OS",
                "value": "Android Smartphones (Compatible with Android 4.4 and up, 1.5GB RAM and higher)"
            },
            {
                "name": "Water Resistance Level",
                "value": "Water Resistant"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "4 GB"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Supported Application",
                "value": "Pedometer"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "1.5 GB"
            },
            {
                "name": "Battery Cell Composition",
                "value": "Lithium Ion"
            },
            {
                "name": "Battery Power",
                "value": "380 Milliamp Hours"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Wireless Carrier",
                "value": "Go Mobile"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "802.11n, 802.11b, 802.11g"
            },
            {
                "name": "Screen Size",
                "value": "46"
            },
            {
                "name": "Display Type",
                "value": "AMOLED"
            },
            {
                "name": "Case Material",
                "value": "steel"
            },
            {
                "name": "Warranty Description",
                "value": "SM-R760NDAAXAR"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 9,059 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#30,738 in Electronics (See Top 100 in Electronics) #796 in Smartwatches"
            },
            {
                "name": "Brand",
                "value": "SAMSUNG"
            },
            {
                "name": "Model Name",
                "value": "gear"
            },
            {
                "name": "Target Audience",
                "value": "Unisex Adult"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Model Number",
                "value": "SM-R760NDAAXAR"
            },
            {
                "name": "Whats in the box",
                "value": "charger, watch"
            },
            {
                "name": "Target Gender",
                "value": "Unisex"
            },
            {
                "name": "Weight",
                "value": "2.24 Ounces"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "1.81 x 1.93 x 0.51 inches"
            },
            {
                "name": "Style",
                "value": "US Version"
            },
            {
                "name": "Color",
                "value": "Dark Grey"
            },
            {
                "name": "Shape",
                "value": "Round"
            },
            {
                "name": "Band Color",
                "value": "black"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "At a Glance: Text, call, and get notifications directly from your Bluetooth connected watch. Make payments with Samsung Pay almost anywhere you can swipe or tap a credit card. The built-in GPS keeps track of your activity and makes it easy to share your location. With military-grade performance, the Gear S3 resists water, dust, extreme temperatures, and the occasional drop. Samsung Gear S3 frontier Stay in touch, without reaching for your phone, with the smartwatch that’s engineered for adventure. With the Gear S3, you can pay right from your wrist, track your location, and withstand any weather . Additional Features: Rotate the distinctive steel bezel to easily access apps and notifications. Go nonstop for days on a single charge and recharge on the wireless charger. With the built-in S Health app, track your steps, monitor your heart rate, and more. Access the apps you use every day on your Gear S3. Make it your own by customizing your watch face and swapping out the standard 22mm band. Samsung Gear S3 is compatible with both Android and iOS smartphones.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/5c1faa37-e08d-4612-972e-a1c21042eda0._CR0,0,300,400_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/514377ec-ff36-40be-a0e6-b42643975509._CR0,0,350,175_PT0_SX350__.png"
                ]
            },
            {
                "media_text": "Never Miss A Moment The Gear S3 is Bluetooth connected, so you can receive texts, emails, and alerts without reaching for your phone. With a built-in speaker and microphone, you can also make and answer calls hands-free. Leave Your Wallet Behind Pack light for your next adventure. With Samsung Pay on your Gear S3, you can easily make payments with your watch almost anywhere you can swipe or tap a credit card—even without your phone or wallet. Get Out There Whether you’re off-roading or exploring a new city, the built-in GPS tracks your activity and makes it easy to share your location. Designed For The Elements The military-grade Gear S3 is tough enough to handle the elements. It resists water, dust, extreme temperatures, and the occasional drop so you can venture out with confidence.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/cae8f2af-41ac-4871-8e2b-5c797bec184f._CR0,0,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/8a8cc4b1-7512-43ea-ad2f-f6e86296d459._CR20,0,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/92d003dc-f268-4d39-b690-67f5b13a5db0._CR0,0,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/4c8c3dbe-f7b7-4c30-9087-7673a9082fd7._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Access Apps In An Instant Rotate the distinctive steel bezel to easily access apps and notifications so you can instantly check texts, updates, and more. Power On Go nonstop for days on a single charge. When it’s time to recharge, the wireless charger lets you power up without slowing down. Track Your Fitness With the built-in S Health app, track your steps, monitor your heart rate, and more. Set goals, post results, and check leaderboards to see how you stack up. Apps At Your Command Access the apps you use every day on your Gear S3. Catch a ride, check scores, stream music, and more.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/71e2d699-220a-46c4-8126-ccf9b47e1817._CR0,4,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/7e17cea7-4cdd-41c3-b48a-67c114a3714c._CR0,0,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/eb476c4f-d728-4b1f-a30f-f7081692d713._CR0,0,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/be8a9459-109f-45a4-83a8-2103b4cbaf0c._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Tailored to you Make the Gear S3 your own. Customize your watch face, choosing from thousands of striking colors and designs. Plus easily swap out the standard 22mm band. Android and iOS Compatible: Connect your Samsung Gear S3 with both Android and iOS smartphones. Pair your smartwatch via Bluetooth using the Samsung Gear companion app to see where the freedom of Samsung Gear S3 can take you. Samsung Gear S3 (Bluetooth) is a companion device for compatible Android and iOS smartphones, sold separately. Full connectivity functionality requires Bluetooth pairing to a wireless network-connected phone. Some features are not available on iOS smartphones. Visit Samsung's official website for details. For best results, Samsung Pay on Gear S3 requires network connection through LTE, Wi-Fi or via Bluetooth pairing with compatible smartphone. After Initial setup, Samsung Pay on Gear S3 can make at least five transactions without reconnecting to a network. Samsung Pay on the Gear S3 is only compatible with select cards, carriers and Android smartphones.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/77066110-014c-4b84-83bc-7ae48e03f1cd._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/01545b3a-44cd-4a4f-b45a-6eb6516b86cd._CR0,0,970,300_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/5c1faa37-e08d-4612-972e-a1c21042eda0._CR0,0,300,400_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/514377ec-ff36-40be-a0e6-b42643975509._CR0,0,350,175_PT0_SX350__.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/cae8f2af-41ac-4871-8e2b-5c797bec184f._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/8a8cc4b1-7512-43ea-ad2f-f6e86296d459._CR20,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/92d003dc-f268-4d39-b690-67f5b13a5db0._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/4c8c3dbe-f7b7-4c30-9087-7673a9082fd7._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/71e2d699-220a-46c4-8126-ccf9b47e1817._CR0,4,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/7e17cea7-4cdd-41c3-b48a-67c114a3714c._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/eb476c4f-d728-4b1f-a30f-f7081692d713._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/be8a9459-109f-45a4-83a8-2103b4cbaf0c._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/77066110-014c-4b84-83bc-7ae48e03f1cd._CR0,0,300,300_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Elizabeth B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAILG4BQZAOUJG3J3O7OOJOQRPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LQGNBDLR2PQ9?ASIN=B01M7MDK5S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2018",
                "reviewTitle": "5.0 out of 5 stars I LOVE my Gear S3 Frontier!!!",
                "reviewText": "UPDATE: 8\\12\\19I just wanted to come back and report that my original Gear S3 is still going strong and that I ended up giving it to my Mom who is still using it without any issue. I loved my bluetooth version so much that I purchased another one off of Ebay for a mere $100.00! This was probably 8 or 9 months ago and it is the AT and T version and it was used in like new condition. I do not use the LTE, I continue to use it as a bluetooth device only and it works flawlessly!! Samsung really hit it out of the park with the Gear S3 Frontier. I can still get 2 and a half days out of it and it is running the latest software. I can not no comment on the current versions of these watches but if The Gear S3 Frontier is any indication, I'd say get one if you want a smartwatch!First off, this is my review for my Bluetooth Only model Gear S3 Frontier running Tizen 3.0.0.1 that I purchased here on Amazon from the seller Ocean Reef Electronics.I am using a Nexus 6P running Nougat 7.1.2. Now, on with the review!UPDATE: Had a defect with the used 6P that I purchased so I returned it and am now using a Motorola X Pure Edition and I must say, battery life is even BETTER!! I guess it's the better radios in Motorola devices, so my watch isn't working as hard to maintain a connection maybe? I'm not sure but it has greatly improved my battery life. It used to be down to about 55% to 58% when I'd go to charge it the next day, now it's still at at a good solid 78% charge.*NOTE: Just a suggestion but after having issues with my Fitbit Blaze failing after a year and one month due to the thin layer of film on the back cracking from sweat and causing the battery to overheat and the tracker to die, I decided to put a tempered glass screen protector on the display AND the back panel of my Gear S3 Frontier. Some folks seem to be having the same issue with their S3's that I had with my Blaze and I'm hoping that the additional protective layer will keep my Gear S3 Frontier from suffering the same fate. You may also want to add one as well if you have not already. Just wanted to throw that in there. Now back to the review! I absolutely LOVE LOVE L-O-V-E LOVE this watch!!! First off, I am one of those people who thought smartwatches were just a gimmick to get people to spend money needlessly. The reason I purchased this watch is because I got mad at Fitbit LOL! Seriously. I bought a Fitbit Blaze a year and a month ago and one silly little flimsy piece wore out (because of poor quality material used) and instead of letting me use my offered 50% discount towards a new model tracker that has addressed the admitted material issue, they told me I could either get a free replacement Blaze Pebble (the tracker without the straps) pay them for a new Blaze or pay them for a model that was inferior to my Blaze. Instead, I went with a free Blaze Pebble, and while I was waiting for it to arrive I came here on Amazon to look at smartwatches. I ended up going with the Gear S3 Frontier and I am SO glad I did!!PROS:I live in the boonies and connection is spotty in my house so what can I do now? I can leave my phone in the living room where I get good signal and walk around the rest of my small house and still receive notifications, text messages, and make and receive phone calls over bluetooth ON MY WATCH!!! I know some folks say the fun of this wears off quickly but because of the poor reception on my phone, it has been an absolute Godsend to be able to leave my phone in a good reception location and still make and receive phone calls and get notifications on my watch. The sound quality is exactly that of my phone on speaker. I use this feature almost exclusively when I'm at home. I don't have bluetooth in my car so I use an output jack in my car and while I don't talk on my watch in the car very often, I do use the controls on my watch to answer calls that go to my phone so I do not have to reach down and get my phone to answer calls. It is so much easier to swipe to answer on my wrist while driving.MUSIC I easily figured out how to transfer music from my phone to my watch and I have had no trouble listening to the songs on my watch, both through the built in speaker and by way of bluetooth earbuds without any trouble. I also have no trouble with using the music controls on my watch to control the music player on my phone and I love how quick and easy it is to switch sources right there on the watch screen. Now, I've only tested this in the house. The true test will be when I'm outside mowing grass and I have my phone wrapped in a bandana in my pocket. I imagine it will work just fine but I've not been out to mow since I've gotten my watch. It's so nice, I'm not even sure I'm going to use it while mowing.UPDATE 10/2/18 I have had many opportunities to use the music controls in and outside the house and they work brilliantly! I am able to use the watch to control the music that I have stored on my watch AND I can also use my watch to control my playlist if I am listening to music that is stored on my phone. Infact you can go back and forth between the two immediately, right there on the watch. I had RF ablations done on the right and left side of my back and both times I went for the procedure, the surgeon and his staff had my play the music on my watch! The first time internet was down and they couldn't access Pandora and I had left my phone out in the waiting room with family so I volunteered to play music out loud that I have stored on my watch. They were all blown away lol! So much so that when I went back a few weeks later for the procedure to be done on the other side of my back, the surgeon said, where's that awesome watch, I want you to use it again to play music! I thought that was funny. :-DSOS: I have not had a chance to actually try this out but I do have emergency contacts plugged in and I am happy to know I can use my watch to ring for help if my phone is out of reach.CUSTOMIZATION: I love just how customizable this watch is. Everything is so easy to replace or customize. The bands are easy to replace, the watch faces are easy to change and customize. I use the Gear store as well as the Facer app and while you can pay for your watchfaces, there are so MANY free ones that I can't see myself ever needing to shell out money for new watchfaces. I even purchased some Awinner brand rubber body guards to not only add a layer of protection to my watch, but also allow me to change up the colors of my watch. I like how I can use one of my songs as a ringtone or notification tone and how it give me an option to start the song from the beginning, or where the song becomes enthusiastic, if that is where I would prefer my ringtone to start.UPDATE 10/2/18 This is an update about the Awinner colored protectors, not the watch watch itself. I mentioned above that I use the Awinner frame covers not only to change the look of my watch, but to protect my watch during periods of high activity but I stopped using them for that purpose because sweat was collecting under the rubber. After 3 or 4 hours of pushmowing the yard, I'd come in and take the frame off and there would be alot of sweat pooled on the inside of the rubber, so much so that I became worried it would cause sweat damage to my watch so now I use the colored frame covers for asthetics only. Right now I'm wearing a gray and black stripped nylon band with the white colored Awinner rubber frame protector and it's kind of looks like I'm wearing Jack Skellington on my wrist! I get a chuckle everytime I get a glimpse of my watch on my wrist, besides it is October right now as I type this lol.FITNESS FEATURES: Ok let me first start off by saying I am not a super fitnessy person. With that said, I think this watch blows my Fitbit Blaze out of the water with it's fitness capabilities. While I have had a chance to wear both my Blaze and my Gear S3 Frontier at the same time to try and do a comparison, the comparison could not be perfectly accurate because I had my watch on my right wrist and my fitbit on my left. The first time I tested it, of course the watch logged about 600 more steps than my fitbit blaze did, but I think that's because I had the watch on my dominant hand and so far as I can tell, there is no way to adjust that setting like you can on a Fitbit. So what I ended up doing is the next day, I wore the watch on my less dominant hand and the fitbit on my more dominant hand and this time the Fitbit was logging more steps, so I have come to the conclusion, that atleast when it comes to the Blaze and the Gear S3 Frontier, the step count is roughly the same and definitely more accurate if you wear it on your non-dominant hand.Another fitness feature I love is the \"get up and move\" nudges! These are AWESOME because they aren't just nudges to get up and take some steps, it actually gives you an option to perform one of three preloaded exercises. \"Twist\", which is locking your fingers together, pushing your arms straight out in front of you and twisting from left to right. There is \"Reach Up\" where you do your arms the same but you go up and down instead of side to side. Then there are \"squats\" where you cross your arms across your chest and push your elbows out and squat down. Or if you don't want to do those options and you'd rather just get up and walk around you can do that too. The only thing I do wish, is that it would keep counting after I do the initial 5 reps. It is neat how it counts them down four you but it only counts 5 and then the screen goes back to the homescreen even if you keep doing the reps. It would be nice to have a bit of continued on screen encouragement from the watch.UPDATE 10/2/18:I still love the watch for fitness BUT Fitbit really is on to something with their 250 steps an hour goal reminders per hour because while the move reminders are nice what with having onscreen choices for other activities besides walking, I REALLY wish it were more like the 250 steps an hour that Fitbit has going on their trackers. I wish I could customize and hourly goal or even have the same set hourly goal like Fitbit and get reminders and incouragement that keeps you going for more than 5 counts. I NEED that motivation lol! Unfortunately the fitness aspects of the watch are not quite as motivating as I would like for them to be. I still prefer it for the build quality, over anything Fitbit has to offer though but I really do wish they would update their fitness software to better compete with Fitbit's. I don't even need the SHealth app to be like the Fitbit community, I just want the tracker software to be more like that of Fitbit's tracking software with the hourly nudges and onscreen encouragement.HEART RATE SENSOR: The heart rate sensor on my watch performs about as accurate as the one on my Blaze did and both where in a few beats of the heart rate sensor I use on the nursing unit where I work.FIND MY PHONE/GEAR: YEAH!!! It is so nice to finally have a way to find my phone when I've set it down somewhere and I can not remember where lol!UPDATE 10/2/18 I use the find my phone/ gear feature ALL THE TIME!! I mean, the frustration I have saved (alone) has made this watch worth it to me lol!BATTERY LIFE: I work at night so I charge my watch before I go to bed during the day so that it can be fully charged by the time I go to bed. This allows me to leave my phone in my living room and still go to bed being able to make and received calls. My battery could probably last me a good two and 1/2 days with the way I have mine set up but I chose to charge it everyday an hour or so before I go to bed. I usually get down to 48 to 53% after a 24 hour period which is quite acceptable to me considering all my watch does. UPDATE: as I stated at the top, I switched to a motorola device and now my battery is at a solid 78% battery life after a 24 hour period the way I have it set up.CONS:I only really have one and if they fixed it this watch would be 100% perfect to me and that is the notifications. If you receive a series of notifications from the same source, messaging, facebook messenger, etc, you only see the latest one that was sent to you so if you are asleep or somehow don't notice you've received a message, when you open your notifications on your watch, it will only show you the last response sent to you and none of the previous ones which is probably the silliest think ever. It's not a huge deal for me because I really do not have contact with very many people but if you use your phone for business or you are very social, this is going to bug the heck out of you.All in all this watch is AMAZING!!!! Easily the best electronical purchase I have ever made and I have absolutely zero regrets so far.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RickFlist",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMHMZ6ENAH2SZRBC6PYGBXNB2PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GP4SVWGWD4TO?ASIN=B01M7MDK5S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 25, 2017",
                "reviewTitle": "5.0 out of 5 stars Disappointing at First, Amazing Later",
                "reviewText": "Note: I have a Samsung Note 5, and that is the phone this watch was used with.I did a ton of research before buying my first smart watch about 6 months ago. Before I purchased this, I did some cursory research and found the Gear S3 was still pretty great, despite newcomers to the market, so I purchased it.When I first got the watch, I was so excited. I put it on and paired it and was super impressed with the exceptionally well designed and responsive UI. Using the bezel to control the watch is a stroke of pure genius, honestly. Despite the small area of the physical face of the watch, and how very tiny the icons on it are, I was pleasantly surprised to find that I was able to easily and without error interact with the small icons.Then came the disappointment.The app store for the Gear is exceptionally anemic, primarily consisting of watch faces and applications that are very niche. There is no Gear support for Pandora, or Audible. Absolutely no Google apps are available for it. No Google Now. No Google Maps (although there is a well-designed app available in the store that uses Google Maps for like $2). No Android Pay. No Gmail. Nothing. The Spotify app is pretty nice, but for some reason I can't select Spotify Radio stations in it, only playlists. I was exceptionally disappointed as I have based everything in Google. Pretty much, the only apps that are really any good are from Samsung. This was a further disappointment as Samsung apps are usually fat and offensively slow.I contemplated returning it in favor of a Huwaii or a LG Watch Sport, but I figured I'd give it a few days. The interface is just SO well made. It is very responsive. The Samsung apps actually aren't crap this time, and they covered most of the use cases I have for my watch. So I gave it a few days.This is the part where the 5 stars come in.After using it for a few days and acquainting myself with it's various idiosyncrasies, I began to realize that all I actually need for it are the Samsung apps. It *would* be nice if there were apps from Pandora and Audible and CityMapper and Moovit and it supported Google Now, but it doesn't and that is actually a very workable scenario.The watch allows me to control my phone, basically, without taking it out of my pocket. So while I'm on the bus, if I swipe down on the watch face and hit the music note icon, I can control all aspects of the playback on my phone from the watch. Rewind, fast forward, pause, change the volume, change tracks, all of it. The altimeter is very accurate. I can create reminders and appointments right on the watch face. It displays the weather and my agenda using very will designed UIs. With a tap, I can zoom in on the weather and agenda to get more information, and I can plot the route to an appointment, if I included location information in the calendar item (although you have to open the phone to see the route). There is an Uber app for the watch that makes it very easy to call a cab.Finally, the watchfaces. Yes, they do get their own section because they are varied and amazing. Personally, I love the PipBoy Fallout 4 watch face. It displays an amazing amount of information using the interface of one of my favorite games. This watch face displays the following information, but you can find probably another 100 that do the same in zany and creative ways: Time, Date, Heartrate, Water Consumption, Coffee Consumption, Battery Level, Step Count, plus shortcuts to Music and Pictures, Samsung Health Daily Review, Alarms and Calendar. I wish the PipBoy interface showed the temperature, because if it did it would be on there too.Now, for the downsides, and there are some doozies.1) Samsung Pay does not work on my phone because I enabled the Samsung-provided Knox feature. I later disabled it because I didn't like it. But you know what that did? It flipped flag on my phone that disables Samsung Pay. The Gear only works with Samsung Pay. Let me repeat that - A Samsung supplied feature, Knox, disables Samsung Pay, because it flips the flag that says the device has been rooted. You are probably thinking \"OK, so I contact Samsung support and they fix it, right?\" Nope. Samsung has no way to flip this flag back. They designed Knox in such a way that it makes your phone think it has been rooted, and they have no way to fix it if Knox is later disabled. That is exceptionally stupid. I am an engineer. I am aghast to think of the internal processes at Samsung that allowed a feature to be released into the wild that breaks your phone and does not supply a fix. It requires a monumental level of dysfunction for that to happen.2) You are limited to the Samsung ecosystem. So if you don't like Samsung mail, too bad. No other mail client available. Don't like Samsung Pay? Too bad. No other option available. Etc.3) If Samsung Mail is enabled, and it is connected to a company mail server that requires the watch to be encrypted to view mail, you will have to type in a pin just to check the time. Yup, you read that right. Want to just check the time really quick? Nope! You gotta type in your password first. Again, as an engineer, how does that get through focus testing without any developer hearing a customer say \"that is amazingly stupid\". How does a developer, in their OWN DEVELOPMENT of the software, not get tired of typing in their password to check the time? It's amazing.4) When you make the motion typical of checking the time on a watch, the watch face is supposed to light up automatically. I've found this to be rather untrue. I've found that it pretty much doesn't work unless you are moving your hand from a stationary position, such as standing at a bus stop or sitting at your desk. If your hand is in motion it doesn't seem to recognize the motion to look at it, despite the rather unique motion of rotating the wrist. That is a very unique movement, and I noticed that this does not happen to a friend who has the Apple watch. It seems to actually be keyed on the wrist flip to turn on, as it turns on in a movie theatre when you place your hands behind your head.In summary, great watch despite the lack of app support",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AWEL MOHAMMED",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 21, 2021",
                "reviewTitle": "andere SmartWatch ich bouch",
                "reviewText": "Das Gerät ist nicht gut das kaputt gegangen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOSE ANTONIO CAMPOS FLORESJOSE ANTONIO CAMPOS FLORES",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 11, 2019",
                "reviewTitle": "Sin duda la mejor compra",
                "reviewText": "Me gusto esperaba alguna mala experiencia pero al final me fusto mucho súper original con todo y su estuche nada más que si el cargador es tipo europeo pero con un adaptador se arregla,no duden es buen producto!!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61n7OndEK7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shashikant Handore",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 3, 2019",
                "reviewTitle": "Superb !",
                "reviewText": "Just awesome watch ! Great deal in 17 k !!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Connor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 25, 2017",
                "reviewTitle": "Fantastic. Lots of support",
                "reviewText": "Fantastic. Lots of support, no problems with Bluetooth or WiFi connectivity, good battery if you don't have Always On for the face active, somewhere around 3 days. Very usable and pretty interface. A little bulky but not much bulkier than a medium size mans watch. I would personally recommend getting a metal watch strap if you're like me and find that plastic type bands irritate. Pricey, but I've had it for a year now and it has had no problems with charging and no damage apart from barely noticeable scratches on the bezel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Omar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 1, 2017",
                "reviewTitle": "Perfecto",
                "reviewText": "Todo estuvo excelente, llegó antes de lo estimado, venía perfectamente sellado y empaquetado. El reloj funciona perfecto, ideal para no sacar el celular en la calle.Actualizacion 17/10/2020A casi tres años de mi compra puedo decir que no estoy arrepentido de nada, el reloj continúa como el primer día que lo adquirí. Cabe mencionar que originalmente venía con una correa como de goma, como al año y medio comencé a notar que tenía un desgaste considerable, sin que esta llegase a romperse, así que le compre una correa metálica y aparte de verse más elegante, es súper resistente. En resumen el reloj nunca me ha fallado, la batería es duradera, aproximadamente dos días y medio, solo que tengan cuidado si lo llevan a la playa, ya que los granos de arena se atoran dentro del altavoz y del micrófono del reloj, pero nada que una limpieza con aire comprimido no solucione.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}