{
    "remaining_requests": 48413,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsung-Gear-S2-Smartwatch-Dark/dp/B015JQ62RY",
    "body": {
        "name": "Samsung Gear S2 Smartwatch - Dark Gray",
        "price": "$99.60$86.97",
        "originalPrice": "$119.60",
        "rawPrice": 99.6,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samsung-Gear-S2-Smartwatch-Dark/dp/B015JQ62RY",
        "soldBy": {
            "sellerID": "A122NEKMYVAI1X",
            "name": "JMBO Sales (Fast shipping)",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A122NEKMYVAI1X&asin=B015JQ62RY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0163JVYEW"
        ],
        "asinVariationValues": [
            {
                "asin": "B015JQ62RY",
                "variationName": "Color",
                "variationValue": "Dark Gray",
                "price": "$99.60",
                "variationImageURL": "https://m.media-amazon.com/images/I/41TZQM+ElQL._SS36_.jpg"
            },
            {
                "asin": "B015JQ61JS",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "$99.97",
                "variationImageURL": "https://m.media-amazon.com/images/I/41hfFIg2gEL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41TZQM ElQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/6160w2axpML.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/ce3a09f3-47b3-5b87-95e0-79eb296770a6/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71w1X4iGSbS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1TViEhIzDL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the SAMSUNG Store",
            "link": "https://www.amazon.com/stores/Samsung%C2%AE/page/F50AFABA-4CDE-4A95-84D0-CA4C61819FEB?ref_=ast_bln"
        },
        "brand": "Samsung®",
        "merchantInfo": "Ships from and sold by Networkstore.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 3132,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 6 hrs 32 mins",
            "FREE delivery Wednesday, February 21.",
            "Or fastest delivery Tuesday, February 13. Order within 19 hrs 32 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Send and receive texts, calendar notifications, news updates and more right on your wrist and Battery performance may vary depending on network conditions and configuration, and device usage",
            "With rotating bezel and unique circular interface, easily access your apps and notifications.OS Tizen based wearable platform.Processor speed Dual core 1GHz exynos 3250",
            "With a circular design and stainless steel construction, the Gear S2 matches your style",
            "Thousands of third party apps available",
            "Interchangeable bands and hundreds of available watch faces; Please refer the User Manual before use; It doesn't have speakers, hence use Level U bluetooth headphones to hear music"
        ],
        "description": "With elegant curves and premium finishes, the Samsung Gear S2 will turn heads. The circular interface and rotating bezel give you effortless navigation, so you can quickly access the things that are most important to you. This intuitive interface lets you easily access important notifications, texts, and updates from your phone with just a glance at your wrist. The built-in S-Health app tracks your steps, your heart rate, and even gives you a nudge when it’s time to get moving. And with built-in wireless charging, it’s easy to keep the Gear S2 powered up. Whether you’re at home, work or anywhere in between, you can power up by simply setting your Gear S2 on the included wireless charging dock. Plus, with easily customizable watch faces, you can customize the Gear S2 to fit your unique style. With powerful capabilities and sleek looks, the Gear S2 will help you get the most out of your day.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "GPS"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            },
            {
                "name": "OS",
                "value": "android"
            },
            {
                "name": "Water Resistance Level",
                "value": "Waterproof"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "4 GB"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Supported Application",
                "value": "Time Display, text_messaging, Email, Social Media, Calendar, Pedometer, Heart Rate Monitor"
            },
            {
                "name": "Controller Type",
                "value": "Smarthand Control"
            },
            {
                "name": "Band Width",
                "value": "20 Millimeters"
            },
            {
                "name": "Clasp Type",
                "value": "buckle"
            },
            {
                "name": "Battery Life",
                "value": "72 Hours"
            },
            {
                "name": "Battery Cell Composition",
                "value": "Lithium Ion"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "Bluetooth"
            },
            {
                "name": "Screen Size",
                "value": "1.2"
            },
            {
                "name": "Display Type",
                "value": "AMOLED, Touch Display"
            },
            {
                "name": "Style",
                "value": "US Version"
            },
            {
                "name": "Color",
                "value": "Dark Gray"
            },
            {
                "name": "Shape",
                "value": "Round"
            },
            {
                "name": "Band Color",
                "value": "black"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 3,132 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#85,289 in Electronics (See Top 100 in Electronics) #1,876 in Smartwatches"
            },
            {
                "name": "Brand",
                "value": "SAMSUNG"
            },
            {
                "name": "Model Name",
                "value": "S2"
            },
            {
                "name": "Target Audience",
                "value": "Unisex Adult"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Model Number",
                "value": "SM-R730"
            },
            {
                "name": "Whats in the box",
                "value": "B015JQ62RY"
            },
            {
                "name": "Target Gender",
                "value": "Unisex"
            },
            {
                "name": "Band Material Type",
                "value": "Silicone"
            },
            {
                "name": "Case Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Weight",
                "value": "0.8 Ounces"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "1.96 x 1.67 x 0.45 inches"
            },
            {
                "name": "Warranty Description",
                "value": "1 year standard parts and labor"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Gear S2 What's in the Box: Samsung Gear S2 Watch strap (large size) Additional watch strap (small size) Travel adapter Wireless charging dock Quick start guide Samsung Gear S2, Bluetooth (Dark Gray) Featuring a circular design with a rotating navigation bezel, the Samsung Gear S2 smartwatch provides quick and easy access to notifications, apps, and widgets. Track your fitness, check sports scores, skim restaurant reviews, and more. The Gear S2 is compatible with most Android and iOS devices (1) so you can sync your devices and get more out of every moment of your day. At a Glance: Circular touchscreen and rotational bezel navigation Customizable watch faces (3) Samsung Gear S2 is compatible with both Android and iOS smartphones (1) Get calendar notifications, texts, and news from your phone right on your wrist (2) Wireless charging dock included Built-in fitness tracking",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/5b372f54-be5f-4538-96d6-860e2c6046d7._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/dda7f1a3-9534-4666-9599-c58158a3eb21._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "Circular Interface Offers Effortless Navigation The Samsung Gear S2 gives you access to all your important information in a circular design. Easily locate your favorite apps around the perimeter and just rotate the bezel to navigate through your notifications, apps, and widgets. The 360 x 360 pixel AMOLED touchscreen of the Gear S2 offers crisp images and sharp text on a compact 1.2-inch display. Customizable Modern Design Featuring elegant curves and premium finishes, the Samsung Gear S2 is as stylish as it is functional. You can personalize your Samsung Gear S2 with customizable faces (3) to create a smartwatch that is uniquely your own. Android and iOS Compatible Connect your Samsung Gear S2 with both Android and iOS smartphones (1). Pair your Samsung Gear S2 via Bluetooth using the Samsung Gear companion app to see where the freedom of Samsung Gear wearables can take you. The Samsung Gear S2 also offers 4 GB of internal storage, built-in Bluetooth 4.1 and 802.11 b/g/n Wi-Fi, and a dual core 1.0 GHz processor for a fast and responsive operating system.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/c7bf7f49-d17c-417c-838e-d2bfdcad0f09._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/4e92eba0-c377-46fc-9a04-47581163c922._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/87aedba8-8dec-4142-a0d9-ed512f18c59b._SL300__.jpg"
                ]
            },
            {
                "media_text": "Easy Access to Notifications and Apps With the Samsung Gear S2, you can receive notifications from your smartphone without having to take the phone out of your pocket (2). You can have calendar notifications, texts, or even news and sports updates right on your wrist with a glance. Convenient Wireless Charging Dock Enjoy convenient built-in wireless charging with the Samsung Gear S2. Simply place your Samsung Gear S2 on the included wireless charging dock to power up. Track Fitness Goals and Stay Motivated with S Health The Samsung Gear S2 offers several built-in features to help you keep track of your daily activity levels and meet your exercise goals. The included S Health app lets you enter and track dietary concerns such as calorie, water, and caffeine intake and utilizes the watch's accelerometer, gyroscope, barometer, and heart rate monitor to track your activity. You can even set notifications to warn you if you have been inactive for too long. Durable Design is Ready for the Demands of Your Day Made of durable stainless steel and scratch-resistant Gorilla Glass, the Samsung Gear S2 is designed for daily use. The Gear S2 is IP68 rated to withstand dust and water and is also sweat resistant, so you can get the most out of your workouts and confidently wear the Gear S2 to the gym and work.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/bf649b4c-6800-4375-86c7-c08ecf014211._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/70f7ac11-9a33-41d9-825d-87e583a3468e._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/8c2c79fa-0dda-480c-abb8-6d930d57b694._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/7ed67722-a1ea-4ac9-ad61-bf491acabf3b._SL220__.jpg"
                ]
            },
            {
                "media_text": "Legal Disclaimers (1) Compatible with select Bluetooth capable smartphones using Android OS 4.4 and later with at least 1.5GB RAM as well as iPhone 5 and later with iOS 9.0 and above. Not all features available with iOS paired smartphones. Gear S2 supported smartphones may vary by carrier and device. For a list of compatible smartphones and features, please visit samsung's official website. For best results, connect with compatible Samsung Galaxy smartphones. (2) Some apps not available on iOS smartphones. Visit Samsung's official site for details. (3) Bands sold separately. Some watch faces are not available on iOS smartphones.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/c3b646d4-276e-4bb7-9c7f-04643fb1a0ea._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/dc20118b-9f02-4451-bad7-7bfaf64e0a52._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/5b372f54-be5f-4538-96d6-860e2c6046d7._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/dda7f1a3-9534-4666-9599-c58158a3eb21._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/c7bf7f49-d17c-417c-838e-d2bfdcad0f09._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/4e92eba0-c377-46fc-9a04-47581163c922._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/87aedba8-8dec-4142-a0d9-ed512f18c59b._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/bf649b4c-6800-4375-86c7-c08ecf014211._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/70f7ac11-9a33-41d9-825d-87e583a3468e._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/8c2c79fa-0dda-480c-abb8-6d930d57b694._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/7ed67722-a1ea-4ac9-ad61-bf491acabf3b._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/c3b646d4-276e-4bb7-9c7f-04643fb1a0ea._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jouten",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQQKW5RXX67PJ5TFYI5ACO2CO5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WV0GWOXOZB08?ASIN=B015JQ62RY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2015",
                "reviewTitle": "5.0 out of 5 stars If you're not impressed with Apple Watch or Android Wear, give this watch a shot.",
                "reviewText": "I currently have this and the Apple Watch. I own an iPhone 6 Plus and a Galaxy Note 5.At this time, I currently prefer this watch over my Apple Watch.It has way more customization options.It presents data in a clear and concise manner. Any app I choose to receive notifications from, it does so in a very clean and easy to use interface.S-voice on phones and tablets seem to be sub-par compared to Google Now and Siri; but on this watch, it satisfactorily fulfills its functions as needed.Compared to my Apple Watch, it is very light. This makes it easy to wear all day. With my Apple Watch, I can't wait to take it off at the end of the day. This watch, I have to remember to take it off at the end of the day.I may buy the 'Classic' version of this watch with the cellular radio inside it, but I'm not sure how much that will be needed since this watch performs all of the functions I need without it. However, the 3G version of this watch appears to be bigger so I may not:DimensionBT 42.3 x 49.8 x 11.4 mmBT classic 39.9 x 43.6 x 11.4 mm3G 44.0 x 51.8 x 13.4 mm(information obtained from Samsung's official website for the Gear S2)The bezel is a great dual function feature. Not only does it allow fast and easy navigation through the watch's interface (Tizen OS), but it already has paid itself off by protecting my watch screen from damage since the bezel is a 'lip' around the watch's screen. My Apple Watch screen already has dings and scratches on it, but not on the S2 because the bezel helps protect the Gear S2's screen. This is a big plus for me since I always seem to like to take tight turns around corners while I'm walking and always seem to somehow bang my watch against the corners of walls, doors, etc.The only thing I can see that might turn people off from this watch is the band may 'feel' cheap. But rest assured it is not. It is very light and yet durable enough for the rigors of 'normal' daily life. I'm not an avid sports activity type of person, so I cannot vouch for it on that level. For me I do a lot of walking and hiking. There's not much 'contact' as someone who plays basketball, hockey or football or whatever. Although if I were that kind of person, I would be taking it off before I did any of those things anyway.Battery Life. It's been great so far. On light use (checking notifications as they actually come in), I get down to about 65-68% by the end of the day. If I'm playing around with it and demonstrating it to someone (family/friends) because they asked me to, I've seen it go down to about 50-53%. With my type of usage, I've yet to see it drop below 50%. So for me, I could probably get 2 days out of it. I doubt I could get 3 days though, even with how light my usage of the device is.I've heard that some people were able to pair up this watch with their iPhones (albeit at the expense of less functionality), but I have not tried it and really don't intend to. The universe might implode in on itself if people were to actually wear that combo in public on a large scale (this is a joke)!All in all, it is a great watch. Is it the best watch? In my honest opinion, I believe so. This is if you consider the Apple Watch to be the King of the Hill right now. I still think Android Wear has a long way to go; but this watch (with Tizen OS) proves that it can be very flexible in its use, many customization options for its appearances, and still be very useful and presentable all in one package.If your usage and/or beliefs in how a 'smart' watch should function mirrors my own, then you will love this watch too. But if you want a 'smart' watch that acts just like a phone with 3 billion apps that you can wear on your wrist, then maybe not so much.Samsung has demonstrated that it can be innovative on its own merit, and what they did here with the Tizen OS is a giant step in the right direction.Thank you.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "guru",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5C6TUSW2JRVBSIQF3RR77ONBJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX8IV01EUYC0W?ASIN=B015JQ62RY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2015",
                "reviewTitle": "5.0 out of 5 stars Perfect watch for me",
                "reviewText": "I'm hoping to keep this brief and to the point of the product. There have been some mixed reviews but before you buy get one in your hands and see if you like the feel of it. I love the design although I wish it was just a tad bit bigger. I can see how this watch would be suitable for both male and female buyers. It's not too big but not too small. The body seems to be sturdy, I've given it a few bumps against the wall or a door and never damaged the watch. I also like the spinning face to navigate the software... awesome. I love the ability to customize the watch faces. When I get bored of one I just make a few changes for something fresh. The watch band is great for me, it's a bit sportier. With that said I hope to see some new band styles in the near future. I use this watch while I'm running and not had problems with heavy perspiration. Speaking of which the pedometer works well for me. For now I'm using this in conjunction with S Health and no problems so far. The heart monitor also works well for me. I like the slight vibration on the wrist for notifications, this works very nicely in situations where pulling out my cell phone would be considered rude. I don't care so much about texting on this device or phone call functionality. This connected perfectly on the first attempt with my Samsung S6 Edge and I haven't had a problem with losing Bluetooth connection. Oh, and battery life has been great. I place it on the charger every night but usually by the end of the day I still have 75% charge remaining. I'm curious as to what kind of apps that will come along for this device. They're kind of limited but I suppose that is to be expected. This is my first smartwatch and it's a great fit for me. It's very simple to operate and nothing ridiculous. Just a simple smartwatch and I like that. So far I would definitely buy again. I'm halfway tempted to buy the classic version as well but I may wait a while to see what new features come along.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "james elston",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 18, 2019",
                "reviewTitle": "quality, and ease of use",
                "reviewText": "for the price, nice watch, easy to set, ready to go, would recommend,,,,,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arvind Tipradi ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 26, 2017",
                "reviewTitle": "which is sweet surprise for me",
                "reviewText": "I bought Samsung S2 gear from Amazon. Firstly Amazon has delivered two days before their committed date, which is sweet surprise for me.I am loyal customer of Samsung and as usual S2 gear also fulfilled my expectations very good product. Thanks Amazon and Samsung.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rupachandra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 28, 2016",
                "reviewTitle": "Five Stars",
                "reviewText": "The item is good, I recommend it for others too.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A Hussain",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 30, 2017",
                "reviewTitle": "The refurbished watch was received in like new quality",
                "reviewText": "The refurbished watch was received in like new quality. No scratches or wear and tear marks. Thank you for great price and works perfectly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 13, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "really good and smart watch.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}