{
    "remaining_requests": 48348,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Receive-Waterproof-Smartwatch-Pressure-Pedometer/dp/B09WVB7KM3",
    "body": {
        "name": "Smart Watch for Men Women Make Answer Call/Voice Control, IP67 Waterproof Android Smartwatches with Text Call /28 Sports Heart Rate Blood Pressure SpO2 Sleep Monitor Step Counter Black",
        "price": "$18.99",
        "originalPrice": "",
        "rawPrice": 18.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Receive-Waterproof-Smartwatch-Pressure-Pedometer/dp/B09WVB7KM3",
        "soldBy": {
            "sellerID": "AG0VOEPGIWXT0",
            "name": "Aojingtai",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AG0VOEPGIWXT0&asin=B09WVB7KM3&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/517XEDDR49L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51PxggGm6VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51m3tFicRuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51phaLpbSvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VgRzWfIjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hZFhy1drL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61aVtx5SUrL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1df09c36-0e83-49af-b669-251b592dfb99/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f65e42ea-decc-45bf-ad8c-d89bd3c9c232/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9be20959-89f8-4a2c-8152-d4e5dcf2c0a1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/19f04ce4-0160-4074-8bd9-ae07208a6b27/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a02e4d63-1747-4280-9322-2ace675c8105/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the feifuns Store",
            "link": "https://www.amazon.com/stores/feifuns/page/70E4EB92-3953-4A3E-9149-45F67C038BC7?ref_=ast_bln"
        },
        "brand": "feifuns",
        "merchantInfo": "Aojingtai",
        "customerReview": "3.6 out of 5 stars",
        "customerReviewCount": 111,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 8 hrs 24 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "⌚Smart Watch Answer/Make Call & Message Notification📞 After connecting to Bluetooth, can directly dial the phone number on watch to make answer the call, support to sync 8 contacts to watch. Built-in microphone and speaker, can make answer calls (also play music) on the spot from your wrist, allows you to exercise can be hands-free which is more intelligent than the other similar watches. Also can receive SMS and APP messages (WhatsAPP, Facebook, Messenger, Instagram. Note: Can not reply message).",
            "⌚Smart Watch with Blood Pressure Monitor /Sleep Monitor💓 feifuns Smart Watch with Blood Pressure Monitor can provide 24-hour heart rate monitoring, is also capable of blood-oxygen saturation measurement and blood pressure monitoring. Also help to keep track of your sleep data and bring you to more scientific sleep habits and provides comprehensive sleep quality analysis.",
            "⌚1.75 inch Screen /DIY Dial /Quick APP View /Set Passcode📲: feifuns smart watch adopts 1.75 inch Large Screen. Can adjust the brightness on the watch to see the display clearly. There are a variety of dials and DIY dial designs.You can customize the dial through the Da Fit APP and choose your favorite dial style. With the Quick APP, to enter the frequently used functions on the right sliding interface, which is convenient and fast. You can also set up the passcode for your watch.",
            "⌚Voice Control Smart Watch & Long-Lasting Battery🔋: Enter the voice control function and tap and talk to activate your phone's Voice Assistance to control phone to do whatever you want on your wrist. It takes 2 hours for full charge, gaining working time about 5-7 days, for 1-2 days bluetooth call. Allow you to wear it worry-free and get rid of power and waterproof anxiety.",
            "🌊IP67 Waterproof & 28 Sports Modes🏃Supports multiple sport modes and track all your workout distance and physical status during exercise. With rated IP67 waterproof standard. (Note: not suitable for diving, swimming in the sea or sauna).",
            "⌚Multi-functional Smart Watch for Android IOS Phones💌:feifuns smart watch is compatible with iOS 8.0, Android 4.4 and above. Also has functions such as Voice Control, Quick APP view; Screen password; Calories Counter, Alarm Clock, Female Health, Weather Checks, Remote Camera Control, Timer, Stopwatch, Music Control, Fitness Tracker, Breath Train; Games;",
            "🎁The stylish high-end smart watch is a gift for yourself, your lover, family and friends to inspire them to move and stay healthy."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "1.75 inch HD Display, Built-in Speaker and Microphone to make answer calls on watch; Sync phone's contact; Quick APP view; Screen password; Voice Control; IP67 waterproof; 28 sport modes; Multiple Dials & Customized Watch Face, E-mail/Text Messaging/Call/SNS Notification, Calories Counter, Alarm Clock, Female Health, Weather Checks, Remote Camera Control, Timer, Stopwatch, Music Control, Fitness Tracker, Sleep Monitor, Heart Rate Monitor, Blood Oxygen Measurement; Breath Train; Games See more"
            },
            {
                "name": "Compatible Devices",
                "value": "IOS Phones like: iPhone14pro max/14pro/14/14/iPhone13pro max/13pro/13/13/mini/12/12pro/11/X Mas/X/XR. ect. For iPhone 8/8plus 7/7plus 6/6plus.For iPhone 8/7/6.For iPhone 8/7/6/6s plus.For iPhone 5/5S/5C/4/4s Item, Android Phones, Android Phones:Samsung Galaxy S10, S10 Plus, Samsung Galaxy S9,S9 Plus,Samsung Galaxy Note 9,Samsung Galaxy Note 8, Samsung Galaxy S8, S8 plus, Samsung Note 5, Samsung Note 4, Samsung Note 3, Samsung Note 2.Galaxy S7,Galaxy S7 Edge, Galaxy S6,Galaxy S6 Edge,Galaxy S6 Edge Plus, Samsung Galaxy S5, Galaxy S4, Galaxy S3. Galaxy C5Samsung Note 4, Samsung Note 3, Samsung Note 2.Galaxy S7,Galaxy S7 Edge, Galaxy S6,Galaxy S6 Edge,Galaxy S6 Edge Plus, Samsung Galaxy S5, Galaxy S4, Galaxy S3. Galaxy C5, C7,C8,C9, Galaxy A5, A7, A8,A9, J7, J8. Huawei, Xiaomi, ZTE, OPPO, Vivo,SONY, HTC, LG,and other smartphones with iOS 8.0/Android 4.4 or above and Bluetooth 4.0 and more. See more"
            },
            {
                "name": "Compatible Phone Models",
                "value": "IOS Phones like: iPhone14pro max/14pro/14/14/iPhone13pro max/13pro/13/13/mini/12/12pro/11/X Mas/X/XR. ect. For iPhone 8/8plus 7/7plus 6/6plus.For iPhone 8/7/6.For iPhone 8/7/6/6s plus.For iPhone 5/5S/5C/4/4s Item, Android Phones, Android Phones:Samsung Galaxy S10, S10 Plus, Samsung Galaxy S9,S9 Plus,Samsung Galaxy Note 9,Samsung Galaxy Note 8, Samsung Galaxy S8, S8 plus, Samsung Note 5, Samsung Note 4, Samsung Note 3, Samsung Note 2.Galaxy S7,Galaxy S7 Edge, Galaxy S6,Galaxy S6 Edge,Galaxy S6 Edge Plus, Samsung Galaxy S5, Galaxy S4, Galaxy S3. Galaxy C5Samsung Note 4, Samsung Note 3, Samsung Note 2.Galaxy S7,Galaxy S7 Edge, Galaxy S6,Galaxy S6 Edge,Galaxy S6 Edge Plus, Samsung Galaxy S5, Galaxy S4, Galaxy S3. Galaxy C5, C7,C8,C9, Galaxy A5, A7, A8,A9, J7, J8. Huawei, Xiaomi, ZTE, OPPO, Vivo,SONY, HTC, LG,and other smartphones with iOS 8.0/Android 4.4 or above and Bluetooth 4.0 and more."
            },
            {
                "name": "Operating System",
                "value": "iOS 8.0/Android 4.4 or above and Bluetooth 4.0 or later smartphones"
            },
            {
                "name": "Water Resistance Level",
                "value": "Waterproof"
            },
            {
                "name": "Human Interface Input",
                "value": "Microphone"
            },
            {
                "name": "Supported Application",
                "value": "Fitness Tracker, Sleep Monitor, Heart Rate Monitor, Blood Pressure Monitor, Alarm, Music Player, Time Display, Voice Control, Pedometer, Reminders, Multisport Tracker, Weather,"
            },
            {
                "name": "GPS",
                "value": "GPS Via Smartphone"
            },
            {
                "name": "Controller Type",
                "value": "Da Fit APP"
            },
            {
                "name": "Band Width",
                "value": "22 Millimeters"
            },
            {
                "name": "Band Length",
                "value": "26 Centimeters"
            },
            {
                "name": "Battery Life",
                "value": "7 days"
            },
            {
                "name": "Battery Cell Composition",
                "value": "Polymer"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "Bluetooth"
            },
            {
                "name": "Screen Size",
                "value": "1.75 Inches"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            },
            {
                "name": "Band Material Type",
                "value": "Silicone"
            },
            {
                "name": "Customer Reviews",
                "value": "3.6 3.6 out of 5 stars 111 ratings 3.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#40,201 in Electronics (See Top 100 in Electronics) #1,065 in Smartwatches"
            },
            {
                "name": "Brand",
                "value": "feifuns"
            },
            {
                "name": "Model Name",
                "value": "HE1"
            },
            {
                "name": "Target Audience",
                "value": "Adult; Teenager"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Included Components",
                "value": "1* smart watch; 2* Straps; 1* Charger; 2* Screen Protector, 1* Connection instruction; 1* User manual"
            },
            {
                "name": "Target Gender",
                "value": "Unisex"
            },
            {
                "name": "Item Weight",
                "value": "0.15 Kilograms"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "1.77 x 1.75 x 0.5 inches"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Color",
                "value": "HE1-Black"
            },
            {
                "name": "Shape",
                "value": "Square"
            },
            {
                "name": "Band Color",
                "value": "Black + Dark Green"
            },
            {
                "name": "Sport",
                "value": "28 Sport modes"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "2023 feifuns Smart Watch Make and Receive calls with Voice Assistant, 1.75-inch HD Color Touchscreen for Men Women Compatible with iPhone & Android 1. Smart Watches Bluetooth Call Features(Answer /Make Call on watch): could choose ring or vibration, adjust the call voclum on watch; 2. Smart reminder on your wrist: custom alarm clock reminder, sedentary reminder, call reminder, information push ( Facebook, Twitter, whatAPP, Instagram, LinkedIn, messenger, Skype, line, kakaotalk, Gmail, Snapchat, Push the information prompted by the mobile phone. Note: can not reply text; 3. Health Activity Trackers: Blood Pressure, Blood oxygen, Heart rate(24 hours continuous monitoring), Sleep Monitoring; 4. Voice Assistant: Enter the voice control function and click the screen to activate your phone's Voice Assistance to control phone to do whatever you want on your wrist; 5. 1.75 inch HD Full Touch Screen Smart Watch for Women Men with Customize watch face: Customize your own style. Make each screen display clear and smart，bring you a more open visual enjoyment. 6. Smart Lock Screen: Set a password in the settings to protect privacy; 7. 28 Variety of Sports Smart Watch for women men: display Steps, Calorie, Distance, Heart Rate, supports 28 sports modes to give you more detailed insights into your whole day activities; 8. GPS Recording Exercise Route: connect to smartphone GPS for modes like Run for more precise real-time pace & distance to track all your workout routes; 9. IP67 Water Resistant: Do not take a shower with the watch on, water vapor may enter the watch and damage the battery; 10. Music Playback and Control, Remote Photography: can play music on watch after connected to your phone's Bluetooth. Note that play music for long time will let the battery run out quickly; 11. Brightness Adjustment: slide to adjust the brightness more user-friendly design; 12. More Useful Functions: Watch combination lock /Quick APP View /Alarm Clock /Stopwatch /Weather Information /Sedentary & Drink Water Reminder /Game /Breathe Trainning /Do not Disturb Mode /Power Saving Mode /Theater Mode /Menstrual Cycle for Women 13. Must-have gifts: Fashionable and youthful, taking into account both men and women, it is the best gift for relatives and friends",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a912c8e9-df4f-48d3-901c-d815e636a1b8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "feifuns Smart Watch with Call Function, Dual Bluetooth connection(App Connection and Phone's Bluetooth Connection) Tips:read carefully how to link two bluetooths, divided into two steps. A: *The first Bluetooth, App's Bluetooth (Da Fit) Step1：Download the 'Da Fit' app in your smartphone (you can scan the QR code in user manual or search 'Da Fit' in App Store) Step2：Turn on Phone's Bluetooth and Location Step3：Enter Da Fit app and click 'ADD A DEVICE' to bind watch HE1, if more than one devices nearby, please filter according to the MAC number of the watch. (Please fully charged it when the first time to use) *The Bluetooth connection distance should not exceed ten meters(In an open field ). Recommended within 3 meters. B: *The second Bluetooth, connect phone's Bluetooth to use the call function and play media audio Step1: Swipe down the screen,turn on the 'call' function switch Step2: Open phone's setting and turn on the Bluetooth Step3: Search and find the watch Bluetooth named: Audio_HE1 Step4: Click to connect Audio_HE1 After successful connection, you can dial/ answer/ reject the phone call on the watch, you can view the call log information, and add 8 contacts through APP.( Note: the phone number can't have () symbol) * The audio cannot be turned on when the watch battery is low.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee17655f-66c0-4a0a-b88a-11b2bc3060bd.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "All-day Health Monitoring -- Smart Watch with Blood Pressure Minitor /Blood Oxygen Monitor /Heart Rate Monitor /Sleep Monitor Tips to help you use the smart watch smoothly: Please use according to the details of the instruction manual! 1. For the first time, you need to charge 10 minutes to activate this watch. Note: Don’t plug the charging cable into the fast charging USB wall charger, should use the normal USB port charger(5V-500mA). 2. Please enter your information in the app to get the accurate exercise readings, such as gender, age, height, weight, step length. 3. The Heart Rate/Blood Oxygen/Blood Pressure level will be affected by factors such as motion, watch placement on the wrist, skin temperature and skin perfusion. These factors will cause fluctuations in measurements. 4. For a single measurement on the watch, please wear the watch two fingers wide below the wrist bone, snug but comfortable on your wrist. When measuring, stay still and make sure your wrist is flat with the watch facing up. If you are sitting, you can rest your arm on a table with the watch facing up. (Warm reminder: all the above data are for reference only and cannot replace medical treatment.) 5. Wear the smart watch in suitable tightness, do not wear too loose. 6. Keep the watch and band dry, no sweat, clean when measuring. 7. Keep your app be the latest version; Keep Da Fit APP running in the background all the time.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/761f780c-2916-4e9e-b9a4-1b5ef2e43037.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "2023 upgraded feifuns Smart Watch with 28 Sport Modes to help you live a healthy style! ---------------- [FAQ] ---------------- Q: What should I do if the smartwatches fail to pair again or keeps disconnecting? A: 1) Please make sure that your smartwatch has Bluetooth enabled and is not paired with other devices. 2) Please restart the phone and reset the watch (Turn on the watch - Click the “settings”- “System Menu”- “Reset”), then connect the smartwatch again. Please note that the maximum Bluetooth distance is 10 meters. If the watch exceeds the distance, it will always be disconnected. This smartwatch is only compatible with smartphones, not for tablets or PC. Q: How to turn on the watch and set the time? A: When you first use the watch, please charge the watch for 10 minutes first to activate it, then full charge about 2 hours. The smart watch's time will automatically sync with your phone after you connect through the 'Da Fit' app. You can set time format on APP. Q: Watch fails to receive notifications from smartphone? A: Ensure that DND (Do-Not-Disturb) mode is disabled on the watch, and make sure your phone's notification bar displays messages. And then follow the steps below. (1) The notification permission in the phone settings. (2) The notification permission in APP you need to receive information. (3) The notification permission in DaFit app. (Please make sure the DISTURB in the smart watch is turned off and keep APP run in background.) Q: After connecting to the call function of the watch, how can I prevent the media music of the phone from playing on the watch? A: IOS system: Open the phone settings, turn on Bluetooth, find Audio_HE1 and click disconnect. Note that disconnect the Audio_HE1, can not use watch to make /answer calls /play music; Android system: Open the phone settings, turn on Bluetooth, find Audio_HE1, you can directly cancel the connection or click the setting icon on the right side of Audio_HE1 to turn off the button of media audio. Q: Watch doesn't display the text, just show you receive a message. A: The watch displays what displays on your smartphone's notification bars. If your smartphone cannot receive the detailed text, the watch cannot receive the detailed text, neither. In this case, pls feel free to set up your system setting of notification and the message notification Settings for third-party APP. Q: What should I do if the smart watch has problems? A: If you have any product problems, please message us via Amazon for help.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8961c62-6304-4aa2-8a37-03aa770ab15c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Call Receiving/Dialing After connected to bluetooth, you can make or receive calls directly on your watch. Support quick communication (8 contacts can be added). When you exercise, you can use hands-free and high-fidelity, could choose ring or vibration, adjust the call voclum on watch. Mmessage reminder The smart watches will vibrate to notify you, also has a Do Not Disturb mode. 1:Turn off Disturb, the watch can receive and display WhatsAPP/Text/Facebook information normally. 2:Turn on Disturb, the watch cannot receive and display WhatsAPP/Text/Facebook information normally. At this point you can work/study or sleep quietly. IP67 Waterproof Fitness Tracker With IP67 waterproof level design, will not be damaged to daily hand washing, running in the rain to meet your daily needs. (Note: Do not suitable for diving, swimming in the sea; Do not use in bath, sauna, hot spring or other environments with corrosive liquid and hot steam. 1.75\" Screen with Quick APP View, Passcode, Customize Watch Face 1.75\" HD TFT-LCD Large Screen with the quick APP view and screen passcode help you use this watch better. Apart from the various built-in dials and online dials, you can even select your own photo from the album as the watch face. It can be any photos, such as your family, pet ,selfie, etc.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d927f08c-2ee1-456f-bd5b-e760a97b9371.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f408db0f-b051-4bc7-90a8-37530478c001.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/790470ef-36b9-4c61-b820-e03c943e5d2e.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3b0d3e6-f657-409a-ba79-a96efc0cb500.__CR0,0,300,300_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Smart Watch with AI Voice Control & Bluetooth Music playback & Remote Camera feifuns smart watch has AI voice control feature. Enter the AI voice function, talk after tap to activate your phone's Voice Assistance(like siri) to command your phone smoothly to make calling, play music or do whatever you want. Bluetooth Music playback allows you to directly play music like a bluetooth speaker from your smartwatch. This smart watch can remotely control the camera of your mobile phone to capture precious photos. Fitness Tracker with Women's Health Reminder & Weather Forecast After the menstrual cycle reminder is turned on in the Da Fit APP, women can keep track of their health status at any time. There are three types of reminder modes like menstrual management, pregnancy conditioning and gender health. Once connected to the app, the weather conditions for the current day and the next five days for the city you select will be displayed. 7+ Days Standby The battery power can generally support 5-7 days of standby after fully charged. And it also depends on the situation you use. For example, if you activate sport mode or use the watch to make receive call, Play the music all the time, the battery will be used out more quickly. Warm tips: As the built-in battery capacity is small, it's not suggested to be charged for long time. Please remove the device host from the power supply once fully charged, prolonged charging may shorten the battery's life. Other Useful Functions Do Not Disturb ModeBrightness Adjustment Raise Wrist to Wake ScreenSedentary /Drink Water ReminderTimer /Alarm clock /StopwatchPedometer /Step counterGoal achievement reminder Flashlight, Theater ModeBreathe GuideGame",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d7a59bff-bfec-405b-906b-a861e9c9482f.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/18cdd87b-104a-4353-977a-57a0bce260b0.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/596fbacd-3d09-4828-9d9c-e8293aa86e89.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ead638fb-5306-4ff4-8c84-295a337b9c34.__CR0,0,300,300_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "feifuns smart watch feifuns smart watch feifuns smart watch feifuns smart watch feifuns smart watch feifuns smart watch Display Size 1.75 inch 1.72 inch 1.54 inch 1.72 inch curved screen 1.3 inch round screen 1.4 inch Band Size Width: 22mm | fit for 5.5\" to 8.6\" wrist Width: 22mm | fit for 5.5\" to 8.6\" wrist Width: 20mm | fit for 5.5\" to 8.6\" wrist Width: 20mm | fit for 5.5\" to 8.6\" wrist Width: 20mm | fit for 5.5\" to 8.6\" wrist Width: 20mm | fit for 5.5\" to 8.6\" wrist Health Monitor ✓ ✓ ✓ ✓ ✓ ✓ Call & Message Reminder ✓ ✓ ✓ ✓ ✓ ✓ Custom Dial ✓ ✓ ✓ ✓ ✓ ✓ Make/ Receive calls ✓ ✓ ✓ ✓ ✓ No Waterproof IP67 IP67 IP65 IP65 IP65 IP68 Compatible&Connectivity APP: Da Fit| iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. APP: Da Fit| iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. APP: Da Fit| iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. APP: V Band| iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. APP: V Band| iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. APP: HerobandIII| iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. Voice Control ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a912c8e9-df4f-48d3-901c-d815e636a1b8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee17655f-66c0-4a0a-b88a-11b2bc3060bd.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/761f780c-2916-4e9e-b9a4-1b5ef2e43037.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8961c62-6304-4aa2-8a37-03aa770ab15c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d927f08c-2ee1-456f-bd5b-e760a97b9371.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f408db0f-b051-4bc7-90a8-37530478c001.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/790470ef-36b9-4c61-b820-e03c943e5d2e.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3b0d3e6-f657-409a-ba79-a96efc0cb500.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d7a59bff-bfec-405b-906b-a861e9c9482f.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/18cdd87b-104a-4353-977a-57a0bce260b0.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/596fbacd-3d09-4828-9d9c-e8293aa86e89.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ead638fb-5306-4ff4-8c84-295a337b9c34.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/947be83b-b350-4cce-84ff-b10db90aec8c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fddbb868-979d-48dd-b8de-b12f0dfadecc.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5bec78ae-5162-4bcb-9c82-f2b58f2f4918.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b73c17c3-c1e5-42a0-92c8-bc695d9eeb26.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9fa764c-0df3-4290-a54b-124288fc6d1d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/91500f67-3c0d-49da-9519-e803c038046e.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "I return the item, on 5/27/23,and haven't seen any refund to my account ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHYUVZDTG4RON46HW6PL53XAWTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3T5QRPOMP2DSV?ASIN=B09WVB7KM3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Quality!",
                "reviewText": "It was the appropriate gift for friends and family.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSI6VGI3ZPXZZQ3PMNRXUJT2XNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBHP3PB76ZPP7?ASIN=B09WVB7KM3",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 23, 2023",
                "reviewTitle": "1.0 out of 5 stars Avoid At All Costs",
                "reviewText": "The first watch they sent it was a used watch. It was password protected, and the previous owner forgot to reset the watch. So it was useless. I should have returned it and left it at that. The second one was new but it has a terrible fault, once you pair it to your phone the watch, it becomes the default audio for your phone, the only way to avoid this is turning off the Bluetooth otherwise you will have to take all your calls on the watch",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lindsay young",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQFU4VTVOX2NKMV6DESSNUYW6HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R163DUBL5PSCXX?ASIN=B09WVB7KM3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2022",
                "reviewTitle": "5.0 out of 5 stars It actually connects to the phone!!",
                "reviewText": "It really connects unlike some other ones I've purchased for android phones!! My teens love them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kenneth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERHG7PJWSE23MR46ESXCCPXEL2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VQ8VFU8VSEPR?ASIN=B09WVB7KM3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "4.0 out of 5 stars Great watch",
                "reviewText": "It is a great watch only thing it keeps disconnecting from Bluetooth but readable text messages",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH777ZR3EYKDNH2BEMEZZTIIEDWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REYGEX6TG0YGI?ASIN=B09WVB7KM3",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 23, 2023",
                "reviewTitle": "3.0 out of 5 stars Nice watch, needs improvement.",
                "reviewText": "Accuracy isn't the best. Bought 2 one for me and my wife. I still wear mine; she doesn't wear hers. 1. Our steps are not accurate. 2. It keeps turning on phone mode when we don't want to use it, forcing us to turn off Bluetooth. 3. A small jolt on the knob changes the watch face when we don't want it to. I wish there was an option to lock the watch face. When you try to activate the google assistance from the watch, you have to have the phone out of your pocket in order to speak to the Google Assistance, defeats the purpose. It's like it doesn't use the watch mic only the phone mic. Those are the 4 main issues we have with this watch. We love the brand as we had 2 of same brand, but this specific model doesn't work the greatest. If they can have an update for this watch to fix these 4 issues it would be the best watch for your money. I wear mine because of the cool features. I've learned to adjust to the 4 issues this watch lacks and annoys us. One of the features I liked, the watch knows I answer via phone so speaker and mic on phone is what it goes to instead of the watch. If I answer via watch, it activates the watch speaker and mic. However, it has to switch back and forth from watch to phone to figure it out, probably the bug from number 2 I stated above. Please fix the 4 issues. Besides those 4 issues, the watch is pretty cool.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robincs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2EHER5BFUDWRNHEOMD726YS7CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18MCJQHTZ3YP6?ASIN=B09WVB7KM3",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2023",
                "reviewTitle": "2.0 out of 5 stars Died on me",
                "reviewText": "I purchased this watch in September 2022 and it has now died. Out of nowhere it stopped. Don't buy!!!! I am so disappointed. I really loved the watch at first but I don't know what happened. Almost $50 wasted.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colekids",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFRSYZZHR67YAE3URHI7SXCDZKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3818NE1G2G7IX?ASIN=B09WVB7KM3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 2, 2022",
                "reviewTitle": "5.0 out of 5 stars Great watch",
                "reviewText": "Works great definitely a great value",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adriana Castaneda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXDUWLMZCKWXFDA66UCTHUUJW4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PPYH44EXXDW3?ASIN=B09WVB7KM3",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2022",
                "reviewTitle": "3.0 out of 5 stars It’s good for notifications and time but nothing else",
                "reviewText": "The battery life sucks on this. And the app can be better. They should add more features for example make it so you can use a slideshow for the wallpaper or make it so you can put the volume up and down through the dial.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}