{
    "remaining_requests": 48342,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pautios-Swimming-Waterproof-Smartwatch-Compatible/dp/B0CQ88VXGL",
    "body": {
        "name": "Pautios Smart Watch, Swimming Waterproof Fitness Tracker with Heart Rate, SpO2 and Sleep Monitor, 44mm Fitness Watch for Women Men, Step Calories Tracker, Smartwatch Compatible with iOS Android Phones",
        "price": "$16.99",
        "originalPrice": "",
        "rawPrice": 16.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pautios-Swimming-Waterproof-Smartwatch-Compatible/dp/B0CQ88VXGL",
        "soldBy": {
            "sellerID": "ARDT5FL69IEQ9",
            "name": "JIAONE",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ARDT5FL69IEQ9&asin=B0CQ88VXGL&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLK99NVY"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CH36SH4H",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41+l5g1az9L._SS36_.jpg"
            },
            {
                "asin": "B0CQ88VXGL",
                "variationName": "Color",
                "variationValue": "Black Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41uiCBDFweL._SS36_.jpg"
            },
            {
                "asin": "B0CBTTJRX9",
                "variationName": "Color",
                "variationValue": "Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41USs0C5fbL._SS36_.jpg"
            },
            {
                "asin": "B0C868ZPVR",
                "variationName": "Color",
                "variationValue": "Purple",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41fnuXwN11L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/311bU6XHljL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "15",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41uiCBDFweL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51kcZuVMCGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-so3xut8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5138nivZaTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UWLZhE0mL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ynauhKKxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HWUbfRHfL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91iJ-PSuoEL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91iJ-PSuoEL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Pautios Store",
            "link": "https://www.amazon.com/stores/Pautios/page/6B7C2546-3E1E-46B5-A91D-522414DAFAE3?ref_=ast_bln"
        },
        "brand": "Pautios",
        "merchantInfo": "JIAONE",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1482,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 7 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Large TFT-LCD Display and Customizable Watch Faces: With a 1.69-inch TFT-LCD touchscreen, the watch ensures vivid and clear visual effects. Choose from a variety of theme dials to personalize the watch face according to your liking.",
            "24/7 Wellness Monitoring: Monitor your well-being 24/7 with our smartwatch, automatically capturing real-time heart rate and sleep patterns (deep sleep, light sleep, and awake times). The watch conducts automatic analysis of your sleep quality and includes features for blood oxygen saturation measurement and stress level tracking, offering thorough insights into your physical well-being.",
            "Multiple Sports Modes Tracking: Our smartwatch supports multiple sports modes like running, cycling, and swimming. It monitors calories, steps, distance, and activity time, providing detailed data for a comprehensive performance overview.",
            "Water-Resistant for Swimming: With a 50-meter waterproof rating, our watch is ideal for swimming and water activities. It includes features like a stopwatch, pedometer, breathing exercises, music control, photo control, weather forecast, women's health reminders, and mobile phone search.",
            "Smart Notification Feature: Enabling smart notifications allows the smartwatch to receive reminders for incoming calls, text messages, and application notifications. Stay informed with the latest updates, ensuring you never miss important information.",
            "Extended Battery Life and Compatibility: Enjoy up to a week of usage on a single charge with our fitness watch. It is compatible with smartphones running Android 6.0 and above or iOS 9.0 and above."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Email/Messages/Call/SNS Reminder, Multisport Tracker, Fitness Tracker, Pedometer, Stopwatch, Timer, Screen on time, Music Control, Weather Forecast, Blood Oxygen Monitor, Heart Rate Monitor, Sleep Monitor, Custom Watch Dials, 50 Meter Swimming Waterproof See more"
            },
            {
                "name": "Compatible Devices",
                "value": "iOS Devices, Android Smartphone, iOS Smartphone, Android Devices, Smartphones with iOS 9.0/Android 6.0 or above and Bluetooth 5.0 or later See more"
            },
            {
                "name": "Compatible Phone Models",
                "value": "IPhone 15/ 15 Pro Max/ 15 Pro/ 14/ 14Pro/ 14Pro Max/ 14Plus/ 13/13 mini/13 pro/13 pro max/12 mini/12/12 pro/12 pro max/11/11 pro/11 max/11 pro max/XS/X/8/8 plus/7/7 plus/6/6s/6 plus/6s plus/5/SE/5S/5C/4/4s and it require smartphones with iOS 9.0 or above and Bluetooth 5.0 or later., Samsung Galaxy S21, S21 Plus, S21 Ultra, S20, S20 Plus, S20 Ultra, S20 FE, S10, S10 Plus, S9, S9 Plus, S8, S8 Plus, S7, S7 Edge, S6, S6 Edge, S6 Edge Plus, S5, S4, S3, Samsung Note20, Note10, Note10 Plus, Note9, Note 8, Note 5, Note 4, Note 3, Note 2, Galaxy C5, C7, C8, C9, Galaxy A5, A7, A8, A9, J7, J8 and it require smartphones with Android 6.0 or above, Bluetooth 5.0 or later., Xiaomi, ZTE, Lenovo, OPPO, Vivo, SONY, HTC, LG, OnePlus, Nexus, Google pixel/Pixel XL and it require smartphones with Android 6.0 or above, Bluetooth 5.0 or later. See more"
            },
            {
                "name": "OS",
                "value": "Android Devices, iOS Devices, Smartphones with iOS 9.0/Android 6.0 or above and Bluetooth 5.0 or later."
            },
            {
                "name": "Water Resistance Level",
                "value": "Waterproof"
            },
            {
                "name": "GPS",
                "value": "GPS Via Smartphone"
            },
            {
                "name": "Battery Life",
                "value": "7 days"
            },
            {
                "name": "Battery Cell Composition",
                "value": "Lithium Polymer"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "Bluetooth"
            },
            {
                "name": "Screen Size",
                "value": "44 Millimeters"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,482 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#97,509 in Electronics (See Top 100 in Electronics) #2,078 in Smartwatches"
            },
            {
                "name": "Brand",
                "value": "Pautios"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Color",
                "value": "Black Red"
            },
            {
                "name": "Shape",
                "value": "Square"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "10.6 x 3.3 x 0.66 inches"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/74e4e607-97cb-4848-92b5-a885df1b78a1.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dc39e53e-a046-4a1d-9ebf-c7f64cff9275.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a8b2741-aa69-451a-bd89-a6f228197aa7.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cd7b9561-e754-4b38-9995-e621ae9ac550.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad2df65e-5400-4f76-84ff-ab165e8532ad.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d1fcdf63-7d31-4179-8c94-e04faa315648.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/05a1d6a9-5f0c-4752-ae63-9f0cbf87639f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CajuncountryCajuncountry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQHPC5BBP42SYXMBKER6ORKEUNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28BQ26H1HO2GC?ASIN=B0CQ88VXGL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 27, 2022",
                "reviewTitle": "5.0 out of 5 stars Great watch for the price",
                "reviewText": "So I waited to write this review until I had the watch a good while to try out. I caught it on sale for half off so decided to take the leap and buy it. It does everything but answer calls and texts. You get notifications of the calls, can decline them. You get the notifications of messages and can read them. It is accurate of sleep cycles even if I take a nap during the day. The heart rate is pretty accurate as well. I have a tiny wrist so finding watches to fit snug on me is hard but this one does. I love how it has the training/workout mode to keep track. Downfalls it does not always catch when I am actually walking and can be a pain to get the watch to light up. The watch face is customizable which I love. The screen goes between being very sensitive and not sensitive enough. For the price I got the watch for it is doable for me to deal with. I love the soft green color vs the pink color I kept finding for women. It was a nice change and it goes with a lot. The watch face is not overly too big imo and I have a legit small frame and wrist. I find it more comfortable wearing it upside down than upwards especially for a more accurate heart rate and oxygen level reading. I can also set alarms on it or it will allow my alarms on my phone to go through either way. It has a seditiary reminder though it is not accurate. It just goes off every hour on the hour. Even if you were just moving literally 1 min ago it will still go off. It doesn't play music through the watch only controls the play/pause and volume of it for your phone which plays the music. Bonus that I adore, it Bluetooths to your phone which then syncs to the app when the app is opened but it also allows your phone to still Bluetooth to your car/speakers without disconnecting the watch!!!! Which is so nice!!!! The app does require location to work. The battery life is amazing on the watch depending on the brightness level you set and the rise to wake motion if you turn it on. I keep mine at 20 to 40% brightness and the watch will last days. I just choose to charge it when I bathe which it is usually on 97 to 81% after 15 to 20 hours which is not bad. My Phone battery drains faster than the watch. Bad thing is though it has been hard to find a screen protector for the watch that fits. Overall, I would buy this watch again and probably will if it goes half off again for 30$ for my daughter. If needing to talk/text through your watch is important buy the more expensive ones. If not then definitely purchase this watch. The pros so far outweigh the very few cons they have which is not much at all. Just depends on what matters the most to you.",
                "reviewVotes": "73 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61sGyl3xGTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71w2ROixblL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOZXSNNDQHPBGWPR7EAHMTYWB6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F00L001SXPM5?ASIN=B0CQ88VXGL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Still going strong after one year-awesome customer support",
                "reviewText": "I’m a teacher and wear this watch daily. The app works really well. You can customize what notifications you receive and get data on your movement.I use it to set several quiet alarms for when specific students go to specific interventions. The alarm buzzes your wrist and is distracting enough to get your attention, but not disturb others.My watch receives heavy wear and still functions as nice as the day I received it. It still holds a decent charge. I usually only need to charge it every other weekend.For the price, it is a great alternative to expensive smart watches. It is excellent for basic notifications, call and text alerts, step count, and alarms.Recently my watch band caught on a metal fence and the strap loop tore. I inquired with the company to purchase a new one, and they sent me one free of charge. They really mean it when they guarantee the watch for life.Excellent watch. Excellent seller.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4QJSIWNSAVHTTMRB4PU3D4QMBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I9MNJ1EJJ4WL?ASIN=B0CQ88VXGL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Watch great for my use.",
                "reviewText": "Great watch/Bad app. Watch for my use is fantastic for the money. Great for work, if it gets smacked you're not out much. I really don't use the health sensors,but they do appear to be somewhere accurate. I use mostly for notifications and time and date. The bad is the app, it kinda sucks at least compared to Amazfit, can't seem to get weather to work and gps tracking is glitchy on connecting to phone wish these would work. Also before I upgraded phone text notifications were not reliable. Lens is plastic but not too bad I'm pretty rough on it and only have one scratch, water wise I shower with it everyday. No complaints on build quality. Battey life is awesome, charge every week or so never been below 70%",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark F. Stratton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4YUNYMMYXW4IDAVZDBDXQVHKTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTBMD5T1SMQ2N?ASIN=B0CQ88VXGL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Very nice as stand alone watch",
                "reviewText": "This was purchased for my wife as a stand alone watch, unconnected to a smartphone, as it was mentioned this was possible in the product information. In the 3 weeks of use so far, it has done an excellent job of keeping time, tracking heart rate, tracking sleep patterns, and normal walking steps. Bear in mind, it and most other watches of this sort track arm movements to calculate steps, so pushing a cart or movement without arm use is not counted. It is easy to read, and battery life when unconnected is great, with the first recharge done at 14 days with it still having 18% charge left. I'm sure having it paired to a cell phone would reduce that depending on usage. I can't really comment on it's paired usage, so I'll leave that to others. If we get a decent service life out of it, it will have been a great purchase. I'm actually considering one for myself in the future, if I can break my habit of cheap Walmart watches.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}