{
    "remaining_requests": 48255,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/YYZ-Bluetooth-Fitness-Tracker-Waterproof/dp/B0CN15NDC8",
    "body": {
        "name": "YYZ Smart Watch for Women (Answer/Make Call) Touch Screen Bluetooth Fitness Tracker with Heart Rate/Sleep Monitor IP68 Waterproof Fitness Watch for Android iPhone (Silver)",
        "price": "$39.99",
        "originalPrice": "",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/YYZ-Bluetooth-Fitness-Tracker-Waterproof/dp/B0CN15NDC8",
        "soldBy": {
            "sellerID": "A30I6C5QFGVOFR",
            "name": "YYZ-US SHOP",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A30I6C5QFGVOFR&asin=B0CN15NDC8&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CN17F42R"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CN147W15",
                "variationName": "Color",
                "variationValue": "gold",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51UatSN9pOL._SS36_.jpg"
            },
            {
                "asin": "B0CN15NDC8",
                "variationName": "Color",
                "variationValue": "silver",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/517PleAGbNL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "Only 8 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/517PleAGbNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Ull9CzBfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513B9QENd1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51e2glohG5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dAmlctcxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qTO1Rrt6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OfTdSUGaL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: YYZ",
            "link": "https://www.amazon.com/YYZ/b/ref=bl_dp_s_web_117171669011?ie=UTF8&node=117171669011&field-lbr_brands_browse-bin=YYZ"
        },
        "brand": "YYZ",
        "merchantInfo": "YYZ-US SHOP",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 28,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 5 hrs 9 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1.Ultra-clear Touch Screen and DIY Dials: Our smart watch for phones (Android 5.0 and above/ IOS 10.0 and above) adopts the latest technology and is equipped with 1.106-inch ultra-clear full-touch color screen, which has excellent picture quality and smoother system. We have carefully designed 400+ dials in the APP and also support personalized watch face, you can DIY your own wallpaper by choosing your own favorite photos.",
            "2.IP68 Waterproof and 100+ Sports Modes: The smartwatch supports IP68 waterproof, which has a good waterproof effect for daily life, such as sweating, raining, washing hands, taking a shower(can not be used in hot water more than 40°) and swimming. The smart watches for women built-in 100+ sports modes and each mode will record your exercise data in real time.",
            "3.Answer/ Make Calls and More Practical Tools: Through Bluetooth connection, the smart watches can directly answer/ make calls, use intelligent voice assistant, play music, read messages, store contacts, view call history, check weather, remote to take photos and so on. you will never miss any calls & message during meeting or workout.",
            "4.Activity Tracker for Your Health: This fitness watches for women equipped with HR3602 high-precision sensor and unique algorithm to monitor heart rate, blood oxygen and sleep, real-time analysis of your health status and sleep quality. The watch also will record your all day activities like steps, calories burned and distance traveled data.",
            "5.Female Physiological Period Reminder: We carefully designed women’s health reminder for this smart watch for women, will intelligent predication of physiological period, sage period, menstrual period, and ovulation period, help you to better understand how to take care of yourself.",
            "6.High Capacity Battery and Extra Long Battery Life: Equipped with 170mAh high capacity battery, the waterproof watches for women has 5-7 days daily use, 15 days long standby time, and 30 days new low-power mode, which the health function still supports manual measurement, providing longer battery life and sufficient functionality."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Heart Rate Monitor"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            },
            {
                "name": "Water Resistance Level",
                "value": "Waterproof"
            },
            {
                "name": "Supported Application",
                "value": "Reminders, Phone, Multisport Tracker"
            },
            {
                "name": "Controller Type",
                "value": "Voice Control"
            },
            {
                "name": "Battery Power",
                "value": "170 Milliamp Hours"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Warranty",
                "value": "1 years"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 28 ratings"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#93,237 in Electronics (See Top 100 in Electronics) #2,006 in Smartwatches"
            },
            {
                "name": "Brand",
                "value": "YYZ"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Included Components",
                "value": "1 smart watch"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Color",
                "value": "silver"
            },
            {
                "name": "Shape",
                "value": "Square"
            },
            {
                "name": "Band Color",
                "value": "Silver"
            },
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 6.6 x 4.1 x 0.7 inches; 0.96 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ November 9, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ YYZ"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CN15NDC8"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Your Watch, Your Style HD Touch Screen: The smart watch is equipped with a large 1.1-inch HD full-touch square color screen, high-definition resolution, excellent picture quality, smooth and sensitive screen touchFree Watch Faces: Match your mood, an outfit or the occasion with a wide selection of more than 400+ stylish watch faces, new watch faces will continue to be added to the watch face store, and more surprises are waiting for you to discover!DIY Yourself: Go for something totally unique with your own favorite pictures. You can upload your favorite pictures as your watch faces, such as your family, pets, idols, etc.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3471579-ecd6-4bb3-85a0-05ba27a97808.__CR0,0,4500,2784_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Answer/ Make call and samrt notification With connection to the app, you can make calls or receive messages from the watch directly",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36f387b1-d875-43d3-bb88-409376b1d811.__CR0,0,4500,1392_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "100+ sports modes and IP68 waterproof The smart watches for women built-in 100+ sports modes and each mode will record your exercise data in real time. It will track your movements and record your achievenemts even under water with IP68 waterproof",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86c52f88-90db-43ad-8be4-20ee5c1a3046.__CR0,0,4500,1392_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Long battery life Lasts for Days: Go non-stop with a long-lasting battery that lasts for days on a single charge. Working time: about 5-7 days; Standby time: 15 days; Low-power mode: 30 days new.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7339f59-5910-4e91-b2ed-7ec665fea19b.__CR0,0,4500,1392_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "All-day monitoring Female Physiological Period Reminder Intelligent predication of physiological period, sage period, menstrual period, and ovulation period, help you to better understand how to take care of yourself. Sleep quality monitoring Accurately monitor your sleep stages, including those of deep sleep, light sleep, awake time, and interpret the chatacteristics to provide your sleep quality score and insight. All-day heart rete monitoring With its advanced biological optical sensor, the watch can maintain continuous 24-hour heart rate monitoring and provide elevated heart rate warnings durning exercise mode.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7e413185-983c-4af3-be50-339bbf3b32df.__CR0,0,800,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/101a5e8a-4b9f-431a-a7b1-1255008abfa0.__CR0,0,800,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/48a7576d-2ada-470b-9a71-e7c569fb2605.__CR0,0,800,800_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Function Description Replace the Watch Dial: Long press the main page for 3 seconds to enter the watch dial replacement page. Or download the replacement dial on the app.Control Center: Slide down to enter the control center. There are: Do not disturb mode; Brightness Adjustment; Settings; Find my phone; System; Shutdown and Setting.Brightness Adjustment: Slide down to the control center and click the brightness adjustment icon to adjust the brightness of your device.Do Not Disturb Mode: Slide down to the control center and click the Do not disturbicon to confrm that do not disturb mode is on.Find My Phone: Slide down to the control center, click Find my Phone icon,and your phone will vibrate to alert you.System: Slide down to the control center, click system to view the system version.Settings: Slide down to the control center and click the settings icon to enter the function setting.Information: Slide up to the control center, click audio icon, open audio mode.Sport Data: Slide once to the left to the sports data page, view the sports data, and record steps, calories, and kilometers separately.Heart Rate: Slide twice to the left to the heart rate page, start measureand show the data.Call Function: This function needs to be connected to audio Bluetooth. When entering the dial, you can enter the phone number and call as needed; long press on the keyboard 7 and 9 to enter*and #Sport Mode: Slide right to enter the list function, click to enter the sports mode and select your preferred sports mode.Weather: Slide right to enter the list function, click the weather iconand view the weather.Music Control: Slide right to enter the list function, click to enter the music control to adjust the upper and lower song titles.Other Functions: Alarm, Clock, Find the watch reminder, Call reminder, Sedentary reminder, Drink water reminder, Low power reminder, Find phone, Timer, Remote camera(start from APP)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03914d1d-564a-4fff-92b5-711ef9fbf627.__CR0,0,4500,2784_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bcf5311c-5fe0-4947-9d7c-ebbea7dc28d8.__CR0,0,4500,2784_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3471579-ecd6-4bb3-85a0-05ba27a97808.__CR0,0,4500,2784_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36f387b1-d875-43d3-bb88-409376b1d811.__CR0,0,4500,1392_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86c52f88-90db-43ad-8be4-20ee5c1a3046.__CR0,0,4500,1392_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7339f59-5910-4e91-b2ed-7ec665fea19b.__CR0,0,4500,1392_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7e413185-983c-4af3-be50-339bbf3b32df.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/101a5e8a-4b9f-431a-a7b1-1255008abfa0.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/48a7576d-2ada-470b-9a71-e7c569fb2605.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03914d1d-564a-4fff-92b5-711ef9fbf627.__CR0,0,4500,2784_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kevin R. Mullins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXQJ5X3M6RNZNE6QZ5QLYDIIFIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22ULQ2RU6HJRG?ASIN=B0CN15NDC8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars A Stylish Powerhouse on Your Wrist...",
                "reviewText": "Pros:* Goldilocks-approved fit* Touchscreen magic* Calling all the shots* Fitness first* Sleep soundly, wake refreshed* Ready for anythingCons:* NoneMy wife loves this watch. For the woman who wants it all - style, functionality, and convenience - the YYZ Smart Watch for Women is a true gem. Forget the clunky, bulky smartwatches that weigh you down.This watch is sleek, elegant, and surprisingly lightweight, making it a comfortable companion for any occasion, from a jog in the park to a night out on the town.* Goldilocks-approved fit: Not too big, not too small, but just right. The YYZ Smart Watch comes in a perfect size for women's wrists, with a slim profile that sits comfortably under even the daintiest of sleeves.* Touchscreen magic: The responsive touchscreen makes navigating the watch's features a breeze. Swipe, tap, and scroll your way through various metrics, modes, and settings with ease.* Calling all the shots: Answer and make calls directly from your wrist! This watch frees you from the tyranny of your phone, allowing you to stay connected hands-free while on the go.* Fitness first: Track your steps, heart rate, sleep patterns, and more with the YYZ Smart Watch's built-in fitness tracker. Stay motivated and informed about your health goals with detailed data at your fingertips.* Sleep soundly, wake refreshed: The sleep monitor provides valuable insights into your sleep quality, helping you identify areas for improvement, and achieve a more restful night's sleep.* Ready for anything: With an IP68 waterproof rating, the YYZ Smart Watch can handle splashes, sweat, and even a dip in the pool—no need to worry about damaging your precious tech during your active lifestyle.* More Than Just a Watch, It's a Statement: The YYZ Smart Watch is more than just a functional gadget; it is a statement piece that empowers women to be stylish, connected, and in control. It is the perfect blend of fashion and technology, making it the ideal accessory for the modern woman on the move.If you are looking for a smartwatch that does it all, look no further than the YYZ Smart Watch for Women. It is stylish, functional, and packed with features to make your life easier and more enjoyable. This watch is an investment in yourself that will pay off in spades for years to come.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kitkat88",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIM36KUZCQICTNVHE4BUWVJPBZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25ZKDFPYGTOI3?ASIN=B0CN15NDC8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Impressive watch & app!! Great price! See update...",
                "reviewText": "I am a hardcore Garmin fan. I have had various Garmin watches for over 10 years. My current is Garmin Venu 2. I can honestly say this watch is equal to, if not better in regards to data and features! In addition to tracking activities, it can be connected to music, used as a trigger for one's phone camera, has a calculator, calendar, business card links to websites, measures blood pressure, heart rate and oxygen levels, on and on! It was super easy to install the app on my phone and pair it with the watch. I have had more difficulty with my Garmin. It's also easy to sync data with the app. The app is user friendly and easy to navigate. One of the reasons I love Garmin is that their Connect App is so great for data tracking. This app is fairly comparable. The watch itself is also a cinch to navigate.Another selling point is that is is a sleek looking watch! I like the magnetic watchband...allowing it to be adjusted to the perfect size. It isn't waterproof, which is unfortunate...but I don't do water sports anyways. Just need to remember to take it off before jumping in the shower or swimming. One feature that is a little peculiar is the magnetic charge connector, instead of a plug in, but that is hardly a criticism...I just haven't experienced such a way to charge and it worked quite nicely!Unfortunately, I haven't contrasted my personal data between the two brands, nor have I really had a chance to see how long the battery lasts before needing recharged. However, as is...I am completely sold, especially because the price is so amazing for all these features! My venu was well over $200 and it doesn't have all these features!! Seriously, this is worth the price! I was looking into buying a new Garmin...I may have already found the replacement!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Travis L.Travis L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSY2MAWZJGOEL3ARMMRWGA5XTFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPLL2WHQN8KTR?ASIN=B0CN15NDC8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Can't set time without pairing with a phone",
                "reviewText": "One of the classiest looking smart watches I've seen. The watch band is metal and has a magnetic clasp so it fits wrists of all sizes even really small ones like my 15 year old daughter. There are a lot of options and apps pre-loaded on it including all of the fitness apps you'd expect, text, phone calls music controls, etc. The watch itself is light and feels like it's made of plastic, but it works really well, and the touch screen is responsive. It requires downloading a free app that requires registration with an email address in order to pair. Overall this is a really good smart watch and it's a great price, but there are a few odd things that don't make or break anything, but wanted to disclose:As far as the odd things:1. There's no way that I can find to adjust the time if it's not paired with a phone. So for anyone just wanting a watch for fitness tracking without connecting it to your phone, you can't set the time to what it should be and there wasn't any options to connect just the watch to wi-fi for it to get updates.2. The dial does turn, but that doesn't control anything like scrolling.3. There is one single button that goes to the app screen meaning there's no \"back\" button if you're a few clicks into an app you can't go backwards one screen...you just have to go back to the main app list and start over.4. I can't figure out why they made this design decision, but the end of the button is a glossy dark green...not a big deal, but it looks a little odd on an otherwise classy looking watch (see the last picture)5. The pairing app requires you to register an account and won't let you move forward unless you enter birthday, gender, height (in cm only) and weight (in kg only). You can reset units to imperial after the fact, but you have to google height in cm and weight in kg at the start.Overal I would recommend it...a watch band like this for an apple or android watch usually costs twice as much as this entire watch!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Q3GoG2rjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81QKJI5RfuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81WWmN-ALIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81wHZlEAcoL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}