{
    "remaining_requests": 48504,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Apple-Smartwatch-Midnight-Aluminum-Detection/dp/B0CHXCXKPD",
    "body": {
        "name": "Apple Watch SE (2nd Gen) [GPS 40mm] Smartwatch with Midnight Aluminum Case with Midnight Sport Loop. Fitness & Sleep Tracker, Crash Detection, Heart Rate Monitor, Carbon Neutral",
        "price": "$189.00",
        "originalPrice": "$249.00",
        "rawPrice": 189.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Apple-Smartwatch-Midnight-Aluminum-Detection/dp/B0CHXCXKPD",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BJMLC7WM"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Midnight Aluminum Case with Midnight Sport Band",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/417f11PNQDL._SS36_.jpg"
            },
            {
                "asin": "B0CHXCXKPD",
                "variationName": "Color",
                "variationValue": "Midnight Aluminum Case with Midnight Sport Loop",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41oPBEVTzPL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Silver Aluminum Case with Storm Blue Sport Band",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41VTz6v-xsL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Silver Aluminum Case with White Sport Band",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31CfzRb+sSL._SS36_.jpg"
            },
            {
                "asin": "B0CHX8RVB8",
                "variationName": "Color",
                "variationValue": "Silver Aluminum Case with Winter Blue Sport Loop",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41xPB+NWrtL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Starlight Aluminum Case with Starlight Sport Band",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/416x3pbCvHL._SS36_.jpg"
            },
            {
                "asin": "B0CHX2F5NJ",
                "variationName": "Color",
                "variationValue": "Starlight Aluminum Case with Starlight Sport Loop",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41s2wuK+FdL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41oYxMYagjL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41j3LutZgPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nqnhRcRmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DK tnh-iL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cMi8f9OnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31BTXbjoNnL.jpg",
            "https://m.media-amazon.com/images/I/B1QwNxUym8S._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6dd733e7-66c8-49fc-a6cf-f1e03a0a7d45/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Apple Store",
            "link": "https://www.amazon.com/stores/Apple/page/77D9E1F7-0337-4282-9DB6-B6B8FB2DC98D?ref_=ast_bln"
        },
        "brand": "Apple",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5050,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 6 hrs 48 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset."
        },
        "features": [
            "CARBON NEUTRAL — Apple Watch SE (2nd generation) paired with the latest Sport Loop is carbon neutral. Learn more about Apple’s commitment to the environment at apple.com/2030.",
            "WHY APPLE WATCH SE — All the essentials to help you be motivated and active, keep connected, track your health, and stay safe. The Smart Stack and redesigned apps in watchOS 10 help you see more information at a glance. With features like Crash Detection and enhanced workout metrics, Apple Watch SE is a better value than ever.",
            "HEALTH AND SAFETY FEATURES — Get help when you need it with Fall Detection, Crash Detection, and Emergency SOS. Get deep insights into your health, including notifications if you have an irregular heart rhythm or an unusually high or low heart rate.",
            "SIMPLY COMPATIBLE — It works seamlessly with your Apple devices and services. Unlock your Mac automatically. Find your devices easily. Pay and send money with Apple Pay. Apple Watch requires iPhone XS or later with the latest iOS version.",
            "SWIMPROOF AND STYLISH — 50m water resistance. Three finishes. And a color-matched back case made with a production process that reduces its carbon emissions.",
            "EASILY CUSTOMIZABLE — With watch bands in a range of styles, materials, and colors and fully customizable watch faces, you can change your watch to fit your mood or the moment.",
            "A POWERFUL FITNESS PARTNER — The Workout app gives you a range of ways to train plus advanced metrics for more insights about your workout performance. And Apple Watch comes with three months of Apple Fitness+ free.",
            "STAY CONNECTED — Send a text, take a call, listen to music and podcasts, use Siri, or call for help with Emergency SOS. Apple Watch SE (GPS) works with your iPhone or Wi-Fi to keep you connected.",
            "APPLECARE — Every Apple Watch comes with one year of hardware repair coverage through its limited warranty and up to 90 days of complimentary technical support. Get AppleCare+ to extend your coverage and reduce the stress and cost of unexpected repairs.",
            "LEGAL DISCLAIMERS — This is a summary of the main product features. See below to learn more."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Apple"
            },
            {
                "name": "Model Name",
                "value": "Apple Watch SE (2nd Generation, GPS)"
            },
            {
                "name": "Style",
                "value": "One Size - fits 130–200mm wrists"
            },
            {
                "name": "Color",
                "value": "Midnight Aluminum Case with Midnight Sport Loop"
            },
            {
                "name": "Screen Size",
                "value": "40 Millimeters"
            },
            {
                "name": "Special Feature",
                "value": "Cycle Tracking, Activity Tracker, GPS, Voice Control, Heart Rate Monitor"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Target Audience",
                "value": "Unisex Adults"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Compatible Devices",
                "value": "iPhone"
            },
            {
                "name": "Case Size",
                "value": "40mm, 44mm"
            },
            {
                "name": "Features",
                "value": "Carbon-neutral combinations available, Retina display (Up to 1000 nits), S8 SiP, Siri, Find iPhone, High and low heart rate notifications, Irregular rhythm notifications, Low cardio fitness notifications, Cycle Tracking with retrospective ovulation estimates, Emergency SOS, International emergency calling, Fall Detection and Crash Detect, 50m Water-resistant, Swimproof, GPS"
            },
            {
                "name": "Whats in the box",
                "value": "Aluminium Case, Watch Band, 1m Magnetic Charger to USB-C Cable"
            },
            {
                "name": "Connectivity",
                "value": "802.11b/g/n 2.4GHz and 5GHz, Bluetooth 5.3"
            },
            {
                "name": "Power",
                "value": "Up to 18 hours of battery life"
            },
            {
                "name": "Width",
                "value": "34mm, 38mm"
            },
            {
                "name": "Depth",
                "value": "10.7mm"
            },
            {
                "name": "Case Weight",
                "value": "40mm: 30.49g, 44mm: 36.20g"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "sung",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOGOPRPQYV3HR2DDX5UJHL6SHYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2F43IHQBKCBL6?ASIN=B0CHXCXKPD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Best for the money, Better deal for the money than Ultra and 9",
                "reviewText": "The Apple Watch SE (2nd Generation) [GPS 40mm] with a Silver Aluminum Case and Storm Blue Sport Band is a popular option in Apple's smartwatch lineup. Here's a brief review focusing on its features and potential limitations:Pros:Design and Aesthetics: The silver aluminum case paired with the storm blue sport band offers a sleek and modern look, appealing to a wide range of users. The design is both stylish and functional.Performance: As a 2nd generation model, it boasts improved performance over its predecessor, with faster and more efficient processing capabilities.Health and Fitness Tracking: The watch excels in health and fitness tracking, offering a variety of features like heart rate monitoring, step counting, and workout tracking, making it ideal for fitness enthusiasts.User Interface and Experience: The watchOS provides an intuitive and user-friendly interface, with easy navigation and access to a wide range of apps and functionalities.Battery Life: It offers a decent battery life for a smartwatch, sufficient for daily use without frequent recharging.Cons:Price: While more affordable than some other models in the Apple Watch series, it still carries a relatively high price tag, which might be a consideration for budget-conscious buyers.Limited Compatibility: Best suited for users already within the Apple ecosystem, as some features might not be fully available or optimized when paired with non-Apple devices.No Always-On Display: Unlike the higher-end models, the SE does not feature an always-on display, which means the screen goes dark when not in use.Health Features: While it has robust health tracking, it lacks some of the advanced health features found in the more expensive Apple Watch models, such as blood oxygen monitoring and ECG.In summary, the Apple Watch SE (2nd Gen) [GPS 40mm] with a Silver Aluminum Case and Storm Blue Sport Band is a stylish and capable smartwatch, offering a balanced mix of features and performance. It's an excellent choice for those who prioritize health and fitness tracking, seamless integration with the Apple ecosystem, and a modern design. However, its price, compatibility limitations with non-Apple products, and the absence of some advanced health features are factors to consider.",
                "reviewVotes": "122 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick Pilcher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSP32MSJHS7QIDGM7ZOIKRXTF4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VURY9RZB0MB4?ASIN=B0CHXCXKPD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars The Perfect Combination of Style and Functionality - Apple Watch SE (2nd Gen) with AppleCare+!",
                "reviewText": "I recently upgraded to the Apple Watch SE (2nd Gen) [GPS 44mm] with the Silver Aluminum Case & White Sport Band, and it has been an absolute delight. The inclusion of AppleCare+ for 2 years makes this purchase even more valuable.Firstly, the design of the watch is sleek and modern. The silver aluminum case is both lightweight and durable, making it comfortable for all-day wear while also looking stylish. The white sport band is soft, breathable, and easily adjustable, perfect for my daily workouts and casual wear.The 44mm screen size is ideal for me. It’s large enough to easily read and interact with, but not so big that it feels bulky or obtrusive on my wrist. The display is bright and clear, making it effortless to check time, messages, or use apps, even in bright sunlight.Functionality-wise, the Apple Watch SE (2nd Gen) is a powerhouse. The GPS is accurate and quick to connect, which is great for my outdoor runs and hikes. The fitness tracking features are comprehensive, providing detailed insights into my workouts and overall health. The heart rate monitor and new features like the sleep tracker have been incredibly useful for keeping tabs on my wellness.The integration with my iPhone is seamless, allowing me to receive notifications, take calls, and respond to texts directly from my wrist. It's incredibly convenient and helps me stay connected without being tethered to my phone.What sets this package apart is the AppleCare+ for 2 years. It gives me peace of mind knowing that my investment is protected against accidental damage and malfunctions. The customer service and support from Apple have always been top-notch, and this added warranty only enhances the overall value.Battery life is also commendable. It easily lasts through a day of heavy usage, and with the fast charging feature, I’m never out of action for long.In summary, the Apple Watch SE (2nd Gen) with AppleCare+ is a fantastic combination of style, functionality, and security. Whether for fitness tracking, staying connected, or just as a fashion statement, this watch is a perfect choice. I highly recommend it to anyone looking for a high-quality, versatile smartwatch.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grace B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZW2EGUMVRN6PTKPAQ66FTF6DUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REV5NSCN39043?ASIN=B0CHXCXKPD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Great watch, happy with value for money",
                "reviewText": "It motivates me to exercise more and gives me valuable insights into my health while also allowing me on the go conveniences that I need at my job - so I no longer need to carry my phone around while I’m with clients. I appreciate features like heart rate, having timers, and being able to customize the watch interface. In the photo I have a cow print case on to protect the watch, but the color of the watch is gorgeous in person too.I’m hoping that there’s a way to reorganize the order of the apps so I can put my most used ones at the top, but I haven’t figured out if that’s possible yet. Battery life is okay, not impressive but also not too shabby. To its credit, it comes with a charger and charges and charges quickly.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVVB4ZPRAZEFD4FD7VMKYBBXNXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R124N5F5P9109V?ASIN=B0CHXCXKPD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent watch and seamless if you have iPhone",
                "reviewText": "Upgraded to the SE from Fitbit Versa 2 (which I really liked). If you have an iPhone this is a no brainer and works so much more seamlessly than the Fitbit did. Essentially a mini phone in your wrist. Only drawback is Battery is not as good as Fitbit.Also these do have the double tap/pinch capabilities like the new watch 9 does. Just have to setup in accessibility settings.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}