{
    "remaining_requests": 48406,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ddidbi-Activity-Monitoring-Waterproof-Smartwatch/dp/B0CKRJR2TH",
    "body": {
        "name": "Ddidbi Smart Watch for Women(Answer/Make Call), 1.85\"Touch Screen Fitness Watch, Activity Trackers with Heart Rate, Sleep Monitoring, 112 Sport Modes, IP68 Waterproof Smartwatch for iOS Android, Pink",
        "price": "$29.99",
        "originalPrice": "$26.99",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ddidbi-Activity-Monitoring-Waterproof-Smartwatch/dp/B0CKRJR2TH",
        "soldBy": {
            "sellerID": "A37YFJBR7I6PEM",
            "name": "kangwuyan87",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A37YFJBR7I6PEM&asin=B0CKRJR2TH&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CGX7QDSF"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C1N9VDMM",
                "variationName": "Color",
                "variationValue": "Mysterious Black",
                "price": "$29.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/517f9EruQ-L._SS36_.jpg"
            },
            {
                "asin": "B0CKRJR2TH",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "$19.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51QQzsS6nXL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51QQzsS6nXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41U984TehxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ddURYwsmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qWkK7IntL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VvA77H3WL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SUg-jJvLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41X36PRb7RL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e2dc40a-9bb5-4c00-8490-18862c316bba/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Ddidbi",
            "link": "https://www.amazon.com/Ddidbi/b/ref=bl_dp_s_web_69427060011?ie=UTF8&node=69427060011&field-lbr_brands_browse-bin=Ddidbi"
        },
        "brand": "Ddidbi",
        "merchantInfo": "kangwuyan87",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 3256,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 6 hrs 32 mins",
            "Or fastest delivery Thursday, February 15"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Smart Calling and Notifications: When your Smart watch is connected to your phone, you can make and receive calls directly from your wrist using the built-in microphone and speaker. Additionally, the smartwatch will notify you of received messages and notifications from applications like Facebook, Twitter, or WhatsApp through vibrations, ensuring you stay updated even during workouts or while driving.",
            "1.85-Inch Full Touchscreen and Custom Watch Face Options: The P66D men watches features a 1.85-inch full touchscreen, offering more operating space and significantly enhancing user satisfaction. The \"Gloryfit\" application offers hundreds of watch faces to choose from. Furthermore, you can customize your own watch face with your favorite images, making it truly unique to your style.",
            "Designed for Various Sports: The fitness tracker is tailored to meet the needs of numerous sports enthusiasts, supporting over 100 different activities such as walking, running, cycling, basketball, and soccer. The accompanying app tracks your exercise routines, including steps, heart rate, calorie expenditure, and distance, and generates comprehensive health reports. This watch is rated IP68 waterproof, allowing you to wear it even in rainy conditions or while swimming.",
            "Health Companion: This smartwatches utilizes high-performance sensors to ensure precise monitoring and can track our heart rate 24/7 in real-time. It also automatically monitors your sleep patterns throughout the night and provides a comprehensive analysis of your sleep quality. The accompanying application allows you to access historical data to make reasonable adjustments to your lifestyle.",
            "Smart Living Assistant: This watch for men women offers a variety of features to make your daily life more convenient, including alarms, stopwatches, music control, weather forecasts, sedentary reminders, phone search, camera remote control, and more. This will enhance the convenience of your life, with more features waiting for you to explore. The 280mAh battery allows the watch to be used for approximately 7 days in daily use and up to 15 days in standby mode."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "10.67 x 3.39 x 0.67 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.38 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CKRJR2TH"
            },
            {
                "name": "Item model number",
                "value": "P66D"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 3,256 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,882 in Electronics (See Top 100 in Electronics) #833 in Smartwatches"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Pink"
            },
            {
                "name": "Whats in the box",
                "value": "Smart watch*1, Pink watch band*1, User manual*1, Magnetic charger*1"
            },
            {
                "name": "Manufacturer",
                "value": "Ddidbi"
            },
            {
                "name": "Date First Available",
                "value": "October 9, 2023"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page 1 BLUETOOTH CALLING 2 INTELLIGENT NOTIFICATION 3 WEATHER FORECAST",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page 1 WEEKLY HEALTH REPORTS 2 HEART RATE MONITOR 3 SLEEP MONITOR 4 ACTIVITY TRACKER",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/109f3838-85ec-4316-bf4c-08f898a99bfe.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/68105e13-4163-4396-b997-11580e6044bd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24e16257-cfec-4ccb-bd2b-e93b879dbe3f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9b6f0882-dba9-42d2-8916-5f64c297d88e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ef0b8771-e201-434a-a3de-3d809e2d4eaa.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fff6effe-561a-4875-8178-ad9558759217.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76a836a7-c93a-462c-bb47-bffb7ba7e162.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a52a2f7-1f5f-42db-83dd-a74481b6d947.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/707b06d9-f296-4132-888d-e1984c875ab8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/544b1fc6-ef69-482d-92b5-16cd7bbb50db.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/85685fd3-3304-4766-b4de-03402694f01d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ZuSu  (£цэ!#)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNQ4LZ7IDK54GIKCMDUKP5TZ35Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQU4RXM5718UK?ASIN=B0CKRJR2TH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2023",
                "reviewTitle": "5.0 out of 5 stars The Best Smartwatch You’ll Find Under $40",
                "reviewText": "In short, in my limited experience this seems to be the best smartwatch you will find under $40. What sets this watch above the rest are ease navigation/ use, very useful watch faces, fairly accurate biometrics, and an ability to hold 100 phone numbers. Things that could be better are: the display resolution, music control/ information, and the need for dual Bluetooth connections to make calls.I never owned a smart watch. This was my first and I bought it because it was one of the most purchased and best reviewed smart watches on Amazon. Since then I have tried others, and while each may be better in one or two ways, this seems to be the best overall at this price point.Packaging was simple in a slim cardboard box. It came with the watch, a charger, an extra strap and instructions. The watch needed some charging, for about two hours, before use.The watch requires the “Gloryfit” app on you phone. So far, the app and the watch have worked. Through the app you can sinc 100 contacts, change weather and biometric data from metric to imperial units as well as log activity much like you can on the watch. Addition watch faces are available for download via the app as well.The watch itself has five standard faces plus one or two downloadable faces and five themes to arrange the apps. I have to say while the standard faces aren’t the most artistic, at least a couple present all the health and date/ time information you’d want on a single face. The watch will hold a charge for 7-14 days, though that depends on use. The watch is water resistant to the IP68 standard, which is enough to handle water sprays, but submersion is not recommended. So far I have not had issues with water intrusion during hand washing and cleaning. I have not swam or showered with the watch on, nor do I plan to do so.The watch health features include a heart rate monitor, step monitor, distance monitor using your phones GPS. I believe it uses the step/ distance to calculate calories burned each day. The watch has a blood O2 monitor that when activated takes a minute to read your blood O2. There is a sleep monitor that somehow monitors and calculates deep sleep and light sleep. The pulse, step/ distance monitor all seem to be accurate. I have no way to know if the O2 monitor is accurate and the sleep monitor is a bit hit and miss on me. Some nights it’s accurate (I think). Other nights it doesn’t register any sleep for me, though in fairness I am a light sleeper and I wake several times a night.The watch also displays the current weather or at least temperature in degrees Celsius but you can change it to Fahrenheit in the app. If you scroll down from the weather display, you will also see the six or seven day forecast.The music player is limited to play/ pause and track skipping forward and backwards. The song playing does not transmit to the watch or at least it is not shown. And honestly, this is my one of few complaints about the watch.You can make calls from the watch and the microphone and speaker are surprisingly good. My calls were clear and the other parties had no idea I was using a watch. Making or answering calls does require a connection both through the app and Bluetooth (or a double Bluetooth connection) If you lose the Bluetooth connection, you will not be able to answer calls from the watch. I found the easiest way to reconnect Bluetooth if it is disconnected is to simply power cycle the watch. Contacts do appear for / on calls, but only if they are on your 100 contacts that you can sinc in the app.The watch also receives texts. Again, you only see the sender’s name if they are in your watch’s contacts. You can’t type a text response, but I’m not sure who would want to on a watch. Notifications from Facebook or what’s App the other hand actually always show the sender.Overall the watch has nice features for the price. But the ease of use, intuitive menu and functions, ability to hold 100 phone numbers, and accurate bio data set this watch apart from other watches at this price point. I do wish the music functionality was better and I could see the song playing on my phone. I also would appreciate a better screen resolution and a one-click connection. Still given the functionality and execution of the features you do have, this is the best smartwatch you will find under $40. Five stars.",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXMTDUDYNUSRK6RHUN6ASWGC2GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R45MQ1EOJR44F?ASIN=B0CKRJR2TH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Budget friendly, would make a good gift for kids.",
                "reviewText": "This is a very budget friendly smart Watch offers excellent value for its affordable price tag. While it may lack advanced features, it delivers essential functionalities without breaking the bank. The sleek design and decent build quality make it comfortable to wear and durable. Basic fitness tracking capabilities, including step counting and calorie monitoring, provide an overview of daily activities. The smartwatch easily connects to your smartphone, allowing you to receive notifications on your wrist for calls, messages, and apps. With a satisfactory battery life lasting a couple of days, it keeps you connected without frequent recharging. Compatible with both iOS and Android devices, it accommodates a wide range of users. Extras like remote camera shutter and music controls add convenience. Overall, the $40 Smart Watch is a cost-effective choice, offering functionality and style for those seeking an affordable smartwatch solution.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWJN44MOCY47732G6ERPHG2NSKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BMHLSE0JIENK?ASIN=B0CKRJR2TH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 2, 2023",
                "reviewTitle": "4.0 out of 5 stars Works Good.",
                "reviewText": "Watch looks good. The band is comfortable and looks clean. It comes with 2 bands. It took a while to get it working the way it's supposed to. Once I figured it all out, I have to say I'm satisfied. Especially for the price compared to others. If your older and aren't used to dealing tech, you may want a grandkid to help. 2 reasons for 4 star review and not 5. 1. 5 stars means that it is amazing and excedeeds expectations, which it doesn't do. 2. I received a solicitation about a month later offering me $30 if I gave it 5 stars. Some people would say I'm a fool for not taking the $30 but I don't care what those people think. This is my 1st smart watch so I have nothing to compare it to. It is a handy watch once you get used to it.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFS6BDDQSJDMFIMVJKKE7K2FR2NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E64LH5G94UMT?ASIN=B0CKRJR2TH",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2023",
                "reviewTitle": "1.0 out of 5 stars Second time was the same - PIECE OF TRASH",
                "reviewText": "Everything sounded just like what I wanted and there were good reviews. But when it arrived the manual was totally useless. I loaded the Ap so the watch could connect to my phone and the Ap would never respond to me. I reloaded the Ap twice with the same results. So if the phone couldn't connect to the Ap then it was also useless. I gave up and sent it back.UPDATE REVIEW - After posting the above review, I received a message expressing the company's concern for my problems. I was offered three choices for making good on the watch. I chose to give them one more chance and was promised a new watch to be sent ASAP. I was surprised to receive the new watch in three days and upon setting it up, it went very smoothly. I am now very impressed with the watch. The only reason I now give it 4 stars is because some of the communications between me and the company were written in Chinese ! Once the language barrier was corrected things went well.SECOND UPDATE: UNTIL I wore it for a month trying to give it every chance to prove itself. It would not stay connected to the ap. It would not sync to most of the functions. Its only saving feature was it did tell the time and date....that's all ! I sent the first one back and the company sent me a replacement. So this second is even worse than the first after one month of continuous attempts to make it work. I have thrown the second one into the trash and have learned a valuable lesson; YOU GET WHAT YOU PAY FOR. Save yourself the trouble look elsewhere (USA).",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ginger Sugarbaker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG22AHL7GEL354INAN7Y6NRF5U7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OG6CB6QNL786?ASIN=B0CKRJR2TH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice First Smart Watch!",
                "reviewText": "This is my first smart watch and I have to say it is a lot nicer than expected for the price. I like being able to track my heart rate and steps, along with sleep time, etc. It's also nice to be able to have my text messages show up on the watch, but the font size is a little small to read and I don't see a way to adjust that in the watch settings. Battery life is pretty good, I usually only have to charge it once a week and the charging process is pretty fast. The rubber wrist bands were not a good fit for me, but I was able to find other stretchy band options to fit it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tom",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 3, 2023",
                "reviewTitle": "Très bien",
                "reviewText": "une montre très fonctionne parfaitement et possède un très grande nombre de fonctions très utiles.L appairage se fait sans difficulté avec la montre.Je n ai pas encore testé les modes sport je ne peux donc pas m exprimer sur la précision du GPS ou encore le cardio.L autonomie est top !!Seul point négatif ce sont les fonds d écran qui ne sont pas nombreux ou alors je ne cherche pas au bon endroit. J aurai souhaité des cadrans plus « classiques » c est à dire moins sportwear, pour le travail par exemple. D ailleurs si l on peut me renseigner à ce sujet…. Merci d avance !Très bon rapport qualité prix aux vues de toutes les options qu elle propose.Très bon achat",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Douchplu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 10, 2023",
                "reviewTitle": "Bueno, bonito y barato.",
                "reviewText": "Tiene un gran abanico de funcionalidades, viene con una correa de respuesto, es comodo e intuitivo de usar y ajustar, autonomía de la batería suficiente, en resumen cumple con su función, habrá que evaluar la calidad y durabilidad del reloj a medio/largo plazo para determinar si ha sido una buena compra, de momento pinta bien.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aure",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on September 27, 2023",
                "reviewTitle": "1mois et l’écran ne marche plus!",
                "reviewText": "The watch worked for 1 month and after that it suddenly stopped. I never went under water or used it in extreme sports. This isn't oke. it's a shame. I tried to send it back but it will cost me another 50euros. Not understandable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jóséph",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 3, 2023",
                "reviewTitle": "Reloj de datos interesante",
                "reviewText": "Lo compre por curiosidad para regalar y al final me lo he quedado. Uso la pantalla que viene de fábrica y es muy intuitivo. Lo tengo todo desactivado pq al sincronizarlo con la app (Glory Fit) esta todo el rato vibrando ya sea por notificaciones o por llamadas y la bateria dura menos. Por tanto cada vez que quiero q se encienda la pantalla le doy al boton y asi la bateria dura 5-7 dias. El cargador va con unos imanes que vienen algo flojos pues me lo he llevado dentro del neceser de viaje y han llegado fuera de su sitio. Consulté comprar el cargador solo y me contestaron que en un futuro si lo venderian suelto La carátula de la pantalla se cambia desde la app de modo super facil y hay un pontón de opciones. La relacion calidad - precio la creo excelente y asequible a muchos bolsillos. Resistente duradero y se me moja al lavarme las manos o al lavar platos por debajo y no da problemas. Para una ducha me lo quito eso si! Le he dado golpes o ralladuras con paredes granulas y no le pasa nada ...MUY SATISFECHO !!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bruno",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 7, 2023",
                "reviewTitle": "Top mais pas trop",
                "reviewText": "Ce produit marché impeccable pour l'exercice physique, les applications sont top sauf le suivi du sommeil,i impossible à la faire fonctionner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}