{
    "remaining_requests": 48503,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Galaxy-Watch-Pro-Smartwatch-Bluetooth/dp/B0BQZG6D46",
    "body": {
        "name": "Samsung Galaxy Watch 5 Pro 45mm Smartwatch with GPS, LTE, Sleep Coaching, and Fast Charger - Renewed",
        "price": "$169.99 - $159.99",
        "originalPrice": "$249.99",
        "rawPrice": 169.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Galaxy-Watch-Pro-Smartwatch-Bluetooth/dp/B0BQZG6D46",
        "soldBy": {
            "sellerID": "AT1DRI0SUE1WL",
            "name": "Chubbiestech",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AT1DRI0SUE1WL&asin=B0BQZG6D46&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BQZDCYQY"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BQZHHQZD",
                "variationName": "Color",
                "variationValue": "Black Titanium",
                "price": "$153.94",
                "variationImageURL": "https://m.media-amazon.com/images/I/41NhhmdnB3L._SS36_.jpg"
            },
            {
                "asin": "B0BQZG6D46",
                "variationName": "Color",
                "variationValue": "Gray Titanium",
                "price": "$169.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41JwlO1lbaL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": false,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41JwlO1lbaL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41WLzG56fBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41dOTXHI-pL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pl Y9t9OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31BHrhLyK5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51f2XfNBIwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Sm2vpZrTL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon Renewed",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Chubbiestech",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 239,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 14 - 15. Order within 19 hrs 48 mins.",
            "FREE delivery February 14 - 15. Order within 19 hrs 48 mins."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "1.4'' Super AMOLED, 450x450px 321ppi, Exynos W920 Dual-core 1.18GHz, 590mAh Battery, Android Wear OS 3.5, One UI Watch 4.5, Bluetooth 5.2, Wi-Fi",
            "GPS route and Auto Workout Tracking, 2x tougher Sapphire crystal glass face , Water-resistant",
            "Advanced Sleep Coaching analyzes your sleep stages, then provides tips, and sleep reports to manage your overall sleep quality",
            "Get more accurate wellness readings with the redesigned BioActive Sensor. The improved shape gets closer to your skin to track your heart rate and more",
            "Compatible with Android and iOS devices. Supports SAMSUNG Pay. 4G LTE Bands: B2 (1900 MHz), B4 (1700 MHz), B5 (850 MHz), B12 (700 MHz) - eSIM. Cellular LTE model Compatible with GSM and CDMA Carriers like T-Mobile, AT&T, Verizon, etc. Contact Carrier to Register",
            "Band colorgrey",
            "Water resistance levelwater_resistant"
        ],
        "description": "Take on your ultimate adventure with Galaxy Watch5 Pro. It’s our most advanced outdoor watch yet, featuring a 2x stronger Sapphire Crystal Glass display. Power through intense activities, even with GPS on, with a long-lasting battery. Stay on the right trail even in unfamiliar terrain thanks to voice or vibration guided turn-by-turn navigation. Push your body further with accurate sensors that help keep a closer eye on your heart rate, and BIA measurements that help you track your physique. Get the rest you need to stay energized on your journeys with Advanced Sleep Coaching. Look sharp on every expedition with bands and watch faces that you can match to any outfit. Plus, pair your watch with the rest of your Galaxy for a connected network of devices that work together to help go stronger and harder than ever before. Whether you’re hiking, kayaking or camping, get ready to take it to the extreme with Galaxy Watch5 Pro.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Women",
                "link": "https://www.amazon.com/Womens-Fashion/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7147440011"
            },
            {
                "name": "Watches",
                "link": "https://www.amazon.com/Womens-Watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=6358543011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/Womens-Smartwatches/b/ref=dp_bc_aui_C_4?ie=UTF8&node=14130291011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "0.41 x 1.79 x 1.79 inches"
            },
            {
                "name": "Item Weight",
                "value": "7 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0BQZG6D46"
            },
            {
                "name": "Item model number",
                "value": "Galaxy Watch5 Pro"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 239 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,745 in Electronics (See Top 100 in Electronics) #5 in Women's Smartwatches #8 in Men's Smartwatches #11 in Renewed Smartwatches"
            },
            {
                "name": "Date First Available",
                "value": "December 23, 2022"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Samsung Electronics"
            },
            {
                "name": "Standing screen display size",
                "value": "1.4 Inches"
            },
            {
                "name": "Brand",
                "value": "Samsung"
            },
            {
                "name": "Model Name",
                "value": "galaxy"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Color",
                "value": "Gray Titanium"
            },
            {
                "name": "Screen Size",
                "value": "1.4 Inches"
            },
            {
                "name": "Special Feature",
                "value": "GPS"
            },
            {
                "name": "Shape",
                "value": "Round"
            },
            {
                "name": "Target Audience",
                "value": "Unisex Adult"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Skipper McFearson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRQ7IA2ROYKGMFEA6STKNUSJCKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R227U191IV4ZE?ASIN=B0BQZG6D46",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Miles better than my previous fitness watch",
                "reviewText": "I had another higher end fitness watch for about 24 days but that product was extremely inaccurate for fitness functions. This one has been on my wrist for about a week and it is a significant improvement. I was a little concerned buying a pre-owned item but the price was just too good and I was very surpised at the excellent condition of the watch upon arrival. Pros: accuracy, display, watch face options, overall functionality. One of the highlights that I did not expect was the auto recognizing of my exercise. It typically will begin within one minute regardless of what I am doing. Cons: My only issue with the watch is the charger interface. I have an official samsung charger but the magnet is so weak that you have to connect the two and then very gently set it down or the charger puck disengages from the watch. I had to buy a charging stand to address that issue. Very highly recommended fitness watch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Just Louie....",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETIDJCIB6K7RCEVAEUHUSSQE74A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RG0MHN3CA2CHP?ASIN=B0BQZG6D46",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Great smart watch",
                "reviewText": "Battery last forever. Bright face. Still learning what all I can use it for but it's quick to connect to my new S24+ and with the Wear app it's offers me a plethora of data.Also, it came in excellent condition and arrived quickly. I highly recommend this Galaxy 5 Pro smart watch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV7O3465AE4ZVQYWRJLNGATUYLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UZ7CSC9I3A22?ASIN=B0BQZG6D46",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Upgraded from Watch 3, everything is better and faster",
                "reviewText": "I had a Galaxy 3 for almost 3 years and thought it was a great product. I got the BP to work but when I upgraded my phone, it erased the app and no longer supported so I was out of luck. Upgrading to the Watch 5 pro was easier than I expected, almost everything transferred easily with no issues (Samsung S23 Ultra). Activating mobile plan took 60 seconds and for $5 a month, it's hard to beat. The watch itself is about the same size as my old 3, but lasts twice as long, with everything on it's good for maybe 2 days. Like having GPS and Mobile network so I can leave the phone at home when I want to, which is liberating. Listen to spotify, audible with earbuds and no phone needed is easy to get used to. For under 200 refurbished, I'm completely satisfied as mine only had a couple smudges and looked new otherwise. I was also able to get the BP working (U.S.) with an onboard software mod that makes the entire process easy. The readings are fairly accurate for me, just like the 3 was. Calibrating showed it only off a few points. Best choice for android, especially samsung.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFOF4MDT3HHDSLEBMJBHBSRQETA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SUE3IODSJ91W?ASIN=B0BQZG6D46",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Good watch with some software issues.",
                "reviewText": "It's a good watch, but there are some disappointing experiences:1) First time I went for a run and wanted to test out the cellular connection, it overheated and told me to wait. This happened twice since I've owned the watch, and it's usually been on actually hot days. I do have a protective cover, so that may be part o the problem.2) Run tracking is buggy...sometimes. I often start my run from my front door, where my watch has a connection with either my WiFi or phone. When I start a run from this location, it always seems to have trouble determining how far I've run. I'll be 3 minutes into my run and it will say I've done a mile (I wish!). If I bring my phone with me, there is no issue. If I drive to a trail and run it does perfectly fine. I have the feeling their run tracking is using a WiFi rough location to start my run.3) Spotify. This won't count against the watch so much, because it's probably mostly a software issue. I would think it's a pretty good chance that using Spotify with headphones while you're not around your phone is a pretty good use case for a cellular watch. This does work, but it's really not intuitive to use. Sometimes the Spotify UI will just sit there and not tell you whether it's trying to play something, or if it's loading, or whatever. You can literally sit there for minutes fiddling around trying to figure out what Spotify is trying to do. Sometimes when it does work, the events are delayed. For instance I may have chosen a song 10 seconds ago, and gotten no feedback from the UI, yet it will eventually play something.4) Google's apps aren't fully integrated. It's like they're still not fully committed to wearables. For instance, if someone is at the door, you will get a notification. Would you like to see who it is? Well, you will have to go find your phone. There are many apps that don't show useful notifications on the watch. There is so much opportunity to make wearables actually much better than they are, and it's frustrating that Google just doesn't put in the effort.That's pretty much the bad stuff. Now for the good news. When this watch works, it does a really nice job. The watch faces built in are really nice IMO, and you can customize them pretty well with useful shortcuts. (I added a shortcut to start a workout and another to set a timer). We do get Google Assistant now, and I've assigned mine to be triggered by long pressing one of the buttons. Google pay works fine for me. In my experience the battery is much much better than my previous Android watches, which removes some level of anxiety. The build quality is great. I am rough with my watches, and the screen on this one is pretty much scratch free at this point. I take this in the pool and in the shower, so absolutely no issues with water exposure. The workout tracking software is actually great when it is recording correctly.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOVZJOVZ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ4DZO5MZVLFZ5K7IYUXO6G2SFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P5BIBT662T5A?ASIN=B0BQZG6D46",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Good quality.",
                "reviewText": "thanks to the seller and I bought this watch even though it is used, it is in good condition and has no damage. it is nice to use it every day at work.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71VEQhtjOlL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$169.99",
                "sellerName": "Chubbiestech",
                "sellerRating": "4.5"
            }
        ]
    }
}