{
    "remaining_requests": 48331,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fitbit-Versa-Smart-Aluminium-Included/dp/B07B48SQGT",
    "body": {
        "name": "Fitbit Versa Smart Watch, Black/Black Aluminium, One Size (S & L Bands Included)",
        "price": "$134.99$68.91",
        "originalPrice": "$199.95",
        "rawPrice": 134.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fitbit-Versa-Smart-Aluminium-Included/dp/B07B48SQGT",
        "soldBy": {
            "sellerID": "A3VJ6TJ1OPXDJS",
            "name": "RTEssentials",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3VJ6TJ1OPXDJS&asin=B07B48SQGT&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B082GR49ZH"
        ],
        "asinVariationValues": [
            {
                "asin": "B07B48SQGT",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$134.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41DTwqZxWWL._SS36_.jpg"
            },
            {
                "asin": "B07B43ZTT7",
                "variationName": "Color",
                "variationValue": "Charcoal Woven",
                "price": "$139.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41MDifM1hYL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "Only 4 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41DTwqZxWWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41DrBbHBVdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41si5ryiCwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iC BBuevL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gCbeVKZvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419qBFaqnzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51J5p g3QGL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/ff8b2b4b-74da-5c8b-bce8-f40fa29b37ec/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a3e591aa-4c6d-4c9a-96ad-1dd84ed48cc7/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/143f8190-3ee0-4899-87bf-cf3e9931a0be/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3f481d8-e1bf-416f-831e-f5d9457cbac6/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Fitbit Store",
            "link": "https://www.amazon.com/stores/Fitbit/page/8C0C1BB6-B75A-4447-B068-50D4FE8F070C?ref_=ast_bln"
        },
        "brand": "Fitbit",
        "merchantInfo": "Sold by Value Stock and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 9418,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17. Order within 6 hrs 21 mins",
            "FREE delivery Friday, February 16. Order within 6 hrs 21 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Includes all Versa Lite Edition features plus: store and play 300 plus songs, utilize on screen workouts that play on your wrist and coach you through every move and track swim laps and floors climbed",
            "Track your all day activity, 24/7 heart rate, & sleep stages, all with a 4 plus day battery life (varies with use and other factors), charge time (0 to 100 percent): two hours. Slim, comfortable design with a lightweight, anodized aluminum watch body",
            "Use 15 plus exercise modes like run or swim (Fitbit versa is water resistant to 50 meters, we do not recommend wearing charge 3 in a hot tub or sauna.) To record workouts and connect to Smartphone GPS for more precise real time pace & distance",
            "Access your favorite apps for sports, weather & more and get called, calendar, text, and app alerts. Syncing range - up to 30 feet",
            "Get call, text, calendar and smartphone app notifications when your phone is nearby. Plus send quick replies on android only. Operating temperature 10 to 60 degrees celsius",
            "Automatically track select sports & workouts with smarttrack and use female health tracking in the fitbit app to log periods, symptoms and more",
            "Radio transceiver: bluetooth 4.0. Compatible with iphone, android & windows phones"
        ],
        "description": "Live your best life with the Fitbit Versa family of health and fitness smartwatches. The Versa Lite Edition includes core fitness and smart features like activity, sleep and heart rate tracking, notifications, apps and 4+ day battery life—plus bold color choices and an easy one button design. Fitbit Versa includes all the features of Lite Edition plus music, on screen workouts, floors climbed and swim lap tracking. Finally, the Versa Special Edition includes all the features of Versa, plus a special woven band and on the go payments with Fitbit Pay.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Time Display, Sleep Monitor, Calendaring, Text Messaging, GPS, Notifications, Heart Rate Monitor"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            },
            {
                "name": "Operating System",
                "value": "Android"
            },
            {
                "name": "Water Resistance Level",
                "value": "Water Resistant"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Supported Application",
                "value": "Fitness Tracker"
            },
            {
                "name": "Water Resistance Depth",
                "value": "50 Meters"
            },
            {
                "name": "GPS",
                "value": "True"
            },
            {
                "name": "Controller Type",
                "value": "iOS, Android"
            },
            {
                "name": "Battery Cell Composition",
                "value": "Lithium Ion"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "Bluetooth"
            },
            {
                "name": "Screen Size",
                "value": "3 Inches"
            },
            {
                "name": "Item Weight",
                "value": "0.32 Pounds"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "1.98 x 3.98 x 9 inches"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 9,418 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25,371 in Electronics (See Top 100 in Electronics) #732 in Smartwatches"
            },
            {
                "name": "Brand",
                "value": "Fitbit"
            },
            {
                "name": "Model Name",
                "value": "Fitbit Versa"
            },
            {
                "name": "Target Audience",
                "value": "Unisex Adult"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Model Number",
                "value": "FB504GMBK"
            },
            {
                "name": "Included Components",
                "value": "Fitbit Versa"
            },
            {
                "name": "Target Gender",
                "value": "Female"
            },
            {
                "name": "Band Material Type",
                "value": "Aluminium,Aluminum"
            },
            {
                "name": "Case Material",
                "value": "aluminium"
            },
            {
                "name": "Style",
                "value": "Original"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Shape",
                "value": "Heart"
            },
            {
                "name": "Band Color",
                "value": "black"
            },
            {
                "name": "Sport",
                "value": "Wireless"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Smartwatch Comparison Activity & Sleep 24/7 Heart Rate Swimproof up to 50m On-screen workouts Store 300+ songs Fitbit Pay Activity & Sleep 24/7 Heart Rate Swimproof up to 50m On-screen workouts Store 300+ songs Fitbit Pay",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/3ea362c8-336f-4c00-a11f-3eb1739d51e5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e3b3bf76-cbf7-4555-a608-a4b303263385._CR0,0,488,700_PT0_SX488__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ebeb2f19-2670-46ba-b7b4-8fd4aca6a4cf._CR0,0,488,700_PT0_SX488__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/aa0add74-a14a-40a7-ac87-46eecaaf213d._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/74498e09-45b2-44dc-961a-4305272b5b5f._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a9d7cb97-9931-4d9e-b9a3-69febcd79f24._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/305fe5ec-c151-4cf8-9eec-8f75edc923e2._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/598a754d-3aa6-43f2-9b6a-aa13d2a6cb42._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/133394da-21ac-404d-b460-dff830b236d8._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a1c316f6-17b7-4182-9553-dbe2c806d2b5._CR0,0,1464,600_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/640d7b8e-355a-4b85-a7aa-29667296916e._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6f11fb32-e0d6-4869-9915-29068c7e1471._CR0,0,1464,600_PT0_SX1464__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mimiche",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXCBD33WLC3AAKWZV2ZCEWISREA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MV9LXCKHBE2B?ASIN=B07B48SQGT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2018",
                "reviewTitle": "5.0 out of 5 stars Versa is the Blaze 2. Works well and is easy to use...",
                "reviewText": "Just received my Versa yesterday and so far, so awesome!I have been a loyal Fitbit user, starting from the Charge, to the Charge 2, the Blaze, the Alta, and now my Versa. So, I'm going to give my honest thoughts because although this product is amazing, they have a ways to go.Pros:The Versa is definitely what I'd consider to be there Blaze 2. The way the UI and interface works and the upgrades remind me so much of the Blaze. It is very easy to use and navigate. This goes for the Fitbit app and the Versa itself. I'm very impressed with the improved clarity and color range of the screen. I've heard a lot of people complain about the size of the bezels...to be honest it doesn't bother me at all. The asthetic of the Versa is clean, sleek, and understated. It's very light!! I would say that it's so light I forget I'm wearing it, but because I keep playing with it every so often, that would be a bit of a white lie. I'm sure in a week or so, once I get over there newness I'll forget it's even there. So that's a plus.I have also heard people say that band changing system is difficult. As someone who had to do the same with the Blaze, I don't see that as an issue. Matter of fact, the Blaze's design made it a bit more difficult to switch bands than the Versa. That's my experience though.I love the variety of clock faces! So many to choose from! And there are a bit more things to customize within the app, but that might be due to the app upgrade and not the Versa itself.Cons:There are only a few apps in the Fitbit app store. Be prepared for this. I'm sure with it's growing popularity, more will be added soon though.The app itself is a little glitchy. I haven't experienced any issues with the watch however. But I've noticed my app will spaz whenever I had something to the Versa. Again, this might be due to the Fitbit app itself.I cannot comment on battery life but I will update in a week or so.My Blaze would last about 6-7 days even though it was advertised as 5. So, even keeping in mind they've advertised 4 days I will still compare the battery life to its predecessor. I will say I've used it for 24 hours and noticed only 15% decrease in batter life. Keeping to that trend, it should last almost a week but we shall see.I'll update with more as I continue using it.All around, great move and product from Fitbit. I'm impressed and pleasantly satisfied!",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RGMRGM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4TRHNGGANW5LWPZMAVNQFO5MAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB6VWTKOHFWL3?ASIN=B07B48SQGT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2018",
                "reviewTitle": "5.0 out of 5 stars Surprisingly motivating and very effective (updated 1/28/19)",
                "reviewText": "I chose the Versa to replace an older basic watch that had gotten scratched and dinged up so badly it wasn't readable any more; figured I'd give Fitbit another chance. And so far, I'm very pleased with the choice.As a watch, well, it tells time and date. It can give text and email notifications, though they're often delayed several seconds (but that's okay). The main reason to go for this watch is its activity tracking functions, and here it seems to be doing a great job so far. It even survives trips to the pool and my son's bathtime.What I found most surprising, though, is that simply having my activity readout visible and having goals for the various categories makes me want to hit them. I had a hybrid car for a while and that was bad--a car with an efficiency readout is a cruel thing to give to an engineer--but this doesn't make me obsess like hitting mileage numbers did. My Versa has spurred me to start taking walks at lunch every day to at least get some exercise during a 12-hour desk job day. It reminds me to get up and stretch my legs when I've been staring at difficult problems for a while. It tracks my workouts and gives me heart rate plots (very interesting, those) and I can see measurable changes in resting heart rate as I've started exercising more.Initially I was a little skeptical of the sleep phase tracking, but seeing the graph in the morning and correlating with how rested I feel and what I remember of waking up and dreaming, it seems reasonably close.I was also skeptical of the calorie tracking feature, figuring it was really overestimating. There was no way I was burning 3500+ calories a day with just a walk, as I hadn't been gaining or losing weight. But then on a whim, I tried out the food tracking part with some of the things I eat regularly. To my utter dismay, I found that I was indeed probably burning about that much, because apparently I'd been eating that much (insert eyes the size of dinner plates here).I do wish the battery life was better, though I charge it every night anyway. I also wish the charger wasn't so bulky, but I don't really see an alternative that doesn't involve an opening in the case. And sometimes it doesn't really recognize the wrist-flick to see the time without hitting buttons or tapping the screen.My biggest gripe is with the app; even with all-day sync turned off and \"background data\" disabled in Android it will still try to pull several megs a day of mobile data. Not cool when you share a 2GB plan with your wife. I had to get a firewall program for my (rooted) phone and completely block the app from using mobile data, so now it only syncs on wifi. The food tracking interface could use some minor improvements too.Overall, I'm extremely pleased and am trying to convince my wife to get one of these vs. a less-capable tracker.----------UPDATE 1/28/19: I'm still extremely happy with mine and my wife ended up getting one too. Both of us have made significant improvements to our health; I'm down 40lb (back to high school graduation weight!) from eating better and exercising a lot more; she's losing weight and exercising more than ever. I'm even running significantly faster than I used to.I think the biggest, most helpful factor has been the calorie tracking. Losing weight requires burning more calories than you're eating; no way around that. I think the problem is that most people, even if they track their calories, have no real good way of knowing what they're burning. I had the same problem; without knowing what I'm burning the food target is a stab in the dark. Either you're a lot more active than you think and you way underestimate your calories burned, feel like crap because you aren't eating, and give up; or your calorie target is too generous and you give up because you aren't getting results.Enter Fitbit. Wear it consistently and put your information in accurately, and it's likely going to give you a pretty good number to go by. If you know what you've burned, you know what you can eat, and Fitbit makes that simple with a \"you have XXXX calories left\" display. You'll still have to observe and adjust over time to learn your average error rate (I'm generally off by about 120 calories/day based on weight trends) but once you know that you can correct for it.The other nice thing with tracking is that, if you're like me and you work out and exercise so you can eat, you can reward yourself for an especially active day, or tack on a workout to make extra room for a special meal, without blindly guessing. I can't tell you how many times I've gotten to the end of the day and tacked on a brisk walk or HIIT workout just so I can go eat dessert or have a beer or two. You can have as many \"cheat days\" as you want, as long as you exercise enough to make up for it!Another interesting side effect is that it's made household chores like mowing the lawn or cleaning less of a pain. Mowing in particular burns calories off like a workout, so it's like getting rewarded with food for doing chores!In all, it makes losing weight (fat) simple. Now, I didn't say it was *easy*--it still takes willpower and enduring a little discomfort--but it basically takes the guesswork out. Unless you go out to eat at a non-chain restaurant; there you're on your own to put in your best guess for what you've eaten...",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41Ch+WmaOmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Buckley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 17, 2020",
                "reviewTitle": "Five Star Quality!!",
                "reviewText": "Awesome, brilliant, buy one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricardo S Rasmusson K",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 3, 2018",
                "reviewTitle": "excelente",
                "reviewText": "me gusto mucho , la verdad es que todo excelente , ligero , atractivo y buen funcionamiento , , ,",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 2, 2020",
                "reviewTitle": "N/A",
                "reviewText": "N/A",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joel González",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 12, 2019",
                "reviewTitle": "Tiene muchos puntos de mejora, se ve bien",
                "reviewText": "Actualización: Reloj desechable, apenas paso el tiempo de la garantía (2 meses despues) se mojó y se murió la pantalla, aunado a los temas de sincronización no vuelvo a este producto. Lo triste es que nunca nade con el ni en alberca ni en el marPros: -Aprueba de agua a 50 metros, no lo he usado en el mar pero las duchas, lavados de mano y demás sin problemas-mide tu ritmo cardíaco todo el tiempo, he tenido oportunidad de compararlo contra equipo médico y en realidad la variación es mínima, de 1 a 3 pm de diferencia.-muestra notificaciones de algunas aplicaciones del teléfono-el reloj es resistente, no uso protector de ninguna índole y la pantalla está intacta aunque la he golpeado en ocasiones por accidente-la pila que dura en mi caso unos 3 -4 días, en ocasiones raras 5-la pantalla no decepciona, se mira bien en cualquier entorno de luz aunque es molesto tener que prenderla para ver la hora, o tu ritmo cardíaco rápidamente, cuando pueden usar pantallas que bajo la luz no requieran encenderseContras: -La Correa ya se rompió y aún no cumple el año, compre otra genérica y parece ser de mejor material-Sincroniza solo con algunas aplicaciones, no puedes enviar todas tus notificaciones al reloj-sincroniza cuando quiere, pierde la sincronización con el teléfono, incluso cuando realizas actividad física como bicicleta que necesita que funcione bien por qué no tiene GPS-Las carátulas se ven muy corrientes en su mayoría y es súper engorroso cambiarlas, no puedes poner más de una a la vez-no tiene sonido de ninguna manera, ni siquiera un pitido para una alarma, aunque si vibra-no hay forma de bloquearlo lo cual me hace pensar que si te lo roban, sin ningún problema lo sinconizarian en su teléfono como si fuese suyo- el medidor de ritmo cardíaco en ocasiones muestra datos irreales mientras haces ejercicio y al menos en mi caso me asusta ver que me diga que mi corazón va a 180 lpm si no estoy haciendo mucho esfuerzo y después regrese a la lectura Real-el cargador es bizarro y exclusivo, si te quedas sin pilas en la calle no hay forma de pasarle energía en tu carro o algún cargador ya sea de inducción o tipo cOpinion: Es un intento burdo de un Smart watch \"deportivo\" necesitan pulir muchos aspectos, si supiera lo que se hoy, no lo hubiera comprado, no hace nada que no haría un reloj normal excepto el tracking de actividad y las notificaciones que funcionan cuando quieren, puedes contestar mensajes de whatts con 4 respuestas que tu pre cargas pero no es muy útil realmente",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Puneet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 17, 2018",
                "reviewTitle": "Excellent",
                "reviewText": "Gteat excellent battery",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$134.99",
                "sellerName": "BH Deals Express (SERIAL NUMBER RECORDED)",
                "sellerRating": "5"
            },
            {
                "price": "$139.99",
                "sellerName": "Ellis gadgets",
                "sellerRating": "5"
            },
            {
                "price": "$189.99",
                "sellerName": "Acute Tek (We Record SN)",
                "sellerRating": "4"
            }
        ]
    }
}