{
    "remaining_requests": 48409,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Garmin-v%C3%ADvoactive-Smartwatch-Contactless-Payments/dp/B074K9HNXD",
    "body": {
        "name": "Garmin 010-01769-11 Vívoactive 3, GPS Smartwatch Contactless Payments Built-In Sports Apps, Black/Slate",
        "price": "$129.95",
        "originalPrice": "",
        "rawPrice": 129.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Garmin-v%C3%ADvoactive-Smartwatch-Contactless-Payments/dp/B074K9HNXD",
        "soldBy": {
            "sellerID": "AJ8MVEQQ9DH2X",
            "name": "Tech-Boutique",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=AJ8MVEQQ9DH2X&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07M87KRKR"
        ],
        "asinVariationValues": [
            {
                "asin": "B074K9HNXD",
                "variationName": "Color",
                "variationValue": "Black with Slate",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/413tc-eGsGL._SS36_.jpg"
            },
            {
                "asin": "B07CVJ68GP",
                "variationName": "Color",
                "variationValue": "White with Rose gold",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41dIXq2RBAL._SS36_.jpg"
            },
            {
                "asin": "B074KHR3LZ",
                "variationName": "Color",
                "variationValue": "White with Stainless",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/414m4uDyQEL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/418nEFE4pKL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 12 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/413tc-eGsGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41GQaL3AK9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51a5j5lnVsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DaCfRTDqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NiUGimi5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51o74Z7nj5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SnYIOOmKL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce07b905-daff-4bf8-b901-1322b20828bb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d58b9a1b-ef85-44db-9d15-5749a00c6120/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9376be52-0f6f-43f7-8260-ef1ba4a08c28/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/305f3edb-fa82-40ae-87dc-6d0ca1ac9969/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1Fc2Hu09XS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91L8UiyLVeL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Garmin Store",
            "link": "https://www.amazon.com/stores/Garmin/page/675B188D-FBE3-4FF4-9DD0-E48E4A2C888D?ref_=ast_bln"
        },
        "brand": "Garmin",
        "merchantInfo": "Tech-Boutique",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 14356,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18. Order within 2 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Garmin Pay contact less payment solution lets you pay for purchases with your watch (available for supported cards from participating banks)",
            "Personalize your watch with thousands of free watch faces, apps and widgets from our Connect IQ store.; Memory/History: 7 timed activities, 14 days of activity tracking data",
            "More than 15 pre-loaded GPS and indoor sports apps, including yoga, running, swimming and more; Lens material: Chemically strengthened glass, bezel material: Stainless steel, case material: Fiber reinforced polymer with stainless steel rear cover",
            "Monitor your fitness level with VO2 max and fitness made estimates, plus keep an eye on how you handle stress; Fits wrists with a circumference of 127 to 204 millimeter",
            "Get connected features such as smart notifications, automatic uploads to Garmin Connect, Live Track and more when paired with a compatible smartphone",
            "Battery life: Up to 7 days in smartwatch mode; 13 hours in GPS mode; Connectivity Bluetooth Smart and ANT plus. Smartphone compatibility iPhone, Android. Display size: 1.2 inch diameter"
        ],
        "description": "Note - To extend the life of the battery: reduce the backlight timeout, reduce the backlight brightness, turn off Bluetooth wireless technology when you are not using connected features, turn off activity tracking, limit the smartphone notifications the device displays, stop broadcasting heart rate data to paired Garmin devices and turn off wrist-based heart rate monitoring. From playing to paying, vasoactive 3 is the smartwatch for your active life. Make mobile payments with ease, right from your watch, and with more than 15 preloaded sports apps - you can choose how you like to get fit. Built-in GPS lets you record the distance, pace, location and more for your outdoor activities. Physical size - 43.4 x 43.4 x 11.7 mm. Fits wrists with a circumference of 127-204 mm. Display size - 1.2 inch (30.4mm) diameter.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.7 x 0.5 x 1.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.8 ounces"
            },
            {
                "name": "ASIN",
                "value": "B074K9HNXD"
            },
            {
                "name": "Item model number",
                "value": "010-01769-11"
            },
            {
                "name": "Batteries",
                "value": "1 CR2 batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 14,356 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#45,219 in Electronics (See Top 100 in Electronics) #1,162 in Smartwatches"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "OS",
                "value": "android"
            },
            {
                "name": "Wireless communication technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth, GPS"
            },
            {
                "name": "GPS",
                "value": "True"
            },
            {
                "name": "Special features",
                "value": "Time Display, GPS, Notifications, Heart Rate Monitor"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Scanner Resolution",
                "value": "240 x 240"
            },
            {
                "name": "Color",
                "value": "Black with Slate"
            },
            {
                "name": "Whats in the box",
                "value": "vivoactive 3, documentation, charging/data cable"
            },
            {
                "name": "Manufacturer",
                "value": "Garmin"
            },
            {
                "name": "Date First Available",
                "value": "August 31, 2017"
            },
            {
                "name": "Weight",
                "value": "4.8 Ounces"
            },
            {
                "name": "Standing screen display size",
                "value": "1.2 Inches"
            },
            {
                "name": "Brand",
                "value": "Garmin"
            },
            {
                "name": "Model Name",
                "value": "010-01769-11"
            },
            {
                "name": "Style",
                "value": "Standard"
            },
            {
                "name": "Screen Size",
                "value": "1.2 Inches"
            },
            {
                "name": "Special Feature",
                "value": "Time Display, GPS, Notifications, Heart Rate Monitor"
            },
            {
                "name": "Shape",
                "value": "Round"
            },
            {
                "name": "Target Audience",
                "value": "Unisex Adult"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jordan Charles",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5S42PRW4UY2LBLDA73KHRRCI6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTJUH9F093QDB?ASIN=B074K9HNXD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2019",
                "reviewTitle": "5.0 out of 5 stars Garmin For The Win!",
                "reviewText": "I purchased this watch with the intent of gifting it to my girlfriend for her birthday. I have not yet given it to her, but I know I don’t have to to know she will be impressed.Garmin watches are top quality, and well worth the buy. I myself own a Garmin Fénix 5x, and love it. I’ve never owned a more technologically advanced, durable, long lasting watch. This Vivoactive 3 is a bit different from mine, but it still has a multitude of amazing features, that might even beat mine!The watch is beautifully crafted, and can be worn on all occasions. Whether it be at the gym, at the beach, or even at an extravagant event. It’s design is meant to be casual, but with that little extra flare that makes people say “wow, nice watch!”.Like I said before it has a multitude of features, that are extremely convenient, and you will end up appreciating more than you know later on. If you’re an active person, being able to track your runs, trace routes, see how many strokes it takes on a paddle board to get you 100 meters, and more, makes working out even better than before. It helps you retain your progress, and strive to to better. It promotes over all better body health. It tracks your steps, heartbeat, and more, which helps you keep note on your activity, and helps remind you to go and get out there if you’re not meeting your goals.Also, besides all of the neat sports features, it’s extremely tech! I used to laugh at people with Apple watches because they constantly checked their wrists for texts, but now that I own a smart watch, I completely understand! (Btw I’m not comparing these to apple watches, because Garmin blows them out of the water, but well get to that in the next paragraph.) it’s extremely continent to be able to have your phone somewhere else, and be able to quickly check texts or answer calls. Not only that, but have you ever been in the middle of a good workout, and a song you don’t like comes on, and you have to get up to change the song on your phone? Well you can do that from your watch without moving. Like I said, you’ll appreciate this watch way more than you know.Now, when it comes to competing brands, garmin in for the Win. If you have an IPhone, no need to fear, Garmin is 100% compatible. Not to hate on Apple watches, but don’t buy an apple watch just because you have an iPhone, and for a few reasons. First being that Apple doesn’t have the extensive list of features garmin does. Secondly, apple watches die after 3 days, and take almost a whole night to charge. I can wear my garmin for a week and some change, then charge it in an hour and a half. It’s insane. And finally, apple watches just don’t have that extra pop that Garmins do. The square body shape doesn’t compare to the look a garmin gives off. Garmin watches are almost like ford raptors. Yeah it’s a truck and you can work in it and get it dirty, but at the end of the day it’s a $100k truck that’s built for racing.All in all, I think Garmin Watches are top notch, and there’s nothing else like them. It’s well worth the buy, and you won’t regret it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Uncle Vanya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDECRJXUU4OGNZKHHYOIOLBTOMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34ANOH1MGE1NA?ASIN=B074K9HNXD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2018",
                "reviewTitle": "5.0 out of 5 stars Has Been Very Good for 2 Years",
                "reviewText": "UPDATE July 14, 2020 - I have been wearing this watch almost every day for almost 2 years and I like it very much. (I had forgotten that I hadn't liked this watch, so am updating this review. See my previous reviews below for what my problems were at the time.) In the end, I was able to convince Garmin Support to send me a new watch instead of a refurb. I think I had to pay for shipping or something. The new watch has not had any of the step tracking issues the prior watch had. Nor any of the synching issues. I think the O/S update did in fact solve the synching problems. (I'm an Android user, for reference.)I use the Strava synch all the time and it works great. Every now and then there's a delay for the watch to synch its data to the Garmin app on the phone, but as soon as it's on the phone it posts to Strava. I primarily use this watch to track cycling activities, but have also used it for running, hiking, swimming, skiing stand-up paddle, and some others.It's been quite durable as well. I did buy a tempered glass screen protector, which now has a chip in it, but the watch itself has taken something of a beating.The waterproofing works as well. I basically never take it off. Always shower with it. Swim with it, etc.Sleep tracking has been good.HR has seemed accurate to me.Battery life has been excellent. I go about a week between charges when I'm not using the activity tracking feature. This is great. I really don't worry about the battery. When I am going to go cycling, I charge it up fully and then I can get about 8-9 hours of tracking. If you want to use it mainly for tracking runs and you run for less than an hour every other day, you could probably charge it only once every five days. When I do charge it, it will go from 20% to full in about half an hour or forty-five minutes, so even when I wake up to go cycling and realize I forgot to charge it I can just do it then while I'm getting the gear ready.Two years have passed since I bought it and I had expected that there'd be a better watch out now that was a Wear O/S watch with LTE capabilities (which is the only thing this watch lacks, IMO, b/c I\"d love to be able to leave the phone at home), but there isn't. If this watch broke today, I'd just buy another one. For the current price, it's a steal.------------------UPDATE Nov 15, 2018 - I can't recommend this watch. More and more problems are occurring. The first problem is that it stopped tracking any floors on the stair counter. This happened after I took a trip on an airplane and other posters had mentioned that maybe their altimeter (barometer) broke in conjunction with a plane trip. I called Garmin Support and they discussed this and they said that maybe and update to the O/S from 5.4 to 5.5 (which was due any day) would help, and/or they'd be happy to send me a new watch and if i wanted even faster they would send it immediately if I'd pay a deposit which they would refund when I got the new watch. I said, okay, well, I'll wait til 5.5 comes out and see and the maybe return it and they said that was all fine.So, I waited, it didn't fix it, and I contacted them to do the exchange, and they sent me a form for payment and I see that the watch they intend to give me is refurbished. They did not specify this earlier. I'm annoyed b/c at the time I was still in my 30 day return window and could have just returned it and bought another new one.Additionally, since that time, other problems have occurred:--synching has become a real problem. The watch just sometimes will go days without synching to the phone app. Also, the app seems to be built in some stupid way where it needs Internet connectivity in order to sync the watch. So, forget synching if you're traveling to some country where you only receive 2g, or are otherwise in an are with poor signal.--Relatedly, I discovered while in the middle of the Costa Rican rainforest, is that even the GPX maps that I had loaded to the Garmin Connect app cannot be displayed without an Internet connection. Seriously, Garmin?!?!? You are making fitness devices for people to use out in the wild, and yet they can't even access their loaded routes in your app without an Internet connection?--the heart rate monitor seems to have gotten much less reliable. Often it sits at 90 when I'm clearly in aerobic or anaerobic range (130+)--I have noticed... why is there no Timer app on this watch? So simple. Why didn't they include it. Or an Alarm feature.---my original review from Oct 2018-----I have had this watch for a couple of weeks and have been very happy with it. I had tried the Amazfit Bip and Ticwatch E and both failed to accurately track my heart rate when going over about 130bpm. No watch is as good as a band yet for that, but those were so obviously wrong doing things like showing 80 when I was huffing and puffing. The Garmin Vivoactive 3 seems accurate enough for my purposes.The battery life is acceptable/good. You can get multiple days unless you are tracking long activities. If you are running GPS and doing long cycling rides (4-8 hours) like I am, you will not get more than one ride per charge. I suppose this is asking a lot of the battery.The problem I am having is that already the stair step counter has stopped working. It worked for awhile but now has just stopped. Not sure if that is a common problem. Have tried to contact the seller but there doesn't seem to be any way to do that here. May have to return it for a replacement if I don't hear something back from them based on this post.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Snowflake07",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2022",
                "reviewTitle": "Great sports watch",
                "reviewText": "Great budget watch for hobby runners and other active people looking to track their steps. Built in GPS, pretty good overall package.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOAO LUCAS RIBEIRO REIS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 15, 2021",
                "reviewTitle": "Qualidade, beleza, precisão e música ! Adeus corrida com celular",
                "reviewText": "É um garmin, então não preciso nem descrever a precisão deste relógio ( é extremamente preciso )É bom sempre mante-lo atualizado para achar o Gps com facilidade.É muito bonito para o dia a dia, roda as listas do dezzer e funciona para corrida com facilidade, natação a marcação não é tão boa e esteira marca com exatidão.O touch-screen fica um pouco ruim com o suor para manusear os comandos e passar música. A bateria com a função música + GPS + Bluetooth e corrida vai embora bem rápido, o que deve é normal. Entrando dura uma semana se você não fizer nada desta lista.corrida de meia hora com música durante o dia, ele aguenta dois a três dias facilmente.O meu cabo que veio com ele deu defeito em alguns meses, o que é uma pena.Importante, ele aguenta bem o impacto mas já aconselho comprar capa e película dependendo da sua atividade, encontrar qualquer acessório dele em lojas comuns é dificílimo. Já compra tudo pela Internet pra mante-lo seguro.Compraria de novo e não saio mais da garmin, adeus corrida com celular, agora é só relógio e fone.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 20, 2021",
                "reviewTitle": "Excellent value...hope it lasts a long time !😍",
                "reviewText": "Sooooo much better than the Fitbit Alta HD. So happy with the purchase. I'd recommend to anyone.Only function that doesn't work I'd Garmin Pay as it's not avaialbe in Canada yet. Also not as many face watch selections as I thought. However it has a cool watch face feature where you can upload a background photo for you watch face (from your camera)! So cool.It has 30 programmable text back responses when your phone isn't accessible. There's many settings to play with on watch itself including brightness which was one review I read. It goes brighter than you need but sucks battery more.Battery needs changing every few days I find but charges extremely fast. Within 30-60 mins.Heart rate seems to be super accurate as is GPS!Can't wait to swim with this on the summer! Love it! Five Star ⭐⭐⭐⭐⭐",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/911CV6U+WUL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica Maya Franco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 15, 2020",
                "reviewTitle": "Vale lo cuesta...por menos de un año",
                "reviewText": "Quedó encantado con el regalo, muy útil y fácil de usar por ciertoActualización agosto 2020Apareció un punto blanco de la nada y a los dos días otro más...se va fundiendo y eso que el uso que le dió la persona a la que lo regalé es poca y con mucho cuidado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Placeholder",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 26, 2019",
                "reviewTitle": "Great product",
                "reviewText": "Great product. Very accurate. If I were to be critical then it would be about the battery life",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}