{
    "remaining_requests": 48253,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Donerton-Smart-Watch/dp/B08T75R5C5",
    "body": {
        "name": "Donerton Smart Watch, Fitness Tracker for Android Phones, Fitness Tracker with Heart Rate and Sleep Monitor, Activity Tracker with IP68 Waterproof Pedometer Smartwatch with Step Counter,Gray",
        "price": "$19.99",
        "originalPrice": "$19.99",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Donerton-Smart-Watch/dp/B08T75R5C5",
        "soldBy": {
            "sellerID": "A3JWEQ3826T82A",
            "name": "Donerton-US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3JWEQ3826T82A&asin=B08T75R5C5&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BL9BRHYR"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41u5bJqbTQL._SS36_.jpg"
            },
            {
                "asin": "B08T75R5C5",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41XI+5uhFUL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41XI 5uhFUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/416215Sg13L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51neRfsMyOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bPSL7vkUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QZs7yvi1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CQm3y8IkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FPu3zWtRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Donerton Store",
            "link": "https://www.amazon.com/stores/Donerton/page/0C6BB2C0-5F71-4A28-829D-72131CEBCFAC?ref_=ast_bln"
        },
        "brand": "Donerton",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 12476,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 6 hrs 9 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "heart rate monitor and pedometer: fitness tracker watch built in high performance motion sensor automatically monitors and detects your heart rate in real time, help you better grasp changes for your health and record accurately calorie consumption, distance, steps. you can view historical data in the app “GloryFit”.",
            "sleep tracker and alarm clock: smart band can records your deep, light, and awake sleep patterns, and track your sleep quality status to get a better understanding of your health and and make reasonable adjustment on your lifestyle. you can also set an alarm to wake you up softly every day. with Donerton sports watch, your life will be easy and smart.",
            "call and message notifications: when you connect the smart watch to your smartphone, you will never miss a call or message again. it will vibrate and notify you when your phone receives a call, sms text or sns notifications (facebook, twitter, whatsapp, linkedi, messenger, instagram). you can even hang up incoming phone calls straight from your wrist.",
            "ip68 waterproof: with the technology of ip68 waterproof, the smart watch will not be damaged even if you wash your hands, bathe and swim while wearing the fitness watch. meet your daily needs. (note: the smartwatch does not prevent hot water and sea water.) after connecting to the phone, you can also see the real time weather forecast.",
            "overtake your expectations: our 1.69 inch color touch screen make it easy to operate and easily check detailed data reports. there is 4 stylish clock faces for you to choose from, different styles match your different moods. more practical tools such as alarm clocks, stopwatch, timer, camera control, music controller, sedentary reminder, adjustable brightness,find phone. this watch can be a very good gift choice to make people live more healthy, more active and more convenient."
        ],
        "description": "Why choose our Donerton smart watch? Donerton is committed to providing you with a better user experience and helping you develop more better life’s habits. Features: Daily activity monitoring: Heart rate monitoring；Sleep monitoring；Step monitoring；Calorie monitoring；Distance monitoring；Active time Support multiple sports: Outdoor running; Indoor running;Outdoor walking; Indoor walking; Outdoor riding; Indoor bicycle; hiking; Yoga; Elliptical machine; Rowing machine; other Reminder: Incoming call; SMS notification; App push reminder; Alarm reminder ; Sedentary reminder; Target reaching reminder; Low battery reminder Other functions: Stopwatch; Breath traning Specification: Bluetooth transmission distance: 10 Meters (33 feet) Screen size: 1.69 inch Screen type: TFT LCD color screen Material: upper casing: PC+ABS Strap: TPU Suits for wrist size: 5.4 inch - 7.6 inchStandby time：30 days Working time: 7 days Charging time: Less than 2.5 hours Weight: 1.09oz (31g) Multilingual: English, German, Italian, French, West, Japanese, Indy, Indonesia Warm Tips: Smart watch data cannot be used for medical purposes. The monitoring data is for reference only. If you need medical help, please contact a professional doctor. What can you get? 1 x Donerton smart watch 1 x Charging cable 1 x English instructions",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Time Display, Sleep Monitor, Sedentary Reminder, View SMS, Alarm Clock, Activity Tracker, Pedometer, camera control, Call rejection, Notifications, Heart Rate Monitor See more"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            },
            {
                "name": "Compatible Phone Models",
                "value": "Smartphones with iOS 9.0, Android 5.0 or above and Bluetooth 5.0 or later"
            },
            {
                "name": "Operating System",
                "value": "Android"
            },
            {
                "name": "Water Resistance Level",
                "value": "Waterproof"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Supported Application",
                "value": "Reminders, Multisport Tracker"
            },
            {
                "name": "Controller Type",
                "value": "Android"
            },
            {
                "name": "Battery Cell Composition",
                "value": "Lithium Polymer"
            },
            {
                "name": "Battery Power",
                "value": "180 Milliamp Hours"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "Bluetooth"
            },
            {
                "name": "Screen Size",
                "value": "1.4 Inches"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            },
            {
                "name": "Band Material Type",
                "value": "Thermoplastic Polyurethane"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 12,476 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#34,542 in Electronics (See Top 100 in Electronics) #957 in Smartwatches"
            },
            {
                "name": "Brand",
                "value": "Donerton"
            },
            {
                "name": "Target Audience",
                "value": "Unisex Adult"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Model Number",
                "value": "P22"
            },
            {
                "name": "Target Gender",
                "value": "Unisex"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Shape",
                "value": "Heart"
            },
            {
                "name": "Band Color",
                "value": "grey"
            },
            {
                "name": "Sport",
                "value": "Walking, Running, Swimming, Yoga, Hiking, Fitness"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIJ3JLKLKIDSWNZ7FAMHUDPR4PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25G8LMUSA1PEB?ASIN=B08T75R5C5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2022",
                "reviewTitle": "5.0 out of 5 stars Pretty darn good smart watch for the price",
                "reviewText": "When looking this watch over and reading the reviews, I figured what the heck. After setting it up and downloading the app to my phone, I was pretty surprised at all this little thing did. I won't say that my Doctor is going to take the medical readings from it as exact, but it does give me a close enough set of numbers to see how everything is going. I haven't tried the training portion of the watch yet but so far, I'd say that I am happy with what how it performs. The battery life is good for 3-5 days if I don't play with it all the time and it doesn't take all that long to charge. One review complained that they couldn't adjust the face. Well, it took a little looking but you do that from the app on your phone. Ended up it was easy enough. The only thing I wasn't overly happy with was it requesting access to to much information o my phone so I just said no to those I didn't feel comfortable with. Outside of that, for the price this was a really good buy.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Serena",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWHN5AS3YQ2477RW3MOWTUZCXUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VG6EYQP0SX9Q?ASIN=B08T75R5C5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 1, 2022",
                "reviewTitle": "4.0 out of 5 stars Nice Watch",
                "reviewText": "I have no interest in an Apple Watch for several hundred dollars, so I have been using a smart watch knock off for a while. This one replaced one that stopped working. Firstly, I will say that it does NOT come to life by touching the screen...you have to press the side button. Not a big deal but it is marketed differently. The oxygen saturation and blood pressure seem to be fairly accurate, but it you do it from your watch, it does NOT sync to the app when you open the app. The only way it appears on the app is if you do those functions from the app. I don't like that. The sleep information and steps sync up, but nothing else does. I like the face and the ease of moving between functions. Pretty easy to use.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BARBARA L BRABETZ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHOSFZE4RZOPTMLVRSU5Y5AWNSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SPPWMCWGJ4SV?ASIN=B08T75R5C5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2022",
                "reviewTitle": "5.0 out of 5 stars Great watch at a terrific price",
                "reviewText": "This watch provides many of the smart watch features seen in Samsung and Apple for a just tenth of the price of others. Battery life is about a week if heart rate setting is on demand. If set to montior heart rate continuously, the battery lasts about 4 days. I went through the app to get to another watch face since my middle aged eyes couldnt read the small numbers of the original face. Ther are many faces to choose from. I really like the blood pressure and oxygen saturation features. They seem right on the mark. One hiccup I am getting used to - the user must initiate an exercise event rather than the watch noticing the change. Also, instructions don't provide the bluetooth pairing instructions. My watch's bluetooth device name was P22D.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MannyManny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJYGBRCK5GKB6YFSHVEB2RUG7KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRKUPSRRHBTA9?ASIN=B08T75R5C5",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2022",
                "reviewTitle": "1.0 out of 5 stars I just wouldn't",
                "reviewText": "Battery life is superb and light as a feather, that's all I'll give it.The photo is misleading - the actual screen does not take up the whole face of the watch as dipicted. See picture.The screen timeout is 1sec so better move quick when trying to figure out how to use the watch.I decided to write this review after I was watching a movie in theaters when the watch chimed telling me I reached my step goal. From sitting down. For last 1hr..Lastly and mostly importantly- worst software. Can't change the time or date and using the \"app\" is a nightmare. Sketchy app that is forced on you (I tried GoogleWear and didn't work) and bombards you with ads. Ads while in the app and ads through notifications throughout the day. Wouldn't even let me use my own phones QR scanner to setup, wanted me to download ANOTHER crappy app just to scan the code.Don't buy this in a bind like I did. Save up or just use the phone pedometer.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61+Z7uKJOeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. Bear",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKQ2OONIM5JG5OM4GGPUYY6EBCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XM7VK1DK941O?ASIN=B08T75R5C5",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2022",
                "reviewTitle": "3.0 out of 5 stars OK as a basic activity tracker/watch.",
                "reviewText": "Update - 12/8/22I do have a couple of updates for my review. I went from 4 to 3 stars, mostly due to durability issues. Over the 5 months I have had this watch, it has gotten scratched very easily. Granted, this was typically on the type of thing that would also scratch anything else made of glass, such as taping a painted brick wall, but the scratches also lead to a crack in the watch face. The crack is currently about 2/3rds of the way down the screen diagonally. The band also tore off. Replacement bands are easy to find and cheap, and I do wear the watch in the gym and other more rigorous activities, but still, I'm not running triathlons or anything like that. Also, and I'm not sure if this is related, but the sleep tracking doesn't always work. I can't really say why. For sure, it doesn't record naps, but also, it will decide I'm awake and then stop tracking sleep. It will say that I slept for 2 hours when I really was asleep for 7-8 hours. I would say it's good for about 8 or 9 out of every 10 days, and then has a hiccup.The watch itself still works fine and the app is still ok. Glitchy, like I said before, but it's still usable. Even with the cracks and scratches, the watch is still readable. And even though the band tore, I found another new band for $10, so it wasn't that bad. The watch does keep track of steps pretty well, which was the main point of getting it.--=-=---I bought this to count steps after a hip surgery. It does that quite well, and has added features to track sleep as well as measuring a few vital signs like blood pressure. I only charge this watch about once every 3 weeks and it charges up pretty fast.The mobile app is ok. It glitches out a bit if you don't open the app on your phone at least once a day. It has some kind of bug where it will not record your steps in the app properly if you don't open the app each day. Also, the sleep tracking seems a bit inaccurate. It doesn't always know when I am asleep, though I do think it does track deep sleep and brief awakenings well. It just has trouble sometimes determining if you are in a light sleep or awake.I also don't find the glass to be that durable. I got a small scratch in the corner and that lead to a crack that wasn't there originally. The crack is about 1/4 of the way down from the corner, though it does not seem to be growing anymore. I would not have thought that scratching the outside would lead to a crack like this. I can still read the watch and it seems to be working fineOverall, I'm satisfied. While the app and the glass are disappointing, I also only paid $30 for the watch, so it's hard to hold it to the same standard as an Apple watch.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zuccarello Giovanni",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 7, 2024",
                "reviewTitle": "Orologio",
                "reviewText": "Ottimo prodotto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "14chalet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 1, 2024",
                "reviewTitle": "Bon produit",
                "reviewText": "Facile d'utilisation",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 8, 2022",
                "reviewTitle": "Nice product",
                "reviewText": "Very nice",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beatriz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 2, 2020",
                "reviewTitle": "Un buen reloj económico",
                "reviewText": "No estaba segura de si me gustaría llevar un SmartWatch ya que llevaba tiempo con la miband de xiaomi pero a veces me entraban ganas de llevar algo más elegante.Vi este a un buen precio con varias características interesantes y me atreví a probar. La verdad es que estoy bastante contenta. Mi novio tiene uno que es bastante grande y no me hacía al tamaño y se me enganchaba con el abrigo en invierno. Este es más ligero y de un tamaño adecuado, ni muy pequeño como la miband que a veces no se ve bien, ni demasiado grande. Se ve mejor a la luz del día, tiene más brillo.Me gusta el gran número de esferas que tiene para personalizar e ir cambiando de vez en cuando. No tuve problemas para hacerlo funcionar y si lo necesitas viene con instrucciones detalladas.La correa se puede cambiar en caso de que se te rompa sin tener que cambiar todo el reloj.La duración de la batería me ha sorprendido ya que pensé que duraría menos de una semana. Se carga fácilmente con el cargador magnético que es muy cómodo.Un reloj muy completo que cumple con lo que promete por un precio económico. También es una buena opción para iniciarse en este mundo antes de decidirte por uno más caro. Yo no necesito más funciones y estoy contenta con el producto. Lo recomiendo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on November 23, 2020",
                "reviewTitle": "Nice smartwatch",
                "reviewText": "Good solid watch",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}