{
    "remaining_requests": 48288,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/feifuns-Waterproof-Fitness-Tracker-Pressure/dp/B098NHSJZ2",
    "body": {
        "name": "feifuns Smart Watch with Call(Answer Make Call) IP67 Waterproof Fitness Tracker Heart Rate Blood Pressure Oxygen SpO2 Sleep Step Calorie Count Smart Watches for Men Women for Android iOS Phone (Black)",
        "price": "$29.99",
        "originalPrice": "",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/feifuns-Waterproof-Fitness-Tracker-Pressure/dp/B098NHSJZ2",
        "soldBy": {
            "sellerID": "AG0VOEPGIWXT0",
            "name": "Aojingtai",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AG0VOEPGIWXT0&asin=B098NHSJZ2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B098NHXMP9"
        ],
        "asinVariationValues": [
            {
                "asin": "B098NHSJZ2",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$29.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/418ouo+OfBL._SS36_.jpg"
            },
            {
                "asin": "B0CGRBB315",
                "variationName": "Color",
                "variationValue": "G12 Pro-Pink",
                "price": "$29.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ES0vp2j0L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "17",
        "stockDetail": "Only 17 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418ouo OfBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51LdEF CA1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QoQ9aIwsS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rGX4iBdmS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51tLGZzfAdS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 LdC3I9MS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81OUIXTH3oL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/69420d4d-09ed-4967-bdb7-40e9cfdc44ad/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1c776e07-c6e6-4e90-bd06-e8281acb743a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2009ff9a-6d68-4416-aa82-af7454023b72/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/743804e9-d16d-4e24-8dd0-0514f915da63/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a7c636a6-b173-4ebc-b3ba-8392e82602ef/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fd7fb23f-976b-4d7f-abfc-88596c1f27e1/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the feifuns Store",
            "link": "https://www.amazon.com/stores/feifuns/page/70E4EB92-3953-4A3E-9149-45F67C038BC7?ref_=ast_bln"
        },
        "brand": "feifuns",
        "merchantInfo": "Aojingtai",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 2451,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "⌚2022 upgraded feifuns Smart Watch with Call: With this bluetooth call smart watch, you don't miss any important calls, hands-free when at home or walking, running, by using high-fidelity waterproof speakers.You can make, answer and refuse a call on your wrist, also receive message/app notification, listening to music via the watch directly which is more intelligent than the other similar watches. Never miss a call and a message. (Note: Can't reply message)",
            "⌚All-day Health Monitoring/Sleep Tracker/Sports modes: The upgraded watch give you real-time heart rate, blood Pressure Oxygen monitor (SpO2) which can also help to keep track of your sleep data and bring you to more scientific sleep habits. Record all-day activities like steps, calories burned, miles walked, active minutes. Also supports multiple sport modes and track all your workout distance and physical status during exercise. Gives deeper insights into your health. Stay motivated all day!",
            "⌚1.72\" Full Touch Screen and Custom Dial Smartwatch: The new upgraded smartwatch with 1.72'' color high sensitivity full touch screen. More than 50 styles dial to choose, also can be customized to any background you like on your mobile app. also has many smarter functions, synchronized weather forecasts, sedentary reminders, vibrating alarm clock, music & remote camera control, stopwatch, countdown, brightness adjustment, raise wrist to brighten screen, Use the deep breathing app to relax etc.",
            "⌚Smart Watch for Android Samsung Phones iPhone: feifuns smartwatch can be compatible with iOS 9.0 and above or Android 5.0 and above devices, including smart phones, iPad and tablet. By connecting the watch with your device via the Da Fit app, you can get real-time notifications of your calls, texts, and SNS messages, including Facebook, Twitter, WhatsApp, Linkedin, Messenger, etc. Never miss important messages.",
            "⌚IP67 Waterproof & Long-Lasting Battery: feifuns new watch is rated IP67 waterproof standard.You can wear it when washing hands, running in the rain, or even go to swimming with it.(Note: not suitable for diving or sauna).The magnetic charging cable ensures an easy charging method. It only takes 2 hours for this watch to be fully charged, and it can go for 7-10 days working time and 30 days standby time."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Wearable Technology",
                "link": "https://www.amazon.com/Wearable-Technology/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10048700011"
            },
            {
                "name": "Smartwatches",
                "link": "https://www.amazon.com/smart-watches/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7939901011"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Microphone, Making Answer/receiving Calls, IP67 waterproof, Sync phone's contact, Built in speaker See more"
            },
            {
                "name": "Compatible Devices",
                "value": "For iOS Phones: iPhone12/12 mini/12 pro/12 pro max/ iPhone11/11 Pro/11 Max/11 Pro Max/XS/X/8/8 Plus/7/7 Plus/6/6s/6 Plus/6s Plus/5/5S/5C/4/4s.For Android Phones:Samsung Galaxy S10, S10 Plus, Samsung Galaxy S9,S9 Plus,Samsung Galaxy Note 9,Samsung Galaxy Note 8, Samsung Galaxy S8, S8 plus, Samsung Note 5, Samsung Note 4, Samsung Note 3, Samsung Note 2.Galaxy S7,Galaxy S7 Edge, Galaxy S6,Galaxy S6 Edge,Galaxy S6 Edge Plus, Samsung Galaxy S5, Galaxy S4, Galaxy S3. Galaxy C5Samsung Note 4, Samsung Note 3, Samsung Note 2.Galaxy S7,Galaxy S7 Edge, Galaxy S6,Galaxy S6 Edge,Galaxy S6 Edge Plus, Samsung Galaxy S5, Galaxy S4, Galaxy S3. Galaxy C5, C7,C8,C9, Galaxy A5, A7, A8,A9, J7, J8. Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo,SONY, HTC, LG,and other smartphones with iOS 8.0/Android 4.4 or above and Bluetooth 4.0 or later. See more"
            },
            {
                "name": "Compatible Phone Models",
                "value": "iPhone12/12 mini/12 pro/12 pro max/ 11/11 pro/11 max/11 pro max/XS/X/8/8 plus/7/7 plus/6/6s/6 plus/6s plus/5/se ios phones; Samsung Galaxy S10, S10 Plus, S9, S9 Plus, S8, S8 Plus, S7, S7 Edge, S6, S6 Edge, S5, Samsung Note 8, 5, 4; HUAWEI P30/P10/P9/MATE30/MATE30 Pro/MATE9/MATE 8/MATE 7; HTC SONY LG OnePlus Nexus Google pixel/pixel xl BlackBerry, and other smartphones with iOS 8.0/Android 4.4 or above and Bluetooth 4.0 or later."
            },
            {
                "name": "OS",
                "value": "iOS 8.0/Android 4.4 or above and Bluetooth 4.0 or later smartphones"
            },
            {
                "name": "Water Resistance Level",
                "value": "Waterproof"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Supported Application",
                "value": "Multisport Tracker"
            },
            {
                "name": "Controller Type",
                "value": "Android"
            },
            {
                "name": "Band Width",
                "value": "22 Centimeters"
            },
            {
                "name": "Band Length",
                "value": "26 Centimeters"
            },
            {
                "name": "Battery Life",
                "value": "10 days"
            },
            {
                "name": "Battery Cell Composition",
                "value": "Lithium Polymer"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "Bluetooth"
            },
            {
                "name": "Screen Size",
                "value": "1.72 Inches"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 2,451 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#143,234 in Electronics (See Top 100 in Electronics) #2,855 in Smartwatches"
            },
            {
                "name": "Brand",
                "value": "feifuns"
            },
            {
                "name": "Model Name",
                "value": "FE1"
            },
            {
                "name": "Target Audience",
                "value": "Adult"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Whats in the box",
                "value": "two straps, charging cable"
            },
            {
                "name": "Target Gender",
                "value": "Unisex"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Shape",
                "value": "Square"
            },
            {
                "name": "Band Color",
                "value": "Black and white"
            },
            {
                "name": "Sport",
                "value": "Walking, Running, Swimming, Fitness"
            },
            {
                "name": "Band Material Type",
                "value": "Silicone"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "17.32 x 14.96 x 3.94 inches"
            },
            {
                "name": "International Protection Rating",
                "value": "IP67"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "How to connect the smart watch to your phone? This smart watch can work with most iOS 8.0/Android 4.4 or above and Bluetooth 4.0 or later smartphones. The app name is Da Fit . Please install it in your smartphone first, then connect the watch to your smartphone through the app instead of through your phone's bluetooth list to reach the complete functions. Steps: Download the 'Da Fit' app in your smartphone (you can scan the QR code in user manual or search 'Da Fit' in App Store)<Turn on the Bluetooth of your phone<Go to 'Da Fit' app < ADD A Device < search the device named 'FE1'<tap on 'FE1' < Finish to connect. USE WATCH TO MAKE ANSWER CALL Pair with the \"Audio_FE1\" to open the bluetooth call and music play. ( Turn on the call function on the watch then go to the Bluetooth setting of the phone and find the \"Audio_FE1\" to connect) About Audio Bluetooth: -- Bluetooth calls (dialing, answering, rejecting) can only be made after audio Bluetooth is linked -- The Bluetooth connection distance should not exceed ten meters. -- When making a call from your watch, you can choose to answer it with your watch or with your mobile phone -- When making a call from mobile phone, the watch will also display the call -- Can add 8 contacts through APP(need to finish the APP connection first) -- This watch also supports media audio, and default is on. When you play youtube, the sound will play from the watch. You can turn off Media audio: Go to the Bluetooth setting of smartphone -- Paired Device -- Audio_ FE1-- Click the settings Icon on the right -- Click \"Disconnect\" or turn off the switch on the watch (Slide down the homepage and find the call icon, click it to turn off the switch on the watch)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e7b3cc2-ed42-4f6a-9f06-27dd9f108f21.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Fitness Tracker feifuns Smart watches accurately record all-day activities like steps, distance, calories burned, miles walked,heart rate, blood pressure ect. Also the watch has a changeable band allowing you to switch to different colors to meet your daily style needs. Heart Rate/Blood Pressure/Blood Oxygen Monitor This watch tracks your heart rate, blood pressure and blood oxygen in a very convenient way, making it a very good health assistant for you. (Note: The blood pressure & blood oxygen monitoring of this watch are for reference only and cannot be used for medical purposes.) Bluetooth Call Smartwatches You can make/answer and refuse a call on your wrist.Our watch also displays all notifications from cellphone, such as Facebook, Email, WhatsApp, SMS etc. IP67 Waterproof Watch IP67 waterproof design allows you not to worry about the watch being wet while washing your hands or in the rain, does not support hot water shower.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/720000d5-c0a2-41c7-8246-54baaed86ebe.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f3307b5c-7e2e-4df5-bae5-39dc9bd9f913.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/01961c42-0525-48fa-8177-ea87e8e4e8f0.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/340e3667-f096-4e0e-99ac-f1c11ea6cbee.__CR0,0,300,300_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Weather Forecast The weather forecast function needs to be connected to Da Fit APP. After the connection is successful, the weather data of the phone will be automatically synchronized to the watch. Breathe Training Take a little time every day to do some deep breathing, can reduce stress, calm body and mind, and in the long run, it will be helpful to your health. Remote Camera Turn on the app connect the watch to the phone,use the remote control to take a photo,click the watch you phone will catch the beautiful moment that you want. Other Functions Smart NotificationsWake-up GestureSleep MonitoringMusic PlaybackLightness AdjustbleAlarm ClockStop WatchSedentary Reminder",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/61b2ef98-9270-41c3-9136-48a7bf2cde06.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f953327-0414-43f9-bfb3-98b4224bbcb6.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0c265470-e899-4211-a0fb-19fb7d11bcb2.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bac6368-836c-4b07-afc6-4849c88a24aa.__CR0,0,300,300_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "---------------- [FAQ] ---------------- Q: Does this smartwatch work with my phone? A: Our bluetooth call watch is compatible with most iOS 8.0 & Android 4.0 or above and Bluetooth 4.0 or later smartphones. Please check your smartphone's version in “Setting”-Aboat phone” Q: How to turn on the watch and set the time? A: When you first use the watch, please charge it first to activate it, or it will not tun on. The smart watch's time will automatically sync with your phone after you connect through the 'Da Fit' app. The watch cannot set the time by itself. Q: Can I make a call with your watch? A: Yes, you can, this watch support bluetooth call, when the Audio bluetooth is connected with phone successfull, you can make/answer/reject the call on your wrist. Q: I don't want to play music or YouTube /facebook from the watch? A: This watch also supports media audio, and default is on. When you play youtube, the sound will play from the watch. You can turn off Media audio: Go to the Bluetooth setting of smartphone -- Paired Device -- Audio_ FE1-- Click the settings Icon on the right -- Click \"Disconnect\" or turn off the switch on the watch (Slide down the homepage and find the call icon, click it to turn off the switch on the watch) Q: Is the strap Replaceable? A: Yes, the width is 22 mm and you can buy extra bands in our store or from others that match the size. Q: How to add the frequent contacts? A:You can add up to 8 frequent contacts, Please connect your watch to your phone via the Da Fit app and then add contacts in the Da Fit app-Device-Favorite contacts-Add contacts. Q: Can the watch switch to 12 hours/ imperial unit? A: Yes, you can set it in the app--Other--Time Formats/ Unit Format--12 hours/ imperial unit Q: The watch always light up in the night, how to turn off? A: You can set “Do not disturb mode” on the watch: Press the button to enter the menu -- Set up -- Do not disturb -- Set do not disturb period Q: How to change the watch face? A: Long press the watch and slide right of left to change the face, you can also select more faces from Da Fit app or customized the face in the app -- Device -- Watch faces -- More Q: Why can't receive message? A: Please make sure that Da Fit app has the permission to read notification: Settings -- Notifications -- Da Fit -- Allow Notifications; Please connect your watch to your phone via the Da Fit app then open the Da Fit app -- Device -- Notification -- Turn on the Notification and SMS.",
                "media_link": []
            },
            {
                "media_text": "feifuns T99S smart watch feifuns FE1 smart watch feifuns ST5 smart watch feifuns HE1 smart watch feifuns ST22 smart watch feifuns P52 smart watch Screen Size 1.54 inch 1.72 inch 1.3 inch Round screen 1.75 inch 1.7 inch Curved screen 1.4 inch Waterproof IP65 IP67 IP65 IP67 IP65 IP68 Health Monitor ✓ ✓ ✓ ✓ ✓ ✓ Call & Message Reminder ✓ ✓ ✓ ✓ ✓ ✓ Custom Dial ✓ ✓ ✓ ✓ ✓ ✓ Make/ Receive calls ✓ ✓ ✓ ✓ ✓ NO Voice Control NO NO ✓ ✓ ✓ NO All-day Activity Tracking ✓ ✓ ✓ ✓ ✓ ✓ Band Size 20mm 22mm 22mm 22mm 20mm 20mm Compatibility iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above. iPhone, Samsung, Galaxy,SONY, HTC, LG, Google Pixel /Pixel XL, Huawei, Xiaomi, ZTE, Lenovo, OPPO, Vivo and other smartphones with Android 4.4 and above, iOS 8.0 and above.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8251fbba-0ce3-4a3b-998c-d372111a79ee.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e7b3cc2-ed42-4f6a-9f06-27dd9f108f21.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42ae5e64-02b4-4480-81a5-de1eafb023ff.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/720000d5-c0a2-41c7-8246-54baaed86ebe.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f3307b5c-7e2e-4df5-bae5-39dc9bd9f913.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/01961c42-0525-48fa-8177-ea87e8e4e8f0.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/340e3667-f096-4e0e-99ac-f1c11ea6cbee.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/61b2ef98-9270-41c3-9136-48a7bf2cde06.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f953327-0414-43f9-bfb3-98b4224bbcb6.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0c265470-e899-4211-a0fb-19fb7d11bcb2.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bac6368-836c-4b07-afc6-4849c88a24aa.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5bec78ae-5162-4bcb-9c82-f2b58f2f4918.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fddbb868-979d-48dd-b8de-b12f0dfadecc.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9fa764c-0df3-4290-a54b-124288fc6d1d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ac23325c-31d3-4f6d-99ba-b883b2cd21cc.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a1e4a96-ef54-4acf-98d5-ac0cb7c5efc6.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/12f02664-9052-41af-85ea-aea60c78ad1b.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "I am Lady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7QZPUKBDLR4E3N73V7TAZP5BQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DJZ79XI6BKLB?ASIN=B098NHSJZ2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 21, 2022",
                "reviewTitle": "5.0 out of 5 stars Excelkent",
                "reviewText": "Prior to making this purchase I read quite a few reviews and I’m ever so happy that I made this purchase. One review stated that this watch is bulky, it’s a computer folks! I’ve compared it to other smart watches and it is very much in line with others that cost 300 - 400 dollars. It works great making phone calls from a few favorites you add. You can answer any incoming call as long as you are no more than 10-15 feet from your phone. Works great in the car or say, while shopping and you do t want took out your phone. I have routine doctors visits and check my blood pressure reading, heart rate and oxygen levels in comparison to those done at the doctors offices. Very accurate! Weather is also very accurate and the pedometer function. Works great with my apple health and WW app. As far as it being waterproof, I’m not so confident; however, it is “sweat proof”. I does come with two watch bands, one pink and one white with more choices to purchase. I am more than pleased with this product. The only difficulty one MAY run into: getting excited and not adding it properly to the phone. The Da Fit app must be installed and the watch added to that app for it to keep current and records. When adding it to Bluetooth there are two items to add, one is FE1 and another Audio_fe1. The second is that which enables phone calls and music streamed through the watch. For me, installation and using this item has been a wonderful surprise and pleasure to use. One minor issue is once the audio is installed it will stream all audio across the watch and if you don’t want that, just disconnect that one item. I love this item. From ease of installation to accuracy and wearability, I am well pleased. One other note: the battery has lasted up to a week if I don’t use the audio portion to about three days if I use it making phone calls and streaming music. It is well worth it!!!",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lacie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQIYLK3CDYIQKUAKIEG7QDP46WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK1FVKNPT7Z8J?ASIN=B098NHSJZ2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2022",
                "reviewTitle": "5.0 out of 5 stars Decent product, Top notch seller",
                "reviewText": "We bought this watch for our 16 yr old daughter for christmas. She loved it and wore it every day, up until the screen stopped responding, now it is basically useless. We contacted the seller who responded very quickly and asked for an address to ship a replacement to. No fight, no questions and no fuss, they simply handled it very professionally and stood behind their guarantee. As for the watch, it does everything it says. As for the review claiming false advertising about the ad saying it's waterproof, that buyer needs to read more carefully. We had zero issues with water contact during hand washing, etc. which is exactly what the watch is rated for. Don't be an idiot and wear it in the pool or shower/bath and you won't have any problems. We are not sure what caused the screen to stop functioning, but it certainly wasn't due to water intrusion as my daughter took really good care of it. This isn't a high end fully waterproof watch rated for depth. IP67 is very standard for small electronics, and very much what the listing states, there is no false advertising from this seller. Don't hesitate to buy anything from this seller, we have had a great experience with them.",
                "reviewVotes": "64 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ninth graderNinth grader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIDME6WM6HBDSTSKA2AI6LGLARQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CQLS3HVMPNDK?ASIN=B098NHSJZ2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 25, 2023",
                "reviewTitle": "4.0 out of 5 stars So far I like the watch",
                "reviewText": "The watch is a Nice size, wouldn’t mind if it were to be Bigger either or a setting that enlarge text even more. The heartbeat are the same as my expensive brand Watch. I didn’t measure on a wrist blood pressure device to know if that’s accurate or not I’m hoping it is. The sleep tracker data is great, I wish it were more fitness and more health related watch faces too. It charged pretty fast. It’s keeping track of time of course.pairing all Bluetooth options was easy. It’s convenient how you can measure HR, BP, oxygen, etc right from the app as well as the watch itself , now thats the best feature I never seen on any other watches before , good idea! ! So far I noticed a big flaw while taking from watch the mic and speaker is hitting against the wrist skin and it makes sound go in and out. A different location would have helped that problem, maybe they will design watch a bit different in the near future and maybe even adding a voice assistant like Alexa or something. This watch is a good gift for someone you like.Also, Maybe I should put both my watches on and see if the steps counter etc match up too. I’m still testing everything out. Screen is clear and I recommend watch so far",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71OXAzvl7gL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Operator22",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUA553KDNQUK67T6WRFSJ4CHVBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JJJLZOMVLVKH?ASIN=B098NHSJZ2",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "1.0 out of 5 stars DO NOT BUY!",
                "reviewText": "So the watch looked great when it arrived. Very large, colorful display, nifty, iPhone-esque magnetic charger, and soft rubber wrist band. After letting it charge up for a bit I checked the features and except for the watch faces being mostly goofy and substandard, everything else looked decent, and I figured I could download watch faces I liked...oh how mistaken I was.Then I scanned the QR code that took me right to the Google Play store and the V-band app, downloaded it, and began to realize the product was not what was represented. You see, a smart watch is really only as good, only as useful as the app that supports it. In the case of V-band, many, if not most of the features stated were not available. I could not select any of the presented watch faces, nor could I update my Samsung S20 Ultra to enable the app settings. I tried everything - as I'm sure many others have done, and had kind of resigned myself to just putting up with the dysfunctional app and not being able to enjoy the watch as I had expected. Then I thought, \"No, not this time. The watch might have been inexpensive, but even it it cost only a nickel, why should I accept it!\"So I jumped on Amazon to request a return authorization and send this thing back. I can tell you now, before I order the next smart watch I will first make sure to download the supporting app and see how it trials on my phone first!IF the app were functional, then maybe the watch would be great but there is no way to know if the support app is lame. READ THE REVIEWS on the app website and you will see the common theme.Do not buy any smart watch that uses the V-band app unless you've already trialed it on your phone and feel pretty sure it will work with the watch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucrecia Gurza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 17, 2023",
                "reviewTitle": "No es lo que anuncian. No me gustó",
                "reviewText": "No es lo que anuncian",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergio R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 13, 2023",
                "reviewTitle": "Poco duranle",
                "reviewText": "Lo tiene un año y se descompuso",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luciana Simmonds",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 25, 2021",
                "reviewTitle": "Impressive. Loved it",
                "reviewText": "I loved it. Its more than I expected",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gillian PriceGillian Price",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 7, 2021",
                "reviewTitle": "I'm so pleased with my new smart watch",
                "reviewText": "I love the smart watch it does, exactly what it describeson advertisement, I'm so pleased with it, thank you!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61PWhmvPAbL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51K+p05DB3L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TattZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 5, 2021",
                "reviewTitle": "Eine gute Uhr",
                "reviewText": "Ich bin mit dieser Uhr sehr zufrieden. Das telefonieren mit ihr funktioniert sehr gut. Die Lieferung ging auch sehr schnell, Samstag ist ausgeschrieben gewesen und am Freitag ist sie schon da gewesen. Das Display ist schön groß und Bediener freundlich. Die Vibration könnte etwas stärker sein oder so das man sie einstellen kann. Schön finde ich das man das eigene Design von seinen Bildern machen kann. Zur Akku Laufzeit kann ich noch nicht viel sagen, habe sie ja erst seit drei Tagen. Aber ich muss sagen das man hier für gutes Geld eine sehr gute Alternative zur Apple Watch bekommt.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}