{
    "remaining_requests": 42115,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ID-COOLING-XF-12025-ARGB-TRIO-Management-Addressable-Connector/dp/B08PYPQ8SB",
    "body": {
        "name": "ID-COOLING XF-12025-ARGB-TRIO 120mm Case Fan ARGB 3 Pack RGB Fans 5V 3-PIN Connector MB Sync Internal Fans Cable Management Silent Fan PWM Fan for CPU Cooler/Radiator/PC Chassis",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/ID-COOLING-XF-12025-Trio-Cooling-Raidator-Chassis/dp/B09CTMYFL3",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B09CTMYFL3"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "This item cannot be shipped to your selected delivery location. Please choose a different delivery location.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41azVLJoctL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41K 2V08veL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sDAubNvAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QgzDDjm3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hdovMJ6mL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Z-DvHFCHL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the ID-COOLING Store",
            "link": "https://www.amazon.com/stores/ID-COOLING/page/6A3E8AED-2F2A-4FE7-B443-3B6041B25D97?ref_=ast_bln"
        },
        "brand": "ID-COOLING",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 338,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【PWM fan】The PWM fan control allows for dynamic speed adjustment between 700 rpm to 1, 500 rpm, minimizing noise or maximizing airflow. Max. Air Flow: 62CFM",
            "【Addressable RGB Lighting】The Addressable RGB lighting is adjustable to match your PC build.",
            "【RGB Sync】The addressable RGB lighting can sync with the motherboard via the 5V 3PIN connector.",
            "【Compatibility】The standard 120X120X25mm cooling fan is designed to match the CPU cooler, CPU water cooler, pc case, etc.",
            "【Superior Build Quality】High quality fan blades and frame built-in extremely even light diffuser. The 120mm fan Blade engineered for Low-Noise operation without sacrificing performance"
        ],
        "description": "XF-12025-ARGB-TRIO 3 Pack Case Fan The XF-12025-ARGB-TRIO PWM fan combines excellent airflow, low noise operation, and brilliant independent RGB LEDs. Using three optimized 120mm fan blades and PWM control, set the speed of the fan anywhere from 700 RPM to 1, 500 RPM for precise noise and airflow adjustment. Great Cooling Performance The fans can be widely used to cool the radiator, heat sink, and PC case. Every piece of XF fan is balanced to provide the best cooling performance with the lowest noise. RGB Lighting The addressable RGB lighting on fans is adjustable to match your PC build.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Fans & Cooling",
                "link": "https://www.amazon.com/Internal-Fans-Cooling-Components/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3012290011"
            },
            {
                "name": "Case Fans",
                "link": "https://www.amazon.com/Computer-Case-Fans/b/ref=dp_bc_aui_C_6?ie=UTF8&node=11036291"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 4.72 x 4.72 x 0.98 inches; 15.87 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 8, 2020"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ ID-COOLING"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B08PYPQ8SB"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#213 in Computer Case Fans"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 338 ratings"
            },
            {
                "name": "Product Dimensions",
                "value": "4.72\"L x 0.98\"W x 4.72\"H"
            },
            {
                "name": "Brand",
                "value": "ID-COOLING"
            },
            {
                "name": "Power Connector Type",
                "value": "3-Pin"
            },
            {
                "name": "Voltage",
                "value": "5 Volts"
            },
            {
                "name": "Wattage",
                "value": "3 watts"
            },
            {
                "name": "Cooling Method",
                "value": "Water, Air"
            },
            {
                "name": "Compatible Devices",
                "value": "Desktop"
            },
            {
                "name": "Noise Level",
                "value": "26.4 dB"
            },
            {
                "name": "Maximum Rotational Speed",
                "value": "500 RPM"
            },
            {
                "name": "Air Flow Capacity",
                "value": "62 Cubic Feet Per Minute"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "XF-12025-ARGB-TRIO 3 Pack Case Fan The XF-12025-ARGB-TRIO PWM fan combines excellent airflow, low noise operation, and brilliant independent RGB LEDs. Using three optimized 120mm fan blades and PWM control, set the speed of the fan anywhere from 700 RPM to 1, 500 RPM for precise noise and airflow adjustment. Great Cooling Performance The fans can be widely used to cool the radiator, heat sink, and PC case. Every piece of XF fan is balanced to provide the best cooling performance with the lowest noise. RGB Lighting The addressable RGB lighting on fans is adjustable to match your PC build. Specifications Fan Dimension: 120×120×25mm(PWM) x3PCS Fan Speed: 700~1500±10%RPM Noise: 18~26.4dB(A) Bearing Type: Hydraulic Bearing Connector: 4Pin PWM / 5V 3Pin ARGB",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/9465522e-9141-48fa-993a-ae28de7ab36e.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "SUPERIOR BUILD QUALITY High-quality fan blades and frame built-in extremely even light diffuser. The 120mm fan Blade engineered for Low-Noise operation without sacrificing performance. RGB CONTROL The addressable RGB lighting can sync with the motherboard via the 5V 3-PIN connector. MATCH YOUR PC BUILDS The addressable RGB light makes the PC builds colorful and bright. It can not only ensure excellent heat transfer but also brings visual enjoyment.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/87180254-b067-4102-93b7-04b3a9e60174.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ab99c464-3873-4872-bc65-a256e3790b59.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/f43d1f03-1469-4c55-adb6-f4ef183ae3f5.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/1572d14f-0f28-42ab-9f50-5ec7c63c9a44.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f0a8bcb-0943-4d6d-bd50-1e69317c8838.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9465522e-9141-48fa-993a-ae28de7ab36e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/87180254-b067-4102-93b7-04b3a9e60174.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ab99c464-3873-4872-bc65-a256e3790b59.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/f43d1f03-1469-4c55-adb6-f4ef183ae3f5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9430468b-ceb4-4a87-86c3-60ae99052e09.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "jeffrey jenkins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4ODUNCGHMST64SRTFZDFNABE5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WX48SMUJFP4N?ASIN=B08PYPQ8SB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Its a cheap must have",
                "reviewText": "The ID-COOLING XF-12025-ARGB-TRIO 120mm Case Fan ARGB 3 Pack has impressed me with its eye-catching aesthetics and solid performance. These RGB fans provide an excellent balance between stunning visual effects and efficient cooling capabilities. After installing them in my computer case, I've experienced a significant improvement in airflow and an enhanced overall gaming experience. Here's why I recommend the ID-COOLING XF-12025-ARGB-TRIO Case Fan:Striking RGB Lighting: The XF-12025-ARGB-TRIO fans truly stand out with their vibrant and customizable RGB lighting. The array of colors and effects create an immersive and visually appealing experience. The 5V 3-PIN ARGB connectors allow for seamless integration with compatible motherboards, providing smooth synchronization with other RGB components in the system. The fans' lighting effects add a captivating ambiance to any PC build.Effective Cooling Performance: Beyond their aesthetic appeal, the XF-12025-ARGB-TRIO fans excel at their primary function—cooling. With a maximum speed of 1500 RPM, these fans deliver a significant amount of airflow, effectively dissipating heat from the components within the case. The balanced blade design ensures optimal cooling efficiency while maintaining a reasonable noise level, making them suitable for both gaming and everyday use.User-Friendly Installation: Installing the XF-12025-ARGB-TRIO fans was a hassle-free process. The fans come with rubber mounting pads and screws, providing multiple options for secure installation. The 3-pin connectors easily plug into corresponding motherboard headers, simplifying the setup and eliminating the need for additional cables or controllers. Even users with limited technical expertise will find the installation process straightforward.Low Noise Operation: Despite their powerful airflow, the XF-12025-ARGB-TRIO fans operate quietly. The fans are equipped with fluid dynamic bearings, ensuring smooth and silent operation. Even at maximum speed, the noise produced remains within acceptable limits, allowing for an immersive gaming or working environment without distracting background noise.Reliable Build Quality: The XF-12025-ARGB-TRIO fans boast a sturdy construction, with high-quality materials that inspire confidence in their durability. The fans feel solid and well-made, indicating that they can withstand extended usage without any performance degradation. This reliability is crucial for those seeking a long-lasting cooling solution for their PC.In summary, the ID-COOLING XF-12025-ARGB-TRIO 120mm Case Fan ARGB 3 Pack is an excellent choice for PC enthusiasts and gamers seeking a combination of stunning RGB lighting and effective cooling performance. These fans deliver on both fronts, with customizable lighting effects and reliable cooling capabilities. The easy installation process, low noise operation, and durable build quality make them a worthwhile investment for anyone looking to upgrade their PC's aesthetics and thermal management.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SebastianSebastian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYIVAKY4DT727SU2CRWLYNY2FLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GEKN9XP5CSJP?ASIN=B08PYPQ8SB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful",
                "reviewText": "These fans surprised me, the low cost made me think they were going to feel cheap and possibly loud, I was so wrong! The rgb is beautiful, aura sync app customizes colors and scenes well, super quiet I can’t even hear them with my headphones off, and they don’t feel cheap either, they are heavy and thick! Great product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61xVP6gQALL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Groy Pereira",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMSOJQS6W64UAU2K7JM4TTRBC5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UHFEOP68HDBI?ASIN=B08PYPQ8SB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "4.0 out of 5 stars \"ID-COOLING XF-12025-ARGB-TRIO: Fantastic Addition to Any Rig!\"",
                "reviewText": "I recently purchased the ID-COOLING XF-12025-ARGB-TRIO 120mm Case Fan set for my gaming PC, and I must say, I'm thoroughly impressed. The installation process was a breeze, and the fans' performance has significantly improved my system's overall cooling efficiency.Pros:Eye-Catching Aesthetics: The ARGB lighting is vibrant and customizable, adding a visually stunning touch to my setup.Efficient Cooling: These fans effectively circulate air throughout the case, keeping my components at optimal temperatures even during intense gaming sessions.Quiet Operation: Despite their powerful performance, these fans operate quietly, maintaining a peaceful environment during use.Cons:Instruction Clarity: While the installation was easy, the provided instructions were somewhat unclear, which might pose a challenge for first-time builders.Overall, the ID-COOLING XF-12025-ARGB-TRIO 120mm Case Fan set is a great investment for anyone looking to enhance their PC's cooling capabilities while adding a touch of style. Despite the minor issue with the instructions, the quality and performance of these fans make them a solid choice for any PC enthusiast.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matt J.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJY6KKDQX6TN75ZGKYCLV2BUWOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F6BE02UVXK4R?ASIN=B08PYPQ8SB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastically bright ARGB Case Fans!",
                "reviewText": "I bought these to go into a rebuild that I was giving to my nephew for a Christmas present. I wanted to get fans that had ARGB capability, but that also weren't super-expensive. I settled on these, and have been quite happy with them.The fans themselves are solidly built, include great accessories, and are clearly designed with the budget enthusiast in mind. The RGB LEDs are very bright, and appear to project better color than fans at twice the cost. For ~$23 for three fans, I'd say that this is one of the best values going right now.If I was to downscore them for anything, here's what it'd be:1) I had one fan that had what I can only guess was a bad hub/bearing, so when it got up to speed, it sounded like either the world's tiniest weed-whacker or an angry cricket. My wife couldn't hear it, but I could from two rooms away. But, when you consider that I bought about 14 of these (between the CPU cooler and the three-packs of fans, that's not terrible).2) The ARGB plugs are a little chunky - although this is likely only going to be a problem if you're using specific manufacturers of ARGB fan hubs. I tried these fans with the Cooler Master device, and the ARGB housing was a little chonky - I had no issue with a different manufacturer, though. (You can also use the included 4-fan ARGB cables, although I do suggest using electrical tape for that extra emphasis on keeping them together, but that's a belt-and-suspenders-type idea, and not at all required or even necessary.)3) This isn't anything about these fans, but the ARGB connector as a whole is one of THE WORST connecters that I've seen in over 30 years of building PCs. That said, the ARGB connecters on these fans was FAR better than most that I've seen in the past.As you can see though, I didn't actually downscore for these items, because for me they were all easily offset small potatoes.End result, great budget fans, and I think that most folks will be quite pleased with this as a purchase.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Larry miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AES4U4JQKMAKCIHVZTN4A36BOBTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROJI9RYIW6SOT?ASIN=B08PYPQ8SB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars all 3 fans work great.",
                "reviewText": "comes with hardware and easy to install",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David HarryDavid Harry",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 8, 2022",
                "reviewTitle": "Excellent value for money RGB fans",
                "reviewText": "One thing that may not be clear. These fans come with a power splitter cable and an RGB splitter cable. Basically, you can daisy-chain up to 4 fans from the 3 pin RGB header form a MB with one splitter cable and the other splitter cable can daisy-chain the PWM power for the fan power.Again, to be clear. When these things say 3 pin for the RGB, it's the 4 pin socket that has 1 pin missing. These are also called ARGB or the \"digital\" version. Basically, this is the 5 Volt version, which is the easier one to use as you can't get the cable the wrong way round. The other version, the 12 Volt one, can be a bit confusing and you can easily get the cable the wrong way round, which can cause damage.As for the fans. They are quiet enough, I've heard quieter and I have heard much louder. On slower speeds they are nice and quiet and it's likely that your GPU fans will mask any of the noise from these fans.The light is good, not too bright and not dull either. If you have 3 or 4 of these in your system you should be happy with the overall brightness and the colours look very good.As for durability. Of course, only time will tell but out of the box I have no reason to second them.All in all, these are excellent value for money and I will definitely be buying more for other builds and would totally recommend them.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61KgRbVqkuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51sex88A2oL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/516S6Z8223L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/616P7zMn9iL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Parmar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 21, 2023",
                "reviewTitle": "Very quiet and excellent RGB",
                "reviewText": "Whats not to like, competitively priced, quiet operation and really good RGB. Can be daisy chained, so you need just one fan and ARGB header on your motherboard",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H Linden",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 4, 2023",
                "reviewTitle": "Amazing value fans",
                "reviewText": "For the price these fans are excellent. Easy to install with long cables and everything can be daisy chained.Noise level is pretty good but not as good as something like Noctua (at 3x the price) and in a light room the RGB may look a little bit dim.However for the price the value is very hard to beat.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aaron Jacobs",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 3, 2023",
                "reviewTitle": "Surprisingly good",
                "reviewText": "These are actually well presented, surprisingly quieter than coolmaster products, substantially cheaper than Cosair and come with everything you need.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "2pk dog car seatbelts ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 11, 2023",
                "reviewTitle": "Cooling fans",
                "reviewText": "Fitted easily and work great. Nice and quiet too",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}