{
    "remaining_requests": 41879,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cooler-Master-Bearing-Computer-Coolers/dp/B005C31GIA",
    "body": {
        "name": "Cooler Master Sleeve Bearing 80mm Silent Fan for Computer Cases and CPU Coolers",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cooler-Master-Bearing-Computer-Coolers/dp/B005C31GIA",
        "soldBy": {
            "sellerID": "A6SXSZXC805J3",
            "name": "TeKit Coolstore",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A6SXSZXC805J3&asin=B005C31GIA&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00BVKRPIS"
        ],
        "asinVariationValues": [
            {
                "asin": "B005C31GIA",
                "variationName": "Size",
                "variationValue": "80mm",
                "price": "$9.99",
                "variationImageURL": ""
            },
            {
                "asin": "B002R9YYXG",
                "variationName": "Size",
                "variationValue": "92mm",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B000O8I474",
                "variationName": "Size",
                "variationValue": "120mm",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00314J422",
                "variationName": "Size",
                "variationValue": "140mm",
                "price": "$13.29",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Fz7Gpo 4L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Cooler Master",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Cooler+Master"
        },
        "brand": "Cooler Master",
        "merchantInfo": "TeKit Coolstore",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3326,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Recommended for CM 690 / 590 / 690 II",
            "Efficient 11-blade fan design for increased cooling at lower speeds",
            "24.2 CFM Higher airflow to enhance cooling performance",
            "Silent operation at 20 dB-A for excellent case cooling",
            "RoHS compliance for protecting the environment",
            "Recommended for CM 690 / 590 / 690 II. 3 pin Connector. 2000 R.P.M. ± 10% Speed (R.P.M.)"
        ],
        "description": "The 80mm slim fan is designed for special application spot cooling in Cooler Master chassis. These slim fans are low profile and designed to fit better in CM 690, CM 590 and CM 690 II Advanced and Basic models.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Fans & Cooling",
                "link": "https://www.amazon.com/Internal-Fans-Cooling-Components/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3012290011"
            },
            {
                "name": "Case Fans",
                "link": "https://www.amazon.com/Computer-Case-Fans/b/ref=dp_bc_aui_C_6?ie=UTF8&node=11036291"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.15\"L x 0.6\"W x 3.15\"H"
            },
            {
                "name": "Brand",
                "value": "Cooler Master"
            },
            {
                "name": "Power Connector Type",
                "value": "3-Pin"
            },
            {
                "name": "Voltage",
                "value": "12 Volts"
            },
            {
                "name": "Wattage",
                "value": "1.44 watts"
            },
            {
                "name": "Cooling Method",
                "value": "Air"
            },
            {
                "name": "Compatible Devices",
                "value": "Desktop"
            },
            {
                "name": "Noise Level",
                "value": "20 dB"
            },
            {
                "name": "Material",
                "value": "丙烯腈-丁二烯-苯乙烯共聚物"
            },
            {
                "name": "Maximum Rotational Speed",
                "value": "2 RPM"
            },
            {
                "name": "Item model number",
                "value": "‎R4-SPS-20AK-GP"
            },
            {
                "name": "Item Weight",
                "value": "‎1.59 ounces"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎3.15 x 0.6 x 3.15 inches"
            },
            {
                "name": "Manufacturer",
                "value": "‎Cooler Master"
            },
            {
                "name": "ASIN",
                "value": "‎B005C31GIA"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎June 8, 2011"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,326 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#535 in Computer Case Fans"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Cooler Master Sleeve Bearing 80mm Silent Fan Features: Recommended for CM 69024.2 CFM Higher airflow to enhance cooling performanceSilent operation at 20 dB-A for excellent case coolingFan Dimensions (L x W x H) 80 x 80 x 15 mm / 3.2 x 3.2 x 0.6 inch Fan Rated Voltage 12V DC Fan Rated Current 0.12 A Fan Power Consumption 1.44 W",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/7cec1f8c-e3db-462f-8188-fa0ee359f2b5.__CR0,0,500,500_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/7cec1f8c-e3db-462f-8188-fa0ee359f2b5.__CR0,0,500,500_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2CAHKOOLQPX46UZTCJHN2NDNWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15966AVAVIIYW?ASIN=B005C31GIA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2010",
                "reviewTitle": "5.0 out of 5 stars you can't get a better deal than this",
                "reviewText": "I originally found an entry on an unnamed \"deals of the day\" website that had a competing site selling 2 Scythe S-FLEX (E-Series) fans for $20. I heard they (Scythe fans) were some of the best fans out there, and was about to spring for that deal... but when I realized after the added 8 dollars for shipping, it came out to be about 30 dollars... 15 bucks per fan. not so much of a bargain anymore. some fellow in that thread mentioned that if you want a real bargain, get these puppies from Amazon. Four 120mm fans for just over 10 dollars. Of course I had to take a look, and I'm glad I did.Now, when I built my computer, I bought a CoolerMaster case (CM690). This case has room for 7 case fans I believe. It came with three of these very same model fans, so I already knew from personal experience that they were very quiet and did the job. Certainly worth 3 dollars a fan, no doubt; plus I wanted to add some extra fans since I had so many available mount areas in the case and the daily temps are in the upper 90's right now.Ordered them, got exactly what you see in the picture. It's been said before, it's only 4 fans, and 12 screws for mounting. The fans are three pin. In my case, I have areas for 7 fans, but my board only has 3 headers! So I feel a lot of you are going to have to either get a couple of 3-pin splitters or something for these to use them all.The fan cords themselves are approximately 12\" long. My front fan cord will not reach any of the fan headers on my motherboard, so I had to use the dreaded 4-pin molex adapter /slash/ monstrosity that turns your tidy cable management into a rat's nest. I would really recommend something like this -- http://www.amazon.com/1FT-TX3-Power-Splitter-Cable/dp/B002DY7M1G/ref=sr_1_1?ie=UTF8&s=electronics&qid=1277947201&sr=8-1That will allow you to hook up 2 of these fans into only 1 motherboard fan header -- plus, it gives you an extra 12\" of cord. With 24\" of cable (including the fan's cable itself), it should reach to the darkest corners of any sized case, and will be a lot more manageable and cleaner looking than the hideous molex/4-pin adapters.So how about the noise? What can we compare it to in real life? Ok -- right now, in my case (1 foot from me, at about shoulder level) I have 6 of these fans running, plus the CPU fan. I would most closely compare the noise level to that of an air vent or air conditioner intake when your central AC is on. Just a very low, non-distracting flowing air noise.Now if I get crazy and crank them to wide open, they are a bit noiser, but really not too unbearable. I would compare 6 of them at full speed to the noise level of maybe... an electric toothbrush? This is a bit distracting, as it actually catches my attention (as said though, the case is 1 foot from me, nearly level with my shoulders/head).If you let the motherboard control the speed of the fans, they are very near silent. It sounds like maybe a newer CD-ROM drive steadily spinning a CD at idle (*not* revving up).So if you are even questioning getting this... just spring for it. They may not be super high-end wind tunnel 250CFM fans that will allow you to use your computer case as a second freezer, but they do the job, and they do it well for such a tiny amount of money. On a side note, I recommend CoolerMaster products in general... especially their cases. Sturdy and well thought-out designs.P.S. -- fan direction and airflow is sometimes a science, depending on where your mount holes are and what kind of heatsink, etc, you have. Personally, this is my config:1 front fan pulls air into the case, over the hard drive bay area1 back fan, obviously pushes hot air out the back2 top mounted fans, with air flowing upwards and out of the case (my thought behind this was hot air rises, so at the top of the case is most likely going to be hot air that I want to remove from the case, not blow it back in)2 side mounted fans (this one is tricky, as one is over the add-in card area... which I have pulling in cool air -- and the real question is: what about the fan mount right above the heatsink? I'm using the Intel stock heatsink & fan, which blows air straight up off the processor, which would be perpendicular to the side of the case. my thought here was at this mount area, have the fan blowing air *out* of the case, since hot air is going to blow off of the heatsink, into this fan, which will expel the air out the side of the case)Point is, though: When you start working with 4, 5, 6 or more fans... you're creating areas of high and low pressure, which can make the heat move differently than you might expect. Some configurations that I expected would dramatically reduce case temps in fact did the opposite and raised my temps!The only things I wish these fans had but don't are 1) shielded/covered cables. looks a lot nicer when the three yellow, red and black cables are wrapped in a black shielding. I imagine this could be done with some duct tape after you got your cables routing where you want, so it's not a big deal... and 2) maybe if the cables were a little bit longer... like maybe 18\" would be great, for larger cases. It gets annoying having to reach in and unplug the side fans every time I want to take the side cover off! Other than that, this pack is the cat's pajamas.",
                "reviewVotes": "83 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVIQZ5H2SHFPG65KY4Z7YHKV4JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19VLJDX6BMN57?ASIN=B005C31GIA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 8, 2014",
                "reviewTitle": "5.0 out of 5 stars Cool, quiet and on budget.",
                "reviewText": "First thing I would like to address in this review is, if any of these fans make any noise, they are defective. You buy from Amazon for a reason. Send it back and get working ones. Amazon has great service and will not charge you a penny for DOA s. I say this because there are several negative reviews claiming that the fans make too much noise, which isn't the case in a properly working fan.Now about the fans, they are so quiet, even at full power. You can't tell your computer is on without checking to see the power LED on your rig. They are less than $4.00 per fan. These are the same fans that came with my case, a Coolermaster HAF 812. I had six fans running and not even a hiss.They offer a nice balance of speed, volume of air, and silence costing at least 3 to 4 times as much.I have been experimenting with some of the more powerful fans available in the marketplace. The highly regarded Scythe fans push more air but at the expense of making noise. They are more costly, make more noise at a high enough speed to make a difference. Compared to the Scythe fans a Glidestream 140 and a Kaze Maru PWM 120mm, each costing the same as these four fans. The Cooler Masters win both on price and effectiveness.The only thing that these fans lack is PWM. The connector is 3 pin, and not 4. If your needs don't require PWM, I highly recommend these fans to anyone who is on a budget, or who appreciates the sounds of silence.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ben Buchanan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDE5Y7V47QWCBEUP2CQHTXRSOWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LYP00TD9QXVS?ASIN=B005C31GIA",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 3, 2014",
                "reviewTitle": "4.0 out of 5 stars Quiet, effective, great value.",
                "reviewText": "My desktop has a design flaw which causes it to overheat--there is a CPU fan, but no original case fan. I was using a second hand fan a friend installed for me, but it broke down recently and I needed a more permanent replacement. When I saw this 4 pack of 120mm fans, I was impressed by the price and the reviews. I decided to give them a try.When the fans arrived, I was excited to install one right away. The box included four fans, as advertised, complete with installation screws in separate plastic bags. But when I pulled out the first fan, I noticed that the connector was not a 4-pin molex (for connecting directly to power supply) that my previous fan was, but a 3-pin motherboard connector which was unfamiliar to me at the time. A little poking around showed me that the likely reason for my rig's design flaw was the apparent lack of these ports on my motherboard. There is only one and it supplies power to the CPU fan, leaving no source of power for a typical case fan like the ones I received. Fortunately, the local electronics store carries a 3-pin to 4-pin molex adapter cable for less than $3 and I found a 3 pack online for $6, making it a small problem, easily circumvented. If you're buying these, check your motherboard first for 3-pin ports, or else think about adapter cables ahead of time.Now that it's installed, it runs very quietly and keeps my PC's temperature down while running many programs simultaneously. I am impressed by the quality of the product and I still find the price compelling. I would highly recommend them to anyone in need of a simple cooling solution.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tngsg1a",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF62ZMTFQTTUPL6EOSJK5R3S43XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LAT1KGWUDC8S?ASIN=B005C31GIA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Fan",
                "reviewText": "Needed a replacement fan for small PC power supply this did the job have used the 80mm and 120mm version of this fan for years really quiet almost cain't hear the other have lasted a long time hope this one does also.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 13, 2022",
                "reviewTitle": "Excelente producto",
                "reviewText": "La verdad compre este por que de 80mm casi no hay a la venta y me convence la marca, por eso lo compre y la verdad funciona muy bien, lo note en las temperaturas de mi gpu, el conecto qué va la fuente si es un poco corriente pero pues solo lo instalas y ya, no es como si lo quitaras a cada rato, pensando claro que como armas un pc de Gama de entrada, pues en 120 mm ya tienes muchas ofertas qué en 80 mm no, si tienes duda es una buena compra funciona y saca el calor muy bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jon Rivers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 29, 2021",
                "reviewTitle": "Reasonably quiet, but not exactly quiet. Very good fans for the money. All I buy.",
                "reviewText": "I have bought quite a few of these fans over the years (not all from Amazon mind you). They are a good fan, at a fair price. The noise level is reasonably low for the price, but you'll still hear them if you've got 8 of them running in your PC like I do.If you want something quieter you're looking at BIG BIG MONEY per fan. These last years usually 24/7.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Walpole",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 5, 2022",
                "reviewTitle": "Standard fan",
                "reviewText": "In spite of the high UK price. my product was noisy with a bearing which got warm in normal use. If you really need a slim 80mm fan there are few other choices, but otherwise there are in my view better options.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jim Anderson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 21, 2020",
                "reviewTitle": "Nice and quiet",
                "reviewText": "Exact same one that came out of my computer , so perfect form fit and function... Some reviewers say the fan is noisy... When I first connected it I could hardly tell it was going it was so quiet, and continues to be extremely quiet.No issues whatsoever, time will be the true test of this fan, but so far, very impressed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lion2929",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 13, 2018",
                "reviewTitle": "Cooler Master fan 92mm",
                "reviewText": "parfait 2 fan tourne a 2200 rpm pour mon cpu cooler master en semble bien recu il marche numéro un merci cooler master",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}