{
    "remaining_requests": 42128,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AC-Infinity-MULTIFAN-Receiver-Playstation/dp/B00IJ2J2K0",
    "body": {
        "name": "AC Infinity MULTIFAN S5, Quiet Dual 80mm USB Fan, UL-Certified for Receiver DVR Playstation Xbox Computer Cabinet Cooling",
        "price": "$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AC-Infinity-MULTIFAN-Receiver-Playstation/dp/B00IJ2J2K0",
        "soldBy": {
            "sellerID": "A2AW0W4FKP16S5",
            "name": "AC Infinity",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2AW0W4FKP16S5&asin=B00IJ2J2K0&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51DW4aa4ngL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51DoEMCcJeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cOgWbXPeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EbPRReI5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AKlO n2OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sv2UbXqkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51atHQ8BMZL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81yzY1FJJ6L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/8133MJLWH3L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the AC Infinity Store",
            "link": "https://www.amazon.com/stores/ACInfinity/page/16FAF5B9-1BA1-499D-AC31-B85736AF165C?ref_=ast_bln"
        },
        "brand": "ACInfinity",
        "merchantInfo": "AC Infinity",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 9863,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 1 hr 3 mins",
            "FREE pickup Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest pickup Wednesday, February 14. Order within 1 hr 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Ultra-quiet UL-certified USB fans designed to cool various electronics and components.",
            "Features a multi-speed controller to set the fan’s speed to optimal noise and airflow levels.",
            "Dual-ball bearings have a lifespan of 67,000 hours and allows the fans to be laid flat or stand upright.",
            "USB plug can power the fan through USB ports found behind popular AV electronics and game consoles.",
            "Dimensions: 3.2 x 3.2 x 1 in. per fan | Total Airflow: 52 CFM | Total Noise: 18 dBA | Bearings: Dual Ball"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Fans & Cooling",
                "link": "https://www.amazon.com/Internal-Fans-Cooling-Components/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3012290011"
            },
            {
                "name": "Case Fans",
                "link": "https://www.amazon.com/Computer-Case-Fans/b/ref=dp_bc_aui_C_6?ie=UTF8&node=11036291"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.2\"L x 1\"W x 3.2\"H"
            },
            {
                "name": "Brand",
                "value": "AC Infinity"
            },
            {
                "name": "Voltage",
                "value": "7.2 Volts"
            },
            {
                "name": "Wattage",
                "value": "1.1 watts"
            },
            {
                "name": "Cooling Method",
                "value": "Air"
            },
            {
                "name": "Compatible Devices",
                "value": "Amplifier"
            },
            {
                "name": "Noise Level",
                "value": "18 dB"
            },
            {
                "name": "Material",
                "value": "Rubber"
            },
            {
                "name": "Maximum Rotational Speed",
                "value": "2.8 RPM"
            },
            {
                "name": "Air Flow Capacity",
                "value": "52 Cubic Feet Per Minute"
            },
            {
                "name": "Series",
                "value": "‎FBA_AI-MPF80A2"
            },
            {
                "name": "Item model number",
                "value": "‎FBA_AI-MPF80A2"
            },
            {
                "name": "Item Weight",
                "value": "‎8 ounces"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎3.2 x 3.2 x 1 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎AC Infinity"
            },
            {
                "name": "ASIN",
                "value": "‎B00IJ2J2K0"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎February 19, 2014"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 9,863 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12 in Computer Case Fans"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "MULTIFAN Series Designed to quietly cool Xboxs, Playstations, Rokus, Apple TVs, receivers, modems, routers, DVRs, computers, and other audio video electronics.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/9301e354-cb65-434a-bfc4-2985e2bfbe73.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Key Features Multi-Speed Controller Inline switch enables you to optimize fan speed for various applications. Can be powered through USB ports found behind AV electronics and consoles. Ultra-Quiet Fans Designed to maximize airflow CFM to noise dBA ratio. Dual-ball bearings rated at 67,000 hours allows the fans to be laid flat or stand upright. Quality Approved Contains UL recognized axial fans under #E503903 in 2018 by Underwriter Laboratories. Archived in UL Online Certifications Directory. Silicone Rubber Feet Absorbs noise and surface friction caused by fan vibrations. Unused pieces can be detached to reduce overall height for tight spaces.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/d64c6c83-860d-4a2f-a830-bef6d7280955.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/9f5f6061-24d1-40a3-8d69-f15736bcd69f.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/3bdf032b-70e1-4763-8847-ab988e158ecc.__CR0,0,459,459_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/0a23d6be-92fc-4534-b637-ae7bf1a2bdc3.__CR0,0,220,220_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "AC Infinity, MULTIFAN S1 Quiet USB Cooling Fan AC Infinity, MULTIFAN S3 Quiet USB Cooling Fan AC Infinity, MULTIFAN S4 Quiet USB Cooling Fan AC Infinity, MULTIFAN S5 Quiet USB Cooling Fan AC Infinity, MULTIFAN S7 Quiet USB Cooling Fan AC Infinity, MULTIFAN S2 Quiet USB Cooling Blower Model AI-MPF80A AI-MPF120A AI-MPF140A AI-MPF80A2 AI-MPF120A2 AI-MPB140A Dimensions 80x80x25 mm 120x120x25 mm 140x140x25 mm 80x80x25 mm (x2) 120x120x25 mm (x2) 120x120x25 mm Airflow 26 CFM 52 CFM 57 CFM 52 CFM 104 CFM 35 CFM Noise 17 dBA 18 dBA 18 dBA 18 dBA 19 dBA 17 dBA Multi-Speed Controller with Power Switch ✓ ✓ ✓ ✓ ✓ ✓ Dual Ball Bearings at up to 67,000 Hrs ✓ ✓ ✓ ✓ ✓ ✓ Axial Fans Meet UL-507 Standards in 2018 for Safety (Underwriters Laboratories #E503903) ✓ ✓ ✓ ✓ ✓ ✓ USB Plug with 6-foot Power Cord ✓ ✓ ✓ ✓ ✓ ✓ Compatible with Turbo Wall Adapter (Sold Separately) ✓ ✓ ✓ ✓ ✓ ✓ Applications (Can by laid flat or stand upright) Receiver, DVR, Router, Modem, Xbox, Playstation, and other Audio Video electronics Receiver, DVR, Router, Modem, Xbox, Playstation, and other Audio Video electronics Receiver, DVR, Router, Modem, Xbox, Playstation, and other Audio Video electronics Receiver, DVR, Router, Modem, Xbox, Playstation, and other Audio Video electronics Receiver, DVR, Router, Modem, Xbox, Playstation, and other Audio Video electronics Receiver, DVR, Amplifier, Router, Modem, and other Audio Video electronics",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/9301e354-cb65-434a-bfc4-2985e2bfbe73.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/d64c6c83-860d-4a2f-a830-bef6d7280955.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9f5f6061-24d1-40a3-8d69-f15736bcd69f.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/3bdf032b-70e1-4763-8847-ab988e158ecc.__CR0,0,459,459_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/0a23d6be-92fc-4534-b637-ae7bf1a2bdc3.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/1b907908-db93-4101-882f-ae9224a78d6c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9a4524c5-9e3a-4520-aaed-4dbdd407e0d4.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/d81d9dd3-1a0e-43d4-b34f-886effec0283.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/7ea54f36-89ca-4406-81c1-660093a30de0.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/881ffa50-a547-43c4-911e-6c6560903fce.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9a6ff4d6-cb97-416d-9edc-12235f96616e.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Flying Walrus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRLOJT5TESI33QL3C54O5COMO6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22Q4B6G50968C?ASIN=B00IJ2J2K0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2022",
                "reviewTitle": "5.0 out of 5 stars Cooling my modem and router",
                "reviewText": "My last cable modem up and died after just one year, I'm pretty sure because it got so hot all the time. It was a modem+router so extra hotty-hot-hotness from all the circuitry packed into one case. My son thinks this is sort of normal lifespan for routers and modems - he expects only 3 to 4 years. Well I got 8 years out of one of my last modems and 10 out of the other (same modem, WTGS54 whatever that was, it was a very good modem for its time and I got more than enough throughput from it for my needs, including streaming video, I was still running one up until 2 years ago).So *I* was shocked at its short lifespan (especially given the cost, over $200) even if he wasn't.There is just more electronics involved in these tasks, packed into less space, than the older modems. They are GOING to get hot. So in order to keep that from happening again I bought this USB fan kit, comes with 2 fans hooked together, to replace the floor fan I had aimed at the new modem and separate router. I was getting some of these anyway to put on my LED grow lights to cool them (they will ALSO last longer if you keep them cool) so I took one of those and shoved it under the router (because its a flat design, give me vertical any day) and stood the other one up next to the cable modem (which is vertical).I've got them on low and they are cooling both devices very well. On low the router gets barely slightly warm, and the better design of the vertical case for the modem leaves it totally cooled down with this little fan. If I had it to do over I'd look harder for a vertical router as well, its easier to keep them cool. AND they take up a lot less space! I've got a bunch of old computer cases with fans going to waste, I will likely make some USB fans from all those old bits and pieces, but they are likely to be a lot louder. This fan is extremely quiet even on high. I can't hear it at all on low.Also these fans in particular are optimized for humid environments so I wouldn't use anything else in my grow room. A lot of people use the other dual fan kit with the larger fans but they are using them to move air over microgreens to cut down on mold and fungi, I don't have that problem, I just need to cool the lights to improve their longevity, so I'm trying these smaller fans (take up less headroom over the lights, giving me more space under the lights because I can move them further up).I highly recommend cooling your router/modem/game console whatever electronic devices you have sitting around generating heat with some kind of fan, and these are very quiet, easy to assemble (as in plug them in), and very effective. I've seen some people insist that you shouldn't do this because it might \"blow dust into the case\" - where do these guys live, in the middle of death valley? LOL! Just do it. I've had a floor fan blowing across my very very ancient laptop to keep it from overheating for about 5 years now (even laptop coolers can't cool it enough) and its still going strong. I can even play (very very old) games on it still. Heat will kill your devices WAY faster than whatever tiny specks of dust these fans probably won't blow into the cases anyway.Also, if you have one of those stupid refrigerator closet things where they've built an enclosure all the way around the fridge, that is trapping heat and shortening the life of your expensive stainless steel fridge - you can use these fans to draw hot air out of that too (though I'd go with the larger version for that). Personally I'd tear that crap out but failing that, install these in a side or back wall and pull that heat out of there. Your fridge will thank you. Your bank balance will be the better for it over the long haul.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TallyManTallyMan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVY4RKOGP4JV32JUGQZ6PYYD7AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15I8R1YODPSEP?ASIN=B00IJ2J2K0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2015",
                "reviewTitle": "5.0 out of 5 stars Nearly perfect for cooling my Onkyo receiver, excellent functionality for the money",
                "reviewText": "RE: AC Infinity AI-MPF80A2 Quiet Dual 80mm USB Fan for Receiver ...PURPOSE, FEATURES, & QUALITY: Bought this pair to keep an Onkyo receiver cooler in a partially enclosed cabinet. The fans' switch is also a nice feature. When opened the shipping box, impressed with the fans apparent build quality, especially at this price (~$16). My fans were pre-assembled, but apparently some have needed some assembling. Time will tell how durable/reliable they are over the years.ON-SITE FUNCTIONING: Tested the fans on an open table in a large room and could barely hear them and they still put out a decent breeze. So, placed the fans on top of the receiver towards the back, about 11 inches from the open-front-edge of the cabinet, angling them so the breeze flowed over most of the top vents of the receiver, placed the wiring, turned on the fans, and cranked up the volume on the receiver. The receiver stayed almost entirely cool, a substantial improvement from the level of pre-fan heat. The fans' breeze can barely be felt at the front-open edge of the cabinet, but it appears to be doing the job -- if you plan to place the fans much deeper into a cabinet, you might need a stronger fan. Since the fans are black and placed at the back of the receiver inside the cabinet, they are inconspicuous enough. (Photo of fans' placement attached)NOISE LEVEL of the fans in the cabinet: With the receiver off and the fans on, can hear the fans from a few feet away but not annoying or intrusive. With receiver on and playing any audio, I can't hear the fans at all. (Qualifier: I have some hearing loss, especially in one ear.)CONCLUSION: These fans are doing exactly what I needed at a reasonable price and their noise is not distracting where we have them located. So far, I'd definitely buy again for this purpose.-ADDED ON EDIT, 5/18/2015: For my purpose, these fans worked so well, I have ordered another pair of them for an Onkyo in another room.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71NIdfJUXhL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJXSCOJGRDVTAL5B7ZANXCG7CGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MZTYXHY3920R?ASIN=B00IJ2J2K0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Exactly what I needed",
                "reviewText": "Got this for my son’s ps5. Excellent product to keep anything cool. Even on high, barely noticeable sound. The on/off switch seems to be well made as well. Cables are long enough. They seem to be very durable and powerful enough to get the job done.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2M7HAURH2TCQKVFQ5EV7UZHVSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX7M7MYFM1DBR?ASIN=B00IJ2J2K0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2020",
                "reviewTitle": "4.0 out of 5 stars Not Exactly What I Wanted But a Good Product",
                "reviewText": "I did not realize that this is an inseparable set of 2 fans that cannot operate independently of each other. There is only a single USB plug. Maybe I missed that fact before purchasing but the Amazon listing does not make it obvious either.But, I was able to find a use for the set. I use one to cool my cable modem and the other to cool the router. Since they are located near each other, I can use this as a set. I am not sure how this will work out if one of the fans fail but will just cross that bridge whenever.The set of fans is well made. As mentioned, there is only one USB plug for the power source. I am using the USB jack on the router. But, there is a female USB jack built into the wiring harness for the fans that could be used to provide power to another device. I am not using that but it is a nice-to-have feature.The slide switch for the fans provides OFF, LOW, MEDIUM AND HIGH settings. On LOW, the fans are silent but do not move much air. On MEDIUM air movement is reasonable with only a slight sound. On HIGH there is a good air flow but the sound is clearly audible.This is a good product if you need a SET of fans that work as a pair. I will look for a single fan from this supplier since the fans work so well and the rubber feet make them even easier to use.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donny L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 23, 2024",
                "reviewTitle": "It's quiet, efficient, versatile, and reliable",
                "reviewText": "The AC Infinity MULTIFAN S5 has been a fantastic addition to my tech setup. This isn't just a fan, it's a solution to overheating issues that plague many electronic devices.The Quiet Dual 80mm USB Fan is a standout feature. It provides efficient cooling while maintaining a low noise level. Whether I'm gaming on my PlayStation or watching shows on my DVR, the MULTIFAN S5 ensures my devices stay cool without adding distracting noise.The UL-Certification is a testament to the product's safety and reliability. It gives me peace of mind knowing that the fan has been tested and certified by a reputable safety certification company.The fan's versatility is another major plus. It's designed for cooling various devices like Receivers, DVRs, PlayStations, Xboxes, and Computer Cabinets. This makes it a one-stop solution for all my device cooling needs.The USB connectivity offers convenience and flexibility. I can easily power the fan using any USB port, eliminating the need for a separate power adapter.The AC Infinity MULTIFAN S5 is a fantastic investment for anyone looking to enhance the longevity and performance of their electronic devices. It's quiet, efficient, versatile, and reliable. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eduardo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 29, 2023",
                "reviewTitle": "Enfriamiento",
                "reviewText": "Tengo un equipo DVR que fallaba por el calor que producía, desde que le puse los ventiladores, dejo de fallar, están prendidos día y noche. Excelente producto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 1, 2023",
                "reviewTitle": "Ventiladores muy silenciosos",
                "reviewText": "Son unos ventiladores muy silenciosos y hacen un trabajo estupendo sobre mi etapa de potencia ya que cogía una temperatura bastante elevada y a sido poner estos ventiladores y la etapa está tibia cuando trabaja. Estoy muy contento con el resultado.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S.Jose Deepak",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 21, 2023",
                "reviewTitle": "Silent cooling fan",
                "reviewText": "This fan is very good has a good build quality, looks very good and runs very quietly , performance is also good but only negative cost is very high.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Atlantis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 22, 2023",
                "reviewTitle": "Pour refroidir ma ps5",
                "reviewText": "Très efficace ! Même après plusieurs heures de jeu elle reste froide!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}