{
    "remaining_requests": 31952,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Age-of-Iron-Angus-Watson-audiobook/dp/B00NC6912M",
    "body": {
        "name": "Age of Iron",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Age-of-Iron-Angus-Watson-audiobook/dp/B00NC6912M",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61 XZwInLVL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Angus Watson",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Angus+Watson"
        },
        "brand": "Angus Watson",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1147,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Legends aren't born. They're made. Dug Sealskinner is a down-on-his-luck mercenary traveling south to join up with King Zadar's army. But he keeps rescuing the wrong people. First Spring, a child he finds scavenging on the battlefield, and then Lowa, one of Zadar's most fearsome warriors, who has vowed revenge on the king for her sister's execution. Now Dug's on the wrong side of the thousands-strong army he hoped to join - and worse, Zadar has bloodthirsty druid magic on his side. All Dug has is his war hammer, one small child, and one unpredictable, highly-trained warrior with a lust for revenge that might get them all killed.... Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "War",
                "link": "https://www.amazon.com/War-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10195"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "15 hours and 16 minutes"
            },
            {
                "name": "Author",
                "value": "Angus Watson"
            },
            {
                "name": "Narrator",
                "value": "Sean Barrett"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 05, 2014"
            },
            {
                "name": "Publisher",
                "value": "Hachette Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00NC6912M"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#54,355 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #509 in Military Fantasy (Books) #520 in Historical Fantasy (Audible Books & Originals) #772 in War & Military Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEU2S6L5BXUXXUSM7AVU4GYKEY3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24WKX7WKQ415A?ASIN=B00NC6912M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2015",
                "reviewTitle": "5.0 out of 5 stars Excellent! Masterful! Totally engaging storytelling!",
                "reviewText": "Completely exceeded and shattered my expectations! I am totally immersed in this series, thank you for renewing my faith in story telling, writing in general. Thank you for the witty exchanges. Superb, intense character building. I have been physically taken back in shock, then I begin laughing out loud, seconds later I find myself physically sweating during a fight, battle or scene so vividly described by the author. Well written, well done, well done! Thank you.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sneaky Burrito",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRC2S3IHH73QEVR4HTAS77MHNPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R300WFQFJ8DA3I?ASIN=B00NC6912M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 11, 2017",
                "reviewTitle": "4.0 out of 5 stars overall quite fun, though there is a fair amount of infodumping",
                "reviewText": "This book came highly recommended in an online forum I moderate so I figured I would check it out. It was definitely a fun book. It wasn't perfect, by any stretch, but I liked it enough to move immediately on to the next one.I have two primary criticisms. First, as I have seen mentioned elsewhere, sometimes large amounts of time are devoted to characters who end up dying in the next chapter. In one sense, these characters' scenes do serve to tell us something about the world (for example, how someone from Rome would've ended up in Britain looting corpses on battlefields). But here you are, thinking this person or that one is the next major antagonist and then bam, game over. Second, and this is probably related to the first one (I'll explain why I think so in a bit), but there is way too much exposition in the early parts of the book. I cringed a little bit when one of the main characters describes the scene in detail for a nearsighted young boy. It's just a blatant set-up for infodumping.I guess my main beef with either of these is that the author surely spent a lot of time coming up with all these scenarios and rather than just letting himself be guided as he writes by the details he's come up with, he wants to write up his notes and stick them in the story as well. Some people will be less bothered by these aspects of the story than I was -- I am just really not a fan of infodumping at all.Anyway, if you can get past that (I could), the story was a lot of fun. The protagonists, Dug, a 40ish soldier (\"Warrior\") and Lowa, a woman about 15 years his junior, are sympathetic and competent but also suitably flawed. Neither is terribly original in the scope of the overall fantasy genre (Dug had a happy life but lost his wife and daughters, while Lowa was an elite archer who ended up on her ruler's bad side for reasons she doesn't fully understand for most of the book). But Dug isn't the typical revenge-seeker (in fact, he often expresses reluctance to get involved with noble causes, preferring a life of relative ease). That definitely helps.Other \"good guy\" characters include Spring, a young girl with what seem to be mysterious powers or capabilities and Ragnall, a newly-minted Druid whose family has been slaughtered while he was away studying. Ragnall's quest would be a much more typical revenge quest except that it becomes obvious early in the book that he is not a particularly capable fighter. He does have his strengths, though. They are also sympathetic. Ragnall, especially, has some very human failings and flaws, many of which he learns about for the first time during the events of this book (in his village before leaving to train as a Druid, he was the best at everything).So anyway, the protagonists are complex, well-developed characters. (Spring maybe not so much, but she's still young.) The antagonists, for the most part, are complex (see, for example, evil King Zadar's interactions with Spring near the end of the book contrasted with what he does for the rest of the book) but still easy to root against. Overall, I thought the characters were pretty well done, despite the tropes.This is set in the years before the Romans invade Britain. Roman influences are creeping into Britain (as are some Romans). I honestly have no idea how historically accurate (or not) this book is, but I am not letting that worry me. This is fantasy, after all, and I have seen some much more incongruous elements in stories than, say, longbows in BCE years (which are touched on in the author's note at the end, by the way). If you are a stickler for historical accuracy, though, this may grate on you. It didn't bother me.Regarding language, there is some pretty salty language here, complete with compound words in which well-known four-letter words take a prominent place. I think it's appropriate for the characters and setting, but to each his or her own. It is definitely modern language but for me, at least, it doesn't take away from the story. I feel like immersion would've been broken a lot harder if I'd had to read some pseudo-archaic transliteration of purported Iron Age British accents. Overall, I thought the language worked with the other elements of the book. There was some humor here, as well, often a little bit crude but ultimately quite suited to the soldier types the book focuses on. There's some sexual content and rather a lot of violence, but both fit with the tone of the book.The book was appropriately paced. Even during the down time, it seems our good guys were just one step ahead of their pursuers, and even the extended rest periods associated with convalescence were dangerous due to the possibility of capture. Romantic signals among the adult characters were misfired, misinterpreted, etc., which led to hurt feelings. At any rate, there were conflicts on several different levels and whenever one got pushed back, something new pushed into its place. This worked for me. It wasn't \"go, go, go!\" all the time, but you sometimes got to catch a little break when you needed one.This is book one in a trilogy but it can be read as a standalone (all three volumes are out now). There is a definite endpoint in this book. (It does set up the possibility for future books set in this world, including the two sequels, but it is not a cliffhanger, which is much appreciated.In the end, I can discuss plot, character, world building, language, and other literary elements, but when it comes right down to it, I had a lot of fun reading this book.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Toddler Mom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4AWMSMDZJOMASYMNW3YMINOWXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OSMSL2VFRPX?ASIN=B00NC6912M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2019",
                "reviewTitle": "5.0 out of 5 stars Fun trilogy if you like gore and satire",
                "reviewText": "Entertaining Trilogy. The detailed amount of gore and torture is balanced by humorous slapstick and sarcasm. Terrific characters. I'm surprised this book isn't rated higher. As a bonus, there is some historical basis of this book from the author.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDIKSFRX5JXTPBFH4WEVHDENUUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D9PX3XZFN2IG?ASIN=B00NC6912M",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2014",
                "reviewTitle": "3.0 out of 5 stars The good parts outweigh the mediocre.",
                "reviewText": "Age of Iron wasn't really what I'd expected. Judging by the cover illustration and time the story is set in, I guess I was hoping for more of a noble savage Celts facing off against the unstoppable Roman legions story, like something Robert E. Howard or maybe even Joe Abercrombie would have written. But understandably, that isn't every reader's, or writer's, bag.That said, Age of Iron is still worth the read. The characters are interesting enough, although maybe not all that original, which isn't necessarily a show-stopper. I finished the book, which says a lot because usually whenever I'm on the fence with a book, I'll drop it for something else on my list -which is also why my star ratings are 4 and above or 2 and lower, loved it or hated it.Mr. Watson had a great idea. There is most definitely is a lot of uncharted territory in the Iron Age that makes fertile ground for storytelling. However, he fell short by not making Age of Iron really feel like it was a tale unique to that period in history. So it ended-up being, more or less, a standard revenge against the evil ruler tale.I think Watson’s reasoning for using modern language for the dialog was to make the characters more relatable and point out that people from this, all but forgotten, time were not much different from us today. But when I read words like “gung ho” or “schlong” it made the story too satirical and deterred from the intensity of the action.Also the flow is a little uneven. Some of the characters were too flat for me to care about, but others held up the story nicely. The book has a fairly large page count and would've held my interest better if it was a couple hundred pages shorter. I definitely enjoyed the beginning and ending better than the middle. Overall, the good about the story outweighs the mediocre, making for a fun read.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Thompson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP7HXOANYWUFHUZ462R6JUQCXQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29OI8SRHWQ0IN?ASIN=B00NC6912M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 24, 2015",
                "reviewTitle": "4.0 out of 5 stars Slow to start but a lot of High Fantasy fun...",
                "reviewText": "Age of Iron starts out slow and tedious. Too much time is spent on characters who are little more than window dressing or else destined to die in the following chapter. With so much wasted character development you might be tempted to give up before getting too far into the story.The main character, Dug, comes off as boring and unlikable at first but he's a lot of fun once he gets a chance to interact with other characters. Basically my advise is to stick with it, and if you're still not into it by a quarter of the way through then you can quit.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "teugene",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEML5W2AFTOW2E3NC7BV6QXQOV5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29NTIJ0WEC944?ASIN=B00NC6912M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2016",
                "reviewTitle": "5.0 out of 5 stars Entertaining",
                "reviewText": "An interesting, entertaining pseudo-history. The author apparently thought that those early Britons had the same foul-mouthed vocabulary as do modern people. And maybe they did, but use of the \"f\" word was excessive, in my opinion.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOSEPH VANUCCHI",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVQRG6Y5KKK2CFRWNAZKUP7X5FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZHYGSGGNQ4V0?ASIN=B00NC6912M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2015",
                "reviewTitle": "4.0 out of 5 stars Good",
                "reviewText": "Book really picked up and got good like a quarter of the way in. Like the characters and,while I know some people just don't like it, the profanity and cynicism of life that appears here makes ME more prone to like it because it's the way I'm usually always thinking. Sorry that's so garbled.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. kester",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRR5HR4V73KHZAB4FTAMP4TTEFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IUS4VPH7B5UP?ASIN=B00NC6912M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 20, 2017",
                "reviewTitle": "5.0 out of 5 stars Well worth to the read",
                "reviewText": "Entertaining with a hint of history. I enjoy a story with flawed characters doing the best they can with what they are given. Read between the lines for a little history; you won't be disappointed.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Henderson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 21, 2018",
                "reviewTitle": "An honest appraisal of the Clas of Iron book and series",
                "reviewText": "Ive been really happy with all of Gus Watson's fiction books, he has a knack for interpreting lost history that comes with his archeological background, but the imagination to fictionalize them for a fantasy series. There's also a certain sense of humour to his works. Personally I quite enjoyed this book, however I dont see Age of iron as his strongest book. There's a bit too much reliance on luck and divine provenance to make the impossible possible, but if tempered with a bit of suspension of disbelief its quite an enjoyable read. This is his first fantasy novel and the first in a trilogy series throughout which he continues to grow as a writer. Overall 3.9/5 for age of iron and 4.4/5 for the trilogy as a whole. If you enjoy this book I strongly suggest his new trilogy based around early north american viking settlements called west of west. The first book You Die When You Die is his strongest to date.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Book Surfer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 8, 2014",
                "reviewTitle": "Exciting, funny, page-turning adventure story in an unusual and imaginative setting",
                "reviewText": "Fast-paced, gripping tale of adventure. Like all good storytellers Watson brings characters and plot to the fore and it really doesn't matter where it's set. But when you pay attention to the detail, it's clear that a huge amount of research has gone into this - he just doesn't bang you over the head with it.It's not going for profound, serious historical comment - it's an adventure tale that trips along at an incredible pace. The writing is lightly humorous and self-deprecating with hints of satire. Watson knows he's making most of this stuff up about the Iron Age and just goes full on with it, unapologetically transcribing modern life to its Iron Age counterpart. But underneath bubbles social comment and possible parallels with the current world order. Again, Watson doesn't hit you over the head with it but lets you come to your own conclusions.His writing style, wit and characterisation reminded me a lot of Terry Pratchett, which I mean as a huge compliment. The writing is remarkably polished and established for a debut author and I really look forward to the second book. I'm only not sure how much more gore I can handle!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Benjamin Evans",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 15, 2015",
                "reviewTitle": "Good entertainment",
                "reviewText": "Realistically this book is a 4 1/2 stars but rounded it up because I'd hate for people to miss out on good entertainment.First off i love magic in almost any story but in this case I felt that the magic component sort of detracted from the novel and I would have preferred that the 'magic' was more in peoples heads via hearsay and propaganda. e.g. townsfolk have heard that Druids wield horrific magic but none have seen it firsthand (but know of someone that has). This premise appealed to me because thats how religions evolved throughout the ages (scared of the unknown) So people tend to fear that the enemy have mighty Druids in their army.Halfway through the book you find out a handful of druids do in fact have magic and I personally have trouble digesting that when 99% are just witch doctors with a rudimentary knowledge of berries and herbs to help fight infection or those that make sacrifices to the gods to try get a reading on the future (think modern day Tarot card readers) etc... this compounded when places like Rome and other recognisable regions are mentioned throughout the story (England during the iron age). I felt like the author really missed an opportunity to explore the magic of the mind and how 'ghost stories' can impede and impact peoples way of life in the immediate and longterm.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juno",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 13, 2017",
                "reviewTitle": "Really Enjoyed this Book",
                "reviewText": "This book was hard to put down. I liked the characters and the story line. I will be buying the next book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexander",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 3, 2018",
                "reviewTitle": "Ganz gut",
                "reviewText": "Ist Okey",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}