{
    "remaining_requests": 32204,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Garden-Life-Iron-Complex-Supplement/dp/B00280M13O",
    "body": {
        "name": "Vitamin Code Raw Iron 30ct Capsules",
        "price": "$18.99$18.99 ($0.63$0.63 / Count) $16.99$16.99 ($0.57$0.57 / Count)",
        "originalPrice": "",
        "rawPrice": 18.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Garden-Life-Iron-Complex-Supplement/dp/B00280M13O",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51p4g8jnSrS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51kXD7-8NWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Idh6iLoCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61AaNJGotVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5171YAnp8xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Jydm3rY0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61AsXS9b0tL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a9e587d3-ba55-4120-ba35-cc206a3ada42/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb331e0a-5aa0-445e-86e4-058163842843/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e0d02d37-c6f3-4be9-95ca-62234836689d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6c826b70-97aa-4183-bc36-fa8158bf4c7f/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Garden of Life Store",
            "link": "https://www.amazon.com/stores/GardenofLife/page/BDD8ECC9-D5CF-43FB-AD8A-3DF84871B4E2?ref_=ast_bln"
        },
        "brand": "GardenofLife",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 7894,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 14 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbonfree Certified determine the carbon footprint of the product, and associated carbon emissions are offset with reduction projects."
        },
        "features": [
            "BOOSTED IRON ABSORPTION: Vitamin Code RAW iron pills contain 22mg of gentle whole food iron and whole food vitamins C, B-12, and folate to support iron absorption and utilization",
            "PROBIOTICS AND ENZYMES: Our vegan iron supplement includes a RAW probiotic and enzyme blend for digestive support.Non-Constipating",
            "ENERGY SUPPLEMENT: Our iron vitamins support blood & heart health, immune health, eye health, and mental & physical energy",
            "NATURAL COFACTORS: Vitamin Code iron supplements is made from 23 RAW fruits and vegetables together with natural food cofactors",
            "VEGAN VITAMIN: Our real food iron supplement is RAW, Vegan, Gluten Free, and Dairy Free with No Binders or Fillers"
        ],
        "description": "Product Description Almost two-thirds of the body’s iron is found in hemoglobin, the protein in red blood cells that carries oxygen to cells. A necessary trace element, iron is vital for producing ATP, the body’s primary energy source and providing extra fuel to muscles during exertion. Iron is an integral part of many proteins and several enzymes in the human physiology and is essential for the regulation of cell growth. Playing an important role in the production of DNA, energy and cognitive function, iron is required for the health of the immune system. Brand Story By",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b?ie=UTF8&node=3760901"
            },
            {
                "name": "Vitamins, Minerals & Supplements",
                "link": "https://www.amazon.com/b?ie=UTF8&node=23675621011"
            },
            {
                "name": "Minerals",
                "link": "https://www.amazon.com/Mineral-Supplements/b?ie=UTF8&node=3774271"
            },
            {
                "name": "Iron",
                "link": "https://www.amazon.com/Iron-Mineral-Supplements/b?ie=UTF8&node=3774401"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 6 x 5 x 4 inches; 5.6 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ GOL-11376"
            },
            {
                "name": "Department ‏",
                "value": "‎ men, women, unisex-adult"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ April 29, 2009"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Garden of Life"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00280M13O"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,924 in Health & Household (See Top 100 in Health & Household) #15 in Iron Mineral Supplements #96 in Multivitamins #450 in Climate Pledge Friendly: Health and Household"
            },
            {
                "name": "#450 in Climate Pledge Friendly",
                "value": "Health and Household"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 7,894 ratings"
            },
            {
                "name": "Brand",
                "value": "Garden of Life"
            },
            {
                "name": "Item Form",
                "value": "Capsule"
            },
            {
                "name": "Primary Supplement Type",
                "value": "Iron"
            },
            {
                "name": "Unit Count",
                "value": "30 Count"
            },
            {
                "name": "Flavor",
                "value": "fruit"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Vitamin Code Raw Iron Vitamin Code Raw Iron is Non-GMO Project Verified, Certified Vegan and Certified Gluten Free whole food nutrition, specifically formulated with 22mg of gentle, whole food iron—and no high heat, synthetic binders or fillers, artificial flavors, sweeteners, colors or additives commonly used in tablets. Raw Iron is also blended in a base of 23 fruits and vegetables together with food cofactors plus live Probiotics and Enzymes. This product is Third-Party Certified: Non-GMO Project Verified by the Non-GMO Project (License#: 384; Issue Date: 8/15/19)NSF Certified Gluten Free by NSF (License# C0298959-GLTFHGPC-3; Issue Date: 10/6/18) Certified Vegan by Vegan Action (Issue Date: 7/20/19) Certified Star K Kosher by STAR-K (KC# U27RCXV3; Issue Date: 10/29/19)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/4d391800-9d4a-4858-b2fe-d87a64293bf1._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Why Vitamin Code Raw Iron Made with individually 'grown' nutrients utilizing probiotic cultivation to produce Raw Food-Created Nutrients, Vitamin Code supplements are delivered in a whole food base of fruits and vegetables. Vitamin Code supplements are RAW, which not only means that they are produced below 115º F, but also means that these nutrients come with their natural cofactors, along with Live Probiotics and Enzymes, just like raw foods! Vitamin Code raw powders are delivered in capsules without any binders or fillers—everything you want and nothing you don’t want. Vitamin Code Raw Iron Benefits: Contains 22mg of gentle whole food Iron and whole food Vitamins C, B-12 and Folate to support iron absorption and utilization.† Supports blood, heart, eye, immune system and reproductive health.† Is easy to digest and is stomach-friendly.† Contains live Probiotics and Enzymes for easy digestion.†",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/581cf57d-802d-423b-a411-5e6ffbd9704d._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "† These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.",
                "media_link": []
            },
            {
                "media_text": "† These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/dd645042-d56f-4e0b-8c91-f54e12e582cc._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/4d391800-9d4a-4858-b2fe-d87a64293bf1._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/581cf57d-802d-423b-a411-5e6ffbd9704d._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GIVE ReviewsGIVE Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AER6GSLY3SZPA2CDCVGR7Y2QZP7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFNEUXWOZ39Y7?ASIN=B00280M13O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2018",
                "reviewTitle": "5.0 out of 5 stars COMPARE: Iron Complex vs. Healthy Blood:",
                "reviewText": "[+] THE REVIEWI really like this product for a couple of reasons. I have heard others talk about how taking iron upsets the stomach. This product is the best product to avoid that because of the way it is manufactured by using a whole food approach (i.e., more expensive approach but better quality, more absorbable iron). Setting aside for a moment the highest quality iron this product delivers, this product has some other benefits to it. It has 500 mcg (8330% DV) of coenzymed B12 (methylcobalamin). For people suffering from low iron, one symptom can be low energy. This form of B12, again, the more expensive form, is going to help with raising energy levels. Last but not least, this product also contains 400 mcg (100% DV) of Folate (read more on this below). This might not appear to be a big thing at first glance until one understands that it is very difficult to product Folate in a supplement. I'm guessing this is a byproduct of the whole food approach in creating the iron supplement vs. something added after-the-fact. Mostly, you will only find Folic Acid in supplements - I've already searched but feel free to spend the hours I did in trying to find a Folate supplement. The Folate is a great added bonus. Put this all together and it makes this product a far superior iron product on the market. I highly recommend this product.[+] COMPARE: Iron Complex vs. Healthy Blood:Another GOL product that is very similar to this product is Garden of Life Iron Supplement - Vitamin Code Healthy Blood Raw Whole Food Vitamin, Vegan, 60 Capsules . I have included a picture of a side-by-side comparison of the two products ingredients label. I like both products. Here's a break down of both products:Iron Complex (this product)- Vitamin B12 (as Methylcobalamin) - 500 mcg 8330% DV- Vitamin C - 25 mg 40% DV- Folate - 400 mcg 100% DV (not Folic Acid)- Iron - 22 mg 120% DV- Suggested Use: Adults take 1 capsule daily. May be taken with or without food. Capsule may be opened and contents may be added to water or raw juice. Not intended for children.- Servings Per Container: 30 (30 capsules with dosage of 1 capsules per day)Healthy Blood:- Vitamin B12 (as Methylcobalamin) - 45 mcg 750% DV- Vitamin C - 60 mg 100% DV- Folate - 400 mcg 100% DV (not Folic Acid)- Iron - 28 mg 160% DV- Vitamin B6 - 60 mg 100% DV (not in other product)- Suggested Use: Adults take 2 capsules daily. May be taken with or without food. Capsules may be opened and contents may be added to water or raw juice. Not indented for children.- Servings Per Container: 30 (60 capsules with dosage of 2 capsules per day)The Healthy Blood provides 28 mg of iron in 2 capsules versus this product that provides 22 mg of iron in 1 capsule. Both products have the same high quality iron, except that the Healthy Blood provides it in 2 capsules thereby allowing me to take 1/2 a dose (i.e., 1 capsule containing 14 mg of iron) for the days in which I am eating foods higher in iron. It all depends on what your needs are. If it is easier to take one capsule per day, then the Iron Complex is a good choice. If you want to split up your dose or take half a dose, then Healthy Blood is a good choice. Depending on your needs, I highly recommend either product.[+] WHAT MAKES A GOOD IRON SUPPLEMENT?We've heard about nutrition being more \"bioavailable.\" For example, coenzymed vitamins are in a form that is ready for cells to use which makes it more bioavailable. Minerals are chelated in advance to allow them to be absorbed through the intestinal wall which makes them more bioavailable. So what makes iron more bioavailable? Well, I figured this out and the answer is small particle size. You see, I found out that a very, very small amount of iron is used within the hemoglobin structure (i.e., the red blood cell). In fact, this structure is composed of four polypeptide chains with each chain containing only 1 atom of iron meaning 4 iron atoms is all that is needed to make one red blood cell. Yep, you read that right - 4 atoms. So, knowing that, what makes iron more bioavailable is small particle size. The smaller the particle size, the more surface area that is available for \"an atom\" of iron to be pealed off the \"chuck\" of iron (in relative terms even a small particle of iron is a huge chunk when we are only talking about 1 atom). Note: a particle of iron is simply many iron atoms stuck together as opposed to a molecular structure like a B-Vitamin.This is why I believe GOL to have a superior iron supplement. Because GOL uses a whole food process, only the smaller particles of iron are picked up by the cells (in the whole food process when creating the supplement) because it makes sense that a cell can't absorb large particles. When the supplement is digested in the human GI tract, the particles of iron are at the perfect size for bioavailable consumption, which provides the largest surface area via the small particle size. Then single atoms are pealed away to be available to be used in creating red blood cells. For iron, its all about smaller particle sizes creating more surface area available to peel off single iron atoms. I also suspect the smaller iron particle size is why this product is less likely to upset the stomach because there is less left-over iron for your body to expel after single atoms are pealed away.[+] IRON ABSORPTION (8/1/2018 update)I did some research and talked to Lee, the garden of life representative. The GOL iron in this supplement is non-heme iron. This typically has an absorption rate of 2-20%; however, GOL reports that combining the iron in a whole food process increases the absorption such that it is possible to absorb the full 120%. For example, I have read that digesting Iron with Vitamin C can increase Iron absorption by 30%. Note that each person's absorption rate will vary; for example, a person with Iron deficiency will absorb more Iron than someone not deficient. Therefore, it would be virtually impossible to state the actual absorption of the product for any one individual. GOL states that they provide the constituents to maximize Iron absorption up to the 120%.[+] HEME vs. NON-MEME IRON (8/1/2018 update)Heme Iron is found in meat/animal products. This type of iron is already is already bound to a protein, which makes it easier to be absorbed by the small intestine. Because it is found in animal tissue, the iron is already broken down to a single atom (i.e., the animal that digested the non-heme iron did the work of breaking down the iron into a single atom to be used). Non-heme iron is found in plants, and is considered elemental iron. The body has the ability to regulate the absorption of non-heme iron better than heme iron; therefore, for most people, it would be safer to digest a plant based non-heme iron, which is what this product contains.I did some searching about this subject, and there is little specific information on how the non-heme iron actually gets absorbed. I suspect that it acts similar to other minerals in that it needs to bind to a substance to be pulled across the intestinal wall much like other minerals that need to be chelated to amino acids to be absorbed. The iron in this product is Ferrous Sulfate, which is ionic (meaning it needs an electron). Vitamin C has an extra electron. Normally this extra electron is pulled from the Vitamin C when it is acting as an antioxidant. However, I suspect that this extra electron binds it to the ionic Ferrous Sulfate Iron. When the Vitamin C gets absorbed, so does the iron. I suspect this is why Vitamin C increases the absorption of iron, but it's just a guess on my part.[+] FOLIC ACID vs. FOLATE:Folic acid is not found in nature; it is made synthetically. Our bodies then convert Folic Acid to Folate. I think the issue is not the product of the conversion (i.e., the conversion yields the same Folate molecule structure), but whether all of the Folic Acid IS getting converted. Because Folic Acid is synthetic, whatever does not get converted then needs to be flushed out of the body. So, there is an intake process, a conversion process, and a flushing process (of left over folic acid) all going on at the same time. If the conversion process does not keep up with the intake process and the body cannot flush the rest, then too much Folic Acid can build up in the system. There are some studies now coming out showing that a buildup of too much Folic Acid in the body can cause health issues. This is primarily why there is an upper limit for Folic Acid as noted by a government fact sheet:\"Folate that is naturally present in food is not harmful. Folic acid in supplements and fortified foods, however, should not be consumed in amounts above the upper limit, unless recommended by a health care provider\" (Source1, Can folate be harmful?).As a person focused on nutrition, I look at all the ingredients listed on my supplements. The problem is that you would be surprised at how many supplements sneak Folic Acid into their supplement. For example: I take a Methyl B-12. The 5,000 mcg formula includes Folic Acid (100% Daily Value), but the 1,000 and 10,000 mcg formulas do not. Therefore, I take the 10,000 mcg not because I need the extra 5,000 mcg, but because 1,000 is too low and I don't want the extra Folic Acid in the 5,000 mcg formula. It is surprising how many foods and supplements include Folic Acid. It is therefore not surprising that this over abundance of Folic Acid in the foods and supplements we ingest might be causing some problems as noted in some studies on the web. With Folate, there is no issue because it is a \"B\" vitamin which is water soluble (\"B\" vitamins flush very easily out of the body). Now you might then ask, why doesn't Folic Acid flush as easily. I don't know, but I would suspect that it is because Folic Acid is not a \"true\" B-vitamin (remember, it is created or synthesized in a lab and then \"converted\" into a B-vitamin). I hope this helps.[+] BLACKSTRAP MOLASSES - High in iron:For those seeking additional ways to increase iron levels, Blackstrap Molasses taken along with this product might also help. Blackstrap Molasses contains 20% iron in one tablespoon. This helps supplement the iron with more bio-available iron from a natural food source. Start out taking only a teaspoon because it can be a little overpowering (i.e., on the sweet side). After you do that for a couple of days, you should be able to increase to a tablespoon without any issues. I take one tablespoon in the morning. This is the product I would recommend: Plantation Blackstrap Molasses, Organic, 15 oz (Pack of 2) [+] FOODS THAT INHIBIT IRON ABSORPTION:Since the whole point of taking iron is to have it be absorbed into your body, I thought it would be nice to know foods that inhibit iron absorption. I checked out Live Strong and thought I would list the foods they report as being iron inhibitors:- Eggs - contains phosvitin, which binds iron together thereby preventing absorption.- Calcium-rich Foods - Does not affect absorption if less than 50 mg; 300 to 600 mg taken daily can inhibit iron absorption.- Oxalate-rich Foods - Commonly found in tea. So if you are a heavy tea drinker, do not combine with foods or supplements.- Polyphenol-rich Foods - Primarily cocoa and coffee. Cocoa can inhibit up to 90 percent, and coffee up to 60 percent.- Walnuts - contain phytates that can inhibit iron.Now take this all with a grain of salt (nope, salt doesn't inhibit iron). I personally wouldn't stop eating these foods just to get more iron absorption. I would use it more as a guideline such as if you are a heavy tea or coffee drinking then maybe not a good idea to take this supplement while drinking coffee all day long to stay awake at work. I would suggest to take this supplement right before bedtime since that is when your meal has mostly been digested (of course not with a calcium supplement). This is all just information to be used with some common sense when reviewing daily eating and supplement intake habits. It is good to note that even though these foods might prevent iron absorption, the information is not very specific meaning they don't say how much of a food is needed to impact absorption (except for the calcium). I hope this helps. It helped me since I do drink tea heavily at times.[+] HUMOR HEALS THE HEART:Okay, you have read this review and found it helpful, but you're on the fence as to whether it was helpful enough to deserve a helpful vote. To click or not to click. Decisions, decisions. Well, I've come up with a little humorous spin about myself as it pertains to my devotion in creating helpful reviews. I've done this using the style of the comedic legend Rodney Dangerfield (1921-2004) and do this also in honor and memory of his great work. The plan is to get you chuckling as you click the helpful button. Let's see - here it goes:\"I tell ya, I just don't get no respect. I started writing reviews and getting helpful votes. Wow, this is cool, I said. I checked my profile and saw that my reviewer ranking was around #8000. So, I wrote more reviews. I was so excited when I checked my reviewer ranking to see it improve to around #7000, so I put even more time into writing reviews. I must be getting helpful votes, I thought, because my reviewer ranking then shot up to #5028. Alright, I said, I rolled up my sleeves, dropped everything and put ALL my time into my reviews. Then, I checked - my reviewer ranking said - #GETALIFE. No respect I tell ya. No respect at all.\"GIVE Reviews. This is my standard for writing reviews.[G]enuine - This is a review that is honest, trustworthy with no reason other than to help people in the Amazon family.[I]nformational - This review needs to provide information related to this product in a concise matter.[V]aluable - This review needs to provide value to the reader such that it helps him or her determine if this product is for them.[E]nlightening - This review needs to go beyond product information such that the reader learns something they did not otherwise know.ps. Don't forget to up-vote if you liked this review, or you think this review will help others.",
                "reviewVotes": "1,860 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71bczVDHbsL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dez F.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUBR4Z43SWXVDZVW4YZVDKT5EYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13G52OJMK8E54?ASIN=B00280M13O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Iron-ing Out the Funny Bone",
                "reviewText": "Who knew that a tiny capsule could bring so much iron-ic amusement into my life? Enter the Vitamin Code Raw Iron Capsules, the tiniest superheroes in the world of dietary supplements. These minuscule capsules pack a punch (or should I say an iron punch?) in supporting a healthy iron intake.Let's start with the packaging. The bottle could easily be mistaken for a magician's prop, making you wonder how something so small can have such a vital role in your well-being. But don't be fooled, because these little capsules are no trickery; they mean serious business.I must warn you though, these capsules may not have the best sense of humor when it comes to taste. They have a metallic flavor that's reminiscent of licking a rusty spoon. But hey, we're not taking them for the taste, right? We're taking them for the boost in iron and the potential comedy that comes with it.Now, here's where the fun starts. When you start increasing your iron intake, your body starts producing some interesting sound effects, like the rhythmic clanging of an iron foundry. You might find yourself attracting curious gazes from your friends, family, and even your pet, wondering if you've somehow turned into a human xylophone. It's a symphony of bodily iron-ic sounds that will have you questioning whether you've accidentally joined a percussion ensemble.But rest assured, the benefits of sufficient iron intake far outweigh the temporary embarrassment of sounding like a one-person band. Increased energy levels and improved oxygen circulation will have you bouncing around with newfound vitality. Just be careful not to set off car alarms or attract any magnets during your iron-ic journey.And let's not forget the added bonus of these capsules being raw and vegetarian-friendly. Freshly picked from the iron mines of veggie land, these capsules fit right into a diet of earthy goodness. No metal animals were harmed in the making of these supplements.In conclusion, while the Vitamin Code Raw Iron Capsules may not tickle your taste buds, they certainly bring a refreshing dose of comedy to your daily routine. From the unexpected sounds emanating from your body to the funny juxtaposition of a tiny capsule providing such essential nutrients, these little iron-packed wonders will have you laughing, or at least chuckling, on your journey to optimal iron levels.Disclaimer: Remember to consult your healthcare professional before beginning any new supplement regimen. And please, no practicing your percussion skills during a job interview or your cousin's wedding.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rabkah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMXORPKZBFP7B6ZO2D5WRK2PVWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXP2Q89AJM00H?ASIN=B00280M13O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Product!",
                "reviewText": "Did the job!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amber Cook",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL6H25AAXGCC2EGANZYPOAXFCDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8QQBHNSU5X59?ASIN=B00280M13O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Started having more energy after 2 days!",
                "reviewText": "I was worried this would upset my sensitive stomach but I have had no issues.I like that I do not have to take it with food so that has made it easy for me to take if I forget in the morning. I’ve noticed I have had more energy. I am on my second week of taking it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dwele",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG477EYY47GGMQ375NC44V5BA6GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MZX36O87RMOC?ASIN=B00280M13O",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Excellent quality",
                "reviewText": "This is the best iron supplement, just a little pricey... wish they came in larger bottles than 30x. The product itself is 5 stars, other than the high cost",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ash M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHWMKLKEMCMDX6DG5NNJUPY2Y2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BZQ8HD2550B0?ASIN=B00280M13O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Great buy!",
                "reviewText": "I love these ! They never bother my stomach , I can even take on an empty stomach! Great product ! A MUST buy!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vom Haus Nemeth GSD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMN3POHZVN7SZMMGMABKB763WJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RELVU76EYZL48?ASIN=B00280M13O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars No tummy trouble here",
                "reviewText": "I went to the Dr to find out my iron is low....struggled for awhile finding one that wouldn't upset my stomach. These are perfect...no unwanted side effects period!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$19.99",
                "sellerName": "Gabbysshop2023",
                "sellerRating": "4"
            }
        ]
    }
}