{
    "remaining_requests": 32243,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BLACK-DECKER-Classic-Steam-F67E/dp/B001RJTQ8U",
    "body": {
        "name": "BLACK+DECKER The Classic Iron, F67E-T, Aluminum Soleplate, Steam or Dry Ironing, 7 Temperature Settings, Anti-Drip",
        "price": "$25.49$18.76$25.49",
        "originalPrice": "$29.99",
        "rawPrice": 25.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BLACK-DECKER-Classic-Steam-F67E/dp/B001RJTQ8U",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41UagbAa7xL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51JyzJE9 fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5154bwM7vXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kBPpeYtSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HI 9BnjDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TseHCAWnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NA1vifPTL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91DtCWireeL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/9141ApNxuLS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the BLACK+DECKER Store",
            "link": "https://www.amazon.com/stores/BLACKDECKER/page/9CD42FC6-F544-4F9F-807D-D1B33889F479?ref_=ast_bln"
        },
        "brand": "BLACKDECKER",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 11903,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 1 min",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Plastic, Metal",
            "Imported",
            "Steam or Dry Ironing - Switch on the steam setting to help iron out tough wrinkles, or turn it off when dry ironing delicate fabrics",
            "Anti-Drip - The iron is engineered to prevent dripping by closely regulating water temperatures. 7 Temperature Settings - The intuitive temperature dial and fabric guide make it easy to get the perfect heat setting based on fabric type Plus, the dedicated “OFF” button provides convenient peace of mind",
            "Automatic Shutoff - For added peace of mind, the iron shuts off when left unattended for 30 seconds on its side or soleplate, and after 8 minutes on the heel rest Plus, a power indicator light tells you when the iron is plugged in",
            "Easy Glide - The aluminum soleplate is built to last, with a smooth, nonstick finish that glides over all fabric types to quickly remove wrinkles. A special groove near the tip of the soleplate lets you navigate easily around buttons and collars.",
            "7 Temperature Settings - The intuitive temperature dial and fabric guide make it easy to get the perfect heat setting based on fabric type. Plus, the dedicated “OFF” button provides convenient peace of mind."
        ],
        "description": "BLACK+DECKER brings simplicity and style back to ironing with the Classic Steam Iron. Families have relied on this iron design for generations, and while the look is retro, the features are modern to give you fast, effective garment care. The handy fabric guide printed right on the iron makes it simple to select the proper setting for each garment. The durable aluminum soleplate glides smoothly over all types of fabrics to smooth out wrinkles in no time. Plus, you can switch on the steam to help iron away tough creases and wrinkles, or turn off steam to dry iron delicate fabrics such as silk. A long history of dependable performance makes BLACK+DECKER the trusted name in clothes irons.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Irons",
                "link": "https://www.amazon.com/irons/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510242"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "BLACK+DECKER"
            },
            {
                "name": "Special Feature",
                "value": "Auto Shut Off"
            },
            {
                "name": "Color",
                "value": "F67e-t"
            },
            {
                "name": "Product Dimensions",
                "value": "16.3\"L x 6.6\"W"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Wrinkles"
            },
            {
                "name": "Model Name",
                "value": "F67E-T"
            },
            {
                "name": "Year",
                "value": "2009"
            },
            {
                "name": "Base Material",
                "value": "Aluminum"
            },
            {
                "name": "Frequency",
                "value": "50 Hz"
            },
            {
                "name": "Item Weight",
                "value": "3.2 pounds"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Black+Decker"
            },
            {
                "name": "ASIN",
                "value": "B001RJTQ8U"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "F67E-T"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 11,903 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,081 in Home & Kitchen (See Top 100 in Home & Kitchen) #13 in Irons"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Fabric Type",
                "value": "Plastic, Metal"
            },
            {
                "name": "Finish types",
                "value": "black"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "2-year limited warranty."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Iron"
            },
            {
                "name": "Import",
                "value": "Imported"
            },
            {
                "name": "Wattage 1100 watts",
                "value": "Style Classic"
            },
            {
                "name": "Item Weight 3.2 Pounds",
                "value": "Voltage 120 Volts"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT655BC372NCF4XA4GVXOCQ2GIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10SKL9ZGE11KN?ASIN=B001RJTQ8U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome!!!",
                "reviewText": "simply amazing, I loved it, it's fast, it's not very heavy, just as I expected.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cynthia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHBWJZCAW7LTC5KH6XKQHXQDXEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JQWMYZM8W7VS?ASIN=B001RJTQ8U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2011",
                "reviewTitle": "5.0 out of 5 stars Finally. An iron that acts and looks like an iron.",
                "reviewText": "I want you to know I saved all the ironing this week for the arrival of this iron. This is one of the most inexpensive irons offered here at Amazon. It's also better than the others. After one overpriced T-Fal and one even more overpriced Rowenta, I am convinced that 1) some things are better left unchanged and 2) One should never fix that which is not broken. Therefore, I have returned to my ironing roots. This is like the iron I grew up using. This is the type of iron that never let me down. Not fussy. Not awkward. The right size. Not built like it belongs on a spaceship. And most of all........Not made entirely of cheap plastic.I can honestly say I am sorry I wasted my money on the expensive irons because none of them handled, ironed or made me feel as comfortable as Ye Old Black and Decker The-Way-It-Was-And-The-Way-It-Should-Stay Steam Iron.It does what an iron is supposed to do and, if placed on its heel (the way I learned how to iron), it doesn't shut off on you 15 times while you are trying to iron a batch of clothing and want to stop and do something else for a minute. If given the choice, I would really revert back to the old days when irons didn't have an automatic shutoff at all. I mean, if you are that ditzy that you can't remember to turn the iron off, well I honestly don't know what to tell you. I'm sure our lawmakers, instead of doing something useful, made some kind of law about irons automatically shutting off so that the person using it can be tortured. This iron does have an auto shutoff, and it's very fast and annoying if you put the soleplate directly on the ironing board, which is an invitation to scortching something. However, if rested on its heel, you have 8 minutes. This is enough time to adjust things or answer the phone without returning to an iron that's not hot enough.I agree with other comments that this is also a heavy iron. Correct me if I am wrong, but aren't irons SUPPOSED to be heavy enough to press out wrinkles? A heavy iron means you don't have to push and do the work when pressing seams or things like jeans. And if you are a cat owner, you understand when I say that I know for a fact that, sooner or later, your 20-pound cat Rodney is going to knock that iron right off the board. Okay, I mean MY 20-pound cat Rodney. At least with this iron and its steel base, you won't be sweeping up a heap of plastic pieces if it hits the floor -- and chances are good it will still do the job, just like the old days. I don't know this for certain. Yet. But heck, it's a lot less painful paying $19 bucks for another iron than it is buying another useless plastic oversized Rowenta.Listen, I would prefer not to iron at all, but barring that possibility, at least now I own an iron that does what it is supposed to do without spitting, sputtering and switching itself off every time I walk to the closet to get another hanger.Get this iron, learn to rest it on its heel, and put yourself out of your ironing misery. And save yourself some bucks besides.",
                "reviewVotes": "741 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacqueline Anglin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRQ347SZA24EBPEP44TXI5WVENA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROEAI4L9LV7F2?ASIN=B001RJTQ8U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Buy it-sewer approved",
                "reviewText": "This thing is awesome lol it’s so heavy, sturdy and works very well with the perfect cord length. I sew a lot and use it exclusively for that and it’s been working so well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MLouise",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5DNQDOECET275AXEM5VAQOVHYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FZ9TJD6KU77T?ASIN=B001RJTQ8U",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2013",
                "reviewTitle": "4.0 out of 5 stars Catches on Fabric, but Great Otherwise",
                "reviewText": "I don't iron my clothes, I got this specifically for quilting & pressing seams, etc.When I first joined my quilt guild, the more experienced members stressed the importance of 'pressing' vs. 'ironing'. Which basically means you do not drag the iron, you lift, place, press, then lift, place press, etc so you don't distort the fabric and mess up the block proportions.Although I have gone through three irons in the past 4 or 5 years, I never had any trouble with any of them dragging or catching on the fabric. With this iron however, it is EXTREMELY prone to catching. If I don't lift the iron way up off the fabric before I move it, it will do a Major catch on the fabric and it will kindof make accordion pleats/distortions that have to be re-pressed like crazy to fix them. And once I put it down on the fabric to press, I can not move it at ALL. Not even a little tiny shimmy, or it catches. It is especially noticeable of course, on fabric edges and seams.I'm not saying it's completely the iron's fault, it may be my technique. But I never had this problem with any other iron (whether mine or another guild member's) over the past several years. And my blocks have always been pretty darn accurate with my pressing techniques. So if you're a quilter and you think you're pretty good at 'pressing' vs. 'dragging', I'd say try this iron to see how good you really are! I don't know if it's the weight of the iron, the shape of the sole plate, or the holes that make it catch. Nonetheless this is my only working iron right now so I am adapting.Everything else about the iron I love. It is not huge, in fact it is probably a little bit on the small side, yet it feels solid and well built. It is heavier than my past three irons that were bigger, but it is not really too heavy. The steam function takes quite awhile to start working. You have to flip up the red button for steam, then it takes a good couple of minutes to really start steaming. Then if you push the red button back down it still steams somewhat, but not enough to be a problem. Basically, it seems that it takes the iron awhile to realize when it is supposed to steam and not steam. That being said, the water seems to last a long time, it doesn't waste steam while sitting upright, and it has only sputtered once. It gets nice and hot and gets my seams nice and flat.After going through my share of irons, I was contemplating a more expensive iron this time. A couple of the more expensive irons had a lot of great reviews, but the negative reviews were usually in agreement, which means there can be issues no matter what iron you get. So I chose this one based on a 'majority' of good reviews, the simple old fashion design (less features to go whacky), and the really good price. Even though I'm having the issue of it catching on fabric, I'd still buy it again. I'm learning to be Extra careful!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEB4P4RSKA62CCOI53UA2QBEV6CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JXXFKCGW0JR9?ASIN=B001RJTQ8U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Good Classic Iron",
                "reviewText": "Smooth operation, knocks wrinkles out quickly. Classic look and feel. Just slow fill when adding water and drain water when done. It’s heavier than most irons, so be cautious when it’s on edge of board.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JHL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOMUDXFEIBH5Q3XMH356ACLJHWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGQU7SLA3ZMLH?ASIN=B001RJTQ8U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Like My Mom's Old Reliable Iron",
                "reviewText": "This is a great iron for the $. Works just fine and it doesn't spit water all over the place.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alecia.Walls",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJ7SZKN6ELSULKVPCXGUMXVN5FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y9DYSXCIAGJP?ASIN=B001RJTQ8U",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Definitely the best iron I've ever used",
                "reviewText": "This is a fantastic iron. It heats up fast and produces a lot of steam. It's also super sturdy unlike a lot of the cheap plastic irons I've used before.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rosarii",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 29, 2023",
                "reviewTitle": "plancha",
                "reviewText": "excelente producto realmente es muy buena plancha",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Olga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 30, 2023",
                "reviewTitle": "Perfect choice for fabric work in small businesses",
                "reviewText": "I usually don't write reviews, but I couldn't resist sharing my experience with this exceptional product. It is the ideal choice for anyone involved in a fabric-related small business. The weight of this iron is precisely what makes it so well-suited for ironing heavy fabrics. I'm delighted to have come across this iron; it has become my top choice for tasks like ironing drapery, applying fusible batting, and various other fabric-related needs.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeffery AllbrightonJeffery Allbrighton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 8, 2023",
                "reviewTitle": "This item does not come with an English plug and doesn't work with an adaptor",
                "reviewText": "It looks lovely, but I can't use it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61u7pTyGtqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adolfo M. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 4, 2023",
                "reviewTitle": "Se ve muy bien!",
                "reviewText": "Robusta, buen peso y buenos materiales, esperemos que sea tan durable como las de antaño.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 7, 2022",
                "reviewTitle": "GTREAT IRON.",
                "reviewText": "It work great,and it's the best of the best. Just BUY ONE. You will not be sorry.Macey",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}