{
    "remaining_requests": 32224,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rowenta-Focus-Steam-Garment-Standard/dp/B08DZJX8L1",
    "body": {
        "name": "Rowenta Focus Stainless Steel Soleplate Steam Iron for Clothes Standard 400 Microsteam Holes, Powerful steam blast, Leakproof, Lighweight, 1725 Watts Portable, Ironing, Garment Steamer, Blue DW5280",
        "price": "$79.99",
        "originalPrice": "$79.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rowenta-Focus-Steam-Garment-Standard/dp/B08DZJX8L1",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418RHnlSfUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51S5qdt2wlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DnCt2RPpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JXVjFyHXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mxb EVaEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Jh7BJ399L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aUBVUP5HL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Rowenta Store",
            "link": "https://www.amazon.com/stores/Rowenta/page/38DEDA67-5202-4947-9CD6-8ED09735BCDE?ref_=ast_bln"
        },
        "brand": "Rowenta",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 8688,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 15 hrs 58 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 22 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Powerful steam: with up to 135g/min boost and 35g/min continuous output.",
            "Exceptional coverage: with over 400 active holes for the best steam distribution.",
            "Variable steam settings: to suit different fabrics and ironing needs like Cotton/Wool/Poly/Silk/Linen/Nylon.",
            "Durability features: self-cleaning and anti-calc system to ensure optimal performance over time and to extend the life of the iron.",
            "Safe and precise ironing: auto-off function for safety, anti-drip feature and precision tip for ultimate convenience. It is recommended that you use a soft damp cloth on the warm soleplate, in order not to damage the surface. Warning: The use of iron cleaner will cause damage to your soleplate's autoclean coating."
        ],
        "description": "New innovative design meets powerful performance in the Rowenta Focus DW5280. The new 1725-watt German-made iron features a premium soleplate, delivering a new standard in glide and scratch-resistance for excellent results. The carefully designed shape and steam holes provide even steam coverage for easy crease removal with just one pass. The soleplate’s pointed tip includes concentrated micro steam holes for targeted steam when reaching into tight spots like between buttons, over collars, and along seams. The Rowenta Focus iron now features a water-tank window, providing 100% visibility to how much water is in the tank. The Rowenta steam iron adjusts the steam output automatically to match the soleplate temperature (steam can also be turned off for dry ironing). Use the “burst of steam” function to remove extra-stubborn wrinkles and vertical steam for dropping wrinkles away from drapes and hanging garments. The upgraded Rowenta Focus iron makes it easy to achieve professional-looking results from the comfort of home. Patent US n°7,305,780.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Irons",
                "link": "https://www.amazon.com/irons/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510242"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Rowenta"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Color",
                "value": "Blue"
            },
            {
                "name": "Product Dimensions",
                "value": "11.78\"L x 5.46\"W"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Steam Iron"
            },
            {
                "name": "Model Name",
                "value": "Focus"
            },
            {
                "name": "Base Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Item Weight",
                "value": "3.22 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Rowenta"
            },
            {
                "name": "ASIN",
                "value": "B08DZJX8L1"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "14501165847"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 8,688 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,824 in Home & Kitchen (See Top 100 in Home & Kitchen) #17 in Irons"
            },
            {
                "name": "Finish types",
                "value": "stainless_steel"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "1 Year Limited Warranty"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Wattage 1725 watts",
                "value": "Style 1725-Watts"
            },
            {
                "name": "Item Weight 3.22 Pounds",
                "value": "Voltage 110 Volts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "POWERFUL STEAM Impressive steam boost up to 135 g/minute for stubborn creases and thick fabrics, with a continuous steam output up to 35 g/min for efficient ironing COMFORTABLE IRONING Enhanced ergonomics and advanced design produce a handle with a high-comfort grip in the hand VERSATILE DESIGN Easy vertical steaming function for delicate and large garments, as well getting creases out of suits and other hanging garments, even curtains",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/80da0c1d-87d1-4029-b173-6a924ab82bd8.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cc96df6c-b8e7-4cb9-95f2-7bcb58e39542.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cfd220ed-0c22-4cea-b08e-be233e3e378f.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "PRECISE, SCRATCH RESISTANT IRONING Stainless steel soleplate ensures resistance to scratches. Precision Tip is perfect to hard-to-reach areas around buttons and collars. CONVENIENT REFILLS Transparent water tank window for easy and precise water level adjustment. ANTI-DRIP & ECO TECHNOLOGY The anti-drip feature prevents water stains on the fabric, even when ironing at low temperatures. The Eco mode requires up to 20% less energy.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ae8979cd-4f4c-4bb2-a137-ff66b8cd5db8.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8e4c0b48-4ba5-4e58-9ffd-d9fb3df81d70.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/37ec2a87-b92e-473b-9fb3-154c1f4555e2.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/88c4959e-7e04-42d7-8b55-21991dd4899b.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5110dae4-98b5-4c9e-963d-237fb21aa300.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/80da0c1d-87d1-4029-b173-6a924ab82bd8.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cc96df6c-b8e7-4cb9-95f2-7bcb58e39542.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cfd220ed-0c22-4cea-b08e-be233e3e378f.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ae8979cd-4f4c-4bb2-a137-ff66b8cd5db8.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8e4c0b48-4ba5-4e58-9ffd-d9fb3df81d70.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/37ec2a87-b92e-473b-9fb3-154c1f4555e2.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9ed07bae-7097-4cab-acbc-a1a1ae697a57.__CR0,0,1940,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JAB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEMUI5GRQ4DV73ROPP23CT32NDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CTYJ7ZC6PNYM?ASIN=B08DZJX8L1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2022",
                "reviewTitle": "5.0 out of 5 stars Irons and steams well; seems like it should last. Read the instructions fully.",
                "reviewText": "This review is for the 1725 watt iron, without the cordreel, in the blue and white color, and it was purchased in November 2022. Overall, it's fine, but be aware of the following things: the different steam settings, having some common sense, the poorly-described self-clean \"function\", and the sole plate.The iron is simple to use: fill it with water, plug it in, set the temperature, and wait for it to heat. Once it's ready (i.e., the pilot light goes off), set the desired steam level, and start ironing. You've got three options for steam: off, \"Eco\", and max, and the switch has four positions.If you've got it set to steam, but nothing comes out, press the steam button. That'll clear out whatever might be clogging the holes in the plate. Then try ironing.Now for the steam switch: the first two are positions are basically off, and no steam will come out. The 'Eco' setting only kicks in at the third 'click' of the switch, and takes a second for steam to come out once the iron is horizontal and moving. The fourth position (all the way to the right) is max steam, which is exactly what it sounds like: a lot of steam for as long as the iron can sustain, before it needs to heat up again.Once the pilot light turns back on, don't press your luck, or else you might get water dribbling out toward the end of the cycle; set the iron upright and wait. Also, don't expect a lot of steam (or any at all) to come out at lower temperatures: expecting that just doesn't make sense. If you want to iron at low temperatures, and need moisture, use the built-in spray function before pressing your clothes.A lot of the \"water leaks out!!\" reviews probably don't realize that yes, if you've got the steam switch wide open, there's a valve that will let water through, and yes, that water (in liquid form) will dribble out of the sole plate because they've got a low temperature selected.About the self-clean \"function\": it's not a function, or a dial setting, or anything like that at all. It's a sequence of things you do, and the procedure is described toward the end of the manual.Lastly, the sole plate isn't smooth-shiny like my old Rowenta. I assume the new one is stainless steel just like the old one, but the new one has a matte and slightly textured surface that drags ever so slightly. It's not a big deal, but if you're expecting a mirror finish on the sole plate, this iron isn't it.The actual ironing performance: it works fine and gets the wrinkles out. For heavy and deep creases, no iron alone will solve that problem.Summary: The iron works well if you have some common sense about when to expect steam at high versus low temperatures, and exercise awareness with the steam switch; the self-cleaning function isn't really a function at all, but just a series of steps; and the sole plate has a slight texture. I iron at least once a week, so if this iron doesn't last, I'll update the review.May 2022 update: It's still working fine. If it doesn't start steaming right away after the iron is back in the horizontal position (and the steam switch is in the third or fourth position), I'll hit the \"steam burst\" button. Also, if you haven't ironed in a while, hit the button anyway but do it over a rag or towel so you don't spew mineral crud over what you actually want to iron.October 2023 update: Still going strong after weekly use. With semi-regular maintenance (the cleaning feature) and using the steam burst function to blow out any mineral build-up, this thing is working great. Looks like it's currently $80 which is a huge amount cheaper than what I bought it. Like Leonard from Community, I rate this a \"buy\".",
                "reviewVotes": "202 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "markjay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTDKKD2JLLKWBMQ3JPGUHA5JCWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK7UI3EHVOVWW?ASIN=B08DZJX8L1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Superb quality. Replaced two Chinese brand steam irons that didn't last.",
                "reviewText": "Superb quality. Replaced two Chinese brand steam irons that didn't last. Worth the higher cost as compared with Chinese brands. The steam function is very strong, such that I must refill the iron after ironing five shirts. The result is that the clothes look much more professionally ironed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RTMan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBYW2VTAAZSUF2IYVTJXDST32FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KOSNIEFDZYIB?ASIN=B08DZJX8L1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 24, 2022",
                "reviewTitle": "4.0 out of 5 stars Good iron but problems for big hands and heavy for small.",
                "reviewText": "This is a high quality, well-made iron, but after using there are some issues: 1) A big hand can accidentally depress the Spray button during use, causing a \"leak\" that isn't really a leak. This happens often for me and is very annoying. 2) Another big hand problem is the temperature dial can easily be moved during use because there is not enough space between it and the handle for big hands and the dial moves too freely when touched by the knuckles. It moves often as I use it and must be reset frequently, which is also annoying. Suggestions for the designers: 1) The long slope of the Steam and Spray buttons may look sleek and cool, but they take away valuable grip space on the handle for big hands. Consider pulling that slope back 1/4-3/8\" to help eliminate accidental activation. 2) For the Temperature Dial, if you could make it smaller (reduced diameter), lower the profile by thinning it or recessing it by at least 1/8\" and make it harder to rotate, that would reduce accidental setting changes during use.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joy M. Bernhardt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE26P473ME7IEJCTNXE36N62RLEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U36U3NJEGE9J?ASIN=B08DZJX8L1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2023",
                "reviewTitle": "5.0 out of 5 stars So far, I LOVE this iron!",
                "reviewText": "I have had at least 4 -- maybe more -- of the Rowenta Steam Station. I had the purple ones for many years. They would wear out and leak all over the place, and I would get a new one. I ordered the \"new\" version of the supposedly same iron. It was AWFUL!!! It is not the same at all. Very poor quality. You could feel it. The iron kept rolling over on its side if I barely touched it. It leaked badly. The steam handle would stay stuck and not turn off. THEREFORE, I ordered this Focus iron for $60. WAY cheaper. Just tried it for the first time today, and I liked it immediately! I think it is pretty. It steams great and holds quite a bit of water. It is heavy, but that is actually kind of nice. You do not have to press down on it. I will update this review if any issues happen over time. I just ordered two more of them to keep for future use in case Rowenta decides to cheapen this version too.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer in Florida",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIHZ7XV4OOOWMPXHR6VKHMHKBIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16PNH58CTG0BF?ASIN=B08DZJX8L1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Does what an iron is supposed to do",
                "reviewText": "This iron is heavy and hot, just like an iron should be. It makes a lot of real steam (not just aerosolized water) and works like an old-fashioned all-metal iron. This thing is NOT A TOY! It is a dangerous weapon in the war against wrinkles! It is hard to iron in the \"pick up and drop\" manner of cheap light-weight plastic irons, but once I learned to use a \"tip over and glide\" pressing technique, this Rowenta made ironing an easy, if not pleasurable, chore. It whipped through creased and wrinkled linens and cottons, got into corners, ruffles etc, beautifully, and glided smoothly on rayon and silk. The temperature control gets rather vague in the synthetics range, the only time I thought the temp was a bit too cool. But who irons polyester doubleknit anyway? I even tried it on a t-shirt and it did great! I'm now ironing my pillowcases...somebody stop me!",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Excelente artículo y económico. Sufro por el tiempo de espera pero valió la pena",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 28, 2023",
                "reviewTitle": "Calidad",
                "reviewText": "Excelente producto. Ya lo he recomendado. Vale la pena el precio extra contra la competencia.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anita",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 28, 2023",
                "reviewTitle": "it is a nice iron",
                "reviewText": "The iron is quite heavy but it presses well The cord should be a bit longer",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 12, 2023",
                "reviewTitle": "Muy recomendable",
                "reviewText": "Me gustó casi todo de esta plancha. La temperatura a la que calienta, la cantidad de vapor que saca, el peso (que es importante para un mejor planchado), el atomizado del agua que abarca buena área y es fino; la suela de la plancha se desliza muy bien sobre la ropa y la punta hace que pueda planchar en áreas estrechas. El único \"pero\" que tengo, es que los botones del spray y el vapor se aprietan sin querer a la hora de estar planchando porque están muy cerca del mango. Aún así la recomiendo sin duda.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SUSAN BERRIDGE",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 2, 2023",
                "reviewTitle": "Heavy and Sturdy.",
                "reviewText": "Excellent weight, steam settings. Irons clothes quickly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "churchi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 15, 2023",
                "reviewTitle": "Good solid iton",
                "reviewText": "I enjoy ironing. This iron doesn’t get in the way of my enjoyment. It is powerful, heats up quickly and has a nice large sole plate that glides easily. If there is any Con it would be that it is a bit heavier than my last iron but even that doesn’t detract from it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}