{
    "remaining_requests": 32021,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/IRON-Redwyn-Chronicles-Book-1-ebook/dp/B0B29LH7CZ",
    "body": {
        "name": "IRON: A Christian Fantasy Fairy Tale Retelling (The Redwyn Chronicles Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/IRON-Redwyn-Chronicles-Book-1-ebook/dp/B0B29LH7CZ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71RFQdYPnsL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Madisyn Carlin",
            "link": "https://www.amazon.com/Madisyn-Carlin/e/B09LSH27TT/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 26,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Kindle-eBooks/b?ie=UTF8&node=158280011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B29LH7CZ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Maplebrook Publishing (September 30, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 30, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5761 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 406 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1957847018"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#321,394 in Kindle Store (See Top 100 in Kindle Store) #161 in Religious Science Fiction & Fantasy (Books) #206 in Christian Fantasy (Kindle Store) #393 in Christian Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 26 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Saraina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3SMTU4ZV23JBTWO7ZRYGEZSLCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SJ2IP1H92MK1?ASIN=B0B29LH7CZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2022",
                "reviewTitle": "5.0 out of 5 stars I teared up, I got chills, I wheezed in laughter… this book has it all.",
                "reviewText": "When I finished reading IRON (yesterday at the time of this review), I just wanted to reread it ALL OVER AGAIN. What an absolutely captivating, amazing story this was!!! I can’t wait to ramble on to my heart’s content about it, so let’s dive right in, starting with one of my favorite parts of IRON, the characters!CharactersI LOVE how Red is so fierce, blunt, assertive, and bold (truly a spitfire young detective!), but she’s also vulnerable and emotional, really a little girl at heart who longs to be unconditionally loved. I think everyone can find themselves relating to how she never feels enough, how she feels like a stain, like she’ll never fit in, never be good enough. Poor darling Red. hugs her Her spiritual arc was soooo good!!! Not only was it beautiful for the truths Red learned, but on the more technical side, it flowed naturally and didn’t feel forced at all.Chamonix is so sweet and elegant, more ladylike than Red but with a certain stubborn, determined mettle of her own. I related with her a lot. And her poor lungs! I don’t often see character health problems like that in books, so it was interesting to see, and unique. It provided an unique aspect to the conflict involving her. Dear Char… she just wants to help. She’s so brave, in a gentle way. Oh, and not to mention, her name is lovely! (So is Redwyn!)And I’ve got to say, Red and Char’s interactions are gold. They’re not afraid to be blunt with each other, in their own ways, Char sometimes catching onto Red’s sarcasm. And I laughed so hard at the reminiscing of the hilarious baby skunk escapade. As Carter says, “I could never aspire to such levels of sass and sarcasm. That area is Red’s expertise. Not mine.” No, but he’s blunt and adorable for it.And speaking of Carter… I absolutely LOVE him! He is SO sweet!!! And Red was right when speaking teasingly to Char about him: he IS cute, no question about it. The perfect friend for Red! Like I was saying, he’s rather adorably blunt, yet in spite of his propensity for saying what he thinks, he’s not the type to stand up for himself at the cost of hurting others. He’s cautious, quiet. Char’s so right – he wasn’t sent to rescue, but to protect. That just melted me because it’s so true. There was a gentle strength to him that drew me in, and he never came across as wimpy, despite Red considering him a coward for not giving as good as he got from the evil Draymond and Antony. His problem of trust was heartbreaking, how he thinks no one is worthy of trust, not even the Beginning. That made his spiritual arc so satisfying, so impactful!Some other characters I grew to love were Uncle Calvin and Aunt Isadora – such good parent figures! ❤ And Denton… even though I felt like I had to dislike him initially… I finally let myself like him. A lot. *grins* (And I briefly considered shipping him with *coughs* someone but nah, I don’t know if she would take so kindly to that. *winks* But who knows? *laughs to myself*) And Halda! The dear lady was so wise and imparted so much sage advice. Red needed her! And the character-I-shall-not-name-because-of-spoilers really sneaked his way into my heart. Redemption arcs always get me.The wolfmen confused me at first as to whether they were actually wolves or men or a combination of both, but eventually I realized they were just men. (The fault is most likely on my end for that; I was reading quickly and probably failed to pay attention to that part.) But, like Halda said, they really are nice young men. 😀Wow, this character section is long, but bear with me, as it’s always my favorite part of reviews! 😀 I just have to mention the villains. GUYS. These villains were no joke. Draymond and Antony and the whole lot of them. Oh my goodness, I hate them. And I have to say, I “liked” how the bad guys weren’t brainless and easily defeated. They were truly scary because they knew what they were doing, and they did pure, straight-up evil.Romance“Romantic love, she was finding out, was more than the giddiness and swooning. It was deep, abiding. Steadfast and loyal.” YES! And Carlin perfectly showed that through the love story in IRON! The romance was so sweet, pure, tender. I love how its foundation is built merely on good solid conversation, on getting to know each other, and just showing they care. And THE MEET CUTE! I laughed each time they… bumped into each other. I ship them so hard. I’ll admit, I’m usually disappointed if there’s not an “actual” kiss at least at the very end, but this was a rare case where the cheek/forehead kisses were perfectly enough to satisfy. And I mean that! The romance wasn’t the focus of the story, but it was definitely one of my favorite aspects about it.And those who haven’t read this won’t get this yet, but I could NOT STOP LAUGHING at *that* part when Carter thinks he’ll die at the hands of King Calvin. Priceless.Writing Style*chef’s kiss* The writing style fit IRON so beautifully! Lovely choice of words, vivid, striking a good balance between flowery and simple. It’s not necessarily an easy read with very simple writing I could breeze through with distractions going on around me – I had to concentrate, but that’s not a bad thing. Plus, it’s so easy to get yourself swept away in the story. The style felt elegant and sophisticated in a way that I think added to the world of the characters (because that’s how most of them talked). I loved it. And Madi nailed each person’s character voice. She has a subtle, sophisticated sarcasm that makes me crack up, with hilarious exaggerations! 😀WorldbuildingI thought the worldbuilding was so well done; how each city/town/country has a distinct feature and reputation. And how Madisyn created unique phrases drawing from the culture she’d formed, too – that added such a level of realism to it! And the unique geography made the setting come alive for me!PlotThe Cinderella retelling really came apparent in the middle half of the book, which I actually loved. Because of the brilliant twist on the original tale, it came across as rather subtle, but I believe most readers will quickly see the fairytale retelling aspect of it. The reason I didn’t quickly pick up on how the story related to the original Cinderella tale was because Carter, not a girl, acted as the Cinderella of the story. Apparently my brain was slow to put two and two together. *smh*BUT THOSE CRAZY PLOT TWISTS. I CAN’T EVEN. Seriously, I was shocked many a time at the turn of events that took place. The climax practically kept my eyes glued to the screen as I read. It was SOOOO suspenseful and fast-paced and just ahhh!!! Incredible. Such a rollercoaster ride!!!ThemesSuch beautiful spiritual content, full of solid Biblical truths! I was encouraged, uplifted, strengthened, inspired – especially through how the characters eventually come to terms with their fears and struggles. I don’t know if it’s necessarily called an allegory, but the Beginning, the Scripts – that whole spiritual aspect was really well done.The human trafficking content in this was handled very well. Honestly, it felt darker than it would have had there not been things like that going on in the world today. Something about it felt so real, so dark, so scary. And it needed to be that way! But anyway, that made the theme of how God allows evil to happen, but still holds us the whole way through those trials, so impactful. The author did a marvelous job.OverallI teared up, I got chills, I wheezed in laughter… this book has it all. I greatly look forward to reading more from Madisyn Carlin, along with daydreaming about the characters and concocting Red-worthy things to say. 😀 Go do yourself a favor and read it!FAVORITE QUOTES_“No royal decree will ever stop evil.”_“Your fire is returning,” Halda said softly.Heat crawled up Red’s cheeks. “I apologize for making a scene.”“Never apologize for crying, dear child. We are given tears for a reason. I merely mean it is good having you back to your normal self.”_“The Beginning allows us to walk through the fire, but He is forever holding our hand through that fire.”_“Red, honey, you’ve been trying to walk through the fire using your own strength. We’re not meant to do that. You will fall and fail every time. The Beginning…He will never let you go. When you reach the bottom, He’s still there. Even when everything feels hopeless, take courage hope will always prevail because He is in control.”_Protection was preferable to obeying etiquette, and though Carter was chained and battered, he possessed a protector’s spirit. He’d do everything he could to safeguard them._“There are many types of bravery and courage. Some are bolder, like Redwyn, and other are more subtle, like yourself. Neither type is more important and both are equally vital. One type rallies troops. The other touches individual hearts.”_Romantic love, she was finding out, was more than the giddiness and swooning. It was deep, abiding. Steadfast and loyal.Disclosure: I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.R.S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFO4FLKUUL5TBKTFUNEKOJNUPOBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7N82XXXNOR98?ASIN=B0B29LH7CZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 5, 2023",
                "reviewTitle": "4.0 out of 5 stars A unique retelling",
                "reviewText": "First and foremost, this is a Cinderella retelling. I adore fairytales and I especially am curious when authors put their unique spin on them. This was an interesting one and it is the first in a series.I do not know if there are other books that involve this series that were written previously or not, but all of these characters had pretty well-established backstories. Some of the past is unraveled as we find out secrets and revelations along with the characters. Red is a complicated character along with her friends and family. And I was not sure who were the traditional characters in the Cinderella story. This story was surrounded by mystery and a lot of unknowns along with characters searching for where they fit in their world.There was also a lot of kidnapping of children, which I did think that not many of the townspeople or nobles were that concerned about, in the beginning only Red seemed to care.This is a fantasy that puts me more in the mind of a medieval story. There is no magic and I really appreciated the author's take on Cinderella.I was provided a copy of this novel from the author. I was not required to post a positive review and all views and opinions are my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alena",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETXWX2BMUR6GWKET4OGCSSPYPGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NDSQGK18FSN9?ASIN=B0B29LH7CZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Be Prepared for a Near-Heart Attack",
                "reviewText": "Wow! Why did I decide to read this during my busiest week of the month? The suspense nearly killed me before I could get back to the book. I agonized. I had multiple heart attacks. I lost sleep. It was that great of a book.The characters were absolutely fantastic. Carter and Chamonix were perfect for each other and I sat on the edge of my seat, thrilled as they came together.Cinderella has always been my favorite fairytale, and I loved how Madisyn worked little details into the story that hearkened back to the fairytale, but also gave the story a new twist. It was also refreshing to read a fairytale without the insta-love that tends to dominate a lot of the old tales. The romance in Iron had plenty of time for a slow bloom (and it was super sweet, so that's an added plus!). The masquerade balls were a nice touch on the fairytale.And all the fight scenes! I have slight obsession with good fights, and I don't often find an author who can play them out realistically. Not a problem with Iron.And lastly, I loved the faith threaded through Iron. It was wonderful, written clearly and unapologetically.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rose Q. Addams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVM7G6XI4X7RQ5MPGJOQRENWMNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S0WFAES9LEDR?ASIN=B0B29LH7CZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Good NA Book!",
                "reviewText": "I had heard good things about this book.I was not disappointed. This is one of my new favorites.Clear points of fairytale retelling, clear faith-based elements that are obvious, but not tacked uselessly onto the plot, nor is the book a sermon pastiche-d as a story. It is a good book that points to the Author of all good stories and, while walking in darkness, does not befriend or lessen the effects of it. Nor does it weigh heavily on your heart and make you despair in the end.I loved all three viewpoint characters... OMIGOODNESS I LOVE THEM!!!*ahem*This book does include dark things. Human trafficking, for instance. And other things are hinted at as well... but the language was clean, the romance was clean, the faith was astoundingly woven in with clear struggles shown and overcome... EEEEEEEEEEEE I loved it. :)(and, as an aside, I don't like \"preachy\" books. The author's page says that if you dislike them, then you should avoid her books... I think she was wrong. I hate when quality of plot and/or characters is sacrificed to shoehorn in a message, even if it's a good one, and I could not put this down. I stayed up WAAAY later than I usually do in order to finish this one. She made it all work elegantly together.)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}