{
    "remaining_requests": 32233,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/CHI-13101-Steam-Soleplate-Professional/dp/B071RRKXYT",
    "body": {
        "name": "CHI Steam Iron for Clothes with 300+ Holes for Powerful Steaming, Temperature Guide Dial, 1700 Watts, XL 10’ Cord, 3-Way Auto Shutoff, Titanium Infused Ceramic Soleplate, Silver",
        "price": "$59.99",
        "originalPrice": "$59.99",
        "rawPrice": 59.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/CHI-13101-Steam-Soleplate-Professional/dp/B071RRKXYT",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CCYBGZMJ"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41iB7QcQT9L._SS36_.jpg"
            },
            {
                "asin": "B071RRKXYT",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41myknX1QUL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41myknX1QUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41LzomZo5uL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51m4CHfn92L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hkrIVGsTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HYiovIVDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yQXctEjeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YQyMqQ8EL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: CHI Steam",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=CHI+Steam"
        },
        "brand": "CHI Steam",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3974,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 10 hrs 45 mins",
            "FREE delivery Tuesday, February 20. Order within 23 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Made With Chi Flat IRON Technology. Designed Using the Same Titanium-Infused Ceramic Soleplate Technology That Powers Chi’s Hair Styling Tools, Including the Flagship Chi g2 Flat IRON",
            "Powerful Steam for Effortless Ironing. With Over 300 Steam Holes, This IRON Delivers Powerful Steam That Makes the Process of Steaming out Wrinkles Smooth and Fast",
            "Fabric Guide. Choose Your Fabric Type and the IRON Sets the Temperature Accordingly, Eliminating the Guesswork",
            "Precise Control. a Unique, Adjustable Steam Lever Goes From No Steam to Full Power With Just a Quick Slide. and the Sleek Handle With Textured Grip Gives You Complete Control and Comfort",
            "Premium Materials With Modern Style. the Titanium-Infused Ceramic Soleplate Is Ultra-Strong and Scratch-Resistant. Matte Chrome Accents and a Sleek Design Give This IRON a Polished Look"
        ],
        "description": "Powerful steam, precise temperature, professional results. Whether your definition of a polished look is a well-pressed suit, a smooth silk dress or a wrinkle-free shirt for work, you can achieve it with the CHI professional clothing iron. Like our haircare tools, this iron is designed to give you the high-performance power of the pros at home. Engineered with a titanium-infused ceramic soleplate similar to our popular CHI flat irons, the professional clothing iron is durable enough to withstand scratches, heats up quickly and provides an extra-smooth glide. Ironing is simpler than ever with a temperature dial that includes a fabric guide, adjustable steam control and an easy to grasp, comfortable handle. With over 300 steam holes, you can smooth out the toughest of wrinkles effortlessly.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b?ie=UTF8&node=510240"
            },
            {
                "name": "Irons",
                "link": "https://www.amazon.com/irons/b?ie=UTF8&node=510242"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "CHI Steam"
            },
            {
                "name": "Special Feature",
                "value": "Made With Chi Flat IRON Technology. Designed Using the Same Titanium-Infused Ceramic Soleplate Technology That Powers Chi’s Hair Styling Tools, Including the Flagship Chi g2 Flat IRON . Powerful Steam for Effortless Ironing. With Over 300 Steam Holes, This IRON Delivers Powerful Steam That Makes the Process of Steaming out Wrinkles Smooth and Fast . See more"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Product Dimensions",
                "value": "11.5\"L x 4.7\"W"
            },
            {
                "name": "Model Name",
                "value": "CHI Steam Iron for Clothes with 300+ Holes for Powerful"
            },
            {
                "name": "Item Weight",
                "value": "2.9 pounds"
            },
            {
                "name": "Base Material",
                "value": "Ceramic"
            },
            {
                "name": "Frequency",
                "value": "50 Hz"
            },
            {
                "name": "Manufacturer",
                "value": "CHI Steam"
            },
            {
                "name": "ASIN",
                "value": "B071RRKXYT"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "13101"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,974 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,502 in Home & Kitchen (See Top 100 in Home & Kitchen) #28 in Irons"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Finish types",
                "value": "Plastic housing"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "Not applicable."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "CHI Iron"
            },
            {
                "name": "Wattage 1700 watts",
                "value": "Style Adjustable Temp, Silver"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "CHI Flat Iron Technology Engineered with a titanium-infused ceramic soleplate similar to our popular CHI flat irons, the Professional Clothing Iron is durable enough to withstand scratches, heats up quickly and provides an extra-smooth glide.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8de2fa47-9642-4fda-b536-5dd47c282624.__CR0,240,1500,464_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "From hair to wear From the world-renowned brand that has innovated the haircare industry for over 30 years, comes a high-performance line of irons and steamers for all the fabrics of your home and wardrobe. Engineered with CHI flat iron technology, and designed for the modern home, these products deliver the precise results you can only expect from CHI. Whether you want to create a flawless look from head to toe, or have a perfectly-pressed outfit for your workday, it’s now easier than ever to achieve with CHI. CHI Professional Clothing Iron Powerful steam, precise temperature, professional results Whether your definition of a polished look is a well-pressed suit, a smooth silk dress or a wrinkle-free shirt for work, you can achieve it with the CHI Professional Clothing Iron. Like our haircare tools, this iron is designed to give you the high-performance power of the pros at home. Ironing is simpler than ever with a temperature dial that includes a fabric guide, adjustable steam control and an easy to grasp, comfortable handle. CHI flat iron technology Titanium-infused scratch resistant ceramic soleplate Over 300 steam holes for superior performance 10' cord Unique adjustable steam control",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/5715f406-fad8-4e89-8241-71ae0620b665._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/aa8b5d9d-d69d-486c-9233-28778a4ed7f8._SR230,100_.png"
                ]
            },
            {
                "media_text": "Features: Powerful Steam With over 300 steam holes, this iron delivers powerful steam that makes the process of steaming out wrinkles smooth and fast. Precise Control The temperature control dial lets you choose your fabric type and sets the temperature accordingly, eliminating the guesswork. A unique, adjustable steam lever goes from no steam to full power with just a quick slide. And the sleek handle with textured grip gives you complete control and comfort. Modern Style with Premium Materials The titanium-infused ceramic soleplate is ultra-strong and scratch-resistant. Matte chrome accents and a sleek design give this iron a polished look.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6d0c718b-dbda-411a-b665-2d09625448d1.__CR0,0,1800,1800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4636e66f-4f7f-47c3-8812-8957ec48658e.__CR0,0,1800,1800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4b595b86-8720-462d-a880-613d4ea9e499.__CR0,0,1800,1800_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "CHI Professional Clothing Iron CHI Professional Clothing Iron - Gold CHI 2-in-1 Steam Iron and Vertical Garment Steamer with Targeted SteamShot CHI Steam Iron with Electronic Temperature Control CHI 1700 Watt Lava Iron with Lava-Infused Ceramic Soleplate Titanium-Infused Ceramic Soleplate ✓ ✓ ✓ ✓ Wattage 1700 1700 1200 1700 1700 Soleplate Size Large Large Medium Large Large 3-Way Auto Shutoff ✓ ✓ ✓ ✓ Adjustable Steam ✓ ✓ ✓ ✓ ✓ Spray ✓ ✓ ✓ ✓ ✓ Blast ✓ ✓ ✓ ✓ Self Clean ✓ ✓ ✓ ✓ Other Garment Steam Lever Electronic Temperature Volcanic Lava Soleplate",
                "media_link": []
            },
            {
                "media_text": "CHI Retractable Cord Iron CHI Retractable Cord Iron - Gold CHI Retractable Cord Iron - Electronic Temperature Control Titanium-Infused Ceramic Soleplate ✓ ✓ ✓ Wattage 1700 1700 1700 Soleplate Size XL XL XL 3-Way Auto Shutoff ✓ ✓ ✓ Retractable Cord ✓ ✓ ✓ Adjustable Steam ✓ ✓ ✓ Spray ✓ ✓ ✓ Blast ✓ ✓ ✓ Self Clean ✓ ✓ ✓ Other Electronic Temperature",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/8de2fa47-9642-4fda-b536-5dd47c282624.__CR0,240,1500,464_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5715f406-fad8-4e89-8241-71ae0620b665._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/aa8b5d9d-d69d-486c-9233-28778a4ed7f8._SR230,100_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6d0c718b-dbda-411a-b665-2d09625448d1.__CR0,0,1800,1800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4636e66f-4f7f-47c3-8812-8957ec48658e.__CR0,0,1800,1800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4b595b86-8720-462d-a880-613d4ea9e499.__CR0,0,1800,1800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/770ff2a4-d4f0-4f69-ab51-f4f54a732e0b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cbe54c05-f0b4-41aa-8003-92757eb03d76.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7bf73185-ade5-4b5e-991e-16f72828d080.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/00a38319-c7b4-484b-b3c8-6db839090762.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a5e47e1d-7361-4326-8b2d-e596ff90d239.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/332169ab-a201-484f-94a2-e7a1934fd1fa.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ff0b581e-5114-414a-a572-dc1f339f85ff.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/afb3af3f-0156-4d8c-a393-4eb4486e1772.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "H. StevensH. Stevens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEPBDI2EERWAXKOFUMUYFCIWGUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWYXPSEQMA5RI?ASIN=B071RRKXYT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 6, 2021",
                "reviewTitle": "5.0 out of 5 stars Great Dressmaker or Quilter's Iron",
                "reviewText": "I don't know if I am a certified customer, but I DID buy this iron from Amazon long ago.This is one seriously good buy that I have made. My mother thought I was nuts to spend this much on a steam iron, but this one really does what it is supposed to do and does it well. Now that I have it, I am really glad.My previous iron would turn off after a few minutes, leaving me constantly frustrated waiting for it to reheat after a quick trip to the sewing machine. This iron will stay hot. I do not know exactly how long, but after about one half hour or so it does beep to remind you that is still on. If you leave it turned on and facedown, it will beep after a few minutes.This iron really brings the heat, and it brings the steam as well, making short work out of yards of wrinkled cotton duck canvas, yet it has a delicate touch when turned to the \"synthetic\" or \"silk\" settings. This is a relatively heavy iron, so it does the work for you, not leaving you to push it into the fabric trying to get the effect you want.There are several accessories that you'll want to have in addition to the iron. One is a delicate teapot or a small funnel for getting water into the steam tank opening. The steam tank holds a good bit of water, but it will overflow if you put too much in. No harm done; you just have some water to mop up. The tank holds about 300 mL, or a little over a cup. Be ready to refill often if you are using the steam setting.Another item you will want to have is an iron cleaning kit. This is an awesome iron, and it does not get sticky easily, but it is a fact of life that all irons will encounter gunk eventually, particularly if you are working with starch. I use a kit made by Rowenta, and it has held out for years. It has a tube of cleaning compound, a rag for applying it to the iron's sole, and a last rag for polishing the sole of the iron when you are done cleaning. When you get the kit, read the directions for more specific details.The last tool I find handy is a hair mister. You will find one listed as a beauty product. It sprays a very fine mist on the fabric you are working on and you can control the density of the mist by the distance that you hold the tool. There is a sprayer mounted on the iron, but the spray it puts out is anemic and difficult to place where you need the water. So do yourself a favor and pick up a hairspray out from the beauty department. I have two of them!Please watch your left hand if you are right-handed. I was holding some fabric down with my left hand while I was ironing, and by accident I tipped the iron in the direction of my left hand. The burn I inflicted on my left index finger was something to behold. The day after the burn, it blistered to the point where the blister popped. At that point I kept it under a Band-Aid for a number of days until the burn healed enough to do without a Band-Aid. I almost nailed my thumb a little while later, but I put ice on it right away and I must not have gotten that much steam on it because it only hurt a little bit for a few days. Forgive me if this is too much information, but you really need to know. If you are left-handed, keep an eye on your right hand. While I am on the topic of hands, I might as well mention that this iron is ambidextrous. You may use it equally with either hand.If you are serious about your sewing, get this iron. If you are just starting out and you have the money, get this iron. If you have kids around, maybe get a different iron, one that turns off right away when you leave it. This includes most irons. If you are just starting out and you do not get this iron, eventually you might want to upgrade. I'm just saying.",
                "reviewVotes": "84 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/919T6jQ0gML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91MYghwLVmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91uXpMP5veL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fred Field",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUHPOYQZQW3TSK4SULGSNWMQ6YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22LF0SYBESUL4?ASIN=B071RRKXYT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Abundance of steam",
                "reviewText": "This is a first time purchase of this iron, and I've been using it for over 2 months. I am very pleased in several ways. It is lightweight, but for me, the perfect size and the pointed end is just right. The dials are easy to use and the iron very easily goes from no steam to as much as you need, and the best news is...NO LEAKING or SPITTING. This is a big feature for me. It heats up very quickly and stays on for more than 30 min. It makes an audible sound when it's heated and also when it times out. At that point the red light starts to blink. I previously owned a Reliable and it was fantastic till it wore out. But it's pricey so I decided to try a different brand. I am well pleased. I do a lot of sewing, quilting, and therefore, ironing. I hope my review is convincing.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bigB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPJ5RW3XLDQL4CTU2KRPQ5NGV7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPTQMYJ21XR5Y?ASIN=B071RRKXYT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great. Glides beautifully",
                "reviewText": "This does the job I wanted. The plate glides perfectly on all types of fabric. So smooth. Great product!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "benblb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQLHNODY7WK5IN5HSNLSMQEOWJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QK37EU6Q88PT?ASIN=B071RRKXYT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great!",
                "reviewText": "Disclaimer: I'm not a super experienced ironer, most of the ironing I've done is at hotels with their poor-quality provided irons.No complaints at all with this iron. It glides super smoothly and the steam function works amazingly well! It steams when set flat, and stops when the iron is set on its heel. I'm amazed by this since the cheaper irons I've used don't seem to do this properly.It's decently quiet when the steaming stops, but like other irons there is a (in this case small) burst of noise when the iron is set down.The I do also appreciate the aesthetics of this iron. I'd recommend it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathy Kaldal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3HJ363MBLOEKWJLPKJEKCEUF6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM7Y4985FOEIP?ASIN=B071RRKXYT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "4.0 out of 5 stars No auto-off!",
                "reviewText": "In general this iron is good. It puts out plenty of heat and steam without dripping. The sole plate is very smooth and it has plenty of heat settings.BUT, the description says it will turn off automatically if left standing for 30 minutes or on its sole plate or side for 60 seconds. I’ve tested those scenarios and it’s never shut off. I don’t know if I got a lemon or if it doesn’t actually have that feature.All in all I’d recommend it IF you always remember to turn off your iron and unplug it when you’re finished using it!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOAGUJEAG6TDSOBLC6A4KZOBZVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A8NIY6GI5N0V?ASIN=B071RRKXYT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Can you love an iron?",
                "reviewText": "This iron is great. After spending several hundred dollars on a professional Oliso iron, which broke when it fell on the floor and can't be fixed, I got this one because a friend said she loves her Chi iron. Now I love mine too. I got the less expensive one with the temperature dial. It has great steam when needed. Easy to fill with tap water--no need for distilled water. Love the point in the front for clothes construction and quilt piecing. Love that it has the auto-off but not until 30 minutes. A Rowenta I had once sounded like a truck backing up to warn me of the auto off going off and scared the bejeebeezs out of me. This Chi just quietly does it thing. Love it and would highly recommend.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan Farley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBIV37LEJLHQWM3MHIXUWEVGBEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AHRJ72MPQJGB?ASIN=B071RRKXYT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Great iron",
                "reviewText": "Easy to use, works perfectly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BelindaF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAJRM5RJKSG7KMUQJ43IV4CEMJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OVTNOQK4883M?ASIN=B071RRKXYT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Finally got a iron that works well",
                "reviewText": "It’s light weight. Iron silks, cotton and linen material very very well. Love it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 4, 2024",
                "reviewTitle": "Lots of steam",
                "reviewText": "Replaced my 25 year old Philips iron with this one. It is heavier but works very well. Tip of iron is not pointed but rounded so does not get into narrow areas very well. Looked for another iron with a more pointed tip, but this is the style for the current models.Lots of steam. Heats in a couple of minutes. Shuts off automatically after being idle for 30 minutes.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 15, 2023",
                "reviewTitle": "Not suitable for uk as plus us USA",
                "reviewText": "Ordered didn’t realise sent from USA so plug not compatible A waste of time and money - the seller didn’t realise about the plug until I asked Such a shame as it has good reviews",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Geezer06",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2024",
                "reviewTitle": "Good iron",
                "reviewText": "Although it takes a little while to heat, the sole is evenly heated and the steam volume is excellent. I read the instructions and use the Self-Clean function after every use. Nice long cord. Sole seems to be slippery so that it glides over the fabric nicely. It has an odd weight distribution -- you need to consciously focus on the front quarter of the iron; not a problem, but a change from my old T-Fal job. I'm sure I'll get used to that. This is a keeper -- good iron!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julien Poirier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 17, 2023",
                "reviewTitle": "Good choice, but doesn't feel as sturdy as it looks",
                "reviewText": "Heats up quickly and works well, but feels less sturdy than expected. The water tank door looks and feels flimsy, and so do the buttons. The steam dial shifts every time your hand brushes against it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JoJo53",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 27, 2023",
                "reviewTitle": "Great product",
                "reviewText": "This iron works great, lightweight and easy to use, My only detractor from a 5* is that it is a bit pricy when you can buy other irons for much less money - so I'll see how long it lasts for the price I paid for it - as I do a great deal of ironing (I'm a sewing enthusiast).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}