{
    "remaining_requests": 32247,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rowenta-DW2459-Retractable-Stainless-Soleplate/dp/B083JXZJMJ",
    "body": {
        "name": "Rowenta Access Stainless Steel Soleplate Steam Iron with Retractable Cord 1725 Watts Powerful Steam Diffusion, Auto-off, Anti-Drip 1725 Watts Portable, Ironing, Garment Steamer DW2459, Black",
        "price": "$59.99",
        "originalPrice": "$59.99",
        "rawPrice": 59.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rowenta-DW2459-Retractable-Stainless-Soleplate/dp/B083JXZJMJ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTVG9YY8"
        ],
        "asinVariationValues": [
            {
                "asin": "B07SH1PKC3",
                "variationName": "Style",
                "variationValue": "1700 Watts & Lightweight",
                "price": "$35.00",
                "variationImageURL": ""
            },
            {
                "asin": "B083JXZJMJ",
                "variationName": "Style",
                "variationValue": "1725 Watts & Cord Reel",
                "price": "$59.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07YFFNM92",
                "variationName": "Style",
                "variationValue": "1725 Watts & One Temp",
                "price": "$49.95",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41H4vB ZeyL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41PhEdYS4fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41t3TmUwXXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411eY57GPiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yGKO3EjrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417URmcmuFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513dSa119YL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Rowenta Store",
            "link": "https://www.amazon.com/stores/Rowenta/page/38DEDA67-5202-4947-9CD6-8ED09735BCDE?ref_=ast_bln"
        },
        "brand": "Rowenta",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 11957,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 14 hrs 2 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Ultimate steam diffusion: over 350 micro-holes that provide powerful steam diffusion for efficient and easy ironing.",
            "Durable and high-quality: made with high-quality stainless steel and exceptional engineering, this iron delivers long-lasting performance day after day.",
            "Retractable cord: easy and safe usage and storage.",
            "Safety features: auto-off feature ensures added safety by shutting off the iron when left unattended. Use it in the most delicate fabrics like Cotton/Wool/Poly/Silk/Linen/Nylon.",
            "Comfortable and convenient: a sleek modern design, easy-to-use controls, and a comfort handle, this iron makes ironing a breeze."
        ],
        "description": "With maximum steam distribution and high-quality engineering that's built to last, the Rowenta Accesteam Cordreel steam iron was designed for easier garment care, with the cordreel system offering effortless storage options. The stainless steel soleplate comes equipped with advanced Microsteam technology, providing ultimate steam coverage with over 350 micro-holes and 1725 Watts of power, for maximum efficiency and exceptional glide. High-quality stainless steel soleplate and a durable design ensure long-lasting performance, with enough steam power to tackle even the most stubborn creases. A variety of advanced features—including easy refills; vertical steaming of suits, delicates, or even curtains; a precision tip for hard-to-reach areas, and more—come together for a dependable and long-lasting steam iron package.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b?ie=UTF8&node=510240"
            },
            {
                "name": "Irons",
                "link": "https://www.amazon.com/irons/b?ie=UTF8&node=510242"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Rowenta"
            },
            {
                "name": "Special Feature",
                "value": "Retractable Cord"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "13.69\"L x 6.45\"W"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Steam Iron"
            },
            {
                "name": "Model Name",
                "value": "DW2459"
            },
            {
                "name": "Base Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Voltage",
                "value": "110 Volts"
            },
            {
                "name": "Item Weight",
                "value": "3.87 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Rowenta"
            },
            {
                "name": "ASIN",
                "value": "B083JXZJMJ"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "DW2459"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 11,957 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,372 in Home & Kitchen (See Top 100 in Home & Kitchen) #4 in Irons"
            },
            {
                "name": "Finish types",
                "value": "stainless_steel"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Iron"
            },
            {
                "name": "Wattage 1725 watts",
                "value": "Style 1725 Watts & Cord Reel"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "DW2459 Access Steam Cordreel Steam Iron DW3261 Smart Steam Iron DW5080 Focus Steam Iron DW6080 Eco-Intelligence Iron DW8080 ProMaster Steam Iron DW9280 Steam Force Steam Iron Steam Holes 350 Holes 380 Holes 400 Holes 400 Holes 400 Holes 400 Holes Wattage 1725 Watts 1725 Watts 1700 Watts 1700 Watts 1700 Watts 1800 Watts Water Tank 8.5 oz. 8.5 oz. 10 oz. 10 oz. 12.7 oz. 11.8 oz. Stainless Steel Soleplate ✓ ✓ ✓ ✓ ✓ ✓ Uses Tap Water ✓ ✓ ✓ ✓ ✓ ✓ Auto-Off ✓ ✓ ✓ ✓ ✓ ✓ Anti-Calcium ✓ ✓ ✓ ✓ ✓ ✓ Other Features Retractable Cord No Temperature Setting Needed Eco-Mode that uses 25% less energy LED Temperature Display",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/9061c761-9fd2-4e02-b36a-15695672c0c3.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/22d8a7f5-f1d4-4bde-96d1-e21f0570f5ae.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cd1bc5e7-297e-4bf1-8329-46e3817be4f9.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/138870da-ac06-4129-9fb8-b2a609e3ce7c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d5e64ba3-7c76-40c0-9a97-ed6d98e576c8.__CR430,0,846,1692_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/aa19a8fb-75b4-42d5-8a97-21279ffd2aeb.__CR409,0,840,1680_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2b555904-08e7-4e21-a9f2-a79a02793b6a.__CR497,78,783,1565_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/370c737e-da5e-42d6-84b5-c041e090ee3d.__CR357,0,719,1437_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ece6e158-36dd-4492-933e-39e518f4e4c5.__CR394,0,816,1633_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3c34a687-6432-42d2-b720-ad7cf047cd3a.__CR486,0,825,1650_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFRGLSZKHQPZV4CCDODHY4ABTRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HRRLJ1HN9TWU?ASIN=B083JXZJMJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Yes I still iron cloths",
                "reviewText": "I love the iron; however, I was frustrated when I first used it. It leaked water all over my shirt, and it is supposed to be leak free. Also, it is very difficult to change the temperatures because that knob is under the handle, and you cannot see the temperature writings very well. If it continues to leak, I will return this item.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNYAEPRVNZGT4UFEHETIHZTGCLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FO8AAUVEC7ZC?ASIN=B083JXZJMJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Effortless Ironing Made Possible with this Exceptional Iron",
                "reviewText": "I recently upgraded my old iron to a new model that has completely transformed my ironing experience. This iron has proven to be a game-changer, making the once tedious task of ironing a breeze. With its exceptional performance and innovative features, it has become an indispensable tool in my daily routine.First and foremost, this iron's ironing performance is simply outstanding. It effortlessly glides over fabrics, smoothing out wrinkles with ease. The powerful steam output, combined with the precise temperature control, ensures optimal results on a wide range of fabrics, from delicate silk to sturdy cotton. Whether I'm ironing a dress shirt, a pair of jeans, or a delicate blouse, this iron delivers impeccable results every time, leaving my garments looking crisp and professionally pressed.One of the standout features of this iron is its quick heat-up time. Within seconds of turning it on, it reaches the desired temperature, saving me valuable time and allowing me to start ironing right away. The ability to switch between different temperature settings with just a touch of a button is incredibly convenient, ensuring that each fabric receives the ideal amount of heat without the risk of damage.The steam function of this iron deserves special praise. The continuous steam output efficiently removes stubborn wrinkles, even from thick fabrics, making the ironing process more efficient. Additionally, the vertical steaming feature comes in handy when I need to quickly refresh hanging garments or eliminate wrinkles from curtains and drapes. It's a versatile tool that adds convenience to my ironing routine.Another aspect that I appreciate about this iron is its ergonomic design. The comfortable grip and lightweight construction make it easy to maneuver, reducing the strain on my hand and arm during extended ironing sessions. The well-designed soleplate effortlessly glides over fabrics, preventing any snagging or sticking, ensuring a smooth and hassle-free ironing experience.Furthermore, the self-cleaning and anti-drip features of this iron are highly practical. The self-cleaning function helps maintain the iron's performance by flushing out mineral deposits, ensuring consistent steam output. The anti-drip feature prevents water leaks and stains, allowing me to confidently iron even the most delicate garments without worrying about water spots.In conclusion, this iron has exceeded my expectations in every aspect. Its exceptional ironing performance, quick heat-up time, powerful steam function, ergonomic design, and practical features make it a standout choice for anyone in need of a reliable and efficient iron. With this iron, ironing has become a hassle-free task, leaving me with perfectly pressed garments and more time to enjoy the things I love.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SLB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4ENTGLIUKTXBCMXJF6WX3M5KFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23XIBA9D9FIZK?ASIN=B083JXZJMJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars Not the Rowenta of the past",
                "reviewText": "I had a Rowenta iron I bought 20 years ago. Last year it finally -- finally! -- began leaking. So I decided to go with another Rowenta.First, quality of materials. Maybe the body is stainless, but the buttons are not. There's a somewhat cheap feeling to it other than the weight.Second, the temperature button is difficult to see because it is behind the handle. Who thought that was a good idea?Third, this thing steamed out mineral flakes for two entire tanks of water. Even with the third, one showed up now and then. I recommend you iron unimportant things on the wrong side until your third tank of water. Then you can begin ironing more valuable clothing, but still the wrong side.Fourth, it does put out tons of steam. While the vertical position will throw off a lot of steam, a lot of steam, I found I still had to use so much that I was better off just putting the clothes on the ironing board and doing it that way.Fifth, it doesn't spit a lot, but it does spit occasionally. So be careful with things that mark, such as silks.Sixth, it's heavy, and it's bulky because of the cord storage in it. But the cord storage is worth it.All in all, I'm disappointed in Rowenta and expected the quality I was familiar with. It's probably better than your more common brand, but the quality of everything seems to have gone down.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Loew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBL52DLJQ3FCHV4RMQQSADZ3KWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OLJQ52HS2GNE?ASIN=B083JXZJMJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2022",
                "reviewTitle": "5.0 out of 5 stars So far so good",
                "reviewText": "I love Rowenta and prior to this new purchase, i owned the same Rowenta iron for 10-12 years before it just stopped working suddenly a few weeks ago. So after much research on irons I selected this Rowenta and am very happy with it so far. I've only used it a few times but it did a great job on my initial usage. The reviews helped a great deal and I will say that the reviewers who complained how difficult it was to gauge water levels were absolutely right. I was concerned about that, but it seems most irons have this problem unfortunately. Seems like such an obvious thing for Rowenta and other brands to realize and design accordingly. It was very easy to see with my last Rowenta iron but all other aspects of the iron are great so you learn to just deal with how to fill the tank. I liked the ease of filling the tank on my old iron much better too. this one, you have to lay the iron flat and pour water into opening which is most awkward to do without spilling. Again, it's not enough of a reason to not buy the iron, but it is a negative. when you turn the iron on, there is an orange light and when it's reached the proper heat, the light goes off and you're ready to iron. Steaming was great...so far it did not drip water or do anything of concern but it does sort of sputter steam after ironing and placing iron upright. it's not an issue, but something to be aware of. I haven't used it on anything vertical yet, but plan to use it on a dressing table skirt and drapes and hoping it works as they say. I'll update this review when I do. I was worried about the heaviness of these irons. I bought another Rowenta model and had to return it as it was huge and way too heavy for me. This iron is a bit heavier than my old one but not too heavy and ironing was very easy and pleasant.",
                "reviewVotes": "68 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RickyRicky",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 24, 2023",
                "reviewTitle": "Great replacement iron for basic usage",
                "reviewText": "Bought this as a replacement for an older Philips Iron that was purchased many years back. The pump for the steam and spray stopped working so it was due for an upgrade. This neat iron has many steam holes on it and pointed under plate which make it super easy to use. The functions are simple and easy to use. No issues so far with this iron and it works perfectly for basic ironing. I do wish that the water compartment was bigger or didn't run out as quickly but that could be something I am doing wrong. Otherwise for the price point you cannot go wrong with this!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71h3CddDfmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61oPU1vM+oL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Wnnlx+YRL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos E. Sandoval",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 19, 2023",
                "reviewTitle": "Gran calidad",
                "reviewText": "Rowenta siempre es sinónimo de calidad. La plancha funciona perfecto y no quema la ropa a pesar de que la señora la uitlice como se le de la gana.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "angel manuel cristerna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 9, 2023",
                "reviewTitle": "Excelente, buen artículo",
                "reviewText": "Muy buen artículo, la mejor marca en planchas sin duda",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deir M Dominguez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 4, 2023",
                "reviewTitle": "Plancha rapidísimo",
                "reviewText": "Súper buena, excelente golpe de vapor, plancha en una pasada y la temperatura es perfecta para todas las prendas.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Newby",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 3, 2023",
                "reviewTitle": "Excellent product",
                "reviewText": "Works very well, just as other reviewers have said. It's really nice not having to fuss around with fabric-specific settings and thus far this iron has worked well on everything we've thrown at it.Other reviewers have complained about the darkness of the water tank and how difficult it is to see how much water is in there -- it's true, it's very difficult to see how much water has been added and I'm surprised this obvious \"design defect\" made it into the final product. However, per the instructions, you're supposed to empty the iron after each use -- we have a little container that holds just the right amount of water for the tank, so it's easy for us to judge how much we've added, so not a deal stopper at all IMHO.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}