{
    "remaining_requests": 31947,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rowenta-DM-273-Powerglide-Auto-Off-Feature/dp/B000050FZZ",
    "body": {
        "name": "Rowenta DM-273 Powerglide 2 Iron with Auto-Off Feature",
        "price": "$49.99",
        "originalPrice": "",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rowenta-DM-273-Powerglide-Auto-Off-Feature/dp/B000050FZZ",
        "soldBy": {
            "sellerID": "A1L4ULQRDW25PY",
            "name": "MODealSwap",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1L4ULQRDW25PY"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "In stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ZY9644X6L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41MKH87WPVL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Rowenta Store",
            "link": "https://www.amazon.com/stores/Rowenta/page/38DEDA67-5202-4947-9CD6-8ED09735BCDE?ref_=ast_bln"
        },
        "brand": "Rowenta",
        "merchantInfo": "MODealSwap",
        "customerReview": "3.1 out of 5 stars",
        "customerReviewCount": 35,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$7.64 delivery February 22 - 23.",
            "Or fastest delivery February 16 - 22."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Polished stainless-steel, dimpled soleplate provides smooth glide",
            "Shuts off in 30 seconds if left horizontal or tipped, 8 minutes if left vertical",
            "7.4-ounce self-cleaning water tank",
            "Multiple steam settings include vertical steam, misting spray, and steam burst",
            "Center-mounted pivoting cord prevents tangles"
        ],
        "description": "Product Description Burst of Steam produces a powerful burst for effective wrinkle removal from difficult fabrics. 3-way automatic shut-off, switches iron off in 8 minutes if left vertical, 30 seconds if left horizontal or 30 seconds if tipped over. Airglide soleplate glides effortlessly, heats quickly and evenly. Amazon.com From its smooth-gliding, dimpled, polished stainless-steel soleplate to its big 7.4-ounce transparent water tank, this iron is loaded with useful features. It delivers 1,400 watts of power, shuts off in 30 seconds if left horizontal or tipped over and in 8 minutes if left vertical, and has a self-cleaning button to flush out mineral buildup. For removing wrinkles in curtains and hanging garments, the iron can deliver vertical steam. It also has multiple steam settings and top-mounted buttons for a misting spray and a steam burst. The center-mounted pivoting cord prevents tangles and wraps around the iron's base for storage. This iron carries a one-year warranty against defects. --Fred Brack",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b?ie=UTF8&node=510240"
            },
            {
                "name": "Irons",
                "link": "https://www.amazon.com/irons/b?ie=UTF8&node=510242"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Rowenta"
            },
            {
                "name": "Special Feature",
                "value": "self-cleaning"
            },
            {
                "name": "Color",
                "value": "white"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Vertical Steam"
            },
            {
                "name": "Base Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "11.4 x 6.5 x 5.4 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.56 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Rowenta"
            },
            {
                "name": "ASIN",
                "value": "B000050FZZ"
            },
            {
                "name": "Item model number",
                "value": "DM-273"
            },
            {
                "name": "Customer Reviews",
                "value": "3.1 3.1 out of 5 stars 35 ratings 3.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,680,677 in Home & Kitchen (See Top 100 in Home & Kitchen) #503 in Irons"
            },
            {
                "name": "Warranty Description",
                "value": "1 year limited."
            },
            {
                "name": "Import",
                "value": "Imported"
            },
            {
                "name": "Style Classic",
                "value": "Item Weight 2.56 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Reviewer Dr. Beth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIJLAW3HIOMRUFSWNH54IJ3XQAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS7DV0RZ6EB4N?ASIN=B000050FZZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2003",
                "reviewTitle": "4.0 out of 5 stars A very good, powerful iron.",
                "reviewText": "Since I'd been using the same iron for many years, I chose this Rowenta iron for my bridal registry list, but when my old iron died, I went out and bought it myself! I was a little wary after reading some reviews that said the iron tends to spit and leak, but because the positive reviews were so glowing, I decided to take a chance with it anyway. However, I very carefully read the instructions and made sure to follow their recommendations, which included using cheap bottled spring water and allowing the iron to heat fully before using on the steam setting. The instructions also recommended testing the iron's steam function on an old towel prior to using it on clothes, and I'm glad I did, because there was some initial brownish residue.That being said, once I followed all of the above steps, I had no problems with the iron. It glided easily over clothes and did a very good job getting out wrinkles, although I still found starch to be useful on 100% cotton items. Also, I found that the spray of water worked better to remove wrinkles than the burst of steam function; in addition, the latter used up a lot of water in the tank, which I had to refill twice to iron a total of 8 dress shirts in about an hour. One other small negative was that although the cord did not tangle, I did find it getting in the way at times as another review had mentioned. Overall, however, I was very happy with the performance of this iron, as it did a nice job on clothes and was easy to use.",
                "reviewVotes": "43 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Rebecca Review",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWDYYVVWM3DC3CASUZKXK67G6IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U5W6TI92PJ8M?ASIN=B000050FZZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2001",
                "reviewTitle": "5.0 out of 5 stars Smooth Stainless Steel Soleplate......very impressive.",
                "reviewText": "My earliest memories of ironing goes back to the days of ironing napkins for my mother and helping with the ironing as a teenager. Lately, I am in charge of the work shirt ironing. With my last iron, I had to spray all the clothes with a mist of water, leaving lots of water all over the carpet. While it most likely doesn't hurt the carpet, it was annoying.When my old iron went to iron heaven, I decided to stop by Amazon and find out what was rated the best. The Rowenta seemed well loved by most. I had used one before and did like how it ironed because it seemed to have a good steam option and really did get out the wrinkles.My husband was a bit surprised I would be willing to spend more than $25 for an iron, but I told him the Amazon reviewers had convinced me this was the one!So, I just ironed all his shirts and he was very impressed. Absolutely no wrinkles left. The airglide stainless steel soleplate just literally glides over the fabric. The steam is continuous unless you turn it off. I only noticed a tiny bit of water spit out when I overfilled it once or left it sitting horizontally and it cooled slightly. I also made the mistake of using some tap water which has softener in it. Later, I learned that you should not use water which has salt in it. I then started to use bottled water and found it never spit after I changed over to that water.Most likely, other reviewers made the same mistake I did. They do say never to use distilled water. So, just bottled drinking water would work or water without salt. Using the bottled water will also prevent stains on your clothes that can develop from iron in the water. I did fill the unit over three times since I was ironing for over an hour.The water tank is larger than most irons and you don't have to fill it as much. It is also transparent so you can actually see exactly how much water is left.There is a cool spray mist that provides a light mist to remove stubborn wrinkles. It was hardly needed, but handy for some applications. The steam is variable, so you can use more or less. I had mine on high steam the whole time, but could see why you might not want so much steam. Cotton needs it!There is a burst of steam button which provides a powerful burst of steam for effective wrinkle removal. The unique \"vertical\" steam feature allows you to remove wrinkles from a garment while it is hanging. This is useful for curtains for sure!The automatic shut-off switches the iron off after 8 minutes if it is left vertically. It shuts off after 30 seconds when tipped over or left horizontally. The temperature dial is easy to move and is out of the way.The high quality materials used are quite impressive. I haven't tried the self clean system yet, but can see it will be very useful in the future. The iron was easy to fill by using a water bottle. There is a special air duct which helps the water not to \"bubble\" over. It was very easy to fill with water from a bottle, so keep one nearby.This iron doesn't stick to the fabric. That makes ironing a breeze. I am almost looking forward to ironing again. Now, what can I find to iron ;).Highly recommended. There are various levels of this iron. You can buy a cheaper one or a more expensive one. This seemed to be a good general purpose iron. There is a steam one with a large separate reservoir which I have used before and also liked. It is over a hundred dollars. Just a note, this is twenty dollars cheaper than I have seen it in stores.Just a last note...I recommend using this iron with an ironing board that has a wire holder for the cord. I am going to invest in one of those next. When you set the iron down, the base is very stable, but the cord needs to be kept out of the way with one of those cord holders that attaches to the end of your ironing board.~The Rebecca Review",
                "reviewVotes": "93 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWERT4X2DOTNFNSRX4NZZEBSZ5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK4JGN6C1XXF5?ASIN=B000050FZZ",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2004",
                "reviewTitle": "1.0 out of 5 stars Iron that leaks",
                "reviewText": "This iron leaked from the sides immediately after its first usage. The water tank was half full and everything leaked out from the base and it was a mess. I am never going to try Rowenta again. Very poor quality! I should have been more careful and read the reviews.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "codfish",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCE7BWQT5WH3NANIQOMXGMY2DDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12MR9C0XKZ21A?ASIN=B000050FZZ",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 19, 2009",
                "reviewTitle": "2.0 out of 5 stars Find another brand!",
                "reviewText": "model DM-273 - this is my second Rowenta. The first one was the top of the line Rowenta well over $150 and did not last long at all. The latest one (DM-273) about $70 and it did not last long either. I visit my girfrients house and use her Black and Decker which was under $20 and purchased before I purchased my first Rowenta. Never ever again will I buy a product from Rowenta. I cannot imagine how they got a good name except for the possibility people think since it's designed in Germany it must be good. Boy, have we been fooled!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVSKOZXKLW3C4UQA3ACRWHBHFBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPY8VK2M8RPS?ASIN=B000050FZZ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 9, 2006",
                "reviewTitle": "3.0 out of 5 stars Pretty good until it died.",
                "reviewText": "I thought this was supposed to be the Rolls-Royce of irons, so a few years ago I sprung for one. This model, in fact.It seemed as if it was good quality, but the steam spritz feature didn't always work as well as I wanted it to.The other day, after a few years, it died. To me, that's not a quality item.My old cheap irons lasted as long. I'm going to try one of those inexpensive Proctor Silex irons that got an excellent review on Amazon.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}