{
    "remaining_requests": 31950,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BLACK-DECKER-ICL500-Cordless-Soleplate/dp/B07F6XFFP9",
    "body": {
        "name": "Black+Decker ICL500 Light ‘N Go Cordless Iron, Purple, Large Water Tank",
        "price": "$79.99",
        "originalPrice": "",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BLACK-DECKER-ICL500-Cordless-Soleplate/dp/B07F6XFFP9",
        "soldBy": {
            "sellerID": "A189JNVGY6Y2W8",
            "name": "Electronics Warehouse Outlet",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A189JNVGY6Y2W8&asin=B07F6XFFP9&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41GV  yfzoL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51NS1uVuzDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51to4UejxDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412vRQsBMUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bMPZe 3VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CXVGw6DuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51H ksc39jL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BLACK+DECKER Store",
            "link": "https://www.amazon.com/stores/BLACKDECKER/page/9CD42FC6-F544-4F9F-807D-D1B33889F479?ref_=ast_bln"
        },
        "brand": "BLACKDECKER",
        "merchantInfo": "Electronics Warehouse Outlet",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 807,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 21 - 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Illuminated Charging Base: Return the iron for a quick recharge between garments. The light ring makes it easy to see when the iron needs a charge and when it's ready to use",
            "1500 Watts: The iron heats up quickly with every recharge-as fast as 10 seconds",
            "Ceramic Nonstick Soleplate: The durable, nonstick soleplate efficiently retains heat and smooths out wrinkles on a variety of ironable fabrics",
            "Large Water Tank: The large capacity water tank accommodates spray mist and steaming for long ironing tasks"
        ],
        "description": "Discover a new way to iron! The BLACK+DECKER Light ‘N Go Cordless Iron makes it simple to remove wrinkles without the hassle that comes with traditional corded irons. The cordless design gives you the freedom of movement, with no power cord to tangle or get caught up on the ironing board. It’s all possible with the charging base, which heats up the iron fast and includes a light ring that indicates when the iron needs to recharge and when it’s ready to use. The nonstick ceramic soleplate retains heat well and smooths out wrinkles on a variety of ironable fabrics, and the steam and spray mist controls let you quickly remove tough creases and wrinkles. Other features include: 1500 watts, vertical steam, auto shutoff, large water tank, self-cleaning function, 1. 8m ( 6ft) power cord, 2-year limited .",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Irons",
                "link": "https://www.amazon.com/irons/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510242"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Black+Decker"
            },
            {
                "name": "Special Feature",
                "value": "Auto Shutoff, Cordless"
            },
            {
                "name": "Color",
                "value": "Purple"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Wrinkles"
            },
            {
                "name": "Model Name",
                "value": "ICL500"
            },
            {
                "name": "Base Material",
                "value": "Ceramic"
            },
            {
                "name": "Frequency",
                "value": "50 Hz"
            },
            {
                "name": "Product Dimensions",
                "value": "6.25 x 11.6 x 5 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.54 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Spectrum Brands"
            },
            {
                "name": "ASIN",
                "value": "B07F6XFFP9"
            },
            {
                "name": "Item model number",
                "value": "ICL500"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 807 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#657,587 in Home & Kitchen (See Top 100 in Home & Kitchen) #237 in Irons"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "2"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "ICL500 Iron & Charging Base"
            },
            {
                "name": "Wattage 1500 watts",
                "value": "Style Modern"
            },
            {
                "name": "Item Weight 72.64 Ounces",
                "value": "Voltage 120 Volts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "BLACK+DECKER ICL500 Light 'N Go Cordless Iron N Nonstick Soleplate Cordless Design Iron the easy way! With no cord, you don’t have to worry about tangling or getting caught up on the ironing board. You have full freedom of movement! Illuminated Charging Base Up to 25 seconds of cordless ironing, with fast 10-second recharges! The iron is designed to recharge in the time it takes you to adjust garments on the ironing board. Plus, the light ring makes it easy to see the charging status. Ceramic Nonstick Soleplate The durable, nonstick soleplate efficiently retains heat and smooths out wrinkles on a variety of ironable fabrics. Auto Shut-off For added peace of mind, the iron shuts off when left motionless for about eight minutes.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/07cbfc72-5d74-49e8-8bc2-ffaadaceb413._CR0,0,2085,2085_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/77506277-c284-4d7f-8f07-a4546fed9f43._CR0,1,2084,2084_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/55ec5583-318a-4234-a2f6-2d10de8c4695._CR0,0,2084,2084_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b7353b59-28aa-4329-aabd-3daef4330b5f._CR1,0,2084,2084_PT0_SX220__.jpg"
                ]
            },
            {
                "media_text": "Spray Mist and Steam Burst Buttons Steam and iron full loads of laundry without stopping for refills. Large Water Tank Steam and iron full loads of laundry without stopping for refills. 1500 Watts The iron heats up quickly with every recharge—as fast as 10 seconds! 6 Foot Cord The power cord is nearly 6 ft. long so you can conveniently place the charging base near your ironing board, with included cord storage for ease of storage. Spray Mist and Steam Burst Buttons Large Water Tank 1500 Watts 6 Foot Cord",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/47d4a308-db45-4d29-9bd9-0031870c87ca._CR0,0,2085,2085_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/23ead12d-80bc-4c3d-8814-0cf6f90ebcec._CR1,0,2084,2084_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2016aae3-9fd5-4ccb-99b1-8530eac3981a._CR0,1,2084,2084_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/399dd50f-7826-45bc-8637-9d3fc707dd41._CR0,0,2084,2084_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Burst of Steam Quickly blast away tough wrinkles with a burst of dense steam. Spray Mist It’s easy to apply the right amount of moisture for quick wrinkle removal. Vertical Steam Use the iron as a steamer for quick touch-ups right on the hanger or for steaming curtains and drapes. Self-Cleaning Use the iron’s automatic cleaning function to avoid scale buildup.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fbf279f7-a4c5-45d9-b923-01f84a3626f0._CR1,0,2084,2084_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d455da09-e0a1-43f4-b9b2-f44106c509e6._CR0,0,2084,2084_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1999b546-0291-43b9-8ed0-e4f26a850779._CR0,0,2084,2084_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cd561039-ecf3-462c-a5cf-17e749fe495d._CR1,0,2084,2084_PT0_SX220__.jpg"
                ]
            },
            {
                "media_text": "BLACK+DECKER Light ‘N Go Cordless Iron, Purple, ICL500 Discover a new way to iron! The BLACK+DECKER Light ‘N Go Cordless Iron makes it simple to remove wrinkles without the hassle that comes with traditional corded irons. The cordless design gives you the freedom of movement, with no power cord to tangle or get caught up on the ironing board. It’s all possible with the charging base, which heats up the iron fast and includes a light ring that indicates when the iron needs to recharge and when it’s ready to use. You can get up to 25 seconds of cordless ironing from quick 10-second recharges—that’s the time it takes to readjust garments on the ironing board. The nonstick ceramic soleplate retains heat well and smooths out wrinkles on a variety of ironable fabrics, and the steam and spray mist controls let you quickly remove tough creases and wrinkles. Other features include: 1500 watts, vertical steam, auto shutoff, large water tank, self-cleaning function, 6ft power cord. Features Cordless Design for versatile, tangle-free ironing Illuminated Charging Base delivers fast heat and convenience 1500 Watts for fast, powerful heat Ceramic Nonstick Soleplate smooths out wrinkles on a variety of fabrics Large Water Tank for reliable spray mist and steam Burst of Steam + Spray Mist + Vertical Steaming for fast steam and moisture control Self-Cleaning Function removes scale buildup",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0fc12ff2-d9ea-476e-99d6-05c74134c9cf._CR0,0,3001,3001_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/07cbfc72-5d74-49e8-8bc2-ffaadaceb413._CR0,0,2085,2085_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/77506277-c284-4d7f-8f07-a4546fed9f43._CR0,1,2084,2084_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/55ec5583-318a-4234-a2f6-2d10de8c4695._CR0,0,2084,2084_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b7353b59-28aa-4329-aabd-3daef4330b5f._CR1,0,2084,2084_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/42c13f06-0d0c-4a44-bab2-f8790eb3ddc2._CR0,25,2165,670_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/47d4a308-db45-4d29-9bd9-0031870c87ca._CR0,0,2085,2085_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/23ead12d-80bc-4c3d-8814-0cf6f90ebcec._CR1,0,2084,2084_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2016aae3-9fd5-4ccb-99b1-8530eac3981a._CR0,1,2084,2084_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/399dd50f-7826-45bc-8637-9d3fc707dd41._CR0,0,2084,2084_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fbf279f7-a4c5-45d9-b923-01f84a3626f0._CR1,0,2084,2084_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d455da09-e0a1-43f4-b9b2-f44106c509e6._CR0,0,2084,2084_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1999b546-0291-43b9-8ed0-e4f26a850779._CR0,0,2084,2084_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cd561039-ecf3-462c-a5cf-17e749fe495d._CR1,0,2084,2084_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0fc12ff2-d9ea-476e-99d6-05c74134c9cf._CR0,0,3001,3001_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Andrea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEB73YPZK4I46SCLT5IBPDIM6YJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTEUPUHYPZE32?ASIN=B07F6XFFP9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Great cordless, Lightweight!",
                "reviewText": "I absolutely have to have a cordless iron. I am disabled, and have difficulty managing a corded iron, because I run them over, which tends to melt the cord. Or the cord gets in my way, and I make a total mess of what I’m ironing. I’ve had an old Orick, that I got many years ago, and it just was too heavy, and was no longer doing its job very well, was leaking. It was also very heavy on its base, and my old wobbly board was not standing up to it.This is the perfect solution! Instead of a great big, charging base to place it in, creating a very heavy thing sitting on the ironing board while you’re ironing, this has a nice small pad, that is lightweight in and of itself. The iron is super lightweight, and it’s very easy to place it back into its charging pad when necessary. Even though it’s lightweight, the iron does its job amazingly well! I have had heavy curtains that I’ve had to iron the creases into, in order to create a new hem. My old iron had a heckuva time with it. This thing did an amazing job, even though it hadn’t had as much weight behind it to press with. Clearly the weight of the iron is not the only thing that works.Initially, I had trouble with the steam, I think that it was because it wasn’t fully primed. I’ve used it since then, and not had any trouble with the steam.Many people may complain about the fact that it does not hold the heat for long. This is, unfortunately, a common issue with a cordless of anything. The heavier iron probably held its heat slightly longer, but I am willing to trade that off for the ease of use of this one. The charging pad has a green light during the amount of time that should be good for heat, and blinks red when it’s time to put it back. I haven’t timed it myself, but I didn’t find it to need to be recharged any sooner than I would’ve already laid the iron down to shift my fabrics. Clearly, that amount of time is appropriate , at least for me.I absolutely adore this iron! This iron makes my life incredibly easier! I should buy 10 of them just to make sure that there I will have one, if this one ever breaks, lol. If Black & Decker stopped making this model, I will be crying.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHROD5RRS4QPRD7A3I67M5U355Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R193YZTQPWZ4BX?ASIN=B07F6XFFP9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2021",
                "reviewTitle": "5.0 out of 5 stars I love it! The safety is well worth the recharging time for me!",
                "reviewText": "I am a seamstress and handmade artisan living in a very small apartment and had been using a very small corded travel iron and an over-the-door ironing board in my bedroom. After the last time bumping the board the iron came crashing down again, barely missing my feet. It stopped working and I knew enough was enough! It was time to invest in a full sized cordless. I rearranged a few items on a small stand a few away from the board to keep the iron out and plugged in when needed without have to store it or keep it on the board when in use. I tested it out with a wrinkled cotton maxi dress for first usage, and I am so happy with it! I agree with the comments that due to the nature of the technology and the battery pack, this iron does not stay warm for very long before it beeps to reheat. However, I keep the stand on the little shelf a few feet away, working quickly, and put it back on the base when I need to readjust. I ironed many items to see how I'd like it and if I would get annoyed with the short time before recharging, including button down shirts and cotton shorts, and I am so happy! Most times it's \"green\" or shortly after when I am ready. It is MUCH hotter and of course larger surface than my tiny travel iron, so for me it makes ironing faster and easier and I don't worry about hurting myself or safety due to the shut-off feature if I walk away. I LOVE it and find the lack of cord, level of steam/heat and ease of use of the round charging base far outweighing the inconvenience of how quickly it needs to be recharged. I even worked on sewing a cotton blouse and am still happy with using it for sewing projects. But I can totally see how others would get completely frustrated and hate using it. Decide for yourself if your patience level and usage needs will work with this iron. For me, HUGE WIN. And, bonus.. it's purple and looks great sitting out.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maggie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3TAKJCIVMFNNFHVW4KGIHLRLNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24DJ67P0QAE71?ASIN=B07F6XFFP9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2020",
                "reviewTitle": "4.0 out of 5 stars Great for sewing",
                "reviewText": "I sew a lot and while sewing, I press a lot! This iron is Great for a quick press. (This is not my go to iron when I have actual ironing to do or need to press large pieces of fabric.) Love that I don't have a cord in my way. I also like that the charging station is a small base and not a big stand. I have a small little pressing table set up next to my sewing machine, it's nice to be able to have the charging base right there and not take up a lot of space. Only con for me is that is does take a little longer to heat up than I'd like but it's not bad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Agnes Mark Gomez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX2SIQOLRPLU4IAWTL6WKPESF6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFNAL1COIHQ3N?ASIN=B07F6XFFP9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars It feels like a professional item.",
                "reviewText": "I loved the end results of my clothes. They look like I just collected them from the cleaners.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim Chester",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUTDUTJIYRTYT4UMZ7NNFXHLFRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJWSG9SAE4AT8?ASIN=B07F6XFFP9",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "1.0 out of 5 stars Junk",
                "reviewText": "It doesn’t work, won’t get hot . Can’t get a hold of customer service. I called black and decker and the said because of the date code on the cord it wasn’t under warranty and they don’t make them anymore. Because this place is considered a third party seller I’m pretty much SOL. Be very very careful",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SMMTA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR32G52IQ4GEMSMVACEFF7VM5WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XBJTSAN0HTDC?ASIN=B07F6XFFP9",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2022",
                "reviewTitle": "3.0 out of 5 stars Disappointed",
                "reviewText": "I absolutely love the cordless aspect. Great to handle. Manageable weight. The iron doesn’t hold charge for more than a minute which is disappointing, inefficient, time consuming and results in unwanted additional repetitive hand motion to constantly put on the charger. The tip of my sole plate broke off after three uses.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Roth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUW24LX2TCHDGS7IDY2KSXWACEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UFH7EKE4V66J?ASIN=B07F6XFFP9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2022",
                "reviewTitle": "5.0 out of 5 stars Great for quilters!",
                "reviewText": "I do a lot of quilting and there is a lot of pressing that happens while you're piecing the tops. I find it very convenient not to have to deal with a cord getting in my way, particularly when I'm pressing small items.This iron has the most steam of any iron I've ever used, and I've used some top-of-the-line irons. It stays plenty hot between charges, so if you just want to hit something quickly, you don't have to wait until the light turns green. I'd definitely recommend this iron.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "peg lamping",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEEGQQ3QMZPZBG2Z6IC5MGUYAXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SL4AOL9WZZ2D?ASIN=B07F6XFFP9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Heat",
                "reviewText": "I love that it gets nice and hot and the steam feature is awesome.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raul O.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 25, 2020",
                "reviewTitle": "Es lo máximo",
                "reviewText": "Mi esposa es la mas felizHay varios comentarios que dicen que pierde calor fácilmente y efectivamente tienes que ponerla en la base constantemente para que se caliente pero eso solo es si eres muy rápida planchando. Para un uso normal y casero, es una maravilla y no le veo ningún inconveniente",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CANY",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 17, 2020",
                "reviewTitle": "Opinión",
                "reviewText": "Un producto absolutamente inservible e infuncional",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}