{
    "remaining_requests": 23911,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Listerine-Advanced-Defence-Treatment-Gingivitis/dp/B00I874D4Q",
    "body": {
        "name": "Listerine Advanced Defence Gum Treatment for Gingivitis 500ml",
        "price": "$14.99",
        "originalPrice": "$16.89",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Listerine-Advanced-Defence-Treatment-Gingivitis/dp/B00I874D4Q",
        "soldBy": {
            "sellerID": "A3AEMHYZYI3CZ7",
            "name": "AXX INDUSTRIES INC.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3AEMHYZYI3CZ7&asin=B00I874D4Q&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BB9F4YB2"
        ],
        "asinVariationValues": [
            {
                "asin": "B00I874D4Q",
                "variationName": "Size",
                "variationValue": "16.9 Fl Oz (Pack of 1)",
                "price": "$14.99",
                "variationImageURL": ""
            },
            {
                "asin": "B00VMJUE7W",
                "variationName": "Size",
                "variationValue": "17.59 Fl Oz (Pack of 1)",
                "price": "$33.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41SzyePZQ7L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/417 vPcrZuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iYpRoNxmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CbKLQml6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DKpGRN wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hICnG84KL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Listerine Store",
            "link": "https://www.amazon.com/stores/Listerine/page/7CED296C-1562-4546-A784-9ADDFD39A172?ref_=ast_bln"
        },
        "brand": "Listerine",
        "merchantInfo": "J&D Int. USA",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 8385,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 25 - 28 on orders shipped by Amazon over $35",
            "Or fastest delivery February 25 - 27",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 4 hrs 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Gum Treatment for Gingivitis"
        ],
        "description": "Listerine Advanced Defence Gum Treatment for Gingivitis 500ml",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Oral Care",
                "link": "https://www.amazon.com/Oral-Care-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10079992011"
            },
            {
                "name": "Mouthwash",
                "link": "https://www.amazon.com/Mouthwashes/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3778161"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.93 x 3.62 x 8.86 inches; 0.01 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ TRTAZ11A"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 15, 2013"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Listerine"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00I874D4Q"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,717 in Health & Household (See Top 100 in Health & Household) #64 in Mouthwashes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 8,385 ratings"
            },
            {
                "name": "Brand",
                "value": "Listerine"
            },
            {
                "name": "Product Benefits",
                "value": "Gingivitis"
            },
            {
                "name": "Liquid Volume",
                "value": "500 Milliliters"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Advance Defence Gum Treatment Advanced White Milder Taste Total Care Sensitive Milder Taste Total Care Teeth and Gum Protect Total Care Fights plaque germs ✓ ✓ ✓ Long lasting fresh breath ✓ ✓ Maintains healthy gums ✓ ✓ ✓ ✓ ✓ Strengthens enamel ✓ ✓ ✓ ✓ ✓ To keep teeth naturally white ✓ ✓ ✓ Cavity protection ✓ ✓ ✓ ✓ ✓ Helps prevent tartar ✓ ✓ Alcohol free / Milder taste ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/26f09c48-edb1-43b7-b980-a574d1ef0025.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/f309bce7-3beb-4e0e-b3b1-fb504acfe050.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/9804e1ed-c8c6-4403-a531-b912c1d5e3a9.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/dd5ba6ab-ba1e-4b5e-b3c1-f3a20fcc4c3c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/2e36a24b-de69-4e53-8896-c90f2207e994.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/e1bef369-69c5-464f-b928-37d0241e400d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/ea4ed433-423a-46e0-9c80-7551896a38f0.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/2628ae65-a679-40e1-a6f2-6153f56022ab.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/99b7f48e-cf60-451d-83b1-16ca6f301965.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "The Rebecca Review",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWDYYVVWM3DC3CASUZKXK67G6IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XNMNRV3I3KKZ?ASIN=B00I874D4Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Instant Results! Helps with all sorts of issues!",
                "reviewText": "I have a crown which does not fit as snuggly as it should and food like chicken gets down in between my two teeth causing me a lot of irritation and problems. I floss, I brush, I use dental picks, but still that area just doesn't feel right until I use some of this mouthwash and swish it around in my mouth. I get instant relief from a persistent problem so have ordered two more bottles. I don't want to have to get another crown when it is fairly recent so this mouthwash seems the obvious solution. So for gum irritation this is king!~The Rebecca Review",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fred",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3FOHUV2UMMRTSURGFIJDLGJNNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F268NMWFIY70?ASIN=B00I874D4Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "I have used the mouth wash for a week now and i can feel the difference on my gums.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darlene workman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM4IYJG7IWSYP3LNKAIXTI2LLGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O2U99ON12YXB?ASIN=B00I874D4Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Best stuff ever",
                "reviewText": "I started using Listerine Gum therapy which works excellent. I saw my gums becoming healthy. I also build plaque very easily. I go every 3 months for a cleaning. I noticed with using gum therapy my plaque build up dissipated. I then realized they have advanced Listerine Gum therapy. So, why not step it up. This one runs 15 to 16$ double the price of the regular gum Therapy. I have to say, love this mouth rinse. I got some for my husband and my Mother.I use 3 times a day and swish in my mouth while I do other things for that deep rinse. Definitely recommend whether you have gum issues or not.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isaiah T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4EKEZDUB4RT5ETCXHGV63WJJVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R322YUAHGCUITR?ASIN=B00I874D4Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 14, 2023",
                "reviewTitle": "4.0 out of 5 stars For those who suffer from gum disease",
                "reviewText": "I am writing this review, not just for the Listerine Advance Defence Gum treatment, but I also want to make this a quick summary guide as to what I have done to cure my gingivitis and periodontitis without the need to seek professional dental help. I hope this may help someone in the ways the following processes have helped me.I will start by saying that this item alone has not been the sole reason as to why my gums have recovered immensely, nor was it the primary tool in the recovery, but it has most definitely been a valuable asset and I do recommend this product as I do think it had it's own key role in this whole process. Keep in mind, though I have brushed my teeth regularly for years, I have always suffered from gingivitis regardless, as well as chronic sinus infections.Aside from this item, again the Listerine Advance Defence Gum Treatment, I recommend the following tools and steps, even BEFORE the purchase of this item, especially as the grand total of all the items may equate to the same price or less than this product. I however, still strongly recommend using this item after the following items:1 Oral B ELECTRIC toothbrush. Save your money, only pay $8-$14 for this one. Still highly recommended this step. Will go in depth later.Tom's Toothpaste OR the cheaper Arm and Hammer toothpaste (this may be subjective and unnecessary, but these 2 have had the best results for me personally) cost $3-$8Any kind of floss ($1.25 at the DOLLAR .25 store ;)) lolAnd FINALLY the undisputed champion, and the real (unknown) king to healthier gums. Using 20 minute oil swishing of Nutiva Coconut Oil. Now you don't HAVE to use the Nutiva coconut oil brand, BUT if you are buying from amazon anyway, you are already in the perfect market place for the best deal on this stuff. At around $6 per jar, you get the NECESSITIES of oil pulling. Make sure, no matter what coconut oil you buy, Nutiva or not, MAKE SURE it is Organic AND Unrefined. The reason for the organic is so you aren't swishing any harmful/unnecessecary additives in your mouth, and the reasoning for the unrefined is so you get the necessary nutrients and antibacterial properties from the coconut oil. Trust me, this is the greatest step of all in my opinion, this also had the byproduct of fixing my chronic sinus infections.Then you buy this product.A decent optional step for pain relief would be to try using Clove oil or Tea Tree oil to clean your tooth brush, or to mix with your toothpaste or even make a separate mix with coconut oil. You see both of these oils are known for having great antibacterial properties for gums as well as providing pain relief. If you do suffer from any kind of pain from your gums or teeth, these essential oils, might actually be, an essential step for you. The brand Plant Therapy is recommended and is what I've used. It was $10 for the Clove oil here on amazon. You can also try Eden Garden as I've heard those are other good options. Just remember if you do use these, that essential oils when extracted are extremely potent. If you do use it on your toothpaste you may only want to use a single drop, and still dilute it with water by quickly rinsing it off. Personally I just use this to clean my toothbrush, but I do also love the smell. It also does clear my sinuses, not as well as the coconut oil does, but this cleans my sinuses in seconds, while coconut oil takes the 15 minutes+For me the best results were to brush first, using toothpaste about the size of a pea. Make sure to scrub your gums and try to get in the crevices between your teeth, as well as the areas where your gums connect to your teeth.Then directly afterwards floss, then take the organic, unrefined, coconut oil and scoop about a teaspoon and a half (more or less) of coconut oil for 15 to 20 minutes, the longer, the better.Finally use this Listerine product for no more than 35 seconds. This product does not help you the longer you swish it in your mouth. It is so potent in fact, that if you swish it for too long, you can actually damage your gums even more, so please do follow the instructions.Alternatively if you can't find the time to oil pull in the daytime, I have had success doing so while showering, or while driving to work/to the store.And that's it. For me these steps have really helped me personally. First the swelling went down, then after about 2 months my symptoms were slowly dissappearing and my gums look and feel way better. My sensitivity to eating hot and especially colder foods has also dropped and doing so has made both experiences more tolerable. And remember this as well. If you have been doing this routine for a while, and your gums are still bleeding after a month or two, I recommend trying the clove oil in the routine with your toothpaste and also to use the oral b electric toothbrush and let it brush your teeth for you. Only use light pressure, allow the toothbrush to do it's thing. You can accidentally damage your gums by brushing too hard, using this listerine product longer than 35 seconds, or by neglecting to brush the crevices of your gums, FRONT AND BACK, as well as the gums under your teeth. Be mindful of how you are cleaning. Make sure your getting all the appropriate spots with just enough force. Not too much, not little. Make sure to perfect your inner chi with the ultimate wax on wax off technique (lol)One last tip, IF YOU DRINK ANYTHING BUT WATER (Soda, Juice, Energy Drinks, Coffee etc...) Try rinsing your mouth out with water after you finish your beverage every time. I know it seems arbitrary, but this can also help your gums. Remember it's not really about following steps or guidelines, it's about how you treat yourself. That's the key takeaway.You shouldn't have to pay an arm and a leg to get better health. Good luck in your endeavors, I really truly hope this helps.",
                "reviewVotes": "301 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anados Defered",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJA5VAL7G6WIRVYFGPKQSOVMW6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HWVKCSFXAI34?ASIN=B00I874D4Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2018",
                "reviewTitle": "5.0 out of 5 stars It works. Why you can't buy it in the USA. Plus everything else you might want to know.",
                "reviewText": "Listerine Advanced Defence Gum Treatment for Gingivitis 500ml This product was a mystery to me. What is it? Why can't I find it anywhere else? Why isn't it on the Listerine site?First. I have used this product for six months. I find it to be safe and effective , following the directions exactly, as a gingivitis treatment and daily gum protection, in conjunction with tooth brushing with a fluoride toothpaste. Whew! Glad I got that out.It tingles, has a mint taste, and an odd aftertaste I cannot characterize, but it is not unpleasant. It does not burn. I did see a difference in my gums.Now for all the other stuff. All the caveats.\"Clinically proven to treat Gingivitis\" per label. Follow the directions exactly. Why? Because this is serious stuff. READ THE WHOLE BACK OF THE BOTTLE.*KEEP OUT OF SIGHT AND REACH OF CHILDREN.*Use twice daily after brushing or when directed by your dental healthcare professional.*Do not use this product if you are sensitive or allergic to Ethyl Lauroyl Arginate HCI or any of the ingredients.*If you experience discomfort or irritation, stop using the product.*Do not dilute, swallow or swig from the bottle.*Do not use after the expiration date.*Only use as directed.*If you are suffering from a gum condition, and are not sure whether it is gingivitis, THEN DO NOT USE THIS PRODUCT (caps mine) and seek medical advice.Skip the rest unless you are really interested. Seriously.This at one time was labeled as a medical device. Not now. The only document I found from the FDA from 1998 did not include it in its compendium of ingredients deemed safe and effective. It was from 1998, but I have found nothing more recent FDA document. The EU SCIENTIFIC COMMITTEE ON CONSUMER SAFETY \"considered\" Ethyl lauroyl arginate HCl safe for use as a preservative up to a maximum concentration of 0.15% in mouthwashes. This product concentration is below that @ 0.147%.Initially the only research I could find was from 2015. Exploratory. A randomized trial of ethyl lauroyl arginate-containing mouthrinse in the control of gingivitis. Found that a concentration up to 0.15% of this twice daily as a adjunct to tooth brushing for four weeks resulted in significantly lower levels of plaque and gingivitis, well-tolerated with NO SHIFTS IN ORAL MICROFLORA - something the FDA gets nervous about. There is later research, dealing with its use for gingivitis and periodontitis, but none in the USA, only Europe.LAE as a powder was patented by the Spanish company Grupo Lamirsa. It is used as a preservative in other concentrations. As a preservative, it acts to break down the membranes in a wide range of micro-organisms. Once the membranes have been broken, the cells die. Its strength is modified here, but still potent.A 2016 article states LAE is approved by the EFSA and the FDA as an antimicrobial and food preservative. A cation which needs direct contact for best effect in food.It's use in mouthwash makes sense. Direct contact, lower concentration, kill \"germs\" related to bleeding gums, gingivitis.So what is the issue in this not being sold by vendors in the USA? My guess? Standards are different in the EU. Treatments are different, not better or worse, just different. Politics. The FDA. Labeling. Marketing.Inertia.This is a product that Listerine in the USA will not discuss. Nor will they provide any information on it. Not a surprise. Listerine is Global and said so. 'We do not comment on other regions... marketing decisions (as to why it is not offered in the U.S.) to not overlap with existing products offered.\" They do what they do, we do what we do. 'The consumer center provides information on PRODUCTS LICENSED AND MARKETED in the U.S. Testing information is proprietary and not available to the consumer center.\"I never tried to find testing information on other products. Never wanted to. This one was different. Advanced is manufactured by Johnson & Johnson, Listerine's parent company, in UK & Germany. It was manufactured for a bit in France, no longer. Why do I mention this? Listerine distributes only to third parties, as the vendors who thankfully sell this through Amazon. Amazon, being global, does sell this on their UK site the last time I looked through Amazon pantry, in the UK.So that is everything I found out. It worked for me.Bonus for getting to the end of this. Great price now. Buy it. Kemfit sends it by Royal Mail.",
                "reviewVotes": "452 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacky",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 27, 2023",
                "reviewTitle": "it works great",
                "reviewText": "its effective and good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 12, 2024",
                "reviewTitle": "Controls tartar",
                "reviewText": "Since I have been using this mouth wash I do not get anymore tartar on my teeth which I used to suffer with a lot, I would not use anything else.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Historylover",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 26, 2024",
                "reviewTitle": "100% Satisfied!",
                "reviewText": "It really works! I recommend it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oum",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 10, 2024",
                "reviewTitle": "Prix double",
                "reviewText": "Je l'ai trouvé en pharmacie à 6€90 mais c'était déjà trop tard celui ci été déjà expédié..il coûte le double pour le même produit c'est dommageSinon je confirme son efficacité merci",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 22, 2023",
                "reviewTitle": "Good",
                "reviewText": "Stopped gum bleeding in 1 week",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$16.20",
                "sellerName": "A 2 Z STORE",
                "sellerRating": "5"
            },
            {
                "price": "$16.36",
                "sellerName": "DZH LLC",
                "sellerRating": "5"
            },
            {
                "price": "$17.39",
                "sellerName": "Hawk Ventures LLC",
                "sellerRating": "4.5"
            }
        ]
    }
}