{
    "remaining_requests": 23885,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ecofam-Peppermint-Mouthwash-Tablets/dp/B0CLW1KMMV",
    "body": {
        "name": "Ecofam Peppermint Mouthwash Tablets",
        "price": "$13.99$13.99 ($0.16$0.16 / Count) $13.29$13.29 ($0.15$0.15 / Count)",
        "originalPrice": "",
        "rawPrice": 13.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ecofam-Peppermint-Mouthwash-Tablets/dp/B0CLW1KMMV",
        "soldBy": {
            "sellerID": "A4VSXT07MX7CA",
            "name": "Health Happy",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A4VSXT07MX7CA&asin=B0CLW1KMMV&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41m0kac9uoL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41OBSj4FYEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qdqydvPzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41q7NozlYfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RGTbkXiWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4110a3PS5wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F7J2ILmsL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Ecofam",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Ecofam"
        },
        "brand": "Ecofam",
        "merchantInfo": "Health Happy",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 33,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 3 hrs 2 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 3 hrs 2 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Ecofam Mouthwash tablets are a new and unique way to rinse your mouth and freshen your breath naturally. Our chewable natural mouthwash tabs easily dissolve in your mouth when swished with water to provide all the benefits of an oral rinse without plastic. Our Mouthwash tabs are formulated to protect your gums and teeth using Hydroxyapatite, Coq10, probiotics and Xylitol.",
            "Bite and Chew on one tablet and swish with saliva. You can add a small sip of water for extra swishing power. Swish, spit, and enjoy a bright, healthy smile. Our natural ingredients strengthen your teeth, reduce plaque, moisturize your mouth, and freshen your breath. Made in the USA. Our Mouthwash tablets are Fluoride-free and alcohol-free.",
            "Perfect for the go and for travel or even take them camping. Each tablet is portioned for one oral treatment. These tablets are so convenient to keep in the car or office to freshen your breath wherever you are.",
            "Our glass jars are specifically chosen to reduce waste and provide a sustainable plastic-free oral care experience. Each jar contains 90 natural mouthwash tablets.",
            "Vegan and Cruelty Free. Ecofam will never test on animals.",
            "Fresh Peppermint flavor - Our non-alcoholic mouthwash formula is non-drying for an extra refreshing feeling.",
            "For best results use our mouthwash tablets in conjunction with regular toothbrushing twice daily."
        ],
        "description": "EcoFam Mouthwash tablets are a sustainable, fun, and easy way to freshen your breath! Made in the USA. Contains zero plastic! Our Mouth wash tablets are packaged in a glass jar that can be reused or recycled. Made with healthy, nontoxic ingredients to freshen your breath. Made with no artificial flavors or colors, fluoride-free, peroxide-free, gluten-free, and SLS sulfate-free. Perfect and easy to use while traveling. Vegan-friendly and has never been tested on animals.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Oral Care",
                "link": "https://www.amazon.com/Oral-Care-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10079992011"
            },
            {
                "name": "Mouthwash",
                "link": "https://www.amazon.com/Mouthwashes/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3778161"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 3.15 x 3.11 x 3.03 inches; 7.83 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 26, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Ecofam"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CLW1KMMV"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#58,771 in Health & Household (See Top 100 in Health & Household) #294 in Mouthwashes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 33 ratings"
            },
            {
                "name": "Brand",
                "value": "Ecofam"
            },
            {
                "name": "Product Benefits",
                "value": "Cavity Protection, Ecofriendly, Zero Waste, Fluoride-free, alcohol-free"
            },
            {
                "name": "Flavor",
                "value": "Peppermint"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Item Form",
                "value": "Tablet"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM3UWTV47FZJCYIQEELMU5BOPLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SSZL9WNED892?ASIN=B0CLW1KMMV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Such a clever idea",
                "reviewText": "Portability is something I value. Mouthwash tablets are such a great idea! You can keep them in your car, in your purse, with your camping supplies, in your pocket, anywhere you may need to freshen your breath, but carrying a bottle around isn't practical. Put a few tablets in a small container and you're ready. Just make sure you have the ability to spit it out!The best scenario that came to mind would be going out to eat on a first date. Italian. Garlic. Cheese. Garlic! You would like to freshen up, but you don't have any mints or gum. You dig in your purse and you find your mouthwash tablets! The day is saved. The only thing you have to do is to convince your date to use one.When I tried out my first tablet, I hadn't brushed. I only used one tab and did not use water. The tablet is soft and there are mini minty crunches that give the burst of peppermint. When you chew it, saliva does increase a little bit. It may seem odd at first, but I was able to swish it around my teeth well. The downside of using it without water is that you cannot gargle or get the back half of your tongue covered. Since I didn't brush beforehand, my tongue still felt left out of the peppermint party. The minty freshness doesn't last as long as regular mouthwash I noticed. In a camping scenario with little to no drinking water, this is so much better than nothing.I think using two tablets would work out better, but I like to follow recommend guidelines. Still, I would like to know if it would be safe. I would also like to know if this would be safe if swallowed. Is it safe for nature if you spit it out on the ground? These things are not mentioned on the jar.Consider if these fit into your lifestyle. I think everyone could use a backup besides mints and candy. Kudos to the jar for being eco-conscious.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWFB6MGSJPV66YCHIM2VNZVLERA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW4KI66RCZPCD?ASIN=B0CLW1KMMV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "4.0 out of 5 stars Why am I not giving it 5 stars",
                "reviewText": "I really like the taste, xylitol as the first ingredient is great. Suppose to be very healthy for oral hygiene. No problem getting it to swish. Great product for making the switch from toothpaste and mouthwash. I don't like buying products that are only free product for a good review. Which is why i took a star away. Normally I stear clear of buying from Sellars who do that, it's so unfair. And no way to know if they are actually truthful. I bought the vanilla mint toothpaste tablets, which got actual reviews, and really like it. So yes I thought this would be a good after rinse, not disappointed at all with the product, just the free product for a review is disappointing.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amber",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOS3L4CPVHBFOYPEIVP6NFD6TZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NXLWAOORX1B4?ASIN=B0CLW1KMMV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice!",
                "reviewText": "These mouthwash tablets are actually really nice. A lot of mouthwash today has alcohol in it or generally burns my mouth in ways I don’t like but this doesn’t. I was nervous the texture was going to throw me off, but I don’t mind it. I like that water isn’t completely necessary to get the tablet to dissolve in your mouth.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jay Bents",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPQ2JVYKVDLF4GTSEZE2HMUF2VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R302AKINQBBCI9?ASIN=B0CLW1KMMV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Nice to have",
                "reviewText": "Really nice to have, can keep some in your car or on your bathroom counter. Strange but nice to have.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQDKSGTHRRSVFHQXGLW54EECG3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B7LI7U6TCZHD?ASIN=B0CLW1KMMV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Pleasantly suprised!",
                "reviewText": "When these arrived they simply had a piece tape for closure and no safety seal so I was skeptical. It did not appear to be used but it's hard to say, I feel like hygiene items should always come with a seal. I was reluctant to use it and it actually took me some time but one day I was in a pinch and this was all I had. I chewed the tablet and to my surprise it dissolved well and quickly. It left my mouth feeling fresh and minty. I know keep these in my office for quick emergencies. I simply spit out the excess after it dissolves. I am pleasantly surprised at how well they work. I would like them to work on a safer seal but other than that the product is great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna Stevenson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMZ3U2HMGRSCZXKWXJBPHXV465A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S4IBE2YA1K2O?ASIN=B0CLW1KMMV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Fresh",
                "reviewText": "These are very convenient, especially is traveling, you can put some in a small container and you are ready to go. They are minty, easy to use, just follow the instructions. It will leave you with a clean and fresh sensation.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. M. Saunders ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWJWHVSU6VAKFYV3VDXE5CJTTSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z24Z3LUJVZY3?ASIN=B0CLW1KMMV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Innovative Idea--Fast, Convenient, and Effective",
                "reviewText": "These mouthwash tablets taste good, are easily chewed up, and do make your mouth and breath feel fresh. They are an innovative product. It's a great idea to be able to bring a few with you to work or on a trip and not have to worry about an unwieldy bottle full of liquid spilling.I've used one with just saliva and one with a little added water--not much difference there. They really do make your mouth feel fresh and refreshed.I have only one objection to them. There is no mention of whether you can swallow the pill or not. I wouldn't swallow it, but there is no warning that you shouldn't. If it isn't safe to swallow, it would be good to know that in the directions; if it is safe to swallow, it would be good to know that too.In any case, as they are, I wouldn't swallow them after chewing, so, even though they are convenient, you do have to plan on having a place and a way to spit. I think it would be super convenient if you could swallow them after chewing, but I wouldn't consider it safe with all the chemicals in them.I'm glad I got them, and they are quick and easy to use. I'll definitely bring them along in my purse or travel bag to freshen up. They are much more effective than candy-like breath fresheners and are advertised as having some teeth protecting qualities (unlike candy breath fresheners). All in all, this is a good product.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}