{
    "remaining_requests": 23977,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/VITA-MYR-Zinc-Plus-Herbal-Mouthwash-Ounce/dp/B000VY20B2",
    "body": {
        "name": "Zinc-Plus Xtra Herbal Mouthwash (16 Ounce)",
        "price": "$17.40$17.40 ($1.09$1.09 / Fl Oz) $16.53$16.53 ($1.03$1.03 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 17.4,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/VITA-MYR-Zinc-Plus-Herbal-Mouthwash-Ounce/dp/B000VY20B2",
        "soldBy": {
            "sellerID": "A1QK1RWA1LZXGM",
            "name": "VITA-MYR Natural Products",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1QK1RWA1LZXGM&asin=B000VY20B2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "28",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-lzyfsp0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31MCUY7GmXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31F2zsOC1BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31aGyFzie2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31xC0JKaeML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21-SWjyGNdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81XImhNKLkL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e68bd9b-b046-410c-aa17-4a9f9d454f54/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9e99f25f-c478-467a-8ba8-a28202cfb446/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: VITA-MYR",
            "link": "https://www.amazon.com/VITA-MYR/b/ref=bl_dp_s_web_2603356011?ie=UTF8&node=2603356011&field-lbr_brands_browse-bin=VITA-MYR"
        },
        "brand": "VITA-MYR",
        "merchantInfo": "VITA-MYR Natural Products",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 258,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 3 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Herbal Powerhouse: Our Zinc-Plus Xtra Mouthwash combines the power of potent herbal extracts help to deliver a natural and invigorating oral care experience.",
            "Enhanced with Zinc: This mouthwash is enriched with zinc, a vital mineral known for its role in supporting oral health. Zinc helps to maintain a healthy pH balance in the mouth",
            "Alcohol-Free and Gentle: Unlike many commercial mouthwashes, VITA-MYR Zinc-Plus Xtra is alcohol-free, making it a gentle option that won't cause dryness or irritation. Instead, it offers a soothing and refreshing sensation, leaving your mouth feeling clean and revitalized without any harsh side effects.",
            "The carefully selected herbal extracts work together to provide a long-lasting and pleasant minty freshness that keeps your breath confidently fresh throughout the day.",
            "We understand the importance of using safe ingredients in your oral care routine. VITA-MYR Zinc-Plus Xtra Herbal Mouthwash is free from harsh chemicals, artificial flavors, and colors. It is made with carefully chosen herbal extracts and minerals, ensuring a gentle yet effective formula that you can trust."
        ],
        "description": "No Sugar, No Fluoride, Gluten Free, SLS Free No Alcohol, No Saccharin No Artificial Sweetener/Color ,Made in USA. Introducing VITA-MYR Zinc-Plus Xtra Herbal Mouthwash (16 Ounce) - a premium oral care solution formulated to provide you with a refreshing and effective mouth-cleansing experience. With its unique blend of herbal extracts and essential minerals, this mouthwash offers a host of benefits to promote a healthy mouth and confident smile.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b?ie=UTF8&node=3760901"
            },
            {
                "name": "Oral Care",
                "link": "https://www.amazon.com/Oral-Care-Products/b?ie=UTF8&node=10079992011"
            },
            {
                "name": "Mouthwash",
                "link": "https://www.amazon.com/Mouthwashes/b?ie=UTF8&node=3778161"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 8.3 x 2.5 x 2 inches; 1 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ hfs-koi-zk-a9163"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 688928000014 885305292752 885781283626"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ VITA-MYR International Corp"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B000VY20B2"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#118,179 in Health & Household (See Top 100 in Health & Household) #481 in Mouthwashes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 258 ratings"
            },
            {
                "name": "Brand",
                "value": "VITA-MYR"
            },
            {
                "name": "Product Benefits",
                "value": "Soothing,Cleansing,Fresh Breath"
            },
            {
                "name": "Liquid Volume",
                "value": "16 Fluid Ounces"
            },
            {
                "name": "Flavor",
                "value": "Herbal"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sun Girl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4HUG3GDZANS3NEYJWT6LDWGVCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12NA8GT2IRLPF?ASIN=B000VY20B2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2019",
                "reviewTitle": "5.0 out of 5 stars Best Products EVER - READ MY STORY BELOW !!",
                "reviewText": "I absolutely LOVE Vita-Myr Toothpaste and Mouthwash, I have been using this product for years and it is so amazing. Over 20 years ago when I lived in a different State I went to a Health Store and talked with a Nutritionist/Owner.. I had just been diagnosed with the Gum Disease \"Periodontal Disease\" and was having some very painful treatments done where they scrape your roots down, you have one side treated then go back a month to 2 later for the other side, my side of the face being treated was bruised and swollen, this happened every time they did this treatment on both sides. After you go thru that, you have to have cleanings every 3 months and the insurance does NOT cover all of those treatments, so it is a lot of out of pocket expense to your pocket book. Shortly after I was having my treatments, My husband was also diagnosed with the same issue, so as you can imagine the costs were adding up. The Nutritionist I spoke to told me to buy the Vita-Myr toothpaste and Mouthwash and use it faithfully and come back to see her in 3 months and give her a report, she told me outright when you go back for your follow up appointment they are going to see a HUGE change at the Dentists. I did as she instructed and so did my Husband and low and behold, our next follow up was MUCH IMPROVED. Moving on to 6 months later, we had NO TRACE of this Gum Disease anymore. My Dentist insisted that this couldn't work and that we would need to continue our treatments - well about 6 months later of treatments and using the vita-myr toothpaste we moved to another state. We then found a new Dentist and I went in for a cavity to be filled and they didn't mention ANYTHING about my \"periodontal Disease\" I asked them when I had my cleaning, do I have any issues and they said NO your gums are really healthy, everything looks great. 6 Months later I went to a NEW Dentist and asked the same questions and so did my Husband and while they did the routine cleaning they told both of us, your gums and teeth look so healthy you obviously take GREAT care of them...I looked at my Husband and smiled, I asked them after explaining to about the previous Gum Disease if they saw any trace, they said NO! All these years we have faithfully used this product and recommended it to numerous others with the SAME ISSUES and they received the SAME results. My sister's 2 little children had an issue with their teeth, their teeth were soft and the Dentist wanted to cap them to strengthen them, they were just getting ready to do this expensive process when I asked her to try the toothpaste and mouthwash FIRST - well she did FAITHFULLY for 3 months and GUESS WHAT??? The kids went back to the Dentist and their teeth were GREAT, they no longer required that expensive procedure. So do I believe in this product?? YES - YES and YES - It is worth the price and worth the RESULTS - You will save so much money in Dental if you use this faithfully. I am a HUGE fan and BELIEVER of the Vita- Myr Toothpaste and Mouthwash. I will also mention that when I was traveling I ran out of toothpaste and had to go to the store and purchase a regular brand I had used years and years ago so we had something until we got back home, both my Husband and I experienced this - the STORE BOUGHT toothpaste actually made our teeth ache after using it for a few days??? We tried this again a few years later to test it and received the SAME RESULTS - so that is VERY TELLING about Store Bought Toothpaste on the Market. I swear by the Vita-Myr Products and \"NO\" I don't work for them - I SHOULD... LOL... Because I believe in their product 100%.",
                "reviewVotes": "49 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeremy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZZXMRFZFJW2AP5KVOLEPT3ECNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU5SVCOS7HL90?ASIN=B000VY20B2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "You can definitely taste the cloves. I was expecting the taste to be worse but actually it wasn’t bad at all! It’s a little spicy but it works well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AndreaAndrea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE356CU62LEXEZX5G5FG22ZGO7CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PP4MW5G0VRT2?ASIN=B000VY20B2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars Very effective mouthwash",
                "reviewText": "Love it .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Bkw01lE6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary A. Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZYLWHYCOMS7E4DWDETZ62GJPPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YTGIOA0SLB9I?ASIN=B000VY20B2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2021",
                "reviewTitle": "5.0 out of 5 stars I have been using this product for well over two years, it's a good one.",
                "reviewText": "What makes this product good, is the fact that it has:1. Zinc , 2. Myrrh in the product, and 3. Cloves. Some people maybe put out by the taste of the myrrh or cloves, but they HELP with gum issues in a way that no other product can. If you have bleeding gums or receding gums, you might find this mouthwash helpful. If you have mouth sores (canker sores), or other issues due to dental appliances (braces, etc) this acts like a balm to heal much of the pain without guzzling down ambisol which has proven to dangerous in large amounts. So use something that won't cause your body further harm, eh? It really is a good product. It is not sweet. It doesn't taste \"minty fresh\", but your mouth will thank you!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Poole14",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVYPMXQTJ7S563FBH4G5HUDDIOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SSL6A1ZIOYYQ?ASIN=B000VY20B2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Great all natural mouthwash!",
                "reviewText": "This is my favorite mouthwash! All natural clean ingredients. I love it, and always keep myself stocked up. Because it has zinc in it, I also make sure to gargle with it if I feel a tickle a tickle in my throat of something coming on, as zinc helps kill off impending infections!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUMK7W2ZK2P5UXALOJ6USCLERXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31TEATOI6XRBA?ASIN=B000VY20B2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "Will buy again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Owen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJLDPKCJYXPVKE2LLQZM2YLI5XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B88MM6R5TN9L?ASIN=B000VY20B2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 29, 2018",
                "reviewTitle": "5.0 out of 5 stars Miracle mouth wash!!",
                "reviewText": "I've been buying this and the toothpaste for several years now and I can't live without it. It has done amazing things to my teeth and guns. No more bad checkups with the dentist. I even received a compliment on how pretty my teeth are from the DENTIST himself. I was shocked. People tell me I have pretty teeth all the time, but I've never received that compliment from a dentist lol. This mouthwash and the toothpaste makes my guns feel alive. I will never buy ordinary store bought again.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD7BMCT44FJ6VDKEKTOOOUIJK6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31TY29TH1T90E?ASIN=B000VY20B2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2011",
                "reviewTitle": "5.0 out of 5 stars VitaMyr Mouthwash",
                "reviewText": "I came across VitaMyr mouthwash in my personal search for a less toxic product to improve my dental and gum health. I first came across VitaMyr Herbal Mouthwash at a local health food co-op. It was a little pricey but I brought a large bottle and committed to using it as directed. I have now used this product for more than 3 years. My visits to the dentist and the hygenist continually confirm that this is truly the best product for creating and maintaining excellent gum health. For me, buying this product online is cheaper and more cost effective than making a trip to the food co-op or health food store only to find they are sold out. My online order always arrives in just a couple of short days.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}