{
    "remaining_requests": 24052,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TheraBreath-Breath-Mouthwash-Peppermint-Alcohol-Free/dp/B001GLCES8",
    "body": {
        "name": "TheraBreath Fresh Breath PLUS Mouthwash, Peppermint Flavor, Alcohol-Free, 16 Fl Oz (Pack of 2)",
        "price": "$24.74$24.74 ($0.77$0.77 / Fl Oz) $22.13$22.13 ($0.69$0.69 / Fl Oz)",
        "originalPrice": "$27.99",
        "rawPrice": 24.74,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TheraBreath-Breath-Mouthwash-Peppermint-Alcohol-Free/dp/B001GLCES8",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41PUQOcVmaL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51xy1v9VkUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JYjlkLpIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CV6AB94TL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41eq-q7azDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qkY6YPZzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61MVOh5bAGL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f7d2421a-37c7-4929-900a-6a5e979a604f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3cd91685-eb38-48d2-9f0d-067785f806e1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3868ba08-b787-4716-9e1d-9f5987acd3d3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f4741f96-fc07-4b8b-acb3-175aa746a347/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the TheraBreath Store",
            "link": "https://www.amazon.com/stores/TheraBreath/page/A74A7B4A-2AB9-44CF-AE32-F38B57B2C604?ref_=ast_bln"
        },
        "brand": "TheraBreath",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3412,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 25 - 27 on orders shipped by Amazon over $35",
            "Or fastest delivery February 20 - 22",
            "FREE delivery February 25 - 27 on orders shipped by Amazon over $35",
            "FREE delivery February 25 - 27 on orders shipped by Amazon over $35",
            "Or fastest delivery February 20 - 22",
            "FREE delivery February 25 - 27 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fight Bad Breath: Our maximum-strength dentist-formulated mouthwash targets sulfur-producing bacteria to help fight severe bad breath by blending a higher concentration of OXYD-8 with Zinc Gluconate*, Green Tea Extract, Tea Tree Oil, Aloe Vera, and Xylitol. Freshens breath for up to 24 hours",
            "A Note on Zinc: This oral rinse is designed to help with halitosis. Each dose of oral rinse is supplemented with 2.5 mg of zinc for this specific purpose. Any use outside of this indication is at the user’s discretion. We do not claim or suggest any additional benefit",
            "Premium Oral Care: Our solution-oriented line of toothpastes, mouthwashes, breath sprays, tonsil stone kits, and more can help your whole family get the oral hygiene support you need",
            "Professional-Grade Products: TheraBreath's line of dentist-formulated toothpastes, mouthwashes, and other products are designed to help address halitosis, cavity prevention, gum disease, and more",
            "Trusted Quality: Started in 1994 by dentist Dr. Harold Katz, TheraBreath has continued to innovate, delivering an extensive line of the highest-quality oral care products for you and your family"
        ],
        "description": "Considered by many dentists to be one of the most powerful and effective oral rinse products for combating bad breath, TheraBreath PLUS Maximum Strength Fresh Breath Oral Rinse is dentist formulated to fight even the worst cases of bad breath. Previously available only through our website and dental offices, this dentist-recommended extra-strength oral rinse for fresh breath is now available directly to the consumer through Amazon. TheraBreath PLUS Oral Rinse is loaded with powerful ingredients that neutralize odor-causing bacteria, food odors, and morning breath. It has been clinically tested to be effective for up to 24 hours when used as directed. This rinse includes xylitol, green tea antioxidants, aloe vera, tea tree extract, and a refreshing Peppermint flavor. A maximum-strength mouthwash with minimal burn, TheraBreath PLUS Oral Rinse contains no alcohol, artificial flavors, or colors. This mouthwash is also certified kosher, gluten-free, and vegan. Xylitol and green tea are among nature’s most powerful antimicrobials and have been shown to be extremely effective at eliminating various anaerobic sulfur-producing bacteria that can cause severe bad breath. These ingredients make TheraBreath PLUS our most powerful and most effective formula for the prevention of embarrassing breath odor. This product is sold as a pack of two 16-ounce bottles and is available in Peppermint flavor. As with all our products, TheraBreath PLUS is guaranteed to work to your satisfaction or your money back!",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Oral Care",
                "link": "https://www.amazon.com/Oral-Care-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10079992011"
            },
            {
                "name": "Mouthwash",
                "link": "https://www.amazon.com/Mouthwashes/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3778161"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 5.5 x 2.75 x 8 inches; 2.08 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 697029011607"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 697029011607"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Church & Dwight - TheraBreath"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B001GLCES8"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,200 in Health & Household (See Top 100 in Health & Household) #141 in Mouthwashes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,412 ratings"
            },
            {
                "name": "Brand",
                "value": "TheraBreath"
            },
            {
                "name": "Product Benefits",
                "value": "Fresh Breath,Freshening"
            },
            {
                "name": "Liquid Volume",
                "value": "16 Fluid Ounces"
            },
            {
                "name": "Flavor",
                "value": "Fresh Mint Flavor"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4513a300-03b0-48ae-b66e-80abb37459a4.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/23f9ec02-6a49-4c5c-97e3-91ed4f57343b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5cdad7b2-d99f-4d64-b5e1-ff76a4c6adba.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c772a567-2ac8-40ba-9abd-c5aafa029292.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f51151ee-dd8a-4c39-89ef-08b6cf3894f0.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3852c253-0c33-4365-9ca0-18cb9912da14.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/983e76a7-3632-45a5-afe0-11b1f27b19b7.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e45f307c-48b4-4c4a-82c3-ae8239e83fbf.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5d1961a-654d-487f-97ff-82507b604366.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/81c93397-aa54-44c5-9482-fcc233a78597.__CR0,0,220,220_PT0_SX220_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "mikebrown81",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE32FLCREZ2ZBBRYGRL7IT6DIOPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UXI9E76VVN87?ASIN=B001GLCES8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2023",
                "reviewTitle": "5.0 out of 5 stars This stuff works",
                "reviewText": "In my life I have tried many different mouthwashes - starting with Listerine, until I finally decided the burn and the gross taste didn't necessarily provide superior benefits. I used mouthwashes that were supposedly good for dry mouth for years. Then I noticed a coupon for TheraBreath Plus on Amazon. The coupon offered a decent discount and the ad made some bold claims so I bit. It is difficult to smell one's own breath unless there is a really serious problem but, after several years of continuous use, my mouth has never felt cleaner. I rinse in the morning and immediately before going to bed. I never get up with a gross aftertaste in my mouth before brushing and rinsing in the morning. I have caught myself not brushing and rinsing in the morning because my mouth felt refreshed. Whatever is in this stuff does the trick - as advertised. My mouth feels fresh all day. I'll offer one small admonition. The instructions indicate using a capful. A capful is wasteful. I use less than half that amount and obtain very good results. Just swish it around in your mouth a little longer. The stuff is too expensive to be using a capful at the time.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hannah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIPTBK6FXHMGM6326YRUK3DGBAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29BTA3365YHFJ?ASIN=B001GLCES8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Kills EVERYTHING",
                "reviewText": "Its expensive, it burns even the back of your eyeballs, BUT sure as hell THIS will clean your mouth like NONE OTHER! :)",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bennet G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMUMX3XTVRMT4GKP7GNULWWVGRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N1DKZZUXLURM?ASIN=B001GLCES8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 21, 2015",
                "reviewTitle": "5.0 out of 5 stars Your breath sticks and you need this today.",
                "reviewText": "Seriously just buy this! I've been using this for 2 days so far, and my breath doesnt smell and it stays that way for the rest of the day YESSSSS. I'm someone who cannot stand when people have reeking breaths. i posted on my snapchat telling all my friends to do themselves a favor. hahaha. I use an OraBrush tongue scraper and that does a great job of cleaning my tongue before I brush. Then I use a regular toothbrush with Crest 3D white and that does a pretty good job of cleaning my teeth (and help them stay white longer). I rinse my mouth of toothpaste foam and use whatever toothpaste is left on the brush to give my tongue a additional scrub. That pretty much takes care of my whole mouth.But the reason why I had been searching for a breath savior was because I would still have germs, etc on my tonsils and throat where you cannot get at with a brush which would cause my breath to stink really bad after a few hours. Sure you can just use regular mouthrinse but i find that those were usually full of alcohols and basically just burn off a layer of cells (and i guess some germs along with it). Their effect dont last either. But this TheraBreath rinse is basically the evolution of mouthwash. It is slightly minty which I find very pleasant. Less minty than Dentyne ice gum if you need a comparison. It feels very smooth in your mouth that doesnt foam up which is great for gargling. By smooth i mean like the consistency of oil? (but definitely nowhere near as thick). The instructions say to measure the amount with the little shot cup provided and rinse for 1 min. I probably just do like 30 seconds. spit and measure another shot to gargle with. I do that. It doesnt burn my tonsils or throat. its very comfortable. I do find that it leaves a slight aftertaste of like licorice(?) that i find weird but very bearable.One thing I HATE about this product is the cap design. So the gray bottle has a regular cap you would find on something like Vitamin Water. and the shot cup for measuring just clicks on top of that. So it is veryyyyyyy annoying to have to uncap the shot cup, and then hold that somehow while your other fingers try to twist off the actual cap. I wish they would just use the shot cup as the cap directly.I cant believe I wrote paragraphs on paragraphs about mouthwash... (if you are the seller, can you consider sending me extra bottles as a thank you? please? thanks)",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCXYN3VR6HER5CQNUFTNWYQ4VLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O0WG5VM18IIU?ASIN=B001GLCES8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Excellent but pricey",
                "reviewText": "Best mouthwash I've tried--most effective dental mouthwash I've tried and with a decent taste. I find that zinc is a key ingredient for me. However, it's pricey so in the future I think I'll just add some liquid zinc to the cheaper Icy Mint version.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWEVPP2UKSPV43A7HJEW6SRA6YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GEVQKOXXAJRW?ASIN=B001GLCES8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 10, 2016",
                "reviewTitle": "5.0 out of 5 stars I battled with bad breath/halitosis for a very long time",
                "reviewText": "I am going to copy this same review for the mouthwash. But I wanted to give a thorough review of my experience with this product. I battled with bad breath/halitosis for a very long time. I wasn't the most diligent brusher wear i wouldn't brush twice a day. I try to but i would forget before i go to sleep. But basically my routine would be brush my teeth with \"all natural\" toothpaste and all natural mouthwash. But they did not cause my breath to smell fresh for a long time. So what I tried to do was use the scope tooth picks and place a dime of therabreath in my mouth so when i floss my teeth the toothpaste and the scope toothpick would go between my gums and make it smell nice. I followed with brush my teeth normally and along my gums, inside my teeth. I would use my tongue cleaner and thoroughly brush it until it was clear. I followed up with the TheraBreath plus mouthwash I would swish it around as instructed for one minute. Spit it out and fill another capful for my throat for 30 seconds and spit it out. I must say this actually worked for me. I've bought many toothpaste and mouthwash over the years and they didn't last as long as this product. As a test and my friends laugh at me for this but i place my finger in the back of my upper and bottom rows because they notoriously smelled before because of food and bacteria. There was no smell and i lick my hand with my tongue and smell it. There is no bad odor. So finally after years i found something that actually works for me. I know it's working great because I am able to speak to my colleagues face to face and i don't see them move there faces away when they talk to me directly. That's what made me want to really take care of my mouth because that is embarrassing. I don't work for the company and i rarely do reviews but I really love this product. And when I woke up the next morning and did the same thing my tongue, mouth and teeth did not smell. So i've really been using this product for a while. I think one of the things I improved on was gargle the mouthwash in my throat because it says your throat could be the source of bad breath aside from your tongue. I believe it and I don't need to use coconut oil or salt remedies anymore. This does the trick for me and I highly recommend using the product. As someone who as battled bad breath or people turning there heads i know that it works so give it a shot.",
                "reviewVotes": "95 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna Richey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXRMXOO2J5LHQIWXEXS22NRGJNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14O93MMBL81LB?ASIN=B001GLCES8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "5.0 out of 5 stars It Works!",
                "reviewText": "We tried this for my husband and we are very satisfied. Worked after about 2 weeks of using!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gina D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESUNMLNCHSZAYMX3U3IQXXE6QXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3J2SYR7PI7SPR?ASIN=B001GLCES8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Best one yet",
                "reviewText": "Amazing 10/10",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NikkiNikki",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 26, 2021",
                "reviewTitle": "Short shelf life",
                "reviewText": "Product is good. Keeps the breath fresh the whole day. But very short shelf life (Exp. May 2021)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/A14BHgtDKhL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on September 12, 2021",
                "reviewTitle": "The only thing that works",
                "reviewText": "Really works and this is a really good price compared to the dentist's price. I usually find it cheaper on iherb but they've been out of stock for months.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sonny ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 31, 2019",
                "reviewTitle": "Great product",
                "reviewText": "Great product immediate result",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LYW",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on April 27, 2022",
                "reviewTitle": "Strong peppermint flavor",
                "reviewText": "First time using the Max Strength Peppermint flavor. Although the peppermint flavor is strong, it does somehow, irritate my gum after swishing it for a minute. As such, I will be switching back to the Clean Mint flavor.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Page",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 17, 2021",
                "reviewTitle": "Do not waste your money. Yuck. Tastes like plastic",
                "reviewText": "I read some reviews that this is better than the original therabreath so I thought I'd give it a try and I didn't realize the price I paid for was for an original size bottle. Thought I was paying for 2 really big bottles. So that was a bummer. But also I will never buy this kind again. There was no mint flavor at all. It was like I was swishing around the taste of an intex pool around in my mouth. Did not help me feel like I was actually cleaning my mouth.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}