{
    "remaining_requests": 374,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Blink-Mini-White-1Cam/dp/B07X6C9RMF",
    "body": {
        "name": "Blink Mini – Compact indoor plug-in smart security camera, 1080p HD video, night vision, motion detection, two-way audio, easy set up, Works with Alexa – 1 camera (White)",
        "price": "$19.99",
        "originalPrice": "$29.99",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Blink-Mini-White-1Cam/dp/B07X6C9RMF",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BWD4WGJB"
        ],
        "asinVariationValues": [
            {
                "asin": "B09N6V1FHG",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01JRptgu8MS._SS36_.jpg"
            },
            {
                "asin": "B07X6C9RMF",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/0178+pOzqyS._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41iTPY6vIwL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31k4JysPQ5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iQH85g1MS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jqOZv4m-S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Wb-56yPIS.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Blink Store",
            "link": "https://www.amazon.com/stores/Blink/page/C5DECBBE-4F56-4C36-B933-E62144578691?ref_=ast_bln"
        },
        "brand": "Blink",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 275627,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 22 hrs 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Monitor the inside of your home day and night with our 1080P HD indoor plug-in smart security camera with motion detection and two-way audio.",
            "See, hear, and speak to people and pets in your home from your smartphone with Blink Mini’s live view and two-way audio.",
            "Get alerts on your smartphone whenever motion is detected or customize motion detection zones so you can see what matters most.",
            "Use Mini as an indoor plug-in chime for Blink Video Doorbell. Hear a real-time alert from Mini when someone presses your Video Doorbell.",
            "Choose to save and share clips with a free 30-day trial of the Blink Subscription Plan or locally with the Sync Module 2 (sold separately).",
            "Set up in minutes — plug in the camera, connect it to wifi, and follow the instructions in the free Blink Home Monitor app.",
            "Works with Alexa — pair Blink Mini with a supported Alexa-enabled device to engage live view, arm and disarm your camera, and more using your voice.",
            "Include 1 Blink Mini camera (white), mounting kit including stand, USB cable, and power adapter."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Field of view",
                "value": "110° diagonal"
            },
            {
                "name": "Camera resolution",
                "value": "Record and view in 1080p HD video during the day and with infrared HD night vision after dark"
            },
            {
                "name": "Camera frame rate",
                "value": "Up to 30 frames per second"
            },
            {
                "name": "Size",
                "value": "2 in. x 1.9 in. x 1.4 in. (50 mm x 49 mm x 36 mm)"
            },
            {
                "name": "Weight",
                "value": "1.7 ounces (48 grams)"
            },
            {
                "name": "CPU",
                "value": "Immedia Proprietary – AC1002B, 4 cores / 200 MHz"
            },
            {
                "name": "Power",
                "value": "2 meter micro USB and power adapter, electrical rating: 100-240V 50/60 HZ 0.15A"
            },
            {
                "name": "Wifi connectivity",
                "value": "Supports 2.4 Ghz 802.11g/n; does not support connecting to ad-hoc (or peer-to-peer), or paywall wifi networks. Minimum 2 Mbps upload speed required."
            },
            {
                "name": "Available colors",
                "value": "White, Black"
            },
            {
                "name": "Minimum smartphone requirements",
                "value": "iOS 14.0, Android 6.0, and Fire OS 7"
            },
            {
                "name": "Blink app",
                "value": "Blink Home Monitor"
            },
            {
                "name": "Included in the box",
                "value": "Blink Mini camera (dependent on quantity selected), 1 stand (attached), 2 mounting screws (per camera), 1 USB cable, 1 power adapter"
            },
            {
                "name": "Audio",
                "value": "Speaker output and 2-way audio recording"
            },
            {
                "name": "LEDs",
                "value": "One blue LED to help you know when it’s active (optional)"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty and service included. Use of Blink cameras is subject to the terms found here."
            },
            {
                "name": "Support",
                "value": "Click here to view more information on the Blink Mini support page."
            },
            {
                "name": "Generation",
                "value": "1st generation – 2020 release"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lauren Holmes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXOJ3G2EB2JKXI3KUSFVFWZNV3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R114THIKY3P50Y?ASIN=B07X6C9RMF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for baby/kids camera",
                "reviewText": "Great little camera to keep in an in room that you would like to monitor, especially for babies & young children. Great little camera to keep in an in room that you would like to monitor, especially infants and young children. Easy to set up and move around as needed. Has different options and great for alerts that you can connect to your other Alexa devices in your home and or on your cell phone and smart watch has live feed of video, and a great feature in which you can talk and be heard on the camera, which has been great, while trying to train my toddlers to remain in their bedroom at night. Great price and I have had it for about 2 to 3 years and have moved multiple times , so pretty durable, and easy to set up",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPVHD3XPOOLS2LAU2WBWB75NCMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B10J5SXGF5S4?ASIN=B07X6C9RMF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Blink Mini: Compact Security, Corded Convenience – A User's Take",
                "reviewText": "Dive into smart security with the Blink Mini – your compact indoor watchdog in a sleek black package. Offering 1080p HD video, night vision, and two-way audio, it's a powerhouse for monitoring your home day and night.Here's the lowdown – it's smaller, but the wire can be a bit of a drag. A trade-off, really. Personally, I lean towards the battery-operated version for its flexibility, but this one has a key advantage – no battery anxiety. No worrying about the battery going dead; it's a plug-and-forget situation.The setup is a breeze – plug it in, connect to WiFi, and follow the app instructions. Now, about that wire – if your outlet is close, this is a worry-free choice. No more stressing about windy days draining your battery. But if you're dealing with more wires than you'd like, the battery-powered Blink might be your hero.In a nutshell, it's all about the outlet proximity. If it's right there, go for this one; no fuss, no frills. If you need more flexibility, the battery version is your go-to. Security made simple!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EdwardEdward",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETI4YIJOAKQVOMZ4ROSIIJ7VYZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J7W5YWBGGL8H?ASIN=B07X6C9RMF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Blink Mini Compact Indoor Camera: Effortless Security, Everywhere",
                "reviewText": "The Blink Mini Compact Indoor Camera has become an invaluable addition to my home security strategy, providing not only ease of use but also a discreet and effective solution for safeguarding my space.Setting up the Blink Mini was an absolute breeze. The user-friendly interface and straightforward installation process made the initial setup a seamless experience. Within minutes, I had the camera in place, connected to the Blink app, and ready to go. The simplicity of the setup was a pleasant surprise, eliminating any intimidation one might associate with installing a security camera.The confidence that the Blink Mini instills in securing my home is truly unmatched. Its compact design allows me to discreetly place it near everyday objects, ensuring that it doesn't disrupt the aesthetics of my living space. The Blink Mini seamlessly blends into its surroundings, making it an inconspicuous yet powerful guardian.Having strategically placed several Blink Mini cameras throughout my home, I appreciate the comprehensive coverage they provide. From the living room to the hallway, each camera discreetly keeps watch, offering a 24/7 layer of security that enhances the overall safety of my home.The Blink Mini's subtle presence doesn't compromise its effectiveness. The camera captures clear footage, and the motion detection feature ensures that any unusual activity triggers an instant alert. It's a discreet but powerful layer of protection that allows me to keep an eye on my home without invading its privacy.In conclusion, the Blink Mini Compact Indoor Camera has exceeded my expectations. From its easy setup to the confidence it provides in securing my home, it's a must-have for anyone seeking an unobtrusive yet effective home security solution. Highly recommended for those who value simplicity, reliability, and the peace of mind that comes with knowing your home is discreetly protected.",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Fdf+qZYAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717vu9zMC+L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janelle K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA7IEZMXYV6PCJ5UB7Y7GYSPNYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JXHF8DCOACQM?ASIN=B07X6C9RMF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Absolute NIGHTMARE to set up",
                "reviewText": "Update : I finally did manage to get 4 of my 6 cameras set up (haven't unboxed the last 2 yet). It took approximately 6 attempts for each camera to connect to my wifi. I have no idea why.The video quality is decent. However the audio quality is questionable at times. I also wish that I could record longer than 30 seconds for motion events as the camera doesn't retrigger quickly enough to keep recording if there is motion past the 30 second window.Other than that they have been a great help to keep an eye on my dogs and house while I am away. I just wish they weren't so mentally draining to set up.Bought these to keep an eye on my house while I'm away. Never had so much buyers remorse over a purchase as I do with these.After fighting with an immediate failed connection attempt 9 times in a row on one of the two cameras, I went to google and discovered that the Xfinity Gateway router needs to have the wifi bands separated to 5ghz and 2.4ghz. I did that, managed to get one to connect after 4 attempts, still cannot get the second one to connect to the same network 14 tries later.I've tried everything the help article stated. Nothing works. Literally nothing. It's 9pm and I'm not going to bother calling support at this point. These are likely going back in the box and back to Amazon. This is obnoxious. I've done every single step the exact same way as the camera I did manage to connect and this second one just will not do it, no matter what I try.Taking everything in me to not throw my phone across the room every time the \"Failed to connect\" message pops up. Their troubleshooting page is absolute hot garbage for help with this issue.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jesus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 25, 2021",
                "reviewTitle": "Muy sencilla de conectar",
                "reviewText": "Me gusta la simplicidad de conexión , no me gusta que no se puede expandir a que grabe en Dvr.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leonardo VazquezLeonardo Vazquez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 21, 2021",
                "reviewTitle": "No existe Skill de Alexa para México",
                "reviewText": "En ninguna parte advierte que la compatibilidad con Alexa esté supeditada al país. Por lo que, no cumple con lo que ofrece",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61V+HkkN7RL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}