{
    "remaining_requests": 31903,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/J-2000-Jiffy-Garment-Steamer-Plastic/dp/B0000665TD",
    "body": {
        "name": "Jiffy Steamer J-2000 Jiffy Garment Steamer with Plastic Steam Head, 120 Volt, Beige",
        "price": "$229.00",
        "originalPrice": "",
        "rawPrice": 229.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/J-2000-Jiffy-Garment-Steamer-Plastic/dp/B0000665TD",
        "soldBy": {
            "sellerID": "ADC1NCMHG8KHV",
            "name": "Global industrial Sewing Supplies",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ADC1NCMHG8KHV&asin=B0000665TD&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00BZTTR7W"
        ],
        "asinVariationValues": [
            {
                "asin": "B000B6QCAA",
                "variationName": "Style",
                "variationValue": "Metal Steam Head",
                "price": "$270.87",
                "variationImageURL": ""
            },
            {
                "asin": "B003UC4WMW",
                "variationName": "Style",
                "variationValue": "Metal Steam Head in Pink",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0000665TD",
                "variationName": "Style",
                "variationValue": "Plastic Steam Head",
                "price": "$229.00",
                "variationImageURL": ""
            },
            {
                "asin": "B00BQOZX9C",
                "variationName": "Style",
                "variationValue": "Plastic Steam Head in Pink",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31EsaPh1dOL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51HJfCUhINL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JuesD5OTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HD5AqoQjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41m9d-3GZyL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Jiffy Steamer Store",
            "link": "https://www.amazon.com/stores/JiffySteamer/page/8E86D935-AA78-499D-A625-02AE8BEAE8E4?ref_=ast_bln"
        },
        "brand": "JiffySteamer",
        "merchantInfo": "Global industrial Sewing Supplies",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 4037,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 20 - 22."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1300 watt solid brass heating element (120 volt for North America use only…not for export)",
            "High-impact plastic outer housing for durability",
            "Quick two minute heat-up time.6 inches wide plastic steam head.Cord Plug: NEMA 5-15",
            "1.5 Hour steam time per filling. Water Capacity: 3/4 galloon / 2.84 litres. Fusible link with automatic shut-off for safety",
            "Made in the USA",
            "Quick two minute heat-up time.Carton dimension: 18 inch x 12 inch x 17 inch / 45.7 cm x 30.4 cm x 43.1 cm,Assembled dimension: 15 inch x 10 inch x 64 inch / 38.1 cm x 24.4 cm x 162.5 cm",
            "1.5 Hour steam time per filling"
        ],
        "description": "Diminish the most difficult wrinkles in one swipe with this easy touse professional Jiffy garment steamer. This de-wrinkling steamer comes with a five-foot flexible hose and a no-drip valve system to steam most any fabric. This garment steamer does heavy-duty work without taking up much space in your closet. Wheels on the bottom of the unit allow for ease of mobility of the unit, while the length of the steamer hose allows for ease of movement while using the steamer. Say goodbye to wrinkles when you say hello to this professional but affordable garment steamer. The large water reservoir ensures that you are able to steam multiple items at once without needing to refill the reservoir often. Each fill allows you to use the steamer for over an hour ate time. The steamer is ready to use in just one minute to ensure your outfits can be wrinkle-free in just a moment's notice. Brand: Jiffy J Includes: Five-foot flexible hose, plastic steam head and handle, easy-roll casters for mobility Materials: Brass, copper, plastic, steel Settings: On/Off switch heats up in one minute, no-drip check valve system Type: Steamer Color: Grey Wattage: 1300 Capacity: 0. 75 gallon water reservoir Model: 1221 Dimensions: 10 inches deep x 15 inches wide x 64 inches high 1. 5 hours steaming time Ideal for home or commercial use",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Garment Steamers",
                "link": "https://www.amazon.com/garment-steamers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510248"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Jiffy Steamer"
            },
            {
                "name": "Color",
                "value": "Beige"
            },
            {
                "name": "Product Dimensions",
                "value": "15\"L x 10\"W x 64\"H"
            },
            {
                "name": "Style",
                "value": "Plastic Steam Head"
            },
            {
                "name": "Wattage",
                "value": "1300 watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Heat Time",
                "value": "2 minutes"
            },
            {
                "name": "Capacity",
                "value": "2.84 Liters"
            },
            {
                "name": "Item Weight",
                "value": "15.87 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Jiffy Steamer"
            },
            {
                "name": "ASIN",
                "value": "B0000665TD"
            },
            {
                "name": "Item model number",
                "value": "1221"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 4,037 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#56,673 in Home & Kitchen (See Top 100 in Home & Kitchen) #41 in Garment Steamers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Maximum recommended load",
                "value": "17 Pounds"
            },
            {
                "name": "Finish types",
                "value": "Brass"
            },
            {
                "name": "Care instructions",
                "value": "Keeping your Jiffy Steamer clean ensures it will provide years of satisfactory performance for you, your household or your business. Follow the cleaning instructions in your owner's manual."
            },
            {
                "name": "Specifications",
                "value": "certified frustration-free"
            },
            {
                "name": "Assembly required",
                "value": "Yes"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "3 year warranty."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Steamer Base, Rod Set, Steam Head and Hose"
            },
            {
                "name": "Import",
                "value": "Made in USA"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Jiffy J-2000 Jiffy Steamer Jiffy Steamer offers clothing steamers, steaming products & steamer accessories. Made in the USA since 1940. Color-coded high temperature wiring Fusible link with automatic shut-off for safety 7' power cord with molded storage clip for more manageable handling 360 degree swivel casters for mobility Jiffy Personal Clothing Steamer with Standard Plastic Steam Head The Jiffy Steamer J-2000 quickly and efficiently removes wrinkles from most fabrics and is perfect for home or light commercial use. Not only is ironing a cumbersome and time-consuming process, it also can gradually destroy clothing fibers. These images show a magnified wool sample after one minute of ironing using the proper heat setting and a top-of-the-line residential iron. In just one short ironing session, the fabric fibers appear distorted and crushed. 1300 watt solid brass heating element (120 volt for North America use only) 1.5 hours steam time per filling Ready to steam in 1 minute High-impact engineered polymer outer housing for durability All brass couplings \"No-spill\" check valve cap",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d9296217-e3e3-40a3-bb96-c242220fc57c._CR0,0,300,400_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f4efeb98-ccd8-41f8-aaa7-6d4dcf3f3263._CR0,0,350,175_PT0_SX350__.jpg"
                ]
            },
            {
                "media_text": "Steaming Clothing The J-2000 removes wrinkles from clothing quickly and easily. Steaming Tip Hold the fabric taut with one hand while pressing the steam head directly on the fabric. 6\" Wide Standard Plastic Steam Head Steaming slacks is easy when clipped to a hanger at the hem. Personal Clothing Steamer The Personal Clothing Steamer has 360° casters for easy mobility. The water container is easy to fill in a shallow sink and will steam for 90 minutes per filling.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b8c67768-250b-4c98-898e-2f594d97d4d5.__CR0,47,515,515_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/84965365-b73b-4ebd-acbc-b040c30823be.__CR0,0,3639,3639_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/5fd1250b-fb08-4bf4-b640-eb1b27d86ea4.__CR0,116,384,384_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e87a3db8-dac4-4fc6-9681-b4e5670f5047.__CR24,61,236,236_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d9296217-e3e3-40a3-bb96-c242220fc57c._CR0,0,300,400_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f4efeb98-ccd8-41f8-aaa7-6d4dcf3f3263._CR0,0,350,175_PT0_SX350__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f13fe4c1-3e10-4abf-83d3-35347b7abaab.__CR0,37,848,254_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b8c67768-250b-4c98-898e-2f594d97d4d5.__CR0,47,515,515_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/84965365-b73b-4ebd-acbc-b040c30823be.__CR0,0,3639,3639_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5fd1250b-fb08-4bf4-b640-eb1b27d86ea4.__CR0,116,384,384_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e87a3db8-dac4-4fc6-9681-b4e5670f5047.__CR24,61,236,236_PT0_SX220_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tim Kimzey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHIGBWRHAGKVJHJTMIVKUKDQGXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVBI6QUHJ3W39?ASIN=B0000665TD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2013",
                "reviewTitle": "5.0 out of 5 stars Nothing better: Quality Product that Works well, Forever",
                "reviewText": "No, I am not an expert in fabric steamers, or even good at basic ironing.I bought this as a gift for my wife several years ago. She asked for a basic little hand-steamer that was advertised on TV. I looked it up and saw the horrendous reviews, decided that with the good reviews on this one, maybe it would be worth the extra money. Not only was I right, it has exceeded our expectations.This thing is built solid. Everything about it says quality. Nothing has ever failed or broken. No parts need replacing, no filters need changing.You do have to lift the solidly-made plastic water container out of the unit and fill it up with water every now and then (actually not that often, unless you use this thing for literally hours every day I guess). But for a daily touch-up of a shirt or dress, the water lasts a long time without refilling. Its easy to do, too. You lift the big contoured black handle, pull it straight up and out, go to the sink, unscrew the lid, fill it up with tap water, screw it back and put it back in. There is even a little handle on the bottom side to hold it while you are filling it with water--they thought this thing out well! No mess or spills either. Nothing has ever leaked.Yea, it does look a little dated and utilitarian. Who cares? It sits at the ready in the corner behind our refrigerator. You roll it out on the smooth caster wheels, flip the big switch which lights up a pleasing soft green when on, and in seconds you hear a gurgling sound and steam is pumping out of the wand, ready to get to work. The big switch can be easily turned on with your foot without even stooping if you want!The solid aluminum metal clothes hanger holds your garment securely. Just leave the clothes on a hanger, hang it on the rod, and sweep the wand around the fabric to get wrinkles out.No pulling out the squeaky ironing board, setting up a iron, no burning of clothes. Yep, you can burn your skin a little with the very hot steam from the wand if you are lazy and not paying attention--I did it a few times when I started using it, not anymore. Just be careful.Look, I'm a guy. I don't like to iron clothes, or even steam them. But this thing works so easily and takes so little time, I just try to listen to my wife when she tells me I need to iron my shirt. Frankly, this gift keeps on giving for years. She loves it, I love it. It makes us both happy when we use it! ;)Wrinkles fade out like magic when you use it. It actually works, it's easy to do, even kinda fun. It makes me feel good when I use it, cause it makes my wife happy. Seriously, that is worth its weight in gold, isn't it?As the label proudly states, it is made in the USA.Did I mention how easy it is to set this thing up out of the box? A little kid could do it (probably better than us).I've reviewed a lot of other stuff, but for some reason forgot to review this Original Jiffy Steamer when I got it, years ago. If I could give this product 10 stars, I would. There is nothing not to like about it.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEU3L37BWNM4WVPHDV6HE3ZB6IPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C4OHNLWT5GYC?ASIN=B0000665TD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Love it! Well worth the money!",
                "reviewText": "Extremely well built and works beautifully. So happy to have made the purchase. This product has delivered!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ronald Yedloutschnig",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXELATNNHJP2J7QICQ5C5QABH2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZGQOB0SNVOTB?ASIN=B0000665TD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2012",
                "reviewTitle": "5.0 out of 5 stars Love my Jiffy Steamer",
                "reviewText": "This review is for us guys who now do the laundry. Following a few swear words, mishaps and ups and downs with the ironing board and iron I saw the \"little steamer\" advertised. This looked like my salvation, so I ordered the little rascal. It worked surprisingly great and the ironing board found its way into the basement (the steam iron is still up on a shelf in the laundry room.) Recently my little steamer started spurting hot water and steam all over, so was time to regroup and read all the internet reviews about steam pressing.I ordered the \"Jiffy Steamer J-2000 Residential Series 1300-Watt Garment Steamer from Amazon.com. I had my four pair of golf shorts and 4 polo shirts, from my four days of golf, available when the steamer arrived. I filled the water container with distilled water, turned it on and in less time than my little steamer was perking, steam was pumping out, and no spurting of hot steam water. My shorts and shirts were on hanger's right out of the dryer, so ready for the chore of pressing out wrinkles and folds, but hold on, this was actually fun and no chore. The wrinkles seemed to melt away with all the hot steam and each shirt was done in about 2 minutes. I had the shorts hung by the waist band so was simple to steam out any wrinkles and looked better than my ironing used to look. My \"ironing\" duties were completed in less than 30 minutes.Now the question for you guys who also have the ironing duties, would you rather spend more time on the golf course or in the laundry room? Also, as I said before, it is actually enjoyable to see the results in a short period of time and \"no hassles\" with an ironing board, lol.For the new-comers, yes, the little steamer works great, but would I switch back? - can I drive the ball 300 yards? - Answer is no. The occassional spurting of hot water from the little steamer was of course a nuisance, but tolerable, and naturally it could not be turned upside down. I now steam clothing from the inside, both the shirts and pants. With the legs hanging down it is easy to insert the steam nozzle and run it up and down. I might add this nozzle gets very hot, so be cautious. Also, the max for the little steamer was about 20 or 30 minutes and with my Jiffy Steamer, an hour is no problem.I might add I am 82 years of age, so you young'uns should easily outperform me. I steamed our mattress last week, so bye-bye any bedbugs. Feel like getting on the good side of your \"significant other\"? - steam some of her clothes and put a smile on her face (I now also steam my wife's PJ's so she looks gorgeous morning, noon and night.)So there you have it guys, would you rather sweat and swear over the ironing board, or sing along with your favorite CD. Also have extra time now on the golf course, wearing wrinkle-free golf clothes? Oh, would I recommend this Jiffy steamer? - as we say out here - \"Yes, yes, yes, in a NY second.\" Jiffy Steamer J-2000 Residential Series 1300-Watt Garment Steamer",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Filiberto Sanchez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 6, 2023",
                "reviewTitle": "Muy buen producto",
                "reviewText": "El producto me llego desde un envío internacional con todas sus piezas bien, intacto, el material es muy bueno y le dudaba en comprarlo porque era algo costoso y uno piensa lo peor si te llegasen a estafar pero con todo lo contrario excelente compra y tu ropa queda como de tienda departamental muy buenos y responsables los vendedores no me vi en la necesidad de contactarlos porque todo me llego",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Animal Lover",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 5, 2019",
                "reviewTitle": "Just cannot believe how good this product is",
                "reviewText": "Coming from a skeptic I did my research and ordered the J-2000 Jiffy Garment Steamer and kept my fingers crossed. So impressed with the quality, the stability, the fast response, the cute pink color and the overall brilliance of this product. GOODBYE irons. This is the way to go. It is expensive but not considering the quality and how quickly it works and how well it works. HIGHLY recommend and to all the skeptics out there - I cannot vouch for all steamers but I can vouch for this one. It is glorious. I keep mine ready to go in the spare room and it is cute as a button too. So glad I followed my research and bought a quality product right off the bat rather than buying and failing with cheaper steamers first. Amazon also gave awesome delivery service.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Swapnil Adahalli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 12, 2018",
                "reviewTitle": "240 Voltage must be considered for India",
                "reviewText": "You need to sort items which must suit Indian voltageIn india its 240v is required and the purchased item is of 120 voltage and got burned very next day of the delevered day...",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerardo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 13, 2022",
                "reviewTitle": "Tengo 28 años usando la marca Jiffy, no hay comparación con ningún ota.",
                "reviewText": "Excelente producto, como siempre, es la 2da. que compro.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 24, 2022",
                "reviewTitle": "Great Quality Steamer",
                "reviewText": "I waited a few months to write this review, and I can confirm the steamer is amazing. One canister of water lasts well over an hour. The steam is continuous and removes very stubborn wrinkles. The price tag was a bit steep, but it was absolutely worth the investment.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}