{
    "remaining_requests": 31823,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sunbeam-1200W-Handheld-Steamer-Feature/dp/B0B5FJF3M7",
    "body": {
        "name": "Sunbeam Power Steam Handheld Steamer, Professional, White/Blue",
        "price": "$29.99",
        "originalPrice": "$29.99",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sunbeam-1200W-Handheld-Steamer-Feature/dp/B0B5FJF3M7",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BLVF447J"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B5FJF3M7",
                "variationName": "Style",
                "variationValue": "Power Steam",
                "price": "$29.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0B5FKB22Y",
                "variationName": "Style",
                "variationValue": "Professional",
                "price": "$55.20",
                "variationImageURL": ""
            },
            {
                "asin": "B01AX6TPEC",
                "variationName": "Style",
                "variationValue": "Steam Burst",
                "price": "$29.10",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-r7oN1KeL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ZqQEr2HBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41t37jtVCLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51WcCJ54lnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PO CkJlVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41OiUjJuq7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A18CeinU0SL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Sunbeam Store",
            "link": "https://www.amazon.com/stores/Sunbeam/page/9E7BBFBD-9C03-4548-894E-D6B8C0756CB7?ref_=ast_bln"
        },
        "brand": "Sunbeam",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1643,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 15 hrs 35 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "READY TO GO: 1200W power heats up quickly in 30 seconds and stainless-steel non-stick faceplate easily glides over fabrics and materials, suitable for clothes, curtains, furniture and more",
            "EXTRA STEAM: Extra-strength burst of steam feature and 15 minutes of continuous steam option to help remove wrinkles",
            "EASY TO USE: LED temperature ready indicator light, anti-drip system for no spill, mess-free steaming and 8-foot 360° swivel cord for freedom of movement",
            "VERSATILE STEAMER: Bristle brush attachment head included to penetrate fibers",
            "EASY TO FILL: Detachable 250ml water tank for longer steaming sessions",
            "WARRANTY: 1-year limited warranty"
        ],
        "description": "The Sunbeam 1200W Power Steam Handheld Steamer with bristle brush attachment head offers fast, efficient steaming to help remove the toughest wrinkles and have you looking your best. This convenient steamer includes an extra burst of steam feature activated by an ergonomic trigger and a bristle brush attachment head to help penetrate fibers. The bright LED temperature ready light lets you know when the steamer is fully heated, and its stand-up stable design supports easy storage in between uses. With a fast 30 second heat-up time, this steamer is ready when you are and with an 8-foot 360° swivel cord, allowing for freedom of movement, steaming has never been easier.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b?ie=UTF8&node=510240"
            },
            {
                "name": "Garment Steamers",
                "link": "https://www.amazon.com/garment-steamers/b?ie=UTF8&node=510248"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Sunbeam"
            },
            {
                "name": "Color",
                "value": "White/Blue"
            },
            {
                "name": "Item Weight",
                "value": "1.26 Pounds"
            },
            {
                "name": "Style",
                "value": "Power Steam"
            },
            {
                "name": "Wattage",
                "value": "1200 watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Heat Time",
                "value": "30 seconds"
            },
            {
                "name": "Capacity",
                "value": "250 Milliliters"
            },
            {
                "name": "Product Dimensions",
                "value": "4.6 x 3.55 x 9.79 inches"
            },
            {
                "name": "Manufacturer",
                "value": "Star Elite Inc."
            },
            {
                "name": "ASIN",
                "value": "B0B5FJF3M7"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "32610046"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,643 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#48,981 in Home & Kitchen (See Top 100 in Home & Kitchen) #35 in Garment Steamers"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "1-year limited warranty"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Power Steam Handheld Steamer, Bristle Brush Attachment"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Sunbeam Power Steam Handheld Steamer Sunbeam Steam Burst Handheld Steamer Sunbeam Professional Handheld Steamer Wattage 1200 W 1200 W 1575 W Steamer Plate Stainless Steel Plastic Aluminum Heat-up Time 30 Seconds 30 Seconds 25 Seconds Temperature Settings Single Dual 5 Fabric Settings Extra Burst of Steam ✓ ✓ Water Tank 250ml 230ml 250ml Attachments Brush Head Brush Head Brush Head and Delicate Fabric Head Safety Feature Auto Shut Off Auto Shut Off Auto Shut Off Continuous Steam 15 Minutes 15 Minutes 15 Minutes Cord Length 8-foot 360° swivel cord 8-foot 360° swivel cord 8-foot 360° swivel cord",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c5f15a1d-4062-46b0-990f-b4fdbd96718b.__CR0,64,2440,755_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e0037a0-ea22-45dd-8139-97878ee34d70.__CR0,1,1906,1906_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/59554f05-357a-44bd-a75e-2fb8e7bfd6a2.__CR0,1,1893,1893_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/331fc766-e53d-4c2b-afee-cc747da6914a.__CR0,1,1906,1906_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7b29e24-1d5e-476d-8243-ecde6354c1bd.__CR0,64,2441,755_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7e7155d2-9cdb-4760-b981-61dcc80771a7.__CR0,64,2443,756_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f6c77f1e-77aa-4b41-8331-0ffda4936c72.__CR709,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5f7227ec-24d2-4108-97da-cb3e48a4f9eb.__CR750,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e7e4b4c5-bb9a-4a6c-bc99-b93f9da2f883.__CR805,0,1500,3000_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLQGZDGWH6Y4IPXIPWMF7QZ3OKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V0OM7BU4C607?ASIN=B0B5FJF3M7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 22, 2023",
                "reviewTitle": "5.0 out of 5 stars No Leaking, Powerful, and Extra Fabric Settings",
                "reviewText": "The main purpose for which I purchased this was to get wrinkles out of some blackout curtains that hadn’t fallen out on their own for more than 6 months (I guess they never would have). This steamer did an excellent job on the lowest steam setting and probably could have done it even faster on a higher setting, but I didn’t want to risk damaging the cloth. Before purchasing, I did a good amount of research, and while I’m confident I could have done the job with something maybe half the price, I really wanted something that had the capability of handling everything from light to heavy duty - and wouldn’t leak water all over my hardwood flooring in the process. This Sunbeam Professional Steamer is one of the more powerful handheld models I found, has 5 settings (including 1 dry mode, and 4 steam modes), Comes with 1 upholstery and 1 delicate fabric ‘bonnet’, an 8’ cord (I used a heavy duty extension cord for anything beyond that reach), a non-leaking reservoir and pump system, and an excellent nonstick face that can be used vertically or horizontally. So far I have put this to use on 12 curtain panels, one skirt (my wife’s), and one neck-tie, and it’s done an amazing, quick and efficient job on each (and no leaks)!Now for some criticisms/gripes:1) It is a little heavy for extended use, but I expected that. This isn’t so much a gripe or a criticism, I guess, but more of an observation for those with limited arm strength.2) while the bonnets are good and useful tools, the condensation that forms on them, does begin to drip fairly quickly. The machine itself isn’t leaking, it’s simply the condensation on the accessory bonnets. Once you remove them, the dripping will cease! If your application and environment won’t be harmed, the bonnets are still excellent tools to use. I did want to note that this would be an issue for any brand of steamer that uses bonnets and is not a particular problem with this model. The bonnets are optional, so I simply took the delicate fabric bonnet off to protect my floors and continued on without further trouble.3) The design of the water reservoir could have been better in terms of removal from the machine. When you press the release button, the reservoir needs to be pulled forward to be released. However, there really isn’t much on the reservoir to hold onto in order to get it off. What I am doing, is with the steamer off and facing me, I am pushing the release button and pulling on the reservoir’s edge just under that release button. It does the job, but just seems more difficult than it should be. This is the one design flaw that I feel needs be addressed on the next iteration without question. For now, I have some rubberized grip tape that I may install, to create a couple gripping surfaces on the sides of the tank to aid in removal.4) When putting the reservoir back onto the machine, the tank needs to be aligned top and bottom and then pressed straight in. This is not a problem and isn’t difficult. If, however, you don’t press the tank inward with a positive, purposeful motion, you’ll end up getting a little leakage in the process. I simply make sure to reinstall the tank over the counter or sink or anything else I don’t mind getting a few drops of water on. No biggie! The machine goes right back to normal and doesn’t leak in use.4) Probably my second biggest gripe next to the reservoir removal issue! I’d really have liked Sunbeam to have included some type of reusable box like the one Electrolux provides with some of their models. The only box you get is standard cardboard and without re-inserting the cardboard shipping supports, the whole thing just kinda flops around inside. The Electrolux has a decent box designed for storage rather than the recycling bin - I wish Sunbeam had been as thoughtful. This isn’t a deal breaker, but I see this (and the reservoir issue) as real areas of opportunity for an otherwise excellent product.Sunbeam has a real winner in the making and certainly an excellent product as is! Since this is only my 2nd day of ownership, my long term review will have to wait. I will post any pertinent updates as and if they arise, for now, I can honestly say, that knowing the several other sunbeam products I own and my experience thus far, I have no reservations in recommending this product to anyone looking for quality and versatility in a larger more powerful handheld steamer.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGROC7X4BOQX37JEO4YT7FZOW4IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MV0SLEBFG0KH?ASIN=B0B5FJF3M7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great!",
                "reviewText": "Works great! Happy with my purchase",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG72I3DOHOBPOZSAONLF53JKJRQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KMESOAB8O21P?ASIN=B0B5FJF3M7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2023",
                "reviewTitle": "4.0 out of 5 stars Good product in the budget",
                "reviewText": "I bought this product based on a review in an article. overall, I am satisfied with the product but heavily wrinkled cloths are hard to iron. It is easy to use but might be constrained by space if one is considering it for travel.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFKVSX3H7JBJ3AMZXSSRTL5ZKUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DPAL2AMWBDDJ?ASIN=B0B5FJF3M7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2017",
                "reviewTitle": "5.0 out of 5 stars Amazing!!!!!",
                "reviewText": "This handheld steamer is AMAZING! I used to have a full size stand up steamer that I kept in the basement laundry room (where my ironing board and iron are) and it was taking just as much time to go down there, turn it on, wait for it to warm up, bring my garments down and steam them, as it would to just whip out the iron and iron them. Then I remembered the Evlis Duran crew raving about this after their Mexico trip so I found this and decided to purchase it.WHAT AN AMAZING PRODUCT!!! I keep this in my room with all of my clothes, so that way I can steam right away with my garmets as I take them out to wear them. It takes like 15 seconds to heat up and get ready so I can start steaming basically immediately! I just bought the basic unit – I don’t think all the other accessories are necessary. How I steam my clothes – I have an over the door hook (1 hook) and then I hang a hanger on that hook, put my shirt on it, and steam it, turn the hanger around, then steam the other side. The steam does not get all over the door and it works like a charm.The basic unit comes with accessories like a lint cover, a protective cover (to prevent your hand from getting burned with steam) and an attachemnt to create a seam. It has a low and high setting so if you need to be more gentle with a garmet, use the low setting. I use the high setting on just about everything and so far so good.Would HIGHLY recommend this product – it makes getting ready in the morning SO EASY.",
                "reviewVotes": "51 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bsome",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXH57ZKO3ONZCFGPQ5U3V62NIUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMO9P3WL5OBKZ?ASIN=B0B5FJF3M7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 13, 2020",
                "reviewTitle": "5.0 out of 5 stars I really like my new steamer!",
                "reviewText": "I really like my new steamer! I've never had a clothes steamer before: this is my first one. Well, actually, I had bought one before this one that I didn't like. What I like about this one as opposed to the other one I'd bought and returned is that this one steams longer without needing more water. (Before buying this one, I had looked up which steamer to get, and an article said that this one was the best for steaming more clothes at once.) That definitely seems to be true. I still had a bit of water left after trying the steamer out on several clothes. It has a bar that you can use to, like, press the clothes like an iron does (like ironing vertically without using a board). I like that feature because it seems to help if you need to press something down that is either sticking up or has a crease somewhere that you don't want. (I tried it on a light to medium blouse that always had a weird crease in the lace-like part, and it got that out.) I also like that this steamer can steam vertically or horizontally. It gets very hot and does a good job of getting out the wrinkles! I tried it on heavier jeans-like pants and it worked well on those. It has a low and high setting. It comes with different attachments, which is nice. I'm pleased, and it seems as if it'll actually be fun to prep my clothes! (The steamer says that it has a three-year warranty.)",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "omafor3",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7GJTCURYENDZD7ROMHZCAC3B3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RUV9S5U9FVCW?ASIN=B0B5FJF3M7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Took all the wrinkles out of a very wrinkled dress",
                "reviewText": "Love this steamer, it’s lightweight and easy to use. Just what I was looking for",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NC shopaholic",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETVOSNIGZ3DJZ6DII6NIR44GORA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BC4RRTCI32J1?ASIN=B0B5FJF3M7",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2023",
                "reviewTitle": "3.0 out of 5 stars Great, but only lasted 7 weeks",
                "reviewText": "The other reviews were correct; it just stops working. There was a sound when it stopped working, like the motor was overworking. Prior to that, it was a great purchase— lightweight, easy to put in water, heated up in 30 sec or less. I’ll have to find a more durable model or brand because I love it so much more than my iron!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDVUE4WE3MS42TV7TBDGVBJM4WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BFH9I1RD37OS?ASIN=B0B5FJF3M7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Quick -time saver",
                "reviewText": "Heats quickly performs as described convenient to quickly steam, wrinkles out of clothing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 30, 2023",
                "reviewTitle": "My only regret",
                "reviewText": "I wish I bought it sooner. It works much faster than an iron with any fabric. Be careful not to touch steel bar as its so hot. But otherwise a must have!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amedinap",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 27, 2023",
                "reviewTitle": "Buen producto, aunque no para todas las prendas",
                "reviewText": "Mi esposo lo usa de modo horizontal, evita que la ropa se manche por quemadura de plancha convencional, la carga de agua rinde para un par de prendas, quita arrugas de ciertas telas, no en muy gruesas. Es buen producto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CLAUDIA SOLEDAD PÉREZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 16, 2022",
                "reviewTitle": "Súper!",
                "reviewText": "Funciona muy bien, practica y muy fácil de usar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Plynne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 1, 2021",
                "reviewTitle": "Funciona muy bien!",
                "reviewText": "Calienta muy bien y rápidoCalidad superó mis expectativas, tengo una plancha de vapor grande mucho más cara y esta creo que me gusta más",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David d",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 3, 2020",
                "reviewTitle": "Excellent Product",
                "reviewText": "This steamer is excellent, compact, easy to use and does a great job. Aside from leaving my clothes super well pressed, I use it on sofa, mattresses, pillows and drapes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}