{
    "remaining_requests": 31862,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bissell-Sanitization-Flip-Down-Scrubber-1940A/dp/B0091YYUAM",
    "body": {
        "name": "Bissell Power Fresh Steam Mop with Natural Sanitization, Floor Steamer, Tile Cleaner, and Hard Wood Floor Cleaner with Flip-Down Easy Scrubber, 1940A",
        "price": [
            "3 options from $79.28"
        ],
        "originalPrice": "$92.69",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Bissell-Sanitization-Flip-Down-Scrubber-1940A/dp/B0091YYUAM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B5FKLMP2"
        ],
        "asinVariationValues": [
            {
                "asin": "B0091YYUAM",
                "variationName": "Style",
                "variationValue": "PowerFresh",
                "price": "$92.69",
                "variationImageURL": ""
            },
            {
                "asin": "B01K5S1EUQ",
                "variationName": "Style",
                "variationValue": "PowerFresh + Eucalyptus Mint Water",
                "price": "$100.68",
                "variationImageURL": ""
            },
            {
                "asin": "B01K5S1AM8",
                "variationName": "Style",
                "variationValue": "PowerFresh + Extra Mop Pads",
                "price": "$108.64",
                "variationImageURL": ""
            },
            {
                "asin": "B01K5S1QKO",
                "variationName": "Style",
                "variationValue": "PowerFresh + Spring Breeze Water",
                "price": "$97.68",
                "variationImageURL": ""
            },
            {
                "asin": "B09GS87K8Q",
                "variationName": "Style",
                "variationValue": "Powerfresh 2-in-1",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31sJKgjQ4hL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/416QEHeabpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VJXGgt2bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FtO8r7UdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jywtzGJ9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MQVNc  rL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517eUVIwqdL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bissell Store",
            "link": "https://www.amazon.com/stores/BISSELL/page/22DE84A8-19D5-4224-9E34-B0BF39C41659?ref_=ast_bln"
        },
        "brand": "BISSELL",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 47725,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 8 hrs 40 mins",
            "FREE delivery Monday, February 19. Order within 6 hrs 40 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Clean and sanitize sealed hard floors without the use of harsh chemicals; Eliminates 99.9 percent of germs and bacteria with the natural power of steam",
            "Power through tough, sticky messes with the flip down easy scrubber",
            "Choose from high, medium, or low steam based on your cleaning needs with the smart set digital steam control",
            "Features swivel steering and a 23 foot power cord. Ready to use in 30 seconds",
            "Includes: (1) microfiber soft pad, (1) microfiber scrubby pad, (2) spring breeze fragrance discs, and a carpet glider. Power rating: 1500 watts. Power Source: Corded",
            "Packaging graphics may vary",
            "Easy Scrubber flips down and reaches down to the grout and crevices.",
            "SmartSet Steam Control for light cleaning to heavy messes.",
            "Spring Breeze fragrance discs insert in the mop pad for a fresh, clean scent while you steam mop.",
            "Removable water tank you can easily fill at the sink.",
            "Low-profile mop head cleans into corners and edges."
        ],
        "description": "The Bissell power fresh steam mop provides superior steam cleaning with a fresh scent. For those tough, dried-on messes we all experience on our floors and on grout, use the flip-down easy scrubber brush to break up the dirt quickly and easily. Cleaning with steam sanitizes floors, eliminating 99. 9 Percent of germs and bacteria in common households. when used as directed, using the microfiber pads. when used as directed, using the microfiber pads. Buying this product saves pets. Bissell proudly supports Bissell Pet Foundation and its mission to help save homeless pets. When you buy a Bissell product, you help save pets, too. We’re proud to design products that help make pet messes, odors and pet homelessness disappear. string.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510106"
            },
            {
                "name": "Steam Cleaners, Steam Mops & Accessories",
                "link": "https://www.amazon.com/Steam-Cleaners-Steam-Mops-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11333725011"
            },
            {
                "name": "Steam Mops",
                "link": "https://www.amazon.com/Steam-Mops/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3303861011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Bissell"
            },
            {
                "name": "Special Feature",
                "value": "Steam Control"
            },
            {
                "name": "Surface Recommendation",
                "value": "Floor"
            },
            {
                "name": "Model Name",
                "value": "BISSELL PowerFresh Steam Mop, Floor Steamer, Tile Cleaner, and Hard Wood Floor Cleaner, 1940"
            },
            {
                "name": "Included Components",
                "value": "Steam Head Attachment"
            },
            {
                "name": "Wattage",
                "value": "1500 watts"
            },
            {
                "name": "Item Weight",
                "value": "0.01 ounces"
            },
            {
                "name": "Tank Volume",
                "value": "16 Fluid Ounces"
            },
            {
                "name": "Item Display Dimensions",
                "value": "29 x 10 x 7 inches"
            },
            {
                "name": "Color",
                "value": "Blue Powerfresh"
            },
            {
                "name": "Power Source",
                "value": "Battery Powered"
            },
            {
                "name": "Voltage",
                "value": "100240 Volts"
            },
            {
                "name": "Style",
                "value": "PowerFresh"
            },
            {
                "name": "Product Dimensions",
                "value": "11.6\"D x 7.1\"W x 28.6\"H"
            },
            {
                "name": "Manufacturer",
                "value": "Bissell"
            },
            {
                "name": "ASIN",
                "value": "B0091YYUAM"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "1940A"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 47,725 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,645 in Home & Kitchen (See Top 100 in Home & Kitchen) #4 in Steam Mops"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Warranty Description",
                "value": "Two year limited warranty."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Import",
                "value": "Imported"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mitchell W. Riggins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMUXNSZYAQHBCQ4QZ56T2T3TBCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P1KKYY4LKTB3?ASIN=B0091YYUAM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2015",
                "reviewTitle": "5.0 out of 5 stars REDEMPTION! A Bissell Powerfresh Steam Mop that WORKS!!",
                "reviewText": "Although very optimistic about this purchase, after following the instructions TO THE LETTER, and only using distilled water, it failed to produce steam after only one use. How disappointing! I DO NOT recommend this product at all. Accordingly, I am sending it back for a refund. I will, most likely, order a HAAN steam cleaner to replace this Bissell failure.UPDATE #1: I posted the above review several hours ago after trying to use my Bissell PowerFresh Steam Mop for only the second time. Of course, as I explained above, the steamer failed to work, prompting me to request a return shipping label for a refund; however, before packing the unit up, I looked online for possible fixes to my problems and came across this U-Tube video:https://www.youtube.com/watch?v=Vz8OvV30sHMI tried the half-CLR / half-Distilled Water mixture (poured directly into the water reservoir) and let it sit for approximately three hours. Upon turning on the unit to see if it would make steam …. NOTHING …. but wait! …. after trying for several second without success, I (as they did in the video) shook the steamer from side to side quite forcefully and … BLAMMO …. a strong burst of steam suddenly came exploding from the steam mop head and it began functioning absolutely perfectly, as if nothing was ever wrong. I immediately powered the steam mop down and promptly emptied the water reservoir of the CLR mixture, rinsed the reservoir out good, then refilled the reservoir with clean, fresh distilled water. Afterwards, I was able to mop my entire tiled kitchen, tiled hallways, and tiled bathrooms with nary a hitch. The Bissell Steam Mop operated exactly as it was designed.In retrospect, now that I see how the Bissell Powerfresh Steam Mop operates when it is working properly, I realize that the first time I used the steam mop, the steamer was not putting out the proper amount of steam. Obviously, there was a clog in the unit when I unboxed it, when lends me to believe that Amazon shipped me a unit that had been returned. I come to that conclusion based on the fact that the box the Bissell PowerFresh Steam Mop arrived in from Amazon was a plain brown cardboard box, unlike one you would expect from a manufacturer. While I was at Sears yesterday, I looked at some Bissell PowerFresh Steam Mops that were displayed for sale and (unlike the box I received from Amazon) the boxes were very colorful with bold pictures of the steam mop proudly displayed on each side. Quite a difference!I'm going to keep the return label that I downloaded from Amazon's website for at least a couple of weeks since I may still very well return it. It kind of leaves a bad taste in my mouth that Amazon (to my belief) sent me a used/returned unit. I will give it another try or two before I decide whether or not to return it. However, I WILL upgrade my rating, just slightly (to 3 Stars), because the Bissell PowerFresh Steam Mop DID do a beautiful job on my floors after it was flushed with whatever debris/gunk was clogging the steamer flow tubes. Indeed I was VERY impressed with the overall simplicity of operation, the amount of steam that contacted the floor, and the finished cleanliness of the finished floors. Quite nice!Recommended … but with caution!UPDATE #2: Okay …. it's official … the Bissell Powerfresh Steam Mop is a piece of CRAP! Today I attempted to use it for the third time and, AGAIN, it would not operate. It required yet another dose of CLR before the steamer mechanism came to life. Accordingly, I am reducing my review to only one star, but that's only because I can't give it ZERO stars.NOT RECOMMENDED!!!UPDATE #3: August 22, 2015 …. Today I was at Sears in Savannah, GA and purchased a new Bissell Powerfresh Steam Mop. As noted above in my earlier review, the steam mop I received from Amazon was packaged in a plain brown cardboard box, void of any embellishment or product photos. This, of course, led me to believe I might have been sent a repackaged unit by Amazon, perhaps a defective unit that was previously returned. Regardless, the Powerfresh that I received from Amazon NEVER worked properly. Fast forward to today …. the Bissell Powerfresh Steam Mop that I purchased from Sears (unlike the one from Amazon) was contained inside a very colorful cardboard box, adorned with photos of the product and highly descriptive information. I purchased the unit for $89, and paid an additional $18 for a 2-year replacement warranty. I brought the Bissell Powerfresh Steam Mop home and assembled it according to the instructions (which is VERY simple). After assembly, I poured fresh distilled water into the reservoir and plugged in the unit. YES! …. The Bissell Powerfresh Steam Mop that I purchased from Sears fired right up and within one minute was pumping away steam like an old locomotive! I immediately steam mopped my tile kitchen, tile hallway, and tiled bathrooms with nary a hitch. It worked beautifully and the resulting cleaned floors looked fantastic!Acccordingly, I am now escalating my star-rating from 1 to 5. Yes, it was a frustrating and annoying beginning to my relationship with the Bissell, but the unit that I purchased today worked so well and did such a fantastic job on my floors, I have to give it a max-rating. Would I purchase the Bissell Powerfresh Steam Mop from Amazon? …. HELL NO …. Would I purchase the Bissell Powerfresh Steam Mop from a local department store? ….. YES YES YES! At the moment I whole-heartedly recommend the Bissell Powerfresh Steam Mop; however, it I run into issues in the future I will most certainly provide an update.",
                "reviewVotes": "196 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Judy L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHL7BB7GOOWFA773QUOELKNUIQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SJHMZ9S6797Y?ASIN=B0091YYUAM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2014",
                "reviewTitle": "5.0 out of 5 stars Unbelievable cleaning results!",
                "reviewText": "This steam mop worked well beyond my expectations. We have a very large kitchen, hallway, and foyer area that has a textured ceramic tile. I have another Bissell hard cleaner that uses a detergent, and sucks up the dirty water. My old Bissell cleaner has no flexibly, and doesn't clean well under cabinets near the floor board. So I usually have to carry a scrub brush to get next to the floor trim. Because of time constraints and the noise of the old Bissell floor cleaner, cleaning of the floor was put off. I thought I wanted to do a good cleaning first with dirty water picked up before I used this Bissell Stem Mop.Since I generally don't have extra time for cleaning until evening, I finally decide to just use the Bissell Steam Mop to see what it could do. OH MY GOD!! I couldn't believe how this mop picked up the dirt. The ceramic floor that we have really doesn't show dirt. It is textured, and this can make it hard to get into the texture for cleaning. Again, generally I have to carry a scrub brush to get into the texture. Over time, there can also be a buildup of dirt where the tile meets the floor trim under the cabinets. This also usually needs a scrub brush. This baby got all of it without the need for a scrub brush. It even totally cleaned the area around our dog's bowls that accumulates drool and water that she doesn't keep in her mouth.Between the bathroom, large kitchen, hallway, and foyer areas, I had to fill the tank only twice. Cleaning the large area that I had to do, and considering that it had not had a good cleaning in a while, it took me about an hour to get everything sparkly clean. As for the fragrance discs, I like them. They add a nice fragrance to the room. My husband kidded me that I smelled nice, but I had to tell him that it was the floor. For us, the fragrance was light and fresh, and it smells good. I also like the fact that I can choose between steam levels even though I would used the highest levels for most of my floors.At this point, I am tempted to get rid of the big hard floor cleaner that we have. This Bissell Powerfresh Steam Mop did such a great job on our floors, and it is so much easier to use. With this cleaner, it will be so much easier to clean the floors more often. The heat of the steam killing bacteria is only a greater plus. I would highly recommend this steam mop for anyone.UPDATE 09/07/14:Since I bought this steam cleaner and was so sold on steam cleaning, I also bought the Shark Steam and Spray Steam Mop. So I thought I would add a comparison of the two. I really like both of them for different features which I will explain. - The Shark Steam and Spray does not have a steam setting, but the Bissell has settings for 3 levels of steam. Bissell wins! - The Bissell mop pads wrap around the holder, but the Shark pads attach flat to the mop. So the Bissell does a better job at cleaning against the edges. Bissell Wins! - The Bissell water reservoir can be removed for filling and emptying. The Shark is attached and not removable. So the Bissell is easier to fill and empty. Bissell Wins! - The Bissell supplies a constant supply of steam, and the Shark has to be \"pumped\" with the handle to supply steam. The constant steam of the Bissell saturates the pad more quickly so that drying takes a little longer, but having to pump the handle on the Shark to get a burst of steam can be a bit of a pain. The Shark still worked great, but I found that having to pump the handle to get steam was a little inconvenient. Bissell Wins Maybe! - The Bissell has a scrub brush that can be lowered for stubborn spots - the Shark doesn't have this feature. I initially found this to be useful on the textured ceramic floor, especially around my dogs feeding station, but this may not be a useful feature for everyone unless you happen to have dried on spots that are difficult to remove. Bissell Wins Maybe! - Shark included the use of a cleaner that can be used as needed in addition to the steam. The cleaner helps to remove spots that the steam doesn't remove completely on its own, and adds another level of cleaning. Shark Wins! - The cleaning head of the Shark is a bit smaller and gets into areas that the Bissell can't get into - like around a toilet. Shark Wins! - The \"disposable SaniFiber\" cleaning pads for the Shark are less expensive, and are actually washable and reusable. Shark Wins!All in all, I really like both machine, and would recommend both of them. If you want only one cleaner, the Bissell definitely has more features and conveniences, but the addition of the use of a cleaner may be attractive depending on the cleaning that you do.",
                "reviewVotes": "59 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stacy ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 18, 2023",
                "reviewTitle": "Power Fresh !!!",
                "reviewText": "I just received this Bissell Power Fresh steam mop a day ago , had to try it out right away as I have a dog and cat who make a mess when eating and also being muddy season.I have old vinyl floors and let the steam sit over heavy soiled areas and it cleaned it up no problem .I highly recommend this, I won't be using a mop and bucket again as this machine does a much better job at cleaning my floors and easier on my back.The cord is really long which I like and can get a big area done without having to switch plugs.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudia Quiroz CoronaClaudia Quiroz Corona",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 23, 2021",
                "reviewTitle": "Fantástico!! El vapor es lo mejor",
                "reviewText": "Lo más fácil de usar, desinfecta con el vapor,.deja un aroma increíble, es super ligero y el BRILLO lo ame!! Quería subir un video de lo feliz que estoy!!! Mi mejor compra",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/A1F2vREMgSL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arindam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 9, 2020",
                "reviewTitle": "Okay",
                "reviewText": "Okay type.. cost is too high",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl Scheie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 20, 2023",
                "reviewTitle": "Steam cleaner",
                "reviewText": "Love it easier on my hardwood floor and Lino ones as well. Cleans perfect. With 1/2 cup or less of steam only no other products. Works so good and mop pad washes up so easy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Guadalupe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 19, 2020",
                "reviewTitle": "Muy buen producto el problema son los repuestos de las mopas",
                "reviewText": "Muy buen producto, fácil de usar, no pesa, el único inconveniente es qué trae solo 2 mopas y se necesita estar cambiando las mopas constantemente porque se mojan y ensucian muy rápido y dejan el piso manchado con marcas de agua y mugre por lo que hay que comprar mas repuestos pero deben ser los originales que son muy muy caros y yo no he podido conseguirlos, compré imitación que son más económicos pero para nada se los recomiendo y al final he gastado más en buscar repuestos de mopas que lo que cuesta este artículo.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$91.99",
                "sellerName": "MacLuvin",
                "sellerRating": "5"
            },
            {
                "price": "$92.68",
                "sellerName": "HMKStoneCare",
                "sellerRating": "4.5"
            }
        ]
    }
}