{
    "remaining_requests": 31924,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BISSELL-SteamShot-Sanitization-Multi-Surface-Included/dp/B001EYHAGS",
    "body": {
        "name": "BISSELL SteamShot Deluxe Hard Surface Steam Cleaner with Natural Sanitization, Multi-Surface Tools Included to Remove Dirt, Grime, Grease, and More, 39N7A",
        "price": "$41.19",
        "originalPrice": "",
        "rawPrice": 41.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BISSELL-SteamShot-Sanitization-Multi-Surface-Included/dp/B001EYHAGS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C21NZYKG"
        ],
        "asinVariationValues": [
            {
                "asin": "B001EYHAGS",
                "variationName": "Style",
                "variationValue": "SteamShot Deluxe - Green",
                "price": "$41.19",
                "variationImageURL": ""
            },
            {
                "asin": "B0C1PVPVML",
                "variationName": "Style",
                "variationValue": "SteamShot Deluxe - White",
                "price": "$39.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41OFGMoTukL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/518OZc57ZzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EOWiaNtVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nDbhJjXaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51z6 zgW3jL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kETEQQhaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iw8q2SXkL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bissell Store",
            "link": "https://www.amazon.com/stores/BISSELL/page/22DE84A8-19D5-4224-9E34-B0BF39C41659?ref_=ast_bln"
        },
        "brand": "BISSELL",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 28546,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Friday, February 16. Order within 13 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "EVERY PURCHASE SAVES PETS. BISSELL proudly supports BISSELL Pet Foundation and its mission to help save homeless pets.Water Filter: No.Carry Handle : Yes",
            "CLEAN AND SANITIZE WITH THE POWER OF STEAM. 1000 watts of steam power to eliminate 99.9 percent of germs and bacteria from a variety of hard surfaces. Use as instructed. Results may vary. Tested under controlled laboratory conditions without tools.",
            "CHEMICAL FREE. Completely Chemical-Free With No Harmful Fumes Or Residue",
            "1000-WATT POWER RATING. Power Cord Length Is 20 Feet",
            "10 MULTI-SURFACE TOOLS INCUDED. Includes Accessory Nozzle, Extension Hose, Flat Scraping Tool, Grout Brush, Fabric Steamer, Window Squeegee, Angle Concentrator, And Detail Brush. Bristles on brushes may deform over time with the combination of high-heat and friction.",
            "ON-DEMAND STEAM TRIGGER. Control the amount of high-pressure, high-temperature steam. 6. 6 Ounce. Heater Warm-Up Time: 30 Seconds. Ships In Certified Frustration-Free Packaging",
            "Always unplug your steam shot before filling-refilling. Press trigger until steamer depressurizes, Wait 5 minutes before removing cap. Be sure to use an oven mitt in case the cap is still hot."
        ],
        "description": "Steam Shot Deluxe Hard-Surface Cleaner, 39N7A by BISSELL Steam Mop & Hard Floor Cleaners Get rid of your mop and bucket and get the all-natural, barefoot clean floors you’ve always wanted with BISSELL steam mops. They’re easy to use and heat up in about 30 seconds. Steam It To Clean It Clean and sanitize when used as directed in one easy step. Steam is an all-natural cleaner that can sanitize when used as directed, clear sticky spots and eliminate dirt–all without the use of harsh chemicals. Steaming is safe on virtually all sealed hard surfaces including: ceramic, vinyl, laminate, granite, marble and sealed hard wood. Drying takes just seconds, so it’s easy to clean anytime, anywhere. From showers and windows to counters and floors, there isn’t a surface that can’t be cleaned with steam. For tackling tough grime on above floor surfaces, we recommend a hand-held steam cleaner. Steam Cleaners: The Cutting Edge of Clean Steam cleaning kicks traditional mopping right in the dirt. It’s quick and easy. So say goodbye to your old, dingy mop and bucket, and hello to a new kind of clean. The high temperature of steam sanitizes floors when used as directed and penetrates deep into cracks and crevices without the use of cleaning chemicals, which are not only costly, but can leave behind residue. Steam cleaners don’t just remove left-behind dirt and residue; they eliminate many germs and bacteria when used as directed. And they do all of this with less water than mopping. What’s more, the steam dries in seconds so you can clean and be on your way. Forget scrubbing your floors with harsh chemicals and sanitizers and let the power of steam do the dirty work for you, when used as directed Handheld Steam Cleaner Take the all-natural power of steam wherever you need to clean with a hand-held steam cleaner from BISSELL. Remove tough grime from hard surfaces like showers, windows, and countertops—all without harsh chemicals. Easy to press trigger activates powerful steam cleaning Perfect for hard to reach placesPowerful high pressure steam cleaning with Steam on Demand Trigger100% chemical freeIncludes fabric steaming tool",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b?ie=UTF8&node=510106"
            },
            {
                "name": "Steam Cleaners, Steam Mops & Accessories",
                "link": "https://www.amazon.com/Steam-Cleaners-Steam-Mops-Accessories/b?ie=UTF8&node=11333725011"
            },
            {
                "name": "Handheld Steamers",
                "link": "https://www.amazon.com/handheld-steamers/b?ie=UTF8&node=3303862011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Bissell"
            },
            {
                "name": "Special Feature",
                "value": "Steam Cleaning"
            },
            {
                "name": "Surface Recommendation",
                "value": "Tile and Grout. Kitchen and Bath surfaces"
            },
            {
                "name": "Model Name",
                "value": "BISSELL 39N7A Steam Shot Deluxe Hard-Surface Cleaner"
            },
            {
                "name": "Included Components",
                "value": "BISSELL SteamShot"
            },
            {
                "name": "Wattage",
                "value": "1000 watts"
            },
            {
                "name": "Item Weight",
                "value": "6 ounces"
            },
            {
                "name": "Tank Volume",
                "value": "6.6 Fluid Ounces"
            },
            {
                "name": "Item Display Dimensions",
                "value": "5 x 9.5 x 8.5 inches"
            },
            {
                "name": "Color",
                "value": "Steamshot Deluxe - Green"
            },
            {
                "name": "Power Source",
                "value": "Power Cord - AC"
            },
            {
                "name": "Capacity",
                "value": "6.6 Ounces"
            },
            {
                "name": "Style",
                "value": "SteamShot Deluxe - Green"
            },
            {
                "name": "Product Dimensions",
                "value": "5\"D x 9.5\"W x 8.5\"H"
            },
            {
                "name": "Manufacturer",
                "value": "Bissell"
            },
            {
                "name": "ASIN",
                "value": "B001EYHAGS"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "39N7A"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 28,546 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#40 in Home & Kitchen (See Top 100 in Home & Kitchen) #1 in Handheld Steamers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Mildew-resistant",
                "value": "Chemical free"
            },
            {
                "name": "Care instructions",
                "value": "Always unplug your steam shot before filling-refilling. Press trigger until steamer depressurizes, Wait 5 minutes before removing cap. Be sure to use an oven mitt in case the cap is still hot."
            },
            {
                "name": "Specifications",
                "value": "certified frustration-free"
            },
            {
                "name": "Warranty Description",
                "value": "Limited 1 year."
            },
            {
                "name": "Batteries required",
                "value": "No"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Cleans and Sanitizes* with the Natural Power of Steam *Use as instructed. Results may vary. Tested under controlled laboratory conditions without tools.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c1e402d5-cabf-48c7-9f28-e04c6e9019bc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Includes 10 Tools. Clean and Sanitize* Multiple Surfaces. *Use as instructed. Results may vary. Tested under controlled laboratory conditions without tools.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cf4f18c8-7f9b-4a53-a676-1a4561f5e288.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Multi-Purpose Scrubbing Brushes Three color-coded round brushes, designate for specific rooms or for use on different messes. Grout Tool Scrubs and cleans grout across a variety of hard surfaces. Flat Scraper Tool Scrapes hard, stuck-on messes across surfaces like microwaves, stovetops, ovens, and more. Angle Concentrator Tool Directs steam into hard-to-reach areas. Window Cleaning Tool & Extension Hose Steam cleans and squeegees flat surfaces like windows, glass and mirrors. Fabric Steamer Tool & Cloth Refreshes clothing, furniture, pillows, drapes, and more.",
                "media_link": []
            },
            {
                "media_text": "Eliminates 99.9% of Germs & Bacteria* Powerful, high-pressure, high-temperature handheld steam cleaner works to sanitize a variety of hard surfaces in your home. *Use as instructed. Results may vary. Tested under controlled laboratory conditions without tools. 100% Chemical-Free Cleaning Safe to use around kids and pets when used as directed.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/237e8799-5e6e-474f-b237-f38a011f743a.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/75d8d5c9-2370-4f8e-bd78-e814c7ec0b9a.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/c1e402d5-cabf-48c7-9f28-e04c6e9019bc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cf4f18c8-7f9b-4a53-a676-1a4561f5e288.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9846b8a2-5df7-4fa6-86ae-cc8bd4eeaf87.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bef8f94a-2a10-4a64-a00f-cdeab667e683.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b65cd2ce-754c-40b5-839a-e226a2668408.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/63e94e0d-9c53-42c3-8bdc-a9cd1e951626.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a02fc013-9b97-4afc-8332-dd3ee37dc444.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/024bdb06-a764-40d8-8510-747a2b01bd74.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/237e8799-5e6e-474f-b237-f38a011f743a.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/75d8d5c9-2370-4f8e-bd78-e814c7ec0b9a.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d99e94a2-6478-44bd-9d29-f0fac708c63c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/a54b4666-acec-4d38-867b-e7f4ff9cac23.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "wild animals",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGB3YZIRHOSAZGQF3NRHKQJWWQTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13BL8Q0LXBZJR?ASIN=B001EYHAGS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Saves a ton of work, has a few issues",
                "reviewText": "I can't believe how much stuff this steamer comes with for this price, especially since it actually works really well lol. I didn't realize it came with a hose or squeegee, or garment steamer head! It's awesome. I just bought it impulsively because everyone recommends it and I needed a better one. All the stuff fits back in the box for storage pretty well too which is important to me because I lose things.This machine is worth the price just for how much easier it makes cleaning the fridge. It's so much less painful for me that I can do it way more often. I don't have to take everything out or wash the big glass shelves in the bathtub. I'm not getting soapy water in/on my food or forgetting stuff on the counter to go bad.This machine is so much better than my last one, too. It's so much less awkward and easier to use. I've used it on tons of surfaces now with dried on or baked on stuff that I couldn't easily get off with different scrubbers and cleaning chemicals. Steam is so much faster and easier. I don't have to rinse off bubbles/chemicals for 2 hours or keep refilling a hot water bucket. It comes with a ton of little attachments that are actually useful.The things I don't like about this device are that if you use the hose, the steam button is only on the machine and it can't be locked down. There's no button on the hose. You have to hold the button down on the machine with one hand and use the hose in the other hand. It means if you want to use a rag or brush or anything between bouts of steam, you have to keep switching hands. You also can't, like, brace a grill or rack with one hand while you steam with the other, because both hands have to hold the steamer. If you only have use of one hand you probably just can't use the hose by yourself without like, taping the button down. I know it would have cost more to also activate the steam from the hose, so I see why that might not be an option. But you should at least be able to lock the existing button down or something like that. Lots of steam cleaners have always-on steam so it wouldn't be less safe than those.The machine is shaped like a kettle bell or something lol. The bottom surface is round and tiny. Since the machine has a hose that puts weight on one side, and it's all round, it should have a big flat bottom so it won't roll over all the time. It's pretty annoying trying to keep it standing up when you set it down for a second. It just rolls over. Even without the hose, the shape is so strange and unstable that it takes too much thought to set it down properly.There's no low water indicator or water level window etc. I thought the water tank was empty because the steam lost power, but there was a lot left. (I think I just needed to let it reheat before continuing to use it, but I didn't realize.) You aren't supposed to overfill it, but if it's not empty you can't tell how much is left in there so you can't know how much to put in. Since I'd already spent the time to depressurize the machine, I emptied the tank so I could be sure to refill it with the correct amount of water. Of course I burned myself. I wish it had a better way to tell how much water is left.The orange \"heating\" indicator light is on the bottom where you can't see it when you're holding it in your left hand. It should be higher up and visible from both sides.I think that's it! I really like it but it would be a thousand times better if the button locked.",
                "reviewVotes": "466 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTTWUUXYLJICLDG7BJGDKE45MLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q7VRY8BY0DDA?ASIN=B001EYHAGS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing Product",
                "reviewText": "Rating: ⭐⭐⭐⭐⭐ (5/5)The Bissell Steamer has been an absolute game changer in my cleaning routine, and I couldn't be happier with this fantastic appliance. Here's why I love it:**Effortless Cleaning: ⭐⭐⭐⭐⭐ (5/5)**Using the Bissell Steamer is a breeze. It's so easy to fill with water and get started. The controls are intuitive, making it simple to adjust the steam for different cleaning tasks.**Impressive Cleaning Power: ⭐⭐⭐⭐⭐ (5/5)**The cleaning power of this steamer is incredible. It tackles everything from tough stains on my kitchen floor to grime in the bathroom with ease. It's like a magic wand that makes dirt and mess disappear without the need for harsh chemicals.**Versatile Cleaning: ⭐⭐⭐⭐⭐ (5/5)**I love the versatility of the Bissell Steamer. It comes with a variety of attachments for different surfaces, so I can use it all over my home. From steam mopping my floors to deep cleaning upholstery, it does it all.**Rapid Heating: ⭐⭐⭐⭐⭐ (5/5)**The quick heating time of the Bissell Steamer is a huge plus. It's ready to go in no time, which is perfect for those spontaneous cleaning sessions when you want to tackle a mess right away.**Chemical-Free Cleaning: ⭐⭐⭐⭐⭐ (5/5)**One of the best things about this steamer is that it cleans without the need for chemicals. It uses the power of steam to sanitize and disinfect, which is great for the environment and my family's health.**Low Maintenance: ⭐⭐⭐⭐⭐ (5/5)**Maintenance is a breeze with the Bissell Steamer. Cleaning the machine is simple, and the reusable microfiber pads can be easily washed and reused, saving both time and money.**Durable Build: ⭐⭐⭐⭐⭐ (5/5)**The Bissell Steamer is built to last. Its robust construction and high-quality materials give me confidence that it will continue to serve me well for years to come.In conclusion, the Bissell Steamer has made cleaning my home more efficient, effective, and eco-friendly. It's user-friendly, versatile, and delivers outstanding results. If you want to simplify your cleaning routine and achieve spotless, germ-free surfaces without the use of harsh chemicals, I wholeheartedly recommend the Bissell Steamer. It's a must-have addition to any household, and I can't imagine cleaning without it!",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 26, 2023",
                "reviewTitle": "Fácil de usar y funciona muy bien",
                "reviewText": "La uso para quitar manchas y mugre. Funciona muy bien.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex Starkovski",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 12, 2023",
                "reviewTitle": "game changer",
                "reviewText": "finally finished all the final touches on my first place & for my one deep clean of the week, this is an essential. it does everything you need it for, once used once, everything is easier to maintain. you’ll always have a clean home.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 12, 2023",
                "reviewTitle": "Nul",
                "reviewText": "ça semblait prometteur mais à la 2ème utilisation l'appareil ne chauffe plus, ne fait aucune vapeur.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alliev",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 14, 2023",
                "reviewTitle": "Cleans beautifully",
                "reviewText": "The machine is compact and easy to handle. A good selection of heads for different surfaces requiring cleaning. Cleaned door knobs, faucets and kitchen fan screens well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "silvio navarro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 29, 2019",
                "reviewTitle": "Bueno",
                "reviewText": "Funciona bien. Elimina realmente las manchas entre las lozas entre otros usos. Recomendado.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}