{
    "remaining_requests": 31627,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bissell-PowerFresh-Lift-Off-Bathroom-1544A/dp/B011LS47SA",
    "body": {
        "name": "Bissell PowerFresh Lift-Off Pet Steam Mop, Steamer, Tile, Bathroom, Hard Wood Floor Cleaner, 1544A, Orange",
        "price": "$137.99$65.06",
        "originalPrice": "$137.99",
        "rawPrice": 137.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bissell-PowerFresh-Lift-Off-Bathroom-1544A/dp/B011LS47SA",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07XDW8RBM"
        ],
        "asinVariationValues": [
            {
                "asin": "B011LS47SA",
                "variationName": "Style",
                "variationValue": "Powerfresh",
                "price": "$137.99",
                "variationImageURL": ""
            },
            {
                "asin": "B084CGV789",
                "variationName": "Style",
                "variationValue": "Powerfresh Lift-Off + Eucalyptus Mint Water",
                "price": "$145.98",
                "variationImageURL": ""
            },
            {
                "asin": "B06X9W4LYZ",
                "variationName": "Style",
                "variationValue": "Powerfresh Lift-Off + Pads & Disc Kit",
                "price": "$153.94",
                "variationImageURL": ""
            },
            {
                "asin": "B084CHFJPC",
                "variationName": "Style",
                "variationValue": "Powerfresh Lift-Off + Spring Breeze Water",
                "price": "$142.98",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/414iBfoqKoL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51bqq2cP0GL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EbIibWrLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51eBlCJHo1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519ng43ZiFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZUbMIPfZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rpi-3v4OL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bissell Store",
            "link": "https://www.amazon.com/stores/BISSELL/page/22DE84A8-19D5-4224-9E34-B0BF39C41659?ref_=ast_bln"
        },
        "brand": "BISSELL",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 3591,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 21 hrs 39 mins",
            "FREE delivery Monday, February 19",
            "Or fastest delivery Saturday, February 17. Order within 16 hrs 9 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Every BISSELL purchase helps save pets. BISSELL proudly supports BISSELL Pet Foundation and its mission to help save homeless pets..Power Source : Battery Powered",
            "A Safer And Easier Way To Clean Homes With Pets. No Need To Use Harsh Chemicals On Your Floors",
            "The Lift-Off Pet Model Features A 2-In-1 Steam Mop, Allowing You To Tackle Pet Messes Both On And Above Your Floors",
            "The Lift-Off Pet Model Includes 13 Versatile Tools For Use With The Handheld Steam Cleaner; Heater Warm-Up Time: 30 Seconds",
            "Eliminate 99. 9% Of Germs And Bacteria With The Natural Power Of Steam. Power Rating : 1500 Watts",
            "Includes Microfiber Soft Pad, Microfiber Scrubby Pad, Odor Eliminating Fragrance Discs, Attachable Water Cup, 13 Tools With A Tool Bag, And A Microfiber Towel. Power Cord Length_25 feet"
        ],
        "description": "The BISSELL Power Fresh Lift-Off Pet provides pet parents a safer and easier way to clean up after their pets using the natural power of steam. This 2-in-1 steam mop features a removable Lift-Off pod for above floor cleaning and includes 13 versatile accessories to help with your everyday cleaning as well as cleaning up after your pets. Cleaning with steam provides a chemical-free clean, so pet parents don't have to worry about putting toxic chemicals down on their floors. *When used as directed, using the microfiber pads. Buying this product saves pets. BISSELL proudly supports BISSELL Pet Foundation and its mission to help save homeless pets. When you buy a BISSELL product, you help save pets, too. We’re proud to design products that help make pet messes, odors and pet homelessness disappear.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510106"
            },
            {
                "name": "Steam Cleaners, Steam Mops & Accessories",
                "link": "https://www.amazon.com/Steam-Cleaners-Steam-Mops-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11333725011"
            },
            {
                "name": "Steam Mops",
                "link": "https://www.amazon.com/Steam-Mops/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3303861011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Bissell"
            },
            {
                "name": "Special Feature",
                "value": "On-Demand Steam"
            },
            {
                "name": "Surface Recommendation",
                "value": "Tile,Floor"
            },
            {
                "name": "Model Name",
                "value": "PowerFresh Lift-Off Pet Steam Mop,1544A"
            },
            {
                "name": "Included Components",
                "value": "PowerFresh Steam Mop"
            },
            {
                "name": "Wattage",
                "value": "1500 watts"
            },
            {
                "name": "Item Weight",
                "value": "10.6 pounds"
            },
            {
                "name": "Color",
                "value": "Orange"
            },
            {
                "name": "Power Source",
                "value": "Corded Electric"
            },
            {
                "name": "Style",
                "value": "Powerfresh"
            },
            {
                "name": "Product Dimensions",
                "value": "13.2\"D x 11.14\"W x 44.7\"H"
            },
            {
                "name": "Manufacturer",
                "value": "BISSELL HOMECARE INC."
            },
            {
                "name": "ASIN",
                "value": "B011LS47SA"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "1544A"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 3,591 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#109,166 in Home & Kitchen (See Top 100 in Home & Kitchen) #42 in Steam Mops"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Always follow user guide for safe use."
            },
            {
                "name": "Assembly required",
                "value": "Yes"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "Limited 2 years."
            },
            {
                "name": "Batteries required",
                "value": "No"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LapisLapis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH65TYGKPTLAMWA7O7R557CLL7BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JJ394MRSTMTY?ASIN=B011LS47SA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2022",
                "reviewTitle": "5.0 out of 5 stars Holy STEAM! This thing really WORKS!!",
                "reviewText": "I must start out by saying, I did a ton of research before settling on this manufacturer and model of steam mop. A TON! And at the end of my search, I settled on this one, which seemed like a pretty good deal because it also included an extra mop cover and attachments.The first place I tried this mop was in the kitchen, with our horrible old linoleum floor. It’s ancient and has lots of issues, but I just wanted to finally get it as clean as possible while we’re waiting on the start of our remodel. Just using the standard mop cover that came with the steam mop, I gently pushed it across the floor and HOLY STEAM! It left a clean, slightly damp streak across the floor. My husband just happened to walk in when I did it and he was shocked it how much cleaner that section of floor was. The other side benefit to using a steam mop, is that it dries TONS FASTER than a traditional mop. I also DIDN’T USE any CLEANING PRODUCT, so there were no residual chemical scents in the kitchen when I finished, which is also a nice bonus.Once the floor was finished, I moved to the tile counter, which was even worse than the floor. The old grout was stained, chipped, and filthy. I had scrubbed and scrubbed at it in the past, but even after breaking a sweat, it hardly showed. With the angled brush head, I was able to remove a lot of the crud. The steam just blasted most of it off the grout! And again, I did this with steam alone, which means that once it is dry, I can refill some of those missing grout lines, to prevent some of this mess in the future. Although there are gaps in the grout, it looks SO MUCH BETTER! (The before picture is not the full counter, but this was the only one I took before I cleaned it. It was so embarrassing!)Very happy with this unit and can’t wait to start using it on the remodeled kitchen. It certainly makes these kinds of chores much easier, if not a little fun!",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712VARbFn7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71JDeNZmw+L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miss K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJ72BQYUHOQRCSV5NVGY2R6ML3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35KGWTHHAR51H?ASIN=B011LS47SA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 26, 2021",
                "reviewTitle": "5.0 out of 5 stars I have waited a decade for steam mop I like- This was it.",
                "reviewText": "-This is the one I picked after a decade of wanting a steam mop and trying various brands and styles.-Very versatile and easy to use-Pretty quiet in the mop configuration, louder in the handheld configuration ( like a vacuum)-Holds up pretty well to a lot of use-Loved it for deep cleaning the grout on the counter and floors-Recommend that you get extra mop pads (that way you can get a bunch dirty= less loads of laundry)-Recommended extra grout head if you have lots of grout (If you need to do a lot of deep cleaning)-I have yet to need to use the extra steam setting, it is just that effective (without ruining my floors or counters)-To me, worth the bit of space it takes up, even if I still lived in an apartmentI have wanted a steam mop for the last decade or so and chose this one out of all the ones that I have tried via friends and family. All the attachments and the fact that it can become hand held has made deep cleaning all parts of the house easy. I used it initially to deep clean the ground on the counter and then the floors in the kitchen and It did an amazing enough job that I discovered that the grout was not the color I grew up thinking it was. I did hand scrub it in the past, but I clearly didn't get it as clean as I thought I was. The main reason I got a steam mop was because I do not like the feel of the floors after using other mopping options and this is a no chemical way to keep up after kids and messy adults. The floors dry quickly, also perfect with kids and pets running though, and there is no smell. I don't really care for fragranced things, but there are options you can get for the mop pads. I did get extra mop pads so that I can get a bunch dirty and then wash them all together instead of just the two that it comes with. That and to get an extra grout scrubber head attachment would be my additional recommendation. When using the handheld side of things, it can be a bit loud, but it is not outrageously loud. I would put it up there with a vacuum. In just the mop configuration it is pretty quite. I put it through its paces the first few days that I got it and it has held up really well over the last couple of months. There is a window attachment that I tried for fun and I am not totally sold on it, but that is also probably user error. It would be great if there was gunk on the window though. I am also sure that you could manage to set it up to steam your clothes.Lastly, I like it enough and have talked enough good things about it that my aunt and father want to borrow it. They both have tried various steam cleaners over the years too and know that I do not recommend things lightly.Good luck and happy cleaning!",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 24, 2019",
                "reviewTitle": "Full steam ahead!",
                "reviewText": "My purchase was from the Amazon Warehouse and I was very happy with it, came in the box with all its parts. The indicated \"minor defect\" scuffs were literally just that, the slight marking or imperfection, but overall it was a fair amount cheaper than brand new.The unit came packaged well and it wasn't hard to piece the parts together for a first test. The accessories come in a black Bissell bag, but it's just a basic drawstring bag so it doesn't separate the components.The water receptacle is a bit annoying. You have to put the machine on its side to fill it, since the water plug is on the side of the cannister. That means you have to turn it off, flip it to it's side, line up the pouring cup, then fill -- unlike other smarter designs where the filling process is upright. Being sideways, it's harder to gauge how full it is. My previous steam mop would fill while standing with a vertical indicator line with the floating ball marker, so knowing when it was full was easy. Not so with this one, you just have to eyeball the receptacle and overflowing has happened to me. It doesn't feel like it holds much water.After that, the mop doesn't take long to heat up. I tested the mop with the mop head cloth with the cleaning grips at the bottom, and added 1/4 of the scent disk. The 1/4 was too little, didn't notice much of a scent. The steaming mode has a low and high setting. It's a quieter steam mop than my previous Dirt Devil. It doesn't make all the hissy bubbly theatrics, making it seem like it's not as hot, but if you feel the freshly steamed surface, you would know it is hot.I found the large rectangle mop head to be too clunky. It's great in open spaces but once you hit a corner or an object it becomes a manuevering battle. The triangle shape was much more useful in this regard. If this mop had an option for a triangle floor mop attachment as well as the rectangle, that would be perfect.Speaking of options, to get into smaller spots it is easy to convert it to a handheld steam mop. I used it with the grout cleaning tip and the flat hand mop attachment. It was great for walls and floorboards. There is a lot more moisture in these modes so be careful with the hot water. I didn't quite find an attachment I loved for the corners of baseboards though, the grout cleaner bristles are a bit too rough on wall paint. It's easier just to add stream than use a different sponge or tool to clean the loosened dirt.Overall, even though it has a few kinks, for the price and for what you get out of this machine (there are so many applications I haven't yet tried), I can see it serving a home in so many ways that any minor flaws will remain just that. It's definitely something I'm glad to have in the arsenal for my home of 3 pets. It can be a quick-clean tool or a heavy duty-clean tool, adjusting to what you need it for.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TQ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 13, 2018",
                "reviewTitle": "Very well-made, lots of useful attachments, but a little bit cumbersome",
                "reviewText": "Shipped & arrived incredibly quickly but wasn't happy that Amazon didn't deliver to our door 👎 WTH Amazon? That was a very heavy box to carry any distance. Unfortunately for us, we decided to walk to the post office that day, so it was a long trek home 👎👎As for the unit itself: really well built, solid steam mop, as is the lift-off portion of the unit. Took all of 3 minutes, tops, to assemble - with only 1 screw. The handle attaches very securely, even with just that 1 screw. If you're looking for something like a Swiffer in size & weight, look elsewhere because this ain't no low-grade Swiffer.Comes with plenty of attachments, although I would've been happier with more microfiber cloths, rather than 3 of those knobby little scrubbers which won't get used very often. But for those who like them, they're as scratchy as steel bristle brushes.Bonus: everything actually does fit in the accessories bag provided, but would've been nicer to have a hard sided case for attachments to keep organized without anything falling out.The lift-off unit itself detaches & attaches very easily, and all accessories also connect & disconnect very easily. Just be careful of hot water or steam when switching them out, as I quickly found out. This thing gets blazing hot! Allow to cool before removing mop pads as well.It does make a bit of a knocking sound, which the small manual addresses, for those who bother to read it. It also seems to have some type of bearing inside. I initially thought it might have something loose inside, but it's fine.The mop head is ma-hoo-sive. This can be great when mopping large, open areas with little furniture, but can also be a major pain when mopping around furniture & toilets. Expect to have to move some furniture pieces when mopping.The steam comes out under high pressure, be aware. This isn't a crappy Swiffer. Be careful, especially as you get to know the machine & accessories. The bonus to this is that the mop & hand-held unit blast the dirt off. Took seconds to clean 2 large windows.Tested it on our laminate flooring, did a great job, no issues. The little scrubby thing at the back of the mop head is super handy & actually works. Flips down & back up in just a second, then the steam & microfiber take care of the rest.Tested it on our windows, did a great job there too. Crystal clear without even using the squeegee attachment, just the small microfiber cloth & attachment for flat surfaces. Spectacular results with no streaks or fibers left behind from the included microfiber pad. There was leakage of water around the window frames as the steam ran down the windows, be aware, so keep the included microfiber cloth handy.Now the CONS.This machine is a whole lot heavier than we expected, even without water in it. Even with the lift-off unit detached. I find it easier to attach the hose, sit the lift-off on a flat surface, and work like that. Saves my arms getting tired.Be careful when using the hose attachment & included accessories. I had some very hot water leak down the length of my arm. Wouldn't allow a child to use this machine for that reason. The risk of burns, especially with the power this thing shoots steam out of the unit, is very real.The cord is *obscenely* long. I was tripping over it, swearing as I was untangling it multiple times. Think like those old style Electrolux vacuum cleaner cords. Heavy duty, great quality, but still way too long.It should have come with a funnel accessory to help with filling. The included cup alone makes filling a pain. Fortunately for us, we have kitchen funnels.Overall, pretty happy with the unit. I think it'll get a lot of use. Will be steaming a piece of lambskin tomorrow with the fabric attachment to try & remove some wrinkles, as well as steaming our dog's indoor house, stuffed babies & bedding. Might actually be able to steam some gunk out of difficult to clean glass bottles as well with the hose attachment.Will be great for freshening up drapes, upholstery, shower curtains & other items around the house & car too.",
                "reviewVotes": "67 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sailorpussy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 10, 2023",
                "reviewTitle": "Buy it, you won't regret it",
                "reviewText": "This mop is the real deal. Cleans without a hitch and the cord is long enough. The scented pads are also nice, they leave the place smelling fresh when doing a quick clean. I add a bit of PineSol when deep cleaning.Only downside is that the cleaning pad gets dirty very fast (which means it works lol) but I don't machine wash them. I soak them in a bucket with 1 part bleach and 1 part vinegar, a dash of Resolve or OxiClean, dilute with water and let air dry. Works well to remove the stains, just not as white as the original out of the box. Overall great purchase, very satisfied!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Silver Fox",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 2, 2023",
                "reviewTitle": "Wanna find dirt?",
                "reviewText": "This was so awesome, cord could be a bit longer but manageable . If you want to know how clean your house is... buy this.. I was shocked how clean it made my floors, I couldn't believe it. I think this is a must have in any house hold!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kristy wood",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 13, 2019",
                "reviewTitle": "great product tho could use a little improvments",
                "reviewText": "the cord needs to be about 2 feet longer maybe 6. but it is long tho i just cannot reach the end of my hall without moving it still. i can get all but 4-5 feet of it. so if it was a bit longer just a littler that would be great. but it is much longer than anything else ive had. i like the multi attachments ect. tho i wish it came with one scent pack of the odour one and one of the spring breeze so we can try one of each not both the same. once i got the machine with all the parts as first one was missing one but they fixed it fast and sent me another one and i was up and running in no time at all. i wish it moved a bit better when it came to side to side ect. as i find if i use this one and the bottom piece moves around then the steamer part pops out of the handle and leaks water. so it needs work on the moving piece at bottom that gives you the moveablity not just back and forth movement. needs a little work on standing up as well. should be able to stand it up and not fall over but its difficult. or have something to attach it to wall or something some form or standing being more stable is all. overall is well worth it and much better than other models. but needs a little work in some area to be a fantastic piece of equipment. it wouldn't take much to push it that little more it needs either. i bet they would find many more willing to buy if it had some small simple little changes.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}