{
    "remaining_requests": 31868,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Conair-Ultimate-Garment-Steamer-White/dp/B004T7N6Y2",
    "body": {
        "name": "Conair Full Size Garment Steamer for Clothes, CompleteSteam 1500W,Grey",
        "price": "$72.99$58.51",
        "originalPrice": "$89.99",
        "rawPrice": 72.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Conair-Ultimate-Garment-Steamer-White/dp/B004T7N6Y2",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "36",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41R6yyMTgSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/3179pL3GhFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31pjeW9XFLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41n e5EEtCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51eGA9lNRZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41GXT6-YYeL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the CONAIR Store",
            "link": "https://www.amazon.com/stores/conair/page/0C2569DC-48C9-4E3D-8C3F-777F0E11BAE7?ref_=ast_bln"
        },
        "brand": "conair",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2230,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 6 hrs 40 mins",
            "FREE delivery Monday, February 19. Order within 21 hrs 10 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Full Size Fabric Steamer: This steamer featires 1500 watts of power, 45 second heat up and up to 70 minutes of high velocity continuous steam;",
            "Steaming Control: Features a telescoping pole for height adjustment and T nozzle with 5 foot cool touch insulated hose, 360 degree rotating hanger with clips for steaming pants, and easy roll casters so you can freshen all over the house",
            "Smoothes, Dewrinkles and Freshens: Features a removable, large capacity 80 ounce water tank that is easy to fill and an auto shut off when the water gets too low, plus cord wrap storage feature for easy storage",
            "Conair Fabric Steamers: Our garment steamers have earned the Good Housekeeping Seal and keep your clothing, upholstery, curtains and other home fabrics smooth and fresh. Check out entire line including handheld, upright and travel steamers",
            "Innovative Garment Care: From fabric shavers and traditional irons to garment steamers, both handheld and full size, we make high-quality garment care accessories"
        ],
        "description": "The Conair Ultimate Fabric Steamer gives you 1500 watts of steaming power. It will give you 90 minutes of constant steam and only takes 35 to 45 seconds to heat up. It has convenient clips for steaming pants and a rotating hanger for various other garments. And cleaning is a breeze with the easy empty release valve. It has a t-nozzle for optimum steaming and features a fabric hose.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Garment Steamers",
                "link": "https://www.amazon.com/garment-steamers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510248"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Conair"
            },
            {
                "name": "Color",
                "value": "gray"
            },
            {
                "name": "Product Dimensions",
                "value": "17.5\"L x 14.25\"W x 17\"H"
            },
            {
                "name": "Item Weight",
                "value": "10.4 Pounds"
            },
            {
                "name": "Style",
                "value": "Ultimate Fabric Steamer"
            },
            {
                "name": "Wattage",
                "value": "1500 watts"
            },
            {
                "name": "Voltage",
                "value": "230 Volts"
            },
            {
                "name": "Capacity",
                "value": "28 Liters"
            },
            {
                "name": "Manufacturer",
                "value": "Conair"
            },
            {
                "name": "ASIN",
                "value": "B004T7N6Y2"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "GS28"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,230 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#94,006 in Home & Kitchen (See Top 100 in Home & Kitchen) #62 in Garment Steamers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "1 year limited warranty"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Steamer"
            },
            {
                "name": "Import",
                "value": "Made in USA or Imported"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Conair Ultimate Fabric Steamer Never leave the house with messy, wrinkled clothes again. Easily smooth and freshen your garments with the Conair Ultimate Fabric Steamer. Conair has taken every advantage of its deluxe fabric steamers and put them into a compact, upright, very modern design steamer. It is not only easier to set up than an iron and ironing board, but it is also gentle to fabrics - from delicate, sheer curtains to upholstery to business suits.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/1e37e425-71ba-46c9-9758-0f57339e84c0._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "De-wrinkle and freshen The Conair Ultimate Fabric Steamer has all of the features that you need to smooth, de-wrinkle and freshen clothing, drapes, upholstery, and more! Rushing out the door? This advanced steaming system heats up to high-velocity steam in just 45-seconds. Conveniently hang garment on the 360-degree rotating hanger for a perfect, all-around wrinkle release. It also has clips for easily de-wrinkling pants. And with easy roll casters, you can take it anywhere to steam and freshen all over the house! AVE Money on dry cleaning With the Conair Ultimate Fabric Steamer, you get professional results without having to spend money on a professional dry cleaner. 1500 watts of power give you 90 minutes of continuous steam time and it features an energy-saving steam pause so you can efficiently and effectively smooth and freshen any garment. Plus, it kills dust mites and bedbugs. The Conair Ultimate Fabric Steamer is a household must-have. Ergonomically designed with you in mind The Conair Ultimate Fabric Steamer is designed with many features to ensure your comfort and safety during use. It has a T-nozzle and 5-foot cool-touch insulated hose. The telescopic pole easily adjusts to accommodate varying heights. It also has a removable, large-capacity 80 ounce water tank that is easy to fill and an auto shut off when the water gets too low. Plus, the cord wrap storage feature makes this upright steamer easy to store.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/865e86b3-0ea2-4dca-821c-fcb1975627ec._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/1e37e425-71ba-46c9-9758-0f57339e84c0._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/865e86b3-0ea2-4dca-821c-fcb1975627ec._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "victorsimpkins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUX737R2SXKD75D43G7XBGQP5ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R210EW2XSLMETS?ASIN=B004T7N6Y2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2020",
                "reviewTitle": "5.0 out of 5 stars GREAT VALUE - AN AWESOME STEAMER AT ANY PRICE!",
                "reviewText": "Clothes steamers have one basic job - heat up fast and provide great, continuous steam without coughing, spurting, dripping endless streams of water on you clothes, etc. This inexpensive CONAIR steamer does a better job of making billowing steam than any steamer I have ever owned or used, from pro Jiffy Steamers >$200 to <$15 cheap handheld steamers (good for travel and a few minutes of home steaming but not for everyday or prolonged use.) I've owned and replaced two PurSteam steamers during the past few years. I thought they were pretty great for the money, until the last one just died on me one day (a fatal water leak)) and then I discovered this undersung CONAIR STEAMER. This is the most awesome inexpensive steamer I have ever used. It puts out loads and loads of high-quality steam, without stopping; it just keeps on steaming. While the PurSteam models were constantly taking a break to recycle before they started steaming again (always at the wrong times, of course) the CONAIR STEAMER does not stop. It doesn't sprut tons of water (the occasional drops, yes) and its abundant hot steam takes care of wrinkles in a flash. To be sure, there are compromises in any item that functions at such a high level and sells for such a low price. The Conair Steamers doesn't like to move even though it's on castors, they're so cheap they hardly roll; the potential of tipping over the steamer when trying to move it is also too great. The tank and body of the steamer are made from plastic that seems adequate but not exceptional. The hose and wand and hanger support are great. An attachment brush for the wand head would be a really useful addition, even if made available at additional cost. The cord placement and the hose's stiffness will sometimes join forces to make moving the steamer even more of a pain. But none of these negative comments, at least during the past 2 months I've owned and used this steamer every day, not one of these shortfalls affects the basic operation of this unit. The CONAIR STEAMER is certainly a best buy in the world of clothes steamers for home. Its steam output can go up against ANY of its competitors at twice, 3x and 4x the price and hold its own. All for $45? Seems incredible but true. And when you've finished steaming all of your clothes, your sheets and blanket and draperies, drag the steamer into your bathroom and steam away every last germ, stain and spot on your tile, hardware and porcelain fixtures. You'll wonder how you ever lived without endless steam at your disposal 24/7/365! Nice job Conair! Thank you!",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "st",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5DDX7EV36B3DGOXMYV23UCNNOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YR8OCJOQYIP4?ASIN=B004T7N6Y2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 16, 2022",
                "reviewTitle": "5.0 out of 5 stars Good Quality - Safe and Built to Last",
                "reviewText": "I use this steamer every day! The steam output is very good! It heats up quickly and works consistently. This steamer is especially suited for use with delicate fabrics. When I used to iron my delicate fabrics, I would often burn them due to not knowing the right temperature settings. With this steamer, I don't have to worry that my delicate items will get ruined.The adjustable hanger height is ergonomic for easy use. It also has an important safety feature if the water runs out. This is one of the best purchases that I have made! It is an amazing value and a quality product!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JWXO",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVJDB4MG74UQSVMSS5B2G546DPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HHRJTDF96GRK?ASIN=B004T7N6Y2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2016",
                "reviewTitle": "5.0 out of 5 stars Great Product, does everything you want it to do.",
                "reviewText": "This product is phenomenal. I (husband) bought it so I could steam my clothes the night before work to save some time in the morning and it is great. It was very easy to set up and doesn't take up too much space thanks to the telescoping hanger pole. Clips and the bottom make it easy to secure any garment and steam out the wrinkles right away. It heats up in 30 seconds and once you turn it off the steam stops coming out (so you don't have to worry about cool down time like an iron) Also - you cant ruin your clothes! They're not going to burn or be destroyed if you stay on one spot too long, another bonus! I've noticed my wife using it too, even though she made fun of me after i used christmas money to buy it! If you don't like ironing, or have things that shouldn't be ironed (suits, nice dresses etc) then this is certainly worth the investment.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXTMAIXGMFGWWN5MT6XZNUWJQWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTJI85USZ8F56?ASIN=B004T7N6Y2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 5, 2022",
                "reviewTitle": "4.0 out of 5 stars Short hose",
                "reviewText": "I use professional steam irons at work. I can't see how it would be possible to have the same thing at home. There's just too much involved.With that said, I did have some idea of what would be required to get a good steamer for my home. I knew the little handheld ones would be a joke.This steamer works pretty good. Be sure to use distilled water please. You can buy a gallon for less than a dollar at the grocery store. Regular water has too much sediment and will clog your products quick.The steamers at work have some power behind the steam making it possible to get wrinkles out quickly. This steamer doesn't do that. I found I had to linger for a longer period of time over wrinkles. I think ironing would be quicker if that's an option. I'm always changing my curtains and you can't avoid wrinkles with them. After burning a hole in a curtain panel with my iron I decided a steamer would be a better option for me. I won't be taking the exuberant amount of time involved to steam my clothes though.Secondly, the hose. I'm 5'5\" and that's how high the hose reaches. I cannot reach above my head with it. While annoying, I believe I'm spoiled because of the freedom of reach I have at work with their steamers. It's not a deal breaker for me. After assembly the hose wouldn't reach the hanger at the top of the pole, but once the steamer was in operation the hose loosened up and fit comfortably where it's supposed to rest.I steamed 2 very wrinkled curtain panels and it took the whole tank and probably a half hour. I didn't time myself, might have been longer. I have low ceilings and was steaming under a smoke alarm. It caused the alarm to go off. Lesson learned.The clasps on the pole to hold your clothes are TIGHT! I'm 54 and my grip isn't what it used to be. I had to squeeze with all my strength to open one. I won't be able to use them.After all that complaining I do still recommend this product. As you can see, my complaints aren't all that severe. It holds a generous amount of water, doesn't leak, is quiet, and does get wrinkles out. I believe they put a lot of thought into making it and that it's price tag is fair if you plan to steam often. Take the time to read the directions sent with the product.As a person that gets paid to steam I'd like to make a couple recommendations to make your steaming easier.Go in the direction of the wrinkle. If it's a horizontal wrinkle then move the steamer head horizontal.For difficult wrinkles pull the fabric tight, run steam over it while holding the fabric tight, then remove the steam while holding the fabric tight, wait about 5-10 seconds then let go of the fabric.Be sure the wrinkle is getting the actual steam and not just the edge of your steamer head when going across the fabric.A steamer is not like an iron. You cannot press down on your fabric with it or you will make wrinkles that will be next to impossible to get back out. It's best to not touch the fabric with the steamer head at all and use your hands to make the fabric flat.",
                "reviewVotes": "87 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tracy Rees",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGW6HTQGMAQPVFASMQIQSENUGRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OOPCD5X15XF3?ASIN=B004T7N6Y2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Throw Out Your Ironing Board",
                "reviewText": "I steam almost everything, which is faster and easier than ironing. I had this model before and it lasted for years, so when it died I got the same one. Only complaint is the water tank is smaller on the new one.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cynthia Reyes Buck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHT7VLSHTK6B3VNM2ZI4TSHJZ3NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D0RJ84E8DW5J?ASIN=B004T7N6Y2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Steamer",
                "reviewText": "It steams to perfection!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alondra Meza Ortiz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 26, 2023",
                "reviewTitle": "LO QUE ESPERABA",
                "reviewText": "Me encantó mi plancha de vapor, quizá si es un poco complicado la primera vez acoplarse pero ya después sinceramente es muy fácil y práctica. Reconozco que tengo unas prendas muy complicadas de planchar debido al tipo de tela. Pero de manera general para mí tener este tipo de plancha en poco tiempo acabo todo lo que necesito planchar. Yo coloque unas prendas sobre la mesa para mejorar que marcará algunas líneas sobre las camisas principalmente y pantalones de vestir.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Prem verma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 25, 2023",
                "reviewTitle": "Poor quality",
                "reviewText": "When I received the the product I started it and eventually it didn’t produce any sort of steam it was I don’t know damaged or what but was not working and my experience was worst spending such a money for a product like this it not acceptable and on top it only has replacement policy so that a person can never get their money back what if I got another damaged piece after replacement who will be responsibleNot acceptable after paying this much money",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cass",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 3, 2020",
                "reviewTitle": "Great steamer, easy to use, long shelf life",
                "reviewText": "I purchased this a few years ago and it still works great. Would not trade this is for anything else. It was my first steamer and hopefully my last!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Armida Ramirez Gines",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 19, 2023",
                "reviewTitle": "Una excelente plancha y a buen precio.",
                "reviewText": "Excelente plancha y a buen precio",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas Delevacque",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 3, 2016",
                "reviewTitle": "Good steamer",
                "reviewText": "Good price and good product. Easy & good performance. Cord could be a bit longer but ok, does the job",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}