{
    "remaining_requests": 31916,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Conair-Extreme-Steam-Fabric-Steamer/dp/B006CR9KGA",
    "body": {
        "name": "Conair Handheld Garment Steamer for Clothes, ExtremeSteam 1200W, Portable Handheld Design,White/Blue",
        "price": "$26.24",
        "originalPrice": "$44.99",
        "rawPrice": 26.24,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Conair-Extreme-Steam-Fabric-Steamer/dp/B006CR9KGA",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B093TR3DJG"
        ],
        "asinVariationValues": [
            {
                "asin": "B006CR9KGA",
                "variationName": "Color",
                "variationValue": "White/Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41QaPG-qb1L._SS36_.jpg"
            },
            {
                "asin": "B07J71917T",
                "variationName": "Color",
                "variationValue": "White/Light Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31zV92Qsb7L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41QaPG-qb1L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51hwB ULczL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vNSrfnysL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412m arFiYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512GfWIhjKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wM0zDEkAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51PMQUBiKJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71seBCK56zS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91SZnhEdNEL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the CONAIR Store",
            "link": "https://www.amazon.com/stores/conair/page/0C2569DC-48C9-4E3D-8C3F-777F0E11BAE7?ref_=ast_bln"
        },
        "brand": "conair",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 13246,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 21 hrs 15 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 21 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Faster and Easier Than Ironing: The steam trigger provides constant steam to remove wrinkles, and it features an energy-saving steam pause feature. Kills 99.9% of germs as well as dust mites and bed bugs.Voltage : 110 Volts",
            "Handheld Fabric Steamer: This 1200 watt handheld fabric steamer uses dual heat technology with two heat settings, it can handle most fabrics, from heavy cotton and wool to delicate satin and silk",
            "Special Features: This professional quality garment steamer includes an easy-to-fill removable water reservoir and 3 removable attachments: fabric brush, creaser, and soft cushion brush",
            "Conair Fabric Steamers: Our fabric steamers keep your garments, upholstery, curtains and other home textiles smooth and fresh. Check out entire line including handheld, upright and travel steamers",
            "Innovative Garment Care: From fabric shavers and traditional irons to garment steamers, both handheld and full size/upright, we make high-quality garment care tools for all users"
        ],
        "description": "Product Description Introducing the Conair Extreme Steam hand held fabric steamer with dual heat. Extreme Steam Dual Heat Technology creates concentrated steam, up to 30% hotter, to penetrate heavier fabrics and release wrinkles 5x faster than other steamers. It even kills dust mites & bed bugs. Heating up in 40 seconds for 10 minutes of steam time, this must-have brings garments back to life. Two heat settings take care of a range of fabrics, like wool, cotton, silk, satin and more. It has a 1200-watt dual heater system and includes 3 removable attachments: fabric brush, creaser, and soft cushion brush. It comes with a removable water tank and 9-foot power cord for safe and convenient movement. It also features steam trigger with built in switch for constant steam and energy-saving steam pause. Limited one-year warranty. Kills 99.9% of Bacteria ( Bacteria reduction rate was measured after exposing the tested bacteria samples for 1 minute at a 1cm distance from the garment steamer’s faceplate. Bacteria tested were Methicillin-resistant Staphylococcus aureus (MRSA) and Klebsiella pneumoniae.)；The product voltage arrange is 110V From the Manufacturer Conair GS23 Extreme Steam Handheld Fabric Steamer with Dual HeatProfessional style steaming – at home!Skip expensive dry cleaning services and get convenient and fast professional results at home with the Conair GS23 Extreme Steam Handheld Fabric Steamer with Dual Heat! 1200 watts of power give you concentrated steam in seconds for a 30 percent hotter steamer that covers 5 times as much surface area. Effective on all fabrics, liners and drapes, this high quality steamer includes three removable attachments that give you versatility for all your steaming needs.Dual heat technology for a thorough cleanThe Conair GS23 Fabric Steamer uses dual heat technology that provides you with faster, hotter steam for better results! With 2 heat settings, it can handle just about any fabric. A 395 degree setting tackles cotton and wool while a 200 degree setting handles satin, silk, nylon and polyester. Wrinkles vanish under 1200 watts of power. Plus, it is incredibly efficient with a 45-second heat up and 15 minute steam time. You get quality that's fast and convenient!User friendly features make use quick and easyWith the Conair GS23 you get effortless professional results with an easy to use steamer that includes all the features you need to get the job done! Features include a yellow power light indicator and a green ready light indicator. It has a steam trigger with a built-in switch for constant steam and an energy-saving steam pause feature. The slide switch allows you to customize your heat settings from low to high temperatures. The water reservoir is easy-to-fill and locks in to the steamer. It is lightweight and ergonomically designed with a 9-foot power cord for easy maneuverability.Versatile attachmentsThis advanced fabric steamer is perfect for handling all types of fabrics, liners and drapes. It also includes three different removable attachments to bring your garments back to life. The attachments include a fabric brush, creaser attachment and soft cushion brush for a customizable steaming experience.What's in the box?Handheld fabric steamerFabric brush attachmentCreaser attachmentSoft cushion brush",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Garment Steamers",
                "link": "https://www.amazon.com/garment-steamers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510248"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Conair"
            },
            {
                "name": "Color",
                "value": "White/Blue"
            },
            {
                "name": "Product Dimensions",
                "value": "7.5\"L x 5.8\"W x 13\"H"
            },
            {
                "name": "Item Weight",
                "value": "0.01 Ounces"
            },
            {
                "name": "Style",
                "value": "Extreme Steam"
            },
            {
                "name": "Wattage",
                "value": "1200 watts"
            },
            {
                "name": "Voltage",
                "value": "110 Volts"
            },
            {
                "name": "Heat Time",
                "value": "40 seconds"
            },
            {
                "name": "Product Benefits",
                "value": "Removes Wrinkles"
            },
            {
                "name": "Manufacturer",
                "value": "Conair"
            },
            {
                "name": "ASIN",
                "value": "B006CR9KGA"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "GS23X"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 13,246 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,560 in Home & Kitchen (See Top 100 in Home & Kitchen) #3 in Garment Steamers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "Limited 1-year warranty"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Fabric Brush Attachment, Conair Extreme Steam Fabric Steamer With Dual Heat, Handheld Fabric Steamer, Soft Cushion Brush, Creaser Attachment"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/a043c20a-36d7-4a97-9e85-96d52dc4375b.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9af129e9-e3b3-4ba0-9ca7-ab2b40439932.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0e1fb447-2dea-4ee1-9f68-b4e49194a8e4.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8678b033-dc88-41e2-bcfe-3ff0cfef3f4e.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "L. Gonzalez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ5GFG6ZPW6UPLZRA7GNXV5LNTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34R3S2ZH4BVMB?ASIN=B006CR9KGA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Great quality product for a great price",
                "reviewText": "I waited a little to write this review since I wanted to have used it for a while to see if I really liked it. I had used the conair turbo extreme steam before, the one that now costs around $70-$80 bucks, and was thinking of purchasing it again but we had bought it for around $40 just a few years ago, also I didnt want a normal iron since it would involve buying and taking up storage space for an ironing board too, so I continued to search and read a ton of reviews on several steamers when we stumbled upon this one on sale for $26, I am SO glad we made this purchase.It works just as good, heats up in minutes, puts out more than enough steam at a good temperature, wrinkles just dissapear on all kinds of clothing, it holds about the same water, and its not heavy to hold at all, I dont mind that it doesnt stand upright by itself since I can lay it on its side when i need to turn a garment over or whatever, I loooove the feature that lets me have continous steam so no more hurting my fingers from pressing a button for a while when steaming several items.Its very easy to use and set up, I like that its lightweight, it has a tiny spout for the water but I find it pretty easy to fill and empty the reservoir, and takes up very little space when not in use, so far, very happy with the quality and overall use of this product, would recomend!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vasiliki",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT7DSYQJCAVF3J42AWF7B4WJEWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMT9ZMB7OVKIK?ASIN=B006CR9KGA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars 5 Star",
                "reviewText": "I've been using the Conair Handheld Garment Steamer for Clothes for about a month now, and I absolutely love it. It's so easy to use, and it does a great job of removing wrinkles from all types of fabrics.I'm always on the go, so I appreciate how portable and lightweight the steamer is. It heats up in just 40 seconds.Overall, I'm extremely happy with the Conair Handheld Garment Steamer for Clothes. It's a great value for the price, and it's made my life so much easier. I highly recommend it to anyone looking for a convenient and effective way to remove wrinkles from their clothing.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTD2TZVAUGSY67O6AKINPO425TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JPXM3JBCPLMF?ASIN=B006CR9KGA",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Easy to use",
                "reviewText": "Easy to setup and use. I tested it on my curtains, it worked great. Only negative is it runs out of water quickly, and has to use distilled water.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEPMEBMQI6J7AQ3SCFIZANFTW5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11TR2MGGWHKEK?ASIN=B006CR9KGA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Gets Most Wrinkles Out ...",
                "reviewText": "It is a really good product . Would recommend for travel or just for home use . It will get most of the wrinkles out but nothing beats the good old ironing broad but if you can't iron then this is the next best thing . I use it on my silk scarves and on my shirts , works really well . For price , worth the money .",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebeca A. Collazo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUKEUXHGTV5EPMQSXC5QVGELHLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5DFUUKG5OG4D?ASIN=B006CR9KGA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2014",
                "reviewTitle": "5.0 out of 5 stars Surprisingly great little steamer!",
                "reviewText": "This little steamer is much better than I expected. My husband is a professional window treatment installer and he uses commercial grade steamers to remove wrinkles on fabric all the time. We have one at home to steam garments/shades and sanitize surfaces around the house, but it's big and heavy and not practical for small jobs. I needed something small to quickly steam a shirt or pair or pants that came out a bit wrinkled from the dryer. I have this little guy right next to my dryer in the laundry closet and in just a minute, I can steam any garment to perfection. The steamer works just as wells as the full size unit and even with cool extra features. The steam comes out quickly and it doesn't spit out or spill hot water like the big one does. I can turn it around in any direction and it doesn't spill. I love that you have the choice to have continuous steam (locked) or only when you push the trigger (unlocked) It also has two temperature levels (low/high) which is handy if you need to steam delicate fabrics like silk. It comes with three attachments that I find very useful: A clip on crease maker, a mini-brush and a lint remover.I also use it to clean up anything that needs to be disinfected like bathroom and kitchen countertops, doorknobs, faucets, etc. I even removed nasty baked on grease from my stove's burners by steaming them for a few seconds and then wiping with a dry paper towel! It is not magic though, there are some things that will stay, but 90-95% will just melt away and that's good enough for me.The only con is that it doesn't come with a wall mount, clip, bracket or anything like that. And it is a bit heavy and unbalanced and likely to fall down and break to pieces if left on top of a table or shelf.However, I am still very satisfied with my purchase, I would really recommend it to anyone who is a neat freak and wants to save some money on dry cleaning. And I am getting another one for my mom.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lily H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPA6UZ4WJZOFURL5WILCB5BAHBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK6N1PQ4RGGGH?ASIN=B006CR9KGA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars 6 years later still going strong",
                "reviewText": "I bought this steamer in 2017 and it recently stopped making steam so I came back here to get another one. I saw a review that said to try descaling it and wow it works great again! Super easy.. I just used distilled vinegar in the water tank and steamed it all out, then put distilled water to clear that and it works just as well as day one. So if anyone else is like me and needs a reminder to try cleaning/fixing things before sending them to landfill this one’s for you",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOQGAGFCVLKJBVBDOH3KEXS3CEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18V0A6WYVGIV8?ASIN=B006CR9KGA",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2023",
                "reviewTitle": "3.0 out of 5 stars Good steamer; package missing items",
                "reviewText": "This steamer works well but if the additional components are important to you, make sure you check the package because mine was missing two of three attachments. I don’t anticipate needing them and don’t feel like returning it just to get those but just be sure to check.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "justareadin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQA6QOEG77RCY3KUEP6FEDZRO5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CLTE83K7B5NT?ASIN=B006CR9KGA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Great steamer",
                "reviewText": "Great steamer! I wanted to use it in a travel trip. Its a bit large for travel but if I can fit it in the suitcase it's coming along!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorena Najera Buitron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 13, 2023",
                "reviewTitle": "Excelente plancha",
                "reviewText": "Amé mi nueva plancha ya que es súper funcional, dejá súper lisa la ropa en sólo unos minutos sin mayor esfuerzo. Decidí compararla, además de que tenía buenos reviews, porque vi que tenía la opción de poner un candado a la opción de vapor sin necesidad de tener que oprimir el botón todo el tiempo mientras planchas, eso facilita muchísimo la tarea y hace que no sea cansado. Si planchas una prenda difícil de planchar, es probable que el agua que colocas para el vapor sólo te alcance para esa prenda pero es muy fácil rellenar el contrenedor y para nada se derrama sobre la ropa mientras planchas.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 28, 2023",
                "reviewTitle": "Very good product",
                "reviewText": "It's working perfect, good for the money",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oniel Dsouza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 9, 2023",
                "reviewTitle": "Amazing product",
                "reviewText": "Conair steam iron is excellent we had come across this product in our Airbnb stay where we used it extensively to iron our clothes it was quick and effective . We were so happy with it that we just bought one for ourselves :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on October 7, 2023",
                "reviewTitle": "Do not buy this product if you want to use in Europe",
                "reviewText": "I don't even understand why this product is available in the Swedish Amazon. This is a 110 v and Sweden has 230 v. A voltage converter for a product like this that uses1200 watts cost more than the product itself and to return the product to the seller, the freight costs almost half the price of the product. Really bad of the Swedish Amazon to make this product available for sale in Sweden.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Will Stokes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 5, 2022",
                "reviewTitle": "A steamer that doesn’t …well…steam…",
                "reviewText": "After waiting an astronomical time for this product to arrive (I know It’s coming from stateside to the UK but maybe give more accurate lead times - we’ve used the product literally twice and now it doesn’t work.It just keeps making a clicking sound but no steam and what’s better just dribbled boiling water all over my foot from where the steam is meant to come out.ContactedLayger Customer ServiceAnd get a completely generalised “it’s out of 30 day Amazon’s return policy - sorry for any inconvenience” . Wow great help guys - my scolded foot thanks you. Appreciate you sending me a defective item and giving absolutely zero advice or a competent answer for taking my money",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}