{
    "remaining_requests": 31773,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Conair-Fabric-Steamer-Voltage-Clothes/dp/B0B3QYL568",
    "body": {
        "name": "Conair Travel Steamer for Clothes, Mini Garment Steamer, Fabric Steamer in White by Travel Smart",
        "price": "$27.25",
        "originalPrice": "$27.25",
        "rawPrice": 27.25,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Conair-Fabric-Steamer-Voltage-Clothes/dp/B0B3QYL568",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C7X8LCV8"
        ],
        "asinVariationValues": [
            {
                "asin": "B0062ACM7G",
                "variationName": "Style",
                "variationValue": "Green Fabric Steamer",
                "price": "$27.49",
                "variationImageURL": ""
            },
            {
                "asin": "B0B3QYL568",
                "variationName": "Style",
                "variationValue": "White Fabric Steamer",
                "price": "$27.25",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Z3sRHZepL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41T6AC-JxqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51I vhyWvJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417H1U7-ElL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61HJSlsBtQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qFllDK2WL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sRiOsZNVL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the CONAIR Store",
            "link": "https://www.amazon.com/stores/conair/page/0C2569DC-48C9-4E3D-8C3F-777F0E11BAE7?ref_=ast_bln"
        },
        "brand": "conair",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 1481,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 8 hrs 30 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 22 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Travel Like A Pro: This Conair Travel Smart Handheld Steamer provides 10 minutes of steam time in a compact design to help you keep your clothes fresh and clean wherever you go; fabric steamer fits conveniently in your luggage, making it ideal for air travel",
            "Portable Steamer for Worldwide Use: Dual-voltage travel steamer works everywhere your travels may take you; providing freshly steamed clothing ready for wrinkle-free wear!",
            "Compact and Easy to Store: Garment steamer comes with an 8-foot cord, a detachable bristle and lint brush, and a folding handle to easily store or stow in your checked baggage; travel steamer meets FAA, DOT and TSA requirements",
            "Travel Smart Travel Accessories: From packing cubes, neck rest pillows and travel size toiletry kits to hair dryers, plug adapters, curling irons, travel appliances and more, Conair Travel Smart travel accessories help you arrive in style",
            "Travel Steamer with Two-Year Warranty: Compact steamer for clothes comes with a limited two-year warranty; refer to user manual to troubleshoot the fabric steamer and for warranty information"
        ],
        "description": "Keep your clothes fresh and clean wherever you may roam with this handy portable garment steamer. Steam at most angles for 10 minutes at a time, and store easily with the folding handle. Worldwide dual voltage works everywhere, and the detachable bristle and lint brush provide an extra touch of perfection.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Garment Steamers",
                "link": "https://www.amazon.com/garment-steamers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510248"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.63 x 4.13 x 1.4 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.31 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Conair"
            },
            {
                "name": "ASIN",
                "value": "B0B3QYL568"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "TS184XRA"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 1,481 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#68,176 in Home & Kitchen (See Top 100 in Home & Kitchen) #48 in Garment Steamers"
            },
            {
                "name": "Skin type",
                "value": "Normal"
            },
            {
                "name": "Finish types",
                "value": "Demi-Matte"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Brand",
                "value": "Conair"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Style",
                "value": "White Fabric Steamer"
            },
            {
                "name": "Wattage",
                "value": "450 watts"
            },
            {
                "name": "Voltage",
                "value": "240 Volts"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dea19e5a-7f95-40a6-8f4c-888637d50f3e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4cf54bc9-45ea-4e51-8ea5-600052ba3dd0.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e0711303-f3a2-4889-b54d-1116dfe3b416.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2e5a916f-e044-4783-9cfe-50960d48096b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Morgan & Milo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOBHYG4ODKNFHLNW4Q4NXW6VUNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CLWC0KKWISY9?ASIN=B0B3QYL568",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Compact Powerhouse - Conair Travel Steamer",
                "reviewText": "I recently took the Conair Travel Steamer for Clothes on my trip to France, and I must say, this \"little\" steamer truly packs a punch! With the recent bed bug scares in Paris and other cities, I found an unexpected but incredibly useful application for it - steaming hotel beddings. The steamer worked wonders in providing peace of mind and ensuring a clean, bug-free environment.But the real test came with my decision to travel light, carrying only a single bag for my two-week journey. This meant I had to regularly steam out wrinkles from my clothes and hand wash them as needed. The Conair steamer was up to the task every single day. Not only did it effortlessly smooth out wrinkles, but it also did an excellent job in airing out any stale smells. My outfits felt, looked, and smelled fresh and new again, as if they had just come from a professional laundry service.What impressed me most about this steamer is its compact size, which makes it incredibly easy to pack, and its powerful performance, which rivals larger, bulkier steamers. It heats up quickly and provides a consistent steam flow, making it super efficient and easy to use.Overall, the Conair Travel Steamer is a travel essential I didn't know I needed but now can't imagine traveling without. It’s perfect for anyone looking to keep their clothes fresh and wrinkle-free on the go. Highly recommend for its versatility, effectiveness, and ease of use!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ed.Doc99",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7TNYCGNMKFO36RX6CZKQFE2ITA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J2YMM5N0143Y?ASIN=B0B3QYL568",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great!",
                "reviewText": "Wow, this travel steamer works great in the UK and the USA. The thing I’ll miss the most about the UK, though, is the 220 volt electrical supply! that makes all the appliances heat up so quickly!This steamer is very lightweight, effective, and heats up super quickly in the UK. Like all my dual voltage appliances, this takes longer to heat up in the USA than in the UK. But that’s not the fault of the appliance. The handle is sturdy when in use but collapses with the press of a button.Yes, the area you can steam with one pass is rather small, but I’ve been doing just one athleisure polo or long sleeve SPF shirt each morning. So my garments have only been thin ones. I don’t know how well this would work on cotton, but I almost never wear cotton garments anymore, so it’s not an issue for me.Of course, because it’s small, you really can only do 1-2 lightweight articles of clothing before you need to refill the water reservoir. To do that, you need to let it cool down (or use a very think oven mitt?) so you can remove the top to get to the reservoir.So if you need to steam more than 2 articles of clothing at a time, or if you’re doing 100% cotton, this may not be the appliance for you.However, this has been working out great for me. I am pretty much just steaming one shirt every morning during my trip.This is also super easy to pack and has not leaked yet that I have noticed. Of course, I have emptied it before putting it in my luggage. I think if you don’t empty it, water would flow out where the steam comes out.I definitely recommend this item!",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ssmonroe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNSKJZEGRHPTKYOCSCKFTC6PCZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3087BXY0MEDEB?ASIN=B0B3QYL568",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2013",
                "reviewTitle": "4.0 out of 5 stars I purchased this along with a Samsonite Travel Steamer and compared",
                "reviewText": "We are about to embark on a European trip and wanted a portable steamer. When you are limited by weight, you quickly discover that \"smaller-is-better\". I purchased the Samsonite and the Conair at the same time to evaluate them both. No question the Samsonite is smaller and lighter - but only marginally so. I pulled a cotton shirt - fresh out of the dryer and wrinkled, and experimented. They did indeed both work. The Samsonite took a bit longer to heat up - minute or so - and put out steam that you could not hold your hand against to the tune of about 3 inches. The Conair heated up much faster and put out steam that you could not hold your hand against to about 4-5 inches. The Conair just gets hotter faster. As the Samsonite moved on, the steam got a bit less and less. Before it was empty, it was not putting out much steam at all - and not enough to \"iron\" a shirt. You would have had to refill the Samsonite (refilling not a problem with either machine) to get enough proper steam to finish the shirt completely - but no question it will do the job.The Conair is a bit larger, and perhaps a tad bit heavier - but again - not appreciably so. The Conair heated very quickly and put out a lot of steam - all the way to the end of the tank. Without a doubt it got hotter and projected the steam further from the unit. The steam head is not as wide as the Samsonite, but the vents on the Conair are flared - so I would judge the width of coverage to be about the same. The amount of steam though is another issue, and to me, the more important issue. There is no question with me, that the Conair is the better of the two. The additional steam output will deal with wrinkles more efficiently than the Samsonite. The Samsonite is a good product, but it could be better. Oh, one other very small consideration. They are both dual voltage, but the Samsonite requires you to change the voltage by a switch. The Conair does it automatically.You could do with the Samsonite. It might take just a bit longer time-wise, but it will do the job. Frankly, I would prefer an even smaller unit - which I had 20 years ago - but it finally quit and was no longer made. It was about 1/2 the size of both of these and put out much more steam. You did have to fill it more often, but boy was it good - and small.I didn't give it 5 stars only because It could be smaller - and somebody should make one.I'm taking the Conair.",
                "reviewVotes": "816 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CW5_Reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5T5BZDPZQ36KZ7BDBDF53ZFTJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BDL3E1HJ0KTT?ASIN=B0B3QYL568",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Works well... small design flaw",
                "reviewText": "Small, works well, takes wrinkles out suit quickly and completely. Only complaint is that the cord exits the device perpendicular to the handle. Because of this, it doesn't nestle into the luggage quite as good as it could becasue the handle creates a protrusion point (even when folded) and then 90deg later you have the cord protruding. It would have been better to either have the cord integrated into the handle (or maybe even coming out of front or bottom... but putting it in handle would allow to capitlize on its small size)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUCJPZS645STZOTU235L7QUOM7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ARCPOSP5KKLG?ASIN=B0B3QYL568",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2023",
                "reviewTitle": "3.0 out of 5 stars It works in a pinch, and it is dual voltage, but not much steam.",
                "reviewText": "This is one of the few dual voltage travel steamers that I found. It works. It will create some steam, and it will remove some wrinkles. It is a very small amount so it takes a long time to do a shirt or a pair of slacks. It is fairly small, and portable. It would have been nice to have a travel bag or case included, but at the end of the day, it is an option.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thalia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 21, 2023",
                "reviewTitle": "A great travelling accessory",
                "reviewText": "Honestly I was suspicious about this steamer but travelling in summer with a lot of linen articles I really need help. I tried it and it WORKED beautifully. My linen skirts and dresses are back, and I did not feel wrinkled on me. It was almost perfection but we must let the item a short time to settle before wearing it otherwise it will be wrinkle faster. Easy to pack in suitcase and easy to use with any European AC adapter. I am so happy I did try and it was so successful.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jaime Ramirez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 14, 2019",
                "reviewTitle": "Excelente",
                "reviewText": "Muy buen funcionamiento, ideal para llevar de viaje",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 3, 2023",
                "reviewTitle": "Steamer",
                "reviewText": "Didn’t produce enough steam or pressure to be very effective binned this and bought a small travel iron",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V. Tsao",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 4, 2023",
                "reviewTitle": "perfect for travel",
                "reviewText": "take oversea use 110V ,work good. happy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana Luisa MP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 17, 2018",
                "reviewTitle": "Muy buen producto",
                "reviewText": "Pequeña, rápida.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}