{
    "remaining_requests": 31911,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/URPOWER-Portable-Handheld-Powerful-Included/dp/B01G9MC7GC",
    "body": {
        "name": "URPOWER Steamer for Clothes Steamer, Portable Handheld Garment Fabric Steamer Fast Heat-up Powerful Clothes Steamer with High Capacity for Home and Travel - Not for Abroad",
        "price": "$24.99$22.49$24.99",
        "originalPrice": "$39.99",
        "rawPrice": 24.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/URPOWER-Portable-Handheld-Powerful-Included/dp/B01G9MC7GC",
        "soldBy": {
            "sellerID": "A13IQXHTHID4GM",
            "name": "UBright",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A13IQXHTHID4GM&asin=B01G9MC7GC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CMX8BYVF"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CHFBC5YY",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/314BIHn21QL._SS36_.jpg"
            },
            {
                "asin": "B01G9MC7GC",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31uG5s-0veL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "50",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31J0pBSldPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41AVSh1XWqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41p-nSDNJJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MAQoAG7LL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519cNGLF zL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gBCC6lUUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OVgxbCzcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the URPOWER Store",
            "link": "https://www.amazon.com/stores/URPOWER/page/88967A0A-6649-4F56-A8E1-46DD9FA03B14?ref_=ast_bln"
        },
        "brand": "URPOWER",
        "merchantInfo": "UBright",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 10532,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 9 hrs 45 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 20 hrs",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 21 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Perfect Design: New nozzle design that distributes steam powerfully and consistently to remove stubborn wrinkles. And the compact design make the item travel and store easily.",
            "Safety Protection: Please turn off the clothes steamer when it not in use and when water running out. Otherwise, it will affect the service life of this steamer. There is automatic shut-off function when the unit gets too hot or the water level is too low. Safe to use on all types of fabric.",
            "Fast-Heat: Heats quickly to emit wrinkle-busting steam in 2 minutes. 130ML water tank that lasts for 7-10 minutes of continuous-steaming. Voltage: 110V.",
            "8FT Long Power Cord: This garment steamer has a 8ft long power cord, which allows you to move and iron your clothes more conveniently and flexibly.",
            "Warranty: 1 year warranty---your satisfaction is guaranteed!"
        ],
        "description": "Notes: 1. Only fill the tank with cold water, do not use hot water. Distilled water is recommend. 2. Never turn the unit upside down. Your Travel Garment Steamer should never be tilted past a 45-degree angle especially when the unit is ON. 3. The water tank is travel size in 130ml, please use with transformer when in abroad. Description: Using Newest steam channeling design delivers steam more powerfully and evenly to remove the toughest wrinkles from a multitude of fabrics in drapery, clothing, table clothes, and much more. This compact handheld garment steamer is the perfect tool to keep your wardrobe and household fabrics fresh and wrinkle-free. Use daily to easily and quickly revive your clothing. Features: Easy to handle Eliminates wrinkles fast For use on clothes and other fabric surfaces Automatic safety shut off Provides 10 minutes of continuous steam on a full tank Operations: 1. Unscrew the nozzle head, fill the tank with water to the desired level. Never surpass the maximum level. When you finish filling, lock the head back on. 2. Turn the ON/OFF switch to the ON position. The switch light indicates the steamer is on. Steamer will emit steam from nozzle in 2 minutes. 3. Your Travel Garment Steamer has a resetting function. When the unite rus out of water, please turn off the steamer in time. 4. When you are finished with your steaming session place the ON/OFF switch in the OFF position and remove the plug from the outlet. Package: 1*URPOWER Garment Steamer1* User Manual",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Travel Garment Steamers",
                "link": "https://www.amazon.com/Travel-Garment-Steamers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3737831"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "URPOWER"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Product Dimensions",
                "value": "6.7\"L x 3.2\"W x 8.8\"H"
            },
            {
                "name": "Item Weight",
                "value": "1.2 Pounds"
            },
            {
                "name": "Style",
                "value": "modern"
            },
            {
                "name": "Wattage",
                "value": "110"
            },
            {
                "name": "Voltage",
                "value": "110 Volts"
            },
            {
                "name": "Heat Time",
                "value": "2 minutes"
            },
            {
                "name": "Capacity",
                "value": "130 Milliliters"
            },
            {
                "name": "Manufacturer",
                "value": "URPOWER"
            },
            {
                "name": "ASIN",
                "value": "B01G9MC7GC"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "UGT-01"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 10,532 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,289 in Home & Kitchen (See Top 100 in Home & Kitchen) #13 in Travel Garment Steamers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "May 28, 2016"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Do not tilt the steamer more than 45 degree. Water should not be over the max line. The mist is super hot, keep away from the hot steam. Please use a transformer which can convert voltage to 110V when using this steamer abroad.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/df4235a1-cf20-49b8-a7f8-349967a1a861.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/775ce6ab-5149-439f-b523-e3cf54359678.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7139a43b-2c69-4a1a-8f42-c29306380331.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/5a59268b-60e5-4a17-b8eb-2da8ecab8a35.__CR0,0,220,220_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/5e16e6d4-6e29-4538-af4b-27a287e4b8f3.__CR0,0,1940,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/df4235a1-cf20-49b8-a7f8-349967a1a861.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/775ce6ab-5149-439f-b523-e3cf54359678.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7139a43b-2c69-4a1a-8f42-c29306380331.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5a59268b-60e5-4a17-b8eb-2da8ecab8a35.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/47585f16-aa3e-4180-bc8b-a24ef0eb8a7a.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/43c24570-009d-4f06-94c5-e3021c1814cb.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/505a2fc1-5815-412f-bda8-d3af4799bf87.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "lakelady32",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4RYLC3T5KCW6OZ7O42URD4R7KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WN2CSCYLQ9UK?ASIN=B01G9MC7GC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars The Best Steamer I've Ever Used",
                "reviewText": "I purchased this as part of a Christmas gift/laundry room essentials kit for my sisters new place. This was the only gift in that kit she specifically asked for because she has borrowed mine and knows how easy they are to operate and how well they work. Pop in tap water, turn on, give it a minute tops and you've got steam! I've worked with clothing for over 10 years and have used a variety of steamers and none have ever topped this style of steamer. I highly recommend!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cstarcstar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAE5KK4AYIMVIO2QRVH2KJIJGCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXSQ97K2Q0M1T?ASIN=B01G9MC7GC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2017",
                "reviewTitle": "5.0 out of 5 stars Convenient, good for travel or people who don't iron much",
                "reviewText": "If you're someone who doesn't really need to use an iron or steamer often, then this is for you. The size of this (see photo) is clearly meant for travel and it comes with a little carrying pouch, which is really convenient. Because of the size, the steamer doesn't hold too much water, but definitely enough to iron one or two shirts, depending on how wrinkled and the size of the shirt. It's really easy to use, and the water starts boiling really quickly. My SO irons his shirts before work and it's really efficient. Cleanup is easy as well. I don't know what they recommend, but I usually pour out the water after each use and store it with the lid off to dry it thoroughly.Edit: I came back after some heavy usage to give some more comments. I love this steamer for dress shirts and delicate items, but if you need to steam thick fabrics or or something where you need crisp folds, an iron would be a better choice.Pros:- Lightweight, travel friendly- Heats up really quickly- Enough to steam one or two dress shirt with one fill- Doesn't leak water or drip (don't tilt steamer past 45 degrees)- Gentle enough to handle delicates, silk, etc.Cons:- Can't handle heavy or thick shirts well, or is time consuming- You can't get the crisp folds an iron can do- Because of the travel size, tank is not large enough for long usage",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/7117EPsKehL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELONA5VTK75SJGJGVKJKYDQIELQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5IKVFQEUPOW9?ASIN=B01G9MC7GC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2019",
                "reviewTitle": "4.0 out of 5 stars A great product, but not a forever product",
                "reviewText": "This little number is the perfect size. You are able to travel with it, and store it easily. I've found that it holds the perfect amount of water to steam several garments at once. It heats up within a minute or two, and is quick to stop. I like that I can hear a difference when the steam begins to come out. You don't have to wait- just turn it on, and you'll know when to come back. In my case I turn it on, go grab the clothes I want to steam, and listen for the steam to begin.Tips: If you have never used a steamer before and are wondering if the switch from iron to steamer is worth it... It is. I've found that it works just as well, is much quicker, and doesn't wrinkle when moving it around to steam the other side. Hang the clothing on a hanger, and as you put the steam on the item, tug down a little at the bottom to smooth the item down and the steam will allow it to stay straightened out. I then use my hand to smooth it out as well. Several people believe a steamer does not work as well, but done correctly it is a miracle. I also recommend emptying out the water each time when you are finished to avoid rust (though I never do).On the down-side... This product did not last forever. I used it a few times a week for about two/three years before it began leaking. Which is probably longer than most steamers on the market, but still a burden to keep replacing. I will definitely but it again.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFYDBYUJ5NRPZAOQPINBMAK7D2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UUK2G9ZJCG38?ASIN=B01G9MC7GC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars FANTASTIC !!!!!",
                "reviewText": "For the price I paid (great deal), I was sure this would not work as I needed it to. Boy was I wrong, this steamer for the price works amazingly. Wrinkles GONE almost instantly. VERY VERY Pleased.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Careful 'n SelectiveCareful 'n Selective",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG64QPK2SOOKNS7IXKMB7GJ6G7HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G2ZU9R9JLURV?ASIN=B01G9MC7GC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2016",
                "reviewTitle": "5.0 out of 5 stars Excellent Steamer, Larger Water Tank, Designed for Convenience and with Added Safety Features",
                "reviewText": "The media could not be loaded. It’s no secret in our household that I detest the ‘ironing clothes’ task, and I have been very successful to avoid this chore for over 15 years. Although we own an excellent old iron, along with 2 ironing boards, these items have remained in our back closet safely gathering dust and out of my sight.I am truly thankful for our laundry dryers ‘no wrinkle’ cycle, and this helps for different material blends, but for an ‘an all-cotton’ piece of clothing my clothes do not come out perfectly pressed.I have also resorted to hang a mildly creased item in the bathroom while I take a hot steamy shower, and it works for some fabrics, however, most cotton items remain wrinkled.Several years ago, I purchased my first steamer, as an alternative for ironing. This was a ‘Corey Travelaid Hand Steamer’ and it was a disaster. The Corey Travelaid steamer has a small a very small water reservoir, as it will only accept 2 oz. of water. The on/off toggle switch is 12” down the cord, which is an inconvenient placement. When the steamer top is on, I can’t view the amount of water and there is no automatic shut off. Furthermore, there is no light display to indicate that the steamer is on, and I have to keep checking whether this is working, because it takes over 3 minutes to heat up only 2 oz. of water. However, the worst trait is the exterior of the steamer gets scalding hot, when I clutched the steamer to empty out the excess water, it burnt and blistered the palm of my hand. In conclusion, I considered the Corey Travelaid steamer a dangerous product and I never used it again.The second steamer I purchased was a ‘Remington Steamer’, and this too was another failure for the following reasons. The ‘Remington’ has a slightly larger water tank, and this one takes 3 oz. of water. However, there is NO power switch, when the electrical cord plugs into the outlet it immediately starts to heat up, which takes about 4 minutes. Similar to the Travelaid, the Remington does NOT have any type of ‘on’ indicator display, there is NO automatic power off either, and there is not a way to see the amount of water within the steamer’s tank. In addition to these similar flaws, the last dangerous feature applies to this one too. The exterior gets scorching hot which burns and blisters the hand when touched immediately after, and the Remington steamer needs a long time to cool down before it’s safe to handle. Therefore, the Remington Steamer is a hazardous product as there is NO power switch, and there is no automatic turn off safety feature, and the exterior becomes blistering hot.The URPOWER is my third garment steamer purchase, and this time I got it right, because this one has the extra features and none of the previous steamer flaws. This steamer has the 5 oz. water tank, which is much larger than my previous two steamers and the heat-up time on my steamer is between 1 -2 minutes. The on/off sliding switch is on the handle and convenient for my thumb and right below the sliding switch is an LED light that glows red when the steamer is on. There are two acrylic see-through windows on each side, which allows the view of the water from inside the steamer. Furthermore, this steamer has the safety feature, which automatically powers off when the water is low. However, for me, the most important characteristic is although the exterior does get warm, it never gets too hot to handle therefore there is NO risk of burning my hand as long it as I stay away from the front part of the nozzle where the steam comes out. This allows me to empty out any excess water, and let the steamer air dry for a couple of minutes before putting it away.This was my own full-price purchase, there was no discount, no promotion and I did NOT receive this free. This is an excellent garment steamer, it has all the conveniences and safety features and this clothes steamer is highly recommended by me.",
                "reviewVotes": "748 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41Io+k4hD1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41bQtUYr2AL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41hI4z--AcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41i0SeDKxML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41jA36zJRxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41oJTu2OjOL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5cef5a98-6a30-4ec3-90e6-b8e853bc9974/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "JSCHMO",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMEF23KPGLSCDJ2NP4WPOANWAUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YA5A7L0JN8TL?ASIN=B01G9MC7GC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 22, 2023",
                "reviewTitle": "3.0 out of 5 stars Small and portable but doesn't do the best job",
                "reviewText": "I wanted to really like this but it just doesn't help me out. It works, but for one shirt due to the size of the steamer. I do like that it is small for portability but if you even are close to the fill line for water, it spits it out and gets your clothes all wet. Would not recommend.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCVDC3YBS4NPQWDQ2ZZHAJL3OIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R945D948RSS4X?ASIN=B01G9MC7GC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Great little steamer!",
                "reviewText": "I bought this when I lived in a tiny place and did not have room for an ironing board. It works great! Now that I live in a bigger place I still like to use it because it is easy and fast to use!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cjs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6WHV4IJF5F7K4OGGRWSKCBMVFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28YCO8IG8FZSZ?ASIN=B01G9MC7GC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Cute",
                "reviewText": "Works well. gets the job done. Didn’t give it 5 starts because i had to refill it twice. It is small. Perfect travel size",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Excelente super! Pedire otra ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 17, 2023",
                "reviewTitle": "Superrrrr",
                "reviewText": "Super biennnn!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 8, 2019",
                "reviewTitle": "works great and heats quickly",
                "reviewText": "love this thing. have wanted one forever and finally got it. I use it at home mostly and it works like a charm. heats up super fast, which is good because it's small and if you're planning on doing more than one item, you'll need to refill for each.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "olvia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 15, 2020",
                "reviewTitle": "buen producto",
                "reviewText": "fácil de usar, cumple con lo que promete y desarruga con mucha facilidad las prendas, excelente para alguna emergencia de planchado en casa",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacalyn B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 21, 2019",
                "reviewTitle": "Great",
                "reviewText": "Love this product, so much steam power and works great. It has a small reservoir, probably just enough for one or two garments, but I’m fine with that because it heats up quickly and is small enough for easy travel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenny Jazmín Perez Garcia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 23, 2021",
                "reviewTitle": "Solo la pude usar un día y de ahí ya no prendió",
                "reviewText": "No se qué pasó pero solo la pude usar una vez, no salía mucho vapor y como que no plancho tan bien la ropa y la segunda vez que la conecte ya no calentaba el agua para nada, no sale nada de vapor, no supe qué pasó pero me parece una inversión muy alta para que no funcione :(",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}