{
    "remaining_requests": 31884,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Steamfast-SF-407-Fabric-Steamer/dp/B000BQRD0I",
    "body": {
        "name": "Steamfast SF-407 Fabric Steamer , White",
        "price": "$54.99",
        "originalPrice": "$54.99",
        "rawPrice": 54.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Steamfast-SF-407-Fabric-Steamer/dp/B000BQRD0I",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09ZNSCDYX"
        ],
        "asinVariationValues": [
            {
                "asin": "B000BQRD0I",
                "variationName": "Style",
                "variationValue": "SF-407",
                "price": "$54.99",
                "variationImageURL": ""
            },
            {
                "asin": "B01AB2H1ZS",
                "variationName": "Style",
                "variationValue": "SF-520",
                "price": "$47.62",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31o4iaZWoDL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41B3llbCoVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vhNhR3YgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4154RCNQJwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pPhCBG3HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Zrwjy05QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51P9hvVZUvL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Steamfast Store",
            "link": "https://www.amazon.com/stores/Steamfast/page/4E180CC7-4AC1-4329-AD12-FFFB89F4203E?ref_=ast_bln"
        },
        "brand": "Steamfast",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 5101,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 42 mins",
            "FREE delivery Monday, February 19. Order within 21 hrs 12 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SUPERIOR SUPPORT — When you choose a Steamfast product, you’re investing in superior performance and design that will deliver total satisfaction. If not, we’ll replace it, for 2 years. Supported by a customer service team based in Andover, KS..Hertz: 60 HZ. Amps 12.5",
            "QUICK HEAT UP TIME — 40-ounce capacity removable water tank heats up in 45 seconds and provides up to 45 minutes of continuous steam.",
            "CHEMICAL-FREE — More effective and gentler on fabrics than ironing for all-natural garment care using the power of steam.",
            "REMOVE WRINKLES AND REFRESH — Removes wrinkles and odors from clothes, linens, curtains, upholstery, and more, without the hassle of dry cleaning.",
            "EQUIPPED FOR THE JOB — Comes equipped with a cool-touch fabric hose, telescopic pole, illuminated power switch, attachable fabric brush, and clothes hook.",
            "Built to meet U. S. voltage requirements. Certified, safety-tested, and warrantied for use only in the U. S."
        ],
        "description": "Product Description The Steamfast SF-407 Everyday Fabric Steamer is the effective, reliable steamer that belongs in every laundry room. Hot steam penetrates deep into fabrics and relaxes fibers, releasing wrinkles faster than ironing and freshening clothes in seconds. The Everyday Fabric Steamer is gentle on your most delicate fabrics, yet works equally well on drapes, upholstery and other heavier materials. Powerful steam freshens fabrics and releases wrinkles. Less expensive and much safer than dry cleaning, the Everyday Fabric Steamer requires no chemicals, making it safe for use around your family and pets. From the Manufacturer IMPORTANT INTERNATIONAL DISCLAIMER: This item is built to meet U.S. voltage requirements and may not function properly when used in conjunction with external devices that alter or convert voltage or frequency of electricity. Improper use or shipping the product outside the U.S. will void all warranties.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Ironing Accessories",
                "link": "https://www.amazon.com/Clothes-Ironing-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3737851"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Steamfast"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Product Dimensions",
                "value": "11.81\"L x 8.07\"W x 64.76\"H"
            },
            {
                "name": "Item Weight",
                "value": "8.21 Pounds"
            },
            {
                "name": "Style",
                "value": "SF-407"
            },
            {
                "name": "Wattage",
                "value": "1500 watts"
            },
            {
                "name": "Heat Time",
                "value": "0.75 minutes"
            },
            {
                "name": "Product Benefits",
                "value": "Sanitize, Removes Wrinkles"
            },
            {
                "name": "Capacity",
                "value": "2.5 Pounds"
            },
            {
                "name": "Department",
                "value": "Small Appliances"
            },
            {
                "name": "Manufacturer",
                "value": "Steamfast"
            },
            {
                "name": "ASIN",
                "value": "B000BQRD0I"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "SF-407"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 5,101 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#69,499 in Home & Kitchen (See Top 100 in Home & Kitchen) #143 in Clothes Ironing Accessories"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wipe Clean"
            },
            {
                "name": "Assembly required",
                "value": "Yes"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "1 year limited warranty."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Steamer, Owner's Guide"
            },
            {
                "name": "Import",
                "value": "Made in USA"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "SF-407 Fabric Steamer The Steamfast SF-407 Everyday Fabric Steamer is the effective, reliable steamer that belongs in every laundry room. Hot steam penetrates deep into fabrics and relaxes fibers, releasing wrinkles faster than ironing and freshening clothes in seconds. The Everyday Fabric Steamer is gentle on your most delicate fabrics, yet works equally well on drapes, upholstery and other heavier materials. Powerful steam freshens fabrics and releases wrinkles. Less expensive and much safer than dry cleaning, the Everyday Fabric Steamer requires no chemicals, making it safe for use around your family and pets.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fc806af5-1547-402d-9846-b5d764b1dba5._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Telescopic pole Detachable and adjustable to a variety of heights for optimal user comfort and convenient storage. Attachable fabric brush Brush away particles such as lint, hairs and loose threads. Clothes hanger hook Support garments hung from a clean, rust-free hanger for easy, accessible steaming. Removable water tank 40-ounce capacity removable water tank allows for easy refilling.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cb847163-cb6a-446d-b90d-fbe94fa8a94d._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f395d63d-0216-4f18-82c6-9db5bb15c0aa._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f1db6245-5ee7-4891-ab47-8beea9de0ffa._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a7f8ab80-9347-4f4c-a4da-2c40598b81b1._SL220__.jpg"
                ]
            },
            {
                "media_text": "Steam For Every Fabric - Every Day Caring for your garments should be simple and hassle-free. Our all-natural steam care solutions are a chemical-free way to freshen and steam wrinkles from your fabrics - easy to handle, easy to use. Perfectly Smooth Fabric You want things to look tidy, but washing wastes water and wears your fabrics out. Steamfast is the chemical-free, water conserving, low wear-and-tear way to keep things looking their best. Shirts & Blouses Pants & Skirts Dresses Coats Curtains & Drapes Fabric Furniture Table Linens",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/096cc856-1f24-4f23-a4ef-7ef5f7f22382._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4c446688-2151-4373-b85f-77f9a01f5fc4._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "SF-407 SF-520 SF-562 SF-565 Water Capacity 40 oz. 70 oz. 86 oz. 106 oz. Heating Time 45 sec. 45 sec. 45 sec. 45 sec. Max Steam Time 45 min. 63 min. 96 min. 95 min. Max Pole Length 51.2 in. 51 in. 51.5 in. 63 in. Hose Length 4.3 ft. 5 ft. 4.8 ft. 5 ft. Multiple Settings No No Yes, 2 Steam Levels Yes, 4 Steam Level Accessories Fabric Brush Fabric Brush, Garment Hanger Fabric Brush, Garment Hanger with Clips Fabric Brush, Garment Hanger Item Weight 8.2 lbs. 10.1 lbs. 9.8 lbs. 14.2 lbs. Item Dimensions 64.8\"H x 8.1\"W x 11.8\"D 65.4\"H x 10.1\"W x 12.1\"D 47.2\"H x 13.2\"W x 13.2\"D 63.4\"H x 11.8\"W x 15.8\"D Watts / Volts 1500 / 120V 1500 / 120V 1500 / 120V 1500 / 120V",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/fc806af5-1547-402d-9846-b5d764b1dba5._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/771a4226-4449-430b-be31-22d65b4dc25c._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/feb14c25-3609-43e7-ba34-8692563e6f14._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/97e8d939-1fd1-442e-8c99-d3fe5d8805a0._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cb847163-cb6a-446d-b90d-fbe94fa8a94d._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f395d63d-0216-4f18-82c6-9db5bb15c0aa._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f1db6245-5ee7-4891-ab47-8beea9de0ffa._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a7f8ab80-9347-4f4c-a4da-2c40598b81b1._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/096cc856-1f24-4f23-a4ef-7ef5f7f22382._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4c446688-2151-4373-b85f-77f9a01f5fc4._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ab00cceb-b6f3-48a0-bc7a-bb269a77252a._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a55ace6a-036d-4d80-931a-e57d50dd57a5._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/77391525-c8a0-424e-b911-4ca822f797df.__CR87,283,1730,3460_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ab5f454d-0935-431a-a67a-e9b8801524d3._SR150,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Yona Rappaport",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOE5II7F5J7I6TO4MIZWMXO7SXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KQ3EQVP6ALJB?ASIN=B000BQRD0I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2014",
                "reviewTitle": "5.0 out of 5 stars Great Value- Love it!",
                "reviewText": "I bought this steamer because I love thrift store shopping. Anyone who's been to a thrift store may already know that you can expect a strange odor from anything and everything you bring home. Since I \"upcycle\" most of the things I buy, I wanted to kill two birds with one stone; eliminate odors as well as pressing the fabric for easy deconstruction.My steamer came about a month ago and I've used it a handful of times for about 40 min to an hour every time. I am very pleased with the construction, all of the pieces and parts look well made and are fully functional. The foam pad was squished pretty badly in the box but it popped back to life in about 5 days. I must admit, I the steam definitely helps the thrift store stank but does not remove it completely, it almost seems to go away and then once the garment is cool again it comes back very slightly.I did have concerns before making my purchase, one review said that the steamer squirts hot water randomly and could wet the garment or burn the operator. Within about 10 minutes of using the steamer I figured out what happens. With the buildup of steam and condensation coating the rubber tube after using the steamer for a few minutes, this water will travel to the lowest point and sit there. The continuous pressure from the steam still being made by the machine will push the hot water out the hose with enough buildup. To remedy the situation, one just needs to make the hose straight again every few minutes by lifting the steam head high up, allowing the water buildup to drop back down into the tank. The steamer makes a noise before it shoots water out so it's easy to anticipate. SCIENCE.As far as taking wrinkles out of fabric, it works great. I would recommend this for anyone who has regular household needs. I really only need to use it about twice a week for maybe an hour. Although it would work for a shop or for someone with higher volume of steaming to do, the item was clearly designed for clothing, the range of motion allowed by the hose and extension cord are not extensive- you really can't hang something longer than the extendo-holdy pole.Overall, a great product, the only thing I might change about it is weighting the base more because as you steam, your tank becomes lighter and lighter and very thick heavy fabrics may not be held up by it anymore.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ron",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC6ONTABGC4P5PXXYHZNKDHMDDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CGI57EM5AEFV?ASIN=B000BQRD0I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2011",
                "reviewTitle": "5.0 out of 5 stars Good for a small home use steamer",
                "reviewText": "Had this unit for a couple of months now and use it a couple of times per week. Over all I am pleased with it. While it will not replace an iron for pressing purposes it does do a good job at steaming wrinkles from most fabrics. Which is convenient considering that is what it is suppose to do, heh.**Good points**1) The water heats up to steam level quickly. I rarely wait more than 60 seconds, or so, for steam build up.2) The steam is a steady adequate flow once going. It rarely spurts out hot water (until other home steamers I've tried).3) Once turned off the water cools down relatively quickly and thus the steam flow from the \"sitting\" unit stops shortly after power off.4) The base is light weight but heavy enough that my clothes don't cause it to tip when they are hanging from the fully extended pole. Unless I do something stupid like hang way too many clothes off the pole for some reason (did that once, don't know why, hah).5) I have yet to see any significant mineral build up. Though arguably I only use the steamer for a few minutes 2-3 times a week.**General points (not bad but not spectacular either)**1) The hose, while perfectly long enough for articles hanging from the extended pole, will not reach the top of hanging high level drapes. As this is a floor model and not designed to be lifted that makes steaming said drapes difficult without first taking them down. Nothing horrible, just thought the hose length should be noted.2) This item works well for a home steamer. The \"home\" moniker should be noted, as it does not produce powerful industrial steam flow. And as such will not replace an iron for very thick/stubborn fabrics (even when using the included backing pad).**Bad points**1) nothing negative has come up yet.Overall, I have been very pleased with this home steamer and found it to be an excellent purchase. It is a well priced (maybe even cheap) unit that still produces good results with no noted negatives so far.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Léona Desroches",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 19, 2023",
                "reviewTitle": "Produit idéal",
                "reviewText": "Personnel",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jorge posadas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 23, 2023",
                "reviewTitle": "MUY PRACTICA",
                "reviewText": "EXCELENTE PLANCHA DE VAPOR, PRACTICA Y RAPIDO PARA PLANCHAR SIN PROBLEMAS",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MonicaMonica",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 30, 2023",
                "reviewTitle": "Buen producto",
                "reviewText": "Buen producto plancha bien pero lo que no me gusto es que el proveedor no te da factura fiscal",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Y+zgpBc4L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 8, 2023",
                "reviewTitle": "Terrible product",
                "reviewText": "You have to have US adapter to use it. I’m not sure if it safe and ready to use in the UK. Might cause a fire.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V. B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 16, 2023",
                "reviewTitle": "SALVO QUE ESTES EN USA SI LO DEVUELVES PAGAS TU EL ENVÍO, DINERO A LA BASURA.",
                "reviewText": "No viene en las especificaciones que el enchufe es americano y que necesitas un voltaje especial en casa.Es ponerlo y salta la luz.Además como el producto viene de USA, no te dan etiqueta de devolución, tienes que pagarla tu, incluso si es defectuoso.Por lo tanto no podemos ni devolverlo.Me fie de que fuera un buen producto por todas las reseñas que tenía, pero ha sido dinero tirado a la basura.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}