{
    "remaining_requests": 31620,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Eifrthe-Replacement-Compatible-S7001-Scrubbing/dp/B0BMG73YLB",
    "body": {
        "name": "10-Pack S7000 Replacement Steam Mop Pads,Compatible with Shark S7001 S7000AMZ, S7000 S7001TGT S7201 S7005 S7020 Series Steam Mop Pads,Steam & Scrub All-in-One Scrubbing Mop Pads",
        "price": "$19.94$19.94 $18.89$18.89",
        "originalPrice": "",
        "rawPrice": 19.94,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Eifrthe-Replacement-Compatible-S7001-Scrubbing/dp/B0BMG73YLB",
        "soldBy": {
            "sellerID": "A3TYL25VC04VAA",
            "name": "Eifrthe",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3TYL25VC04VAA&asin=B0BMG73YLB&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BZ4P8NL6"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BVM5ZSDB",
                "variationName": "Size",
                "variationValue": "s7000(4+2+2+2)",
                "price": "$20.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BMG73YLB",
                "variationName": "Size",
                "variationValue": "s7000(4+6)",
                "price": "$20.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save an extra 6% on your first Subscribe and Save order.",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/515BroN2oIL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51xXHyHwTJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lAfW6HKQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hkMqKR-JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51t6005Cy3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5142RH73RgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518Skc8js7L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Eifrthe",
            "link": "https://www.amazon.com/Eifrthe/b/ref=bl_dp_s_web_120701272011?ie=UTF8&node=120701272011&field-lbr_brands_browse-bin=Eifrthe"
        },
        "brand": "Eifrthe",
        "merchantInfo": "Eifrthe",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 289,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 20 hrs 39 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 20 hrs 39 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✅Compatible Models:Eifrthe shark steam and scrub pads is compatible with the Shark S7000AMZ S7001 S7001TGT S7000 S7201 S7005 S7020 Series Steam and Scrub All-in-One Hard Floor Steam Mop. compare part model #: XKITP7000。",
            "✅shark steam and scrub all in one 10 pack:6 pieces of premium microfiber scrubbing pads,4 pieces of steam mop pads for the Power Scrubbing Pad.The Eifrthe S7000 Replacement Steam Mop Set has the same features and dimensions as the Shark S7000 Steam Mop.",
            "✅Feature Upgrade: Shark S7000 Replacement Steam Mop PadUpgraded,The friction of the powerful scrubbing pad easily breaks down stubborn, tough stains in the kitchen, on the balcony or at the entrance. Microfiber scrubbing pads easily remove dirt, dust and a variety of hard floor scrubs.",
            "✅Use and Installation: shark steam mop replacement pads is super absorbent and fast drying, and can be used dry or wet. Can be washed and reused multiple times. Can be easily replaced without additional tools.",
            "😊After-sales service: If you have any questions about the Shark S7001 Replacement Steam Mop Pad product, you can contact us at any time and we will give you a satisfactory answer within 24 hours"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510106"
            },
            {
                "name": "Steam Cleaners, Steam Mops & Accessories",
                "link": "https://www.amazon.com/Steam-Cleaners-Steam-Mops-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11333725011"
            },
            {
                "name": "Steam Cleaner & Steam Mop Accessories",
                "link": "https://www.amazon.com/Steam-Cleaner-Steam-Mop-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6574820011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "8.46 x 7.95 x 4.84 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.1 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Eifrthe"
            },
            {
                "name": "ASIN",
                "value": "B0BMG73YLB"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "S7001"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 289 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#34,529 in Home & Kitchen (See Top 100 in Home & Kitchen) #38 in Steam Cleaner & Steam Mop Accessories"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "shark steam and scrub replacement pads:4 pieces of strong scrubbing pads, 6 pieces of microfiber scrubbing pads."
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Shark S7000 S7000AMZ S7001 S7001TGT S7000 S7201 S7005 S7020 Steam Mop The s7000 replacement mop pads compatible: Shark S7000AMZ Shark S7001 Shark S7001TGT Shark S7000 Shark S7201 Shark S7005 Shark S7020 Steam Mop Series Steam",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/508641a7-a321-4961-8012-3c045bfaf910.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Washable & Quick-Drying Microfiber materials allow moisture to evaporate in a short period of time, giving the pads a speedy dry-up time. Just sit the pads in a dry and well-ventilated place. No need to worry about the musty odor caused by the damp pads anymore! Floor Cleaning Secret Hack Benefiting from great absorbency, shark s7000 series microfiber pads significantly decrease the damage to the floors caused by over-wetting. Meanwhile, the high-density microfiber equips the pads with outstanding performance in trapping dirt, dust, and pet dander! Easy & Delightful Cleaning No need to rub back and forth rapidly over tough and sticky spots. No more squatting down to scrub floors when removing stubborn grime. Just attach a pad to shark s7000 series steam mop and enjoy a simple, graceful and sweat-free cleaning experience! Reusable & Ultra-Durable Microfiber mats are extremely durable. It can be used many times with hard use and the life of the microfiber pads is extended. Simply throw these microfiber pads in the washing machine and it's easy to get brand new pads!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ce9a03a-43fb-4273-af92-5572e2254e30.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9db619b7-f5c5-464f-8de0-15c1256dd3e8.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/53187b51-a805-4a56-8602-1dd500d2b144.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d86737b5-c82a-45a3-a06f-7cdb1c3bc2cd.__CR0,0,300,300_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Perfectly Compatible The well-tailored microfiber pads are perfectly compatible with shark s7000 series steam mop cleaner. The perfect cleaning combo enables powerful steam to disperse evenly to the floors in just 15 seconds, offering an effective cleaning solution. Super Easy to Set up Velcro hooks on the mop are placed in opposite directions to adhere loops on the microfiber pad. Place the pad on the floor and simply adhere the mop, the pad will be firmly attached and have ultra-stable performance on different surfaces. 10 Packs Included 10 packs of microfiber pads are included in one package. You can change a new pad when washing the old one. No need to worry about being short of pads! Once you have tried the pads, you cannot go back to life without these powerful pads. Strong Cleaning Power The pads have an outstanding performance in trapping dirt, dust, and pet hair. Just like other microfiber materials, the pads have a slight positive charge and thus can attract negatively charged dusty bits, providing strong cleaning power.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f07c138b-cfb1-49b5-b810-36c9f2f4034c.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/39c6d11b-984a-4706-b8c3-4e8ec6fa2bd5.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4b182b5-a5a6-4633-9efc-888736c5607e.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ffcbc1e-e0b6-47d2-b227-6f57edac8e75.__CR0,0,300,300_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/89b5e017-eb9c-4f0f-97e2-9275c0ec5e6e.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/508641a7-a321-4961-8012-3c045bfaf910.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ce9a03a-43fb-4273-af92-5572e2254e30.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9db619b7-f5c5-464f-8de0-15c1256dd3e8.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/53187b51-a805-4a56-8602-1dd500d2b144.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d86737b5-c82a-45a3-a06f-7cdb1c3bc2cd.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f07c138b-cfb1-49b5-b810-36c9f2f4034c.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/39c6d11b-984a-4706-b8c3-4e8ec6fa2bd5.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4b182b5-a5a6-4633-9efc-888736c5607e.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ffcbc1e-e0b6-47d2-b227-6f57edac8e75.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/826c0fb8-e7fc-4074-b9f5-f464c239003b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Shelita D RichmondShelita D Richmond",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJT463X2JTB3HTDYG7LVV7J6FLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3W2RSAFETGK6E?ASIN=B0BMG73YLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for my Shark Steam mop",
                "reviewText": "I recently purchased the Eifrthe 10-Pack S7000 Replacement Steam Mop Pads from Amazon, and I must say, I’m quite satisfied with my purchase. These replacement pads have proven to be a great addition to my cleaning routine.Firstly, the pack includes 10 pads, which is a fantastic value for the price. It’s always convenient to have plenty of replacements on hand for when one gets dirty during cleaning.The quality of these pads is impressive. They are made of durable materials that can withstand multiple uses and washes. I haven’t experienced any issues with them falling apart or losing their effectiveness.The pads fit perfectly on my S7000 steam mop, making them a hassle-free replacement. They securely attach to the mop and stay in place during cleaning, which is essential for a smooth and efficient cleaning process.Cleaning performance is where these pads truly shine. They effectively pick up dirt, grime, and stains, leaving my floors looking spotless and sanitized. I appreciate that they are machine washable, so I can easily clean and reuse them, reducing waste.Overall, the Eifrthe 10-Pack S7000 Replacement Steam Mop Pads are a practical and cost-effective choice for anyone with a compatible steam mop. They are durable, perform exceptionally well, and offer great value for the price. I would definitely recommend them to fellow cleaning enthusiasts.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Bd9Hj8WhL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan Black",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEETDMKJPOPWNTAP2BX6UF45CU3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3840K09BJV3AW?ASIN=B0BMG73YLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Great substitute for the expensive branded pads",
                "reviewText": "I recently moved into a new town home, two stories with hard tile floors throughout the entire first floor and hardwood floors all throughout the second floor and while I'm used to having wood floors and not having an issue, this is a bigger place for my husband and I and I wanted some extra help so when I saw the actual dual head scrubbing mop contraption that they managed to create. I had to jump at it and it's one of those products you have to actually use and try in order to appreciate fully beyond just the novelty of it.I have to say I'm thoroughly impressed with the actual machine itself. It works beautifully and it does the job that I need it to and cuts my time in more than half just by using it on a somewhat bi to tri weekly time frame just depending on how dirty things get.That said, having bought the mop you obviously need to buy the pads to replace or if you have dirty ones that you haven't washed yet, you need to clean set to continue your job and keep things in order. So I decided to give these a try because I found them at a great price and they look nearly identical.I will say once I got them home and open the package. They are not identical and actually I am happy they're not. The pads that I have that came with my mop have the sort of buffed cloth. Kind of side to it the way that these do as well but that's all. So essentially, while it works great, it's working in the same way. You would see one of those floor buffing/waxing machines that janitors use in the very big schools and things like that.Obviously you can tell I know the technical terms for all this stuff. So in my actual hands-on experience I have to say I love these pads that I purchased 10 times better because they have a selection of the buffs softer pads like the identical ones that come with the mop. But they also have an equal amount of pads that you can use that have a rougher almost bristle like consistency to it.These in particular are awesome at cleaning up those extra. Hard to get messes and stains that may appear. Not to get too graphic but I do have a cat and there are times that I mayAnd I see that she has thrown up previously and I was unable to catch it and these are the type of messes that go unnoticed and can be a little tougher to lift if you're just simply using a softer cloth to essentially steam n buff away the mess.So these pads are perfect for that because they're very versatile. You can clean the everyday easy stuff and have a quick run through your home and have it shine and you can whip them out in those times when you have the bigger messes that might require little elbow grease and all is clean, sanitary and sparkling in the end.Have to say I am very happy with the mop and I am extremely happy even more so that I found these particular pads and I highly recommend them if you own this specific model because you won't regret giving them a try.They're very durable and quality made. I've already run several through the wash a couple times and there's no shrinking or issue with falling apart the way some items like this may on occasion. You can really tell that they took the time to create a quality product here, which I thoroughly appreciate and I will definitely be a customer in the future. For now, to you, I just have to say highly recommend",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK5ZXFQAMLR7DLO6QSSS2TIXBMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3J081XPE4TCMZ?ASIN=B0BMG73YLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars As good as original Shark Steam and Scrub pads. Great value.",
                "reviewText": "These are the exact replacement pads for Shark Steam and Scrub – S7001 model in my case. The pack comes with 4 standard microfiber pads and 2 abrasive pads.MICROFIBER PADS:Form, fit and function these are identical to the original Shark branded pads packed with the steam mop. Although they’re primarily for hardwood floors I tried them on slate tiles and actually did a good job of cleaning surface dirt and minor stains. I had no issues of the pads falling off or sliding out.ABRASIVE PADS:These are actually microfiber pads but with embedded “stubble” – (3-Day beard/scrub). DO NOT use these on hardwood floors! They’re not exactly abrasive as steel-wool but I can see them scratching or leaving swirl marks on dark wood floors. However, on tiles these are excellent! Not only they cleaned the surface of the tile but they also removed stuck dirt and grimes in and around the pattern. As with the microfiber pads, I had no issues with them coming off or sliding out.Anyone looking for standard replacement pads for Shark Steam and Scrub, as well as abrasive pads for tiles this is the pack you’re looking for. They’re washable/reusable, appears well-made and depending how often used, should last for long time. Great value and highly recommended!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "330girl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIX2AMWP5OHB2IJPVAOTJKV3GYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28NVOO329W8Y3?ASIN=B0BMG73YLB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Used with Shark steam mop S7001 12",
                "reviewText": "When i first saw the pads I thought that they were too large for my steam mop. To my surprise they fit. I can't compare the pads to the original pads because I purchased the mop used and no pads were included. I always use the deep steam setting on the mop and the pads seem to get the job done. You get many more pads than other brands that charge the same price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy L. Thomas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4AWS3OAZGLBZHNDTYVX6F32XZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Q8KBOUNKAMUX?ASIN=B0BMG73YLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect fit",
                "reviewText": "I use the steamer these pads work perfectly. My floor shines every time I steam cleaning.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "alvarez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTT6K7QF3433LFLYBMQ2UQWP3IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UPJEVU9IQZ34?ASIN=B0BMG73YLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Replacement Steam Mop are better then the originals",
                "reviewText": "Replacement Steam Mops are better than the originals. There is an excellent price for 10. My floor is always clean; this steamer is easy to use and heat fast.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shannon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4WTRLIF6FJSPWBQHSHAOLYX2WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OL4JV07WGBGZ?ASIN=B0BMG73YLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "The orange pads have a rougher texture and do a great job of scrubbing the floor. They wash up well in the washing machine and dryer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "frogers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6MZF25QPM46J472FZ4VKRNMC6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WU6FP92V7RUD?ASIN=B0BMG73YLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Fit for S7000 SHARK steam mop",
                "reviewText": "I was worried about fit, but they all fit great and the pink pad is great on my highly grooved laminate floor. Great buy. Having many pads allows me to clean up a very muddy floor from 3 puppies by replacing them one after another so I am not just smearing dirt around! Fast shipping and well packaged.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}