{
    "remaining_requests": 31703,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tobytec-Portable-Steamer-Clothes-Handheld/dp/B0C8JFJG74",
    "body": {
        "name": "Portable Mini Steam Iron Hand Held Steamer for Clothes Dry And Wet Handheld Ironing All in One for Home with Storage Bag and Cup, 120V 1000W, Blue",
        "price": "$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tobytec-Portable-Steamer-Clothes-Handheld/dp/B0C8JFJG74",
        "soldBy": {
            "sellerID": "A2R6UGIKI6PMNA",
            "name": "Bytec US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2R6UGIKI6PMNA&asin=B0C8JFJG74&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "20",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41jN7 P-wrL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41d ejLEnJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Q1VLO-snL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41li-TWMJrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41b8mh4dj-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 o3Fx0PrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/615hs0LESCL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Tobytec",
            "link": "https://www.amazon.com/Tobytec/b/ref=bl_dp_s_web_119221426011?ie=UTF8&node=119221426011&field-lbr_brands_browse-bin=Tobytec"
        },
        "brand": "Tobytec",
        "merchantInfo": "Bytec US",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 30,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 15. Order within 4 hrs 50 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✅Powerful and Continuous Steam for Effortless Wrinkle Removal Experience the convenience of our 1000W steam iron, a portable iron steamer designed to cater to all your ironing needs. With powerful and continuous steam, this mini steam iron effortlessly removes wrinkles from your clothes, leaving them fresh and perfectly pressed. Enjoy the convenience of a quick heat-up time of just 15 seconds, so you can start ironing in no time.",
            "✅4-in-1 Multi-Function Handheld Steamer and Iron Our versatile ironing machine offers four different functions to suit your ironing preferences and adapt to various fabrics and garments. Choose between upright and flat ironing, providing flexibility for different types of clothing. Additionally, switch between generating steam or using it as a dry iron, allowing you to customize your ironing experience. This 4-in-1 multi-functionality makes it perfect for daily use at home, while traveling,",
            "✅Compact, Lightweight, and Travel-Friendly Design Designed with portability in mind, our mini iron for clothes is incredibly small and compact, measuring only 20*12*13.5CM in size and weighing just 0.86kg. Its compact form factor makes it easy to carry and store, perfect for travelers and individuals with limited space. Despite its small size, the ergonomic \"handle\" can be folded at 180°,",
            "✅Additional Travel Essentials Included We've thoughtfully included a travel bag and a plastic measuring cup with our mini iron steamer for added convenience and protection. The travel bag ensures safe storage and portability, protecting your iron during transportation. The plastic measuring cup allows for precise water filling, ensuring optimal steam performance.",
            "✅Easy to Use with Leak-Proof Design for Hassle-Free Ironing Our mini steam iron is designed for ease of use. Simply plug in the iron and wait for just 10 seconds until it heats up and is ready to use. The user-friendly controls allow you to effortlessly select the desired steamer or dry iron mode, depending on your ironing needs."
        ],
        "description": "Bytec travel steam iron for all clothes Applicable clothing materials by using Bytec mini steam iron Unleash the power of our iron's 4-in-1 Multi-Functionality! Seamlessly switch between upright and flat ironing and transition effortlessly from steam to dry iron modes for a customizable experience. This versatility ensures optimal care for a variety of clothing materials, including delicate silk, cozy woolen, breathable cotton, and modern fibers. Experience the perfect blend of functionality and adaptability for all your ironing needs. 4-in-1 Multi-Functionality dry iron mode steam iron mode",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Garment Steamers",
                "link": "https://www.amazon.com/garment-steamers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510248"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Tobytec"
            },
            {
                "name": "Special Feature",
                "value": "mini handheld iron, mini iron for clothes, mini steam iron, mini ironing machine, Protable steam iron See more"
            },
            {
                "name": "Color",
                "value": "Blue"
            },
            {
                "name": "Product Dimensions",
                "value": "6.5\"L x 4.4\"W"
            },
            {
                "name": "Model Name",
                "value": "si07"
            },
            {
                "name": "Voltage",
                "value": "120 Volts (AC)"
            },
            {
                "name": "Frequency",
                "value": "60 Hz"
            },
            {
                "name": "Item Weight",
                "value": "1.83 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0C8JFJG74"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "si07"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 30 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#329,590 in Home & Kitchen (See Top 100 in Home & Kitchen) #151 in Garment Steamers"
            },
            {
                "name": "Date First Available",
                "value": "July 2, 2023"
            },
            {
                "name": "Wattage 1000 Watt-hours",
                "value": "Style Handheld,Portable"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Bytec portable steam iron Bytec mini steam iron Bytec Mini Steam Iron – Your Ultimate Travel Companion! Key Features: Compact and Portable Design: Ideal for on-the-go, our travel mini steam iron keeps your clothes wrinkle-free.Versatile Mini Iron Machine: Switch effortlessly between steaming and dry ironing for various fabrics.Travel-Friendly Features: Quick heat-up, foldable handle, and compact size make it perfect for travel.Additional Essentials Included: Comes with a travel bag and a measuring cup for convenient portability. Effortless Operation with Leak-Proof Design: Easy-to-use interface and mess-free ironing experience. Upgrade your travel style with the Bytec Mini Steam Iron – the perfect blend of portability and performance! Bytec mini steam iron specification Powerful & Continuous Steam: Our 1000W mini steam iron effortlessly removes wrinkles on the go, ensuring has a quick 15-second heat-up.4-in-1 Multi-Functionality: Adapt to your ironing preferences with versatile functions, offering upright and flat ironing. Switch between steam and dry iron modes for customizable experiences, perfect for daily use and travel convenience.Compact & Lightweight Design: Measuring 20*12*13.5CM and weighing just 0.86kg, our mini travel steamer is ideal for travelers and those with limited space. The ergonomic \"handle\" folds at 180° for added convenience. Additional Travel Essentials: Travel with ease – our mini iron includes a travel bag and a plastic measuring cup for safe storage, portability, and precise water filling to ensure optimal steam performance.Easy to Use & Leak-Proof: Designed for hassle-free ironing, our mini steam iron heats up in just 10 seconds. User-friendly controls and a leak-proof design ensure a good ironing process. Bytec mini steam iron design Bytec introduces a Travel Iron Steamer with a specialized Leak-Proof structure for on-the-go perfection. Our meticulous manufacturing process adheres to high OQC standards, ensuring each Portable Steam Iron is free from Leak-Proof issues. Trust Bytec for a flawless and enjoyable ironing experience with Bytec Mini Iron Machine.Bytec's Travel Iron Steamer features a stylish metallic look with blue spray paint. The traditional iron tip shape adds a nostalgic feel and ensures smooth ironing, enhancing the user experience for our Portable Steam Iron and Mini Iron Machine. Enjoy both style and functionality with Bytec.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9520e6ab-1ed1-4892-875f-aec2f3fcc218.__CR0,0,1100,1100_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6cd8b44c-3ad8-4b8d-8f9a-0425389bb433.__CR0,0,1100,1100_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/debe4d7b-9749-43c2-9b28-56d861b11966.__CR0,0,1100,1100_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "travel steam iron for all clothes portable mini Seamlessly switch between upright and flat ironing Experience versatility with the Bytec iron – not just for ironing but also as a garment steamer when used vertically. The lightweight design ensures flexibility and speed. Our reliable water-leaf design prevents condensation and dripping, eliminating the risk of burns. Feel free to enjoy its convenience and safety upright ironing flat ironing water-leaf design Bytec travel steam iron for all clothes Applicable clothing materials by using Bytec mini steam iron Unleash the power of our iron's 4-in-1 Multi-Functionality! Seamlessly switch between upright and flat ironing and transition effortlessly from steam to dry iron modes for a customizable experience. This versatility ensures optimal care for a variety of clothing materials, including delicate silk, cozy woolen, breathable cotton, and modern fibers. Experience the perfect blend of functionality and adaptability for all your ironing needs. 4-in-1 Multi-Functionality dry iron mode steam iron mode",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e73c86ff-93e7-4a7b-9a11-817b40e37b3c.__CR138,0,825,1100_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/037b32a2-a0b7-42c0-b07f-aef65bb5661b.__CR0,487,1100,550_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Bytec mini steam iron promise Exceptional Product Quality: We make sure to provide a top-notch quality in every Bytec mini steam iron. Our commitment to excellence ensures a durable and reliable product that meets your ironing needs.Seamless Using Experience: Experience the convenience of efficient and effortless ironing. Bytec's mini steam iron is designed for a user-friendly and enjoyable ironing experience, making it a breeze to keep your clothes fresh and wrinkle-free.Dedicated : At Bytec, we prioritize your satisfaction. Our After Service team is dedicated to addressing any queries or concerns promptly, ensuring a positive and smooth experience with our mini steam iron. Choose Bytec for quality, performance, and outstanding After service – we're here to enhance your ironing journey!",
                "media_link": []
            },
            {
                "media_text": "Bytec mini steam iron promise Exceptional Product Quality: We make sure to provide a top-notch quality in every Bytec mini steam iron. Our commitment to excellence ensures a durable and reliable product that meets your ironing needs.Seamless Using Experience: Experience the convenience of efficient and effortless ironing. Bytec's mini steam iron is designed for a user-friendly and enjoyable ironing experience, making it a breeze to keep your clothes fresh and wrinkle-free.Dedicated : At Bytec, we prioritize your satisfaction. Our After Service team is dedicated to addressing any queries or concerns promptly, ensuring a positive and smooth experience with our mini steam iron. Choose Bytec for quality, performance, and outstanding After service – we're here to enhance your ironing journey!",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9520e6ab-1ed1-4892-875f-aec2f3fcc218.__CR0,0,1100,1100_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6cd8b44c-3ad8-4b8d-8f9a-0425389bb433.__CR0,0,1100,1100_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/debe4d7b-9749-43c2-9b28-56d861b11966.__CR0,0,1100,1100_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e73c86ff-93e7-4a7b-9a11-817b40e37b3c.__CR138,0,825,1100_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/037b32a2-a0b7-42c0-b07f-aef65bb5661b.__CR0,487,1100,550_PT0_SX350_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kendra Jacoby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSWHPJNPAUVQANWJMHBK3YE6DYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VM54J1O7QR3W?ASIN=B0C8JFJG74",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Safe and Reliable",
                "reviewText": "I purchased this mini steam iron recently, and I am impressed with its safety and reliability features. The anti-dry burn protection and automatic shut-off functions give me peace of mind while using it. The handle is ergonomic and can rotate 180 degrees, making it comfortable and easy to use in any position. The high-quality heating element heats up quickly and maintains a constant temperature, ensuring perfect ironing results every time. The cowhide texture not only adds style but also makes it durable. I highly recommend this mini steam iron for its safety and reliability.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nerd Mom #11",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD65FZYB6QS27O5CSYV2SBGJDWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP9OYZHE85CAR?ASIN=B0C8JFJG74",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "4.0 out of 5 stars Works, but small capacity",
                "reviewText": "This portable steam iron was a surprising treat. My husband wears button-up shirts for his office job, and they’re often wrinkled when freed from the laundry cycle. I read in other reviews on this product that it could be used to steam wrinkles out of shirts that were still hanging.What? You can steam wrinkles out of shirts while they are hanging? You can skip the ironing board!?I loathe the ironing board, so you can imagine what that bit of knowledge did to my brain. A choir of angels rejoiced. The world suddenly seemed brighter, and my shoulders felt lighter.Anyway, I ordered this little hand held steamer a quick moment later, eagerly anticipated its arrival, and tested it out today. It works! I’m not going to claim that steaming the shirts while they hung was as crisp an outcome as ironing them on an ironing board, but the improvement is substantial, and given my antipathy towards the ironing board, my husband can deal with the imperfections while he’s relying on me to do the work.I did run out of literal steam quickly with the hand held steamer, unfortunately, and I do not look forward to refilling it frequently when going through shirts, but this is still a delightful improvement over our previous situation.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LinnardWannieiW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM2CY42CLCHZYEQMLFEDMEEJKXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH2D053LLBXPA?ASIN=B0C8JFJG74",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Very efficient!",
                "reviewText": "I just loved it. It works great better than a professional one I have at home. It doesn't take too long to release the steam and we are able to use in multiple items before having to fill it up again. The only down side is that I think it's heavy. We had to bring it on our carry on.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janice B Tavares",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFO6MZDU52XGV6K6KWY7T7WHX2EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZCMAE2Q8V5LA?ASIN=B0C8JFJG74",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2023",
                "reviewTitle": "1.0 out of 5 stars Steamer",
                "reviewText": "This steamer is awful it doesn’t work ..I didn’t try until today my fault didn’t check it.. it doesn’t even steam",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRQ3JDKROOYJF4QBKKRHBXPX4YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIHGXC8ER5M56?ASIN=B0C8JFJG74",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "3.0 out of 5 stars Good for a Backup Steamer",
                "reviewText": "I was wondering what to expect since this product is labeled as multi-functional. It has a nice carrying/storage bag and water/measuring cup. There is also a holding/hot plate to rest on. Although it's a bit heavier than I expected, it's still easy to use.I read the instructions FIRST, and I recommend you do too. They provide detailed information throughout, but they are pretty straightforward.Here's my experience with it:The dry function, as an iron, was relatively cool, requiring more effort to use on something like cotton. This function is not the best quality.For the steam function, my unit did best in the flat position. It definitely had more steam power in that position, and the unit is not any noisier than any other steam iron. When I was done using it, I put it on the rest plate and moved the knob to the dry position. I never had any issues with it leaking. I did test it on an old towel first, as the instructions indicated, but I didn't have any problems with leaking or other issues.The instructions did not mention that when using it as a steamer in the upright position, it works best and has the highest output of steam when the nose of the unit is pointing up. In other words, the unit length is perpendicular to the floor. I did not get much, if any, steam out of it if I had the unit parallel to the floor. This unit is best used as a steamer rather than an iron, and even with that, it is fair to good at best.I have learned that having a backup iron is good if the primary one stops working. I will keep this for that reason, but I would not buy it for that purpose. This would do if I need a steamer in a pinch, but purchasing an actual steamer may be the best option if that's what you're looking for.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan Steben",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5RICVRLSJMYRQDTDEHOL5ORSOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9R3RIF1IBTB1?ASIN=B0C8JFJG74",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy to use",
                "reviewText": "Small and can use on hanging clothes",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BRIANA FANNBRIANA FANN",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZNGMDLVDMFZHEILZSGQ5ZOHWNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ5SGOK4R9A8P?ASIN=B0C8JFJG74",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Good for infrequent use and small jobs",
                "reviewText": "The media could not be loaded. This mini iron comes with a drawstring carrying bag, a plastic pour cup for water, and a heat safe plate to rest it on. I don’t do very much ironing and didn’t want to commit to a full size iron and ironing board as I live in a small apartment. I mainly use my dryer to get rid of wrinkles but I wanted something for the more stubborn wrinkle prone clothing items and for flattening cotton paper for artwork. This mini iron is the perfect solution. Everything fits in the draw string bag and takes up little room, it heats up quickly and works well. I had a small issue with it dripping water when on the steam mode, but I’ve had that experience with other irons as well. The water capacity is very small, so it would be difficult to use this on multiple items on the steam mode without having to refill it. However, for someone who intends to use it rarely and for small jobs, it’s a good alternative to a full size ironing set up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71cDCyIbCRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71mIhbc-gbL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71tv2qBmRFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71x9I4kz-5L.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7dcef6a6-1935-4c25-a245-84289326d3b6/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Sabrina Guerrero ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJIBCSA2XY44NF7RFT5BV6Q2RIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V2M457PKHQGE?ASIN=B0C8JFJG74",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars decent steamer",
                "reviewText": "This item is well-made, has a good weight, and is easy to handle with one hand. It has a smooth handle and works well on flannel shirts. Filling the water reservoir is simple, it heats up quickly, and produces enough steam to remove wrinkles. However, the dry function is not very effective, especially on cotton, and requires more effort. The steam function works best when the iron is flat, producing more steam power. It can be placed on the rest plate without any leaks. Overall, it is better suited for steaming than ironing, but its performance is only average to good. Consider purchasing an actual steamer if you want a dedicated steamer.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}