{
    "remaining_requests": 31869,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Portable-Steamer-Clothes-Fast-Heat-up/dp/B0BNTMRRSL",
    "body": {
        "name": "Portable Steamer for Clothes -Fast Heat-up, 1200W, 120ml Water Tank - Portable Wrinkle Remover for Home & Travel (120V Only, Not for Europe)",
        "price": "$33.98",
        "originalPrice": "$54.99",
        "rawPrice": 33.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Portable-Steamer-Clothes-Fast-Heat-up/dp/B0BNTMRRSL",
        "soldBy": {
            "sellerID": "A1KWJVS57NX03I",
            "name": "Woot",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1KWJVS57NX03I&asin=B0BNTMRRSL&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31SLi7XmwvL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/412V5C mGAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41GdPNewbqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410lHZ9yImL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wk-gtUGJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mOZQB9TdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1hlbrmVnKL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the NTAYDZSW Store",
            "link": "https://www.amazon.com/stores/NTAYDZSWIronSteamerForTravelHome/page/57C53484-A47E-486F-B5F7-9F3388F07FB5?ref_=ast_bln"
        },
        "brand": "NTAYDZSWIronSteamerForTravelHome",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2287,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 15 hrs 40 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 18 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Quick and Powerful: The 1200-watt Travel Steamer heats up in just 20 seconds, delivering powerful steam that removes wrinkles from clothes in no time.",
            "Effortless Operation: This travel steamer is easy to use, suitable for novices and experienced users alike. Its quick heat-up and powerful steam output make ironing a breeze.",
            "Portable Design: Featuring a folding design that makes it compact and easy to carry, this travel steamer comes with a storage bag and is perfect for use in 110v-120V countries like the USA and Canada.",
            "Versatile and Safe: The travel steamer can be safely used on a wide variety of fabrics such as clothes, curtains, furniture, and toys, making it a versatile tool for all your steaming needs.",
            "Careful Maintenance Required: After using the steamer, remove the water tank and heat it for 10 seconds until there's no steam. Give the unit 10 minutes of rest for every 20 minutes of continuous heating to produce steam and fully protect the item. Please note that this travel steamer is only for US Voltage 110~120 volt."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Travel Garment Steamers",
                "link": "https://www.amazon.com/Travel-Garment-Steamers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3737831"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "NTAYDZSW"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Product Dimensions",
                "value": "6\"L x 3.1\"W x 6.5\"H"
            },
            {
                "name": "Style",
                "value": "Handheld,Portable"
            },
            {
                "name": "Wattage",
                "value": "1200 watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Heat Time",
                "value": "20 seconds"
            },
            {
                "name": "Product Benefits",
                "value": "faster heating,easy to carry"
            },
            {
                "name": "Capacity",
                "value": "120 Milliliters"
            },
            {
                "name": "Item Weight",
                "value": "1.54 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BNTMRRSL"
            },
            {
                "name": "Item model number",
                "value": "TQ-103"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,287 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,080 in Home & Kitchen (See Top 100 in Home & Kitchen) #8 in Travel Garment Steamers"
            },
            {
                "name": "Date First Available",
                "value": "December 2, 2022"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "One button is all you need Press the button to turn on the steam mode, press the button again, the device will enter the non-steam mode,for dry ironing Replaceable Brush Heads The product has additional removable Hair brushes.Smoothes wrinkles and removes lint from clothes at the same time Better Conventional Irons A steamer is more gentle with fabrics. Steam is less likely to damage fabrics as it relaxes and treats fabric fibers while steaming. The Ideal Travel Companion The folded product size is only 3.6 in * 7 in，Travel, home essential, occupy a small space area.Remove Wrinkles from clothes anytime, anywhere.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/57ec04fd-56cd-4914-a7ce-feb8547a84a8.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/249b0cb8-1acd-4bda-b2c1-4c4231a32193.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/be3bfa5d-b0b8-40c1-a974-02cefddd173c.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7263655e-0a47-4bcd-a7c6-131e833339f3.__CR0,0,300,225_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "How to Attach or Take Out the Water Tank Notes: Never allow the tank to run dry while the steamer is in use to prevent damage to the heating element.ays unplug the steamer before attaching or detaching the attachment brush and filling or emptying the water tank.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4a1c439-7dfa-49e8-8af9-a3c83d5acf53.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa212987-7f3a-47de-b34a-516e0678795c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/57ec04fd-56cd-4914-a7ce-feb8547a84a8.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/249b0cb8-1acd-4bda-b2c1-4c4231a32193.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/be3bfa5d-b0b8-40c1-a974-02cefddd173c.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7263655e-0a47-4bcd-a7c6-131e833339f3.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1b86a4a1-c65b-4880-bc83-8dd3de4c8b00.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Garrett S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSGXKUYQR4RLAC5BQWIAGMBOGEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SWLZS1ZAR5C3?ASIN=B0BNTMRRSL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect small Steamer for a few garments or for travel",
                "reviewText": "I had been wanting a clothes steamer. I am one of those people who don’t fold their clothes immediately when they come out of the dryer and I practically live out of my laundry baskets. Ironing my clothes is a joke to me, honestly. But my (regular, mostly cotton) shirts would get wrinkled sitting in the basket and who wants to look disheveled or unprofessional? This was an impulse buy at first, due to the price on Prime Day. The reviews didn't seem too bad, so I thought I would try it. It comes with instructions, but is pretty self explanatory. I saw one review about it getting \"stuck\" and not folding back down before I bought it. When I got it, there's clearly a button to hold to collapse it for travel, so that seamed (see what I did there? Lol) like user error by that rater. The button moves freely for me, so no concern about folding it down and packing it. I fill it up the tank easily in the sink to the fill line with cold water and it takes “maybe” 30-45 seconds to heat up - it’s quick. This steamer does not have an off or on switch, so it starts heating up as soon as it’s plugged in, so it should always be unplugged when not in use and to cool it down before packing it away. It gets hot pretty quick and starts making “steaming noises” when it’s ready, you would know. It does have a button that you hold down when actively using it on your clothes. I did find that if you go to use it immediately, it “spits” out drops of water before it becomes an even stream. I saw a few complaints about that after buying it, but I just give it a few test squeezes into the air to get some of the \"spittle\" out. After that, it is an even stream of steam and works exactly as expected. The reservoir is small, so it’s not for a whole wardrobe (obviously), but perfect for a shirt or two. The cord is pretty short, so do take that into consideration if it matters to you. I just plug it into the outlet by my bathroom door, hang my shirt up on the door via a clothes hanger, and steam them. So far no burning of clothes or any issues. I have not traveled yet with it, but it is small enough to take (kind of the size of the hair dryers you find in hotels). I’ve used it about 6 times now already, no issues, or complaints!Extra: I planned to take this on a cruise vacation, but found out Carnival Cruise Lines do not allow personal clothes steamers, so, while I did not know that before buying it, that is not their fault, nor do I regret the buy. It still works at home or other travel!!",
                "reviewVotes": "49 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPHF6COGVA3SEE3F5NIFGGIJ73Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AP6S3SMZWQFN?ASIN=B0BNTMRRSL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Small, Portable, and Works incredible!",
                "reviewText": "I use this product when I need to quickly get wrinkles removed from my shirts. It heats up quick, is easy to use, and works wonders on my wrinkled shirts! I have saved so much time using this steamer!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SriGan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNLYK23QZS6GFQDFDMQ4GU4QESQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18QP13N0WOH9B?ASIN=B0BNTMRRSL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Product, Best for Travel or Gift to someone!",
                "reviewText": "This handheld steamer has revolutionized how I deal with wrinkles, making it a joy to keep my clothes looking their best. It is convenient, efficient, and effective - a must-have for anyone who cares about their appearance. Don't hesitate to buy this steamer; you'll be amazed by the results!• It has a compact and lightweight design that fits perfectly in my hand and is easy to maneuver around any garment.• It heats up in seconds and produces a consistent and powerful steam flow that removes creases from any fabric, even delicate ones like silk and satin.• It is versatile and can be used to refresh upholstery, curtains, and bedding, as well as clothing. I no longer need an ironing board for small touch-ups; this steamer does the job faster and better.• It is easy to maintain, with a removable and transparent water tank and a simple disassembly. It also comes with a brush attachment that helps prevent mineral buildup and prolongs the steamer's lifespan.• It is durable and reliable, showing no signs of wear and tear despite regular use. It is built to last and is worth every penny.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG4SVOJYBJM7ONDMKX5XN6SB3TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UJMW6EWQEHCG?ASIN=B0BNTMRRSL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Compact travel steamer",
                "reviewText": "This compact steamer was super easy to use and would be perfect for travelling. It worked pretty well (took a few passes) to get the wrinkles out of my pants. It sometimes left wet spots, but dried quickly.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WardaWarda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCEZRSZFBG7AXYWNHZKS42M5B4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO669Y1LCDS1F?ASIN=B0BNTMRRSL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2023",
                "reviewTitle": "5.0 out of 5 stars A game-changer for wrinkle free perfection and so convenient! Love this steamer!",
                "reviewText": "I recently purchased the most incredible handheld clothing steamer, and I must say it has completely transformed my wardrobe routine. This nifty little gadget has become my secret weapon against wrinkles, making my clothes look effortlessly crisp and professional in no time at all. Allow me to share my excitement about this exceptional steamer.Firstly, the compact design of this handheld steamer is absolutely genius. It fits perfectly in my hand, and its lightweight construction makes it a breeze to maneuver around even the trickiest corners of my garments. It's incredibly convenient to take on the go, whether I'm traveling or simply steaming clothes in different rooms of my home.The steamer's performance is truly remarkable. Within seconds of turning it on, it heats up rapidly and is ready to tackle any wrinkle it encounters. The continuous steam flow is impressive and consistent, effortlessly removing stubborn creases from delicate fabrics like silk and satin without causing any damage. It's like having a professional steamer right at my fingertips.One of the standout features of this handheld steamer is its versatility. Not only does it work wonders on clothing, but it's also a game-changer for refreshing upholstery, curtains, and even bedding. I love that I no longer have to drag out a cumbersome ironing board for small touch-ups; this steamer provides a quick and efficient solution, saving me time and effort.Maintenance is a breeze with this steamer as well. The removable water tank is easy to fill, and the transparent design allows me to monitor the water level at all times. Cleaning is a snap, thanks to the simple disassembly and the included brush attachment that helps remove any mineral buildup. It's clear that the manufacturers have considered every aspect to provide a hassle-free experience.Lastly, the durability and longevity of this handheld steamer are truly commendable. Despite regular use, the steamer has maintained its exceptional performance and shows no signs of wear and tear. It's built to last, making it a worthy investment for anyone who values quality and reliability.In conclusion, I cannot recommend this handheld clothing steamer enough. It has revolutionized the way I approach wrinkle removal, making it a delight to keep my clothes looking their best. From its convenient size and outstanding performance to its versatility and durability, this steamer has exceeded my expectations in every way. Say goodbye to the hassle of traditional ironing and embrace the convenience and efficiency of this remarkable handheld steamer. You won't be disappointed!",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61OozUGTEvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TimTim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 27, 2023",
                "reviewTitle": "Wrong Description not 110v",
                "reviewText": "The product was bought in the U.K. with the intention of using in America on our holiday. The title states 110v and so does the description. This is not correct. The steamer and its box states 220v 50hz. This won't work in USA/Mexico etc... Waste of time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erla Arnadottir",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 24, 2023",
                "reviewTitle": "Not powerful enough",
                "reviewText": "I returned mine. It is not powerful enough, takea ages to heat, short power lead.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$39.99",
                "sellerName": "NTAYDZSW",
                "sellerRating": "5"
            },
            {
                "price": "$54.99",
                "sellerName": "changjingCo., Ltd.",
                "sellerRating": "5"
            }
        ]
    }
}