{
    "remaining_requests": 31926,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hilife-Steamer-Handheld-Clothing-Capacity/dp/B07HF3X6Y4",
    "body": {
        "name": "HiLIFE Steamer for Clothes, Portable Handheld Design, 240ml Big Capacity, 700W, Strong Penetrating Steam, Removes Wrinkle, for Home, Office and Travel(ONLY FOR 120V) (Blue)",
        "price": "$29.99",
        "originalPrice": "$39.99",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hilife-Steamer-Handheld-Clothing-Capacity/dp/B07HF3X6Y4",
        "soldBy": {
            "sellerID": "A1UMNAEOI7SZ0X",
            "name": "HiLIFE Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1UMNAEOI7SZ0X&asin=B07HF3X6Y4&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CN2JH7F6"
        ],
        "asinVariationValues": [
            {
                "asin": "B07HF3X6Y4",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$29.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31O0wG8gW5L._SS36_.jpg"
            },
            {
                "asin": "B0BGRS6QMG",
                "variationName": "Color",
                "variationValue": "Maya Blue",
                "price": "$30.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31jnc28mEoL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "200",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31O0wG8gW5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41kIxm XELL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41P MSjtyhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41d-xA0FmqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PuvLTA8AL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zXygcd-qL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VfSZxm zL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the HiLIFE Store",
            "link": "https://www.amazon.com/stores/HiLIFE/page/4AE47B41-BFE5-4924-8763-EA34AACED484?ref_=ast_bln"
        },
        "brand": "HiLIFE",
        "merchantInfo": "HiLIFE Direct",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 108251,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 11 hrs 32 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 16 hrs 17 mins",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 22 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[Easy to Use] This 700W steamer generates gentle, long-lasting steam and has a 9- foot power cord, so you'll never have to worry about operating it remotely and you can iron clothes from a distance.",
            "[Portable]This garment steamer is portable and lightweight, making it an ideal travel companion. This travel steamer is compact enough to fit in any suitcase or carry-on luggage.",
            "[Large Tank]It has a water-holding capacity of 240 ml and can provide up to 15 minutes of continuous steaming to eliminate wrinkles flawlessly.",
            "[Strong Penetrating Steam] This steamer creates strong penetrating steam and can be used for a wide range of fabrics (chiffon/silk/wool/cotton/linen/nylon, etc.).",
            "[Power Requirement] Hilife Garment Steamer only use in 110-120V countries and regions such as the US, Canada, Japan. However, Plugging into a 220V-240V or not 110-120V outlet will damage the product"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Travel Garment Steamers",
                "link": "https://www.amazon.com/Travel-Garment-Steamers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3737831"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "HiLIFE"
            },
            {
                "name": "Color",
                "value": "Blue"
            },
            {
                "name": "Product Dimensions",
                "value": "6.8\"L x 5.5\"W x 7\"H"
            },
            {
                "name": "Item Weight",
                "value": "1.7 Pounds"
            },
            {
                "name": "Style",
                "value": "Handheld"
            },
            {
                "name": "Wattage",
                "value": "700 watts"
            },
            {
                "name": "Voltage",
                "value": "120 Volts"
            },
            {
                "name": "Product Benefits",
                "value": "Portable"
            },
            {
                "name": "Capacity",
                "value": "240 Milliliters"
            },
            {
                "name": "Manufacturer",
                "value": "Shenzhen Tengben Technology Co., Ltd."
            },
            {
                "name": "ASIN",
                "value": "B07HF3X6Y4"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "HL7"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 108,251 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#127 in Home & Kitchen (See Top 100 in Home & Kitchen) #1 in Travel Garment Steamers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "September 9, 2018"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "What Fabrics Can Be Steamed? The fabrics that can be steamed are similar to those that can be ironed. Always check the care label for ironing compatibility and temperature suggestions. Ideal fabrics for steaming include cotton, linens, and certain synthetic fabrics like polyester. Exercise caution when steaming delicate fabrics such as wool, silk, chiffon, and velvet, and do not use a brush attachment. Check the care instructions and consider steaming from the underside of the fabric. Additionally, waxed jackets, suede, and materials prone to melting, like plastic, leather, or dry-clean-only items, should not be steamed. Note: Please note that this product only use in 110-120V countries and regions such as the US, Canada, Japan. So We recommend that please do not use Hilife garment steamer in countries over 110 volts. If you use our products under 220V-240V voltage, the product will be burned immediately and cannot be used.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/975de83d-1b78-4cdc-9dad-75fda9750c36.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "How to Steam Clothes 1. Ensure that water is filled up to the tank's maximum line. Low levels will damage the steamer. Excessive levels will cause water spraying. 2. Plug in the steamer. When the light on your device turns on and steam is produced, it’s ready to go. 3. Hold the garment taut from the bottom and gently work your way up and down, section by section. Keep the steamer's nozzle moving; avoid leaving it in one spot. When steaming, never turn the unit upside down or tilt it past a 45-degree angle. 4. After steaming, allow your garment to dry and settle before wearing it to prevent wrinkles from reappearing. For stubborn wrinkles, steam over the area for up to 30 seconds, allowing steam to relax the garment fibers, releasing wrinkles and odors. Steaming Precaution: Avoid holding the steamer too tightly to prevent creating new creases. Should You Use Distilled Water or Tap Water? Always check the manufacturer's instructions for your garment steamer. If specified, use distilled water. If you live in an area with hard water, it is recommended that you use distilled water. Hard water can leave mineral deposits, visible as white flakes and potentially cause machine clogging. If you live in an area with regular water, you can fill up your steamer with tap water. NOTE: *Please do not add water over the Max water line. *Never turn the unit upside down or tilted your steamer past a 45-degree angle. *Never use the steamer on clothes that you are wearing on yourself. *For perfect use-please use a hanger to hang your clothes while steaming.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d192a21-471e-403c-ad4d-7c0a69418f29.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/8bbaa6b5-f301-4f81-b86b-c70f9257d1f2.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/c79e2c1f-d6c7-4237-b2dd-505c4a556324.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/975de83d-1b78-4cdc-9dad-75fda9750c36.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "P Gigac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLJBQ3A2HZCEEGF43WUTB6AOMXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H7HGSPVGIK5S?ASIN=B07HF3X6Y4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Good steamer!",
                "reviewText": "I got this for steaming and blocking tunisian crochet projects. Its a good size, not too big or heavy. Easy to use, heats up quickly, and does exactly what it should. I ended up using it on a flannel shirt before i was done with my crochet project. It might be my new favorite toy! Wrinkles right out...quick and easy! I'll be getting another one for my daughter in college.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marguerito",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTKROWVBA4OIKPVKFONLPIJY6IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UJAELHYX8QZK?ASIN=B07HF3X6Y4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect for travel.",
                "reviewText": "We bought this for travel and it worked for perfectly on our vacation. But we also use it now that we are back home. It is very convenient when you don’t want to pull out the iron and ironing board and does a good job of removing wrinkles.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yeymy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZW5ECHSGLY7G2KE252LURA7Y3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5AXM0UQ21T63?ASIN=B07HF3X6Y4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Small but works miracles",
                "reviewText": "When I made my buy, I did not take the time to read the reviews or even consider the advantages and disadvantages of the product. I wanted to try it, and I saw this one, and it was reasonably priced, so I only thought twice before purchasing. This steamer would be a good investment for people like me who do their laundry to ensure few wrinkles; however, no matter how hard you try, you will always have a wrinkle here and there. And this steamer is small but works miracles when it comes to those tiny wrinkles. It is travel friendly, easy to store, and compact. I am satisfied with the purchase because I knew it was something other than what I would use daily. There are instances when a minor crease in my clothing makes me lazy about getting out the iron and performing all that extra work. I did not need it for anything significant, in other words. I was excited to try it when it arrived, so I did. At first, I was frightened because there did not appear to be any steam coming out, but after 3 minutes, I saw smoke, so I recommend giving it some time after being plugged in to get it operating. I had never used a steamer before and was highly pleased. It contains enough water to complete at least one outfit. To avoid water spurting out, don't fill it up. Be cautioned not to put your hands or skin too close to the blue nozzle because this machine part gets hot. Despite being portable and simple, I tried a steamer because it doesn't leave wrinkles and lines like an iron. And just as expected, the steam did wonders for me in removing wrinkles. I also used the included brush, which worked equally effectively both ways. Although it works wonders, I would not suggest it to someone who plans to use it frequently because it is time-consuming and doesn't work as well on oversized clothing. This isn't to say that it doesn't work, just that you must review it a few times to get it to look exactly right. However, this is ideal if you're looking for something inexpensive, convenient for storage, and simple to use. Remember that it works best on smaller clothes because it will take less water, and you can get a lot done with one full cup. If you wanted to steam more than one piece of clothing at a time, you would have to stop often, turn the machine off, and let it cool down for a few minutes before adding more water and plugging it back in, and then wait another three minutes for the steam to resume. It has undoubtedly been put to use and has been helpful on numerous occasions. Getting wrinkle-free clothing has become necessary for travel and daily life. The functionality of this product is excellent, given its size and cost. The product heats up quickly and is a perfectly manageable size. Use filtered or purified water to avoid limescale buildup that could damage equipment and stain garments. Although it removes wrinkles rapidly, it cannot replace ironing. The product is excellent overall, and I suggest it unless you plan to use it frequently for formal attire because doing so requires a lot of time. But don't let it deter you from purchasing it. I'm sure you will love it as much as I do and will use it extensively. People like me who take their time with their laundry to ensure minimal wrinkles would benefit from investing in this steamer. Despite our best efforts, there will inevitably be a few wrinkles here and there.",
                "reviewVotes": "288 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maizie Mac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWOGDFBO6LZJQWLPCQ35VYELLMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25U9WRXICAA2I?ASIN=B07HF3X6Y4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars SO FAR, SO GOOD!",
                "reviewText": "I just received this clothes steamer and so far it is an impressive appliance.It was very well packaged, inside a strong box. It came as described with a generous measuring cup, 2 brush attachments, and a user's manual. All items are very sturdy, great quality. In particular, the electric cord is heavy duty and very long as advertised.It only took 130 seconds for the water to boil, exactly as decribed in the user's guide.The steam is hot and strong enough to do the job. I did a trial test on a heavy cotton dish towel and it immediately removed all the wrinkles.I would recommend this steamer, I think it is well made and comes with a 2-year warranty.Also it was delivered in 4 hours, my first \"same day\" delivery. Very Impressive!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudia C. Carr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJHHZKCTO344HLRMRNFRA3NQFHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ2MTNIQXF278?ASIN=B07HF3X6Y4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars This gizmo works!",
                "reviewText": "Follow the instructions closely. It's very easy. At first it doesn't seem that there is anything happening. It doesn't emit a lot of visible steam. But it works fantastically. Takes about 30-40 seconds to heat up. Just go up and down on your fabric and your wrinkles disappear quite quickly. I recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TDM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUDJFBYZI56GYU5T5ZF7AMYYNZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPBIDL4RVZORS?ASIN=B07HF3X6Y4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Works well, small water reservoir. Don't overfill!",
                "reviewText": "This worked well on my heavy blackout curtains. I was so excited to hang them that I neglected to press them properly. I used this to steam the wrinkles out. This did not work as well as an iron would have, but it took the wrinkles out and now they look presentable. It helps if you can pull the fabric taught while steaming the item. The cord was long enough for me to work from the top of 8 foot curtains down to the floor. Seeing how well this worked on the heavy fabric of curtains, I believe this would be very effective on clothes on the hanger.This heats up in about 1 minute to boil the water, and obviously the steam and water are very hot. It has a small reservoir that I had to refill four times, but I steamed three large sets of curtains. Do not overfill the reservoir because when the water boils, it will shoot the boiling water out of the steam holes if there is too much water.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashmit Aggarwal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2024",
                "reviewTitle": "Hilife Steamer - A Compact Powerhouse for Wrinkle-Free Elegance Anywhere!",
                "reviewText": "The Hilife Steamer for Clothes has completely revolutionized the way I approach garment care, providing an unmatched level of convenience and effectiveness. This handheld clothing steamer is a true gem, offering a perfect blend of portability, power, and efficiency that makes it an indispensable addition to my daily routine.The 240ml big capacity is a game-changer, allowing for extended use without constant refilling. Whether at home, in the office, or on the go, the Hilife Steamer effortlessly tackles wrinkles, leaving my clothes looking freshly pressed and ready to wear. The compact design makes it a perfect travel companion, fitting snugly into my luggage for wrinkle-free elegance wherever I go.The steamer heats up remarkably fast, saving me precious time during my morning routine or while preparing for an important meeting. The powerful steam output effortlessly removes wrinkles from various fabrics, including delicate materials that traditional irons might struggle with. It's a versatile solution that caters to all my clothing needs.What truly sets the Hilife Steamer apart is its ease of use. The ergonomic design and comfortable grip make it a joy to handle, while the intuitive controls ensure a hassle-free experience. The portable nature of this steamer means I can refresh my clothing right on the hanger, eliminating the need for an ironing board and simplifying the entire process.I appreciate the thoughtful design elements, such as the automatic shut-off feature for safety and the durable construction that speaks to the steamer's longevity. The Hilife Steamer has become a go-to solution for quick touch-ups, saving me from the hassle of setting up a traditional iron and offering a more efficient way to keep my wardrobe looking impeccable.In conclusion, the Hilife Steamer for Clothes is a game-changing garment care tool that has earned its place as a staple in my daily routine. It combines functionality, portability, and efficiency in a way that few other steamers do. If you're in search of a reliable and compact solution to banish wrinkles from your clothes, look no further. The Hilife Steamer delivers on its promises and more. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. O. Stern",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 6, 2021",
                "reviewTitle": "Pequeña y potente",
                "reviewText": "Esta plancha de vapor vertical funciona tal y como una tetera eléctrica (pero sin apagado automático al hervir). El tamaño reducido le permite calentar agua con gran velocidad (menos de 5 minutos para tener vapor suficiente). La cabeza removible permite que el llenado de agua sea extremadamente simple (una gran ventaja) y los materiales plásticos son de alta calidad. La longitud del cordón eléctrico permite tener un gran rango de movilidad lo que facilíta enormemente su uso. No la he usado para viajar, pero su tamaño lo permitiría sin ningún problema y la velocidad de planchado permite que no se desperdicie nada de tiempo en dejar la ropa lista para usarse. Definitivamente la recomendaría o la volvería a comprar.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Weather",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2024",
                "reviewTitle": "Steamer",
                "reviewText": "It is small enough to to store on a shelf and works fine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IRMA DEL C B DE ACOSTA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 13, 2022",
                "reviewTitle": "buen producto",
                "reviewText": "para la ropa mas fina no pasar la plancha por encima... ideal para desarrugar...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KelsieKelsie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 7, 2024",
                "reviewTitle": "Works!",
                "reviewText": "I think this worked really well. This shirt already has folds but it got so out of hand that I almost tossed it. I tried this out and saved the shirt. Very happy with how easy it is to use and the size is very nice for storing!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71fUiA4jRoL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pn0Jns2LL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$38.99",
                "sellerName": "HiLIFE Direct",
                "sellerRating": "5"
            },
            {
                "price": "$39.99",
                "sellerName": "Resource's Team",
                "sellerRating": "5"
            }
        ]
    }
}