{
    "remaining_requests": 31896,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wagner-Spraytech-0282014-Demand-Cleaner/dp/B003PGQI3Y",
    "body": {
        "name": "Wagner Spraytech 0282014 915e On-Demand Steam Cleaner & Wallpaper Removal, Multipurpose Power Steamer, 18 Attachments Included (Some Pieces Included in Storage Compartment) For Floor",
        "price": "$144.99$119.28",
        "originalPrice": "$159.99",
        "rawPrice": 144.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wagner-Spraytech-0282014-Demand-Cleaner/dp/B003PGQI3Y",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CP69BC84"
        ],
        "asinVariationValues": [
            {
                "asin": "B01JYVLF0Y",
                "variationName": "Size",
                "variationValue": "905 Steam",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B003PGQI3Y",
                "variationName": "Size",
                "variationValue": "915 Steam",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07DPQ1JXZ",
                "variationName": "Size",
                "variationValue": "925 Steam",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B003PGQI3Y",
                "variationName": "PatternName",
                "variationValue": "Cleaner",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CR9VVQX4",
                "variationName": "PatternName",
                "variationValue": "Cleaner + Accessory Pack",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41KtRZjAQfS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51NvfupLDiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uNNgHprlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hLKlByluL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51B9fBynqzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ar7A co9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zhJIJmrBL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Wagner Spraytech Store",
            "link": "https://www.amazon.com/stores/Wagner/page/5386E912-836E-4FD7-AE3E-83759CDA24FA?ref_=ast_bln"
        },
        "brand": "Wagner",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 16697,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Saturday, February 17. Order within 18 hrs 13 mins",
            "FREE delivery Monday, February 19",
            "Or fastest delivery Saturday, February 17. Order within 22 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "CHEMICAL FREE STEAM CLEANING: The Wagner 915e Power Steamer is a multipurpose steamer that uses nothing but chemical-free steam to remove wallpaper and clean countless household surfaces without using chemicals",
            "INCLUDES 18 ACCESSORIES AND NOZZLES: Use the included attachments to loosen and dissolve dirt, grease and grime on floors and carpet, grout, kitchen countertops, appliances and more",
            "GREAT FOR WALLPAPER REMOVAL: Easily strip wallpaper with no harsh chemicals needed. The 8 ft. steam hose provides great length for reaching tall walls while stripping wallpaper",
            "HIGH TEMPERATURE AND LONG RUN TIME: The steamer holds up to 40 oz. of water and heats up to 212°F (100°C) in under 9 minutes. On a full tank, it provides 40 continuous minutes of cleaning power",
            "EASY TO USE: Connect your attachment, add up to 40 oz. of distilled water, and turn the steamer on. The orange light will turn off when the steamer is ready for use and turn back on again during steaming when building up steam (you can continue using)"
        ],
        "description": "Product Description The Wagner 915e Power Steamer is a multipurpose, chemical free steam cleaner that can be used to strip wallpaper and clean numerous areas around your home without chemicals! You can use the 18 included nozzles and accessories to loosen and dissolve grease and grime on kitchen countertops, grout, appliances, toilets, showers, flooring, sinks and much more. You can also use the steamer outdoors to clean grills, outdoor furniture and even automobiles. Just add up to 40 oz. of distilled water for chemical-free, natural cleaning and up to 40 minutes of run-time on a full tank. You can also use the included wallpaper steam plate to easily strip away old, outdated wallpaper without using harsh chemicals. This steamer is easy to use for homeowners and is a great tool to have for homes with pets and kids. Plus, access Wagner+ for all the information you need in the palm of your hand! Scan the QR code on your product to have instant digital access to product registration, how-to videos and projects, extended warranties, manuals, customer service info and more! Amazon.com The Wagner 915e Power Steamer is a multipurpose, chemical free steam cleaner that can be used to strip wallpaper and clean numerous areas around your home without chemicals! You can use the 18 included nozzles and accessories to loosen and dissolve grease and grime on kitchen countertops, grout, appliances, toilets, showers, flooring, sinks and much more. You can also use the steamer outdoors to clean grills, outdoor furniture and even automobiles. Just add up to 40 oz. of distilled water for chemical-free, natural cleaning and up to 40 minutes of run-time on a full tank. You can also use the included wallpaper steam plate to easily strip away old, outdated wallpaper without using harsh chemicals. This steamer is easy to use for homeowners and is a great tool to have for homes with pets and kids. From the Manufacturer The 915 On-Demand Power Steamer is a pressurized system that supplies steam at the touch of a button. Steam cleans and sanitizes surfaces in one step without chemicals. The steamer can be used to clean barbeque grills, greasy stovetops, bathroom fixtures and floors. The steamer includes a wallpaper steam plate, window/tile squeegee, floor cleaning head and pad, two extension tubes, measuring cup, filling funnel and assorted utility brushes. See more",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510106"
            },
            {
                "name": "Steam Cleaners, Steam Mops & Accessories",
                "link": "https://www.amazon.com/Steam-Cleaners-Steam-Mops-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11333725011"
            },
            {
                "name": "Steam Cleaners",
                "link": "https://www.amazon.com/Steam-Cleaners/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3303860011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Wagner Spraytech"
            },
            {
                "name": "Special Feature",
                "value": "Power Light Indicator"
            },
            {
                "name": "Surface Recommendation",
                "value": "Floor"
            },
            {
                "name": "Model Name",
                "value": "Wagner 0282014 915 On-demand Steam Cleaner, 120 Volts"
            },
            {
                "name": "Included Components",
                "value": "User Manual, Utility Brushes, Power Steamer, Measuring Cup And Fill Funnel, Two Extension Tubes, Floor-Cleaning Brush And Cloth, Window Squeegee, 500-Watt On-Demand Power Steamer And Cleaner, Wagner 915 (0282014) 1 See more"
            },
            {
                "name": "Wattage",
                "value": "‎1500 watts"
            },
            {
                "name": "Color",
                "value": "‎Yellow"
            },
            {
                "name": "Capacity",
                "value": "‎4 G/day"
            },
            {
                "name": "Style",
                "value": "‎915 Steam"
            },
            {
                "name": "Product Dimensions",
                "value": "‎20.25\"D x 12.25\"W x 10.5\"H"
            },
            {
                "name": "Manufacturer",
                "value": "‎Wagner Spraytech"
            },
            {
                "name": "Part Number",
                "value": "‎282014"
            },
            {
                "name": "Item Weight",
                "value": "‎12.62 pounds"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎0282014"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Size",
                "value": "‎915 Steam"
            },
            {
                "name": "Pattern",
                "value": "‎Cleaner"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Number Of Pieces",
                "value": "‎1"
            },
            {
                "name": "Number of Handles",
                "value": "‎1"
            },
            {
                "name": "Special Features",
                "value": "‎Power Light Indicator"
            },
            {
                "name": "Usage",
                "value": "‎personal"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "Warranty Description",
                "value": "‎1 Year"
            },
            {
                "name": "ASIN",
                "value": "B003PGQI3Y"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 16,697 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,164 in Home & Kitchen (See Top 100 in Home & Kitchen) #2 in Steam Cleaners"
            },
            {
                "name": "Date First Available",
                "value": "January 6, 2011"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Perfect Household Steam Cleaner Clean Your Entire Home With Steam The Wagner 915e On Demand Steam Cleaner uses steam to easily clean countless areas around your home without chemicals. Applications include kitchen appliances, toilets, countertops, floors, windows and more. Includes 18 Attachments With the included brushes and attachments, no surface can escape your steam cleaning! The steamer includes a wallpaper steam plate, large cleaning brush and mop pad, window and tile squeegee, fabric steamer, microfiber bonnet, jet nozzle, straight adapter, nylon utility brushes, brass utility brushes, fill funnel, angled adapter, and extension poles. Also Great for Wallpaper Removal Easily remove old wallpaper by using the included wallpaper steamplate to soften wallpaper adhesive for quick removal. Features Holds up to 40 oz. of water and heats up in under 9 minutes Chemical free way to clean Up to 40 minutes of run time Fully portable wheel design Nozzles pack away into built-in storage compartment",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/27eafe40-4e7a-417f-b3cf-f012527bdad2.__CR0,0,2000,2000_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/7f7cc441-ec82-4e2c-818b-b5bebdf108f8.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/27eafe40-4e7a-417f-b3cf-f012527bdad2.__CR0,0,2000,2000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ff1a4200-5c4f-4b7b-beac-3b7ddcff9188.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/32132f37-b88f-49cb-98ef-85368e854119.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b16965bc-081e-4e39-94b4-8087e80b417d.__CR0,0,1940,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amy NoblesAmy Nobles",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNGTFNUMDHKFXHYL4YWZBM3EFAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BBW0V6VGSO6G?ASIN=B003PGQI3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Obsessed",
                "reviewText": "As soon as I got this machine, I went straight to my kitchen grout! It blasted away the grime and MOLD that was hiding in the porous grout! My kitchen reeked of earthy/lake water so I looked it up, the smell was mold! Got my whole kitchen done with one tank of water and then resealed my grout. Next day on to the bathrooms. I used the bent attachment for up under the toilet rim and was shocked to see so much gross PEE running down. It blasted away areas my toilet brush couldn’t reach. The long attachment arms made doing the shower walls so easily and doing the floors without bending over. I am obsessed and addicted now.I was also able to remove cooked on food from my glass top stove that no other cleaners could do.The window squeegee part works ok but the steam still left spots but oh well it’s was sanitized and I just wiped dry with a towel.The ONLY complaint is the handle grip part. I was doing so much two days straight, I was getting blisters at the bottom of my thumbs/ inside palms. I will need to find something to wrap around those hard groves to pad the top of the handle but otherwise it’s been amazing.I also did my couch and loveseat with the cloth cover and was grossed out by the cover afterwards. These couches are only 2 years ago but never deep cleaned before and I have two grimy handed boys so I figured it would be gross.I will add I had a handheld steamer and it worked ok but definitely did not get as hot as this machine, I could touch the steam and not get burnt. This machine steam is HOT!!!! So I know it’s sanitizing too!The handheld was also heavy to hold after a short time and the tank so small I would only get a toilet cleaned and have to stop and wait to cool down before I could refill. So it would take weeks to do my whole house and definitely not worth the money.This machine last 40+ min before having to add more water. I got the bigger package with more attachments and would say it’s worth it if you want a clean sanitized house.",
                "reviewVotes": "113 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61XhHyk-qpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717gBlo8+6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WkByRnhiL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71xe10-2KcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Skip Henk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCY3PHQ7A6F42ATVGGA7CM5EUAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKLSZ43OL9IKF?ASIN=B003PGQI3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2013",
                "reviewTitle": "5.0 out of 5 stars Fairly solid machine!",
                "reviewText": "So, I bought one of these to see how well it works and I am fairly happy with my purchase so far. I will just attempt to list the pros and cons as briefly as I can:PROS:1) Can clean virtually any surface (even wood if you are careful and don't let it saturate the wood to the point where it starts to peel or warp).2) Easy to move around with the wheels.3) The attachments are fairly straight forward and easy to use.4) Holds a lot of water for nearly an hour of steaming before it needs to be refilled and reheated.5) Easy to switch on the steam and automatically shuts off if you release the lever.6) Powerful enough to blast nicotine and other stubborn stains off of the walls and ceilings of an old apartment that we are cleaning (so much so the ceiling tiles I have done so far look as though they were painted compared to the ones left untouched.7) Takes dirt off of floors (albeit with some continued effort) that are nearly 50 years old. The tiles I have done thoroughly are revealing their true color which was a bright white at one time, while the rest around them are still yellowed that have yet to be steamed.8) Doesn't take too long to heat (roughly 15 minutes -- time you can use to do other cleaning before you steam the floors or whatever.9) long hose (about 6 feet or so) and two extending arms aid in cleaning ceilings and other higher up surfaces.10) Not too heavy to carry from room to room or up and down staircases.CONS:1) There is no visible reservoir to judge the water level. The solution I have found to solve the issue of potential overflowing is to wait until the steamer simply stops producing steam. This way you know it's empty inside and then use a measuring cup to measure out 48 ounces of water (the maximum amount the reservoir can hold) and then when you add it you won't have to worry about overflow.2) The hose, while it is long, easily twists up even after just uncoiling it. I would liken it to a phone cord in the way it twists up so easily. While it is a nuisance at times, it is not that big a deal. It does easily stretch back out and uncoil if you lift it up to do an area up high.3) The only on-board storage is for the two tiny brush attachments that come with the machine to do cleaning of grills and grout and other surfaces that require a good stiff brush to clean. However, I just keep the other attachments on a shelf when not using them.4) The machine only comes with one pad, which is essentially cheap terrycloth. While it is certainly machine washable or easily hand washed in the sink, it could become tiring having to do this all the time. A solution I have found that works well is to get a white towel and cut it into pieces using the pad that comes with it as a guide. These hand cut pieces works fairly well if properly clipped on and seem to even have more absorbency than the one that comes with the product. On a side note extra pads can be bought from the company for 11 dollars for three (fairly inexpensive compared to Shark steamers that charge 20 dollars for two pads).5) When you first start to steam an initial blast of water typically comes out. Not too big of an issue either simply spray into the air or onto a towel or into a cup to get that initial water blast out of the way then you are good to go with a great supply of steam cleaning power.6) The power cord is perhaps one of it's greatest cons, as it is only about 2-3 feet long. Again, easily rectified by using an extension cord. You can use a 50 footer as I do so that you do not have to worry about unplugging it and plugging it back in multiple times.7) The buttons you have to depress to remove attachments tend to be a bit sticky (even after only a few days of use) just be careful to depress them completely by pushing down right on the center of them before pulling off any attachments.8) The red light will come on quite often (sometimes less than a minute after getting the green light that it is ready to go and at max temp. This does NOT mean you cannot still use it. It may be a faulty sensor or it could just be that it fell a few degrees below the max temp, nevertheless it still works great even when the red light comes on. Do not let it alarm you and make you think you have to stop repeatedly as one reviewer stated when cleaning his floors.Overall, I am rather impressed with what I have done with the steamer so far and look forward to continuing to use it to get this apartment in tiptop shape for renting. For the price of under 100 dollars it seems to be a great option to get the job done. Don't expect miracles, but do expect to be pleasantly surprised with what things you can clean. I have done floors, walls, ceilings, windows (which it does beautifully with the squeegie attachment, might I add) tiles, wood (even though the manual says it isn't recommended -- see my comment from above regarding using the product on wood), toilet, sink faucets, stove tops, and even metal doors with great success. It also can be used on furniture (again be careful not to overly saturate the upholstery so as to prevent molding), curtains, and even clothing (of course check your labels to make sure that steam won't damage a particular fabric). I say, so far at least, that the product is worth the money and will be beneficial to you to assist with cleaning. It makes cleaning much easier and with no need for chemicals it is a very ecological cleaning option. Remember everyone has different experiences. Give the product a try and I don't think you will be disappointed. Plus, if you should find you don't like it, Amazon has a great return policy! Happy Steaming!EDIT: 2/11/13 Used this guy on my aunt's linoleum kitchen floor and it took white paint from when my grandfather painted her kitchen 8 years ago right off...every spot of paint is gone. She had been trying for years to get it off and this worked like a charm in a matter of minutes it was all gone as though it never had been there in the first place -- also it has cleaned tile floors that were 50 years old that always looked dingy and yellowed no matter what I did..now the tiles look bright white again...after these two experiences had to update this to 5 stars.",
                "reviewVotes": "402 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVGVXOEUE4ZKTNCCATZRJ4CVIIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RDIJFDRY7544?ASIN=B003PGQI3Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Great product!",
                "reviewText": "This is a great and easy to use steamer. I have used it for everything from the shower to windows. It's definitely great for getting stubborn grime/soap scum off shower tiles and also for cleaning windows, doors, etc... Great all around",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bonemaker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPHQW6IUAI3WSAFO4NCUOCIGQPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7GATPKZQZSQ3?ASIN=B003PGQI3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Works really well",
                "reviewText": "The steamer works really well. So far I have used it to clean hardwood floors, kitchen counters, bathroom tile, and baseboardsIt produces a lot of steam and has very useful attachmentsI have a rental condo that I plan to use this machine to remove some wallpaper. We will see how well it works.So far, I’m quite pleased with my purchaseThe only downside is the cord which is quite short and the fact that you can’t see the water level inside the machineWhen it runs out of water, it will just stop producing steam. That’s the only indication that you don’t have any water inside of it.Overall, this is a very good steamer for the price",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maravilloso!! Es súper práctico y eficiente para la limpieza profunda ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 31, 2024",
                "reviewTitle": "Maravilloso",
                "reviewText": "Súper eficiente y práctico para la limpieza profunda. Tiene muy buena potencia en su presión.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 2, 2023",
                "reviewTitle": "Happy with this!",
                "reviewText": "Works great, used on tile, removing adhesive from exterior of my trailer, cleans showers etc.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alfredo Galindo Rivera",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 15, 2021",
                "reviewTitle": "Excelente por el precio.",
                "reviewText": "Se calienta la pistola pero después de usarla más de 30 minutos. Por lo que es mejor darle tiempos de descanso más frecuentes. (Uso casual más que profesional) Solamente hay que usar la lógica al utilizarlo y no dejarlo accionando sobre una misma superficie mucho tiempo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 19, 2020",
                "reviewTitle": "More powerful than expected",
                "reviewText": "Has more stream pressure than I expected, will run about 45 minutes when full. I've been using it to clean parts for my car, a 34 year old Fiero. Using the brass brushes and spraying with degreaser in does a pretty good job.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tom Connors",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 2, 2020",
                "reviewTitle": "Amazing",
                "reviewText": "I bought this model to clean the seats and interior area in my truck. Today I took it out of the box and went on a cleaning mission of the kitchen. Let me tell you this steamer is well worth the price. It is a quality made product and with Wagner its a name you can trust. This steamer comes with lots of goodies. There are 2 cleaning tips that are stored on board under the fill cover door. One for non aggressive cleaning such as counter tops, microwave, stove tops, coffee maker, stainless steel kettle, dishwasher. The other tip is a brass cleaning tip and made short work of the baked on grease on the inside of the oven door. It allows you to get right into the dirt that you are cleaning and combined with the hot steam this is a steamer to have in the around the house, cant wait to see what it can do in the vehicle. There are attachments to clean your floors with extended handles and there is even a heat plate to remove wall paper. I filled it today with distilled water 48oz and I went nuts for over an hour with no let up. The hose was solid and very comfortable in your hands and its a good length when working in a space, the only down fall I found is the power cord is not long enough would like to see it the same length of the hose. Fill the tank with distilled water, plug it in the red and green lights will come one then you have to wait for it to warm up about 20 min or so depending on the amount of water you put in I filled it up 48 oz. Once the red light goes out you can go to town with steam, and I mean steam WOW the pressure will amaze you and the job gets done. I even cleaned the windows with this steamer boom . When you are done with the steamer, turn it off, unplug the machine, trigger the steamer to release the pressure this can take a few mins. Once the pressure is gone you can open the fill cap and be careful it is hot around the fill inlet. Let cool and then drain the tank, now this is where you will need your muscles as this is an awkward machine to turn upside down to drain. You should never store it with water in the tank. I really love this machine and it is well worth the money. Thanks Wagner.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}