{
    "remaining_requests": 31902,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rowenta-Style-Garment-Steamer-White/dp/B07WC7QWWW",
    "body": {
        "name": "Rowenta Professional Full Size Steamer for Clothes with Screen 65 Inches 1.3 Liter Capacity 1700 Watts Ironing, Fabric Steamer, Garment Steamer, Adjustable IS8440",
        "price": "$136.99$102.73",
        "originalPrice": "$159.99",
        "rawPrice": 136.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rowenta-Style-Garment-Steamer-White/dp/B07WC7QWWW",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CM2C9NK4"
        ],
        "asinVariationValues": [
            {
                "asin": "B07WC7QWWW",
                "variationName": "Size",
                "variationValue": "1800W, 4 Steam Levels, Auto-Off, Wheels",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "White",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07WC7QWWW",
                "variationName": "Style",
                "variationValue": "Vertical Steamer with press screen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "All-in-One Steamer & Iron with board",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21FhxajWEGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51ZPsyEwbhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419s9rfJoAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KPnHU8cbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CMPeOHK L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hntzhXwcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Lf4lrQAtL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Rowenta Store",
            "link": "https://www.amazon.com/stores/Rowenta/page/38DEDA67-5202-4947-9CD6-8ED09735BCDE?ref_=ast_bln"
        },
        "brand": "Rowenta",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 1497,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Saturday, February 17. Order within 21 hrs 59 mins",
            "FREE delivery Monday, February 19",
            "Or fastest delivery Saturday, February 17. Order within 22 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Effortless professional results: Experience flawless, one-handed steaming with our patented Steam & Press vertical support system, designed to provide the perfect resistance for unmatched steaming results",
            "Fast & efficient: Power your way to smooth garments with a robust 1700 W steamer, delivering 35 g/min of continuous steam. Get out the door looking your best in no time with our 45-second rapid heat-up feature",
            "Precise steam diffusion: Our XL Delta Steam Head provides the ideal blend of speed and precision to tackle all wrinkles, even the hardest-to-reach. The steam eliminates up to 99.9% bacteria on your fabrics, keeping them fresh and clean.",
            "Adapted to every fabric: With 4 adjustable steam settings and accessories like a fabric brush, a steam bonnet, and a crease attachment, every garment care need is covered",
            "Ultimate convenience: Make your steaming sessions a breeze with a removable 44 oz water tank, easy-roll wheels for storage, auto-off and an anti-calc function for an easy maintenance. Experience great convenience for your garments"
        ],
        "description": "For professional-grade steaming made easy, the Rowenta Pro Style Care Garment Steamer offers exceptional home garment care. Achieve great steaming results with Rowenta’s exclusive patented Steam and Press vertical support system, which offers easy one-handed double-action steaming that gets you out the door looking your best in no time. 1700W of power and a 35 g/min continuous steam output produce outstanding steam performance with 4 steam settings accessible on the handle for improved ease-of-use, while the XL Delta Steam Head delivers optimal steam diffusion and high-precision performance. Pro Style Care is safe for all fabrics, with a range of convenient features to complete the perfect home clothes steamer package. Autonomy: 40 min.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Irons & Steamers",
                "link": "https://www.amazon.com/irons-steamers/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510240"
            },
            {
                "name": "Garment Steamers",
                "link": "https://www.amazon.com/garment-steamers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510248"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Rowenta"
            },
            {
                "name": "Color",
                "value": "Colors May Vary"
            },
            {
                "name": "Product Dimensions",
                "value": "20\"L x 13.2\"W x 19.5\"H"
            },
            {
                "name": "Style",
                "value": "Vertical Steamer with press screen"
            },
            {
                "name": "Wattage",
                "value": "1700 watts"
            },
            {
                "name": "Heat Time",
                "value": "0.75 minutes"
            },
            {
                "name": "Capacity",
                "value": "3.3 Pounds"
            },
            {
                "name": "Item Weight",
                "value": "15.76 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Rowenta"
            },
            {
                "name": "ASIN",
                "value": "B07WC7QWWW"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "23108844000"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 1,497 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#59,584 in Home & Kitchen (See Top 100 in Home & Kitchen) #42 in Garment Steamers"
            },
            {
                "name": "Date First Available",
                "value": "August 8, 2019"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Sleek Design Sleek, minimal footprint takes up less space and wheeled base for easily moving in your room Convenient Accessories Fabric brush, steam bonnet, and crease attachment 1700W of Steam 35 g/min continuous steam output for efficient steaming sessions & excellent results",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/37d550d4-6297-419b-9a51-9e87f23e5af2.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/94d93bbe-a234-4ecb-bbbd-abda2fe4c984.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c242e63d-2682-4b11-88d3-8458e5418012.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Exclusive and patented Steam & Press vertical support system provides double-action garment care for great results in no time Suitable for all fabrics, even the most delicate, with 5 steam settings to cover all garment care needs Removable 1.3L (52 oz) water tank for greater ease of use and convenience",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a0275f51-ae8e-4d5d-92c0-ac534473b241.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8d03a197-d4bd-4c8f-8b40-b59edd3f310e.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4d4cfc1b-f808-4de9-bd4a-9fee841ef3b2.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/3f12e7f5-effd-4b39-89ea-800e047d55df.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ac8a54c3-2d0e-42db-aa3f-dd78e1fa2884.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/37d550d4-6297-419b-9a51-9e87f23e5af2.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/94d93bbe-a234-4ecb-bbbd-abda2fe4c984.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c242e63d-2682-4b11-88d3-8458e5418012.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a0275f51-ae8e-4d5d-92c0-ac534473b241.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8d03a197-d4bd-4c8f-8b40-b59edd3f310e.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4d4cfc1b-f808-4de9-bd4a-9fee841ef3b2.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/51e54425-2e3c-43cf-a9fc-3c549c0785d7.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cory Maffeo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYHM2OBDTEUQTGGDCQGZCZX6Z4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24ODOF93RU3E3?ASIN=B07WC7QWWW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars A durable full size steamer!",
                "reviewText": "This impressive garment steamer combines innovative features, ample capacity, and powerful performance to deliver an exceptional ironing and fabric steaming experience.At the heart of the Rowenta Prostyle is its 1500-watt power, which ensures quick and efficient steaming. Whether you're smoothing out wrinkles or freshening up your clothes, this steamer gets the job done efficiently, saving you valuable time during your daily routine. The high wattage also ensures consistent steam flow, resulting in a more thorough and effective treatment of fabrics.The generous 1.5-liter water tank capacity is a standout feature that contributes to the Rowenta Prostyle's convenience. This ample capacity allows for extended steaming sessions without frequent refills. This is particularly useful when tackling a larger load of clothes or when steaming multiple garments in one go. The larger tank also minimizes interruptions, allowing you to maintain a steady workflow.The built-in screen on the steamer adds an element of sophistication and user-friendliness to the overall experience. This feature provides real-time information about the steaming process, such as water level and temperature settings. This intuitive display eliminates guesswork and allows you to customize the steaming process according to your preferences and fabric needs. The inclusion of this screen sets the Rowenta Prostyle apart from standard garment steamers.The adjustable features of the Rowenta Prostyle further enhance its versatility. The adjustable height, denoted by the model IS3440, accommodates a range of garments, from dresses to suits, ensuring that every article of clothing receives the same level of care and attention. This adaptability makes the steaming process more efficient and comprehensive, ensuring that you achieve professional-quality results at home.In terms of design, the combination of black and silver lends the Rowenta Prostyle a sleek and modern appearance. This aesthetic appeal not only adds to its visual appeal but also highlights its premium quality and attention to detail. The durable construction further underscores its long-lasting performance, making it a reliable investment for your clothing care needs.The Rowenta Prostyle Full Size Steamer for Clothes is a testament to the brand's commitment to quality and innovation. Its powerful performance, ample capacity, adjustable features, and user-friendly screen combine to deliver a garment steamer that excels in every aspect. Whether you're looking to smooth out wrinkles or freshen up your clothes, this steamer offers an efficient and effective solution. With the Rowenta Prostyle in your home, achieving wrinkle-free and well-maintained clothing has never been easier.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katy ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCQ75GAR6XISLIJEVW2IP5MIFGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7ZJOH1EK8SEY?ASIN=B07WC7QWWW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2021",
                "reviewTitle": "5.0 out of 5 stars Other reviews don’t give this justice. It’s great!",
                "reviewText": "My mother has been sewing most of her 72 years and she has sworn by Rowenta. So when I went in search for a steamer of this size I looked for over a month. I read reviews and for some reason this one on Amazon has a bad rap. Well I’ve never personally owned a large steamer, but I’ve worked years in the retail industry using a professional one. This was not difficult at all to put together. If you can put together IKEA furniture, then this is simple. I was skeptical about the amount of water it holds, thought I would have to keep refilling it. I do resale online clothing so when I need it the most, it’s usually me steaming for a couple of hours, so I just keep a pitcher of water next to me and keep filling as I go, never had I ran out of water. It works great! I even bought a “used” one, it was actually brand new, came in it’s original packaging and Amazon shipped in another box to protect it. I love that I noLonger need an ironing board and a steamer. I don’t have much space to work in so this is perfect. I read the reviews on this on the Rowenta website and it had rave reviews. We’ve always had a Rowenta iron, and the one we have is 20 years old and still working great. I hope this steamer provides me with the long lasting love that our iron has. Also if I just need to steam one item to wear, I just press the on button, go about doing what ever I am doing and when I hear it with a couple minutes I’ll take care of my garment. It automatically shuts off with out use. And the best is you can use regular tap water. The base is extremely sturdy, was a bit heavy, but since it’s the base and the steamer is movable with a handle it doesn’t make any difference. Since it doesn’t hold a large amount of water, the steamer itself would be great for doing curtains or anything you would have to hold it for if you needed to, since it’s pretty light weight. Plus! Rowenta has its own website, so if you want to add on, or replace anything you can. Like the filter, I live in a region of the US that doesn’t have the best water. I also was able to register my steamer with Rowenta in case of anything was to happen. It does come with a brush attachment, I don’t see or didn’t even really look or read for a place on the steamer to store it. But I keep it in my desk. What’s one piece?I primarily bought this specific one because of its brand and the black and gold color, it matches my bedroom attire. But it has really exceeded my expectations. No buttons to figure out what you need it for, I’ve used it on every type of material so far, and no problems. No dripping. Or leaving water spots on my clothing. I’m truly happy I went with this steamer.My personal favorite extra about this steamer is maneuverability! Since I steam for hours at a time I can sit in any chair I want, and I’m able to change the height to my needs, and move the board to different levels very easily.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Homero G. Martinez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 6, 2023",
                "reviewTitle": "muy buena opción",
                "reviewText": "buen producto",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 7, 2023",
                "reviewTitle": "Highly recommended",
                "reviewText": "This product is recommended to someone who feels ironing clothes is daunting task. This has worked wonders for me . Ironing clothes have become fun .Highly recommended product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dominic Lamoureux",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 5, 2021",
                "reviewTitle": "Livré brisé aucun services aucun retour du vendeur très chère",
                "reviewText": "L’appareil a été livré brisé, il ne fonctionne pas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Road2glory",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 10, 2024",
                "reviewTitle": "Bad quality",
                "reviewText": "I purchased the product at the end of july 2022 and after 1 year and 4 months the machine stopped working by itself and i use it lightly couple of times per weak and when i called support they said it only has 1 year of warrantyFor a devise with this price tag one of the most expensive in the market it is just really bad quality with short warranty periodI really don’t recommend this product choose a product with longer warranty period",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lungo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 17, 2023",
                "reviewTitle": "Good built",
                "reviewText": "Good quality for what steamers do",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}