{
    "remaining_requests": 31816,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hands-free-Continuous-Unlimited-Pressurized-Accessory/dp/B0BR9TLZYF",
    "body": {
        "name": "Handheld Steam Cleaner, Steamer for Cleaning, with Steam Lock Button for Hands-free Steaming, Continuous Steam with Unlimited Use Time, 120℃ Pressurized Steam, Full Accessory Set for Home & Kitchen",
        "price": "$69.99",
        "originalPrice": "$69.99",
        "rawPrice": 69.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hands-free-Continuous-Unlimited-Pressurized-Accessory/dp/B0BR9TLZYF",
        "soldBy": {
            "sellerID": "A1798G7W0W4UG7",
            "name": "Eave Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1798G7W0W4UG7&asin=B0BR9TLZYF&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNGGKBTC"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BR9TLZYF",
                "variationName": "Color",
                "variationValue": "White & Rose Gold",
                "price": "$69.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/418-G3k3e+L._SS36_.jpg"
            },
            {
                "asin": "B0B1ZW5YFR",
                "variationName": "Color",
                "variationValue": "Yellow",
                "price": "$65.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51QUJpzYaBL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $7 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418-G3k3e L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51vXIGcjMkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ofTAGQ26L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TGChOAdwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LkFbbDZ4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JjSNkfNZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1uZRYlGrHL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Eave Store",
            "link": "https://www.amazon.com/stores/EAVE/page/DFB35C77-D4C4-401D-B06D-9E1B8CA40188?ref_=ast_bln"
        },
        "brand": "EAVE",
        "merchantInfo": "Eave Direct",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 165,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 49 mins",
            "FREE delivery Tuesday, February 20. Order within 22 hrs 4 mins",
            "FREE pickup Tuesday, February 20",
            "Or fastest pickup Thursday, February 15. Order within 22 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【20s Fast Heating with Continuous Steam】 Just aim the steamer at the stain, then turn on the switches and wait for about 15-20 seconds. The steamer will spray super strong pressured steam up to 120℃(temp at the nozzle), instead of a long 4-min wait for heating. Further more, EAVE steam cleaner keeps heating while using to maintain its heat and keep the steam strong and continuous, which is different from all other designs that need a break every 2 minutes to reheat and rebuild the pressure.",
            "【Limitless Use Time - Add Water Anytime】 Add water anytime during use to make it last infinitely. The maxi load 270ml steams out for 10mins w/o intervals, and a refill of 270ml extends its use to another 10mins w/o having you wait: let it cool down, struggle with opening lid, fill water and wait it to reheat. 2 water level visible windows let you know tank is full when filling and time to refill during use w/o guesswork. The auto shut off avoids running dry in the event of a lack of water.",
            "【Steam Lock Button for Hands-free Using】 The global patent design with improvements in every way makes this EAVE high-tech handheld steam cleaner a win that outperforms all other models. The unique steam lock button frees your hands so you don’t have to hold onto the trigger the whole time while steam cleaning, no more continuous hand pressure. EAVE steam cleaner, weighs less(1.2kg only) for reduced hand fatigue, but holds quite more(270ml) for less refills.",
            "【120℃/248℉ High Temp Pressured Steam】 The steam this handheld steam cleaner produces is very hot up to 120℃(temp at the nozzle) as well as sufficient(equivalent to the wind at 70m/s acts on 0.155 per square inch), which are the results you’ve never seen on other models that are not hot enough and no sufficient steam volume and pressure to actually work on anythings. Bear in mind that it is the most powerful one that takes less elbow grease and less clean up time.",
            "【Nano Fine Steam & No Droplets In Any Angle】 Eave handheld steamer for cleaning comes with full accessories kit for multi-surface/material domestic cleaning: Grout(The super sturdy metal brush works wonders), kitchen stove, window, glass and bathroom mirrors, tile, as well as kids’ toys and pets’ mattresses. The well sealed tank has no chance to leak in any angle you position the handheld steam cleaner, and the self-cleaning function(descale) makes it last. (Select the correct mode before use!)"
        ],
        "description": "Hands-free Continuous Steam Cleaning Intelligent Design about adding water during use: Please do not worry about a burn will happen while adding water during use. DIFFERENT FROM ALL, any time you open the lid of this EAVE patented high-tech steam cleaner, steam will only spray out from spraying nozzle, never from the filling hole. Moreover, opening the lid is just a breeze, you can add water anytime during use without waiting or any struggle, no need to unplug or turn off the power switch, and no need to wait for it to cool down. Specification: Model Name: EASC16Power Supply: 120V, 60HzPower: 1100WWater Tank Capacity: 290ml(max load: 270ml)Steam Output Rate: 25 ml/minPower Cord Length: 4m（13.1 ft) What You'll Get: 1 x Main Unit1 x Small Brush(Nylon hair)1 x Small Brush(Super sturdy metal hair)1 x Extension hose1 x T-shaped tool1 x Glass wiper1 x Cone-shaped nozzle1 x Towel1 x Measuring cup1 x User Manual",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510106"
            },
            {
                "name": "Steam Cleaners, Steam Mops & Accessories",
                "link": "https://www.amazon.com/Steam-Cleaners-Steam-Mops-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11333725011"
            },
            {
                "name": "Handheld Steamers",
                "link": "https://www.amazon.com/handheld-steamers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3303862011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Eave"
            },
            {
                "name": "Special Feature",
                "value": "Hands Free Steaming, Self-cleaning Function, Continuous Steaming, Limitless Use Time, Water Level Visible, Super Fast Heating See more"
            },
            {
                "name": "Surface Recommendation",
                "value": "Hard Floor, Grout, Upholstery, Furniture, Carpet, Tile, Toilet, Shower, Fabric, Sofa, Couch, Car Seat See more"
            },
            {
                "name": "Model Name",
                "value": "EASC16C"
            },
            {
                "name": "Included Components",
                "value": "1 x Measuring Cup, 1 x Nylon Hair Brush, 1 x Main Unit, 1 x Extension Hose, 1 x T-shaped Tool, 1 x Metal Hair Brush, 1 x Cone-shaped Nozzle, 1 x Glass Wiper, 1 x Towel Sleeve See more"
            },
            {
                "name": "Wattage",
                "value": "1100 watts"
            },
            {
                "name": "Tank Volume",
                "value": "270 Milliliters"
            },
            {
                "name": "Form Factor",
                "value": "Handheld"
            },
            {
                "name": "Color",
                "value": "White & Rose Gold"
            },
            {
                "name": "Power Source",
                "value": "AC"
            },
            {
                "name": "Voltage",
                "value": "120 Volts (AC)"
            },
            {
                "name": "Capacity",
                "value": "270 Milliliters"
            },
            {
                "name": "Style",
                "value": "Continuous Steaming,Hands Free Steaming,Add Water Any Time,Water Level Visible"
            },
            {
                "name": "Package Dimensions",
                "value": "12.52 x 11.14 x 6.77 inches"
            },
            {
                "name": "Item Weight",
                "value": "5.15 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BR9TLZYF"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "EASC16C"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 165 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#55,070 in Home & Kitchen (See Top 100 in Home & Kitchen) #14 in Handheld Steamers"
            },
            {
                "name": "Date First Available",
                "value": "December 29, 2022"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Patented Design: Hands-free Steamer, 20S Fast Heating, Continuous Steam, Add Water During Use for Unlimited Use Time, 120℃ Strong Pressurized Steam EAVE Handheld steamer for cleaning is a good helper for your household cleaning, car cleaning, kitchen utensil/bedroom/kids’ toys/gooey grills/pets’ mattresses/floor cleaning, our upgraded handheld steamer for cleaning does save your time and boost your efficiency! Intelligent Design about adding water during use: Please do not worry about a burn will happen while adding water during use. DIFFERENT FROM ALL, any time you open the lid of this EAVE patented high-tech steam cleaner, steam will only spray out from spraying nozzle, never from the filling hole. Moreover, opening the lid is just a breeze, without waiting or any struggle. Highlights about adding water: Open the lid anytime during use, no need to unplug or turn off the power switch, and no need to wait for it to cool down.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1dbe4ae-e6b9-4318-8049-9ab5eb69d23f.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "How to use this handheld steam cleaner? How to Steam Clean: Note: High temperature steam, please do not aim the spraying nozzle at people. Be careful of a burn. Step 1: Select steam mode: Select the steam mode by pushing down the work mode switch.Step 2: Add water: Place the steam cleaner on a level platform, flip open the lid, and add a maximum of 270ml distilled or tap water(distilled water is better and recommended) with the measuring cup. After that, close the lid. Note: When filling water, please pay attention to the marking(MAX)Step 3: Plug in(120V, 60Hz ): Check the power supply and socket, and confirm they comply with the requirements given in the User Manual. Then plug it in.Step 4: Turn on power switch: Turn on the power switch by pressing it down on “I” side. Power indicator built in the power switch area will turn on at this time, which means power is connected.Step 5: Aim it at stain & lock the steam: Hold the handle, aim the steam outlet at the stain to be cleaned, and then push the steam lock button down to “Lock” position, the indicator light in the water container(bottom water level window) will be on(Red light) and device will heat up . After approximately 15-20 seconds the steam will start to release. Tips: For best cleaning effects, please aim the nozzle at the stain as close as possible.Please keep the steam cleaner connected to power supplies during use.The device requires a short run-in time. At the start, the steam output is very irregular and damp, single droplets of water may leak out shortly.In self-cleaning mode the steamer will only spray water instead of steam to clean the inside, please check and select the correct mode before use!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0e7854b-4f9f-42a7-8d5d-65a2769e3603.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Intelligent Designed Handheld Steam Cleaner Hands-free Steaming(With Steam Lock Button) Holding down the trigger all the time is exhausting and possibly giving you carpel tunnel, which is the way all other small steam cleaner work. This EAVE high-tech hand steam cleaner has a button to lock the steam and let it out automatically without keeping holding trigger during use, no any continuous hand pressure or hand fatigue any longer, also no hands fall off before you’re halfway done. Unlimited Use Time(Add Water Anytime During Use) The water in the tank lasts longer(max load: 270ml), and the improved design that allows you to add water anytime during use makes it last infinitely. The endless use time is made for large projects and quick jobs without focusing you on waiting, for example: wait 3-4 minutes to heat up the first use, and wait for it to stop to reheat again and again, wait to cool down to open lid for adding water, spending more time waiting instead of steam cleaning. Large Water Tank With Visible Water Level Window The 270ml(9.13oz) capacity stands to be much longer than most, and the reduced weight(1.2kg unit) isn’t that heavy to get hand tired. The 2 visible windows showing max water level and min water level give you the hint to stop when tank is refilling full and add water when low water level without guesswork. The well-sealed tank never leaks whatever angle you position it while using.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15ed694f-e165-4a97-988b-cd84da021009.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a190a36-71e9-41c1-9245-9ec151a47fc3.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90560f48-61b5-4d44-981b-be68a7e24218.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "20S Quick Heating(Not have to wait for 3-4 minutes) Unlike the previous models that have 3-4mins’ preheating time, and couple of minutes to wait for it to reheat every 2 minutes later you lose steam, which is very frustrating when you have a large-area job, this EAVE handheld steamer eliminates the need to wait and it will spray high temp pressured steam in about 15-20 seconds, and will heat while steaming to keep the heat during use. 120℃ Super Hot & Strong Continuous Steam The super sturdy metal brush works wonders on dingy grout, and the 120℃ (temp at the nozzle) hot enough pressurized steam blast is the magic bullet for cleaning the difficult-to-clean areas with ease and results. Moreover, Eave steam cleaner keeps heating while using to maintain its heat and keep the steam strong and continuous, which is different from all other designs that need a break every 2 minutes to reheat and rebuild the pressure. Self-Cleaning Function(Descale) The use of distilled water is the best. If you use tap water, and the tap water is very hard in your area, which is the main cause to lime scale inside tank. The unique self-cleaning function of this EAVE handheld steamer helps descale inwall itself and extends its longevity to the next level. (Please check and select the correct mode before use!)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e537f8af-fabb-44fd-9fda-210c33bfb04c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0732213-f9dc-4ecb-886e-5a9eecfb70e3.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9440000-4a42-4b0a-baca-77797ffc4d6f.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Hands-free Continuous Steam Cleaning Intelligent Design about adding water during use: Please do not worry about a burn will happen while adding water during use. DIFFERENT FROM ALL, any time you open the lid of this EAVE patented high-tech steam cleaner, steam will only spray out from spraying nozzle, never from the filling hole. Moreover, opening the lid is just a breeze, you can add water anytime during use without waiting or any struggle, no need to unplug or turn off the power switch, and no need to wait for it to cool down. Specification: Model Name: EASC16Power Supply: 120V, 60HzPower: 1100WWater Tank Capacity: 290ml(max load: 270ml)Steam Output Rate: 25 ml/minPower Cord Length: 4m（13.1 ft) What You'll Get: 1 x Main Unit1 x Small Brush(Nylon hair)1 x Small Brush(Super sturdy metal hair)1 x Extension hose1 x T-shaped tool1 x Glass wiper1 x Cone-shaped nozzle1 x Towel1 x Measuring cup1 x User Manual FEATURES Hands-free steaming 20S fast heating Continuous steam all the time Add water during use to extend use time to infinite 120℃ super hot steam Auto shut off when empty to avoid running dry Self-cleaning(descaling) function Maxi load up to 270ml - with max/min water level window",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dbcc0416-06d4-48af-a7cb-e75e43cc605d.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Handheld Steam Cleaner for Multi-purpose/surface/material Cleaning Kindly Reminder: 1. This is the most effective steam cleaner with strong steam blast up to 120℃, not a \"mist machine\" like most not hot enough to clean. So, it's no need to add detergent for steam cleaning, the water steam power is enough to work on almost anything! 2. It is forbidden to add the detergent into the steam cleaner due to the high temperature and pressure inside the water tank. For quick cleaning, spray the detergent on the stain to soften it.3. Capacity of water tank is 290ml, but in order to get best experience, we suggest that add no more than 270ml WATER AT A TIME, so as to leave a certain space to ensure normal use.4. After cleaning done, leave the steam cleaner machine for a period of time. After cooling, pour out the remaining water.5. Input voltage of this cleaning machine is 120V~, 60Hz, and it needs an outlet to work while using. It can continuously work for about 10minutes without intervals per fill and you can add water anytime during use.6. The device requires a short run-in time. At the start, the steam output is very irregular and damp, single droplets of water may leak out shortly.7. In self-cleaning mode the steamer will only spray water instead of steam to clean the inside, please check and select the correct mode before use!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9784db42-0645-45ec-aa3c-c4fa7bba1db6.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Round Brushes for Hard Surface Cleaning Towel Sleeves for Cloth Steaming Tool Eave Steamer EASC22 Eave Steamer EASC15BL Eave Steamer EASC16 Eave Steamer EASC21 Accessories Quantity 2 8 9 10 8 8 Continuous Steam N/A N/A YES YES YES YES Hands Free Use N/A N/A YES YES YES YES Working Time N/A N/A About 12 Minutes Unlimited Use Time Unlimited Use Time Unlimited Use Time Water Level Visible N/A N/A YES YES YES YES Fast Heating N/A N/A YES YES YES YES",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1dbe4ae-e6b9-4318-8049-9ab5eb69d23f.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0e7854b-4f9f-42a7-8d5d-65a2769e3603.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15ed694f-e165-4a97-988b-cd84da021009.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a190a36-71e9-41c1-9245-9ec151a47fc3.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90560f48-61b5-4d44-981b-be68a7e24218.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e537f8af-fabb-44fd-9fda-210c33bfb04c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0732213-f9dc-4ecb-886e-5a9eecfb70e3.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9440000-4a42-4b0a-baca-77797ffc4d6f.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dbcc0416-06d4-48af-a7cb-e75e43cc605d.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9784db42-0645-45ec-aa3c-c4fa7bba1db6.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1362d0e3-8909-4176-8de7-245452a7317f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d5181868-a5b5-4879-bb4e-d870b9e17bfe.__CR0,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/44eaf576-8cd2-459a-9cba-81f16a483620.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/04f40987-cd80-42b4-b365-9f9e084a661d.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/73067025-5e2b-407e-ad23-b818d7c3ad88.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6ea3cf33-523f-44a9-96fe-af877f39a7e4.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFOCLLE4TVR7UYZ5NMMHQ2JPLUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KCJ6FWAITI0B?ASIN=B0BR9TLZYF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent",
                "reviewText": "My Bissell stopped working so I gave this steamer a try. It’s definitely an upgrade. This one will not heat up while on LOCK only when UNLOCK is selected and at first I was not impressed. The steam was low and weak but it was only about 15 seconds, then it starts to improve I’m guessing as the water picks up heat and it will begin to release a super strong, cloudy steam. So that was different from previous steamer which I had to wait about 20 minutes for it to be ready but it would stay hot. Nonetheless, it’s just a minor change, I’m really enjoying it, the squeegee attachment works very well, so easy to clean my windows now, highly recommend it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTUDPUQCLBVOTGJ3FX76GX4X4UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SL9EC3K3DU8V?ASIN=B0BR9TLZYF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "5.0 out of 5 stars awesome",
                "reviewText": "this is a wonderful steam cleaner. you can refill the water while your working and continue to clean. that's AWESOME. other cleaners were not able to do this and you had a lot of down time waiting to get started again while things cooled off and then heated back up.. no so with this model. it's great. it's good hot steam and the attachments are good for most anything you need. im so happy i purchased this model. no complaints",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amy D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEJ2G2T4G3PW4DNPZUOFIGYV3XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RESIA7KEGPM8I?ASIN=B0BR9TLZYF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Great steamer",
                "reviewText": "I purchased this steamer to help my mom with cleaning. She dropped a container of soda and it sprayed everywhere. I used this steamer to ease the clean up. So far it has been durable and the quality is great. It heats up fast and is easy to operate.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rigger_T10",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVS6WTTHQMJN6SDLOPA2XRDVCLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7UQ367GKK7Q7?ASIN=B0BR9TLZYF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2023",
                "reviewTitle": "4.0 out of 5 stars Great job",
                "reviewText": "Pros: Light weight, good attachments. I used it on my kitchen grout..fantastic ..but you need to get on the floor. Great job because of good leverage on the brush. Good attachment for clothing. ….If it tips over mine kept working….good quality..great resultsCons: tips easily because its light weight, for grout you need to be sitting on the floor.I tried a stick type but this one does a better job but you you need to work at it.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IplayNdirt2",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW7TO2MYIE5HUF4P5DQEVUV43BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4MGRA1KAK3LF?ASIN=B0BR9TLZYF",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "1.0 out of 5 stars I’m SO sad",
                "reviewText": "Got this on January 8. Used it for about an hours worth of cleaning. Emptied the left over distilled water and put it back in box. Worked lovely! Cleaned awesome. But today when I got it out to use again, it would not heat up. Left it on for over a half an hour. Did not get hot. Nothing ! No steam.. What a waste.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXPIUTE2LIJLIIZRTPO62BHIQCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10ACUFQU9C3W8?ASIN=B0BR9TLZYF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome!",
                "reviewText": "This little steam cleaner is mighty for its size! It's light weight and compact. The cord is nice and long and easy to use. You can change the attachments in between by turning off the continuous steam because it does get hot so wear gloves or use a hot pad just in case. One small draw back but no reason to under rate it is the water capacity is just over 1 cup, which means having to have the fill cup with water in it nearby to continue to work on large jobs like an entire bathroom, sink, toilet, shower, etc...Otherwise, it does the job of removing dirt, grease, soap scum and grime and cleaning grout and water stains. My recommendation would be is to have the area you are cleaning dust free before using the steam cleaner! I didn't post pics bc there are a sufficient amount available in the product reviews/description. I do recommend this product to anyone wanting an extra clean house like me! 👍",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kidnurse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETHHXORXJPPHJ6OU5BS2QI4WLBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF48V8E0GWCPF?ASIN=B0BR9TLZYF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Love this little steamer",
                "reviewText": "So far have used it for cleaning and for garment steaming. Heats up quickly. Love the feature that locks the steam button in place so you don't have to hold it down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lori Lakota",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6L5QAF2FLSMAOIO4BXL4TLM5QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3522RTXV82TRN?ASIN=B0BR9TLZYF",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "3.0 out of 5 stars Nozzles broke on 1st day",
                "reviewText": "Both nozzles broke while cleaning my grout. There is no way to purchase a replacement nozzle. While scrubbing the grout the machine continuously tips over. It does clean very well, but I can't get that level of clean anymore without the nozzle.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}