{
    "remaining_requests": 9224,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Professional-Handheld-Moving-Microphone-Built/dp/B005BSOVRY",
    "body": {
        "name": "PYLE-PRO Professional Handheld Moving Coil Microphone - Dynamic Cardioid Unidirectional Vocal, Built-in Acoustic Pop Filter, Includes 15ft XLR Audio Cable to 1/4'' Audio Connection - Pyle PDMIC78,Black",
        "price": "$23.46",
        "originalPrice": "",
        "rawPrice": 23.46,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Professional-Handheld-Moving-Microphone-Built/dp/B005BSOVRY",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BYXVCSGG"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/317e5Sjbh5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41FIc2vSNYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mkyEHZxTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qkly PrrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nUDOHr3DL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HH4SIGsZL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81c4WWhMm+L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/716bis3zrWL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Pyle Store",
            "link": "https://www.amazon.com/stores/PyleUSA/page/D79E9149-99F8-49A4-8E8C-D24560694FC2?ref_=ast_bln"
        },
        "brand": "PyleUSA",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2797,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "UNIDIRECTIONAL SIGNAL: Cardioid pickup pattern captures source signal such as guitar amp or vocalist while shunning off-axis sound minimizing background noise & feedback reproducing audio w/out interference from instruments or speakers on stage",
            "DYNAMIC MICROPHONE: For optimal clarity and punch, robust & resistant to moisture, achieving high gain before feedback, makes this microphone ideal for live vocal applications and for recording amplified instruments",
            "ULTRA-WIDE FREQUENCY RESPONSE: For brilliant and transparent sound with integrated pop filter and windscreen to minimize breath and pop noises you can count on it to come through after countless gigs and studio applications",
            "CABLE INCLUDED: Professional grade 15 ft. XLR-to-1/4 cable supplied. This Pyle PDMIC78 is perfect for your bedroom, professional studios and on-stage vocal performances all over the globe",
            "HIGH QUALITY CONSTRUCTION: Rugged, all-metal construction for maximum reliability featuring a zinc die-cast case and steel mesh windscreen with an anti-dent ring. A perfect all-purpose, versatile stage and recording microphone"
        ],
        "description": "PylePro Model : PDMIC78Professional Dynamic Handheld MicrophoneProfessional Moving Coil Microphone, Dynamic Handheld Mic with 15' ft. XLR Cable Features: Built-in Acoustic Pop FilterUltra-Wide Frequency ResponseHigh Signal Output for Vocals and SingingRugged Construction and Steel Mesh GrillIntegrated Low Noise CircuitryIncludes: 15' ft. XLR to 1/4'' Audio Connection CablePerfect for Stage Performances or In-Studio UseTechnical Specs: Mic Element/Type: DynamicPickup/Polar Pattern: Uni-DirectionalMic Body Material: Zinc Alloy MetalFrequency Response: 50Hz-15KHz600 Ohm Output Impedance (+/-)30%Microphone Sensitivity: -54dB (+/-)3db(0dB=1V/Pa @ 1KHz)Dimensions: Φ1. 24'' x 6. 14''This unidirectional, dynamic handheld microphone is perfect for the serious musician recording in the studio or out on stage. It's perfect for voice recording due to the high quality moving coil unidirectional dynamic element. Thanks to the durable zinc alloy metal construction and steel mesh ball shaped grill, you know your equipment is secure. Includes a 15 foot XLR cable.",
        "breadCrumbs": [
            {
                "name": "Musical Instruments",
                "link": "https://www.amazon.com/musical-instruments-accessories-sound-recording/b?ie=UTF8&node=11091801"
            },
            {
                "name": "Microphones & Accessories",
                "link": "https://www.amazon.com/Recording-Microphones-Accessories/b?ie=UTF8&node=11974521"
            },
            {
                "name": "Microphones",
                "link": "https://www.amazon.com/Recording-Stage-Microphones/b?ie=UTF8&node=8882489011"
            },
            {
                "name": "Dynamic Microphones",
                "link": "https://www.amazon.com/Dynamic-Microphones/b?ie=UTF8&node=11974671"
            },
            {
                "name": "Vocal",
                "link": "https://www.amazon.com/Vocal-Dynamic-Microphones/b?ie=UTF8&node=11974701"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.5 x 10 x 5 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.3 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B005BSOVRY"
            },
            {
                "name": "Item model number",
                "value": "PDMIC78"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,797 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,716 in Musical Instruments (See Top 100 in Musical Instruments) #34 in Vocal Dynamic Microphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 8, 2011"
            },
            {
                "name": "Manufacturer",
                "value": "Sound Around"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Singing"
            },
            {
                "name": "Brand",
                "value": "PYLE-PRO"
            },
            {
                "name": "Connectivity Technology",
                "value": "wire"
            },
            {
                "name": "Connector Type",
                "value": "XLR"
            },
            {
                "name": "Special Feature",
                "value": "Musical instrument"
            },
            {
                "name": "Compatible Devices",
                "value": "Speaker"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Included Components",
                "value": "Microphone"
            },
            {
                "name": "Polar Pattern",
                "value": "Unidirectional"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Sing Your Heart Out! A perfect all-purpose, versatile stage and recording microphone.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/aebbba59-8c12-4019-b182-2460e1f8a267._SR970,300_.png"
                ]
            },
            {
                "media_text": "Acoustic Pop Filter It serves to reduce or eliminate popping sounds caused by the mechanical impact of fast-moving air on the microphone. Pyle-Pro Professional Vocal Handheld Microphone High Quality, Dynamic,Unidirectional. This unidirectional, dynamic handheld microphone is perfect for the serious musician recording in the studio or out on stage. It's perfect for voice recording due to the high quality moving coil unidirectional dynamic element. Thanks to the durable zinc alloy metal construction and steel mesh ball shaped grill, you know your equipment is secure. Integrated Low Noise Circuitry High Signal Output for Vocals & Singing Perfect for Stage Performances or In-Studio Use Includes: 15' ft. XLR to 1/4'' Audio Connection Cable",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/89861122-25ff-4f4d-8abe-da7e845e1e0d._SR285,285_.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/13e8e20b-615e-4ac3-acb6-34862f4c3eb8._SR230,100_.png"
                ]
            },
            {
                "media_text": "Satisfaction guaranteed If this item fails to meet your expectations we will accept it back a full refund within the first 30 days. We also stand behind this product with a limited 1-Year manufacturer warranty. Contact us if the item should show any defect within the first year we will help exchange it for a new one.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/5c0b0ddd-28fc-4db8-8aa2-52b3e8c2be2f._SR300,300_.png"
                ]
            },
            {
                "media_text": "Technical Specifications - Mic Element/Type: Dynamic -Pickup/Polar Pattern: Uni-Directional -Mic Body Material: Zinc Alloy Metal - Frequency Response: 50Hz-15KHz ✔ 600 Ohm Output Impedance (+/-)30% - Microphone Sensitivity: -54dB (+/-)3db(0dB=1V/Pa @ 1KHz) - Dimensions: Φ1.24'' x 6.14'' Technical Specifications -Mic Element/Type: Dynamic - Pickup/Polar Pattern: Uni-Directional - Mic Body Material: Zinc Alloy Metal - Frequency Response: 50Hz-15KHz - 600 Ohm Output Impedance (+/-)30% -Microphone Sensitivity: -54dB (+/-)3db(0dB=1V/Pa @ 1KHz) - Dimensions: Φ1.96'' x 6.41' Technical Specifications -Mic Element: Dynamic - Pickup Pattern: Unidirectional Moving Coil - Mic Body Material: Zinc Alloy Metal -Open Circuit Sensitivity: -59 dB - Frequency Response: 50Hz-15kHz -Output Impedance: 600 Ohm +/-3dB (0dB=1V/Pa @ 1kHz) -Dimensions (L x W x H): 1.96'' x 1.96'' x 6.41''' Technical Specifications - Mic Element: Dynamic -Pickup Pattern: Unidirectional Moving Coil - Mic Body Material: Zinc Alloy Metal - Open Circuit Sensitivity: -59 dB - Frequency Response: 50Hz-15kHz - Output Impedance: 600 Ohm +/-3dB (0dB=1V/Pa @ 1kHz) - Dimensions (L x W x H): 1.96'' x 1.96'' x 6.41' PDMIC78 PDMIC58 PDMIC59 PDMIC60CL",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/58af0edf-dd84-4875-9109-f813b1bcfe72._SL300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1685d0f9-848a-4ff7-9c24-d7463d045dc5._SL300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/000d7878-ddcf-4f43-afa2-deacc5f9debc._SL300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4a00ed28-f79c-4b72-bc87-f80df49bddbd._SL300__.png"
                ]
            },
            {
                "media_text": "Your Satisfaction is our #1 Priority",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b1f5cdc9-1a38-48bf-b783-0eae66665344._SR970,300_.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/aebbba59-8c12-4019-b182-2460e1f8a267._SR970,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/89861122-25ff-4f4d-8abe-da7e845e1e0d._SR285,285_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/13e8e20b-615e-4ac3-acb6-34862f4c3eb8._SR230,100_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5c0b0ddd-28fc-4db8-8aa2-52b3e8c2be2f._SR300,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/58af0edf-dd84-4875-9109-f813b1bcfe72._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1685d0f9-848a-4ff7-9c24-d7463d045dc5._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/000d7878-ddcf-4f43-afa2-deacc5f9debc._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4a00ed28-f79c-4b72-bc87-f80df49bddbd._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b1f5cdc9-1a38-48bf-b783-0eae66665344._SR970,300_.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Gabriel Ortiz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXOEFW3X5V7AZ4EXGNBG2DN6VGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GTTT34C4OPZR?ASIN=B005BSOVRY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2016",
                "reviewTitle": "5.0 out of 5 stars You get a lot more than what you pay for with this one!",
                "reviewText": "I bought this microphone simply and almost only because of its great price hoping it would not break on me, distort any sounds or cause impairing feedback while on stage. As a starting musician, my budget was very low and my only posible income came directly from playing a few gigs as a local dive bar, which didn't pay much, so when the time came to buy a microphone for my guitar amplifier my soul was set to buy a Shure SM-57 due to its undeniable reputation. However, I did not have $100 to spend solely on a microphone so as soon as I saw the Pyle-Pro PDMIC78 on my sugestions bar I was shocked to see a $10 option. I did not think twice about it as I pressed \"Proceed to Checkout.\"Here is my opinion so far:FIRST IMPRESSION:The package came pretty quickly (under a week!) and is actually very neat (blue box with pictures and information written all over). First thing that you can see in the box is that the microphone is neatly and safely wrapped next to a cheap mic cable (XLR to 1/4\"). To be fair, that cable stopped working after two years of severe abuse, which is not at all bad from a free cable that came with a $10 mic. The microphone itself closely resembles the praised SM-57 and is just as heavy. The PDMIC78 is made of metal (HEAVY metal, lol). Mine has been dropped several times from several heights and has not even dented; definitely great material.SOUND:In terms of how it sounds, it is possibly the closest I have ever heard to the actual SM-57 in this incredible price range!Don't get me wrong here, every microphone is different in some way and the quality of the SM-57 is not comparable to, say, an SM-7B, but as far as a $10 mic can go, the only defining difference between the PDMIC78 and the SM-57 is how much \"gain\" they capture. I'm not by any means a mic tech and have very basic to intermediate knowledge on how mics work, but when it comes to the mixer, the PDMIC78 requires about 3dB less in the gain control. Since I bought this microphone, its main use has been in front of an amp speaker. I use a considerably small amp (Blackstar HT-40) so my best bet is to mic up the speaker and set the controls however I need them to be. For a full two years the PDMIC78 has been the most reliable microphone in my rig, and I carry an SM-57 now to use the double-mic method.CURRENT USE:As mentioned above, I use the double-mic method on a 1x12\" speaker cabinet. I am a total sound snob and when I play, I NEED my sound to be as perfect as I can possible get it. Because of that I have chosen to use two microphones and a direct line. So my rig goes like this: I plug in Blackstar's Emulated Out directly to the main console and use that as a basis for how I want to shape my tone, then I put the SM-57 directly towards the cone's sweetspot (every speaker has a different one; mine happens to be a little bit off the center) at about two to three inches from the grill cloth. After I play a bit with the mix between the direct and the Shure, I place the PDMIC78 aimed towards the sweetspot at an angle of around a radian or so from the cloth and move it a little bit further away from the SM-57 so as to get a few more tones coming from directly around that sweetspot. When I mix in the three, the direct line is about 4-5dB lower than the mics and has about -3dB on the high frequencies. I boost the low end of the SM-57 a tad bit (depends on the room) and work the mid sections mostly with the Pyle. I'm not using the mics for specific frequencies or so, but I do target what they can do best in they're position and compensate what they do worst.OVERALL:This mic has worked wonders in live and studio applications, and has earned an impressive reputation wherever it goes. Sound engineers and musicians alike have gotten speechless simply because of this microphone's versatile performance and incredible adaptability. I know for sure this mic will be on my rig for years to come, even as a professional musician. For the price listed on Amazon.com, this is a steal. However, A review with only good things to say and no drawbacks isn't a good review, it's just advertising. I really wish Pyle-Pro ditched the cheap cable the mic brought and sent a small protective pouch to safely store the mic in. It doesn't have to be leather (or whatever it is) like Shure makes them, but even a small canvas or microfiber pouch can help ease my mind when I put it inside a bag with clips and mics that could scratch it. Just a bit of help when it comes to caring for your product would be more than nice!Thank you for reading this review; Happy Shopping!",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kyle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNROHDDZ3W55R2W5A43FCVZ4ERA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A041B2OU3FYJ?ASIN=B005BSOVRY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 20, 2018",
                "reviewTitle": "5.0 out of 5 stars You MUST construct more PYLES",
                "reviewText": "TL:DR--Unbeatable for the price and an hour of your time to beef up the wires. Gave me a great recording at low volume in my apartment, way better than the used and bargain mics I already had. Feels solid, sounds good, will be buying more and recommending to anyone looking to record or amp live!After reading the reviews and watching some youtube videos I jumped on this rediculous bargain and could not be happier! It IS NOT an SM57, but it is a great sounding dynamic instrument mic. As soon as I received the mic the rewire began. It really does have very, very thin cheesy wires in it. Probably 26ga or smaller, more insulation than conductor. I went to Lowes and picked up copper strand 16ga, a little bigger than I wanted and a little difficult to work into the housing of the mic during reassembly but I'm sure the increase in signal bandwidth was that much more beneficial. It's a very simple 2 wire replacement using a small piece of scrap wire to ground pin 1 to the chassis screw and you're done. The mic is balanced and can handle a larger current making it come to life. I'm not an electrical engineer so I can't really say what the bullet point benefits are other than the signal isn't choked by a narrow path anymore.I didn't even bother trying the mic as is because of the number and strength of positive reviews on the rewire, and they were right. I put this up to a Krank Rev Jr 1x12, midway from edge to cap using a Bugera G5 at 0.1w, full gain distrortion, quarter volume, and my Schecter C-1 in Drop C and the results were great using a Focusrite 18i20. I did have the gain at 3/4 to get -12db but I wasn't able to hear any discoloration, only a full sounding, clear thrash and chug meddley of metal. I'm guessing having 16ga wire all the way around helped deliver the higher power signal with ease. But as I sit here and write this I wonder if the thin cheesy wire continues in the capsule or if the pins the wires are soldered to continue to the diaphram itself...curious.At any rate, this mic is worth more than what it costs if you take the time and effort to beef up the power delivery. Much like car audio too small of wire will choke your system and strain it, but after a certain point larger wire is no benefit. You can get a soldering iron for 10 dollars at some major retailers and it will come the solder wire. Watch a few youtube videos and take your time. Even with all that considered, you've saved time and money over an SM57. Because, how many hours do you have to work to pay off an SM57? How about a $15 mic, possibly a $10 iron, and an hour of your time? Think about it if you're serious but skeptical. I was, but now I'm going to buy a few more for general purposes in recording live bands!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hector Valdivia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMDTNYZC73PWJVDKWXNW4NGZR6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22HQ2AYF96SQE?ASIN=B005BSOVRY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2022",
                "reviewTitle": "4.0 out of 5 stars Great gateway mic!",
                "reviewText": "It’s obviously not an SM57, probably not even close, but for the price it is pretty amazing. Overall it feels lighter and not as sturdy than the Shure mic, but that would be a concern only if you plan on using it live. I bought it to record my acoustic guitar in stereo (paired with a Mackie condenser mic) and it does a very good job (after comp and EQ) it has a similar mid, 3k-ish boost as the 57, I’ve been using it on vocals a lot because it sounds “aggressive”, I would recommend this mic if you’re interested in home recordings, it works great on vocals, guitars and drums, I bought it for $20 or so… with that price you can’t go wrong, at the very least it proved I still love recording guitars and stuff enough to flesh out a hundred bucks and get a real SM57, it would be interesting to see how it holds up against the real thing!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dora ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEB6F7F2B3R72WECYNNJTKDWVJCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UV6MCK6G3YOG?ASIN=B005BSOVRY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Exelent for the price!",
                "reviewText": "Well I have the MXL 990 wich is like $100, I compared this Pyle that costs only $17 (at the moment of purchase) with the MXL and I was surprised to the similar sound quality, sound is a bit thin but this helps with vocals since there is an augmented high end, I plan to use it with loud singers since this mic can get loud voices without clipping easily.The only not 5 stars issues are the noise floor (a bit high) and the quality and caliber of the internal cables and the 'cap' on the top that seems to be plastic but for $17 this is amazing, even more knowing that for me things are costly since I am in Colombia, what for a USA person is $17 for me is like $80 (comparing income and that sort of things), with that in mind this is still a really great and cheap microphone.Overall a great mic for budget.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rafael",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 25, 2023",
                "reviewTitle": "Tudo conforme anunciado",
                "reviewText": "Produto original da marca, muita qualidade",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Milton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 23, 2022",
                "reviewTitle": "Buena calidad a bajo precio",
                "reviewText": "Es excelente. Realice pruebas con un SM58 y se acerca mucho a la calidad y rango de frecuencias. Lo uso para captar el amplificador de guitarra eléctrica.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "fazzalari nicolas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 20, 2023",
                "reviewTitle": "Bon produit",
                "reviewText": "Bon qualité",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lawrence Sheard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 10, 2022",
                "reviewTitle": "Great for the price",
                "reviewText": "Was pleasantly surprised by how good this mic is for the price. Used it for brass, woodwind (incl. flute, clarinet and sax) and all sorts of drums and it works great. Quite a top-heavy sound - would not recommend for bass sounds (ie. tuba, bass guitar amps, kick drum), but works well for everything else. It did arrive with the housing slightly unscrewed, but I imagine that's to avoid it seizing up during storage so nothing to worry about. Will be buying half a dozen more of these soon! One thing to keep in mind though - it doesn't come with a mic clip, so make sure you've got one before buying!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "git612",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 26, 2021",
                "reviewTitle": "Mikro",
                "reviewText": "Alles okay",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$22.99",
                "sellerName": "westlake",
                "sellerRating": "5"
            },
            {
                "price": "$24.45",
                "sellerName": "TranadaCo",
                "sellerRating": "4.5"
            },
            {
                "price": "$25.08",
                "sellerName": "eCop!",
                "sellerRating": "4.5"
            }
        ]
    }
}