{
    "remaining_requests": 9251,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samson-Handheld-Microphone-Recording-Podcasting/dp/B07FKG8PGZ",
    "body": {
        "name": "Samson Q2U USB/XLR Dynamic Microphone Recording and Podcasting Pack (Black)",
        "price": "$69.99",
        "originalPrice": "",
        "rawPrice": 69.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samson-Handheld-Microphone-Recording-Podcasting/dp/B07FKG8PGZ",
        "soldBy": {
            "sellerID": "A3SPLR0MSOYZ8O",
            "name": "Lifestyle by Focus",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3SPLR0MSOYZ8O&asin=B07FKG8PGZ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09BP1DMW1"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/317vzkXuifL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31OhCj49WuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515DXCpBuoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lYWwRo-nL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51notLjpbPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AAlHtFrAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41b- 9XwGYL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Samson Store",
            "link": "https://www.amazon.com/stores/Samson/page/00BC50D5-6FA3-4CA9-864F-1F922916B4BA?ref_=ast_bln"
        },
        "brand": "Samson",
        "merchantInfo": "Lifestyle by Focus",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 860,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "VERSATILE: For podcasting, miking vocals, instruments, amplifiers and music recording",
            "COMPATIBLE: Connect directly or via USB or XLR cables (included). Compatible with Android and iOS devices",
            "CONVENIENT: High-quality audio with minimal setup, a 3.5mm headphone output for monitoring the recording and computer audio",
            "QUALITY RECORDING: Cardioid polar pattern picks up sound from in front of the mic, while minimizing ambient noise",
            "ACCESSORIES: Comes with a mic clip, desktop tripod stand with extension piece, windscreen, XLR cable and USB cable"
        ],
        "description": "USB/XLR handheld dynamic microphone For podcasting, live sound and music recording USB output connects to any Mac or PC device XLR output connects to any mixer/PA system Zero-latency monitoring 1/8-inch stereo headphone output Plug-and-play - No driver installation required Highly compatible with digital audio workstation software",
        "breadCrumbs": [
            {
                "name": "Musical Instruments",
                "link": "https://www.amazon.com/musical-instruments-accessories-sound-recording/b/ref=dp_bc_aui_C_1?ie=UTF8&node=11091801"
            },
            {
                "name": "Microphones & Accessories",
                "link": "https://www.amazon.com/Recording-Microphones-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11974521"
            },
            {
                "name": "Microphones",
                "link": "https://www.amazon.com/Recording-Stage-Microphones/b/ref=dp_bc_aui_C_3?ie=UTF8&node=8882489011"
            },
            {
                "name": "Dynamic Microphones",
                "link": "https://www.amazon.com/Dynamic-Microphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11974671"
            },
            {
                "name": "Multipurpose",
                "link": "https://www.amazon.com/Multipurpose-Dynamic-Microphones/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11974691"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "1 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "10.7 x 8.2 x 6.7 inches"
            },
            {
                "name": "ASIN",
                "value": "B07FKG8PGZ"
            },
            {
                "name": "Item model number",
                "value": "SAQ2U"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 860 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,946 in Musical Instruments (See Top 100 in Musical Instruments) #11 in Multipurpose Dynamic Microphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 13, 2018"
            },
            {
                "name": "Color Name",
                "value": "Grey"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop, Personal Computer, Camera, Amplifier, Headphone"
            },
            {
                "name": "Connector Type",
                "value": "USB, 3.5 mm Jack, XLR"
            },
            {
                "name": "Color Screen",
                "value": "No"
            },
            {
                "name": "Hardware Platform",
                "value": "PC"
            },
            {
                "name": "Power Source",
                "value": "Usb Microphone"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Video Conference, Singing, Karaoke"
            },
            {
                "name": "Brand",
                "value": "Samson"
            },
            {
                "name": "Model Name",
                "value": "Q2U"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB, XLR"
            },
            {
                "name": "Special Feature",
                "value": "Stand"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Included Components",
                "value": "amplifier, usb_cable"
            },
            {
                "name": "Polar Pattern",
                "value": "Unidirectional"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "D. Sauer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLAFDUADKARFTNYMKWHMTJUBVVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YCB5ZGV97QWX?ASIN=B07FKG8PGZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2019",
                "reviewTitle": "5.0 out of 5 stars Great little microphone",
                "reviewText": "I'm fairly impressed with this microphone. I plugged it into my laptop (a Macbook Air, but running OpenSUSE Tumbleweed because I really dislike MacOS). It was automatically detected and picked as the default input device. I spent a few minutes trying to figure out why sound wasn't coming out before I realized there's an on/off switch. Sigh. Turning it on didn't work. More sigh. Turns out, it needs to be turned on when it's plugged in, then the on/off switch works as a mute just like you'd expect.I've played with it some both as a digital source and an \"analog\" mic, and it works, again, exactly like you'd expect. It picks up my voice really well, and doesn't pick up any background noise. I'm just in a cluttered office here, not some professional sound studio. I'm simply using USB, not the XLR cable and a real mixer. And it works exceedingly well. It has some real mass to it, so it feels like it's well made. And the volume up/down buttons Just Work on my Linux machine.The audio monitor output also works well; I plugged in my Sennheiser PXC-550 headphones using their wired connection, and not only does all the background noise I can hear (several computers with fans running, etc) go away, but I get what seems to be zero-latency feedback of my voice. I'm quite happy about that.For the fun of it, I moved over to a Windows machine and tested the same - it works just as well there. But who wants to do anything important with Windows? :)Overall, I'm happy with this. Off to record some training material now, and maybe even start up a podcast!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "miles mannermiles manner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6W3HAQYN3NDNB3BVULCEFMR6YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZAYW733VY717?ASIN=B07FKG8PGZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Been using this for 3 years now",
                "reviewText": "I have been using this mic since 2020 and I love it. I have BAD BACKGROUND NOISES with a big family constantly talking in the background. Since this is a dynamic microphone, it usually only records sounds that are close to the mic which makes my zoom, discord calls, and podcasts CRIPSER and REDUCES ALL BACKGROUND NOISES. Not to mention, the versatility of this microphone is amazing as it can also be used for actual low-budget music production, film production, and maybe youtube videos.For this price, it's an amazing mic. THE ONLY ISSUE I have with this mic is that you need a PROPER SET UP in order to get the full mileage out of this mic. Before purchasing, make sure if you're using this for a PC or desktop set up you have the proper space to install either a mic stand or a mic arm. Other than that, I cannot recommend this mic enough if you're on a budget and want a quality mic that can last you a long time.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71od9+S4u9L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacob Flores",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIV7DGOXCZTB4FUK3NWO3LYOKRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7Z6Z3FTJEOGR?ASIN=B07FKG8PGZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2019",
                "reviewTitle": "5.0 out of 5 stars WHOEVER SAYS BEST AFFORDABLE MICROPHONE. THEY'RE RIGHT!",
                "reviewText": "The Samson Q2U has done nothing but wonders to improve the quality of my stream and the YouTube videos that followed. It has incredible sound for a USB sound and with minor tweaking in my streaming software I became an angel pretty much. It's fairly simple to deal with, the mini stand is a nice touch although I would recommend a Boom Arm of course. Back to the sound, I was honestly very surprised going back to my own streams and hearing my voice for the first time using the mic and I was very pleased with how professional it sounded and how drastic the difference was between this and using my CORSAIR HS60 Headset Microphone. Another great thing is the fact that it comes with a windscreen and XLR Cable for when I eventually purchase a GoXLR to further improve the audio quality of my stream. Overall this microphone is absolutely great especially for it's spectacularly affordable price point BUT... I would honestly say if you have the money for a USB centric upgrade go for the Samson G Track Pro. and go for a Rode Procaster if you wanna go the XLR route but as a step into the streaming/audio recording world it is PERFECT.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rolando IzquierdoRolando Izquierdo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGV2CA4EKYEUXOB7SMK3AUNYXJ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2URKWV0DQ2P25?ASIN=B07FKG8PGZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2021",
                "reviewTitle": "4.0 out of 5 stars Great Mic, No Issues except for On/Off Slider not working properly",
                "reviewText": "The media could not be loaded. The Samson Q2U sounds really good when I tested it in recordings and when chatting with friends on Discord. I have it fully set up and everything on my Desk (as shown in the picture attached). I haven't had any real issues with it since I bought it at the beginning of November 2020 outside of one issue which is the slider to turn it on and off recently not working properly. I've used it a good bit so I don't have to deal with pressing 2 Hotkeys to mute myself on Roll20 and OBS whenever I play D&D with my friends (or in general when I'm feeling precautious of my Mic being on while in classes). The issue itself is basically when I go and slide it to turn Off, it doesn't actually turn Off. The Samson Q2U is still collecting audio from me. From what I can tell, it just attempts to suppress the audio to the best of its ability but without filters, the audio can come through at low volume sounding very faint which is not good since you're not really mute at all obviously. It's mainly apparent if no filters are applied to it through digital means (maybe through Equalizer APO? haven't tried it) and unwanted noise comes in for others to hear.There's a video attached to this review (I hope) that shows how the Microphone sounds like and also a demonstration of what I actually mean by the Microphone issue.Moving on from that, however, because I know some people may be confused by the Audio Jack on the Microphone like I was, the whole purpose is so you can attach headphones to it and it acts as a Playback Device and the Up & Down Arrow act as buttons to mess with the Volume Percentage on your PC in general (even without plugging in the headphones to the Samson Q2U). Nothing more than that but I hear it's more in sync when listening to yourself by plugging it in through there (which I cannot confirm myself).I think it's a good buy but beware of any issues me and others have mentioned since that is something you may come across. Issues mentioned by others however are something I haven't encountered as of yet. If you're not as picky as me, you can try and find the Silver or Grey Version for cheaper on Amazon or another marketplace.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71ZRE0Wk+jL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73d7b735-e710-4bd2-af1b-b22ecf0827e5/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Sonibé",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 17, 2023",
                "reviewTitle": "Ne fonctionne pas avec mes logiciels...",
                "reviewText": "J'ai retourné l'article, ne fonctionne pas sur mes logiciels audio et ce n'est pas le genre de micro que je voulais. On ne peut pas s'en servir pour du karoké ou pour pratiquer le chant. C'est un micro pour enregistrer des Podcast et on ne peut pas s'entendre dans les écouteurs. Par exemple, Audacity va enregistrer notre voix qu'on peut écouter plus tard, mais on ne s'entend pas parler au micro comme cela devrait. Pour moi, ce n'était pas utile. J'ai acheté un Smule SM58 à la place, que j'adore d'ailleurs.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mircea ZloteanuMircea Zloteanu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 17, 2023",
                "reviewTitle": "It was not a new item, but works",
                "reviewText": "The box was clearly opened before, and the mic had the rubber gasket half fallen off. But it works properly and all items were in the box.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/6186P0yNddL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 31, 2019",
                "reviewTitle": "Good for begginers at home",
                "reviewText": "Product received as described. Microphone seems sturdy and durable. Need to experiment with different environments to see how recording quality affects.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lok Yiu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 4, 2024",
                "reviewTitle": "Good quality in reasonable price",
                "reviewText": "The USB function makes it a hybrid for XLR and USB/Computer output which is pretty handy. Good sound quality for this price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Visha Naul",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 4, 2023",
                "reviewTitle": "Stopped working",
                "reviewText": "Bought only in March and it randomly stopped working in July. How can I get my money back?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$69.99",
                "sellerName": "Lifestyle by Focus",
                "sellerRating": "4.5"
            }
        ]
    }
}