{
    "remaining_requests": 9249,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Desktop-Gooseneck-Wired-Microphone-System/dp/B003GEH3DY",
    "body": {
        "name": "Pyle Home Desktop Gooseneck Wired Microphone System-Table Mounted Corded Voice Condenser Mic with Pop Filter - XLR to 1/4'' Sound Cord - for Karaoke, Conference, Studio Audio Recording -PDMIKC5 Black",
        "price": "$30.18",
        "originalPrice": "$40.99",
        "rawPrice": 30.18,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Desktop-Gooseneck-Wired-Microphone-System/dp/B003GEH3DY",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00WUT50GI"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31en7YobaFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/411ImF qVqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xAEggXbaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51q5f0ZLNCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51H5rK0tn5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rE3gyvMtL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1-Bdeu0e3L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1-Bdeu0e3L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Pyle Store",
            "link": "https://www.amazon.com/stores/PyleUSA/page/D79E9149-99F8-49A4-8E8C-D24560694FC2?ref_=ast_bln"
        },
        "brand": "PyleUSA",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 601,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 13 hrs 52 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "PROFESSIONAL SOUND QUALITY: This audio microphone by Pyle Pro features high signal output and 200 ohm output impedance and has a pop filter to minimize breath and pop noises and integrated low noise circuitry for brilliant and transparent sound",
            "ULTRA-WIDE FREQUENCY RESPONSE: This innovative and reliable corded portable gooseneck condenser microphone system features 40hz-16khz frequency response which makes it is ideal for any voice audio and speech application",
            "ADJUSTABLE NECK: The wired microphone also features an adjustable gooseneck type mast for maximum comfort and vocal clarity and its uniform cardioid pickup pattern isolates the main sound source and minimizes background noise",
            "CABLE INCLUDED: The box comes with a professional grade 26 ft. XLR to 1/4'' audio mic cord wire to easily hook up to your speaker, amplifier, mixer, recorder. Perfect for your home karaoke, professional studios, and on-stage voice performances",
            "MADE TO LAST: This handheld mic is equipped with rugged construction and steel mesh grill for maximum reliability. A perfect all-purpose versatile stage and recording microphone that you can count on for studio applications",
            "Can connect to Desktops through use of receiver and adapter"
        ],
        "description": "Features:Flexible Adjustable Gooseneck Positioning Built-in Acoustic Pop Filter Ultra-Wide Frequency Response High Signal Output for Voice Clarity Rugged Construction & Steel Mesh Grill Integrated Low Noise Circuitry ON/OFF Switch for Stage Control Includes: 26' ft. XLR to 1/4'' Audio Connection Cable Perfect for Stage Performances or In-Studio Use Technical Specs:Battery Operated (not included), Requires 1 x '9V' Battery Mic Element/Type: Electret Condenser Pickup/Polar Pattern: Cardioid Gooseneck Length: 17.5'' Frequency Response: 40hz-16kHz 200 Ohm Output Impedance Microphone Sensitivity: -40dB (+/-)2dB Microphone Dimensions: 4.92'' x 5.9'' x 1.89'' This professional table top condenser microphone lets your voice be heard with unparalleled quality and clarity. The cardioid pickup rejects off-axis sound, blocking out unwanted background noise. The adjustable gooseneck-type mast allows you to adjust the mic to your level. This mic is constructed from durable metal and PVC for a long-lasting, everyday-use product. 200 ohm output impedance. Includes a 26.2 ft cable. Runs on 9 V battery (not included).",
        "breadCrumbs": [
            {
                "name": "Musical Instruments",
                "link": "https://www.amazon.com/musical-instruments-accessories-sound-recording/b/ref=dp_bc_aui_C_1?ie=UTF8&node=11091801"
            },
            {
                "name": "Microphones & Accessories",
                "link": "https://www.amazon.com/Recording-Microphones-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11974521"
            },
            {
                "name": "Microphones",
                "link": "https://www.amazon.com/Recording-Stage-Microphones/b/ref=dp_bc_aui_C_3?ie=UTF8&node=8882489011"
            },
            {
                "name": "Condenser Microphones",
                "link": "https://www.amazon.com/Condenser-Microphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11974631"
            },
            {
                "name": "Multipurpose",
                "link": "https://www.amazon.com/Multipurpose-Condenser-Microphones/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11974651"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "17 x 3.2 x 7.8 inches"
            },
            {
                "name": "Item Weight",
                "value": "1 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Sound Around"
            },
            {
                "name": "ASIN",
                "value": "B003GEH3DY"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "PDMIKC5"
            },
            {
                "name": "Batteries",
                "value": "1 9V batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 601 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,030 in Musical Instruments (See Top 100 in Musical Instruments) #78 in Multipurpose Condenser Microphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "April 9, 2010"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Streaming, Singing"
            },
            {
                "name": "Brand",
                "value": "Pyle"
            },
            {
                "name": "Model Name",
                "value": "Desktop Gooseneck Wired Microphone System - Table Mounted Corded Voice Condenser Mic with Pop Filter - XLR to 1/4'' Sound Cord - for Karaoke, Conference, Studio Audio Recording - Pyle PDMIKC5 Black See more"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            },
            {
                "name": "Connector Type",
                "value": "XLR"
            },
            {
                "name": "Compatible Devices",
                "value": "Radio, Amplifier, Speaker, Amplifier, Speaker"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Included Components",
                "value": ": 26' ft. XLR to 1/4'' Audio Connection Cable"
            },
            {
                "name": "Polar Pattern",
                "value": "Unidirectional"
            },
            {
                "name": "Audio Sensitivity",
                "value": "40 dB"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Echo Cancellation And Noise Reduction Built-in echo cancellation and noise reduction delivers outstanding sound quality even in noisy environments. It's very easy to carry and use. Setup Your Meeting / Crystal Clear Sound Ensure everyone is heard with this PDMIKC5 Professional Top Condenser Microphone. Compact portable design will guarantee superior audio quality. Extremely Sensitive With Minimum Sound Distortion The condenser microphone can catch the slightest signal sensitivity and reproduce your voice vividly like talking face to face with full area coverage, includes a 26.2 ft. cable.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/25ab7fd9-de20-4961-acd4-23811cfd01cf._SL300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/aa0cac0e-4c5c-44ee-8c97-b532e960dd12._SL300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7c6c1edd-f89f-45e8-b36d-7565505ce8fa._SL300__.png"
                ]
            },
            {
                "media_text": "Features Flexible Adjustable Gooseneck Positioning Built-in Acoustic Pop Filter Ultra-Wide Frequency Response High Signal Output for Voice Clarity Rugged Construction & Steel Mesh Grill Professional Table Top Condenser Microphone This PDMIKC5 professional table top condenser microphone lets your voice be heard with unparalleled quality and clarity. The cardioid pickup rejects off-axis sound, blocking out unwanted background noise. The adjustable gooseneck-type mast allows you to adjust the mic to your level. This mic is constructed of durable metal and PVC for long-lasting use.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bd8e8a53-51e1-45be-891a-a7f51428f23f._SR285,285_.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/a7bad8d9-193f-48cf-b326-c18bc97cfdf9._SR970,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/25ab7fd9-de20-4961-acd4-23811cfd01cf._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/aa0cac0e-4c5c-44ee-8c97-b532e960dd12._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7c6c1edd-f89f-45e8-b36d-7565505ce8fa._SL300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bd8e8a53-51e1-45be-891a-a7f51428f23f._SR285,285_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/40d46310-cfab-454b-a392-711ed983ed2c._SR970,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/060fb4f6-abb3-42ed-8d7c-d72889bddd91._SR970,300_.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDBBNEL22GPB4P3YE6N2IVSE3OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J592AFZVU0OX?ASIN=B003GEH3DY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 4, 2013",
                "reviewTitle": "5.0 out of 5 stars Professional quality microphone for price of a toy!",
                "reviewText": "I have a large collection of musical equipment including professional microphones. I bought this Pyle table top condenser microphone to be used mainly to encourage my children to sing while playing the piano. It sounds great, rests nicely on the electronic piano, and has a lighted on/ogff switch that really makes it function very well. It eliminates the need for a large microphone stand with boom. Furthermore, this system replaced a professional large microphone that never sounded as well. It even picks up the voice unidirectionally from as far as 6-12\" with clear sound and without hum. I use a computer mouse pad to eliminate any thumping noises that may be transmitted from the keyboard, but this may not be necessary. I recommend it to any vocalist who plays keyboard because it can sit ontop of the keboard and is so small. It is probably much more suited to practice and home use than for live performances, but we may try it anyway. The sound quality, on/off switch, and low price make this a great and unique tool. It even comes with a decent 26.5 foot cable with XLR to 1/4 plug inputs and a with a (small) foam wind screen. I will look more closely at other products made by Pyle.as a result of this purchase.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nathan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH664UVGVK5M2U7AJJ3M4F2PWV4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ20VQQIT45E?ASIN=B003GEH3DY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2020",
                "reviewTitle": "5.0 out of 5 stars As good as a professional microphone",
                "reviewText": "It picks up sound from a good two feet away, which is much better than I expected. Of course the sound isn't as strong as from six inches away, but it still gets the job done wonderfully for the price. I read the reviews that said it drained the battery too quickly, so I bought a 9 volt adaptor and I've got something better than anything $200 could have bought me - at least for my needs. I love how heavy the base is (not too heavy, but plenty heavy enough to make sure it doesn't tip over on my slanted lectern).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MaestroSabr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSM5OIJ35QCDVX6F36S4DBHKZCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17NNWQ94UDR3J?ASIN=B003GEH3DY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 5, 2013",
                "reviewTitle": "4.0 out of 5 stars Great Desk Mic",
                "reviewText": "The Pyle Home PDMIKC5 Tabletop gooseneck mic is an excellent buy.The sound quality is very good, if not a little bit on the bright side - nothing to worry about. All other aspects of this mic are professional looking. It has a nice solid weighted base which prevents tip overs. The base encloses the 9 volt battery - Pyle could've made it to take 2 AA batteries instead, to cut battery costs down. But I have used this mic over 10 hours now and the battery is still going strong, so I am hoping that this continues for a while, cause 9 volt batteries aren't cheap.The weighted base has a power switch and the mic screws on to this base. The mic head and the gooseneck look very professional, and it has an led ring around the top of the gooseneck that lights up when the mic is turned on.If you are looking for desk mics, I recommend these over the highball mics on table stands, for both PA, conference or audio/video recording. May work well in a TV environment also.Because of the small head, the mic doesn't block the face of the speaker, as is often the case with the larger highball mics.Pickup pattern is cardiod, so you don't get much feedback in PA system use - but it is a little more sensitive than uni highball mics, so be aware of mic vs speaker placement in order to minimize feedback when using with a PA system.All in all a great value in a push to talk mic - I might just order another for when I mic forums or discussion groups, etc.DId I say this can work well as a video mic also? Great pick-up pattern with a nice clean sound.The integrated mini windscreen also helps to minimize popping and breath noise. Keep it at least 5 to 7 ins from the mouth when talking, and you'll get great sound.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Minniebunnie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLS2SLVKKIL5HJCXVY2N4BIAOCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZJSVK4I3MI7I?ASIN=B003GEH3DY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2021",
                "reviewTitle": "5.0 out of 5 stars Excellent value. Good sound quality.",
                "reviewText": "A bargained priced desktop or lecturn microphone ideal for meetings and public speaking. On unpacking, the base comes separate from the flexible gooseneck microphone which has a 3 pin XLR. It plugs into the base with an additional threaded collar to ensure a secure fit.A 9V battery fits inside the base which provides power to the microphone via an on / off switch on the base. I tested the microphone by removing the 9V battery, and plugging it into a mixer (using an XLR to XLR cable - purchased separately) which provides 48V phantom power. Interestingly, on phantom power, the on/ off circuitry is disabled and the button no longer illuminates, but the red LED ring around the microphone head is still illuminated, and the microphone sounds perfectly clear as running it on a 9V battery.In short, on 48V phantom power the microphone cannot be switched off at the switch on it's base, it is always on, but has the added advantage of not requiring the battery to be replaced every 8 hours, or running a separate DC power supply.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Buerk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUPKKHXY6AK7LQGHFWLDU7XCF4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNPU4ATI1M7IT?ASIN=B003GEH3DY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Microphone For PA Use For The Price",
                "reviewText": "This microphone works. It does take 9 volt batteries. I will see how long the 9 volt batteries last. We use our PA system for bingo once sometimes twice a month. After the first use I was convinced it was worth more than what I paid for it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. R. Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOC3DRLKLZ2EEGJ6GQEH4CZYIIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C8ULYVNB3B4F?ASIN=B003GEH3DY",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2015",
                "reviewTitle": "3.0 out of 5 stars Exceeded expectations, base is usable for other podium mics! Unfortunately failed soon after warranty period ended",
                "reviewText": "I too was skeptical about the performance of such a low cost table top mic and pre-amp. However, in use with teleconferences, this combo mic/preamp works great!UPDATE: the mic failed just a bit after the warranty and Pyle didn't respond about replacing or repairing the mic - they responded offering an extended warranty for a review!One downside in some uses is the red LED lighting up near the mic tip. The foam mic cover cannot be pulled down over this LED.Pros: + 9V phantom power works on all podium mics tried + base actually works with other podium mics! + nice positive action on mic pre-amp button + good quality speech audio from pre-amp/mic combinationCons: - red LED just under mic tip can be a distraction in some uses - does not accept phantom power presented to XLR connector - because of above, must constantly check the battery - the base failed very soon after the warranty expired. The mic does function in AT8666 type podium base which is how it is being used now!Product changes required for broader use: * add a way to disable or mask the red LED under the mic tip * allow phantom power from the XLR connector to be passed through to the mic connector * add a low battery indicator",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charles Montemor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFJN4G4EYWAAS2MYSDA5G2B6Z3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27JIF1U780WID?ASIN=B003GEH3DY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Great desk top microfone.",
                "reviewText": "Bought this to use at our church. Works great.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frünke,Stefan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 21, 2019",
                "reviewTitle": "Einfach nur perfekt!",
                "reviewText": "Ich war überrascht über die Qualität zu diesem Preis! Das Mikrofon hat eine exzelente Klangqualität, einen hinreichende Richtcharateristik und ist absolut standsicher. Dass es eine 9V-Batterie benötigt (wird mitgeliefert) ist kein Mangel, sollte aber beachtet werden. Der Tastschalter schaltet das Mikrofon zuverlässig und geräuchlos ein oder aus. Der eingeschaltete Zustand wird mit 2 LEDs angezeigt. Klare Kaufempfehlung!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Ward",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 14, 2021",
                "reviewTitle": "Pro audio",
                "reviewText": "Very very happy perfect",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 8, 2014",
                "reviewTitle": "Best bang for your buck",
                "reviewText": "I have used the Shure equivalent to this (MX412), and the sound quality is almost equal - very clear and noise free. The cable included is unbalanced (XLR to 1/4\"), but I did not get any noise over the 25' lengths. Bought three of them, and they all worked great out of the box (reviews said some of them failed). Using them in a live sound environment in a medium-sized auditorium setting.Other pros: noise free switching, LED at base and on mic to show activity.Only con: not phantom powered, but seems to last quite awhile on the 9V battery",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrejs",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 30, 2013",
                "reviewTitle": "Very dissapointing",
                "reviewText": "Arrived at time, easy to assemble, but awful quality of sound unfortunately - unable to use it at all .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rialyn Narinay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2024",
                "reviewTitle": "Portable mic",
                "reviewText": "Use for meetings and some activities very useful",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}