{
    "remaining_requests": 9324,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/MXL-AC404-USB-Conference-Microphone/dp/B001TGTDFM",
    "body": {
        "name": "MXL AC-404 USB Boundary Condenser Conferencing Microphone - Black",
        "price": "$74.95",
        "originalPrice": "$129.95",
        "rawPrice": 74.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/MXL-AC404-USB-Conference-Microphone/dp/B001TGTDFM",
        "soldBy": {
            "sellerID": "A311BEHFUHRLQM",
            "name": "AVLGEAR",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A311BEHFUHRLQM&asin=B001TGTDFM&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09S4X5B5K"
        ],
        "asinVariationValues": [
            {
                "asin": "B09NQP4JRB",
                "variationName": "Style",
                "variationValue": "AC-404 Bundle",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B001TGTDFM",
                "variationName": "Style",
                "variationValue": "BLACK",
                "price": "$74.95",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "Only 10 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ATIk7gfPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/314Yd-8arNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511NHKqgLLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31VVb5kag-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61ZL8laewML.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/de104a92-12d4-52aa-953e-9e350c70458a/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1OnYD+ONjS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81b7LEDWxCL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the MXL Store",
            "link": "https://www.amazon.com/stores/MXLMicrophones/page/2E01B419-BFB6-4239-B9BF-4C7C9D81D1F8?ref_=ast_bln"
        },
        "brand": "MXLMicrophones",
        "merchantInfo": "AVLGEAR",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 804,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 2 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Outstanding sound quality even in noisy environments",
            "Turn any location into a conference room",
            "Built-in headphone/speaker monitoring jack",
            "Reccomended for Zoom web conferencing software",
            "Durable all metal construction",
            "Delivers outstanding sound quality even in noisy environments",
            "Includes 6 foot USB cable, headphone/speaker jack."
        ],
        "description": "Product Description The AC-404 is designed to capture crystal clear speech intelligibility for Houses of Worship, web conferencing, court reporting, and more with easy plug-and-play USB connectivity. Three microphone capsules in a surface-mount boundary design delivers an amazing 180 degree pickup pattern with a 25' range making it ideal for podiums, conference rooms, courtrooms and connected classrooms. The low profile design is now available in white and black, and is designed to simply rest on any flat surface so it's both discrete and convenient for every day use From the Manufacturer The MXL AC-404 USB web conferencing microphone is an excellent conference room mic for video and web chat. This high quality capsule boundary microphone offers clear voice quality on conference calls, allowing easy, intelligible conversation. The AC-404 captures sound from a 25 ft. radius, making it ideal for conference rooms. It is compatible with all free and paid web conferencing services, like Skype® and ooVoo®. The AC-404 conference mic uses boundary microphone technology, built-in custom circuitry, and automatic gain control to produce smooth, quiet, and professional sounding conferences, no matter where you are. It works well with echo canceling software and offers plug and play compatibility with a PC or Mac® computer.SpecificationsType USB power mic Capsule 3 capsule boundary design with 180-degree coverage Power USB Frequency Response 40Hz - 16kHz Sampling Rate 44.1kHz - 48kHz USB Compatibility USB 1.1 and 2.0 A/D converter 16-bit Delta Sigma with THD+N - 0.01%",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Electronics",
                "link": "https://www.amazon.com/Office-Electronics/b?ie=UTF8&node=172574"
            },
            {
                "name": "Telephones & Accessories",
                "link": "https://www.amazon.com/Telephones-Office-Electronics/b?ie=UTF8&node=172606"
            },
            {
                "name": "Audio Conferencing",
                "link": "https://www.amazon.com/Telephone-Audio-Conferencing-Products/b?ie=UTF8&node=11038701"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4.3 x 2.95 x 2 inches"
            },
            {
                "name": "Item Weight",
                "value": "14.4 ounces"
            },
            {
                "name": "ASIN",
                "value": "B001TGTDFM"
            },
            {
                "name": "Item model number",
                "value": "MXLAC404"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 804 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#54,382 in Office Products (See Top 100 in Office Products) #23 in Telephone Audio Conferencing Products"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "February 18, 2009"
            },
            {
                "name": "Manufacturer",
                "value": "Marshall Electronics"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Video Conference, Singing"
            },
            {
                "name": "Brand",
                "value": "MXL"
            },
            {
                "name": "Model Name",
                "value": "MXL AC-404"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Connector Type",
                "value": "USB"
            },
            {
                "name": "Special Feature",
                "value": "Stand"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer, Headphone, Speaker"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Included Components",
                "value": "MXL"
            },
            {
                "name": "Polar Pattern",
                "value": "Wide Cardioid"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "MXL AC-404 USB Boundary Mic The AC-404 is designed to capture crystal clear speech intelligibility for web conferencing and more with easy plug-and-play USB connectivity. Three microphone capsules in a surface-mount boundary design deliver an amazing 180 degree pickup pattern with a 25′ range making it ideal for conference rooms, podiums, courtrooms, and connected classrooms. The low profile durable design is now available in white and black, and is designed to simply rest on any flat surface so it’s both discrete and convenient for every day use. • Three capsules designed for broad 25′ audio pickup in an 180° arc with high voice intelligibility • Easy plug-and-play connectivity for use with Mac and PC computers • Available in white and black • Professional low profile design with durable all metal construction",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/892c544b-628e-4430-b916-ab6572bd6929.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Specifications Type USB boundary microphone Capsule 3 capsule boundary design with 180-degree coverage Frequency response 40 Hz – 16 kHz Polar pattern Wide cardioid USB compatibility USB 1.1 and 2.0 Size 109mm x 76 x 51mm / 4.3in. x 2.95in. x 2in.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a795fd74-fcaa-4064-a2cd-3d950e4a59fd.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/892c544b-628e-4430-b916-ab6572bd6929.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9587ad31-61c5-40d5-a979-e1105943555a.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. Levine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJW65YYE3EOB3FKB6TF32732ONA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3S0KP61SFRLGB?ASIN=B001TGTDFM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2013",
                "reviewTitle": "5.0 out of 5 stars No echo and crystal clear... works great for dictation too!",
                "reviewText": "Although I order a lot (a lot) from Amazon, I don't write a lot of reviews. However, I felt myself compelled to write one for this microphone because I've searched so long and purchased many other items in the quest for what I was looking for.I own my own consulting business that's run out of my home. Many of my clients are based outside of the US and, as such, I use Skype and GoToMeeting quite a bit. Most, if not all, of everyone I talk to uses a headset, which I hate to use. I don't like feeling of wearing one, plus I can't stand going through the process of switching inputs every time I wanted to use it. I wanted something that could sit on my desk and would be there when I needed it.My first shot was a boom-style microphone (think a fast food restaurant) that had a heavy base and could be turned and bent to get close to my mouth. While my voice was clear, people had a hard time hearing me if it wasn't very close to my mouth. Plus, because it was big and had a long arm, it would get in the way when it wasn't in use.I then starting using my old Plantronics Bluetooth headset which worked ok and was smaller and lighter than a boom-style headset, but didn't solve the issue of switching inputs every time I wanted to use it. Plus, because I have a beard, if it wasn't positioned correctly, people on the other end would sometimes hear a scratching sound.Then I found this mic. I was a little concerned because one of the biggest issues we have during our calls is echoing, especially when people use the built in mic and speakers on their laptops. Having this mic sitting on my desk about 18 inches in front of my computer's speakers I could almost guarantee that it would be a problem. However, I was absolutely shocked when I did my first call and the people on the other end were not only impressed with how clear my voice sounded, but with the fact that there was no echo whatsoever. I've since done dozens of calls with no problems at all.Because my voice was so clear when doing Skype and GoToMeeting calls, I decided to try it out with my Dragon NaturallySpeaking application that I had long since stopped using because I hated wearing a headset and it was a pain in the butt to change the inputs when I wanted to use it. To my disbelief, Dragon now works perfectly and I'm actually using it to write this review! Now this microphone just sits on my desk waiting for me to tell it to wake up and I can just start dictating to my computer any time I want. It's really starting to change the way I work, for the better.If you have a need to do online calls and, like me, don't want to wear a headset, I wholeheartedly recommend this microphone. Even if you don't do online calls, but want to use the dictation feature of your computer or of an application like Dragon, I recommend it very much as well.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bourgeml",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2RQYWG77EDALE3FP442CD7GGPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PUQUM34WBP92?ASIN=B001TGTDFM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2021",
                "reviewTitle": "5.0 out of 5 stars THIS is the microphone I've been looking for",
                "reviewText": "Since the subsiding of the pandemic I've been spending more time in the office - but not that much less time on Zoom. So I moved my full-size Yeti there and have been looking for a less-obtrusive but still very high-quality mic for my home office. After six tries, this is it.I started with the Yeti Nano, naturally enough. It's nice, sounds about as good as its bigger brother, and is much smaller (most mics are! The original Yeti is a beast). But the Nano still an obtrusive upright mic that I had to move into position each time and couldn't not see. It also had design faults that its high price should have avoided. Every time I picked it up, I hit the mode pattern button on the back. And the cable needs to go through a tiny, open channel in the bottom or the mic stand sits on it. Every time you pick it up, you have to arrange the cable just so back into it.So I wanted to try some puck-like boundary mics. There are hundreds of models of these now and at first I avoided the MXL due to a lack of a mute button and the fact that many with a button are far cheaper. Now I know why: sound quality. I find the sound quality of this to be equal to the Yeti Nano. Maybe not as detailed, but better in body and 'weight'. For speech alone, at least to me, I think this is actually superior. (For music, the Yeti is probably better). Plus, the MXL's boundary design avoids echoes off nearby walls that the Nano cannot help but pick up. And, this lies close to the desktop, out of my sightline, and doesn't block my view of the screen. It's very well-made and heavy - entirely metal. And I think it looks pretty cool - though don't underestimate the size. It's almost as big as my MX mouse.I tried two other cheap Chinese brand conference mics and almost gave up on the format before trying this. They worked fine, don't get me wrong. Much better than the Logitech webcam's built-in mic. But the drop in sound quality (detail, tone, atmosphere) from the Yeti was substantial. (Of the two, I actually preferred the cheaper Ele-Giant to the nicer-looking Tonor).Anyway, like the title says, THIS is what I was looking for all along. My thanks to Amazon for their liberal return policy on the rest!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Chan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 13, 2023",
                "reviewTitle": "Does what you want it to do.",
                "reviewText": "Solid conference microphone.Used it for my discussion book club's in-person meetup where everyone except 1 person was there in my living room. Said person was participating online, hence the reason for this purchase.Worked like a charm. The online participant could hear everyone's discussion clearly in a 180 degree cone. Good sound quality. All went very smooth.Recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hajee A P Bava & Company Constructions Private Ltd",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 2, 2023",
                "reviewTitle": "Overall Good",
                "reviewText": "Overall Good....",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danieln",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 9, 2021",
                "reviewTitle": "funciona muy bien",
                "reviewText": "lo utilizamos en una sala de unos 7m por 6m para un grupo de 12 personas en video conferencia y funciona muy bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Moritz Mentzel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 13, 2017",
                "reviewTitle": "Konferenzraum Mikrofon in guter Qualität",
                "reviewText": "Wir haben lange ein Konferenzraum Mikrofon für unsere Firma gesucht und sind hier fündig geworden.Alternativen von Logitech etc sind hiermit nicht vergleichbar, dies ist ein professionells Mikro, dass alle Anforderungen erfüllt.Unser Raum fasst etwa 20 Mitarbeiter.Plug and play USB, skype meeting, windows, im raum frei bewegen und in normaler Lautstärke sprechen, alles wunderbar.Nach 4 Jahren und diversen Malen vom Tisch Runtergefallen ist das Schutzgitter nun abgegangen, aber das Mikro geht immer noch.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike N.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 30, 2020",
                "reviewTitle": "Great product. The item I received from Amazon does not appear brand new as advertised!",
                "reviewText": "The microphone works as advertised.The item I received from Amazon though, have some cosmetic scratches on the side and bottom. I feel I paid for a brand new item but received a second hand one.,",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$73.69",
                "sellerName": "QuickShippedGoods",
                "sellerRating": "5"
            },
            {
                "price": "$74.95",
                "sellerName": "The Wozy Group",
                "sellerRating": "5"
            },
            {
                "price": "$74.95",
                "sellerName": "Marshall Electronics",
                "sellerRating": "5"
            }
        ]
    }
}