{
    "remaining_requests": 9256,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rode-VideoMic-Camera-Shotgun-Microphone/dp/B081S9BCHF",
    "body": {
        "name": "Rode VideoMic NTG Camera-mount Shotgun Microphone,Black",
        "price": "$249.00",
        "originalPrice": "",
        "rawPrice": 249.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rode-VideoMic-Camera-Shotgun-Microphone/dp/B081S9BCHF",
        "soldBy": {
            "sellerID": "A3LGJL7ZJFVWSN",
            "name": "Slam-Dunk",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3LGJL7ZJFVWSN&asin=B081S9BCHF&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTCDZG5G"
        ],
        "asinVariationValues": [
            {
                "asin": "B081S9BCHF",
                "variationName": "Style",
                "variationValue": "Microphone",
                "price": "$249.00",
                "variationImageURL": ""
            },
            {
                "asin": "B0CT2K1FBC",
                "variationName": "Style",
                "variationValue": "Microphone+ Pop Filter/Wind Shield",
                "price": "$260.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41eaBcphAvL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21 rkdpQb-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21GFmWWJQsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51u77uupM L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yifXFQ3HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cO652VSGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/617qFWnkheL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/badaba69-971f-42cb-8adc-2336ad13bfb1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4a0267b-276d-48d6-9fcd-664542c93d14/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/93bfa2f1-881a-4055-9261-49d4805ebbeb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b6d54e92-466a-46c5-926c-436a00bf1d30/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8df6e4ed-965d-4990-a7d8-507d07d3f843/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97b3d0b8-f103-43d0-a2ac-02aaefbdfef8/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Rode Store",
            "link": "https://www.amazon.com/stores/R%C3%98DE/page/379CD3E5-D741-4B02-ADE5-F31CB32980CD?ref_=ast_bln"
        },
        "brand": "RØDE",
        "merchantInfo": "Sold by Hot Audio and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1147,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Sunday, February 18. Order within 16 hrs 53 mins",
            "FREE delivery Thursday, February 22",
            "Or fastest delivery Sunday, February 18. Order within 7 hrs 23 mins",
            "FREE pickup Wednesday, February 21",
            "Or fastest pickup Sunday, February 18. Order within 16 hrs 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Features the same revolutionary acoustic design as our NTG5 broadcast shotgun microphone, which delivers unmatched transparency and a natural, uncoloured sound",
            "Designed for an incredibly flat frequency response, highly directional supercardioid polar pattern, and very low self-noise",
            "Digital switching provides a high-pass filter, -20dB pad, high frequency boost, and safety channel, and a unique infinitely variable gain control precisely tailors the output needed",
            "The auto-sensing 3. 5mm output detects what device you are connected to (camera or mobile) and switches to accommodate",
            "Also a fully-featured USB microphone that can be plugged into a computer, tablet, or smartphone"
        ],
        "description": "The VideoMic NTG is a broadcast-grade, feature-packed shotgun microphone optimised for on-camera use. It features the same revolutionary acoustic design as the NTG5 broadcast shotgun microphone, which delivers unmatched transparency and a natural, uncoloured sound. Add to this an incredibly flat frequency response, highly directional supercardioid polar pattern, and very low self-noise, and what you have is a compact on-camera microphone that contends with the world’s best shotgun mics. As well as sounding outstanding, the VideoMic NTG is extremely flexible, with an array of tools and features to help you take on any recording situation. Digital switching gives you access to a high-pass filter, -20dB pad, high frequency boost, and safety channel, plus there is a unique infinitely variable gain control that allows you to precisely tailor the output as you need. Its auto-sensing 3. 5mm output detects what device you are connected to (camera or mobile) and switches to accommodate – no more messing around with adaptor cables! There is also a handy new dB peak warning light, so you can always ensure your audio isn’t clipping. The VideoMic NTG is so much more than just an on-camera mic. As well as pairing perfectly with DSLRs, compact cameras, and smartphones – either on-camera, as a boom mic, or on a pistol grip – it is also a fully-featured USB microphone that can be plugged into a computer, tablet, or smartphone. On top of this, the 3. 5mm jack doubles as a headphone output for seamless monitoring of audio while using the USB output.",
        "breadCrumbs": [
            {
                "name": "Musical Instruments",
                "link": "https://www.amazon.com/musical-instruments-accessories-sound-recording/b/ref=dp_bc_aui_C_1?ie=UTF8&node=11091801"
            },
            {
                "name": "Microphones & Accessories",
                "link": "https://www.amazon.com/Recording-Microphones-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11974521"
            },
            {
                "name": "Microphones",
                "link": "https://www.amazon.com/Recording-Stage-Microphones/b/ref=dp_bc_aui_C_3?ie=UTF8&node=8882489011"
            },
            {
                "name": "Condenser Microphones",
                "link": "https://www.amazon.com/Condenser-Microphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11974631"
            },
            {
                "name": "Multipurpose",
                "link": "https://www.amazon.com/Multipurpose-Condenser-Microphones/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11974651"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "10 x 4 x 3 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.32 ounces"
            },
            {
                "name": "ASIN",
                "value": "B081S9BCHF"
            },
            {
                "name": "Item model number",
                "value": "VideoMic NTG"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,147 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,926 in Musical Instruments (See Top 100 in Musical Instruments) #64 in Multipurpose Condenser Microphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "November 20, 2019"
            },
            {
                "name": "Manufacturer",
                "value": "RØDE Microphones"
            },
            {
                "name": "Country of Origin",
                "value": "Australia"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Singing"
            },
            {
                "name": "Brand",
                "value": "Rode"
            },
            {
                "name": "Connectivity Technology",
                "value": "3.5mm auto-sensing USB-C"
            },
            {
                "name": "Connector Type",
                "value": "3.5 mm Jack"
            },
            {
                "name": "Special Feature",
                "value": "Stand"
            },
            {
                "name": "Compatible Devices",
                "value": "SC19 Lightning Accessory Cable SC15 Lightning Accessory Cable SC16 USB-C to USB-C Cable VXLR Pro Transformer-balanced 3.5mm TRS to XLR adaptor SC11 TRS Splitter Cable SC10 3.5mm TRRS to TRRS patch cable WS11 Deluxe Windshield Boompole Professional Boompole - 3.3m Tripod Mini Tripod Stand VC1 Minijack/3.5mm Stereo Extension Cable (3m/10') DS1 Desktop Microphone Stand See more"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Included Components",
                "value": "Microphone"
            },
            {
                "name": "Polar Pattern",
                "value": "Super Cardioid"
            },
            {
                "name": "Audio Sensitivity",
                "value": "120 dB"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Rode VideoMic NTG On-Camera Shotgun Microphone The VideoMic NTG is a broadcast-grade, feature-packed shotgun microphone optimised for on-camera use. It features the same revolutionary acoustic design as the NTG5, which delivers unmatched transparency and a natural, uncoloured sound. Add to this an incredibly flat frequency response, highly directional supercardioid polar pattern, and very low self-noise, and what you have is a compact on-camera microphone that contends with the world’s best shotgun mics. The VideoMic NTG is extremely flexible, with an array of tools and features to help you take on any recording situation. Digital switching gives you access to a high-pass filter, -20dB pad, high frequency boost, and safety channel, plus there is a unique infinitely variable gain control to precisely tailor the output as you need. Its auto-sensing 3.5mm output detects what device you are connected to and switches to accommodate. There is also a handy new dB peak warning light, so you can always ensure your audio isn’t clipping. The VideoMic NTG is so much more than just an on-camera mic. As well as pairing perfectly with DSLRs, compact cameras, and smartphones – either on-camera, as a boom mic, or on a pistol grip – it is also a fully-featured USB microphone that can be plugged into a computer, tablet, or smartphone. The 3.5mm jack doubles as a headphone output for seamless monitoring of audio while using the USB output. Specifications Acoustic Principle: Pressure gradient electret condenser Polar Pattern: Supercardioid Frequency Range: 20Hz – 20kHz Battery Life: 30+ hours Output Connection: 3.5mm auto-sensing USB-C Bit Depth: 24-bit Sample Rates: 48kHz OS Requirements: Mac OS 10.12/Windows 10",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/942d7c82-11ac-4e07-b40e-2b5cc94f03bd.__CR0,0,850,850_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "About Rode Microphones RØDE Microphones are a uniquely Australian owned and operated audio company. Our home is in beautiful Sydney, just 20km west of Sydney's downtown area and right near the home of the Sydney 2000 Olympics. Comprising three warehouses with a total footprint of over 110,000 square feet, the RØDE state-of-the-art plant has over 60 million dollars in precision machinery and an international team of more than 250 people across highly skilled disciplines: electronics engineering, industrial design, technical engineering, robotics, audio and acoustics engineering, metal production, toolmaking, injection-mould technology, logistics, assembly, quality control, finance, marketing and sales. As well as our main campus in Sydney, we have offices in Los Angeles, New York, London, Hong Kong, Shenzhen and Seoul. Our extensive distributor and 6000-strong storefront network ensures RØDE Microphones are sold in 117 countries – and growing – making RØDE a truly global company.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cd507283-9850-4118-8f2e-faad78789bc4.__CR0,0,600,600_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d4a7ab18-d843-4e2c-afb5-5d3dd80d8f40.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/942d7c82-11ac-4e07-b40e-2b5cc94f03bd.__CR0,0,850,850_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cd507283-9850-4118-8f2e-faad78789bc4.__CR0,0,600,600_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4e39be11-cf32-4748-8216-1548b69861b7.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Steve_y78",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2ZLKH7MOTNCGZ5G2VVHYDSGWNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M10KL2W16CGU?ASIN=B081S9BCHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Rode VideoMic NTG: A Five-Star Marvel of Versatility and Quality",
                "reviewText": "I can confidently say that the Rode VideoMic NTG is an exceptional microphone that ticks all the right boxes for versatility, quality, and convenience.First and foremost, this microphone excels in its versatility. Whether you need it for your desktop setup, camera recording, or even mobile shooting, it effortlessly adapts to each scenario. Its ability to serve multiple functions effectively is a game-changer, eliminating the need for multiple microphones and simplifying your audio setup.In terms of audio quality, the Rode VideoMic NTG consistently delivers outstanding results. It can handle a wide range of environments, capturing clear and balanced sound even in challenging conditions. From indoors to outdoors, it performs admirably, ensuring your recordings are crisp and professional.The microphone's build quality is impressive, combining durability with a compact and user-friendly design. It's clear that Rode has paid attention to detail, creating a microphone that feels solid and reliable in your hands.Additionally, the thoughtful inclusion of features like automatic power management enhances the overall experience. This ensures that you're ready to record when you need it, without the worry of running out of battery.While the Rode VideoMic NTG may come at a slightly higher price point, its exceptional performance, versatility, and build quality make it a worthwhile investment for anyone serious about audio recording. It has even replaced other microphones in my setup due to its superior functionality.In summary, Rode has truly hit the mark with the VideoMic NTG. It's a five-star microphone that offers incredible value for its price. Whether you're a content creator, podcaster, videographer, or anyone in need of high-quality audio, the Rode VideoMic NTG is a must-have addition to your toolkit.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gregory A. Corson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOZEOK57HUA7TQAK5HGS4WQNQTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BSIXDJOXVN8?ASIN=B081S9BCHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2021",
                "reviewTitle": "5.0 out of 5 stars This is super-versatile and has worked great with everything",
                "reviewText": "I love this mic! Sounds good, low noise, very directional. Ever since getting it I've used it for all my videoconferences. I have it on a mic boom just above my head about 12-18 inches away and it sounds very nice and clean. Allowed me to stop needing to wear headphones during conferences, I could just have the audio coming out of speakers.Aside from this, you can use the mic as a USB device with a PC or you can plug in an analog TRS or TRRS cable, it will automatically detect the configuration of the jack so you can use it with almost any device.I use it as a USB mic with my PC, in analog mode with a Sony A7R4 and have also used it as a USB-C mic with an iPad Pro and with an iIphone through Apples analog adapter. All worked and had great sound.The directionality of the mic will let you put it just below or just above you out-of-shot and still get good sound. It's not magic though, for best quality the rule with mics is \"closer is better\" You will probably get best results 1-2 feet away. Try to get closer if the person is a quiet talker.There are a few minor flaws with the USB mode. One is that the gain control knob has no effect in USB mode, you have to adjust volume levels with PC software which is not as convenient. Also the \"safety channel\" feature doesn't work in USB mode (this is where it records normal audio on one channel and the other channel 20db quieter, so you can recover audio in post production if it suddenly gets too loud and clips). Not sure why these don't work but it would be great if Rode could do a firmware update to fix it.Also the mic is supposed to work with an iPhone through a USB-C to lightning cable. I tried this with a high quality cable I have and it didn't work. Rode support says you have to use their UCB-C to lightning cable. Not sure why this is, maybe they have some active electronics in their cable. I just know I tried several good quality USB-C->lightning cables I had and they did not work.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tonia_&_Scott Wardan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBWT6GILA4H2XTROYRUZFZ3C2LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S361I3YIZ04W?ASIN=B081S9BCHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 22, 2020",
                "reviewTitle": "5.0 out of 5 stars Video or Podcasting - This is the One Mic To Rule Them All! (+ how to connect via XLR)",
                "reviewText": "I debated over this mic for quite a while. I liked the idea of being able to use it analog, connected directly to my field recorder, camera or phone - plus the ability to connect it directly to my computer digitally via USB. However, my primary use is connected to my field recorder, and I would have much preferred an XLR connector vs the 3.5 mm trs/trrs jack. I just so happened to own a Rode VXLR+, which adapts XLR to 3.5mm, and converts phantom power to 'plug-in power', so I figured I would give the mic a try.At first it did not work, and I almost returned the mic. The mic is intelligent and can switch between trs (camera) and trrs (phone - combo headphone/microphone jack) connectivity, using the provided trrs/trrs cable. The VXLR+ on the other hand... not so intelligent. It is designed for trs connectivity, not trrs. Connecting it via trrs did not work. But, before I boxed the mic up and sent it back, I figured I would try a trs/trs cable... and Voila!The mic sounds incredible! Really good gain, really low noise. While it definitely has a proximity effect, it maintains warmth/depth when booming at around 18\". I made some quick test recordings this way, then A/B tested the unprocessed audio against some of the more professional sounding YouTube channels out there. I honestly think mine sounded better! ;) Using it in a podcast/voice-over fashion, 3\"-6\" away, plugged directly in to my computer, sounded equally amazing. My phone even recognizes the mic via USB! As an \"on-camera\" mic... meh. But the traditional NTG mics, or even the almighty MKH-416 would sound \"meh\" used as an on camera mic. It is just not what you do, if you want good quality audio! IMHO.Buy it!",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bibliophile",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIIZRL6XJAADW74XBVY7BUCJEDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP2JREPZWCUQQ?ASIN=B081S9BCHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2022",
                "reviewTitle": "5.0 out of 5 stars Great value and quality",
                "reviewText": "I love this microphone. Works great with my Nikon Z5 and it does exactly what I need it to do. I love the ability to record two channels (one at a lower dB). I also really like that it turns on/off automatically. I have not had an issue with this. Great for my needs which is shooting family videos.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jadon PlettJadon Plett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 29, 2023",
                "reviewTitle": "Does Everything I Need",
                "reviewText": "You can't really go wrong with Rode. I swapped out my VideoMic Pro+ for this NTG option, and I've enjoyed the upgrade in audio! I do a lot of run-and-gun documentary work, so having an on-camera mic that can capture usable audio is crucial! I'd suggest bringing down the gain on your camera and upping the gain on the mic for the best results (in my experience). The shock mount seems to do a pretty good job of avoiding the noise of the mic moving around, so that's a plus. I just wish that the shock mount was black, not red.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WbR2zt9kL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "José",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 16, 2021",
                "reviewTitle": "Excelente",
                "reviewText": "El audio es muy complejo, el mejor micrófono no grabará adecuadamente en condiciones no favorables. ¿Tu fuente está pegada a paredes? Muchas reflexiones. ¿Estás en la calle? Mucho bleed o contaminación. Entendiendo eso puedo decir que el micrófono mejora mucho los sonidos de mis filmaciones que antes hacía con celular. Acostumbrado a grabar en estudio con otros micrófonos puedo decir que es muy competitivo; además, como tipo escopeta, es más recomendable al aire libre. Para microfoneo cercano es perfecto cuidando ciertos detalles, muy buena calidad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pragathi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 6, 2023",
                "reviewTitle": "Waste of cost",
                "reviewText": "Many times audio not captured and fault in battery within week service not available 26000 waste",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on November 13, 2022",
                "reviewTitle": "完美",
                "reviewText": "包裝良好，商品良好，實用性高，優質優良",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Theodore",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 23, 2021",
                "reviewTitle": "Fantastic",
                "reviewText": "Great mic, used for event videography this mic is fantastic with heaps of features.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$249.00",
                "sellerName": "Slam-Dunk",
                "sellerRating": "5"
            },
            {
                "price": "$249.00",
                "sellerName": "American Musical Supply",
                "sellerRating": "4.5"
            },
            {
                "price": "$249.00",
                "sellerName": "8th Street Music",
                "sellerRating": "4.5"
            }
        ]
    }
}