{
    "remaining_requests": 9278,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LEVN-Bluetooth-Microphone-Cancelling-Multipoint/dp/B0CGZSML8W",
    "body": {
        "name": "LEVN Bluetooth Headset with Microphone, Wireless Headset with Mic & Mute Button, 60 Hrs Working Time Noise Cancelling Bluetooth Headset 5.3 Multipoint Connect to Cell Phone/Mobile/Laptop/Tablet/PC",
        "price": "$39.99",
        "originalPrice": "$59.99",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LEVN-Bluetooth-Microphone-Cancelling-Multipoint/dp/B0CGZSML8W",
        "soldBy": {
            "sellerID": "A27IZ55F1MT6TQ",
            "name": "Vanred Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A27IZ55F1MT6TQ&asin=B0CGZSML8W&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31lF7Vk1i5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51aBLBc8ERL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vRs1ahhAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aE60RHNhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F1V3PhRnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51USAVZVPHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511h0KOpBUL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the LEVN Store",
            "link": "https://www.amazon.com/stores/LEVN/page/BA15A8A6-4510-4BDF-AB17-D568A50CFC3A?ref_=ast_bln"
        },
        "brand": "LEVN",
        "merchantInfo": "Vanred Direct",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 436,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tomorrow, February 17. Order within 2 hrs 41 mins",
            "FREE pickup Wednesday, February 21",
            "Or fastest pickup Tomorrow, February 17. Order within 13 hrs 56 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Advanced AI Noise Cancelling Microphone: Our bluetooth headset with microphone for PC incorporates a distinctive AI environment Noise Cancellation technology. Effectively suppresses up to 99% of distracting background noise, such as children playing, crying, screaming, music, keyboard tapping, or colleagues chatting. It ensures that participants can communicate clearly without distractions. It is perfect for remote work, conferences, call centers, online classes, homes, active offices, etc.",
            "Dual Connection & Bluetooth 5.3: Our Bluetooth headset with microphone adapts to the latest Bluetooth 5.3 technology, enabling faster pairing speed, more secure and stable connection, lower latency, better audio quality, and longer battery life. It also enables us to connect to two devices simultaneously for calls and music. Never worry about missing a call, freely switch work mode and personal mode. This wireless headset is widely compatible with most laptops, tablets, smartphones, and so on.",
            "60 Hours Working Time & HiFi Stereo Sound: Say goodbye to frequent charging. This Bluetooth headset provides an impressive working time of up to 60 hours on a full charge(2 hours). It can provide you with 8 hours of talking time every day for an entire week. You no longer have to worry about running out of battery during long journeys or business use. This wireless headset with microphone delivers crystal stereo sound quality, you can enjoy music at the highest wireless bluetooth audio quality.",
            "MFB & Mute Functions: Feel the practicality of our Wireless Headset, which comes equipped with MFB and mute functions. With the MFB button, you can effortlessly answer/hang up calls(Only for Mobile Phones). It is also used to power on/off and enter pairing mode. Our Bluetooth headset for work also comes with a mic mute button, you just need to double-touch the mute button to mute or unmute the microphone (during a call or meeting). Protecting your privacy and avoiding unnecessary embarrassment.",
            "Comfortable Wearing: This Bluetooth headset with microphone features a lightweight design with cushioned ear pads, and adjustable handband for your utmost comfort. Both sides can be adjusted manually, you can comfortably wear our Bluetooth headset for hours or an end without feeling the slightest discomfort. Plus, the flexible 270° rotatable microphone can be bent in any direction to fully adjust to the position that works best for you, and you can use the mic on either your right or left side."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "On-Ear Headphones",
                "link": "https://www.amazon.com/On-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097480011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7.09 x 5.91 x 3.15 inches"
            },
            {
                "name": "Item Weight",
                "value": "8.4 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CGZSML8W"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 436 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#795 in Electronics (See Top 100 in Electronics) #23 in On-Ear Headphones"
            },
            {
                "name": "Date First Available",
                "value": "October 16, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "LEVN"
            },
            {
                "name": "Charging Time",
                "value": "2 Hours"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "LEVN"
            },
            {
                "name": "Model Name",
                "value": "CT003"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "On Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "LEVN Bluetooth 5.3 Headset AI Noise Cancelling, Clearer Hands-free Calling",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0c07ea5d-64b3-48f9-acab-d2512cc08fd0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page Environmental Noise Cancellation No matter where you are, our Bluetooth headsets ensure clear voice quality. Privacy Protection You can double-touch the mute button to turn on/off the microphone to protect your privacy Dual Device Seamless Switching Connect 2 devices at the same time, quickly switch to calling device via MFB, and never miss a call. Compatible with Most Platforms Works online conferencing software like Zoom, Teams, Google Meeting, WebEx, YouTube, Skype and so on Next page 1 AI Noise Cancelling 2 Mute Button 3 Connect 2 Devices 4 Widely Compatibility",
                "media_link": []
            },
            {
                "media_text": "HiFi Stereo Music High-fidelity audio delivers accurate reproduction of every detail in both music and movies.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03eb9592-d3f7-4a52-b0da-f3c12a5f65ae.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "How to pair LEVN CT003 with 2 devices simultaneously via Bluetooth? 1. Press and hold MFB button for 3-5s to enter pairing mode, the LED indicator light will flash blue and red alternately, and you could hear \"Pairing\". 2. Turn on the Bluetooth function of device A, search and connect [CT003] in the Bluetooth device list. When you hear \"connected\" and the LED indicator turns blue and flashes slowly every 5s, it means the headset is connected to device A. 3. Turn off the Bluetooth function of device A, when you hear \"Disconnected\", the LED indicator light will flash blue and red alternately, [CT003 ] will re-enter the pairing mode. 4. Turn on the Bluetooth function of device B, search and connect [CT003] in the Bluetooth device list, when you hear \"connected\" and the LED indicator turns blue and flashes slowly every 5s, it means the headset B-device connected to device B. 5. Turn on the Bluetooth function of device A, and click \"Connect\" [CT003] in the Bluetooth device list. When you hear \"connected\" again, it means that the headset has been successfully connected to device A and device B at the same time. Note: When you listen to music on device A, and device B has an incoming call, just click the MFB button to answer the call (please check the manual for more details).",
                "media_link": []
            },
            {
                "media_text": "LEVN HEADSET COLLECTION CT003 Add to Cart LE-HS017 Add to Cart LEVN LE-HS013 Superior Add to Cart UH002 Add to Cart UH001 Add to Cart Customer Reviews 4.3 out of 5 stars 436 4.9 out of 5 stars 114 4.1 out of 5 stars 1,553 4.4 out of 5 stars 370 4.2 out of 5 stars 355 Price $39.99$39.99 $89.99$89.99 $71.99$71.99 $25.99$25.99 $29.99$29.99 Earcup Binaural Binaural Binaural Binaural Binaural Bluetooth Multipoint 2 Devices Simultaneously 2 Devices Simultaneously 1 Device 1 Device 1 Device Battery Life Up to 60 hours Up to 14 hours Up to 65 hours No Battery Anxiety No Battery Anxiety Charging Method USB C Cable USB C Cable Charging Base or USB C Cable No Charging Required No Charging Required Connectivity Bluetooth Bluetooth Bluetooth & USB Dongle USB Connection USB Connection",
                "media_link": []
            },
            {
                "media_text": "My Bluetooth headset is connected to my cell phone and table at the same time, how do I switch devices? When your Bluetooth headset is successfully connected to your cellphone and tablet via Bluetooth, please click the MFB button to switch to your calling device or music device. It's always noisy when I work from home. Can others still hear the sounds around me using this Bluetooth headset? Please don't worry, this bluetooth headset with noise canceling microphone can accurately filter your background noise, so callers can only hear your clear voice. Bring you a better call experience. Can I use the headset to answer or hang up calls? If the headset is connected to a mobile phone, you can click the MFB to answer/end calls on the headset; If the headset is connected to a computer, you need to answer calls on the computer. Reminder: MFB does not work with desk phones and landlines How do I use the headset's mute function during a call or online meeting? You only need to double touch it to quickly mute the microphone, avoiding disturbance or revealing privacy during calls or meetings. How to clear the pairing records? Press and hold the MFB power button and Volume\"-\" button at the same time for 5-7 seconds. Seeing that the LED indicator light is purple, the headset has cleared the pairing record and restored the factory settings.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0c07ea5d-64b3-48f9-acab-d2512cc08fd0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6d6f85eb-dd1f-4955-bbfd-eb858cc78193.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b771b1f0-e324-405e-b159-324b3dd02ae2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b1be489-a086-49f4-819a-e8ced3960cb8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2859edd0-26c6-4f00-aca4-a84ec2ba486e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03eb9592-d3f7-4a52-b0da-f3c12a5f65ae.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7eb5d9e-723f-47f7-8de1-c766d47285a3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f091c4bd-a71f-47d6-845a-febbdcc4147e.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/93ffa9e5-8f55-4b33-be18-7be840fe1714.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a815d46a-6839-44c6-aecf-3ea6a729841a.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/152847b2-e7d1-43f2-8339-596131e40ed7.__CR13,0,200,225_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/77ed17db-b67c-41d9-b6ff-eed49763affc.__CR0,0,200,225_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jlyne (Jay-Leen) HanbackJlyne (Jay-Leen) Hanback",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDWKO2YWMJHEMG6JFCR3WAAOMZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XWZPD8G04AC1?ASIN=B0CGZSML8W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Bluetooth headset has great sound",
                "reviewText": "I recently bought this Bluetooth headset and am very impressed. The sound quality is excellent, providing clear and crisp audio whether I'm listening to music or taking calls. The battery life is also impressive, lasting for hours on a single charge.One of the standout features of this headset is its comfortable fit. The ear cushions are soft and provide a secure fit, making it easy to wear for extended periods without discomfort. The controls are intuitive, allowing me to adjust the volume, skip tracks, and answer calls with ease.The Bluetooth connectivity is reliable, with a strong and stable connection to my devices. I appreciate the range it offers, allowing me to move around freely without losing connection quality. Additionally, the noise-cancellation feature effectively blocks out background noise, enhancing my listening and call experience.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71YxNvKW-fL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rochelle ColeRochelle Cole",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGP5DEKGG5PILDTYXDOISPUUWJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BLXUMAF3UFLI?ASIN=B0CGZSML8W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars GREAT HEADSET!",
                "reviewText": "I love this headset!! It’s extremely comfortable. I wear it a minimum of 12 hours a day. And it never hurt my ears or my head. You can see in my photos that the cushion for the ear is open a bit so your ear fits so nice and snug in that bed and the surrounding padding is so soft. Accross the headband is also cushioned. The microphone flips to either side. So you can have it on your left or right side. The arm of the microphone is bendable as well so you can easily adjust to the perfect distance from your mouth. The sound quality is exceptional!! Background noise is blocked very well. The range is long. I was able to leave my computer go outside and walk my dog and still be connected! I did have to purchase a usb Bluetooth dongle as my computer did not have Bluetooth capabilities which was inexpensive, just check your system ahead of time so you know if you will need one as well. I know it holds a charge a minimum of 12 hours I don’t know past that as I charged it nightly, as to not risk it dying in the middle of my workday. Set up/pairing was very simple, it does take a little bit of time though, so don’t wait until the last minute to pair it or panic, however, you only have to do it once per device . Yes, they can pair with more than one device at a time; which is nice to go between my desktop and my laptop. The power and volume buttons are easily accessible. The mute isn’t a button you just tap the little circle. The only thing I had an issue with was muting, I work from a remote call center if I had it muted when a call came in I could not unmute it and I could not mute it in the middle of a call. Once the call is connected the mute option did not work for me. Other than that these are perfect I would most definitely buy them again. Great Purchace!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61J+uyUzYKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Pr-suEnSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61RfVZx1TLL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717rU+VsadL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristopher G. WatsonKristopher G. Watson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNZF2ZJCDWN34QJWV4STEBSDPFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3262MPDNLG2JO?ASIN=B0CGZSML8W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Your Essential Companion for Hands-Free Freedom!",
                "reviewText": "The Levn Bluetooth Headset CT003 has truly transformed the way I manage my day-to-day activities. If you’re in the market for a reliable and high-quality Bluetooth headset, this is the one you’ve been waiting for.Let’s start with the sound quality. The CT003 delivers crystal clear audio, ensuring that every call, podcast, or music track is a joy to experience. No more struggling to hear the person on the other end, even in noisy environments. The noise-canceling technology is remarkable, providing an immersive and distraction-free listening experience.Comfort is key, and this headset excels in that department. The ergonomic design fits snugly in your ear and is so lightweight that you’ll forget you’re wearing it. I can wear it all day without any discomfort – perfect for those long work calls or multi-hour road trips.One of my favorite features is the incredible battery life. I can go days without needing to recharge, even with heavy use. It’s a lifesaver, especially when you’re on the go and can’t afford to be tethered to a charging cable.Pairing the CT003 with my devices is a breeze, and the Bluetooth connectivity is strong and reliable. The built-in microphone is of exceptional quality, ensuring that my voice comes through loud and clear during calls. Plus, the multi-point connectivity feature allows me to seamlessly switch between my phone and tablet, making multitasking a breeze.What sets this Bluetooth headset apart is its versatility. It’s not just for phone calls – I use it to listen to audiobooks, make voice commands, and even participate in virtual meetings. The CT003 is a true all-in-one solution.In summary, the Levn Bluetooth Headset CT003 is a must-have for anyone seeking hands-free freedom and audio excellence. Its sound quality, comfort, battery life, and compatibility make it a standout choice for busy professionals, multitaskers, and tech enthusiasts. Say goodbye to tangled wires and hello to a new level of convenience and clarity. I wholeheartedly recommend the Levn CT003 – it’s your essential companion for a wireless world!",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71BzlUZ88UL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Majorfrank10",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJ6OSIO5UJJYOHNJU4T7MCBNCLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OBTV81O379Q7?ASIN=B0CGZSML8W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "5.0 out of 5 stars It’s truly a game-changer!",
                "reviewText": "I couldn’t be more impressed with the LEVN Bluetooth Headset! This headset truly exceeded my expectations in every aspect.Firstly, the battery life is astounding! With 60 hours of working time, I barely need to worry about recharging it frequently, making it incredibly reliable for long workdays or travel.The noise-canceling feature is a game-changer! It completely blocks out background noise, ensuring crystal-clear calls every time. The mic and mute button are conveniently placed, adding ease to my communication, especially during online meetings or calls.The multipoint connectivity is a lifesaver – seamlessly connecting to my cell phone, laptop, tablet, and PC simultaneously. It’s versatile and adaptable to my various devices, allowing me to switch effortlessly between them without any hassle.The wireless design is so comfortable, and the quality of sound is fantastic! Whether I’m on a call or enjoying music, the clarity and comfort are top-notch.Overall, this LEVN Bluetooth Headset has significantly enhanced my communication experience. I highly recommend it to anyone seeking a reliable, long-lasting, and high-quality headset. It’s truly a game-changer!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$59.99",
                "sellerName": "XINGCHEN LIMITED",
                "sellerRating": "5"
            }
        ]
    }
}