{
    "remaining_requests": 9495,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/USB-Microphone-Condenser-Headphone-Streaming/dp/B09F3KNCSY",
    "body": {
        "name": "USB Microphone, Cardioid Condenser Gaming Mic for PC/Laptop/Phone/PS4/5, Headphone Output, Volume Control, USB Type-C Plug and Play, LED Mute Button, for Streaming, Podcast, Studio",
        "price": "$39.97",
        "originalPrice": "$49.99",
        "rawPrice": 39.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/USB-Microphone-Condenser-Headphone-Streaming/dp/B09F3KNCSY",
        "soldBy": {
            "sellerID": "A165EYZ4WUB9PV",
            "name": "AUDIOPRO Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A165EYZ4WUB9PV&asin=B09F3KNCSY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51bAMb31knL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ThODKiLtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ONw6aJCLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4130IQT8BcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41w58v8AUcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/313Vtd4m1LL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61vriCgKiYL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/881864d5-3455-4b7f-938c-f2bf14186a42/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe0d477b-cc25-4db2-a2e1-254dddaa730e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6616574f-53a0-4343-86ae-df2ab0263b03/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55fe31a5-98a7-4722-a799-dc95e2040d4f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00cac9ff-5f91-48f3-8fc8-d21395257bd3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e04f9265-ca1a-4d73-9797-3d8c0f7965a0/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: AUDIOPRO",
            "link": "https://www.amazon.com/AUDIOPRO/b/ref=bl_dp_s_web_120209894011?ie=UTF8&node=120209894011&field-lbr_brands_browse-bin=AUDIOPRO"
        },
        "brand": "AUDIOPRO",
        "merchantInfo": "AUDIOPRO Direct",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3035,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Sunday, February 18. Order within 14 hrs 22 mins",
            "FREE pickup Wednesday, February 21",
            "Or fastest pickup Tomorrow, February 17. Order within 12 hrs 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "PLUG AND PLAY: Compatible with Mac, PS4/5 and Windows PC computer laptop that has USB-A or USB-C port. No extra driver is required, it also compatible with Android Phone (Type-C Port).",
            "ONBOARD AUDIO CONTROLS: Sensitive mic gain and volume knobs allow you to adjust the appropriate volume at will to record sound more comfortably. This gaming microphone's 3.5mm headphone output provides direct, latency-free monitoring. The quick mute functionality is very handy for users, with built-in LED light to indicate the working status.",
            "EXCELLENT SOUND QUALITY: This podcast microphone has a cardioid pickup pattern, allowing it to capture the clear, smooth, crisp sound and suppress unwanted background noise. Supports sample rates up to 192kHz/24bit, Great for presentations, podcasts, Zoom, Skype, Recordings,YouTube, instant messaging, gaming, and streaming on Twitch.",
            "EASY INSTALLATION & VERSATILITY: Without any assembly, you can use this microphone by simply plugging in a USB cable. You can use the included 5/8\" male to 3/8\" female adapter to install the mic on a standard boom arm. It also comes with a well-fitted pop filter , for no additional cost!",
            "WHAT YOU GET: Microphone with Desk Stand x1, USB Cable (5.6ft) x1, Type-C Cable (5.6ft) x1, Pop Filter x1, Conversion Adapter x1, User Manual x1, Quick Guide x1.We provide 24hr Professional Customer Service. If you have any questions, please feel free to contact us."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Audio & Video Accessories",
                "link": "https://www.amazon.com/Computer-Audio-Video-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548951011"
            },
            {
                "name": "Computer Microphones",
                "link": "https://www.amazon.com/Computer-Microphones/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3015406011"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "2.42 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "4.96 x 4.49 x 11.1 inches"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "ASIN",
                "value": "B09F3KNCSY"
            },
            {
                "name": "Item model number",
                "value": "X5"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,035 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7 in Computer Microphones"
            },
            {
                "name": "Date First Available",
                "value": "August 31, 2021"
            },
            {
                "name": "Color Name",
                "value": "Black"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop, PC,Gaming Console"
            },
            {
                "name": "Connector Type",
                "value": "USB, USB Type-C，3.5mm Headphone Jack"
            },
            {
                "name": "Material Type",
                "value": "Metal"
            },
            {
                "name": "Hardware Platform",
                "value": "Laptop, PC"
            },
            {
                "name": "Power Source",
                "value": "Corded Electric"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Streaming, Gaming"
            },
            {
                "name": "Brand",
                "value": "AUDIOPRO"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB，USB Type-C"
            },
            {
                "name": "Special Feature",
                "value": "mic gain-Control, Volume-Control"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Included Components",
                "value": "microphone, user_manual, usb_cable"
            },
            {
                "name": "Polar Pattern",
                "value": "Unidirectional"
            },
            {
                "name": "Audio Sensitivity",
                "value": "48 dB"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "MIC Mute Button One-press mute,built-in LED light Indicate the working status Up to 192kHz/24bit High Sample Rating It supports frequency response: 192kHz/24bit. The higher sample rating can precisely reproduce every detail of your voice. Convenient Microphone Gain Button Sensitive mic gain and volume knobs allow you to adjust the appropriate volume at will to record sound more comfortably. Abundant Accessories You can use the included 5/8\" male to 3/8\" female adapter to install the mic on the standard boom arm. Comes with Pop Filter effectively blocks the harsh popping . Clear Sound Condenser microphone with USB output for digital recording. Clear sound perfectly suit tasks like podcasting or voiceovers, good performance with vocals and even instruments. No-Latency Monitoring 3.5mm headphone jack provides direct,latency-free monitoring. Convenient headphone volume button, can adjust the listening volume of the headset. Packing List: Microphone with desk stand x1 Usb cable(5.6ft) x1 Type-C cable(5.6ft) x1 Pop filter x1 Conversion head x1 User manual x1 Quick guide x1 Tips: If you need to connect an iPhone, an extra adapter is required（not include).",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f214784-f826-4439-a525-f4d74625855d.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7a9b32e4-c16e-448a-9583-54023401e183.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ba4a4ea-fc8e-48b0-bbdb-6937d35f5292.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7de1daee-6895-4a4a-b4d2-f9e25515130f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5495221b-bbd9-41ba-9aaa-a6f27743dddb.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/33c29846-70aa-4adc-bbdd-c3beaf4d140c.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Anthony Bried",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUETIG7WA7EPEMZXEWOB6LEWAAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18GI8SBWMHS3L?ASIN=B09F3KNCSY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars SO FAR SO GOOD!",
                "reviewText": "Saw this and thought I need a new microphone for my zoom class that I teach and it is affordable! I have to admit, for the money you pay for this is a great quality microphone! Super easy. Just plug in and play! I've done a couple of recordings now and the sound quality is great! I will say it picks up everything in a room so definitely be mindful of noise around you. The stand is awesome. Heavy duty and sturdy! The headphones are decent but work awesomely! Better than expected!!! I've recommended this to a few of my friends who are trainers as well to see what they think so definitely worth the price!!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKDF6P2S4I5DENOFHDISHZBCGUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AHJHS0EUN9HL?ASIN=B09F3KNCSY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for podcasts or gaming",
                "reviewText": "The Plug and Play microphone is a fantastic addition to any setup, offering exceptional ease of use and excellent sound quality for various applications.One of the standout features of this microphone is its compatibility with a wide range of devices, including Mac, PS4/5, Windows PC, and laptops with USB-A or USB-C ports. It also works seamlessly with Android Phones equipped with Type-C ports, making it versatile and suitable for different platforms without the need for extra drivers.The onboard audio controls are incredibly convenient, providing sensitive mic gain and volume knobs for effortless adjustments to achieve the perfect recording volume. The 3.5mm headphone output allows for direct, latency-free monitoring, enhancing the user's experience during recordings or live sessions. The quick mute functionality, accompanied by a built-in LED light indicating the working status, adds further convenience to its usage.The microphone's sound quality is exceptional, thanks to its cardioid pickup pattern, which captures clear, smooth, and crisp sound while effectively suppressing unwanted background noise. With support for sample rates up to 192kHz/24bit, this microphone is perfect for various applications, including presentations, podcasts, Zoom meetings, Skype calls, YouTube videos, gaming, and streaming on platforms like Twitch.Installation is a breeze with this microphone, requiring no assembly. It can be used simply by plugging in a USB cable. Additionally, the package includes a 5/8\" male to 3/8\" female adapter, allowing easy installation on a standard boom arm. The inclusion of a well-fitted pop filter at no additional cost is a thoughtful addition that enhances sound quality by reducing plosive sounds and unwanted noise.In summary, the Plug and Play microphone is a fantastic choice for anyone seeking a user-friendly and versatile solution for their recording or communication needs. Its compatibility with various devices, onboard audio controls, excellent sound quality, and easy installation make it an excellent investment. The package also comes with all necessary accessories, and the provided professional customer service ensures that any questions or concerns will be promptly addressed. I highly recommend this microphone for both beginners and experienced users alike.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jackie He",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCIBRM4N7IWJWCKNJGZTDJLW3JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MDPTW4PXICMC?ASIN=B09F3KNCSY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 14, 2023",
                "reviewTitle": "4.0 out of 5 stars Not the Best, but a Good Budget Option.",
                "reviewText": "Tldr: A great budget option as long as you're not looking for something extremely professional.--I usually keep the microphone about a feet away from me due to how my desk is situated, and it still picks up my voice without too many problems. I only use it for the occasional Discord or Zoom call though, and maybe a Twitch stream here or there, I can't say if it's good for gaming or recording.Some breakdowns:Quality: You can hear yourself just fine, but it's not like super crisp quality or anything. Just slightly above average good enough to use type.Background noises: I do not hear any keyboard or mouse click noises from the mic, so this is pretty decent. If you like bang the table or something it'll still pick up a bit though.Multiple voices: It definitely picks up voices very well. I have a noisier house and it would pick up other people's voices as long as they're in the vicinity.Music: It might not pick up music too well, I tried playing some music off my phone and it took a bit before it adjusted to pick up the music & even then it was def at a lower volume than my voice even though I literally placed my phone right in front of it. This doesn't really say much if ur playing live instruments though cuz I can't test that.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JabsJabs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH7DQZ23CW2DAXI4QAYEIAGPRNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R252FB9UIWYC91?ASIN=B09F3KNCSY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2023",
                "reviewTitle": "5.0 out of 5 stars It's an excellent investment that will vastly improve your overall experience and productivity.",
                "reviewText": "The media could not be loaded. I was nervous about my first online meeting, but as soon as I spoke into my computer microphone, all my worries melted away. My voice sounded clear and professional, and I could hear my colleagues just as clearly. The microphone was easy to use and didn't require any complicated setup. It made me feel confident and empowered, knowing that I could communicate with others effectively even from the comfort of my own home. Now, I never attend an online meeting without my trusty computer microphone by my side. It's a small investment that has made a big difference in my professional life, and I encourage everyone to consider getting one for themselves.And I would love to share some features, Its fantastic features make you to have the feeling got much more than you spent:1.Plug-and-Play Connectivity: It could connect directly to your computer's microphone jack, making them easy to set up and use.2.Noise-Cancellation: Its noise-cancellation technology that filters out unwanted background noise, ensuring that your voice comes through loud and clear.3.Headphone Jack: built-in headphone jack, allowing you to monitor your voice in real-time. This is particularly useful for podcasters, streamers, and vocalists who need to hear themselves while recording.4.Budget-friendly: It is price competitive product, making them a good option for people who don't want to spend too much money on audio equipment.5.Good quality: the microphone is built to last. It's made of high-quality materials and feels solid and sturdy in your hand. The design is sleek and modern, and it looks great on any desk.All in all, this is a fantastic microphone and I would recommend it to anyone who needs high-quality audio input for their online meetings, video chats, or recordings. It's an excellent investment that will vastly improve your overall experience and productivity.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ewgu199qL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4ca175b9-bc55-4826-b54d-538347792b67/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Kourosh Noori",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2024",
                "reviewTitle": "Plug & play and reliable. Highly recommended.",
                "reviewText": "Plug & play and reliable. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan Manuel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 10, 2023",
                "reviewTitle": "Muy bueno",
                "reviewText": "De lo mejor",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jini",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 6, 2023",
                "reviewTitle": "Very good buy",
                "reviewText": "Fantastic quality",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leon Chen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on October 12, 2023",
                "reviewTitle": "Work well with Android Phone",
                "reviewText": "Exactly what i was looking for that can used with an android phone for recording.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sylvain C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 22, 2022",
                "reviewTitle": "Physiquement parfait mais son un peu décevant",
                "reviewText": "L'apparence physique et la façon dont est construit ce microphone sont les deux choses qui m'ont le plus incités à en faire l'achat, look très soigné et professionnel et matériaux qui me semblaient de qualité. Maintenant, j'espérait que le son soit correct mais je suis triste d'annoncer que j'ai été un peu déçu de ce côté là. Mon microphone de marque Fifine modèle K669 qui est moins cher a un son de beaucoup supérieur à celui-ci.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}