{
    "remaining_requests": 9312,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shure-MV88-Digital-Condenser-Microphone/dp/B010W6W8OW",
    "body": {
        "name": "Shure MV88 Portable iOS Microphone for iPhone/iPad/iPod via Lightning Connector, Professional-Quality Sound, Digital Stereo Condenser Mic for Vloggers, Filmmakers, Music Makers and Journalists",
        "price": "$149.57",
        "originalPrice": "",
        "rawPrice": 149.57,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shure-MV88-Digital-Condenser-Microphone/dp/B010W6W8OW",
        "soldBy": {
            "sellerID": "A2TZPY9KJKJ4T1",
            "name": "MobAsh",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2TZPY9KJKJ4T1&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CC6M7D6D"
        ],
        "asinVariationValues": [
            {
                "asin": "B09BZXP8Y1",
                "variationName": "Style",
                "variationValue": "MV88+",
                "price": "$199.00",
                "variationImageURL": ""
            },
            {
                "asin": "B08G7T3Q9S",
                "variationName": "Style",
                "variationValue": "MV88+ Video Kit (New Package)",
                "price": "$249.00",
                "variationImageURL": ""
            },
            {
                "asin": "B07M8JLFLK",
                "variationName": "Style",
                "variationValue": "MV88+ Video Kit (Old Package)",
                "price": "$249.00",
                "variationImageURL": ""
            },
            {
                "asin": "B010W6W8OW",
                "variationName": "Style",
                "variationValue": "MV88/A",
                "price": "$149.57",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31lRdk9PKgL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31RQtlWb0UL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31u43J0UoQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xGQG-yOlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4102NNnDfgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5154Mz385cL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/be1b5bc4-a8a0-5fd3-9751-28c59dad19dc/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/7fd2304c-479f-5617-b07f-5a064df00efe/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d27efc8b-fa04-4c22-943d-05d55a216fdb/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2dd6549a-8ebc-4737-8174-d38233bdef3b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4085a40c-12db-4467-89dd-95e6a50d015c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2ee4eff5-7115-4a99-a35b-418ce67f0641/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0cf40db-8fba-4770-9bb9-b520d3f724d2/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B13o7GaRdES.pdf",
            "userManualLink": "javascript:void(0)"
        },
        "byLineInfo": {
            "name": "Brand: Shure",
            "link": "https://www.amazon.com/Shure/b/ref=bl_dp_s_web_2530408011?ie=UTF8&node=2530408011&field-lbr_brands_browse-bin=Shure"
        },
        "brand": "Shure",
        "merchantInfo": "MobAsh",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 5937,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 28 - March 4",
            "Or fastest delivery February 26 - 28"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "IOS LIGHTNING CONNECTION - Apple MFi certified and compatible with all iOS devices with a Lightning connector",
            "POCKET-FRIENDLY - Capture powerful audio recordings on the move without the need for large and heavy audio equipment",
            "FULLY ADJUSTABLE - Flexibility to tilt, flip and rotate the microphone up to 90° to get stereo clarity, whatever your sound source",
            "TWO FREE APPS - ShurePlus MOTIV Audio and ShurePlus MOTIV Video allow you to customize the performance and set-up of the microphone for professional audio and video capture. Download directly from App Store",
            "NO WIND NOISE - Includes a black foam windscreen (part number AMV88-WS); please note that the windscreen comes attached and can be removed if desired",
            "BUILT TO LAST - All-metal construction and quality Shure engineering that has stood the test of touring and live stages across the world over the past 90 years",
            "PROTECTION IN TRANSIT - High-quality zip carry case included for protection when traveling",
            "IN THE BOX - 2-Year Warranty, MV88 microphone, foam windshield, carry case, headphone monitor adaptor cable"
        ],
        "description": "With an innovative mid-side architecture for clean, clear stereo sound, the MOTIV MV88 Digital Stereo Condenser Microphone directly connects to any Apple iPhone, iPod or iPad equipped with a Lightning connector to capture high-quality recordings on the go. The mid-side microphone element is mounted to a unique 90-degree hinge with built-in rotation that allows for highly flexible microphone position, even in video applications. Five built-in DSP preset modes (Speech, Singing, Flat, Acoustic Instrument, Loud) can be accessed via the Shure Plus MOTIV Recording App, a free download from the Apple App Store. The MOTIV app also allows for real-time adjustments including microphone gain, stereo width, and high-quality 24-bit/48 kHz recording for optimal results in virtually any environment. Shure-tested, all-metal construction provides confident performance in any environment. Adjustable Gain Range0 to +36 dB.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Audio & Video Accessories",
                "link": "https://www.amazon.com/Computer-Audio-Video-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548951011"
            },
            {
                "name": "Computer Microphones",
                "link": "https://www.amazon.com/Computer-Microphones/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3015406011"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "1.45 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "1.4 x 1 x 2.6 inches"
            },
            {
                "name": "ASIN",
                "value": "B010W6W8OW"
            },
            {
                "name": "Item model number",
                "value": "MV88/A"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 5,937 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#104 in Computer Microphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "August 1, 2015"
            },
            {
                "name": "Color Name",
                "value": "Silver"
            },
            {
                "name": "Compatible Devices",
                "value": "Compatible with iOS, Mac and PC devices"
            },
            {
                "name": "Connector Type",
                "value": "Lightning"
            },
            {
                "name": "Hardware Interface",
                "value": "USB"
            },
            {
                "name": "Material Type",
                "value": "Metal"
            },
            {
                "name": "Hardware Platform",
                "value": "Lightning Connector"
            },
            {
                "name": "Power Source",
                "value": "PHANTOM POWER: All condenser microphones require phantom power to operate. Please refer to the User Manual for more details on power requirements."
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Singing"
            },
            {
                "name": "Brand",
                "value": "Shure"
            },
            {
                "name": "Model Name",
                "value": "MV88+"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            },
            {
                "name": "Special Feature",
                "value": "Mute Function, Voice Activated Recording"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Included Components",
                "value": "Shure MV88 Portable iOS Microphone for iPhone/iPad/iPod via Lightning Connector, Professional-Quality Sound, Digital Stereo Condenser Mic for Vloggers, Filmmakers, Music Makers & Journalists, Silver See more"
            },
            {
                "name": "Polar Pattern",
                "value": "Multipattern"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Digital Stereo Condenser Microphone Capture professional sound directly to your iOS device Mounted via Lightning, your iOS device now sports the plug-and-play mic with stereo audio. The MV88 records with crystal clear sound, gets that interview with clarity and captures the performance of a lifetime. MV88 only compatible with Lightning-enabled iOS devices.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/72ec32e7-dd8d-4a7b-b38e-b1a0c5fb9456.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Recording Music With The MV88",
                "media_link": []
            },
            {
                "media_text": "Vlogging With The MV88",
                "media_link": []
            },
            {
                "media_text": "Explore the MV88 Tap the hotspots to find out more about some of the features on the MV88; a pocket-friendly microphone to capture professional, stereo sound. Compatible with any iOS device with a Lightning connector 1 2 3 4",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0972abf6-d1e2-4c4b-8100-21bde725b97d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page Captured in stereo Professional Sound A century of audio excellence informs this plug-in mic that’s everything you'd expect from Shure. Custom configuration via App Integration Download our free ShurePlus MOTIV Audio and Video apps and configure your mic settings and record. Fully Adjustable Tilt, rotate or flip the MV88 up to 90 degrees, to get stereo clarity recording from your source. For Lightning Only iOS Compatible MV88 supports Lightning iOS devices only. Check supported devices on the Shure website. Next page 1 Professional Sound 2 Integrated App Control 3 Fully Adjustable 4 iOS Compatible",
                "media_link": []
            },
            {
                "media_text": "MV88 Comparison Chart App Integration? iOS Compatible? Android Compatible? MFi Certified? Livestream Ready? Charge While In Use? Use With Phone Case? App Integration? iOS Compatible? Android Compatible? MFi Certified? Livestream Ready? Charge While In Use? Use With Phone Case?",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/72ec32e7-dd8d-4a7b-b38e-b1a0c5fb9456.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0972abf6-d1e2-4c4b-8100-21bde725b97d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0be08671-7c3e-4972-a937-0430245bfcb5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b193be14-6be6-4ffa-a6da-2e38208f5f01.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/451d4eaa-c448-44d2-8e06-7068aa92ff8f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5f7ce8a9-d5a3-4702-8bf1-0fef3e85364a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ab141c34-5b79-4d13-843b-488cd6c1f2dd.__CR0,0,488,700_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/854528e4-5beb-4cca-a026-e6df478ccfe5.__CR0,0,488,700_PT0_SX488_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "stainlesssteelstainlesssteel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEG5I4ELKTLWAV7KCH3YQII52HOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U68YWPYOJEDW?ASIN=B010W6W8OW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 28, 2017",
                "reviewTitle": "5.0 out of 5 stars You may burst out laughing hearing recordings with the MV88 for the first time—it’s that good",
                "reviewText": "Update 16Oct2021 - iPhone Xs Max in 2018 finally introduced stereo mics. The MV88 is still superior in frequency response and doesn't require the always-on compression in the iPhone.I modified a 2021 Spigen Ultra Hybrid case with an X-acto knife to clear the MV88 (see photo). It was possible to leave intact the top edge over the Lightning connector--unlike some cases with an open area there to I’ve used the MV88 for live music performance video recording in stereo, with a handheld iPhone 6s Plus since Dec2015. As of 04Jul2017 there is no competition for this application. As a musician and software engineer coding audio signal processing, I’ve found the sound quality to be excellent. Amazing lows and clear, extended natural highs vs. mics like the Zoom iQ7 and the old Tascam iM2. Amazon apparently doesn’t allow external links, but google “youtube electric eye lucky strike” should yield two videos of the same performance, with audio from the Zoom iQ7 vs. the MV88.There are other great stereo mics from Shure and Rode, but they're significantly bulkier and heavier—impractical for handheld video.﻿ And there is no contest vs the mono, overload prone built-in iPhone mics—optimized for noise cancellation and monaural voice, rather than stereo live music. You may burst out laughing hearing recordings with the MV88 for the first time. Commenters saying there is little or no difference—maybe are listening on the iPhone speaker? Headphones, external speakers, are the real test.The MOTIV app is easy to use. Documentation is a joy—clear and detailed, often answering not just how, but why. Its Band preset works amazingly well for rock concerts—just a touch of compression and limiting, to the point i’ve never heard distortion on live performances, other than traceable to overloaded mixer/monitor/amps in the original performance. Even on video of Motley Crue’s Final Tour 31Dec2015, the explosions weren’t distorted (google youtube motley crue antera77, at 27:42)The highly elegant pivot and twist system for the stereo mics gives correctly oriented stereo audio for landscape mode (“horizontal”) video. Mics like the Rode iXYL and the apparently abandoned Blue Mikey Digital Lightning (Blue’s website as of 04Jul2017 touts iOS 7 compatibility—a version introduced Sep2013) require portrait mode for this—rendering them essentially useless for landscape mode video. The jewel-like, all metal construction screams quality, vs. plasticy, deformed Mickey Mouse ears looking mics like the Zoom iQ7.Suggested improvements, 0-10 scale, 10 being highest priority/cost:10/10: Recording level indication on the mic - add two or three green LED level meters to the single MV88 “Communication Established” LED.My biggest disappointments have involved not knowing audio levels while recording video. Excellent workaround has been an iOS video app like Filmic Pro with on-screen audio level meters. Apple’s default Camera app has none—suggestion to Apple: Make audio level meters a Preferences-selectable option! Much less elegant workaround: carry earbuds or headphones to the live show to monitor the audio. Earbuds are hard to hear in a live music setting, and more bulk and kit to lose and fuss with—especially with iPhone 7 and newer needing an adapter for headphones.The $100 Zoom iQ7 Lightning mic has three LED level meters, so they’re likely cost-effective.4/10: “Turn Airplane Mode On When MV88 detected” option in the Shure MOTIV appI’ve come home to interference-riddled audio several times, because I forgot to turn Airplane Mode on. No reliable way to tell if interference is occurring while taking video, even with an audio level meter-equipped video app like Filmic Pro.You wouldn’t want Airplane Mode automatic:* not clear that iOS would allow this* some would like to do live streaming, and/or to take calls while recording even if it interrupts the video app3/10: Improve software system reliability in establishing MV88 communicationI don’t know if this is practical. But I’ve had big disappointments from not paying attention to the MV88 green LED. Not noticing the serial data connection wasn’t established meant the horrible, built in mono iPhone mic took over, or worse, no audio. Even using an audio level meter equipped app like Filmic Pro, sometimes I haven’t noticed if the on-screen audio meters were showing stereo vs. mono, or no audio. Apparently it’s fairly common even with the MV88 plugged into the Lightning connector, that a serial data connection is not established. Understandable given several systems have to interact perfectly:* mechanical Lightning connection* three software systems—iOS, video app, Shure MOTIV appThe ideal live music recorder would be a dedicated video camera and permanently attached stereo mic and integrated software. It may be that Shure has already maximized communication reliability, given the constraints of integrating with the iPhone hardware and software.1/10: Add RFID—MV88 is so tiny, it’s easy to lose!A passive 916MHz RFID tag would add an insignificant $0.15 (in volume as of 2006) to the $150 cost. You’ve got the radio hardware to sent out RFID signals right there on the iPhone. Most practical would be just a response—tells you the MV88 is in the room somewhere at least, vs. lost at the gig. GPS chips and a beeper in the MV88 would be nice, but almost certainly not cost effective. Source: wikipedia RFID.——I’d like to address the remainder of this review to errors in the review “Not $150 worth of mic, just ok.By Amazon Customer #99 on March 7, 2017”, as these are common misunderstandings that could dissuade many from making an excellent choice in the MV88:“Bottom line: It's good but, frustratingly, not $150 good…Zoom makes one…at least as good for…less.”I disagree completely. Superior performance, build quality and features are well worth $150 vs competition like the $100 Zoom iQ7. This is generally echoed by the majority of other reviews here.“ “It's fine for speech and podcasts and YouTube videos, but not really good enough for a musician. It is noticeably noisy (hissy)…”For conversations, and live music performances at least, avoiding distortion and overload, is far more important than background hiss—a comparative non-issue. As a musician and audio engineer, I’ve found the MV88 audio excellent—extended bass and highs, and if there’s any distortion, it’s been from overdriven mixers/monitors/amps in the original performance. On quiet passages, audience noise has been more an issue than background hiss.From Shure:“The MV88 was designed primarily to record loud sounds, like a rock concert, or medium sounds, such as conversation. As the sounds gets softer and/or the MV88 is placed farther away from the sound source, at some point the self-noise (hiss level) of the MV88 might become noticeable or objectionable…The MV88 does not have an exceptionally low noise floor like a Shure KSM44A (4 dB SPL-A), however the KSM44A is nearly seven times the price. If the requirement is to record very soft bird sounds in a forest, or the barely audible whispers of wind in the trees, the MV88 may not be appropriate.” (google Shure Customer Help MV88 recording soft sounds)Further, the biggest source of background hiss is presets with Compression on, rather than quiescent mic capsule noise. Turning it off or using Flat preset in the MOTIV app will help. Just be careful to set recording levels low enough to prevent overload.“…even when the phone is in airplane mode.”Airplane mode being off, and microphone signal-to-noise performance are two different noise sources. Airplane mode turns off the iPhone cellular/Bluetooth/wifi radio frequency transmit and receive, which can cause static and other intermittent noise at audio frequencies. This has nothing to do with steady background hiss from the MV88 ADC and mic capsules’ combined signal to noise ratio.“ It has weak midrange and bass response…“Compared to what? I’ve found the MV88 to have excellent bass response vs other Lightning connector mics like the iQ7. Shure’s User Guide lists response as 20-20kHz. Its frequency response graph shows a gentle rolloff below 300Hz but no dip in the midrange:(From Shure MV88 User Guide - Specifications)You may be comparing the MV88 to a mic with artificially boosted midrange and bass.“… although it's tweakable in the MOTIV app up to a point.”Indeed it is, with the MOTIV 5-band graphic EQ:(From Shure MV88 User Guide - The ShurePlus MOTIV App - Mic setup)“It is heavy and cumbersome unless you hold the phone…on a tripod.”Maybe if you’re a leprechaun. The MV88 mass is 40.5g vs. your favored Zoom iQ7 at 30.5g. Using the MV88 handheld for shooting live music performances with my 192g iPhone 6s Plus and approx 24g Incase Halo Snap case increases the mass as a unit by about 20%. Or the mass vs. using the iQ7 by about 4.1%.(192+24+41)/(192+24).(192+24+41)/(192+24+31)Claiming a 4% increase in mass would push an iPhone-plus-mic into tripod territory is baffling.“It won't work with many cases…”It fits Apple, and some Incase cases. Making sure your case provides clearance around the Lightning connector is a reasonable tradeoff to get the excellent MV88 features. Shure also addresses this: (google Shure Customer Help MV88 use with a phone case)“Alesis and Rode make better ones.”As of Jul2017:* The RODE iXY-L orients its stereo mics incorrectly for landscape mode video. This can outweigh possibly better sound* Alesis lists no mics on its website“It’s an improvement over built in DAC/mic but not a huge improvement.”DAC (digital to analog conversion) is irrelevant to an analog audio source like a microphone. You might be thinking of analog to digital conversion (ADC).“An iPhone really needs a full outboard DAC to record decently. This seems to share…”You seem to be suggesting the MV88 relies on an iPhone internal digital to analog converter (DAC). If so, this is false.Again, digital to analog conversion—outboard or otherwise—is irrelevant to an analog audio source like a microphone. You might be thinking of analog to digital conversion (ADC). This is necessarily done by the MV88, since the iPhone Lightning connector has no analog data signals. It only has pins for a serial digital data stream. That is, the MV88 indeed has an ADC “outboard” from the iPhone.(Wikipedia Lightning Connector)",
                "reviewVotes": "344 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71voeSCZ0kL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ZapDZapD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7MMFBPZHDJ6A5XATGZJ5Y6XEEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C1GQLJRRFC5M?ASIN=B010W6W8OW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2019",
                "reviewTitle": "5.0 out of 5 stars Amazingly versatile microphone. Works as a video camera mic also!",
                "reviewText": "I was using a Rode Video Mic on my Micro Four Thirds camera, a Panasonic GX8. However, I was frustrated by the very narrow sound window, and lack of stereo sound, and it wasn't exactly travel friendly either.I also use my phone when there is enough light. So I wanted something that worked with everything. It turned out that the MV88+ works well with Phones, Cameras, and Laptops.As a phone mic it works amazingly well. You can alter the stereo width, set it to a narrow mono, side channel, you name it. The video and audio apps from Shure work well. The mic also works with any other app on the phone without issues. The dynamic range is great, pick up the smallest sounds, and loudest thunder without clipping. When set to wide stereo there is a great sense of presence when you listen back to the audio on headphones.You can use this as a SLR/Mirror-less video microphone also. All I had to do was calibrate the input level on my camera and the headphone output until the levels were correct. With the right adapter cables, it even works in stereo on the Panasonic GX8. The microphone saves its setting even when not connected to a phone. And the headphone output works, even when the microphone is only connected to a USB battery power pack. There is no latency on the headphone output.It also works well on laptops and desktops as a USB microphone. You do still have to connect it to a phone to alter any settings. Note it works with a normal USB-A to Micro cable on Windows, no need for USB-C if you don't have it.The whole kit stores in a wrap that unrolls into a flat set of five pockets. There are also elastic straps on the outside that work to hold the mini-tripod. When warped up, it takes up about as much space as tall coffee mug. It is very portable and easy to setup.The phone kit consists of a Manfrotto brand clamp and tripod. The phone clamp is good, but there is no spring action, so your phone is held only by how tight you can get the knob. The good news is the top is a cold-shoe, and the bottom is a 1/4-20 thread, so you can replace the whole clamp with something better if you want.The tripod is high quality. It has a easy release button, and stays when you put it. You can attach the microphone directly to it, without the phone clamp, to make it into a traditional desktop microphone.The arm holding the microphone is a simple clamp, but holds the microphone very tightly. It has a 1/4-20 thread at the base, and a cold shoe attachment that works great on a SLR/Mirroless camera. The microphone body itself appears to be compatible with other traditional microphone grips.The foam ball on the end of the mic can be pulled off, making the profile even smaller where wind isn't a concern. It is still quite small even with a Movo WS-G10 Furry windscreen added.The overall construction of the microphone, and included accessories is top notch. The microphone appears to be all metal. The included cables are sturdy, however they are short. You can use a USB-Micro extension cable to get more distance, even when using the Lightning cable.",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/814+zQOxTgL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 15, 2023",
                "reviewTitle": "Best mic for iPhone I’ve seen so far",
                "reviewText": "I’ve used it quite a few times with my iPhone now and it seems the most adequate mic for music and it picks up sound a lot better than with just the iPhone mic.The small tripod is a nice way to carry the phone and mic although it only films horizontal, not good for instagram lives. However i bought a seperate tripod and it’s able to hold the mic while having the phone vertical.I’d recommend this mic if you’re planning to use this mic with your iPhone and are into filmography or music.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jut ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 22, 2023",
                "reviewTitle": "Muy bueno",
                "reviewText": "Mejoró mucho la calidad de mis videos en cuanto al sonido, el hecho de que puedas monitorearte en vivo me parece genial! Me ayuda mucho, la app es buena, te da varias opciones de configuración del micrófono, todos los accesorios se ven de muy buena calidad, lo único que me gustaría que tuviera serían efectos como reverb o delay",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 30, 2023",
                "reviewTitle": "Calidad muy buena",
                "reviewText": "Superan por mucho la calidad del micrófono integrado de iPhone.Sus variantes de tipos de micrófonos lo hacen excelente para acceder a un sonido con estilo profesional desde el teléfono.Tienen un espectro amplio del campo stereo.La app es muy útil para configurar el tipo de micrófono que se quiere usar.Es como un kit de 3 micrófonos en 1.Sirve para grabar conciertos sin distorsión o sonido ambiental si eres diseñador de audio.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sudip",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 31, 2024",
                "reviewTitle": "Good product",
                "reviewText": "Awesome product of Shure as expected. Btw be aware while removing its wind screen as I have torn it 😂",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deniz Yetim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 31, 2023",
                "reviewTitle": "Klein und nützlich",
                "reviewText": "The media could not be loaded. tolle product! Es nimmt sehr guten Ton auf",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/A1PoL QyeRL.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}