{
    "remaining_requests": 9419,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/V-MODA-BoomPro-Microphone-Gaming-Communication/dp/B00BJ17WKK",
    "body": {
        "name": "V-MODA BoomPro Microphone for Gaming & Communication - Black, Wired",
        "price": "$19.99",
        "originalPrice": "$29.99",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/V-MODA-BoomPro-Microphone-Gaming-Communication/dp/B00BJ17WKK",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31nhzaMmO1L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/515qv5GSEOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41AImpt8ahL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YKPYWlFOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LpnTtHf2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411oEkqz0JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51V45y TwSL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e4d3497-a8b4-4186-a7b8-0c6089dfdd6c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c897af33-3047-4707-afd8-44e40208a2b2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/62c160cf-b5c1-40e2-8281-139fb7d97afb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/190e7f79-fe39-43a7-bd38-0f7820e950b1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fe586cb-d38d-445b-9b66-fb564e3652a5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3fe14123-dcbf-4ebe-ad61-05e5fcefff57/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71YMaduB7SL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71YMaduB7SL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Roland Store",
            "link": "https://www.amazon.com/stores/Roland/page/D3CFAF1D-E2B7-4C12-AFE9-1AFA7156697E?ref_=ast_bln"
        },
        "brand": "Roland",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 8973,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Sunday, February 18. Order within 14 hrs 14 mins",
            "FREE pickup Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 17. Order within 4 hrs 59 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Professional-grade mic ideal for communication and gaming featuring enhanced voice clarity and background noise reduction",
            "Detachable for maximum compatibility and usage; flexible ad adjustable for ideal mic positioning",
            "Built to last with a durable and reinforced cable, 24k gold plated plug and SteelFlex boom arm",
            "Convenient control clip features an in-line mute switch and rotary volume controls",
            "Compatible with all smartphones, tablets, PCs, notebooks and gaming consoles via 3.5mm (1/8\") plug and headphones with a 3.5mm (1/8\") cable input"
        ],
        "description": "Product Description The BoomPro Microphone is the detachable, flexible, and state-of-the-art boom microphone for communication and gaming. It enhances voice clarity and reduces background noise, an essential for gaming and conference calls. It’s built to last with a durable reinforced cable, 24K gold-plated plug and flexible boom arm that’s adjustable to be positioned wherever you like. The control clip has built-in mute and rotary volume controls. Compatible with all smartphones, tablets, PCs, notebooks and gaming consoles via 3. 5mm plug and headphones with a 3. 5mm cable input.Source Compatibility:Sony PlayStation 4Sony PlayStation VitaSony PlayStation 3 (needs third party adapter)Microsoft Xbox OneUpdated Xbox One Controller w/3.5mm (1/8\") headphone jack (no adapter needed)Original Xbox One Controller needs official Microsoft headset adapterMicrosoft Xbox 360 (needs third party adapter)Smartphones, tablets, PCs and notebooks via 1/8\" (3.5mm) plug From the Manufacturer V-MODA",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Audio & Video Accessories",
                "link": "https://www.amazon.com/Computer-Audio-Video-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548951011"
            },
            {
                "name": "Computer Microphones",
                "link": "https://www.amazon.com/Computer-Microphones/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3015406011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.2 x 4 x 7.1 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.05 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Roland"
            },
            {
                "name": "ASIN",
                "value": "B00BJ17WKK"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "C-BP-BLACK"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 8,973 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13 in Computer Microphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "February 21, 2013"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming"
            },
            {
                "name": "Brand",
                "value": "Roland"
            },
            {
                "name": "Model Name",
                "value": "BoomPro Microphone"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            },
            {
                "name": "Connector Type",
                "value": "3.5 mm Jack"
            },
            {
                "name": "Special Feature",
                "value": "Tangle-Free Cord, Lightweight, Volume-Control, Microphone Feature"
            },
            {
                "name": "Compatible Devices",
                "value": "Sony PlayStation® 4 Sony PlayStation® Vita Sony PlayStation® 3 (needs third party adapter) Microsoft Xbox One Updated Xbox One Controller w/3.5mm (1/8\") headphone jack (no adapter needed) Original Xbox One Controller needs official Microsoft headset adapter Microsoft Xbox 360 (needs third party adapter) Smartphones, tablets, PCs and notebooks via 1/8\" (3.5mm) plug See more"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Included Components",
                "value": "BoomPro Microphone"
            },
            {
                "name": "Polar Pattern",
                "value": "Omnidirectional"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Transform your Ordinary Headphones into a Versatile Headset for Communication Detachable, Flexible, State-of-the-Art Boom Mic The BoomPro Microphone instantly transforms your headphones into the perfect communication device for gaming, business communication, podcasting and taking calls on the go. Its unique bendable design allows you to position and hold the mic in place wherever it’s most comfortable for you. Level Up Your Work From Home Setup BoomPro works universally with all V-MODA over-ear and on-ear headphones as well as many other headphone brands that have a detachable 3.5mm cable. Attach the BoomPro Microphone for crystal clear call quality anywhere. By reducing background noise and enhancing voice clarity, the BoomPro is the easy, lightweight essential for working from home or on the road. Why BoomPro? Crystal clear communication Ideal for working from home and gaming Flexible arm for microphone positioning In-line mute switch and rotary volume controls",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d6a3a352-08c4-43ae-87b8-993447021dd7.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Crystal Clear Communication Enhances your voice clarity and reduces background noise to make sure your colleagues, fellow gamers and podcast audience hear only what you want them to. Easy Access Controls The convenient control clip not only secures your BoomPro Microphone in place but it also features in-line mute and rotary volume controls, so you’re always in control of your sound. Compatibility Headphone Compatible with all V-MODA Crossfade series and most headphones with a 3.5mm (1/8\") input port.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/80977657-ca88-4a7a-bfa3-0356e8cc53b5.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3cf1f246-6468-4bf8-b088-cc94e3fc22e0.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e2b3eb93-ee97-40dd-ae08-e52ef97648f4.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Get to Know V-MODA BoomPro Gaming VOiP Headset Headphone Mic Microphone Type: Omni-directionalMicrophone Sensitivity: -38±2dBWeight: 30gLength: 74.8\" (190cm)Impedance: 2.2kΩSignal to noise ratio: 58dB Maximum input: 100dB Standard operating voltage: 2V Operating voltage range: 1V – 10V Compatibility: Headphone Compatible with all V-MODA Crossfade series and most headphones with a 3.5mm (1/8\") input port. Source compatible with all smartphones, tablets, PCs and notebooks via 1/8” (3.5mm) plug and gaming systems with additional kits (sold separately).",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/672cc960-cb6a-4398-a338-40b2c75b974c.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c25b2215-5538-45c8-8b7b-dc5223a9de5f.__CR0,24,2374,734_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d6a3a352-08c4-43ae-87b8-993447021dd7.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/80977657-ca88-4a7a-bfa3-0356e8cc53b5.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3cf1f246-6468-4bf8-b088-cc94e3fc22e0.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e2b3eb93-ee97-40dd-ae08-e52ef97648f4.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/672cc960-cb6a-4398-a338-40b2c75b974c.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Charles Seiler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH46QW3OANAMSSU6CEJJMJFEPHOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3080Y0TBYSE84?ASIN=B00BJ17WKK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2017",
                "reviewTitle": "5.0 out of 5 stars Almost as clear as my professional studio microphone.",
                "reviewText": "As a non-gamer, I bought this for video voice overs, skype, podcasting and for use with my video camera. Now, I think this won't work with my DSLR or Canon Vixia video camera, because they require a \"line level\" input from a powered microphone such as the Vid-Pro lavalier microphone sold on Amazon, which takes a button cell battery and has a tiny amplifier in it.Cons:The 1/8\" Y cable that comes with this is terrible. It plugs in very tight, and will never come out. But it feels permanent, once plugged in, and barely comes back out. I felt like I might break the cable trying to remove the 2 little 90 degree plugs from my computer. I would suggest buying a new headset microphone adapter Y cable, for $5 on Amazon that has straight plugs. The cord is nice and braided which feels nice, but it does create a little bit of noise when you brush it against a zipper on a sweater or coat. Not a big deal. The microphone picks up a very slight echo speaking into my custom cubicle style work desk, unless I turn it so the microphone holes are facing up and down, which completely removes any echo. The microphone won't work with my Scarlett preamp designed for large professional microphones.Pros:This V-Moda microphone sounds more clear and accurate than a professional XM8500 stage microphone I recently purchased, which sounds very dense, muffled and muddy in comparison to the V-Moda microphone. After seeing how tiny the V-Moda was, holding it in my hand, I was extremely skeptical that it could reproduce the Human voice properly without seriously distorting the frequency and tone like many other tiny non-powered microphones or cheap headset microphones.Well, the V-Moda BoomPro is not an ordinary cheap microphone. It was engineered by real sound engineers, because it blocks background sound better than my $100 studio microphone, and sounds almost as clear. The V-Moda is more a bass and mid range microphone, picking up the lows very well, without picking up the really low lows that cause distortion and muddiness. It seems to have just the right frequency response for picking up the Human voice. It does not pick up the ultra low rumbling frequencies or the ultra high shrill background noises. Somehow, the itty-bitty tiny little microphone that is nearly invisible, it records big booming sound, and reproduces my speaking voice with clarity and authority.The V-Moda is worth every penny, because it is as good as advertised.Observations and Technical Breakdown:The V-Moda doesn't reproduce the Human voice accurately. None of the microphones I've ever used sound totally natural. Microphones convert your voice into an electronic signal, so there will always be some kind of coloration of the tone of your voice, music recorded in the background, etc. The V-Moda is a little bit heavy in the low mid range area, and a little light in the high end frequency spectrum. It's designed intentionally this way to prevent background noise and to prevent shrill unnecessary high pitched sounds from being picked up by the microphone. I am perfectly happy with the sound tone of the V-Moda for Skype calls and phone calls, as it's nearly perfect. Using default settings, the V-Moda sounds more clear and less muddy than my Behringer XM8500 microphone, which was pretty shocking considering the size difference. I've heard many small microphones that sound so muffled and terrible that they are mostly useless .The V-Moda sounds very similar to my inexpensive studio microphone, an AKG P120 condenser microphone, which uses 48 volts and a preamp, a Scarlett 2i2 2nd generation.For video voice over work, the V-Moda is too mid-bass heavy for my taste. Surprisingly the V-Moda microphone seems to automatically block out frequencies below 100hz, preventing any heavy bass noises from ruining the sound. But if you want your voice to sound absolutely natural, you'll need to do some editing in a sound editor or use some kind of an equalizer. This is for people who are using this to make professional recordings. Now, again I was skeptical that this microphone could be good enough to make a professional recording. But indeed it can. You will need to do a little editing. I'll tell you how I was able to do it.First, you'll need a new computer sound card. Unless you you have a really good internal sound card in your computer, or a professional recording studio, you might get too much line noise from the cheap internal microphone port on your laptop or computer. Every computer is different. However, my laptop and my PC computer both have a lot of line noise when I use a microphone on the factory microphone input jack. I tried using the V-Moda on a Sound Blaster Audigy sound card and there was absolutely no audible line noise or hissing. This is called signal to noise ratio. Add-on sound cards that you purchase separately may be better than the internal sound card, so if you get line noise, I would recommend either buying a Sound Blaster Audigy (Open your computer and check for open PCI & PCI express slots). They make PCI or PCI Express sound cards. Or you can get a USB sound card. I found a really good PCI sound card that also doubles as a professional headphone amplifier. It's called the ASUS Xonar DG 5.1 Channels PCI Interface Sound Card. You can get it here on Amazon: http://amzn.to/2AVdJQmThis ASUS DG sound card is designed for headsets, it has a very high signal strength so it doesn't have any line noise, and it has a built in amplifier to power expensive headphones. People report a noticeable improvement using this sound card with headphones. The ASUS DG sound card actually has an adjustable output for different types of headphones, so it can work with cheap headphones or professional 600 ohm headphones which usually require an expensive external headphone amplifier. You can configure it for different headphone OHM ratings. I've never seen this feature on any other sound cards, especially internal factory sound cards.Sound Editing:Back to the V-Moda microphone. What makes a good microphone good is it's ability to maintain the information being recorded. If you lose certain frequencies or distort the voice too much, you cannot use sound editing to fix the sound. No amount of editing can fix a bad microphone, because the sound is lost before it gets recorded. The V-Moda handles sound editing extremely well. Again, I was shocked. It's not as good as my AKG P120, but it's close enough after editing, that no normal person would ever notice a difference. The V-Moda does cut off a lot of the high frequencies and it does boost some of the low-mids, naturally, due to its design. You won't be able to magically recreate the missing high frequency sounds, but for voice recordings, that's perfectly fine and even desired in most situations. High frequency sounds are rarely desired in voice recordings, and the most popular radio broadcast microphones today have a sound tone that is very similar to this V-Moda microphone, with muted treble.The V-Moda does't have an absolutely accurate sound tone, it sounds a little bit amplified in the mid bass area, but with some sound equalizer adjustments in a sound editor program, you can make the tone sound more natural, just by reducing some of the mid bass. If you just get a free program like Audacity, then you can record your voice, then edit the sound using the built in equalizer to get the exact sound you want. I am convinced that the V-Moda records with enough quality that you can safely edit the sound recording without losing a significant amount of the audio integrity.In conclusion:The V-Moda sounds slightly muted, slightly muffled, and slightly boosted in the lower-mid bass region. But it appears to be perfectly tailored to picking up the Human voice, and blocking out things happening in the background. It's obviously a very carefully engineered microphone, and is shockingly good for the price. Unlike other microphones which sound wretched and painful to the ears, this V-Moda microphone has a very smooth, very warm sound tone, that is very clear. I am so happy to know that engineers actually engineered this microphone, unlike 99% of the other microphones out there in this price range which appear to be random accidents, and have no ability to recreate the Human voice.You'll need sound editing to remove some of the mid-bass in order to make this microphone record more accurately, but with some sound editing, I think you can make this microphone sound good enough that you won't need to ever buy a more expensive professional grade microphone. I would consider this a professional microphone for home users and hobbyists. If you need something better than this, than I would suggest getting a dynamic microphone like the Shure SM57 with an extra heavy duty gray foam wind sock, a Shure SM7, or an AKG D5. Then you'll need a preamp like a Scarlett 2i2 USB, and a 15 foot XLR microphone cable. If you need super fine sensitivty and detail, then purchase a 48 volt powered condenser microphone like the AKG P120, and a microphone stand with a boom arm on it, then you can hear a pin drop, literally.You'll want to buy a Sound Blaster Audigy or the ASUS DG sound card if you are using a PC computer, if you hear too much white noise in the background in your recordings. Start first by turning down the gain, and looking for updated drivers for your factory sound card.Edit: 11/23/2017I received my Asus Xonar DG sound card for my 5 year old motherboard with a PCI slot on Windows 7. The sound card microphone input jack used with the V-Moda BoomPro is absolutely crystal clear, without a trace of any line noise or white noise. This V-Moda microphone sounds even better now, more natural sounding, and even more clear. I am shocked at how much better a $30 sound card can make the microphone sound. If you are having sound issues or having too much line noise, or not enough gain, try getting a new sound card.V-Moda vs. Golden Age Project D2 microphone. I bought a new dynamic professional microphone and tested it against the V-Moda yesterday. The Golden Age Project D2 sounds much worse than then V-Moda BoomPro. The same for the XM8500, which sounds much worse, but better than the D2. Again, I am so surprised. The D2 microphone was $150, but it sounds like you are speaking into a plastic bucket, compared to the natural clarity of the V-Moda. The V-Moda so far, sounds better than 2 other non-powered microphones I've tried which are far more expensive. The ASUS sound card is not perfect, it has caused my computer to lock up a few times with a blue screen, if I try to use my Scarlett Focusrite at the same time, to record multiple devices at the same time. It also takes a moment to begin recording when you engage the sound card, because it has to charge up the capacitors. The Asus sound card software allows you to do realtime \"EQ\" adjustment of your microphone input, and it sounds excellent, with an improvement in the high frequency response of the Vmoda mic, which, for the price of the sound card ($30) is truly amazing. With the treble turned up, the Vmoda sounds even more clear and crisp.Conclusion: Get a new computer sound card, and don't worry about buying a professional condenser or studio microphone. Get the V-Moda.",
                "reviewVotes": "104 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scion of Orion",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPPKD3ARCWPYYZMYRPYNSMZLTFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WQRI79O83NNE?ASIN=B00BJ17WKK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 26, 2014",
                "reviewTitle": "5.0 out of 5 stars xBox One Headset Adapter Solution for ALL Headphones INCLUDING Apple Headphones (And Apple-Ready Ones Too)!!",
                "reviewText": "This review is intended for GAMERS, so if your looking at this mic for other purposes, you may be better off reading another review. That said, I have the UE 6000 headphones, which are Apple ready, and wanted to use them for online gaming and chat on xBox One online. Because the UE 6000s are Apple-ready, the inline mic will NOT work due to ground and mic rings on the jack being flipped from the \"standard\" used in the xBox One headset adapter. But, using this mic with the UE 6000s WORKS PERFECTLY!! This cord will work with ANY Apple based headphones (so long as your headphone cord is detachable).The cord is of impressive build and performance quality! Other player's voices are clear (limited by your headphone quality of course), and everyone you're talking to will hear you clearly. Nobody has complained about the quality of this mic. The mic receives sound on both sides, so it's basically \"reversible\", which means it doesn't matter if your cord plugs into the L/R side of your headphones. As for the mic stem, it's perfect! Very flexible, and will retain whatever shape you place it in. It's lightweight, so it's not going to fatigue the wearer after long term use. And the max volume while playing online is LOUD (though this may be attributed to the UE 6000s). Many people have complained of low volume while using the headset adapter with whatever headset they're using. The quality of the cord exceeds the $30 cost, so it's a value purchase. Rather than buying a new set of Turtle Beaches, Trittons, etc, this mic's value becomes an even greater value.***- The xBox One Headset Adapter is a MUST! This cord will not bypass the need for the adapter.Because this cord wasn't designed exclusively for gaming, the cord is on the long side (6ft long). However, it does come with a velcro strap to tie the cord and shorten it. It's a solid solution, or you could just use a twist-tie for the same purpose. The only slight complaint that could be made about this mic is that if you rub it, you'll hear some SLIGHT muffling in your headphones. But, you only really notice it if there's no sound coming through the headphones. When playing, I never noticed any sound interference at all.Rather than buying the Polk 4-Shot gaming headset for $160, or the XO Sevens for $135, I'd strongly recommend this alternative for the same price- this V-Moda mic ($30), the xBox One Headset Adapter ($25), and the UE 6000 headphones. As of 3/26/2014, these headphones are listed on Amazon for $80 (in white), and $100 (in black). I did a side-by-side comparison with Beats Studio, and these 6000s sounded better/clearer with just as much bass if you wanted. Plus, you can then use these headphones \"on the go\" unlike turtle beaches, tritons, etc. And their build quality is far superior to the Polk and others.In conclusion, this mic is perfect for turning ANY pair of detachable cord headphones into a gaming headset when used with the xBox One Headset Adapter. The construction and performance are top notch, and the mic stem is highly customizable. If you already have a quality pair of headphones that you feel would make a great gaming headset, then buying this mic is a no-brainer. If you don't already have a quality pair, it's worth your time and money to put together a gaming headset using this mic. And if you go this route, start by looking at the UE 6000s!!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6IUAN3JWKQPCFGRNSOSI7RAG3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CEPCSTLQ61CH?ASIN=B00BJ17WKK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 7, 2023",
                "reviewTitle": "4.0 out of 5 stars BoomPro is Still a Fantastic Option",
                "reviewText": "I initially bought these for my Astro A40's because the microphone is horrible. Turns out the A40's don't work because Astro decided to use a longer 5 pole 3.5 jack which didn't work with this product. A shame I couldn't find an adapter either. So instead I am temporarily using the mixamp with the original Skullcandy Crusher wireless. I tried using the Crusher ANC, but the 3.5 jack is on the right side of the headphones and I didn't like having to rotate the microphone boom like that. The jack fits nicely though, it doesn't feel loose and it doesn't swing around. So far the sound quality is good, it does utilize the bass drivers in the Crushers. I mainly bought these because the microphone is incredible. Most programs I use such as Discord or Xbox party chat have filtering, but it does let a lot of background noise through normal voice recordings.Here are my cons so far: The braided cable makes a lot of noise and transmits into the microphone which can be heard with Astro's sidetone (feature that lets you hear yourself) enabled. There is no indicator when you are muted. The mute slider is not that good, I thought the logo was a giant mute button. You have to use a stand or be careful while laying your headphones down as this mic doesn't flip up or retract. There is some hiss noise at higher volume. The boom arm doesn't seem to have a lot of retention to hold it's position, might be an issue in the future.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kanna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 29, 2023",
                "reviewTitle": "Buen microfono",
                "reviewText": "Veo que hay muchas reviews negativas de la construcción del producto, si bien estaría de lujo que lo construyeran con un poco de metal para reforzarlo, se ve que es de un material decente, por lo menos.Por lo menos se que el microfono nuevo es un buen producto, por el momento parece que el audio no se filtra con el splitter, pero actualizare con el tiempo si algo le sucede al mismo, este microfono fue un reemplazo de un clon del mismo que tenía excelente calidad por el precio, y espero que al menos aguante un año el Boompro.Lo unico que podria recomendarles es que no dejen que el control de volumen aplique peso al microfono siempre poniendoselo en la camisa dejando que el cable entre el micro y el control sin ningun tipo de tension (su version china se daño por esto que menciono)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kalchak1569",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 1, 2023",
                "reviewTitle": "Great mic!",
                "reviewText": "Overall: A great mic for gaming and work use.Pros:- Great sound quality for the price- Depending on the software used, pretty good voice isolation- Long cable- Lasted me several years before I needed to replace it- Had several pairs of VMODA headphones and no issues with using it (it will likely work without any issues with other headphone manufactures)Cons:- The volume/mute control box can get flimsy over time causing statis noise but for the price can't complain",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claus H.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on June 12, 2023",
                "reviewTitle": "Amazing microphone",
                "reviewText": "Really good mix, fits mit xm4's perfectly",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JanJan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on December 6, 2022",
                "reviewTitle": "Geweldig!",
                "reviewText": "Omdat ik al een goede hoofdtelefoon had is dit een geweldige hulpmiddel om er een gaming headset van te maken.Geluid is erg goed en de microfoon is gemakkelijk te buigen.Prijs is ook prima!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7180tZs34bL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Piotr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Poland on December 1, 2022",
                "reviewTitle": "Dobre, ale nic ponad to",
                "reviewText": "Boompro zakupiłem razem z Philipsami Fidelio X2HR. Z początku wydawało się, że mocno wycisza słuchawki, trzeba było mocniej tylko docisnąć jacka. Nadal je wycisza, ale nie tak bardzo. Słuchawki na oryginalnym kablu grają o wiele głośniej i warto o tym wspomnieć. Jak na taki mały i podręczny sprzęt absolutnie spełnia swoją funkcję.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}