{
    "remaining_requests": 19384,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Original-Feminine-Infections-Lemongrass-Essential/dp/B076BZR74J",
    "body": {
        "name": "The Original All Natural Feminine Deodorant Spray | Helps with Vaginal Itch, Irritation, & Odor | Intimate Yoni Oil Made with Tea Tree, Lemongrass, & Orange Essential Oils | 2 oz Spray",
        "price": "$18.04$18.04 ($9.02$9.02 / Fl Oz) $17.09$17.09 ($8.55$8.55 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 18.04,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Original-Feminine-Infections-Lemongrass-Essential/dp/B076BZR74J",
        "soldBy": {
            "sellerID": "AUZQZVSPH2KVH",
            "name": "BonaDeaNaturals",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AUZQZVSPH2KVH&asin=B076BZR74J&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07VZ6LN86"
        ],
        "asinVariationValues": [
            {
                "asin": "B076BZR74J",
                "variationName": "Size",
                "variationValue": "2 Fl Oz (Pack of 1)",
                "price": "$18.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07VY5MWS9",
                "variationName": "Size",
                "variationValue": "3.99 Fl Oz (Pack of 1)",
                "price": "$25.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41fl0KewD0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41kzssyEg4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZKlx5GqUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ySaatDa3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4192vg4jVkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iHqkyvG5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91MmykaODPL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/26748d86-b9d1-4620-953a-32e7f192f399/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bona Dea Naturals Store",
            "link": "https://www.amazon.com/stores/BonaDeaNaturals/page/FC4D78C8-1F8D-431F-995B-C5B6FF2343EE?ref_=ast_bln"
        },
        "brand": "BonaDeaNaturals",
        "merchantInfo": "BonaDeaNaturals",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 7526,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest Same-Day delivery Today 5 PM - 10 PM. Order within 3 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "CAREFULLY RESEARCHED & CLINICALLY TESTED: Formulated with natural compounds like Calendula and Echinacea, Bona Dea Naturals Feminine Deodorant Spray has been carefully researched to provide women with an effective and natural solution! Dermatologist tested, our products are clinically approved to be hypoallergenic and non-irritating.",
            "PLEASANT CITRUS SCENT: Struggle with embarrassing odor? Our signature feminine blend contains essential oils like lemongrass and orange, which result in a gentle citrus scent and provides a mild and refreshing fragrance.",
            "COST-EFFECTIVE & CONVENIENT: Potent bioactive compounds mean even with twice-daily use, product lasts 3-6 months. A little goes a long way! Spray application means no messy creams or awkward suppositories & applicators. Don't wait any longer when relief is possible TODAY!",
            "MONEY-BACK GUARANTEE: If you are not 100% satisfied with our product, contact us directly (via the email on packaging) and we will refund your purchase.",
            "QUALITY GLASS PACKAGING - MADE IN THE USA: Supporting Bona Dea Naturals means supporting a small woman-owned business. We hold the quality of our products to the highest standard, so all Bona Dea Naturals’ feminine hygiene products are developed and manufactured in registered facilities in the USA."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Health Care",
                "link": "https://www.amazon.com/Health-Care-Products-Personal/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3760941"
            },
            {
                "name": "Feminine Care",
                "link": "https://www.amazon.com/Feminine-Care/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3779501"
            },
            {
                "name": "Deodorant Sprays",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3779521"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.5 x 1.5 x 4.76 inches; 4.48 Ounces"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B076BZR74J"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,535 in Health & Household (See Top 100 in Health & Household) #8 in Feminine Hygiene Deodorant Sprays"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 7,526 ratings"
            },
            {
                "name": "Brand",
                "value": "Bona Dea Naturals"
            },
            {
                "name": "Item Form",
                "value": "creams, Oil Spray"
            },
            {
                "name": "Scent",
                "value": "Tea Tree"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Unit Count",
                "value": "2 Fl Oz"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Natural Citrus Scent Struggle with embarrassing odor? Our signature feminine blend contains a gentle citrus scent made from orange and lemongrass essential oils. Cost-Effective and Convenient! Our Feminine Oil Blend comes with a convenient spray lid for an easy, no-mess application. Simply spray 1-2 pumps on a panty liner or directly to the area and feel the results. Woman-Owned Business Supporting Bona Dea Naturals means supporting a small woman-owned business. We hold the quality of our products to the highest standard, so every product is developed, and manufactured in FDA-registered facilities in the USA.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5a898399-d562-48d7-bdb6-b3bc3f8254f9.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad5fd020-e119-4374-b25d-4b226f69f881.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/169f5898-a427-40d3-801f-8a09d1fca833.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a176cf2a-8a70-4c1d-a78b-e282487b757b.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0b5d602a-ee1d-4d1a-ba92-7a2378a7483c.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64885f7e-283b-470c-ad51-2fb7a7db5ef0.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5a898399-d562-48d7-bdb6-b3bc3f8254f9.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad5fd020-e119-4374-b25d-4b226f69f881.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/169f5898-a427-40d3-801f-8a09d1fca833.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alyssa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGETMINLVYKLHY2MOFSYAQEK62A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLMFZG1XWNUJ0?ASIN=B076BZR74J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2019",
                "reviewTitle": "5.0 out of 5 stars A Long and Unashamedly Honest Success Story",
                "reviewText": "I suffer from chronic yeast infections and BV that leave me constantly uncomfortable and worried about odor issues. I desperately sought professional help so many times over the years (even when traveling abroad - it was that bad!) that I began to joke, “Doctors/nurses have seen my lady bits and had fingers up in there more times than lovers have!”I did everything I knew to do lifestyle-wise to manage. Cotton underwear, no soap or douches, fragrance-free laundry detergent, probiotics, etc. No help. I relied on prescription Diflucan, anti-itch cream, and expensive OTC Monistat treatments that only helped one occurrence at a time. Odor remained a big problem.I was so embarrassed and hesitant in the bedroom that I would try to distract my partner by insisting on satisfying him first and making him sleepy so that I wouldn’t have to undress.I finally realized that I wasn’t “failing” at following professional advice. I was following it, but it wasn’t enough, and it wasn’t my fault. So, I browsed around for alternative treatments I may not have known about to tackle the problem from all angles. I ordered Dove fragrance-free white bar soap with moisturizing lotion built in so that I could gently clean the area without causing irritation; Balance Complex oral supplements to help any internal issues; boric acid suppository capsules to regulate pH; and this oil blend for odor control.I wasn’t sure if any of it would help, but I hit the jackpot! Two months into this treatment system, I got maybe two mild cases of BV. Boric acid suppositories knocked them right out. And......to the main point of this review, this oil blend did WONDERS. It smells SO good, and not in that artificial, perfumy Febreeze way. It is a natural, somewhat herbal-smelling combination of essential oils that (super weird observation) complements my natural scent when I’m infection-free. Another weird observation: it smells very similar to standard Poo-Pourri. That may be an unpleasant parallel to make, but hey, they both incorporate essential oils and excel at trapping odors!It’s also a fantastic mousturizer! In combination with the Dove moisturizing soap, my painful cracked/irritated/torn/raw/scarred skin from years of infections is fully healed! FULLY! I feel unapologetically sexy and beautiful and my confidence has skyrocketed!How I use it:- As a moisturizer after showers and shaving (really working it into the skin instead of just spraying and letting it sit)- Spray a little in my undies for confidence through the day- Spray some more on them just before working out at the gym for peace of mind- Whenever I feel skin irritation or smell anything funky (which is a much rarer ordeal these days)- Spray generously on pads to help control “period smell”If you’re like me, GET THIS. You’re welcome.",
                "reviewVotes": "1,860 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "justbeworks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQYGDCRZDUILT2AGAZRFHI2ZJDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LV1706T69KLO?ASIN=B076BZR74J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent Product",
                "reviewText": "Didn't know what to expect from this spray but am pleased to share that it works well. I prefer a light woodsy (tea tree) scent over florals. The product does as advertised and keeps my private areas fresh and odorless. I highly recommend and will purchase again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Queen C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3D6C6T5YOLSTCM4KKQFX4ELOSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AK3QTCAYPUI1?ASIN=B076BZR74J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2019",
                "reviewTitle": "5.0 out of 5 stars Loveddddddd it!",
                "reviewText": "Ok so I wanted to give myself some time using this product to give an honest review. Due to fibroids I had to have surgery. I'm in my mid 40's so my hormones and ph balance was literally thrown out of whack. I ordered this product in between doctors appointments with my family doctor and obgyn because I couldn't tell if I had symptoms of a UTI, bladder infection or yeast infection. All I know is I was very irritated and frustrated and it kept happening frequently. I was trying everything I could, diflucan, over the counter creams, azo.....you name it. The doctor told me that I could have a condition called some weird name I forgot that can mimic these symptoms. They did labs everything came back normal and I was also sent for and ultra sound of my bladder no treatment given while waiting for these results. Meanwhile this product had arrived very quickly. I was skeptical in ordering it because it's not cheap. Welp to my surprise it's been well over a month and I feel WONDERFUL. It's hard not to be graphic due to the nature of this products purpose so excuse me, but I feel fresh and smell fresh all day. I feel moisturized all day, my symptoms are gone and have not returned. My sex life has even improved. Now to be clear I do not use this as a sexual lubrication! I just feel it has restored my body's natural chemistry for things to work like normal again. Also contrary to the reviews about how it sprays I have no issue. I promise you a little goes a long way. As I said I've been using this product for over a month daily and the bottle is still basically full. After I'm showered and towel dried I spray a full stream in the palm of my clean lotion free hand, from there I use my other clean lotion free hand to distribute it around my front lady parts and then in the back. A little over a week into using this my doctors office called to do a follow up for my symtoms stating that my labs are good and I should also follow up again with my obgyn and probably see a urologist....PSSSHHH....I WAS ALREADY BETTER!!!!! I no longer use any other feminine deodorant sprays and I only wash my lady parts with a natural feminine wash coupled with this. I saved myself over $200 in doctor follow up co pays, prescriptions and other over the counter remedies because this little bottle solved my problem. I will definitely buy this again!",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ABC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 19, 2024",
                "reviewTitle": "Great produce, great smell, great feeling",
                "reviewText": "I have been using All Natural Feminine Spray for some time. I love its smell and the way it feels on my skin and as a lubricant. No more bad smells. I recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 14, 2023",
                "reviewTitle": "il est incroyable",
                "reviewText": "il laisse une bonne odeur toute la journée, l’odeur du produit est assez particulié mais pas désagréable ! et peu de temps après l’avoir appliqué il se camoufle et laisse une odeur plus naturelle !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 13, 2023",
                "reviewTitle": "Gorgeous product!",
                "reviewText": "Bona Dea Naturals feminine spray is a must for me now. I recently ordered a bottle to try as my regular feminine product was becoming boring, needless to say I will be ordering more of this feminine spray.The spray smells so good, it's kind, soft and gentle on your skin and lasts all day long. You don't need to use much either. I have found I feel more confident in myself. Like me if you are a woman of a certain age, this works to take away the body odour we unfortunately acquire!All I can say is try it for yourself 🤗",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mimi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on August 20, 2023",
                "reviewTitle": "It gives it a lemon(citrus) like smell but it doesn’t help the rash",
                "reviewText": "I used the product hoping it will soothe my rashes on the outer part of my vagina after having my periods but it didn’t even do anything it’s like it made it worse and it also takes a long time before you feel comfortable with it and it’s also kinda expensive for it’s price .but if you’re a fan of citrus scent I recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mantelsabine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 5, 2023",
                "reviewTitle": "Sanft",
                "reviewText": "Das Öl ist supersanft und hervorragend für den empfindlichen Intimbereich. Es duftet dezent und ist angenehm. Verhindert tatsächlich Juckreiz. The best",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}