{
    "remaining_requests": 19242,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Aromlife-Strawberry-Feminine-Essential-Moisturizer/dp/B0CJB8X25B",
    "body": {
        "name": "Strawberry Feminine Oil Yoni Essential Oil 1.02 Fl Oz, for Women Ph Balance & Remove Odor, Vaginal Oil for Vaginal Moisturizer",
        "price": "$14.99$14.99 ($14.70$14.70 / Fl Oz) $14.24$14.24 ($13.96$13.96 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Aromlife-Strawberry-Feminine-Essential-Moisturizer/dp/B0CJB8X25B",
        "soldBy": {
            "sellerID": "A32FVXWO2HPNZY",
            "name": "Hiherbs",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A32FVXWO2HPNZY&asin=B0CJB8X25B&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CS534ZVM"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Oal8xxyJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41riMOW3PVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61ypYT4HxaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51p7oIwp fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51d8Y9a1BaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51d0aW2xlLL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Aromlife",
            "link": "https://www.amazon.com/Aromlife/b/ref=bl_dp_s_web_121040294011?ie=UTF8&node=121040294011&field-lbr_brands_browse-bin=Aromlife"
        },
        "brand": "Aromlife",
        "merchantInfo": "Hiherbs",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 1,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 16 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Experience the Pleasure of Our Yoni Oil: A Natural Feminine Oil for Women's Health Discover the transformative power of our Yoni Oil, a specially formulated blend designed to restore and maintain the delicate balance of your intimate area. With a focus on ph balance and wetness, our Yoni Oil offers a holistic approach to feminine care, helping you feel fresh, confident, and irresistibly touchable.",
            "==PH Balance and Wetness: Regain Your Comfort and Confidence== Embrace the soothing embrace of our Yoni Oil as it helps you achieve a natural pH balance and optimal wetness. Infused with all-natural ingredients, including rose petals, rosehip oil, shea butter, jojoba oil, and more, our Yoni Oil provides gentle relief from itching, dryness, and vaginal discomfort. Say goodbye to worries and embrace the comfort and confidence that come with a balanced and nourished intimate area.",
            "==Discover the Secret of Yoni Oil for Wetness and Tightness== Unlock the secrets of enhanced pleasure with our Yoni Oil, thoughtfully crafted to not only address wetness but also provide a tightening effect. Experience heightened sensations and intimacy, empowering you to embrace your sensuality and fully enjoy your intimate moments.",
            "==Say Goodbye to Vaginal Odor with Our Odor Eliminator== Put an end to worries about vaginal odor with our specially designed eliminator. Infused with natural ingredients, our odor eliminator works harmoniously with our Yoni Oil to promote a fresh and clean feeling, boosting your confidence and comfort.",
            "Instructions for Use: Simply apply a few drops of the Yoni Oil to your intimate area or desired areas, and gently massage in a circular motion. For external use only. Discontinue use if irritation occurs. Experience the soothing and sensual sensation of our Strawberry Scented Yoni Oil, and embrace the essence of self-care. Elevate your intimate care routine and treat yourself to the utmost comfort and luxury today!"
        ],
        "description": "Introducing our luxurious and all-natural Yoni Oil, now available in a delightful Strawberry Scent! Crafted with the utmost care and attention to detail, our Yoni Oil is specifically designed to pamper and rejuvenate your most intimate area, providing the ultimate self-care experience. Key Features: Strawberry Scent: Indulge your senses with the sweet and refreshing aroma of ripe strawberries. Our delightful strawberry fragrance transforms your self-care routine into a blissful sensory experience. Premium, Natural Ingredients: We believe in providing only the best for your body, which is why our Yoni Oil is formulated with premium, all-natural ingredients. Infused with botanical extracts and essential oils, it nourishes and soothes the delicate skin of your intimate area. Gentle and Soothing: Our Yoni Oil is carefully formulated to be gentle and non-irritating, making it suitable for all skin types. It provides a soothing touch, helping to alleviate dryness and discomfort, promoting intimate well-being. Moisturizing and Hydrating: Hydration is key to maintaining healthy and happy skin. Our Yoni Oil delivers deep, long-lasting moisturization, keeping your intimate area soft, supple, and well-hydrated. Versatile Use: Apart from its intimate care benefits, our Yoni Oil can be used for massages and as a moisturizing body oil. Its light, non-greasy texture absorbs quickly into the skin, leaving you feeling refreshed and nourished. Discreet Packaging: We understand the importance of privacy, which is why our Yoni Oil comes in discreet packaging, ensuring your purchase is delivered with the utmost confidentiality.y",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Health Care",
                "link": "https://www.amazon.com/Health-Care-Products-Personal/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3760941"
            },
            {
                "name": "Feminine Care",
                "link": "https://www.amazon.com/Feminine-Care/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3779501"
            },
            {
                "name": "Feminine Washes",
                "link": "https://www.amazon.com/Feminine-Washes/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13226755011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.57 x 4.33 x 1.57 inches; 3.6 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ September 14, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Aromlife"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CJB8X25B"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#355,718 in Health & Household (See Top 100 in Health & Household) #523 in Feminine Washes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 1 rating"
            },
            {
                "name": "Brand",
                "value": "Aromlife"
            },
            {
                "name": "Scent",
                "value": "Strawberry"
            },
            {
                "name": "Special Feature",
                "value": "Organic, Aromatherapy, Natural Ingredients"
            },
            {
                "name": "Product Benefits",
                "value": "Moisturizing, Ph Balancing, Rejuvenates, Rejuvenating, Revitalizing"
            },
            {
                "name": "Unit Count",
                "value": "1.02 Fl Oz"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG477QBVOA67YBBGKMNEZEKTNG2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I1FI12U4HZCJ?ASIN=B0CJB8X25B",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Moisturizing",
                "reviewText": "I like using yoni oil pretty much everyday. It helps keep things moisturized, but it also helps with thigh rubbing pain.This peach scent is ok - peach isn’t my favorite - but as far as scents go, it is good (scent is so personal!). The scent lingers long enough for feel fresh, but not overpowering or fake smelling.This one is a bit more expensive than others I have used (I typically spend $7-9).Big fan of yoni oil and will happily keep using and buying!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}