{
    "remaining_requests": 2206,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fault-Our-Stars-John-Green/dp/014242417X",
    "body": {
        "name": "The Fault in Our Stars",
        "price": "$9.09$9.09",
        "originalPrice": "",
        "rawPrice": 9.09,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fault-Our-Stars-John-Green/dp/014242417X",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61fbVx3W5cL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "John Green",
            "link": "https://www.amazon.com/John-Green/e/B0C7LLCRK9/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 160711,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 23 mins",
            "FREE delivery February 29 - March 6 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 4"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Books; Reprint edition (April 8, 2014)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 014242417X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0142424179"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 14 - 17 years"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 850L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 9 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 1.1 x 5.4 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,927 in Books (See Top 100 in Books) #4 in Teen & Young Adult Fiction about Self Esteem & Reliance #24 in Teen & Young Adult Fiction about Death & Dying #85 in Teen & Young Adult Contemporary Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 160,711 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Anthropocene Reviewed Turtles All the Way Down The Fault in Our Stars Looking for Alaska Paper Towns An Abundance of Katherines John Green’s nonfiction debut is a masterful and deeply moving collection of personal essays about falling in love with the world. “The perfect book for right now.” Aza is living within the ever-tightening spiral of her own thoughts. Told with shattering, unflinching clarity, this is a brilliant exploration of love, resilience, and the power of lifelong friendship. “The greatest romance story of this decade.” Hazel and Augustus meet at support group for teens with cancer. Last words and first loves at boarding school. John Green’s award-winning, genre-defining debut. Winner of the Edgar Award. Margo summons Q for an ingenious night of revenge. When the new day breaks, Margo has disappeared. But there are clues—and they’re for Q. An ingeniously layered comic novel about love, friendship, mathematical theorems, and the Archduke Franz Ferdinand.",
                "media_link": []
            },
            {
                "media_text": "John Green: The Complete Collection Box Set The deluxe 5-book set is the definitive collection of John Green’s critically acclaimed fiction.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/698bd32f-a3fa-48ec-a283-670f9891147e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd9e712b-2886-4411-8ac1-8413f7aeb619.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2cf00392-3125-44aa-bb87-11608c01f64e.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/23e5da7d-a889-4979-9e7e-6a49da7d70a7.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07a4b8ca-9475-4382-9ee7-9712e406b72e.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c56d023-2490-4493-91c5-861e08591501.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/106e614e-adba-45cf-a6b8-dc6a7ded9f26.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/11c19b8c-79ac-4295-9304-e68b7a5a102f.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0cf3764f-43be-4c83-a25a-50e758f5b02f.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/941675ab-dc55-4159-aedd-a7853f550532.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56ac2e5e-e2c2-4660-8dc6-2695a5fe76e3.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d1b4214-4d63-459c-8579-1a15a02fb33d.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29379eed-cdee-413f-9425-ac99225d181c.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86e64272-4243-474e-88e8-c5d343bef21c.__CR0,0,300,600_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Adrienne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCTFHX5ZEJ6ZPRKOLOCATMD53QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WUH2X6T5Z5HV?ASIN=014242417X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2016",
                "reviewTitle": "5.0 out of 5 stars The best stories are about memory",
                "reviewText": "The best stories are about memory.The Fault in Our Stars by John Green is quite possibly the best standalone novel I have ever read and is certainly the most phenomenal book I’ve had the privilege to experience in the year 2013. It is my third favorite story and favorite non-fantasy novel. The title comes from Shakespeare’s Julius Caesar, and it sets the perfect tone for this story written in the first person by Hazel, a sixteen year old girl in the regressive stage of lung cancer who nevertheless is required to cart around an oxygen tank because (as she so perfectly puts it) her “lungs suck at being lungs.” Her mother forces her to go to a cancer patient/survivor group where she proceeds to exercise her considerable teenage snark and wit along with her friend Isaac who is suffering from a type of cancer that eventually requires the removal of an eye.One day Hazel catches the attention of a boy named Augustus and their romance is as breathtaking and expedient as it is completely genuine and uncontrived. Augustus has recovered from bone cancer that left him with a prosthetic leg, but did nothing to diminish his spirit. She can scarcely believe he’s as perfect as he projects and indeed feels as though she’s found his hamartia or fatal flaw when he puts a cigarette in his mouth. Hazel is of course livid that anyone who survived cancer would willingly place themselves into its way again, but Augustus never lights them using the act as a metaphor of having “the killing thing right between your teeth, but you not giving it the power to do its killing.”Both of them together have enough wit and snark to drown the world in metaphors and sarcasm with just the barest dash of bitterness for their plight. Hazel whom Augustus calls “Hazel Grace” for most of the novel feels incredibly guilty that she’s allowed Augustus to fall for her as she and her family expect her cancer to return full force at any moment, and yet their relationship parallels the ever moving train of her mortality. So much so that Hazel shares with him that her favorite book is a story by the reclusive author Peter Van Houten called An Imperial Affliction.“My favorite book, by a wide margin, was An Imperial Affliction, but I didn’t like to tell people about it. Sometimes, you read a book and it fills you with this weird evangelical zeal, and you become convinced that the shattered world will never be put back together unless and until all living humans read the book. And then there are books like An Imperial Affliction, which you can’t tell people about, books so special and rare and yours that advertising that affections feels like a betrayal.”Van Houten’s work is very meta to the larger story at hand being about a girl named Anna who suffers from cancer and her one-eyed mother who grows tulips. But Hazel makes it very clear that this is not a cancer book in the same way that The Fault in Our Stars is not a cancer book. Anna grows progressively sicker and her mother falls in love with a Dutch Tulip Man who has a great deal of money and exotic ideas about how to treat Anna’s cancer, but just when the DTM and Anna’s mom are about to possibly get married and Anna is about to start a new treatment, the book ends right in the middle of a-Exactly.This drives Hazel and eventually Augustus up the wall to not know what happened to everyone from Anna’s hamster Sisyphus to Anna herself. Hazel assumes that Anna became too sick to continue writing (the assumption being that her story was first person just as Hazel’s is), but for Van Houten to not have finished it seems like the ultimate literary betrayal.As terrified as Hazel was to share this joy with Augustus (and god knows I understand that feeling) it was the best thing she could’ve done because they now share the obsession and the insistence that the characters deserve an ending.The conversations of Hazel and Augustus are not typical teenage conversations, but they’re not typical teenagers. Mortality flavors all of their discussions and leads to elegance such as“The tales of our exploits will survive as long as the human voice itself. And even after that, when the robots recall the human absurdities of sacrifice and compassion, they will remember us.”They speak of memory and calculate how there are fourteen dead people for everyone alive and realize that remembering fourteen people isn’t that difficult. We could all do that if we tried that way no one has to be forgotten. But will we then fight over who we are allowed to remember? Or will the fourteen just be added to those we can never forget? They read each other the poetry of T.S Eliot, the haunting lines of Prufrock,“We have lingered in the chambers of the seaBy sea-girls wreathed with seaweed red and brownTil human voices wake us, and we drown.”And as Augustus reads Hazel her favorite book she“…fell in love the way you fall asleep: slowly, and then all at once.”The quotes from this story are among the most poignant and beautiful I have ever seen.“Grief does not change you, Hazel. It reveals you.”“There will come a time when all of us are dead. All of us. There will come a time when there are no human beings remaining to remember that anyone ever existed or that our species ever did anything. There will be no one left to remember Aristotle or Cleopatra, let alone you. Everything that we did and built and wrote and thought and discovered will be forgotten and all of this will have been for naught. Maybe that time is coming soon and maybe it is millions of years away, but even if we survive the collapse of our sun, we will not survive forever. There was time before organisms experienced consciousness, and there will be time after. And if the inevitability of human oblivion worries you, I encourage you to ignore it. God knows that’s what everyone else does.”When I finished this I thought to myself, “How am I going to read anything else? How will I find something to match this? How can I pick up another book and not expect it to resonate with this haunting beauty, this tragedy ringed with comic teenage snark and tones that are themselves tragic in their sarcasm like whistling in the ninth circle of hell or laughing uproariously at the monster?” I realized I was lost. I could think of no negative critique unless you count the fact that the two main characters have Dawson’s Creek Syndrome where they’re teenagers who speak as if they were philosophers, but then again Bill Watterson did the same thing with a boy and a stuffed tiger.You realize the story’s hamartia doesn’t matter. That the fact that the plot may be cliched is unimportant and that dwelling on such trivialities is in and of itself a fatal flaw. This story is so much more than the letters and words on each page. It’s the triumph of morning over night when the night grows ever longer. It’s the dream of hope when you’ve done nothing but dine on despair. It is sad? Yes. It is heartbreaking? More so. Is it worth reading? Has anything sad and heartbreaking not been worth reading? The story of Hazel and Augusts deserves to be read just as the story of Anna, her mother, and dear hamster Sisyphus deserves an ending, and that becomes their exploit to seek out reclusive Peter Van Houten so that the characters can be properly laid to rest and remembered.The best stories are about memory.",
                "reviewVotes": "163 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A History of Books",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXC364ISPJO27RUKDU6LLUXTJHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1278L5F573A5M?ASIN=014242417X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 24, 2016",
                "reviewTitle": "5.0 out of 5 stars You're gonna need a box of tissues for this one",
                "reviewText": "I apologize for the lengthiness of this review. There was just so much I had to say concerning this book.The one that rips your emotions apart. The Fault In Our Stars. Many of you have probably heard of this book, and are anticipating the movie. I know I am. I’ve been wanting to watch the movie because I love Shailene Woodley. But since it comes out next week, that means I had to read the book beforehand. (Yes, I’m one of those people that has to read a book before the movie comes out.) That meant embracing something I’ve been putting off for so long. So what did I put off for so long? This is a story about a girl named Hazel Grace who has terminal cancer. She attends support group for cancer, but it just makes her roll her eyes. One night at a normal meeting, she meets a beautiful boy named Augustus Waters. Afterwards, they rewrite each other’s stories.So I’m going to be brutally honest here. I was afraid to read The Fault In Our Stars. I have read so many reviews of this book, and mostly people just talk about how much they cried. And not just cried, but ugly snot dripping out of your nose mixing with your tears cried. I’m afraid of books like this. I guess I’m afraid to get emotionally involved in a book because its going to open up my own personal wounds and emotions, no matter what the subject matter is of the book. But there was another reason why I was afraid to read this book. When it comes to tough topics, like cancer for this book, I am afraid of over cheeziness. I don’t know why, but I despise books where a character goes through a tough journey and the author spits out bits of “inspirational” sentences that are created solely to make a person feel some sort of emotion. I have never found inspiration in these types of books or sentences, and this is probably the fact that I have been overexposed to these kinds of things, and i’m kinda sick of them. I’ve seen many people quote these kinds of books, thinking they are beautiful and true, but never once have I seen people follow these guidelines to life. These are sentences like “He found that he was struggling on his journey but he knew that love would take him where he needs to go, free his soul, if only he could just allow himself…blah blah blah” I’m not trying to take anyones thunder away. If you find solace in these kinds of passages, then by all means, please ignore me. My discrimination against these types of passages is a personal one.But what I loved about this book was that it stripped a lot of these passages apart. Don’t get me wrong, there were some beautiful passages in this book, but it wasn’t the same old inspirational passages that are sometimes found in books about tough topics. What I always found difficult in books about tough topics, was that their struggle became who they were. I always questioned what happened after these characters overcame their obstacles, and I always imagined that they fell apart because their journey was so ingrained in who they were, that there was nothing left after it was over. But thats not what happens in this book. These characters aren’t their sicknesses. I felt endless possibilities for these characters after the book was over, and I was okay with that.I believe that this is a book that you will either love or you will be bored with it and hate it. I’ve heard both sides of the argument. And thats perfectly understandable. Some people aren’t moved by this type of story. I’m going to be honest, I wasn’t as emotional as I thought I would be. There were a few times that I thought I would cry (and believe me, it takes A LOT for me to cry because of a book. And so the fact that it even got me a little close to crying is a very special feat, in my opinion) I know there were people that were balling their eyes out over this. I never felt like this was a book that was written just to make me cry. I believe thats left to the books that become overly cheesy, as was discussed earlier. I just think that there were topics that were inevitable in this book, I mean the topic of the book is cancer and love. Some would argue that those two ingredients are a recipe for disaster. And because I knew that these topics were a part of the book, I wasn’t as emotional as I thought I would be. Now, thats not to say that I didn’t think the book did its job. I think my emotions were completely normal.I really don’t want to discuss the plot line here, because I don’t want to reveal anything. I had my assumptions about what would happen in this book, but I was wrong. I don’t think it was a plot twist or anything, but rather I was just wrong to assume. If you are going to read this book, which I believe many of you are, then I want you to take in what happens to the plot as you read it, and not from some assumptive view from someone whose already read it. I want you to enjoy it as I did.As for the characters. These characters aren’t extraordinary except for the fact that they have/had cancer. And I think thats fantastic. I didn’t want some dramatic story about a person who had accomplished so much in their life and were given the unlucky card of having terminal cancer. These were normal teenagers. This made the story more believable. More relateable. There were ideas and topics in this story that were fathomable to us. Most of us cannot fathom what having cancer is like, but the story is written in such a way that we can arrive at some kind of understanding, and thus a sort of appreciation. We’ve all dealt with situations in life where something was taken from us too early. But thats the beauty of this book. Its a story that becomes an everyday story for some people. Something thats normal for someone else.I am a huge fan of John Green’s work. This is the second book of his that I’ve read, the first being An Abundance of Katherines. I had mentioned earlier that I wanted to read a different John Green book other than TFIOS because I didn’t want that to become the standard in which I compare all his other books. I’m really glad that I did that. While John Green has a fantastic way of writing, each story felt really unique. I sometimes feel that when authors write a new book or series, some things bleed from the other books or series.I’m not going to promise that you will love or hate this book. This is a book that will catch your attention or make your eyes roll. I truly believe it depends on your personal experience and how you choose to relate the book to your own personal experience.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ROBERTO NORIEGA GALINDO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 30, 2023",
                "reviewTitle": "Recomendable",
                "reviewText": "Me gusto mucho",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tanish",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 16, 2024",
                "reviewTitle": "best classic",
                "reviewText": "literally the most heartfelt classic book i have ever read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yvonne - The coycaterpillar Reads",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 4, 2023",
                "reviewTitle": "Wrenching as it is Lyrical!",
                "reviewText": "he Fault in our Stars is wrenching as it is lyrical. A perfect story, with a perfect cast. It will draw readers in and shatter their hearts.This was my first read of The Fault in our Stars it didn’t fail to have me in floods of tears. How is it that this book is so utterly perfect? It captivated my heart and soul and I fell endlessly in love with Augustus and Hazel.I failed to read this book until now because I felt that I wasn’t the intended demographic, but I shouldn’t have feared. Grief and pain is a universal emotion and this story brought it all out. All.of.it.Hazel has been diagnosed with terminal lung cancer; her story is a sad but beautiful one. She doesn’t put herself out there too much, she doesn’t want the impact of her inevitable death to destroy the lives of those around her. Her father doesn’t stop crying and her mother is ultimately worried about the time when she’ll no longer be a mother.She attends a support group for those who are either a survivor of cancer or in active disease. She meets Augustus Waters – a seventeen-year-old boy in remission from disease of the bones. The meeting will change the course of her story – she no longer wants to be the quiet girl slowly dying. She wants to experience everything she can, as quickly as she can. They share their loves together – Hazel shares her passion for the book, An Imperial Affliction. To see a fire be lit in Augustus’ fire at experiencing the book for the first time was glorious.Their mutual love brings them to Amsterdam where they plan to meet with the author of AIA. The meeting doesn’t go to plan. There’s a saying that goes ‘never meet your heroes.’ The author is arrogant, cruel, and less than welcoming. Oh, did I also mention that he is a raving alcoholic. Gus wanted to make all her dreams come true, but dreams rarely come true – life is unfortunately often unfair. They drink champagne, eat luxurious food, and talk about their young lives.Gus drops a bombshell, and it shatters Hazel’s life. It shatters it more than her own dwindling mortality has. Be prepared to have your heart ripped out. Emotions are a fragile thing, and The Fault in our Stars proves that.A book that left me reeling.A book that blew me away.A book that made my stomach ache and churn with longing.A book that made me feel physically sick.A book that made me feel everything.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Krystell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 20, 2023",
                "reviewTitle": "Buen libro",
                "reviewText": "Gustó mucho el libro",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon カスタマー",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on September 24, 2022",
                "reviewTitle": "more than worth it",
                "reviewText": "Its amazing but kinda smells",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.00",
                "sellerName": "FinancialFrontiers",
                "sellerRating": "3.5"
            },
            {
                "price": "$8.18",
                "sellerName": "Murfbooks",
                "sellerRating": "5"
            }
        ]
    }
}