{
    "remaining_requests": 2006,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Roommate/dp/B08Q5X8121",
    "body": {
        "name": "Roommate",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Roommate/dp/B08Q5X8121",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51eEs7uU-nL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sarina Bowen",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Sarina+Bowen"
        },
        "brand": "Sarina Bowen",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4449,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Wanted: One roommate to share a three-bedroom house, split the rent, and ideally not be the guy I can’t stop thinking about. I’m a man with too many secrets, so the last thing I need is a new roommate with a sexy smile and blue eyes that see right through me. Eight years ago, Roderick left town after high school. We’re not friends. I owe him nothing. But back then, I let one of my secrets slip, and he’s the only one who noticed. Part of me knows I should run far, far away. But the other part wants him to come upstairs and spend the night. But if I let him in, I could lose everything. Seeking: a room to rent in town. I’m tidy, have no pets, and I will feed you homemade bread. I should probably add: gay AF, and has no filter. It’s no wonder my new landlord is so wary of me. A smarter man would ignore those hot glances from the broody lumberjack. He may want more from me than another fresh-baked pretzel. But if I push my luck, I’ll end up back on the street. Too bad I’ve never been smart with my heart.... Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "LGBTQ+ Romance",
                "link": "https://www.amazon.com/LGBT-Romance/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13922579011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 5 minutes"
            },
            {
                "name": "Author",
                "value": "Sarina Bowen, Heart Eyes Press LGBTQ"
            },
            {
                "name": "Narrator",
                "value": "Teddy Hamilton, Stephen Dexter"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 12, 2021"
            },
            {
                "name": "Publisher",
                "value": "Tuxbury Publishing LLC"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08Q5X8121"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,264 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #773 in LGBTQ+ Romance (Books) #1,072 in Romance (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kelly Rubidoux",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6DPI7KYGSSZZWDLVD5NRXKS4FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RYJO64CTQ53X?ASIN=B08Q5X8121",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars A Reading the Paranormal Review",
                "reviewText": "Yes! It's Roderick the baker and Kieran the quiet, brooding Shipley and I AM HERE FOR IT. Just to be clear, I read these books out of order, so Roddy and Kieran's coupledom has been happily playing out in the background of the other couples and I am pleased to finally see them in all their unfettered glory. Although, Kieran is pretty fettered when we first meet him. The poor guy's wrapped up tighter than anything and it takes a little time for Roddy to get him to unwind.So. Kieran is quiet and watchful and doesn't quite know how to reconcile his secrets with his want for Roderick. In fact, he tries very hard to not like Roddy at first. Partially because of an incident (or three) from high school and partially because he's never allowed himself to unbend enough to figure out the the person he is. Which sounds odd, but Kieran is locked up as tight with himself as he is to those around him. Roderick returning to town kind of changes that. Well, it started with Kieran taking the step to move out on his own, but Roddy's kindness and acceptance of him gave him the room to figure things out.On Roddy's end, he has a big heart that's a little bruised after his last relationship. The absolute last thing he plans on doing when he rolls into his old hometown is get involved with anybody. Then Kieran offered him a hand up when he needed it most and THINGS STARTED HAPPENING. Soon the two are cooking together and doing other things. Sex-ay things. YES!A whole lot of secrets, family that keeps on giving, pretzels, figuring things out, a man who isn't looking for romance, and another who's all-in once he figures out that Roddy makes him happy. GOOD STUFF!-Kelly @ Reading the Paranormal",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joann ME",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECEFJSRS3YU4SQJOUMCORSFOXPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R170GPCBQZURMS?ASIN=B08Q5X8121",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Eye opener",
                "reviewText": "The emotional drama alone made the story very interesting, many things at play. Although not my cup of tea it was very well written and opened your mind to the emotional world.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amy Dickinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQXF5EMSWUSTTEOXWRP34N7265A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL2DLEVK6JE12?ASIN=B08Q5X8121",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2021",
                "reviewTitle": "5.0 out of 5 stars This is Binge-read Honor",
                "reviewText": "Overall Grade: ⭐️⭐️⭐️⭐️⭐️Anyone who has entered Sarina Bowen’s True North series has met the baker at Zara and Audrey’s Busy Bean: Roderick. The accomplished and talented baker is responsible for their improvement in business and energy. With Sarina Bowen’s newest book, Roommate, we are treated to his story, and in the same vein as her Him and Us’s Wesmie or The Understatement of Years’s Rikker and Graham or even, Top Secret’s Keaton and Luke, we recognize quickly that not all LGBTQA+ couples are created the same. The prodigiousness of Sarina Bowen’s ability to craft diverse couples such as these, along with Roderick and Kieran’s coupleship in Roommate, is the reason that I keep coming back for more.Roommate follows Roderick, the baker for the Busy Bean, and his struggle to find a home, a place where he truly belongs. Having broken off an emotionally abusive relationship and returned home with the hope of acceptance by his parents, he finds out quickly that he is on his own. After struggling to find a job and a place to live initially, Roderick finds employment with the Busy Bean where he begins to find a place to belong. Still struggling to find a place to live, he is saved by his sullen co-worker, Kieran, who has recently begun renting Zara’s rental home. Believing that Kieran doesn’t like him, he is confused at first by this act, but he realizes quickly that there is more to Kieran. As the story unfolds, you find out quickly the reason for Kieran’s quietude.I think what I love most about Roommate is Bowen’s insistence on finding new spaces for her characters. Her wildly successful M/M duet Him and Us shows us one aspect of M/M romance with one character exploring the definition of his sexuality and the other exploring the depths of his ability to love, to do relationships. With her other stories, we find characters who deny themselves out of their worry over being judged in coming out of the closet. In Roommate, Bowen follows a bit of her formula where one character completely acknowledges and lives his sexuality, while the other is still trying to understand it. What I adore in this story is Kieran’s emphatic acceptance of being gay. His struggle isn’t with his sexuality; it’s in exploring the intimacy of relationships with anyone. There are distinct reasons for this in Roommate, reasons you should read the book to consider. Therefore, what Bowen has done in this story is identify a human failing, not one tied to one’s sexuality. To be fair, I haven’t read many other M/M books by diverse authors, so my knowledge is limited, but I appreciate the way that Bowen chalks up Kieran’s issues to familial shortcomings, not recognizing that his sexuality.Similarly, Roderick has been burned in his past. He has been closeted against his volition, so he too struggles with the intimacy of a relationship. He needs it to be out and proud to forgo feeling his insecurity. As his journey progresses, Bowen adeptly illustrates his acceptance of Kieran’s reasons for his silence. It takes some time and creates the tension of this story, but it’s so beautifully wrought that when the epiphany about Kieran is experienced, you fall apart a little feeling the hurts of these two men. For me, that is where the depth of emotion resides, and it deftly does its job as it tears at your heartstrings.And finally, many of the characters you love in the True North series are in this book. My favorite is Griffin. He shows his mettle so explicitly that, should you have any misgivings about him after his own story, it is completely erased in this one.There are so many layers to Roommate, ones that can only be experienced by throwing yourself into this book. I know it’s qualified as a gay romance or an LGBTQ romance, but there is so much more to this story. Sarina Bowen once again has shown how skilled she is at taking the human condition and applying it to the specific lives of people who look and feel and sound like us. In doing so, it connects our own emotions to the trials of her characters, drawing us in and helping us see how we can transcend our own humanness. In the end, Roommate leaves you believing that a life lived on your own terms is the most abundant life.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBSUGWH7MEVVMBMLLWIU7YLXGAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SS99CXYPN8AB?ASIN=B08Q5X8121",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Great story",
                "reviewText": "Great story, cute couple. Will definitely reread!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda Brooks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJGQIR4IWRBZXODNONNR26TZB7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R123CCSLMUS7PL?ASIN=B08Q5X8121",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2023",
                "reviewTitle": "4.0 out of 5 stars 4.3 stars--Love these guys",
                "reviewText": "Summary: Roderick has returned to Vermont after a bad break up in Nashville. After being rejected, again, by his parents, he sleeps in his car until he can find a job. Kieran remembers Roderick from an incident in high school that left him feeling embarrassed. Now, eight years later, having Roderick as a coworker, he’s not only still embarrassed but also worried about Roderick knowing his secret. But when he discovers that Roderick is homeless, he offers him a place to stay despite his discomfort.Review: This is a sweet story. Both men have reasons for not wanting to get into a relationship, and for Kieran for not wanting to even talk to Roderick. It’s pretty funny when Kieran finally does talk to Roderick and learns what he thinks of the incident in high school. I like that they’re given time to get to know each other—that we got to see them spending time together outside the bedroom—I loved their cooking lessons and how they’d just hang out and watch tv together. I loved the relationship that Roderick developed with the priest—that was really fun. Zara and Audrey were really good side characters too. I loved how finally opening up to Roderick gave Kieran the strength to open up in other ways and to fix broken relationships—some that were severed because they were toxic and some that were salvaged by being willing to communicate for once. It was lovely to see Kieran standing up for himself instead of continuing to just go along with what everyone expected.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Haley Janssen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVI75MP3GBVOSCB2GW2DIGZGOOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH2IFZ0HV9UGG?ASIN=B08Q5X8121",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "3.0 out of 5 stars Roommate",
                "reviewText": "MM romance and I opted for the audio 🎧 easy to listen to, some spice and plot, what else could you ask for",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana Carolina de Sousa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 23, 2021",
                "reviewTitle": "Loved it",
                "reviewText": "SO EXCITING!!! At first I was afraid, but as I read it I fell in love with the story!! Kieran is so cute, a dream's boyfriend. Roderick is so lovely, awwn, I wanted to hug him and tell him how valuable he was and how he deserved to be happy. I was afraid he would end up getting hurt to be with Kieran, but luckily he learned his lesson and Kieran, once again, showed how wonderful he is and didn't pressure him. Their story is beautiful, cute and well developed. One of the best I've read this year!Shout out from Brazil!!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Book Nut",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 12, 2021",
                "reviewTitle": "Surprisingly sweet.",
                "reviewText": "Love this author and this book didn't disappoint. A sweet, believable romance that built over time, wasn't rushed, and all came down to a believable conclusion. Great book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lois K",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 6, 2024",
                "reviewTitle": "Worth Waiting For",
                "reviewText": "My first Sarina Bowen book and I loved it. Rod and Kieran are great guys with such good chemistry. Side characters are fun. Laugh out loud moments and a few tears. My favourite type of romance",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Silvana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on March 25, 2023",
                "reviewTitle": "One of my favourite books!!",
                "reviewText": "This one of my M/M favourites and I revisit it quite a lot. I adore how these two complement each other and they way their relationship progresses in a slow-burn type romance makes me swoon every time. Absolutely adore the audiobook, btw. I've listened to it 2 or 3 times and I'll re-listen again in the future, no doubts. Thank you, Sarina!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SP v.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 3, 2021",
                "reviewTitle": "Male to male steamy romance novel",
                "reviewText": "A cool story for casual reading. However, the last chapter in book is superfluous. The book should have ended at the second last chapter.Also, authors must really learn to use the apostrophe correctly. 'The car's here' doew not equal 'The car is here'. Really authors, editors and publishers-use proper English.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}