{
    "remaining_requests": 2292,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Regretting-You-Colleen-Hoover/dp/1542016428",
    "body": {
        "name": "Regretting You",
        "price": "$8.29$8.29",
        "originalPrice": "",
        "rawPrice": 8.29,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Regretting-You-Colleen-Hoover/dp/1542016428",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51RsJKhbSBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51ogcIRla3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/414i-QZk5OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LYM6z2JcL.jpg",
            "https://m.media-amazon.com/images/I/51dQ4OVMYGL._SX35_SY46.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Colleen Hoover",
            "link": "https://www.amazon.com/Colleen-Hoover/e/B006SKAK42/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 152501,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 32 mins",
            "FREE delivery March 1 - 7 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 4"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Montlake (December 10, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 365 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1542016428"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1542016421"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#536 in Books (See Top 100 in Books) #47 in Contemporary Women Fiction #64 in Women's Domestic Life Fiction #484 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 152,501 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Turesa Lewis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNPMHBE6BTLVXICW4LXMNV3QLFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SDGZO2QSUEIR?ASIN=1542016428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Story",
                "reviewText": "As I read this story I started to imagine myself in this situation. When you're in a marriage with love and companionship why would you look for signs of infedilty. The signs was there but she chose to ignore them, maybe maybe not. As an older sister you try to help providing assistance as much as possible. The author gave us the point of view from two people the mother and the daughter. The daughter was down right disrespectful. As a parent we work hard to protect our children both physically and emotionally. Throughout the story the mothers goal was to protect her her daughter emotionally. I started to dislike the teenager who thought she knew it all. I was once a teenager who thought I knew everything, but I didn't. I enjoyed reading this story I really like the ending.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelsey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMGY6I6PEAUR7HL4YHPUBOUSJDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P2XMFBA65ZFT?ASIN=1542016428",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Regretting You",
                "reviewText": "3.5/5 stars ⭐️⭐️⭐️✨Colleen Hoover is the queen 👑 of drama, and this book is full of it! This wasn’t my favorite CoHo book, but it was enjoyable and sucked me right in like every other CoHo book!Morgan and her teenage daughter, Clara, couldn’t be more opposite, and constantly butt heads. One day the unthinkable happens when Morgan’s husband, Clara’s father, Chris, dies in a tragic accident and Morgan and Clara are left picking up the pieces of their lives. Not only is Morgan in utter shock from losing her husband, she also uncovers a painful secret about him that she vows to protect Clara from at all cost. Overwhelmed with grief and sadness, Clara finds solace in a new boyfriend, but is suddenly getting into trouble and lashing out. Morgan also finds herself turning to an unexpected man from her past. Will Morgan and Clara ever work through their grief and repair their strained relationship? And maybe find love along the way?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erica J. Evans ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYUS2RK7NNBXZ5FU2K57NWP6KGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CEXF0KERZMGP?ASIN=1542016428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Epic… 10 out of 10… could NOT put it down!",
                "reviewText": "I read a LOT of books…. This book by far just raised the bar! Colleen Hoover is QUEEN of romance, but this one had humor, as well as drama and romance all wrapped in one gift perfectly presented with the biggest bow… the kind you can’t wait to open when you see it but also don’t want to open it because it’s so pretty. I felt like that when I reading… the experience of reading the book… living their story… I couldn’t wait to see how the story played out but I also didn’t want it to be over. It’s the kind of book that makes you stay up until 3 in the morning reading even though you have to get up for work at 6. Yes, it’s that good. Btw… I also, am not a fan of orange. Iykyk#ColleenHooversBESTbookEvER",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGS3LNULYUO62X6DME2C526BN7EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3A92LPHYK4XGZ?ASIN=1542016428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars another amazing read from Colleen Hoover",
                "reviewText": "I’ve read several of Colleen’s books recently and I simply can’t devour them fast enough. While they are an easy read they also make me think in ways that other easy reads don’t! Her novels have incredible substance while being extremely easy to read. Highly recommend. Can’t wait for my next read from her!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fisherbabe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWPWPFX5Y3FXAN5KLO3GHWG3BXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8DA8VJ85ZS6H?ASIN=1542016428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Angsty and hard hitting",
                "reviewText": "Colleen Hoover knows how to break your heart, then sticky tape it all back together.This story is about Miller and Clara, Morgan and Jonah, and how they deal with the aftermath of a family tragedy.Great characters, interesting plot, and the big question, how will Ms Hoover bring it back from the brink of disaster before the end of the book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dana Ruch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWQNGZFSK3YUXLEYRAH7MF4VOAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14GJMFDXC5CPI?ASIN=1542016428",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "4.0 out of 5 stars not my fav coho book but still good",
                "reviewText": "Not my fav coho book but still good. Clara’s character drove me nuts sometimes. I tried to rationalize that she is a teen, but man I wanted to punch her sometimes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKCOJVDIMWERJZ755PXKGBIJRYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6JXES9NBGK7I?ASIN=1542016428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Too Much Yet Not Enough",
                "reviewText": "This book was a difficult read. There were truly some moments I had to take a break because it was all too much. I could not stop though. As with every CoHo book, it's not something you can quit on.Through all the bittersweet, epic and heavy moments, there are beautiful moments which steal your heart and trigger tears of joy.I absolutely do not regret reading this.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leka",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQHW73XGRGUGE6DHEODE5BZYGYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAH8KN5TW31O8?ASIN=1542016428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars When it’s meant to be.. it will be",
                "reviewText": "True LOVE will always win. When it’s meant to be it will return to you in full circle.I wish there was a part 2 with Miller and Clair",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marie-Claude PaquetteMarie-Claude Paquette",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2024",
                "reviewTitle": "Orange",
                "reviewText": "I just finished the book with one word stuck in my mind, orange. Let’s be honest, Miller looked like a creepy guy with his film. He began to film Clara when she was 14 and when he was with Shelby, his ex-girlfriend. But it is also cute. He is also mature for his age compare to Clara who acted like a totally immature teenager, taking thing personally and judging without understanding. She was so hard on her mother and wanting to ‘murder her’ for things she hadn’t done. We know in the end she regrets how she treated her mom. Her mom was the one keeping all things for herself and hurting a lot inside. The lost of her husband and sister had been difficult for all the family. One thing I wished to see in the book is to know what the letters said about Chris and Jenny, to have answers because in this real world we all want to know to be able to move on. I was disappointed about that, she destroyed the letters. Another thing is, there’s too much about Clara and Miller. Why not more about Morgan and Jonah? Some spicy scenes and their future. Did Morgan finally got the job? Did she finally go to college? Will she marry Jonah? It was more a book for teenagers than adults. I saw the review and we are more adults readers than teenagers. This is why some are disappointed. Still a good story and I won’t stop reading books from Colleen Hoover",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WOlNpzksL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Viviane Sabino",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 23, 2023",
                "reviewTitle": "A Captivating Journey of Empathy and Resilience - Regretting You by Colleen Hoover",
                "reviewText": "Regretting You, is a book that resonates deeply with the reader's soul. This poignant and heartfelt novel takes us on an intimate exploration of love, sacrifice, and the indomitable spirit of women.From the very first page, Hoover's words wrap around you like a warm embrace. As a female reader, I found myself immediately drawn to her relatable characters and their emotional struggles. The story revolves around Morgan Grant, a fiercely devoted mother who faces unimaginable challenges after tragedy strikes her family. The way Hoover portrays Morgan's journey touched me on a deeply personal level.What sets Regretting You apart is its authentic portrayal of the complexities of relationships between mothers and daughters. As women, we often grapple with the delicate balance between our own desires and aspirations while simultaneously caring for our loved ones. Morgan's selflessness in putting her daughter Clara first was both inspiring and heartbreaking to witness.The emotional depth that permeates this novel is nothing short of remarkable. Hoover delves into themes such as grief, regret, growth, and forgiveness with such precision that it feels as if she has reached into the depths of our hearts and laid bare our own experiences. Through Morgan's story, I found solace in knowing that it's okay to struggle with conflicting emotions and make mistakes along our journey.The strength of female bonds is beautifully depicted in Regretting You. The complex relationship between Morgan and Clara serves as a reminder that even amidst misunderstandings or disagreements, love prevails in the end. Witnessing their growth as individuals while navigating their shared pain was both empowering and cathartic.Colleen Hoover's masterful storytelling ensures that every page leaves you yearning for more answers while simultaneously dreading the potential heartache ahead. The pacing is perfectly crafted, allowing the emotional tension to build and unravel at just the right moments. As a female reader, I found myself fully invested in these characters' lives, eagerly turning each page to discover their fates.Regretting You is more than just a book; it's an emotional journey that invites us to reflect on our own lives. It reminds us of the strength we possess as women and the resilience we display in the face of adversity. Colleen Hoover's exquisite writing style effortlessly transports us into a world where we can find solace, understanding, and hope.In closing, Regretting You is an incredibly moving novel that speaks directly to the hearts of female readers. Its relatable characters, thought-provoking themes, and powerful storytelling make it a must-read for any woman seeking an emotional connection with literature. Prepare yourself for laughter, tears, and a renewed appreciation for the indomitable spirit of women as you immerse yourself in this captivating tale.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Natalie Gibert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 12, 2024",
                "reviewTitle": "such a good storyline",
                "reviewText": "Loved the story, didn’t see it coming until it hit me. Had me gripped well into the early hours waiting to see when it was all going to come together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mona",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 21, 2024",
                "reviewTitle": "Nice",
                "reviewText": "Nice and cozy Roman",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 9, 2024",
                "reviewTitle": "Good",
                "reviewText": "Can't read without feeling the pain of characters and the urge of readers to finally reveal the truth... Nice one",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$3.50",
                "sellerName": "Big River Books LLC",
                "sellerRating": "5"
            }
        ]
    }
}