{
    "remaining_requests": 2133,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Very-Typical-Family-Novel-ebook/dp/B09NCNW91J",
    "body": {
        "name": "A Very Typical Family: A Novel",
        "price": "$3.61",
        "originalPrice": "",
        "rawPrice": 3.61,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Very-Typical-Family-Novel-ebook/dp/B09NCNW91J",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81LO0DPOmeL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sierra Godfrey",
            "link": "https://www.amazon.com/Sierra-Godfrey/e/B09NP57NT3/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 1360,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09NCNW91J"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Sourcebooks Landmark (September 13, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 13, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5206 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 445 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1728264960"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#266,865 in Kindle Store (See Top 100 in Kindle Store) #5,097 in Family Life Fiction (Books) #5,999 in Contemporary Women's Fiction #8,226 in Contemporary Women Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 1,360 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bcbb891c-07f0-4ac8-9a49-32b3ff9b4510.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/41901208-93f1-4716-8366-424729a909da.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7abc6796-c72b-45b0-b31f-243c88f2f39f.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "jesica love",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJBXZ5ZZ2AHKVQVE2NTGZXERMHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IUO4IJW3XJ5L?ASIN=B09NCNW91J",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2023",
                "reviewTitle": "4.0 out of 5 stars I liked it, but the proofreader should be fired.",
                "reviewText": "On the day she is set to receive her promotion, Natalie has to pretend not to be horrified when it goes to her boyfriend Paul. She then goes home and finds a letter from attorney saying that her mother has died and she and her siblings have to be together in their house to receive the home. Her siblings who have not spoken to her since she sent them to prison 15 years ago.This one is about family bonds and the mistakes we make and how to move past them. It is also about the consequences of our actions and what carrying guilt can do to a person. The three siblings have all led different lives these past 15 years. Will they be able to come together like they were before That Night?Trigger alert -this book also talks about abuse, both from a gaslighting boyfriend and a physically abusive husband. Two different types of abuse, but abuse all the same. There are links and numbers to call if you or a loved one need help.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marsha C Dummer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOYT57DYODCTZSNTUEKTVJ4Z36Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17XTWMF3HEQB2?ASIN=B09NCNW91J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars AWESOME Story!",
                "reviewText": "Loved this book. The first page grabbed me. Could not put it down. Such a sweet story about a typical family. Reminded me of my family in ways. Thank You for writing this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doctor Moss",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRKSQT7TTMAT4BROWT3MIEOEJ4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3XETYVXQBI9?ASIN=B09NCNW91J",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2022",
                "reviewTitle": "3.0 out of 5 stars Healing in Santa Cruz",
                "reviewText": "I have to admit this is not really my kind of book. I was attracted to it because it is set not just in the town where I live, but in the neighborhood where I live, the lower westside of Santa Cruz, California.The plot centers on a broken family. Natalie Walker is the main character. When Natalie was a teenager, her older brother (Jake) and sister (Lynn) hosted a heavy drug party at their family house, when their mother was away. Things went bad when Natalie returned home that night, against her brother and sister’s orders.Natalie ended up calling 911 in a panic, and then things got REALLY bad. Jake and Lynn ended up charged in their friend Carlos’s death by OD. They went to prison for manslaughter, and Natalie was given an indefinite sentence of ostracism and guilt.Natalie, Jake, and Lynn all have separate lives now. But that night haunts every facet of Natalie’s life. Nothing else — her career, her romantic life, her sense of home — will ever be right until she finds some resolution to that broken family. Even her mother does not want to see her.The trigger is her mother’s death. In her will, Natalie’s mother has left the family house, a seven bedroom Victorian a block from the ocean in Santa Cruz, to Jake, Lynn, and Natalie on the condition that they all get together at the house and meet to claim it with the lawyer administering the will.Natalie has a raft of problems to resolve — she’s leaving a difficult job situation in Boston, in a career she doesn’t really like all that much, a boyfriend who has gotten the job promotion she was hoping for, and a generally unfulfilling life. Once she reaches Santa Cruz to help fulfill the conditions of the will, her cat even goes missing.As does her brother Jake. Lynn shows up at the house, and the stress between Natalie and Lynn begins to ramp down, with the help of Lynn’s young son, Kit. Really Kit is the emotional catalyst for everything that happens from then on in the story.Jake has obviously had problems. After all, he spent time in prison, and even though he now has a burgeoning, successful career as a marine biologist in Santa Cruz, he’s got scars.Lynn is worse. A bad marriage, an angry, abusive husband, a danger to both her and Kit.That’s the mess. From there, it is a see-saw of feel good, feel bad, feel good, feel bad, . . . story, with Natalie simultaneously trying to find Jake so that the terms of the will can be satisfied, repair her relationship with Jake and Lynn, resolve her relationship with her boyfriend in Boston, and deal with that not-so-great job situation there as well (where, just to top it off, her boyfriend will now be her boss). And find her missing cat!And there’s also Asier Casillas (Dr. Casillas), a researcher at Jake’s marine biology lab, a spark of new romantic interest, and, together with Santa Cruz itself, maybe the spark for a completely different direction in life for Natalie.Santa Cruz itself is as much a character in the story as the people. Its beaches, funky charm, and the fact that it still feels like home to Natalie.Stories of troubled family relationships and romantic choices are not especially in my target reading zone, so I’m not going to pretend to say how other readers might like the story. It’s engaging, you spend your time in Natalie’s emotional world, certainly something different for me.The one thing I will say is that this is a novel with a point. There are other novels in which the author seems to create characters and a situation with its own autonomy, that will run wherever it will on its own. Godfrey, though, really wanted to take this story in a particular direction and convey a message. That’s her passion here.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne Baird",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRN4G423VNDCEZ2GSZMO3VCFVKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R344SGRJG8BTNF?ASIN=B09NCNW91J",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2023",
                "reviewTitle": "4.0 out of 5 stars An Entertaining Read",
                "reviewText": "An entertaining read with all sorts of twists and turns! I can see why my book club suggested this book, as it leads to good discussions on family and work dynamics, friendships, and relationships in compromising situations!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P.MC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVAIOSCB4Y7PPFTWFMWJFBGDCDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9LHU10QGNFNQ?ASIN=B09NCNW91J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Sierra Godfrey is a gifted author. This is a great book.",
                "reviewText": "This is the second book that I have read by this author and I am hoping that she'll be writing many more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "delo007",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFITS5PYMWZKLHKHWZYYZX5IR7CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBYJ9YY4ILZT9?ASIN=B09NCNW91J",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2023",
                "reviewTitle": "3.0 out of 5 stars Cute, predictable story",
                "reviewText": "A veritable summer read, nothing too taxing. The family dynamics illustrate the pitfalls of making assumptions about another person's thoughts and intentions.There are depictions of relationship violence and manipulation.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHNNO63ASSK3NWRFIR6JUUVF6BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NPS9A510PFJQ?ASIN=B09NCNW91J",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Good Book",
                "reviewText": "I enjoyed the book overall. I got very frustrated with the controlling men in the story, but I appreciated the way she portrayed the pull and difficulty in leaving. I felt that near the end of the book it got rushed compared to the rest of the book; almost as if the author decided it was time to wrap the book up and just \"finish\" the remaining turmoil. Yes, Jake had changed the most and \"healed\" from going to jail, but I felt it was too easy compared to the earlier part of the book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dfreeman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQX2SYIK6WQR7R3O2L4JVGJQONA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NK7UL1OUIVJD?ASIN=B09NCNW91J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2022",
                "reviewTitle": "5.0 out of 5 stars Engaging read",
                "reviewText": "The Walker family in Sierra Godfrey’s debut novel, A Very Typical Family, are the victims of “One False Step.” That step you take with assurance, but the instant your foot hits the ground, you know with cold, spine-tingling certainty that it was a bad move. A move with repercussions that will adversely affect your life from that moment on. For the Walkers, that false step was That Night At The House. Two of the three siblings went to prison. The third, Natalie, isolated herself on the other side of the country. The family was broken.Then fifteen years later, their mother dies and leaves them her house. The three of them must collect their inheritance together. Somehow, they have to do the impossible, overcome that false step and all its repercussions. If this sounds sad and heavy, it isn’t. Sierra Godfrey deftly reweaves the threads from this tragic backstory into a relatable, enjoyable novel that keeps you glued to the pages to the very satisfying end. Even though the book deals with issues of pain, regret, and remorse it is a remarkably happy story that will leave you with a smile. I don’t know how the author did this, but I’m eager to see her do it again!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}