{
    "remaining_requests": 2277,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-My-Phony-Valentine/dp/B0CQ6FC3WL",
    "body": {
        "name": "My Phony Valentine",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-My-Phony-Valentine/dp/B0CQ6FC3WL",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51fx3xL2vNL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Courtney Walsh",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Courtney+Walsh&search-alias=audible"
        },
        "brand": "Courtney Walsh&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2577,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A chance meeting. A hunky hockey player. A fake romance.Hardly an ordinary day in the life of Poppy Hart.My days usually consist of agonizing over my failing restaurant, worrying about my mountain of debt, and nursing my broken heart.Everything changes when I bump into a man in the coffee shop and claim him as my new boyfriend. To my absolute horror, he turns out to be hockey's most renowned bad boy, Dallas Burke. To my absolute delight, he goes along with my story.When his no-nonsense manager and meddling grandmother jump in the picture, they see a win-win solution for my failing restaurant and Dallas's less-than-stellar reputation: A full-fledged fake romance complete with contract negotiations, pretend dates, and phony PDA.As I get to know the real Dallas Burke, who is not the man the press says he is, it becomes clear that if this isn't real...someone better tell it to my heart. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/Contemporary-Romance-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13354"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 54 minutes"
            },
            {
                "name": "Author",
                "value": "Courtney Walsh"
            },
            {
                "name": "Narrator",
                "value": "Jorjeana Marie, Alex Kydd"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 30, 2024"
            },
            {
                "name": "Publisher",
                "value": "Podium Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0CQ6FC3WL"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,285 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #37 in Sports Romance (Audible Books & Originals) #102 in Romantic Comedy (Audible Books & Originals) #315 in Contemporary Romance (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Erin H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGC57D6G3RWYHP5SY24EKFCCJONA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R397XWDEG4RJFI?ASIN=B0CQ6FC3WL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved it so much!",
                "reviewText": "Poppy Hart is trying to get her life back together after a small town scandal. And when her high school bully won’t leave her alone, she takes the arm of a stranger and says he’s her boyfriend. Unfortunately (or fortunately) it’s hockey bad boy Dallas Burke. And Dallas is in need of a reputation overhaul. His agent sees a relationship with sweet, small town chef Poppy as the perfect way to change his image. A fake dating contract is signed. But as the weeks go by Poppy and Dallas start to feel like there is less pretending happening and more falling in love.This book made me so happy and giddy every time I picked it up. It was an absolute delight! I loved it. So sweet and uncomplicated. Well, a little complicated, fake dating, right? But still so low drama it was wonderful! Dallas is sweet and swoony. Poppy is a little awkward but a whole bunch of cute and wholesome. They just worked so well together. They had great banter and a sweet friendship formed as they were trying to deny their feelings for each other. I just loved their chemistry and how open they were at the end. No third act break-up! I also loved Poppy’s family and Dallas’s grandma. I wanted a smidge more from the epilogue, but it was still really satisfying, and I hope we see more of these two in the next books. (I’ve already pre-ordered Eloise’s book.)If you’re looking for a low drama, sweet hockey romance for this Valentine’s Day then pick this book up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chip",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKAE5KOGLBAKT6XYDREDJWSRUKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1404NS9IRYD02?ASIN=B0CQ6FC3WL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "4.0 out of 5 stars My Phony Valentine",
                "reviewText": "Girl next door meets famous hockey player. Super sweet fake-romance-turns-real set right around Valentine’s Day. Gram was my absolute favorite with her know-it-all wisdom. I loved how the MCs both grew throughout the book with the help of the other. Would recommend for a sweet holiday romance.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Dominick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKVWCS3W2AQMTEG4HBS67IYGYCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4NGVFMKO8JE2?ASIN=B0CQ6FC3WL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Poppy and Dallas",
                "reviewText": "Book ReviewMy Phony ValentineBy Courtney WalshFor starters this book takes place in Loveland, how perfect is that! When Margot ends up behind Poppy in line at the coffee shop and begins giving Poppy a hard time, Poppy does what any girl would do and reaches for the hot hockey player standing in front of her.This is a girl next door meets a misunderstood grumpy hockey player. It turns out they are both misunderstood and could both use some help from each other.I love the way Dallas plays along right off the bat and how they fall into a cozy routine. Also, when he said grace before dinner, that was it for me, I knew I loved him.The writing is so well done, the flow of the relationship is realistic and how they both feel comfortable enough to tell their difficult pasts made me so happy for them. Dallas is so different than his reputation portrayed him. He is kind, gentle, generous, and very protective of Poppy.Poppy is genuine, caring, honest, and fits right in the wives and girlfriends of the other hockey players. She wants to help Dallas and his Gram. She also wants her restaurant to succeed. She is stronger than anyone else gives her credit for, but she also has low self-esteem.This was a fun read that flowed well without a dull moment. If you are in the mood for a sweet small town romance, you need to read this. Thank you Courtney Walsh for creating Dallas and Poppy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wren Woodland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFZRA6S5KIBGG5YZINSSFJL77LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JOKYYXC5RQ01?ASIN=B0CQ6FC3WL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great fake relationship",
                "reviewText": "This should come with a warning! Once you start reading you won’t be able to put it down!Poppy is a sweet girl next door who’s had it with the high school mean girl who has never moved on, with a conniving ex who stole her money and those of her friends and has a fake relationship with hockey’s bad boy. Dallas has had more bad cards dealt him than anyone should, it makes him a star on ice but also a powder keg set to explode. Poppy’s restaurant is about to fold after said ex did his thing and Dallas needs some serious PR work, but they are doing this on their terms not anyone else’s.There are some seriously funny moments and lots of comic relief provided by the local online gossip rag providing local news. Buts there’s also a look at overcoming and forgiving the past, and not being afraid of skeletons of the past. There’s also a great set of side characters including her family and his teammates and their wives. I love how the fact her dad is deaf isn’t made a big deal of, but signing becomes a part of the story. Clean.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adrienne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ2XNAOZYD5PE5P5C4UDSO6FCGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18VHQ8YYBJFZA?ASIN=B0CQ6FC3WL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2024",
                "reviewTitle": "5.0 out of 5 stars loved it!",
                "reviewText": "I absolutely devoured this book! I LOVED it! Just everything about it drew me in. I loved Poppy and Dallas, and Dallas' grandma is a hoot. I just loved how Poppy and Dallas really came to care about each other, to be friends who supported each other and how that developed into more. There were so many lines that just had me laughing out loud. It was just such a pleasure to read this book. My only (really tiny because I liked the rest of it so much I didn't even care) quibble would be that the conflict with one of his teammates that is such a big deal for Dallas at the beginning of the book just kinda falls away with no real explanation. While something like that might have bothered me a lot in another situation, I really did love the book so much that it was easier not to be bothered by that. Again, this was just tons of fun and I loved it. An easy five stars from me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LaurynGLaurynG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKZGDILSVA7RCFG2QNM5FXHAXUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JJDL0W3N50UJ?ASIN=B0CQ6FC3WL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars The pages keep falling out but 5/5 star read",
                "reviewText": "If you get the physical book the pages fall out not even fully done.I would recommend this novel though it's perfect",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61os4ZbI-jL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Esther Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJUH6DV2CA62XXA56Y3P3LFYRRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GHIXXJMMHPPB?ASIN=B0CQ6FC3WL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars fake dating hockey romance done right",
                "reviewText": "Ever run into your high school mean girl while waiting for coffee and she goes full Regina George on you? Two edged compliment insults flying over and over? And your life really doesn’t offer much protection in the form of “well I’m actually doing really well.” Poppy finds herself in that situation and grasps desperately at the handsome guy in line in front of her. Not realizing it’s hockey’s bad boy, Dallas Burke.Dallas is lost. Hockey’s bad boy isn’t actually a bad boy. He’s just trying to muddle through some deep trauma from his past. He finds Poppy cute and happily steps in to stop the sequel from Mean Girls happening in the coffee shop that day.This starts a month of friendship and fake dating to help each other out, and you can just imagine how that ends up going.This book is sweet. Closed door, with characters that are relatable, multifaceted, and sincere. You find yourself rooting for the two to sort things out.It’s worth the read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Parkland Mom",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 11, 2024",
                "reviewTitle": "Fabulous clean fiction!",
                "reviewText": "This is my 14th book of 2024: (How ironic that it is book 14 and about Valentine’s Day! Lol!). This is book 1 in a series called Holidays with Hart.I thought it would be fun to read a Valentine’s Day-themed book close to Feb. 14th and I always enjoy this author’s books. I needed something fun and I knew this author would deliver. Besides, book 2 is coming out soon and I need to be ahead of the 8-ball, not behind! This is a clean romance and published independently.Not only is this book truly laugh-out-loud-funny in many places, it also has swoony romance. Yet it deals with real pain—how our lives are affected and shaped by it. This novel includes wonderful family elements and a real sense of community. Well, with two exceptions to the positive part of real community: Margot the Meanie and the horrid and intrusive gossip rag! Yet every community has its negatives. I am glad Margot gets a dose of reality but the person or persons behind the gossip rag are due for theirs in the upcoming books.Poppy is such a breath of fresh air and it’s easy to see how her and Burke become fast friends. Both have been affected by trust issues. They get each other and bring out the best in each other. Burke is a true hero and a balance of all the good things. His little surprise at the dance was E-P-I-C!!! Burke’s Gram is completely awesome and is a scene stealer! The sisters personalities and approaches are all so different yet their bond is solid. Bringing sign language into the book via the sisters’ dad was something I truly appreciated.As I read this novel, I laughed. I teared up. I cheered. And, I swooned. How could I not give it five stars? I am excited for book 2 and the younger Hart sister’s story.PS - I do want to point out that the capital city of my Canadian province was mentioned and that was fun! However, I do take issue with the comment about Canadians not liking ice cream. Lol! We may have a lot of snow and ice but we love our ice cream. We aren’t savages!! lol!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elegant Fantasy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 15, 2023",
                "reviewTitle": "So sweet!",
                "reviewText": "I always adore the author's writing. Her stories always manage to reel me in. If you love a small town romance with a meddlesome matchmaker grandma trying to match her bad boy hockey player grandson with the woman he asked to be his private chef this one's for you! Poppy & Dallas fit together. She bought the much needed calm to his stormy life. I appreciated the way they went from being strangers to friends to lovers. In the entirety of their friendship I loved how they helped each other grow out of the past. The book was lighthearted, drama free and was filled with friendship and familial vibes. While, it was quite predictable I still enjoyed it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mum of two",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2023",
                "reviewTitle": "Loved it!",
                "reviewText": "When Poppy, a talented chef, is accosted by a bitter not-friend from school in a coffee shop one morning, she takes charge. By grabbing the man in front of her and calling him Sugar Bear. Dallas, a professional hockey player, wasn’t expecting anything except a coffee, however he plays along with Poppy. All of a sudden they’re in a fake relationship with a written contract. What could possibly go wrong?I dove into this book and couldn’t put it down. Courtney Walsh has written a fun, banter-filled and captivating novel. And Poppy has two sisters who I’m hoping both get their own stories!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nikki - @teawithabooknerd ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 10, 2023",
                "reviewTitle": "Courtney is a genius!",
                "reviewText": "📚Book Review📚🏒🍳My Phony Valentine by Courtney Walsh🍳🏒I need to start by saying, Courtney you are a genius! I loved every page of this book.I had only just finished reading a book which I had to follow closed door modifications and wished that the bad boy had a cleaner mouth and then I found this book!This book literally had everything I love:✅Hilarious meet-cute;✅Misunderstood bad boy;✅Meddling Grandma who always knows best;✅Multiple embarrassing but cute and adorable moments between the MCsAnd more…When Poppy pretends that she’s dating the guy in front of her at the coffee shop to save face she gets more than she bargains for when she ends up becoming the fake girlfriend of Dallas Burke, hockey’s own bad boy.When the carefully drawn contract terms are blurred (all in the name of practice 😘) and Poppy and Dallas spend more time together they both start to consider the possibility of something real.🌟Rating: ⭐️⭐️⭐️⭐️⭐️✍️ Fave quote: “Adulting is hard. Even at twenty-eight, I haven’t mastered it. There are moments when I don't want to be strong, or independent, or responsible. There are moments I want someone else to take the risk, or make the decision, or tell me what to do.”I think we can all relate and take comfort in this. Despite some pressures to act as if we can do it all on our own, I think there is a strength in admitting that we all need to be taken care of once in a while.My only negative was that I wished the book was longer which I don’t think really counts 😂 Now…how long do we need to wait for the next book?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan Mason",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 18, 2023",
                "reviewTitle": "A Charming Romance",
                "reviewText": "Loved this story! The quriky characters, the swoony love story, and the meddling grandmother!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}