{
    "remaining_requests": 2195,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beneath-Stars-Second-Romance-Sugarlake/dp/1734999403",
    "body": {
        "name": "Beneath the Stars: A Small Town Second Chance Romance (Sugarlake Series, Book One)",
        "price": "$15.99$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beneath-Stars-Second-Romance-Sugarlake/dp/1734999403",
        "soldBy": {
            "sellerID": "A24GQORVTOOH4P",
            "name": "Vivé Liber Books LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A24GQORVTOOH4P"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51bW iCmFJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Ku9vjT-KL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Emily McIntire",
            "link": "https://www.amazon.com/Emily-McIntire/e/B08CZDLXRM/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Vivé Liber Books LLC",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 5692,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 18 hrs 22 mins",
            "$3.99 delivery February 27 - 28."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/Contemporary-Romance-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13354"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Emily McIntire (August 27, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 412 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1734999403"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1734999402"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.15 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1.03 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,497 in Books (See Top 100 in Books) #2,809 in New Adult & College Romance (Books) #8,474 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 5,692 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Abigail Li",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXSCKHVXSRMMEQCHUU76WGPVJXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROHSARFS6O2UF?ASIN=1734999403",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing read",
                "reviewText": "Love this book. Love Chase and Alina’s romance story. This book was split into two parts. Part One was about Chase and Alina’s past. Chase and Alina’s met when Chase was 13 and Alina was 11. Chase just moved into a house down the road from Alina. Alina and Chase’s little sister became best friends. Throughout this part, readers see Chase and Alina’s dancing around their feeling for each other. At the end, Chase ends up moving and would not return to home for the next eight years. Part two is of the present. Chase finally returns home after finding out that his adoptive father needs to retire early. Chase ends up working for his father’s construction company. The first project that Chase works on is renovating a dance studio. This is where he sees Alina for the first time in eight years. Alina is not pleased to see Chase. With Chase in town, old feeling arise in both of them. Love how these two end up together",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jill Ann Enterline",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAD7I3MTQFAMK3QAKJKHJFTOMXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31O1V6IZY3AZS?ASIN=1734999403",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Took a minute got the hook",
                "reviewText": "I almost gave up on this story. I felt like the lead in; the story from when they were kids was taking for-ever & I was seriously getting ready to walk away. But then the book kicked into gear. And boy am I glad I stuck with it. I think this story resonated with me because I could really relate to the characters in terms of their healing. And the story did a great job of handling that within the story itself.Additionally, I LURVE Hooked. I didn’t realize this was the same Emily McIntire until I was finished with this book. 📖 so , obviously, totally different kind of book, but love this author, so stick it out. I think the pay out is worth it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rasheeda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7BLCUC6PBJF3OSEN5YBKOMBQ6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FJPDX74VQGGA?ASIN=1734999403",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Love Story!",
                "reviewText": "Beautiful love story. Definitely one of my favorites. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beth B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECCRMSMAQMY3W6PBVQQWKWWANSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3A0RTZDU50771?ASIN=1734999403",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars This book responses with my soul",
                "reviewText": "I believe there really are soulmates and you recognize them in every lifetime. This book is a story of two of them and it is now one of my absolute favorite books of all time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIPYDJWMBAAHYVEY2RRKSEUPPOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQLSU3A0FL4QB?ASIN=1734999403",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2021",
                "reviewTitle": "3.0 out of 5 stars What is it with the crazy ladies?",
                "reviewText": "I'm pretty dissapointed with this book. It started okay, some filling pages that could've been skipped and a really long part one when it should have been focused in the future instead of the past. Then part 2 started good, you could feel the angst and the chemistry, but then again, there it seemed shorter and dramatic. I really found it annoying that the whole drama was around cheating. Did he cheat? No, but he had some pretty unbelievable explanation as to what happened (even though it arrived eight years too late). Then the second almost break up was, once again, because of a woman because obviously he was so incredible that girls go crazy for him. Isn't it exhausting to put girls against each other and make some stupid girl drama so they can \"build trust\" in each other? I didn't even get the point of the kiss she saw. She already had a lot on her plate so it was completely unnecessary and the situation was fixed in 0.5 seconds. Boring! Also, the best friend/brother drama is crap. His fiance seemed so nice and they decided to cheat on her and the best friend decided to lie about it. It gives me zero impulse to read more of this weak story line. On the other hand, we also have the best friend who is in love with her and gets mad when she starts to spend time with her big love again. Come on, man, she never raise your hope, she was a friend to you, she didn't own you a damn. It's not her fault she doesn't love you. Then we have the idiotic brother again, leaving all the family drama on her hands and acting stupid. So annoying. The only things I liked were the H going to therapy to work on his issues even though he still kept doing stupid crap like stringing his girlfriend along for three freaking years even though he knew he didn't want something serious. Yes, he told her so, but he was still acting like a crappy boyfriend. She deserved better. Overall the story was just boring, annoying and dissapointing. It had a lot of potential with all the messages about addiction and mental health issues, but that got lost in the middle of the unending drama.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorene",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEUHQXFUIKIUR4QE2OKKRFCQLIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVCTO4OIAFA9B?ASIN=1734999403",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars It was awesome.",
                "reviewText": "I loved the book, loved Chase and Alina’s story and hated the pain experienced by the addictions. It is in our family and has done so much damage. It was wonderful that this story talked about the importance of recovery and a couple of the types available. Thank you for including that information. Also for the happy ending for Chase and Alina. I’ll have to read the next book to find out about her dad and I’m looking forward to it. Great job!!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kyra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOZZBRH5OCBYV3NXF4YHEH6RBVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B0NEO88IIER5?ASIN=1734999403",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars A layered love story",
                "reviewText": "Wow, I'm not sure what I was expecting but this book hit me right in the feels! Such a sweet story but definitely has its layers & triggers.I could relate to this book more than I thought I would. Had me in tears in spots as the descriptions of loosing a parent & grief are so spot on. And the intense love of Chase & Alina finding their way through their struggles was a light in the dark & perfectly written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Camilla Johansen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFN6XTMPS3AH5IPQZFLVHPFBTM3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TXP6O4AS8E5L?ASIN=1734999403",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars I wanna just keep reading and reading and....",
                "reviewText": "A beautifully written book, and i loved the story. You wanna read an epic love story? Then read this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leyendo Forever",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 23, 2021",
                "reviewTitle": "Loved the heroine!",
                "reviewText": "Spanish & English Opinion4🍭🍭🍭🍭ESP ::Había leído algunas reseñas no tan positivas y de todos modos, decidí leer el libro. ¡Qué bueno que lo hice! A mí sí me gustó la historia y el libro es súper fácil de leer e imposible de cerrar.Los protagonistas son Alina y Chase. Hay mucha historia entre ellos y sus personajes tienen perfiles complicados. Lo que más me gustó es que la heroína fue mi favorita. Confieso que muchas veces el rol femenino cae en lo que considero cliché y bobo, pero jamás sentí eso con Lee. Me encanta su personalidad, cómo se conduce, que dice las cosas como son. Ama profundamente pero no es un tapete. Fui fan.Chase, de repente inspira mis ganas de darle un zape, porque se involucra con pura psycho y no es firme en sus negativas. Pero aprende sus lecciones, busca redimirse y en realidad no es un patán. La relación tiene momentos de angustia pero contamos con un HEA inconcluso, que da pie a la siguiente historia: Becca con Eli. ¡Me urge leerla!ENG ::I was almost persuaded into not reading the book thanks to some reviews, but decided to judge by myself and I’m really glad I did! I liked the story and loved that it’s easy to read and a page-turner book that was impossible to put aside.The main characters are Chase and Alina. Their story starts when they are 13 and 11 and they have lots of depth and complicated life stories. My favorite part? I loved the heroine. Lots of times I roll my eyes at the way authors describe female leads (doormats, pathetic at some point or bit cliché) but I never felt like this with Lee. She’s amazing! I loved the way she acted, she thought and she expressed herself.Chase at some points made me wanna slap him, for being blind and somewhat naive where women were concerned. He relate himself with psycho profiles. However, he works on himself, he grows and learns. He’s not a jerk and that was cool. Their relationship has angsty feelings and swoony moments. Their HEA is not over and gives us the perfect way to start they new story: Eli and Becca!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 29, 2023",
                "reviewTitle": "Amazing",
                "reviewText": "In love with the book, the writing style, the whole premise of where the book was set up.Highly recommend this wonderful book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 13, 2021",
                "reviewTitle": "More than just romance.",
                "reviewText": "“I ruin people’s love. I don’t want to ruin you, too.” -Chase Adams Alina and Chase’s love story took me by surprise.This book went to another level of emotion by intertwining kids in the system and a parents with addiction.Emily brings you on Alina and Chase’s separate journeys with mental health and how it can play into a relationship. Their romance is sweet, intense, heartbreaking, and full of tension with hot spice.Buckle up for this rollercoaster of love. 🔥 Beneath the Stars was an enjoyable read and a top recommendation to all my friends. (And random strangers online asking for recs) hehe The side characters were written SO well that we were left wanting MORE of their stories too.P.s - I recommend picking up some neon stars to read this book under. ✨",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Olga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 28, 2022",
                "reviewTitle": "Libro para adolescentes",
                "reviewText": "La historia me ha gustado mucho.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katesabookworm ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 30, 2021",
                "reviewTitle": "A second chance romance with all the feels 🤍",
                "reviewText": "Beneath the stars not only has a beautiful cover but its also a beautiful book about love, loss and second chances.Filled with plenty of angst, my poor heart was beating extra hard in places. Forgivness and understanding help to heal a broken heart and I was rooting for Chase and Alina; his goldi, from the very beginning.Finding their soul mate at age 11 and 13 I loved we got to meet them as children whose love grew and blossomed into so much more than friendship.Flashes of their younger years give you the backstory in part one. Chase is troubled. After him and his younger sister were abandoned by their mother at a young age he is full of animosity and hurt. Alina is the one good thing in his life, and yet he struggles to open up causing a distance between them that breaks both their hearts in the end.Can they find a second chance at love in adulthood? I preyed that they would. But it wouldn't be easy. Alina was devastated by Chases actions and the one night she needed him most, he wasn't there.Tension between them grows.Sparks fly when they are near each otherAnd when two souls are connected like theirs, they are destined to find their way back.I loved this book. If you're looking for a steamy second chance romance with anguish, heartbreak and healing, this is one for you",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}