{
    "remaining_requests": 2248,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Echo-Old-Books-Novel-ebook/dp/B0B9RNFT4S",
    "body": {
        "name": "The Echo of Old Books: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Echo-Old-Books-Novel-ebook/dp/B0B9RNFT4S",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81W2KvC58hL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Barbara Davis",
            "link": "https://www.amazon.com/Barbara-Davis/e/B00E84PEQO/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 44625,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B9RNFT4S"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Lake Union Publishing (March 28, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ March 28, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 7553 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 413 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#157 in Kindle Store (See Top 100 in Kindle Store) #1 in Magical Realism #1 in Historical Mysteries (Kindle Store) #2 in Later in Life Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 44,625 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/b09f5efe-a247-42af-af4c-9158a66718da.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SandyJ21",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELNBR7GNU242WGB3325WUV3UVEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFHKCO6WMNF79?ASIN=B0B9RNFT4S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars A Love Story spanning decades -",
                "reviewText": "EXCERPT: It (wasn't) the first time she had been caught off guard by a book's echoed. It happened quite often, actually. Secrets so scandalous, they singed the tips of her fingers. Sadness that felt like a stone lodged in her throat. Joy so fierce, it made her scalp prickle. There wasn't much she hadn't come across. But she had never experienced anything close to what she felt while holding Regretting Belle.Her eyes slid to the book. Even closed, she could feel the pull of it, the allure of its anonymity, its careful, inscrutable prose, beckoning to be read after who knew how long.And the echoes.Over the years, she'd come to think of them the way a perfumer describes the notes of a scent. Some were simple, others more complex - subtle layers of emotion combined to create a whole. Top, heart, base.With Regretting Belle the notes were complex, heavy, and slow to lift. Against her better judgement, she placed a hand on its cover. It was bitterness that came through first, hot and sharp against the pads of her fingers. That was the top note, the initial impression. Next came the deeper and rounder heart note, betrayal, which carved a hollow place beneath her ribs. And finally, there was the base note, the most resonant of all the layers - grief. But whose grief?How Belle?ABOUT 'THE ECHO OF OLD BOOKS': Rare-book dealer Ashlyn Greer’s affinity for books extends beyond the intoxicating scent of old paper, ink, and leather. She can feel the echoes of the books’ previous owners—an emotional fingerprint only she can read. When Ashlyn discovers a pair of beautifully bound volumes that appear to have never been published, her gift quickly becomes an obsession. Not only is each inscribed with a startling incrimination, but the authors, Hemi and Belle, tell conflicting sides of a tragic romance.With no trace of how these mysterious books came into the world, Ashlyn is caught up in a decades-old literary mystery, beckoned by two hearts in ruins, whoever they were, wherever they are. Determined to learn the truth behind the doomed lovers’ tale, she reads on, following a trail of broken promises and seemingly unforgivable betrayals. The more Ashlyn learns about Hemi and Belle, the nearer she comes to bringing closure to their love story—and to the unfinished chapters of her own life.MY THOUGHTS: What a great read to end the year on. I have a book hangover and doubt I will be able to look at another book for several more days. The Echo of Old Books is a love story. Not a romance. A love story. And a mystery spanning decades.Barbara Davis tied my hearts in knots. She wrung every emotion possible from me. I plunged from the heights of joy to the depths of despair. I am emotionally bereft, quietly excited, and absolutely satisfied.The story is told over two historical timelines, aided by alternating chapters of two books: Regretting Belle written by Hemi, and Forever and Other Lies written in reply to Hemi's book by Belle.I couldn't stop reading. I cried. I smiled. I felt frustrated, angry and ultimately, satisfied.This was my first book by Barbara Davis. It won't be my last.A Few Favorite Lines: We develop a particular fondness for our favorite books, the way they feel and smell and sound, the memoires they invoke, until they begin to exist for us as living, breathing things. - Ashlyn Greer, The Care & Feeding of Old BooksWe never think of our parents that way, as people with dreams and passions. They're just parents.⭐⭐⭐⭐⭐THE AUTHOR: I’m a Jersey girl raised in the south, now living and writing in New England. Confused? Constantly. Happy? Deliriously! But then, living your dream will do that! After fifteen years of wearing heels and schlepping a briefcase as an executive in the jewelry industry, I traded in my pinstripes for a little peace of mind, and decided to follow my dream of becoming a women’s fiction author. And what a ride it’s been! Six books later, I’m still pinching myself, and I’m still as much in love with writing as I was the day I began this journey. Maybe it’s because I believe in miracles, in happy endings and new beginnings. Heaven knows I’ve had my share.I’m blessed to be married to my best friend and soul mate, Tom, who I must say, sets the bar pretty high for my on-the-page heroes. We also have a lovely ginger cat named Simon, who is twenty years old, wretchedly spoiled, and doesn’t give a fig if I’m on deadline or not. When I’m not making up stories, you’re likely to find me reading, cooking, watching college football, (Go Gators!)DISCLOSURE: I own my copy of The Echo of Old Books by Barbara Davis.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fayelle Ewuakye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDOWD4M625PSYBZDO5IJ64YIIBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DH60FB9XDGIA?ASIN=B0B9RNFT4S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars Captivating",
                "reviewText": "I have so many thoughts.This book was riveting for me. It had me hooked from the beginning and I couldn't wait to see where it went.So dramatic! So emotional!2 books within another book, the story is fantastic.Also, it has moments where it's none of those things. The writing is amazing until a line comes along that is cliche and cheesy and doesn't fit. But it's still a wonderful read.And then the plot does something... amateurish. But it's still a fabulous read.And then the details maybe don't line up, maybe there are plot holes? But you still are obsessed.And the characters are really and relatable and then you hate them and feel like they do things wildly out of character. But you don't care, you still care about every wrinkle of face and dress.I kinda feel like the author and the editor bumped heads and the weird bits are the author giving in to the editor's incorrect changes.It's really, really good though, and I thought about this book every time I wasn't reading it. I woke up in the night to finish it.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KRS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTXCJMV623TUB5N2SKOHWSOMOLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31GVA950UI9QE?ASIN=B0B9RNFT4S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars \", ... the echoes a person leaves behind are the by-products of the choices they make\"",
                "reviewText": "This book is SO GOOD I completely ignored my library books to read it. I could not read it fast enough. I HAD to know what happened! I was so tempted to skip forward because sometimes it seemed the story was going a bit too slow for my sake, ...😂Once again, I seem to be picking books with similar tropes/themes. Lately, it is making good choices, not wasting precious time, and being assertive and direct.Once again, characters within this novel realize how much time has been lost due to pride, ego, assumptions, bad communication, and inappropriate behavior.I love it when books make me think. I have a lot to contemplate with this book...I hope you enjoy it as much as I do!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Catherine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB7ZE4CDHMG7CJTOLFEMUDMZV7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NKAUEZ7CUZ78?ASIN=B0B9RNFT4S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful love story",
                "reviewText": "There are several main characters in this story. The story starts with a young socialite engaged to marry a man of her fathers choosing. A wealthy new York family. Our young socialite falls for a journalist from the UK who us as assigned to write a story about the socialist iffy family. They fall in love and plan to run away but things go terribly wrong. This thwarted love story is found documented by a young woman who owns a rare book store as in collectable books. The 2 lovers documented their feelings for each other in a * book the story has a lot of twists and turns and covers a lot of years. The ending is a happy one and I enjoyed reading it",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angela",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCB7OBHZST5WZRNTRUFUTRXPH3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REEGHKLJ7X8TM?ASIN=B0B9RNFT4S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Devastatingly Magical and Beautiful",
                "reviewText": "This story was unlike anything I have ever read. We are introduced to Ashlyn our main character who owns a bookshop and has a special talent when it comes to books. By luck she comes across “Regretting Belle” and then “Forever, and Other Lies”, two books each written by one half of a couple. We journey through each of their stories as well as Ashlyn’s. This was so beautifully done, I thoroughly enjoyed every aspect of the story telling and the writing. I will be looking at reading more books by Barbara Davis with how much I enjoyed this one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maryann L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHON7E5RVR7WRVL7ZIE7QOQ42QUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLMKZ7ZT2AU9B?ASIN=B0B9RNFT4S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Unexpected read",
                "reviewText": "Slow start for me… almost couldn’t get into it because i couldn’t grasp where the story was going and almost put it down for a try another time (i can never leave a book unfinished, no matter how much i’m not enjoying it, it just may take me a couple years of reading a few chapters here and there), but am glad i kept going because about 1/4 way through the story grabbed me. The interweaving of the character’s stories, the twists of each’s lives, it kept me engaged to the end. Thank you, Ms. Davis, for this out of the ordinary story.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 9, 2024",
                "reviewTitle": "An intriguing and inventive dual timeline historical fiction",
                "reviewText": "This riveting dual time line story was both captivating and intriguing. The premise of the book; two mysterious very similar books from the 1940’s found in a box of donations in 1984, was inventive and unusual. One of the found books was written by a woman and one by a man and both detailed their failed relationship. I couldn’t wait to find out what would happen next in both the past and present timelines. An Echo of Old Books is part historical fiction and part romance with betrayal, secrets and family playing an integral part of the story. The author does a very good job of handling sensitive themes in this book and creating a very appealing atmospheric story. This was my first book by Barbara Davis. I will definitely be checking out other books by this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pjlow",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "A book to remember.",
                "reviewText": "I read such a lot of books, many of which are easily forgettable. Dual time line novels seem to be very popular at the moment and I have read quite a few of them. This one however is one of the very best examples of how to really do it right. The story is so engaging and well written with such interesting characters it was very hard to put down, even when it kept me awake in the early hours! I have just this minute finished it and loved everything about it.I look forward to reading more books by this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reggie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 13, 2024",
                "reviewTitle": "Beyond wonderful",
                "reviewText": "This captivating narrative is an irresistible journey that ensnares the reader from the very first page, defying the constraints of its romantic length. Infused with an abundance of love, passion, and intricate psychological depth, every word pulsates with raw emotion. Each sentence acts as a vessel, carrying the reader through a tumultuous sea of feelings, expertly crafted to resonate deeply with the human experience. To put it down becomes an act of sheer impossibility, as the allure of the narrative grips the heart and mind with an unyielding grip, leaving an indelible imprint long after the final page is turned.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 4, 2024",
                "reviewTitle": "An exquisitely unusual book",
                "reviewText": "It starts with discarded old books containing the explosive love story of a pair of young lovers, not one book but two separate books.that itself unusual and it piques our interest. Then we are introduced to novel ideas like echoes from the books, book sleuthing, revelation of decade old mysteries leading towards a happily ever after ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chamo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 7, 2023",
                "reviewTitle": "In good condition",
                "reviewText": "Good and fast",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}