{
    "remaining_requests": 2221,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dead-Romantics-Ashley-Poston/dp/0593336488",
    "body": {
        "name": "The Dead Romantics: A GMA Book Club Pick (A Novel)",
        "price": "$10.06$10.06",
        "originalPrice": "",
        "rawPrice": 10.06,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dead-Romantics-Ashley-Poston/dp/0593336488",
        "soldBy": {
            "sellerID": "A1ZWVJTZO5RWFA",
            "name": "ZBK Wholesale",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1ZWVJTZO5RWFA&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81XB9ILKibL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ashley Poston",
            "link": "https://www.amazon.com/Ashley-Poston/e/B00H7KAML8/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ZBK Wholesale",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 8900,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 24 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 17 hrs 24 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (June 28, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 368 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593336488"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593336489"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.47 x 0.78 x 8.24 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,517 in Books (See Top 100 in Books) #4 in Feel-Good Fiction #269 in Contemporary Women Fiction #571 in Romantic Comedy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 8,900 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/831fac40-425a-4f11-82d8-8f4469649fa5.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b67c67c1-04a2-4b44-b4bb-a2d496f8ac51.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/846c466a-45e3-4278-9381-bc9684af938d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3336a69d-ad14-4c3c-9eeb-02c571d8b577.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jeeves Reads Romance",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6B3EUW7YMJAHO24XTUU4HD6F7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20F30TRYRY8C9?ASIN=0593336488",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2022",
                "reviewTitle": "5.0 out of 5 stars So unique",
                "reviewText": "Charming and poignant, this ghost story is a little bit romance and a little bit women's fiction. Our hero is a ghost, so that causes plenty of tension, naturally. But as someone who exclusively reads romance novels, I wasn't making an exception for this. There's a sweet and swoony love story wrapped up in the center of a somewhat heavy book about grief and processing loss. Mixing bleak moments with hopeful ones, this intricately weaves together so many important themes in a masterful way. And the ghost puns! SO MANY ghostly references within the text, I loved it. The romance reader in me gobbled up every little bit of the romance; I personally wanted a stronger focus on that, but that's because I'm greedy. One of the best parts of the book is how it balances the light with the dark - there's as much time spent on the pain of death as there is the hope for the future. And that one-of-a-kind feel is what makes this a truly special book - a truly special romance novel - even if this romance reader wanted a stronger focus on that element.The story follows Florence, a woman who ghostwrites for a famous romance author. When her own debut novel failed, Florence was worried that her career was over, but she's found success being the woman behind the scenes. At least she did, until her own love life imploded a year ago. Now Florence is on a tight deadline to produce a happily ever after, and she just doesn't have it in her. She's starting to think that love is dead, and the sudden death of her father certainly doesn't do anything to change her mind. So when Florence's sexy and stern new editor shows up on the funeral home's doorstep - as a ghost - she's not sure what to think. Florence and Ben only met briefly before he became a ghost, and neither one is sure whether Florence is supposed to be helping Ben find peace or whether he's supposed to help Florence wrap up her novel while processing her father's death. Either way, as these two near-strangers spend time together, they begin to wish that they'd gotten closer before Ben crossed to the other side.You're probably still skeptical about whether this is a romance novel or women's fiction, because of the ghost situation. I would call this a romance novel for readers who enjoy elements of women's fiction, because the book is truly Florence's journey, and that doesn't always involve Ben. But... yeah, it's a romance too. While much of the book is emotional and full of grief (not only is Ben grappling with the fact that he's no longer amongst the living, but Florence's father has just passed away), it's also got a funny, uplifting side. It's hopeful. It's a little bit swoony. I loved the opposites attract vibes between Ben and Florence, and how they definitely wouldn't have found their way together if Ben hadn't experienced this time with her. Florence is a chaotic mess of a woman who communicates with ghosts, so that's not something the controlled, workaholic Ben would've been able to handle pre-accident. There are these tiny shifts to the dynamic along the way, and Poston does a masterful job of tying everything together perfectly. That's why this romance reader is willing to round up her rating - while I was greedy for more romance, this is the kind of book that I'm going to be reflecting on for a long time. And it had exactly the kind of ending I wanted.Audio note: The audio was excellent! The story is told exclusively from Florence's point of view, so there is just a single narrator. But she does a great job of differentiating between the characters and giving a stellar vocal performance. I found her voice soothing and easy to listen to, perfect for the many different facets of the story. The runtime was just slightly too long for one day/sitting (10-11 hours), but I was eager to pick the book back up every time I had to set it down. It also makes an awesome workday listen, because there's little to no steam (Florence and Ben literally can't touch), and the romance is an achingly slow burn. I'm sure I would've enjoyed the book in a more traditional format as well, but the audio definitely enhanced the experience.",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alana Romanova",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4LZOGP56T7CHOQ7BNHL7N3HOHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R348A1OWH7QOBI?ASIN=0593336488",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Fun read, but…",
                "reviewText": "The only thing I didn’t care for was the author’s need to include so many gay characters including a they/them. Just give me normal people to read about please. That in itself lost the review a star, and if the story wasn’t so good I might’ve put the book down. Catering to a select few in the name of being “inclusive” just might lose you a very wide audience.However this book was fun because it’s very unique. It did change my mindset toward relationships and what I’m looking for and what is important. It made me cry and was well written. I read it in three days.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KassiRose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFL7EH4GK2VL25EKPNYEVC7CCVUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BMD0OGJWQTKX?ASIN=0593336488",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Unique, captivating, heartfelt",
                "reviewText": "This book was incredibly written. It had a unique storyline, which was refreshing. It didn’t feel like a copy/paste rom-com. There were parts I cried and there were parts I laughed out loud. The plot twist was easy to guess that it was coming, but it was written in such a way that I was still enthralled and couldn’t put the book down. A fun weekend read with lovable characters and a wonderful plot.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZFPRLNUO7LJPDGKQ4GBVZ2KR5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GLV96SFIDQNM?ASIN=0593336488",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2023",
                "reviewTitle": "3.0 out of 5 stars Cute but lacking",
                "reviewText": "When I read the plot of this book, I thought it sounded great. Honestly, it was good but read more like young adult fiction than adult fiction, minus a sex scene that was not what an adult would expect but too R rated to be in a young adult novel (making it easily omitted if necessary). The narrator did a lot of reminiscing and the book read more like self discovery than romance, which was fine. The biggest issue I had was the book pandered to social issues of the time so much so that it was distracting…and made the book feel unfinished in the end, since the author is so unfocused in what she’s trying to say.I’d recommend it as a fun read but wouldn’t expect greatness. If you’re looking for ghost read meets romance, I’d recommend A Million Junes over this book, which is young adult but is also more focused in its message.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amy A.Amy A.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2ROCU2VZSMAEY2AQTVJVMCFW6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9U4U9QJXZAKN?ASIN=0593336488",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2023",
                "reviewTitle": "4.0 out of 5 stars A paranormal romance with a quirky setting and cast of characters",
                "reviewText": "📚 The Dead Romantics✍ Ashley Poston📖 Contemporary Romance⭐3.75/5🌶️🌶️💭 \"Standing there in the middle of the dandelion field, looking up into Ben's soft ocher eyes, I began to realize that love wasn't dead, but it wasn't forever, either. It was something in between, a moment in time where two people existed at the exact same moment in the exact same place in the universe. I still believed in that- I saw it in my parents, in my siblings, in Rose's unabashed one-night stands looking for some peace. It was why I kept searching for it, heartbreak after heartbreak. It wasn't because I needed to find out that love existed- of course it did- but it was the hope that I'd find it.\"◾🎯 What I loved: I'm always interested in how discussions of death impact life (it's actually what I wrote my thesis about in college) so the funeral home setting and conversations with ghosts really intrigued me. The references to Six Feet Under and tributes to fellow romance writers were fun and made the characters more relatable and I loved that even in a cis M/F romance, there was tons of LGBTQ+ references and language.🙅‍♀️ What I didn't: There were times when reading that I felt like there was a level of assumed familiarity with the characters and their backstories that I just didn't have. The book jumped from scene to scene with characters from Florence's life in New York and North Carolina quickly and there were honestly just a lot of characters that weren't significant but I felt like I needed to backtrack to remember: people from high school, friends, family, co-workers. I also wished that the story had gone more in depth with the murder case that Florence was involved in- this had the potential to be really interesting and clearly played a big role in her life but was just grazed over when finally discussed.◾Read if you love:* paranormal romances* books about authors/publishing* TV show Six Feet Under or movie Just Like Heaven◾See also: By Any Other Name, Meet Me in the Margins, The Two Lives of Lydia Byrd",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51ngggFq+gL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annie Tasaka",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 23, 2023",
                "reviewTitle": "This book will stay with me for a while.",
                "reviewText": "Five stars doesn’t seem enough. This was nothing like I expected it would be but perhaps this is what made it so great.I went in blind which I recommend doing. It was magical, left me feeling emotional and I will be thinking of this one a while. ❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nimet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 22, 2024",
                "reviewTitle": "A ghostwriter x an actual ghost. Match made in heaven.",
                "reviewText": "This was so wholesome. I was a bit unsure where it was going at first, but I'm glad I kept going. Florence is a ghostwriter for a romance author, but after her breakup she stopped believing in love. Ben, an actual ghost👻, does believe in love but thinks he's unworthy of it (my baby deserves the world). Florence has to go back home because her father passed away, she doesn't like being in her hometown because she's always been the odd one there. Ever since she was little, she's been able to see ghosts but has been pushing them away because she just wants to be 'normal'. She can't seem to push away Ben tho. Now that he's here, he might just help her finish her manuscript. What else is he gonna do anyways. One thing leads to another and the next thing she knows, she's got feeling for a ghost. How is this gonna end?? This book was so unpredictable to me and I finished it within like 4 hours cause I had to know what was gonna happen next. Their banter was so cute and the whole dynamic between them was adorable. It was such a refreshing romance. I loved everything about it and the way the author described Florence's grief and heartbreak was so good. Will definitely pick up another one of her books!!! 🥰",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Clara Champeval",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 28, 2023",
                "reviewTitle": "idk",
                "reviewText": "Something was missing for me to really like this book and I wasn't surprised by the end.It was a nice summer read but... sadly overrated?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alissia Ghiorghi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 21, 2023",
                "reviewTitle": "So worth the read!!",
                "reviewText": "I misread the summary when I bought it so when it arrived and actually read it, I was a bit confused. [SPOILER] How is it going to ever work out if the guy is dead?? But oh gosh, it so worked out, and it was so fun and refreshing too! I found the concept intriguing and left me chuckling and hoping for a happy ending right till the very last page. At some point I laughed it off, and correctly guessed the twist, but I couldn't be mad, I truly loved this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Inizia con un LibroInizia con un Libro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on June 15, 2023",
                "reviewTitle": "il romanticismo non muore mai, e neanche i libri",
                "reviewText": "La ragazza che non credeva più nell’amore incontra il ragazzo che l’amore non pensava più di meritarlo.Ogni aspetto di questo libro è semplicemente straordinario.Ma veniamo alla trama: la famiglia Day (composta da madre, padre e i tre figli -> Florence, Carver e Alice) è una famiglia molto eccentrica e gestisce un’attività di pompe funebri in una piccola cittadina, hanno una visione tutta loro della morte e onorano le persone che se ne vanno in un modo rispettoso e unico.Florence Day (la protagonista) e suo padre condividono un dono speciale: entrambi possono comunicare e aiutare le anime delle persone decedute che hanno ancora qualcosa in sospeso nella vita terrena. Ahimè, quando a 13 anni Florence risolvere un caso che riguarda l’omicidio di un suo compagno di classe, grazie proprio a questo dono, viene bullizzata e isolata da alcuni suoi concittadini.Questo fatto la spingere a lasciare casa sua non appena fosse stata accettata da un college, e a non mettervici più piede per anni e anni.Ma un bel giorno il suo destino prende una piega inaspettata. Dopo essere diventata una ghostwriter per una scrittrice di romanzi rosa di successo, si trova ad un punto morto (!): non riesce più a scrivere scene d’amore dopo la sua ultima delusione in questo campo! Il problema è che il suo nuovo editor, l’affascinante, altissimo e muscoloso Benji Andor, non vuole concederle l’ennesima proroga che le potrebbe permettere di finire l’ultimo libro compreso nel contratto stipulato da ghostwriter!Sta ancora cercando di digerire questo diniego, quando riceve una chiamata da sua madre che la informa che il suo amato padre è venuto a mancare.Così Florence si ritrova a tornare in quella cittadina da cui era fuggita/l’aveva fatta fuggire, ma le sorprese non finiscono qui:Quando Florence apre la porta delle pompe funebri di famiglia, invece di ritrovarsi davanti qualcuno venuto a portare le condoglianze a lei, ai suoi fratelli e a sua madre, non solo vi trova invece un fantasma in cerca del suo aiuto, ma proprio il fantasma di Benji, il suo nuovo editore!Questo libro mi ha toccata nel profondo, sia per il suo modo di parlare e gestire la morte, sia perché l’ho trovato proprio un viaggio quasi spirituale. Mi ha messa in pace con il mondo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81MI1F9w3pL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.56",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            }
        ]
    }
}