{
    "remaining_requests": 2273,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Seven-Year-Slip-Ashley-Poston/dp/059333650X",
    "body": {
        "name": "The Seven Year Slip",
        "price": "$12.73",
        "originalPrice": "",
        "rawPrice": 12.73,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Seven-Year-Slip-Ashley-Poston/dp/059333650X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81N6pjRZLbL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ashley Poston",
            "link": "https://www.amazon.com/Ashley-Poston/e/B00H7KAML8/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 6389,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 16 hrs 30 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 15 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (June 27, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 368 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 059333650X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593336502"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.44 x 0.9 x 8.18 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#265 in Books (See Top 100 in Books) #23 in Contemporary Women Fiction #82 in Romantic Comedy (Books) #303 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 6,389 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ce3554b-36c6-48c2-be4e-8652ef5f4113.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/159495bb-df86-4c14-bc9e-2a7154be5c8a.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9623dd6-e1bb-4dcf-a79d-d8ec4385c163.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bookish801",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUCY375VTBJMOE5HI3H6PYQYKPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EZGG99YDYRC?ASIN=059333650X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Magical apartment",
                "reviewText": "Ah, this was such a beautiful and unique read! In this romcom, Clementine West acquires a roommate only to discover he lives seven years in the past.There is so much to love about this book. Holy magical apartment! Clementine travels between present and seven years in the past, but the time travel only happens inside her aunt's apartment. That's such a fun concept, like stepping into an enchanted forest or into Narnia.Endearing characters make this novel shine. Each one of them is memorable and together they truly bring this story to life. Clementine's aunt, or rather the memories of her, give us a glimpse into Clementine's past and the special person who shaped her into who she is.I got a tiny bit confused trying to keep the facts and events straight with all the time hopping, but the plot and the feeling this book left me with was so magical that I still gave this novel my top rating!I immensely enjoyed the writing and I am already looking forward to reading the author's previous novels, especially now that I learned that her characters from The Dead Romantics make cameo appearance in this book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meighan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMBIJKCX6RQI2DSPWO6SPGPK4UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVPG5125DIRGZ?ASIN=059333650X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "4.0 out of 5 stars a magical tale",
                "reviewText": "📚𝐁𝐎𝐎𝐊 𝐑𝐄𝐕𝐈𝐄𝐖📚The Seven Year Slipby: Ashley Poston3.5⭐️I had to sit on this one for a couple of days. Ashley Poston's books are different. They bring something unique to the table every time- no pun intended. I was a big fan of The Dead Romantics and waited a long time to read this one. I had a very real fear that I wouldn't love her writing a second time.I really liked Clementine and I loved Iwan's character. They both were trying to find the most authentic versions of themselves, but it was tricky for Clementine. She meets Iwan in the magical apartment, but he is seven years in the past. Then, low and behold, the chef-turned-author she's trying to sign is Iwan in present day. And the two versions she gets of him are vastly different, but she falls in love with both of them.Time travel, in general, is super confusing to me. I don't really believe there are other versions of us in other dimensions having different experiences. That's way too deep of a concept for me to wrap my head around. But the author kept the book really streamlined and easy to understand what was going on in different time periods. The magic only lived inside of apartment B4, so there weren't a lot of time & place changes to follow along with.I enjoyed the book and thought it was really sweet, but I don't think I loved it as much as The Dead Romantics. I loved all the revelations along the way, but I didn't get the warm fuzzies from the characters until the very end and it was really only Iwan that I felt it from. I did love seeing Clementine come to terms with what would make her happy and taking steps to achieve it. I loved chatting with friends about this one!I know the author has a new release coming out in 2024 and I will definitely read it. I love the way she writes and tells stories that are so unique to the book world.—𝐲𝐨𝐮'𝐥𝐥 𝐟𝐢𝐧𝐝:🕰️right person, right place, wrong time🏨magical apartment🧑🏼‍🍳chef x publicist💔grief & acceptance",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fantasy Author Sandy Lender",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHD63Q5MKBZWX33ZBPQ2XBJRYSOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MY0OC0CR99R?ASIN=059333650X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Speculative Romance Fiction",
                "reviewText": "There's a hopefulness in the click of the lock in Apartment B4's door...and it sets up a magic contemporary romance in Ashley Poston's \"The Seven Year Slip.\" While I found myself looking for an explanation as to why our two love interests--Clementine West and James Iwan Ashton--could individually leave the \"magical\" apartment during its timeslip into the past and be in their respective correct time, I could set aside the desire for a sci-fi interruption and enjoy the contemporary story that unfolds here. Clementine and Iwan meet seven years ago when Iwan is just starting his career and Clementine is \"current day\" with her career already seven years in progress--and they're both seeking. We follow Clementine's arc looking for joy in her job and life-without-her-beloved aunt and we see her assist Iwan in rediscovering his joy. It's not just a cutesy romance where two people fall in love and move through time. It's an in-depth look at how time changes a person--and reconnection can help you get yourself back. I admit I got a little weepy in a few spots while reading and then full-on burst into tears when I got to the thought-provoking discussion questions at the end. Poston did a fantastic job with this...",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SAJB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFTHVQTIBZYZRQECNYRVQYSO7JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14Y34YMVWN5PN?ASIN=059333650X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Enthralling and beautiful",
                "reviewText": "I’d just read With Any Luck and wanted more of Ashley Poston. Even though I have at least 10 books to read next - don’t judge! I know I’m not alone. Even though I already started at least three of those books and have another pile beside my bed, and have all 20 KU books borrowed, I read the description for The Seven Year Slip and it did not disappoint. I adored Clementine and James and their alter egos. I empathized with the grief and cheered them on. I guessed each twist just before it landed and was delighted. I feel like this was also a subtle love letter to food, books, and NYC. Enjoy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samantha G.Samantha G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 4, 2024",
                "reviewTitle": "Bonito",
                "reviewText": "5/5 al producto físico, llego en perfectas condiciones y con el tiempo de entrega que se estimó.Aún no lo leo pero físicamente es bueno",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61MKB74KOaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71W3tc2Ag3L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mayara Batista dos Santos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 9, 2024",
                "reviewTitle": "Entrega demorada",
                "reviewText": "Eu achei a leitura ok. Me icomodou a demora de mais de 1 mês para a entrega ser realizada.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrea BrownAndrea Brown",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 24, 2023",
                "reviewTitle": "⭐⭐⭐⭐⭐",
                "reviewText": "° REVIEW ⭐⭐⭐⭐⭐As someone who spent their formative late 20s going on adventures with their maternal aunt, this book hit very close to home. I truly felt the connection between Clementine & Analea within my bones, a connection that is so hard to understand & so beautiful to live. As always, Ashley Poston takes us on an emotional ride throughout this book. I found myself laughing with tears in my eyes, giggling around a lump in my throat. Her banter & humour lighten up some truly poignant moments throughout this novel.This book is about four very different love stories. Three between lovers, & one between an aunt & a niece. It's hard to pick which one is my favourite. The past, the past/present, the present... But honestly, it's probably all of them. Ashley has such an incredible gift to bend & curve time & bring the reader to & from & through. It is a gift that very few authors can achieve & Ashley does it flawlessly.Benji's (MMC from The Dead Romantics) appearance put me over the edge! \"Since a car knocked the spirit out of me\" SWOON & GIGGLES!\"I loved how a book, a story, a set of words in a sentence organized in the exact right order, made you miss places you’ve never visited, and people you’ve never met.\"\"It's never a matter of time, but a matter of timing.\"\"I think that nothing lasts forever, not the good things, not the bad. So, just find what makes you happy and do it for as long as you can.\"",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81zOPpX1YnL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "hiba",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 22, 2023",
                "reviewTitle": "SO CUTE",
                "reviewText": "SOOO I went into this blind. I vaguely heard people loving it but let me tell you THIS IS SOOO GOOD. I was kicking my feet, smiling, giggling and rooting for the characters. Iwan made my heart ache by how cute he was and you cannot not love and appreciate him. Perfect hall read, the vibes are immaculate. It's cozy and hearwarming. Just fluff in a book. THO pls check trigger warning : grief, death. Bc as much as this book has one the cutest CUTEST romances out there, the main femail character is dealing with her aunt's death. Someone very close to her who died 6 month prior to the event of the book. It is dealt with delicacy and absolute respect. there's a note a this end of the book of the author explaining what she went through with her own experience of grief while writing this masterpiece (her grandfather's death). so be aware.This book is one of my favorites books of 2023 <3",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan Carlos Monte Gonzalez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 4, 2023",
                "reviewTitle": "Reimpresión baratera de Amazon",
                "reviewText": "Si sueles comprar libros en inglés y compras libros de Berkley de reciente salida al mercado podrás ver que son unas reimpresiones barateras hechas por Amazon de una calidad muy diferente a lo que tienes en casa, diferente papel, tamaño, calidad, peso!! Nada que ver, como si fueran autopublicados!!es el cuarto que me pasa",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}