{
    "remaining_requests": 2205,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Forever-Never-Lucy-Score/dp/1728282551",
    "body": {
        "name": "Forever Never",
        "price": "$11.26 $10.09",
        "originalPrice": "$18.99",
        "rawPrice": 11.26,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Forever-Never-Lucy-Score/dp/1728282551",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81lP9WbLOgL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lucy Score",
            "link": "https://www.amazon.com/Lucy-Score/e/B00G2DKSBU/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Martistore and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 26506,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Lucy Score is a #1 New York Times, USA Today, and Wall Street Journal bestselling author. She grew up in a literary family who insisted that the dinner table was for reading and earned a degree in journalism. She writes full-time from the Pennsylvania home she and Mr. Lucy share with their obnoxious cat, Cleo. When not spending hours crafting heartbreaker heroes and kick-ass heroines, Lucy can be found on the couch, in the kitchen, or at the gym. She hopes to someday write from a sailboat, oceanfront condo, or tropical island with reliable Wi-Fi."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 23 mins",
            "FREE delivery March 1 - 7 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 6"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the New York Times and USA Today bestselling author of Things We Never Got OverYou don't fall for your brother's high school sweetheart, your boss's daughter, or your ex-wife's best friend. Especially when they're all the same woman.Under Brick Callan's mile-wide chest beats a loyal heart with a few cracks in it. He's the steadfast, overprotective type. Especially when it comes to the one woman he can never have. It's a long, complicated history punctuated by fights, friendship, family, and an attraction that strains his iron willpower.When Remi Ford returns to Mackinac Island in the dead of winter with a secret, Brick makes it his mission to find out what put the shadows in those green eyes. Even if it means breaking down the walls he's built between them. Even if it means falling for the one girl he'll never get over.The free-spirited artist just needs to lay low for a few weeks so she can figure a way out of this nightmare. She's definitely not staying. Not when the man who broke her teenage heart into splinters keeps showing up at her parents' dinner table. Remi doesn't need broody, bearded Brick riding to her rescue…again. Not when it will put them both in danger, costing them much more than their hearts.Author's Note: Frenemies-to-lovers. Opposites attract. Slow burn. Girl in danger. Glorious, glorious banter. Fighting as foreplay. Small-town shenanigans. Big, grumpy, pining, overprotective hero. Wild-child, trouble-finding heroine who keeps on pushing the hero's buttons. Steam Level: Lava. Suspense: Nail-biting. Feels: Big time.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (September 30, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 576 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1728282551"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728282558"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.1 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 1.44 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,527 in Books (See Top 100 in Books) #47 in Small Town & Rural Fiction (Books) #444 in Romantic Comedy (Books) #1,627 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 26,506 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "H. H. H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGZQSIYGU3IZ2AJ56NTAPMVLFMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQFJI5J5VA1SA?ASIN=1728282551",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars As always Lucy Score delivers",
                "reviewText": "So of course the spice was top notch, but so was the story. Parts of our own lives we rarely consider. A character with abandoment issues and how those cause self destructive actions. Apologies and acknowledgement for being a jealous friend. Feeling like you never fit in, but realizing that people do love you just as you are. Such a good story that at times I stopped reading to ponder ideas and thoughts from what I had just read. So glad I found this author. Please keep writing us good stories.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colorado Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRGBWXLOYPHVQ543D2JZKNIQQDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3THFNJSX7WLWS?ASIN=1728282551",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "4.0 out of 5 stars He's Her Anchor & She's His Buoy",
                "reviewText": "Like all Score novels, Forever Never is very readable. The pages turn; the characters are likable; there's a suspenseful mystery. Remi and Brick met 14 years ago, when she was 16 and he was 24. They are true opposites. A synesthete, Remi sees the world in technicolor. She's a creative risk taker. Brick was nicknamed by Remi because he's strong and stoic. They have always been fascinated by and attracted to each other. While Remi has shared her feelings more than once, Brick has resisted and pushed her away because he feels like he isn't good enough. This isn't a second chance romance; it's at least a fourth chance romance. I was frustrated because Brick pushes Remi away for the first half of the novel and then flips his reasoning based on a single conversation.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BookAddict",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ7GEWQ7CSBURFMFZRBMHB7GIUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38GQZZS6ZZ8DC?ASIN=1728282551",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2021",
                "reviewTitle": "5.0 out of 5 stars Light-hearted Humor, Rich Depth of Heart, Stunning Suspense & the Sweetest of Forevers",
                "reviewText": "Knowing this story was set in my beloved home state and desperate for even a fıctional visit back home, I was willing to beg, plead, crąwl on my knees over broķen glass, and sell a kıdney to get my hands on an early edition so I could be ready to tell the world the very minute this booķ went live, because I was certain it would be amazing. And let's face it. It's a Lųcy Scòre book, so we have a 100% chance of it being a delightful, funny, heart-şqueezing read, but this time with an extra dash of some pretty dąrn nail-bıting suspense.Mackinac Island may seem like a sleepy island town during the bòne-chilling winter with transportation via horses and snow mobiles and the most socializing being neighborly visits and a meal at the local tavern. That is until Remıngton Honeysucķle Ford blòws quietly back into town. Being the tiny, tıght-knit community it is, it doesn’t take five minutes for word to travel across the island that the girl who sees words and music in color and marches to the beąt of a drum that consistently leads to troųble has returned home.Remi is the most refreshing, unique heroine I’ve met in ages. They definitely bròke the mold with this gal. With a heart bıgger than the Huron and a sparkling individuality and innate goodness that few understand, everyone wants to be in her orbit and some are a little jealous, yet Remi still has her share of insecurities.Then there's Brick Callan, the most brickish hero ever to be penned. Solıd, dependable and protective, yet I think an actual brick may use its words more than Brick. But when this guy actually does speak? Well, it's worth pulling the snow mobile over and turning off the engine to hear every word that comes straight from his pure, golden heart.Remi's life outside of the island has gone off the rails in a deądly way through no fault of her own. The past they share and the unrequıted lòve that runs both ways between her and Brick makes Remi hesitant to trust him with the details behınd her returning home, yet she knows beyond all doubt she can trust him to keep her safe.And when you put these two together? Holy Mackinac fudge yumminess, Brick and Remi are like standing next to a volcano on the verge of erųpting. You can feel the radiant heat and hear the groąn and rumble of the magma, and you know that when it inevitably breąks loose it will incınerate everything in its path. Scòre has turned up the smėxy hėat, and every encounter draws our couple closer together, making it abundantly clear that these two are as perfect as can be for each other.In this offering, we see a new dimension to this talented lady's wrıting. Where we're used to lighthearted fun with a side of steąm and a few heart squeeżes, or mądcap hilarity with a side of suspense, this story is something greater. She takes us deėp into the psyche of these two characters, showing us events that made them who they are and ląys bąre all the fears and vulnerabilities they’ve kept from those who love them. And the suspense! Holy Grand Hotel! I was grabbing for the “oh sheet” handle while gnąwing my nails to nubs!If you’re already a Scòre fan, it's a no-brainer for you get this booķ. If you’re new to this gifted wordsmıth, you'll be amazed by the way she paints the scene in the reąder's mind. You'll effortlessly fall for these complex, entícìng characters who make you feel like a quiet yet vital observer within their story. Your heart will get the most exquisite of workouts as you live and breathe every nuance and emotion on this riveting journey to forever. Light-hearted humor, rich depth of heart, stunning suspense and the sweetest of forevers make this an exceptional, unparalleled, magnificent must-read!",
                "reviewVotes": "133 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LadyLuck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFV5B2OUGKSRFWB57WIQI2BGIZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GZ7OVYUEA44?ASIN=1728282551",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "3.0 out of 5 stars No romance in the \"sex\" scenes, rough sex and smut",
                "reviewText": "This book reviewed as a romance/quasi mystery, after reading reviews of this authors books I decided to try her book. It could have been a great book with a good plot if not for the unnecessary, f bombs everywhere, street terms for every body part and smutty sex instead of a little ROMANCE. By page 53 I was already sick of the foul language, smutty self-pleasure sex and generally spoiled, annoying \"heroine\". I seriously hope for my children's sake this is NOT the norm for language with family and friends entering a new relationship, as depicted here. Saving the heroine's friend from an abusive relationship was great. BUT then these characters decided THEIR rough sex was okay since it was consensual ?1? PS I am NOT a prude just selective about romance. Save your money.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Superman's girlSuperman's girl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWF2I2GSSMPV2N4DFXBC4ZEHAIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BC6MZVNV6FHX?ASIN=1728282551",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars So good!",
                "reviewText": "I ate up every bit of this story. Brick and Remi have this fire between them that builds with intensity until the middle of the book. Then fireworks explode uncontrollably. The story takes twists and turns with a little mystery that keeps the book stuck in your hands and those chores waiting for your attention.It’s a thick book of 564 pages full of love, mystery, abuse and fighting, excitement, break ups, get togethers, punishments, drama, consequences, rare art, and a fire headed pistol of a young lady that captures all the attention in every room she enters, especially the steel blue fire gaze and the enormous, protective heart of the mountain of a man she nicknamed, Brick, who took it upon himself to be THEE protector of this little, wild, strong-willed, Remington Honeysuckle Ford.The past collides with the present, and two people that were always meant to be—but ran away from each other for years,— finally found themselves in each other’s passionate and insatiable embrace, and they can’t get enough of each other.Good defeats evil once again, and love wins!Now I need to go visit this Mackinac Island that Brick, Remi, Camille, Warren, and all the others that drew my undivided attention to for a month.Before that, I’m going right now to find another book by Lucy Score.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71s3ARJR7SL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dirlayne C. Bastos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 6, 2024",
                "reviewTitle": "what a ride",
                "reviewText": "Lucy Score is masterful at writing impossible stories. This book had me gasping and begging for no one to die. Also how does one recoup from Brick? For this was an easy 24hrs read, couldn’t put it down, I was invested in the tension between Remi and Brick.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eve",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 3, 2024",
                "reviewTitle": "absolutely loved it",
                "reviewText": "Book was great I loved everything about it. I want my own brick where on earth do I find him!? The push and pull between brick and remi was a multitude of feelings. Sometimes I was incredibly sad for her with how she felt each time he denied her his true feelings, I laughed at the stuff she came out with and I loved her attitude and the way she handled brick. I loved brick and felt bad for him with how he felt he wasn’t enough for remi. The plot ok this book was great all the side characters were excellent. Truly is another wonderful book by Lucy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bojana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on December 30, 2023",
                "reviewTitle": "Great",
                "reviewText": "Very good story , loved it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deeprata Chattopadhyay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 25, 2023",
                "reviewTitle": "Awesome story",
                "reviewText": "The story was sensational!!! I got breathless reading this book. The writing, the storyline, the execution, the steamy scenes all are depicted wonderfully.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adrianna B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 31, 2023",
                "reviewTitle": "perfection",
                "reviewText": "Lucy Score NEVER disappoints. I loved this book so much ❤️ every time I read one of her books, i am right there with all the characters, she creates such a magical world, a world you will be real 😍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.96",
                "sellerName": "Book's Bar & Beyond",
                "sellerRating": "4.5"
            },
            {
                "price": "$10.96",
                "sellerName": "Husband's Leftovers",
                "sellerRating": "5"
            },
            {
                "price": "$6.99",
                "sellerName": "symposia",
                "sellerRating": "5"
            }
        ]
    }
}