{
    "remaining_requests": 2289,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hooked-Contemporary-Romance-Never-After/dp/1737508370",
    "body": {
        "name": "Hooked: A Dark, Contemporary Romance (Never After Series)",
        "price": "$10.69$10.69",
        "originalPrice": "",
        "rawPrice": 10.69,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hooked-Contemporary-Romance-Never-After/dp/1737508370",
        "soldBy": {
            "sellerID": "AIR66Q2P8MPAI",
            "name": "Fort Worth eBooks",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=AIR66Q2P8MPAI"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/815PgRooRoL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Emily McIntire",
            "link": "https://www.amazon.com/Emily-McIntire/e/B08CZDLXRM/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Fort Worth eBooks",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 56842,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Emily McIntire is a USA Today and Amazon bestselling author of painful, messy, beautiful romance. She doesn’t like to box herself into one subgenre, but at the core of all her stories is soul deep love. A long time songwriter and an avid reader, Emily has always had a passion for the written word, and when she’s not writing you can find her waiting on her long lost Hogwarts letter, chasing her crazy toddler, or lost between the pages of a good book."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 17 hrs 31 mins",
            "$3.99 delivery February 23 - 26.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Wednesday, February 21. Order within 17 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From BookTok sensation Emily McIntire comes a dark and delicious fractured fairy tale reimagining of Peter Pan.He wants revenge, but he wants her more…James has always had one agenda: destroy his enemy, Peter Michaels. When Peter’s twenty-year-old daughter Wendy shows up in James’s bar, he sees his way in. Seduce the girl and use her for his revenge. It’s the perfect plan, until things in James’s organization begin to crumble. Suddenly, he has to find the traitor in his midst, and his plan for revenge gets murkier as James starts to see Wendy as more than just a pawn in his game.Wendy has been cloistered away most of her life by her wealthy cold father, but a spontaneous night out with friends turns into an intense and addictive love affair with the dark and brooding James. As much as she knows James is dangerous, Wendy can’t seem to shake her desire for him. But as their relationship grows more heated and she learns more about the world he moves in, she finds herself unsure if she’s falling for the man known as James or the monster known as Hook.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Erotica",
                "link": "https://www.amazon.com/Erotica-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10141"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (September 5, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 338 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1737508370"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1737508373"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.85 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#436 in Books (See Top 100 in Books) #5 in Romantic Erotica (Books) #8 in Erotic Suspense (Books) #419 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 56,842 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Read all of Emily McIntire’s dark and delicious fractured fairy tale reimaginings",
                "media_link": []
            },
            {
                "media_text": "Hooked Scarred Wretched Twisted",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ecfe6d94-7878-4470-83ef-a2dae83f09f7.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/11bbed51-fb59-4ae5-bfb7-9f7d333dfbc1.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3573ea01-bfdf-41e8-84db-e934ebc63c64.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0ac16df-a251-45f5-90d1-03c7839bfcf0.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9b74bc7d-4d56-4ad1-98b4-2d8c46e62d38.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Erica Kennedy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNWHI5WTJ3NVF46DRCLDE5IEPOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA4A8V26YB5EW?ASIN=1737508370",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Darling, if I'm the dark, then you're the stars.",
                "reviewText": "\"Just remember that whenever things feel bleak, all situations are temporary. It's not your circumstances that determines your worth, it's how you rise from the ashes after everything burns.\"I absolutely loved this dark and spicy retelling of Peter Pan. This story had me smiling due to how well I felt Hook and Wendy connected. Their back and forth got a little cheesy at times, but I loved it. The storyline flowed, making it a very quick and easy read.Hook met Wendy Michaels (the daughter of his enemy - Peter Michaels) in his bar one night while she was out with friends. He immediately decided to make her his pet as a way to try to tarnish her innocence. which, in his mind, would make her no longer Daddy's sweet little shadow. This book had me drooling over Hook like never before as soon as the first line came out of his mouth. This man breathes red flags but makes you want to absolutely anything he asks of you.I know this is a standalone story, but I would absolutely love to hear more from the characters.I highly recommend this book.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BethBeth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDXRHD3QDQBNL6IYBEVRQLO2ILQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y96YHAXD6P2S?ASIN=1737508370",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "4.0 out of 5 stars The Dark Hook book I always wanted!",
                "reviewText": "4⭐️🌶 🌶🌶🌶The kiss is anything but sweet. It's twisted and toxic, a poison masked in sugar, making you love the taste of death.SummeryJames thinks all he wants out of love is revenge against Peter. The man who killed his parents and ruined his life. He has spent his life building his criminal organization and ruling over his \"lost boys.\"James now has a way to destroy Peter. He will seduce Peter's daughter, Wendy, effectively bringing Peter to his knees. But Wendy isn't just a pretty face and a loving daughter. A fire burns in her to match his own.My ThoughtsHeart pounding, skin tingling, blood racing, I LOVED it! I might be a little biased, I truly deeply enjoy dark Peter Pan retelling that focus on Hook. This was everything I wanted and then some! I delighted in every turn of the page and never wanted it to end.This is NOT the Peter Pan, Hook, Neverland that we grew up on. This is a modern-day story told in the real world with splashes of Pan lore. Hidden easter eggs flitter through the pages. The child in me jumped with glee with every reference while the woman blushed with heat over James (Hook).James was the total dark villain package. A monster in beautiful wrapping who takes care of his own. Who would destroy the world to heal what is hurt or help you find your retribution. He never lies about who or what he is. He knows he's a criminal. He knows he's a killer and fiend. He is truly himself throughout the book while coming to terms that even a scoundrel can love.\"You want to watch the world burn?\"\"Let me guess, you'll set it on fire?\" I ask.He chuckles, the sound vibrating through me and settling into my bones.\"No, darling. I'll hand you the match and stand at your back, watching you become queen of the ashes.\"Wendy is a powerful female character in her own right. She doesn't just sit on the sidelines in docile obedience. She finds her voice and with it her own strength of power. I loved her character arc.Micintire drew me in on the first page. I was engaged and engrossed in her world. The word building is phenomenal in its simplicity. This will sit with me for a while. I will definitely be rereading in the not to distant future.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71mdYyHhXoL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heather W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNSEHJBXDKNYICB22HOKHNIJMTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2267PFUT4L43C?ASIN=1737508370",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Dark and steamy",
                "reviewText": "Rating: ⭐️⭐️⭐️⭐️⭐️Burn: 🔥🔥🔥Darkness Level: 🖤Heat Rating: 🌶️🌶️🌶️🌶️Genre: Dark contemporary romance retellingPOV: DualNarration: DualEnding: HEATropes: Mine, Touch Her and 💀, virgin FMCTW: stalking, drugged, kidnapped, PTSD, SA, violence/unalivingThis is not a \"retelling\" of Peter Pan...but it is. This is a contemporary dark romance that is not a fantasy at all but still manages to be a twist on the retelling of the classic story with the villain getting the girl. I absolutely love this book. And I think I might love it more on this second read-through. The narrators did an excellent job (and swoon for hearing Hook, mmm) and, even knowing the twists, my heart still bled as the story progressed. I know this book has been hugely popular and pretty much everyone has read it at this point. But if YOU haven't, I highly recommend you do so!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Holly Holt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIBSHGZICEVNMQGQ3X6TQ4TRHHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NKO8AQHF1QUY?ASIN=1737508370",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "3.0 out of 5 stars Psychotic Romance",
                "reviewText": "While I enjoyed seeing how this author used elements from the classic “Peter Pan,” this work was way too spicy and crazy for my tastes.Both characters have questionable motives for being as they are and acting as they do. I don’t believe I’ve ever screamed out in frustration so many times.Like, let’s abduct and starve Wendy for days without evidence, then she just as easily is completely fine with that? And oh, let’s wander onto my father’s property when I know he’s a terrible man, and be oh so surprised to find this assistant there, waiting? Like - really? And all of this possessive BS, too, and she’s fine with being called a “pet” - even after the torment she went through?There were some good parts in this, but the bad outweighs it. Not my cup of tea to gloss over important aspects of character and plot development and exchange it for “spice” and insanity disguised as “romance.”I’ve heard that the second book is better, and those little bits of good I found - hopefully they’re more defined than what was in these pages. If you’re looking for a depraved romance, look no further than “Hooked.”This is only my opinion.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brittany Seller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMB6CBPE2QMKVJEEKBEKTXRTKNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25W737Y4Q4FKY?ASIN=1737508370",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars fantastic retelling",
                "reviewText": "I know this isn’t exactly a retelling, but this classic retold in this way, with so many little hints sprinkled in was AMAZING. I was a bit worried at the beginning that it was going to be all spice and not enough story. It was the perfect balance of tension between the two main characters, but also the spicy parts were beautifully written. It definitely had me guessing for a while and thinking I knew who it was. It gave just enough hints to add to the suspense. There were twists in this book but they were sprinkled so nicely that it never felt overwhelming. Definitely would recommend.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "Exciting, spicy 🌶️ & swoonworthy!!",
                "reviewText": "Thank you for making me a new dark romance lover! 🥵This story was interesting off the hop. I started and finished this book in ONE DAY!I couldn’t stop turning the pages!Hook… 🪝 be mine!Great characters all around, fantastic storyline and delicious spice!!🌶️🌶️🌶️I can’t wait to read my way through the rest of this book series. Great job, Emily!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "monica ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 24, 2023",
                "reviewTitle": "amazing",
                "reviewText": "Incredible💖 I didn’t expect almost any of it, and it was a ride, im in love with everything about this book 💖",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sangie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 10, 2023",
                "reviewTitle": "Merece todo el Hype",
                "reviewText": "Al principio (la primera mitad del libro) me costaba mucho leer por que estaba harta del hombre misterioso y malhumorado que enamora a la chica. Pero OMG los cambios de eventos y lo rápido que empieza todo a cambiar que de haberme tardado 6 días en la primera mitad, la segunda la leí en un día! Vale la pena mil veces.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LaraBanana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2024",
                "reviewTitle": "UMMM????",
                "reviewText": "One word: ✨OBSESSED✨I really REALLY loved this book. I can’t even?? Hook was AMAZING!!! His character? PHENOMENAL.Thank you for this masterpiece 😌😌😌",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IlonaIlona",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on October 12, 2023",
                "reviewTitle": "Hooked on the book",
                "reviewText": "This was a really fast read for me since I had a day filled with reading and relaxing.I did not expect the book to be so dark but I actually really liked it and was completely obsessed with the story.It reads really easy and I just didn't want to put the book down.I'm excited to read the rest of the books in this series!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71jocnu8ZsL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}