{
    "remaining_requests": 2325,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Happened-One-Summer-Novel/dp/0063045656",
    "body": {
        "name": "It Happened One Summer: A Novel (Bellinger Sisters, 1)",
        "price": "$9.99$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Happened-One-Summer-Novel/dp/0063045656",
        "soldBy": {
            "sellerID": "A3HMVO0974R9WW",
            "name": "Read All About It Books",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3HMVO0974R9WW&asin=0063045656&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "15",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51o cLA760L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31oU GBV35L.jpg",
            "https://m.media-amazon.com/images/I/51no2bp6AjL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Tessa Bailey",
            "link": "https://www.amazon.com/Tessa-Bailey/e/B00BKMOZYO/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "RNA TRADE LLC",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 41480,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “A romantic comedy delight. If you loved Schitt’s Creek, It Happened One Summer will be your absolute jam.” — Christina Lauren\"I put my entire life on hold the moment I opened IT HAPPENED ONE SUMMER. I read it in one long, luxurious sitting, reading each page twice, not wanting to miss a moment, and dreading The End. I knew I was reading one of my new favorite books, and I will reread it for years to come, whenever I need a dose of small-town coziness and hard-bodied sea captains. Tessa disarms you with a laugh, heats things up past boiling, and then puts a squeeze inside your heart. The tenderness, vulnerability and heat I am always guaranteed with a Tessa Bailey book are the reasons she is one of my all-time favorite authors.\" — Sally Thorne\"Tessa Bailey writes pure magic! It Happened One Summer has everything you could want in a rom-com—heartwarming romance, laugh-out-loud humor, and scorching hot chemistry between the lovable socialite and sexy ship captain. I absolutely loved it!\" — Alexis Daria, bestselling author of You Had Me at Hola\"With her singular talent for writing romantic chemistry that is both sparkling sweet and explosively sexy, Tessa Bailey once again delivers—It Happened One Summer is everything I want in a modern romance, with two complicated, appealing leads, a setting that feels lived-in and also fresh, and storytelling you want to sink into even as you can’t stop turning pages. The total package from one of the genre’s very best.\" — Kate Clayborn, author of Love at First\"Fans of 'Schitt’s Creek' will love the premise of Bailey’s latest work... [a] sexy, drama-filled love story. 'It Happened One Summer' is another great beach read. Plus, laying out in the sun is a perfect excuse for the blush-inducing scenes scattered throughout.\" — USA Today\"Schitt's Creek fans, this is the romance read for you.\" — PopSugar (Best Books of July)\"Her voice feels as fresh and contemporary as a Netflix rom-com... Bailey writes banter and rom-com scenarios with aplomb, but for those who like their romance on the spicier side, she’s also the Michelangelo of dirty talk. She wields filth like Da Vinci does a paintbrush, and there’s a lot to be said for an author who can fill such exchanges with all the requisite heat, enthusiastic consent, and yes, even humor, of such a scenario without veering into corny territory.\" — Entertainment Weekly\"Bailey strikes rom-com gold in this outstanding tale... [She] is bound to earn new followers with love scenes hot enough to boil water and a hilariously naïve Schitt’s Creek-inspired protagonist who is clearly out of her depth.\" — Booklist (starred review)\"Bailey delivers on her usual trifecta of sharp banter, instant chemistry, and high-heat sex scenes, but they are coupled with intense soul-searching for both Piper and Brendan... Another winning romance from an author at the top of her game.\" — Kirkus Reviews (starred review)“When you read a book by Bailey, there are two things you can always count on: sexy, rapid-fire dialogue and scorching love scenes...” — BookPage.com\"This fish-out-of-water story features quirky characters in a charming working-class small town and a steamy, feel-good romance between opposites. Schitt’s Creek fans who just wanted to see Alexis get her happy ending will flock to this title.\" — Library Journal\"Steamy, sexy and fun, you’ll want to soar through these pages.\" — New York Post About the Author #1 New York Times bestselling author Tessa Bailey can solve all problems except for her own, so she focuses those efforts on stubborn, fictional blue-collar men and loyal, lovable heroines. She lives on Long Island avoiding the sun and social interactions, then wonders why no one has called. Dubbed the “Michelangelo of dirty talk,” by Entertainment Weekly, Tessa writes with spice, spirit, swoon and a guaranteed happily ever after."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 35 mins",
            "FREE delivery March 1 - 7 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 4"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The first in a spicy and unforgettable rom-com duology from #1 New York Times bestseller and tik tok favorite Tessa Bailey, in which a Hollywood “It Girl” is cut off from her wealthy family and exiled to a small Pacific Northwest beach town... where she butts heads with a surly, sexy local who thinks she doesn’t belong. Piper Bellinger is fashionable, influential, and her reputation as a wild child means the paparazzi are constantly on her heels. When too much champagne and an out-of-control rooftop party lands Piper in the slammer, her stepfather decides enough is enough. So he cuts her off, and sends Piper and her sister to learn some responsibility running their late father’s dive bar... in Washington.Piper hasn’t even been in Westport for five minutes when she meets big, bearded sea captain Brendan, who thinks she won’t last a week outside of Beverly Hills. So what if Piper can’t do math, and the idea of sleeping in a shabby apartment with bunk beds gives her hives. How bad could it really be? She’s determined to show her stepfather—and the hot, grumpy local—that she’s more than a pretty face.Except it’s a small town and everywhere she turns, she bumps into Brendan. The fun-loving socialite and the gruff fisherman are polar opposites, but there’s an undeniable attraction simmering between them. Piper doesn’t want any distractions, especially feelings for a man who sails off into the sunset for weeks at a time. Yet as she reconnects with her past and begins to feel at home in Westport, Piper starts to wonder if the cold, glamorous life she knew is what she truly wants. LA is calling her name, but Brendan—and this town full of memories—may have already caught her heart. As seen on E!Online, PopSugar, CNN, EliteDaily, Vulture, Buzzfeed, Bustle, the Nerd Daily, PARADE, LA Magazine, Country Living, USA Today, and more!",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Avon; First Edition (July 13, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0063045656"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0063045651"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 0.94 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,742 in Books (See Top 100 in Books) #210 in Contemporary Women Fiction #477 in Romantic Comedy (Books) #1,740 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 41,480 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Fix Her Up Love Her or Lose Her Tools of Engagement Fangirl Down Hot and Hammered Series Book 1 Book 2 Book 3 Fake Dating Second Chance Romance Enemies to Lovers",
                "media_link": []
            },
            {
                "media_text": "It Happened One Summer Hook, Line, and Sinker Secretly Yours Unfortunately Yours The Bellinger Sisters Series Book 1 The Bellinger Sisters Series Book 2 A Vine Mess Book 1 A Vine Mess Book 2 Grumpy/Sunshine Friends to Lovers Grumpy/Sunshine Fake marriage",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/91d76381-c9c6-420a-bcfa-4178dbc13b96.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2a1d7e2b-1b7f-4f14-a3f2-92e3c2b9a8e9.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5a950962-117a-49c4-9cdd-296de8b68cd2.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee99b34a-2c57-492c-9a36-d29b362450c7.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a01ff5d7-0f3c-484f-9b61-31320051da8b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/70fc5dab-6328-4b48-a1e7-d6cd5a41f02e.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6ade858-3a93-449c-bb79-bfb6d03c4850.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95848835-81fc-4361-af15-c3f42c6cbd72.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/44ae1947-0b8b-421b-8bba-e96ba036b897.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a091a5a-2d15-4d1f-b47a-6566da96cf74.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/01893f07-5fe9-4dc4-9f02-996efd035662.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Yen-yen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AER54MH4WODROGALD73PLFIVI37A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFUMIK6LO4A01?ASIN=0063045656",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Absolutely In Love",
                "reviewText": "This was the cutest and most romantic thing I’ve read in a long time! Piper and Brendan had that universal chemistry that fairytale romances are made of. If you love that sweet feeling of falling in love and even tearing up about it, this is the perfect recommendation for you. Now, I’m gonna go read the sequel and for more of those two in the future. For Ms. Bailey if you’re reading this, PLEASE make a hundred more renditions of Piper and Brendan because I will eat it up! Every. Single. Time.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nikki Pierce",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTX3UAGVHIEFCEIZGVUG3GNXK4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVOF0IHYBZ6JX?ASIN=0063045656",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Started rough….",
                "reviewText": "… but it grew on me. So if you start it and want to throw the book in the trash because Piper is insufferable, wait it out. I’d give it a solid 3.5 but round up to 4 simply for Hannah and how good of a sister she was.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicola Stevenson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWZ4L3GQPSKN7RZ4Y7MV2NJIWFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YSI0GRPOMJFS?ASIN=0063045656",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars It lives up to the hype!",
                "reviewText": "This book has a lot of hype & I had held off on reading it because of this. I needn’t have worried as it lived up to the hype for me!I loved Piper & Brendan. Piper was such a fish out of water when she arrived in Westport, and I loved seeing her become part of the town. Brendan was very much the swoon-worthy leading man, and I really liked everything about him. I thought their chemistry was fantastic & I just really liked seeing the both of them grow as people.This was such a delight to read - I can’t wait to read Hook, Line, and Sinker!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chelsey Nixon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP5O5IKIYVUIZMGHB4I4QHAUERQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3375X6Q40PASA?ASIN=0063045656",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "3.0 out of 5 stars #SpoilerWarrior",
                "reviewText": "So we’re just…, not going to talk about that thing where her parents raise her to be helpless and then cut her off and then refuse to come see her and then it’s never resolved?! Okay.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDHW6GI2CPKFTTDAZDFC3MLL5VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EEW36E0FH4TS?ASIN=0063045656",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Sweet sexy romance",
                "reviewText": "What a sweet surprise this book was. Sexy, well written, romantic, and REAL. The characters here are fully formed adults with a myriad of feelings, insecurities, and histories that shape them. Brendan is a dream of a book boyfriend and a true alpha male, human and flawed as he is. I loved him. The town itself that served as the backdrop made me want to pull up stakes and make a new start myself. This is truly a wonderful read about love conquering all. Highly recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZQ7P3FDB5TJ6ZIK4UV7U3HDLRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R386QNSMVM8ZPF?ASIN=0063045656",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Cute heartstrings read",
                "reviewText": "I loved the book, enjoyed the growth and the connections formed and wasn’t ready for it to end. Felt like it needed a bit more and I just wanted a bit more. Good read",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma Schlicht ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDHIT2JTOVME74RTLDPMCS4NNMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VB1J3OA44J95?ASIN=0063045656",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Rom Com Energy",
                "reviewText": "Such a cute read, very smutty, skipped through some parts lol. But overall would recommend (: just the cutest story and it was easy to read",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grace ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDOBKBL65SCMFLAAKL6ZDFHDCLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G5D879TOA6VH?ASIN=0063045656",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Get past chapter 10",
                "reviewText": "Slow and the main female character was annoying at first but this ended up being one of my favorites that I’ve read so far",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pat Marshall",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 12, 2024",
                "reviewTitle": "love the book, hate the cover…",
                "reviewText": "This was an excellent read and very well written. I’ll be happy to spend my money on book two about the sisters’ exploits.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NR. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 11, 2022",
                "reviewTitle": "Love. Love.",
                "reviewText": "GrumpyXsunshine goodness! Opposites attract (in a big way)I loved Piper's evolution as a character and how loyal she was! Great fun summer. This was steamy and swoony and amazing!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Natalia Galindo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 21, 2021",
                "reviewTitle": "Reseña",
                "reviewText": "Me encanto este libro. Entretenido, pero también real en el miedo de dar ese paso al cambio. A dejar de ser, para volver a rehacer muchas cosas en tu vida. Piper me encanto y Brendan ni se diga. Aparte que un muy buen spicy🔥",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cesca ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 4, 2024",
                "reviewTitle": "🌶️ Spicy nautical romance",
                "reviewText": "Definitely a 🌶️ 5/5 chilli spice romance,Enjoyed reading this book- a great story line, I liked both main characters too. a nice easy read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eshika ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 12, 2023",
                "reviewTitle": "Will make you high",
                "reviewText": ".",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.99",
                "sellerName": "Sarahs Bookshop",
                "sellerRating": "5"
            },
            {
                "price": "$10.20",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}