{
    "remaining_requests": 2143,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ruby-Fever-Hidden-Legacy-Novel-ebook/dp/B09MDB1DLT",
    "body": {
        "name": "Ruby Fever: A Hidden Legacy Novel: A Fantasy Romance Novel",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ruby-Fever-Hidden-Legacy-Novel-ebook/dp/B09MDB1DLT",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Pgv3EiGEL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ilona Andrews",
            "link": "https://www.amazon.com/Ilona-Andrews/e/B001RXSCKY/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 6459,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09MDB1DLT"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Avon (August 23, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ August 23, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5542 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 380 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,791 in Kindle Store (See Top 100 in Kindle Store) #480 in Paranormal Vampire Romance #583 in Vampire Romances #978 in Paranormal Werewolves & Shifters Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 6,459 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Emerald Blaze Sapphire Flames Diamond FIre Wildfire White Hot Burn For Me Hidden Legacy #5 Hidden Legacy #4 Hidden Legacy #3.5 Hidden Legacy #3 Hidden Legacy #2 Hidden Legacy #1",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c5c8b535-98bf-491d-8d9c-89555d5207e2.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/60f3429e-7f56-4f75-a9e9-1d10ace86fe8.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d94dc97-5554-46c9-8182-99b37d55abca.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/69fdcba0-0985-4199-890e-6bf72db58041.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4308c47e-3215-4d15-8fd1-3fbe1cfd9083.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e374404d-3005-439c-9c56-ca457033254d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a6d99a6-3d13-4754-8b87-ffa341eb035b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/59b77421-9df0-4a89-b4c0-7a8a76d3f3a4.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8444d90-dfc7-4d40-b9ab-6c70bb6b493f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/44c34e66-67f5-4377-9b7f-d6d3bd0d6c70.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6dbd9d62-08fb-47ba-954d-6c433b8265bc.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sheila M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEKDE4QV6FQYX4JVAPAQQCV2D6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WQNS4SPBKW3V?ASIN=B09MDB1DLT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 11, 2023",
                "reviewTitle": "5.0 out of 5 stars An Enthralling Finale",
                "reviewText": "FINAL DECISION: The remarkable conclusion of the Hidden Legacy series featuring Catalina Baylor transported me into a world of magic, intrigue, and unforgettable characters. With captivating storytelling, Catalina's growth, acceptance of her powers, and sizzling romance with Alessandro left me breathless, and craving more.THE STORY: RUBY FEVER starts out with a wonderful chapter that romance readers will love. That's a good thing because quickly Catalina Baylor is confronted by a wild series of events that unfold in rapid succession. When Catalina's boss, the Warden of Texas, comes under attack, Catalina and Alessandro must discover what has happened while fending off attacks. Catalina becomes the Acting Warden of Texas and confronts the threats facing her city and her family. Old villains and new characters who might be friends or foes appear and keep the story fresh. RUBY FEVER serves as the conclusion to Catalina Baylor's journey in the Hidden Legacy series.OPINION: I was captivated and transported into a world of magic, intrigue, and unforgettable characters in the remarkable conclusion of the Hidden Legacy series featuring Catalina Baylor. This final installment completely satisfied me and yet left me breathless and craving for more.From the very first page, I was completely engrossed in Catalina's journey as she shouldered the weight of multiple responsibilities as the Acting Warden of Texas and Head of House Baylor. The authors skillfully portrayed her growth and transformation throughout the series, and in this finale, we witness the culmination of her remarkable evolution. Catalina's acceptance of her magical nature and her unyielding determination to embrace her powers were awe-inspiring. Her character arc unfolded with such depth and authenticity, making her a truly unforgettable protagonist.The exploration of Catalina's dual nature as a Siren (and another mysterious -- and dangerous -- side) was a highlight of this book. It was a thrilling experience to delve into the depths of her power, as she grappled with the darkness within and discovered the extent of her own strength. The authors masterfully balanced her vulnerabilities with her unwavering resolve, creating a compelling and multi-dimensional character that had me rooting for her at every turn.The romance between Catalina and Alessandro continued to flourish, weaving its way through the challenges and obstacles they faced. Their connection felt palpable, and their chemistry sizzled off the pages. I found myself deeply invested in their journey, rejoicing in their triumphs and sympathizing with their struggles. Alessandro's growth and transformation were particularly noteworthy, as he learned to trust Catalina completely and embrace the power of their partnership. Their love story was tender, passionate, and beautifully portrayed.The introduction of new characters breathed fresh life into the story, expanding the intricate tapestry of the Hidden Legacy universe. The enigmatic Imperial Russian Prince Konstantine added an extra layer of intrigue and complexity to the narrative. Additionally, the return of Victoria Tremaine, the notorious \"grandmother from hell,\" brought shocking revelations and shed light on her role in the lives of the Baylor sisters. These well-crafted characters added depth and richness to the overall narrative, enhancing the reading experience.The plot was a whirlwind of twists, turns, and heart-pounding suspense. Each chapter held new surprises and revelations, ensuring that I was glued to the pages, eagerly devouring each word. The authors' skillful storytelling kept me guessing and second-guessing.WORTH MENTIONING: The hints at future story arcs, particularly involving Arabella made me anticipate what's to come.CONNECTED BOOKS: RUBY FEVER is the sixth book in the Hidden Legacy series and the third and final book of Catalina's trilogy. This book should be read as part of the series or, at least, after reading Catalina's books.STAR RATING: I give this book 5 stars.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John G Robert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVSGZQMTLTSOPNN5QWMBXL372RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2K2X1W41HQZLU?ASIN=B09MDB1DLT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars What's next?",
                "reviewText": "Fabulous intrigue, unique magic and family to conclude this 2nd trilogy. I have always been a fan of characters that are somewhat relatable in a world building urban fantasy and this checks all the boxes. The worst part is getting to the end and wanting to read the next book now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "liz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUMPZT3I6B6LHIP2FKDHW3ZX66Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YYEPAHB2U1W1?ASIN=B09MDB1DLT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing series!",
                "reviewText": "This series is probably my favorite series I’ve read in a long time. After completing the final book I went back and read them all together one after the other. I did not get the slightest bit bored. Still looked forward to finding time to read.So heartbroken that it’s such a short series. There could have been books about Leon and Arabella.Really recommend this series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Esther Guenat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWTQW6SKJNLNERT7XDJIAAEKQXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RY3PU86LTO4TC?ASIN=B09MDB1DLT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2022",
                "reviewTitle": "4.0 out of 5 stars Beguiling End (...or is it?)",
                "reviewText": "Like many, I could not put this book down--I kept looking for a stopping point so I could, you know, do more menial-but-necessary life things like work and do laundry and wash dishes...but, no. I had to keep going and see this final (is it, though?) outing through to the big finish.PROS: strong character development--I love you, Catalina, and I barely liked you in the first book; riveting plot with nonstop action--seriously, I was turning pages so fast and furiously; a cast of *truly* lovable side characters that flesh out this story and make you invest in what happens, not just to the mains, but to everyone; a worthy villain in Arkan; big, BIG revelations that drove the plot and kept things feeling cohesive; and so much potential to keep going--with Arabella, with other characters both old and new, with a potential global/international plot direction...CONS: not enough Grandma Frida (um, hello, I need more--but that moment she perks up and ogles the Prince was awesome and classic GF), not enough Bug or Augustine (especially after that big Augustine reveal via Connor's video), the final \"battle\" wasn't long enough--it felt way too rushed--nor was the epilogue (especially IF this really is the final book), and, finally--and cue the eye rolls--there wasn't enough Nevada and Connor (I don't care that they were also \"under attack\" in that final battle scene--they should have been there, too) and just not enough Connor Rogan (never, never enough).As with any Ilona Andrews series, this final installment to Catalina's part of the story left me feeling bereft and IMMEDIATELY wanting more. (And I can't decide if that's a positive or negative for the authors--to have questions of \"what about the next book?\" come up literally on the release day of the latest book, ha ha. It's probably incredibly frustrating while also being very substantiating at the same time.) Despite this book answering (almost) all questions raised in the past five novels, the storybuilding and character development is just so damn good, one can't help but crave more of it; and, like I just said, even though so much of this book answered most of the mysteries of Books 1-5, there's still SO MUCH POTENTIAL to this world and these characters: Arabella's story and HEA; Leon needs his own series; can we get a Vicky Baby and Linus prequel, please; can Augustine get some love--he needs someone to call him out and hold him accountable; the Russians!; the threat of the Record Keeper (anyone else?), and, of course, Nevada and Rogan (as parents?! as international super-Primes? ha ha, but kinda seriously?). Again, SO MUCH POTENTIAL! I think it was Gordon who stated in a recent Q/A something about how if they just simply kept coming out with sequel after sequel, the creativity becomes a bit stagnant--or something like that--but, again, they've built a world here that has a wealth of creative possibility I hope they continue to explore. They've left the door open, they've talked about Arabella's story as a self-publish, they've probably rolled their eyes for the zillionth time at yet another person asking for more Mad Rogan (hello, it's me)...so, I'll continue to hope, and in the meantime, I'll continue to reread and revisit this wonderful, magical world.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lydia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6QYODZXLTFOLPFQXWVD3IENX4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N7I7JQQXOMY1?ASIN=B09MDB1DLT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved very bit!",
                "reviewText": "Great way to end the series! I was left wondering about what happens to some of the other characters however, so hopefully there is some short stories about them. Love these authors and always enjoy anything they write!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DragonRhapsody",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 29, 2022",
                "reviewTitle": "Perfect.",
                "reviewText": "A lot more characters than we normally see in these stories, but so worth it! I loved every minute and will probably read it again in a few months. I read the entire series (for the 2nd time) leading up to the release of this book.Hidden Legacy series is by far my favourite of the Andrews' books. The Kate Daniels series is still in my top 5 of course!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tatiana santillan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 24, 2022",
                "reviewTitle": "Me encantó",
                "reviewText": "Ojalá algún día puedan traducir todos los libros al español. Como siempre me encantan las historias de ilona andrews y esta no es la excepción. Pero me quedan tantas dudas ¿bern será ahora de la casa etterson? ¿Que tipo de objeciones tenía Duncan? ¿cuales eran las 5 casas que pagaron el robo del suero?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gemma fox",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 7, 2023",
                "reviewTitle": "Amazing!!!",
                "reviewText": "Love love love this series. Catalina is such a badass, I loved Nevada's books but Catalina has definitely captivated me!I hope there will be more to come for arabella 😊",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pony",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 8, 2022",
                "reviewTitle": "Épilogue réussi",
                "reviewText": "J'aime beaucoup cette série ! Pas de temps mort ! Les auteurs nous emmènent dans un marathon époustouflant , les événements se succédant les uns après les autres dans une folle équipée comme souvent dans cette série. Les réponses sont révélées (même si certaines étaient devinees), et des explications données . Je me suis attachée à cette famille que nous avons vu grandir et affronter bravement tous les défis et ont su rester unis. Comme c'est bien écrit. Car les auteurs nous ont plongés dans cette famille et nous ont fait nous attacher à tous les personnages même ceux qui gravitent autour d'eux. Pour ce tome ci qui clos le ”chapitre” Catalina , ils devront affronter Arkhan l'ennemi acharné, la famille de Francisco, l'impérium russe, résoudre des meurtres et Catalina devra jouer son rôle de député. Beaucoup de rebondissements ! C'est tellement bien mené que j'ai eu du mal à lâcher le livre. Je le recommande vivement.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 3, 2022",
                "reviewTitle": "Must Read !!!",
                "reviewText": "Another book that never failed to keep me hooked till i finished itjust awesome ♥️would recommend this series to all those who love reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}