{
    "remaining_requests": 2030,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Secret-You-Me-Novel/dp/B0813Y6G3Z",
    "body": {
        "name": "The Secret of You and Me",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Secret-You-Me-Novel/dp/B0813Y6G3Z",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41yizjPADjL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Melissa Lenhardt",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Melissa+Lenhardt&search-alias=audible"
        },
        "brand": "Melissa Lenhardt&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 421,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "True love never fades - and old secrets never die....Nora hasn’t looked back. Not since she fled Texas to start a new life. Away from her father’s volatile temper and the ever-watchful gaze of her claustrophobically conservative small town, Nora has freed herself. She can live - and love - however she wants. The only problem is that she also left behind the one woman she can’t forget. Now, tragedy calls her back home to confront her past - and reconcile her future.Sophie seems to have everything - a wonderful daughter, a successful husband and a rewarding career. Yet underneath that perfection lies an explosive secret. She still yearns for Nora - her best friend and first love - despite all the years between them. Keeping her true self hidden hasn’t been easy, but it’s been necessary. So when Sophie finds out that Nora has returned, she hopes Nora’s stay is short. The life she has built depends on it.But they both find that first love doesn’t fade easily. Memories come to light, passion ignites, and old feelings resurface. As the forces of family and intolerance that once tore them apart begin to reemerge, they realize some things may never change - unless they demand it. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Women's Fiction",
                "link": "https://www.amazon.com/Womens-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=542654"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 54 minutes"
            },
            {
                "name": "Author",
                "value": "Melissa Lenhardt"
            },
            {
                "name": "Narrator",
                "value": "Courtney Patterson, Natalie Duke"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 04, 2020"
            },
            {
                "name": "Publisher",
                "value": "Harlequin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0813Y6G3Z"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20,280 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #893 in Women's Fiction (Audible Books & Originals) #2,744 in LGBTQ+ Romance (Books) #3,532 in Romance (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "kendra Tate",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV35WYHTDJTTSUGN3FM4SV7ZCUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IWIAHT6VJ1PF?ASIN=B0813Y6G3Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book!",
                "reviewText": "Great read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kimmylapoo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNDGZBU76FWKTBC6LGEAZD5AR2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BJ3JX5X51P9E?ASIN=B0813Y6G3Z",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "4.0 out of 5 stars with reading",
                "reviewText": "This book was a little slow to start but it finished nicely. I enjoyed it. I would certainly recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leslie Karen Lutz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQ3LMXHPNQOIWKT7FKJG24A3WDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FNY441R6FJPX?ASIN=B0813Y6G3Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2020",
                "reviewTitle": "5.0 out of 5 stars An Awesome, Compelling Read",
                "reviewText": "The Secret of You and Me is a retelling of Persuasion, one of my favorite Jane Austen novels. The main characters, Sophie and Nora, fell in love in small town Texas when they were in their late teens, but were separated when Sophie’s conservative mother and Nora’s hard-nosed father found out about their forbidden amour. For almost twenty years, Sophie has remained closeted, playing the dutiful wife to a man with political aspirations, while Nora has been out in the world, making a name for herself. When Nora comes home to bury her father, she must face the feelings she’s thought she’d left behind long ago.I’m so impressed by the complex web of relationships that Lenhardt creates in Lynchfield, and by the time we’re a few chapters in, I was thoroughly immersed in the world-building. I’m not surprised though, as I’ve read a lot of Lenhardt’s other books. There’s a full cast of intriguing secondary characters, including the lingering shadow of Nora’s tough-as-nails father, and Sophie’s tattooed, long-haired AA sponsor. By the time you finish this novel, you’ve got a whole society in your head, and the author does it without taxing the reader.Lenhardt also has a knack for intense dialogue that often reveals the nastier side of the antagonist. This, of course, means that it’s more satisfying when the main character gets the best of them.Then there’s the love story. The relationship between Sophie and Nora was full of the conflict that often comes with a lot of baggage, and it was quite a ride to see them figuring out situations that, from the reader’s perspective, seem impossible to navigate. If you’ve ever wondered how hard it is to come out in small town Texas, this book will give you a glimmer of an idea.The Secret of You and Me is a “keep you up late at night” page-turner that will stay with you long after you've finished the last page.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Latrece",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3RYA4JPNUWR5JTFBYJIMMO7PJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RJQ49H7LRET5?ASIN=B0813Y6G3Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2020",
                "reviewTitle": "5.0 out of 5 stars About time!",
                "reviewText": "I have waited a good while for a lesbian romance novel that I could really sink my teach into and this did not disappoint. So I’ll just make a list of why this is amazing.1. The novel is LONG. So you get an adequate backstory and get more out of the characters. You can feel their emotions and personalities which can we harder with shorter novels.2. It deals with real issues and doesn’t feel far fetched.3. Yes there is infidelity which for some reason a lot of readers are turned off by. I am not one of them. I felt as though there were genuine justifications to the characters actions which were not taken lightly. The author didn’t make me feel as though anything was callous4. It was extremely hard to put down!! I stayed on the edge of my seat the entire time.I probably could go on and on. But this book is at the top 10 of my favorite books in the genre. Kudos to the author for an amazing job!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauren Heck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETSOYOXIU3BJFQH74BZTRBTTJMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REJZULB9B2VJH?ASIN=B0813Y6G3Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2021",
                "reviewTitle": "5.0 out of 5 stars My real life love story",
                "reviewText": "I related so much to this book. From the beginning of Sophie and noras story to the betrayal and so much more. Reading this book was like reading about how my life could of been if I didn't come out at 19 and start dating my high school sweetheart again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janice",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW3434MWLWATJUMFJXUCYM7TDPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CTWDQ6DWHYMH?ASIN=B0813Y6G3Z",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 16, 2021",
                "reviewTitle": "3.0 out of 5 stars Held my interest.",
                "reviewText": "Interesting storyline. Would have given a 4 rating, but way Too much profanity.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ilana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGREM3E7KLKJDYD5FTAAHOEEBCWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DFCQQBZ9Z59M?ASIN=B0813Y6G3Z",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 4, 2023",
                "reviewTitle": "4.0 out of 5 stars The Wrong Romance",
                "reviewText": "“Is this what our relationship is going to be like? Fighting all the time? Because I don’t like it one bit.”Until the 90% mark, there isn't one scene between the main characters where they refrain from bickering. I'm all for conflict in my fiction, but dear Lord. They'd apologize for something and do it again 10 minutes later.The book was well written, and I really enjoyed the first half. I was rooting for the couple up until Alima came into the picture.Alima, Nora's secondary love interest, is infinitely more likeable than Sophie (who I liked less and less as the story went on.)I had to force myself to chew through the last third of this book. And jeez, poor Logan.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth M. Cantwell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5JRN4DZMJ7U7VXOKYCYULM32FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV3KPLNSZBYPK?ASIN=B0813Y6G3Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 3, 2020",
                "reviewTitle": "5.0 out of 5 stars I Wasn’t too sure at the start..",
                "reviewText": "But I’m glad I stuck with it! This is a fabulous, multi layered read. Being honest - at first I wasn’t sure this was lesbian fiction. The narrator sounded straight. I checked back on the reviews and gained more insight and kept reading. Great characters as well as an eye opening cultural exploration of coming out in a small evangelical town. You won’t be disappointed.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Léthicia Nolet-Ethier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 6, 2021",
                "reviewTitle": "Good",
                "reviewText": "Good book. It is Fun to Read a book we can relate to! Not enough books like this actuallyI recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LJ Nelson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 21, 2020",
                "reviewTitle": "5 stars – True love knows no bounds!",
                "reviewText": "I adore LGBTQ stories, but I’m ashamed to admit that all of my reads have been predominantly m/m. The Secret of You and Me is my first f/f read, but do you know what?! The Secret of You and Me was one of the best second chance romance stories I’ve ever had the pleasure of reading!Nora and Sophie’s story had me on a rollercoaster of emotions. My poor heartstrings were being pulled left, right and centre. In fact, scratch that rollercoaster analogy – it was like being on the waltzers. And I hate the flipping waltzers but call me a masochist (shut it!), I loved every heart stopping word of their journey *sighs*.Has ever a love story been so hard fought?! But if anything is worth fighting for it’s love. Sorry, my sap level is currently set to high *palms face* Fair warning, I may start gushing soon. (Hormones have a lot to answer for, don’t they?!)Secrets and lies abound in TSoYaM. I may say I don’t, but you all know I love a bit of angst and, boy, did I get it! I wanted to do some head knocking (quelle surprise). I may have also threatened certain pieces of a character’s anatomy *shrugs*. I apologise for nothing. It was very much deserved...Yet doesn’t the truth always find a way to be revealed? At the end of the day, don’t we at least have to be true to ourselves? I’m all about the questions today, aren’t I? Oops! *snorts*I cried (a few times!). In fact, the end of Chapter Twenty One had me sobbing my heart out. I’m such an ugly crier *rolls eyes*.As you can imagine, TSoYaM tackles some sensitive issues and the tricky subject of prejudice. *sighs* I hate that is still a very real issue in our world today. I keep my fingers crossed for one day, one day, when who we love no longer matters.Yes, *nods* I agree. This is definitely one of my most cryptic reviews to date. I just want you to go in blind and let Nora and Sophie tell you their story their way. Are they without flaws, heck no, but doesn’t that make them all the more relatable? Oops, I did it again *giggles*.I was amazed at how quick I read this book. I just got lost and didn’t want it to end.My first Melissa Lenhardt read, and I hope, by no means by last.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maddy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 29, 2021",
                "reviewTitle": "really enjoyed",
                "reviewText": "I found the characters hard to get on with at points although the boom was very enjoyable. It was nice finding an lgbt book too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hope Freed, UK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 2, 2020",
                "reviewTitle": "Pretty perfect second chance romance",
                "reviewText": "There are some long reviews of this so I’ll keep it brief. I was lead to this by author Clare Lydon raving about it. It didn’t take long before I was invested. Personally I liked the conflicts, the secrets (and even the angst) but I LOVED Nora’s dialogue battles (especially with the dreadful Brenda) and her feistiness. I really didn’t know how it was all going to be resolved (which is a pleasant change in lesfic!) but ended up feeling happy at the outcome. Proof also that not giving vivid gynaecological descriptions of sex can pay off...and even add to the sexiness!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs CJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 11, 2020",
                "reviewTitle": "Brilliant",
                "reviewText": "With all the twists and turns I couldn’t put it down until I got to the HEA. A really good read that had me in tears quite a few times. Loved the Characters too, and that like us all, they also had flaws.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}