{
    "remaining_requests": 2095,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beyond-Break-Heather-Buchta/dp/0593097017",
    "body": {
        "name": "Beyond the Break",
        "price": "$10.72$10.72",
        "originalPrice": "",
        "rawPrice": 10.72,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beyond-Break-Heather-Buchta/dp/0593097017",
        "soldBy": {
            "sellerID": "A1ZWVJTZO5RWFA",
            "name": "ZBK Wholesale",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1ZWVJTZO5RWFA&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81kI96ZnRTL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Heather Buchta",
            "link": "https://www.amazon.com/Heather-Buchta/e/B089NZX466/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ZBK Wholesale",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 223,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review A YALSA Amazing Audiobook About the Author Heather Buchta graduated from Loyola Marymount University with a B.A. in communications, but she'll tell you the real B.A. in college is learning how to pay bills. After receiving her National Certificate in Youth Ministry Studies from the Archdiocese of Los Angeles, she directed youth ministry programs and confirmation classes for both Catholic and Protestant churches. In addition, she taught high school English for a decade in South Central LA. Today, she is a part-time youth pastor for The Rock Covenant Church. In her free time, she enjoys traveling, obstacle-course racing, rock climbing, and snowboarding. She lives in the beach cities of Los Angeles, where she dotes on her dog and writes stories from her indoor porch. Beyond the Break is her first novel. Excerpt. © Reprinted by permission. All rights reserved. Chapter OneThe first time a guy felt me up was in the big church prayer room.All the parents of youth--group kids thought church lock--ins were a fantastic “outreach.” So many sign--ups from non--church kids for a night of innocent fun playing sardines and capture the flag, with the gospel message given! Even if “Jesus died for you” was thrown into the five minutes between Oreo--eating contests and discussions about which church Justin Bieber attends, seeds were planted!It must be from the Lord.Well, it wasn’t, unless the Lord was the one fanning the flame of rumors about the endless possibilities at lock--ins. Dark rooms. Dark hallways. Lots of games requiring dark rooms and hallways.I was in ninth grade, and this was my first lock--in with our high--school youth group. I had just graduated from junior--high youth group and was nervous, but I had my two best friends Kelly and Lydia, so it was okay. We were playing sardines, where one person hides in the church building with the lights off, and then the masses are released to find that person. After finding the “hider,” you hide with him or her until there’s one dogpile of quiet, giggly teenagers waiting for that last scared--poopless soul wandering in the dark after watching everyone disappear.Please don’t let me be the last one, I prayed to Jesus. Oh, and thank you for the cross. I always felt guilty asking God for something without at least thanking him, too. Lydia, who was Catholic and didn’t go to my church except for lock--ins, had sashayed off with some tenth--grade guy named Max, so I was hand in hand with Kelly. “My goodness, don’t leave me, Lovette,” Kelly begged, but then released my hand and turned a corner into the main sanctuary. When I turned the corner, she was nowhere.“Oh God—-I mean, gosh.” I squinted at the shadowed pews. “Kelly!” I whisper--yelled. Nothing. I felt my way, back pressed against the wall, searching for a glimmer of movement. A few outlines crept across the balcony, everyone searching for Tim.Tim Rainsforth was a junior and a leader on our worship team, SQUAD, so he’d nominated himself to hide first. I’d never find him. He spent, like, six days a week here and for sure knew every inch of this place.My hand bumped against the doorknob to the prayer room. I’d been here once before, when I asked God for help with my pimples and making the volleyball team, and thanked Him for dogs and the weather. Inside, I couldn’t make out much, but I knew the space was tiny: just a rug, a couch, some pillows to kneel on, and a card table draped with a cloth. On one wall were curtains and a cross. On the opposite wall was a Bible verse: “And we know that all things work together for good to those who love God. Romans 8:28.”Something brushed my leg, and I jumped. My foot landed on a pillow, and I toppled to the ground. An arm wrapped around my stomach and pulled me in.“Shh . . . ,” he said, and I sighed with relief. Tim. I’d found him. And first!We were under the card table, and the cloth draped to the ground, so until our group became bigger than four, this hiding place was killer.“Wow!” I whispered. “Nice spot!”“Shh,” he repeated, but I could tell he was grinning, proud. Someone opened the door, and I held my breath. The person was feeling the walls like a blind person reading braille. He or she tapped the top of our card table. I could feel Tim wrapped around me, a leg on each side, and I suddenly forgot about the game. Was this allowed? Sorry, Jesus, sorry, Jesus, sorry, Jesus. My heart thumped loud enough to give us away. Sweating this much had to mean sin. I started to move, but Tim held me firmly. I swear he was more still than a statue. He was so good at this! Tim was always somehow on the winning Ultimate Frisbee or capture the flag team. He also picked the teams. The shadow--person moved the pillows and left the room.“Fooled!” Tim whispered.Okay, it’s just legs wrapped around you. It’s just a body. He’s just trying to win. I repeated these lines like a memorized Bible verse. As guilty as I felt, I liked his legs around me. I scrunched my eyes shut. God heard that. Were legs around me considered going too far? How far was too far?We heard another noise outside the door—-someone tripped on a hymnal, probably—-followed by a thump and laughter. Tim responded by clutching me tighter, but his hand accidentally cupped my bra, and I sucked in my breath like someone had walked into the room again. Oh God, oh God, oh God and not gosh because I really meant God. My eyes started to adjust, and I could see his purity ring pressed against my bra. I know I should’ve felt giddy or whatever people feel when hot guys do this, but it was so shocking, I could only gape.Oh God, does this mean I don’t like guys? I mean, gosh.Tim was really good--looking and popular, but this was really weird. He had never held my hand, but now he was holding my boob. I was no relationship expert, but I thought we were skipping some steps in this whole “courting” thing. Didn’t he just give a talk on this? Through the crack in the tablecloth, I knew the cross was peeking back. Jesus was glaring at me for sure. There’s no way He’d let me make the volleyball team now.“Um . . . ,” was all I could say.He looked down at what he was holding, and his eyes went wide. “Sorry,” he whispered. “I didn’t—-I swear I didn’t realize—-you kept moving and—-shit.” He let go like my breast was on fire. “What’s your name?” he stuttered.Something near the small of my back pressed against me. His hand? Oh no, wait. Ew. I leaped forward, knocking my head on the table. Two people entered the room.“I heard that,” one whispered. I was too busy rubbing my head to tuck myself back under the table.They scrambled over and kicked into me.“Way to kill my hiding place,” Tim grumbled. I could see the outline of his mini Bible sticking out of his pocket. My face flooded with embarrassment. How inexperienced did someone have to be to get a Bible confused with an erection?Anyway, that was two years ago. Tim wasn’t a jerk afterward, either, or weird. Or anything, really. He was always nice to me, and sometimes I wonder if he even knew it was me. We couldn’t fully see each other in the dark, and if I’m honest, back then, my boob could have doubled for a flat stomach. Anyway, that’s the most I’ve ever done with a guy by a long shot, and I’m proud of it. After all, I’m in eleventh grade and live in Los Angeles! I’m like a walking miracle.Tim goes to community college now, and sometimes I see him in big church, but mostly on holidays with his parents. I hear he still plays guitar but more for gigs, and he wears a puka--shell necklace like a lot of the surfers do, except he doesn’t surf. Or maybe he does, and that’s where he lost his purity ring. It’s not on his finger anymore.Chapter OneThe first time a guy felt me up was in the big church prayer room.All the parents of youth--group kids thought church lock--ins were a fantastic “outreach.” So many sign--ups from non--church kids for a night of innocent fun playing sardines and capture the flag, with the gospel message given! Even if “Jesus died for you” was thrown into the five minutes between Oreo--eating contests and discussions about which church Justin Bieber attends, seeds were planted!It must be from the Lord.Well, it wasn’t, unless the Lord was the one fanning the flame of rumors about the endless possibilities at lock--ins. Dark rooms. Dark hallways. Lots of games requiring dark rooms and hallways.I was in ninth grade, and this was my first lock--in with our high--school youth group. I had just graduated from junior--high youth group and was nervous, but I had my two best friends Kelly and Lydia, so it was okay. We were playing sardines, where one person hides in the church building with the lights off, and then the masses are released to find that person. After finding the “hider,” you hide with him or her until there’s one dogpile of quiet, giggly teenagers waiting for that last scared--poopless soul wandering in the dark after watching everyone disappear.Please don’t let me be the last one, I prayed to Jesus. Oh, and thank you for the cross. I always felt guilty asking God for something without at least thanking him, too. Lydia, who was Catholic and didn’t go to my church except for lock--ins, had sashayed off with some tenth--grade guy named Max, so I was hand in hand with Kelly. “My goodness, don’t leave me, Lovette,” Kelly begged, but then released my hand and turned a corner into the main sanctuary. When I turned the corner, she was nowhere.“Oh God—-I mean, gosh.” I squinted at the shadowed pews. “Kelly!” I whisper--yelled. Nothing. I felt my way, back pressed against the wall, searching for a glimmer of movement. A few outlines crept across the balcony, everyone searching for Tim.Tim Rainsforth was a junior and a leader on our worship team, SQUAD, so he’d nominated himself to hide first. I’d never find him. He spent, like, six days a week here and for sure knew every inch of this place.My hand bumped against the doorknob to the prayer room. I’d been here once before, when I asked God for help with my pimples and making the volleyball team, and thanked Him for dogs and the weather. Inside, I couldn’t make out much, but I knew the space was tiny: just a rug, a couch, some pillows to kneel on, and a card table draped with a cloth. On one wall were curtains and a cross. On the opposite wall was a Bible verse: “And we know that all things work together for good to those who love God. Romans 8:28.”Something brushed my leg, and I jumped. My foot landed on a pillow, and I toppled to the ground. An arm wrapped around my stomach and pulled me in.“Shh . . . ,” he said, and I sighed with relief. Tim. I’d found him. And first!We were under the card table, and the cloth draped to the ground, so until our group became bigger than four, this hiding place was killer.“Wow!” I whispered. “Nice spot!”“Shh,” he repeated, but I could tell he was grinning, proud. Someone opened the door, and I held my breath. The person was feeling the walls like a blind person reading braille. He or she tapped the top of our card table. I could feel Tim wrapped around me, a leg on each side, and I suddenly forgot about the game. Was this allowed? Sorry, Jesus, sorry, Jesus, sorry, Jesus. My heart thumped loud enough to give us away. Sweating this much had to mean sin. I started to move, but Tim held me firmly. I swear he was more still than a statue. He was so good at this! Tim was always somehow on the winning Ultimate Frisbee or capture the flag team. He also picked the teams. The shadow--person moved the pillows and left the room.“Fooled!” Tim whispered.Okay, it’s just legs wrapped around you. It’s just a body. He’s just trying to win. I repeated these lines like a memorized Bible verse. As guilty as I felt, I liked his legs around me. I scrunched my eyes shut. God heard that. Were legs around me considered going too far? How far was too far?We heard another noise outside the door—-someone tripped on a hymnal, probably—-followed by a thump and laughter. Tim responded by clutching me tighter, but his hand accidentally cupped my bra, and I sucked in my breath like someone had walked into the room again. Oh God, oh God, oh God and not gosh because I really meant God. My eyes started to adjust, and I could see his purity ring pressed against my bra. I know I should’ve felt giddy or whatever people feel when hot guys do this, but it was so shocking, I could only gape.Oh God, does this mean I don’t like guys? I mean, gosh.Tim was really good--looking and popular, but this was really weird. He had never held my hand, but now he was holding my boob. I was no relationship expert, but I thought we were skipping some steps in this whole “courting” thing. Didn’t he just give a talk on this? Through the crack in the tablecloth, I knew the cross was peeking back. Jesus was glaring at me for sure. There’s no way He’d let me make the volleyball team now.“Um . . . ,” was all I could say.He looked down at what he was holding, and his eyes went wide. “Sorry,” he whispered. “I didn’t—-I swear I didn’t realize—-you kept moving and—-shit.” He let go like my breast was on fire. “What’s your name?” he stuttered.Something near the small of my back pressed against me. His hand? Oh no, wait. Ew. I leaped forward, knocking my head on the table. Two people entered the room.“I heard that,” one whispered. I was too busy rubbing my head to tuck myself back under the table.They scrambled over and kicked into me.“Way to kill my hiding place,” Tim grumbled. I could see the outline of his mini Bible sticking out of his pocket. My face flooded with embarrassment. How inexperienced did someone have to be to get a Bible confused with an erection?Anyway, that was two years ago. Tim wasn’t a jerk afterward, either, or weird. Or anything, really. He was always nice to me, and sometimes I wonder if he even knew it was me. We couldn’t fully see each other in the dark, and if I’m honest, back then, my boob could have doubled for a flat stomach. Anyway, that’s the most I’ve ever done with a guy by a long shot, and I’m proud of it. After all, I’m in eleventh grade and live in Los Angeles! I’m like a walking miracle.Tim goes to community college now, and sometimes I see him in big church, but mostly on holidays with his parents. I hear he still plays guitar but more for gigs, and he wears a puka--shell necklace like a lot of the surfers do, except he doesn’t surf. Or maybe he does, and that’s where he lost his purity ring. It’s not on his finger anymore.Chapter Two Waves. I’m thinking of waves the first time I meet him. Maybe it would’ve been different if I was thinking about God. But I’m not. I’m imagining the waves lapping at the beach, one swell cresting higher like it’s winding up but then delivering smooth and even, perfect for riding the line. I don’t notice that someone’s asked me a question until the second time he asks. “Have we met?” It’s 8:55 p.m. on Monday, toward the end of my shift at Billy’s Buns, and I’m staring at a six--inch hoagie layered with roast beef and cheese. No onion, lettuce, pickle. A plain guy. But when I look up at him, he’s anything but plain. I notice his eyes first—-big, dark -brown eyes that make me feel like I’m someone he knows—-and then his shoulders, the kind guys get only after high school. His light -brown hair’s longer than it should be but just barely, which makes it adorable when he blows it out of his face. I suddenly feel ridiculous in my mousy flop of brown hair smushed to my scalp by a hairnet. Holding up the yellow -and white bottles like maracas, I’m double--fisting the mustard and mayo, one in each hand, asking him which, but through the plexiglass, he grins and shakes his head. Neither. This isn’t your future husband, I remind myself. God would never have me meet my future husband like this. Ordering a sandwich from me? No way. Besides, God’s not introducing us to each other in high school. I know. We’ve got a plan, and it’s not happening my junior year. I look down at his sandwich. Did I mess up his order? No, he said plain. I look up at him, my throat dry. “Did I . . . ?” “I’m Jake,” he says. “Jake Evans?” He says it like a question, like his last name should ring a bell. Kim, my coworker, takes the next lady in line. “Lovette,” I manage. “I know,” he says, and I freeze. How does he know me? Then Jake points to my name tag, and I laugh. “Right.” At the cash register, the plexiglass no longer separates us. There’s something vaguely familiar, but I can’t place it, like the feeling of seeing an old friend. “Lovette,” he repeats. “That’s different. I like it.” “Thank you,” I say, busying myself with the bill. “Six fifty.” “Can you add a coffee?” I look at the clock. He notices. “Two--hour drive ahead of me.” “Of course. Cream and sugar?” “Nah. Just black.” Definitely out of high school. He hands me a ten, and I make change for him. Why is my hand shaking? Not because I’m interested. Definitely not interested. I don’t date. I wonder if this is what God means when He says, “The flesh is weak.” My hand is weak, but my heart knows better. There’s no way college--shoulders Jake is for real. I feel my whole body exhale when he turns to leave, but then he stops. U--turns. I suck in my breath. “Lovette, what time’s your shift over?” I shake my head, unable to speak, trying to convey “never.” “Right now,” Kim pipes in and hands me my time card. “I, uh, have to race home.” “Well, then,” he says, smiling warmly. “You better hurry.” He holds up his sandwich bag. “Thank you.” I nod way too vigorously, and he turns and leaves. Everything in me collapses, and I rest against the counter for support. Kim nudges me so the lady can pay for her sandwich. I clock out, turn the open sign to closed, and remove my hairnet and apron. “Are you out of your mind?” Kim whirls to face me as soon as the lady exits. I grab my backpack from the back room, ignoring her. “Hello?” I fiddle with my phone. “Too old for me.” “No, he wasn’t!” “Yes, he was. Did you see his shoulders?” “That means he works out, not that he’s forty!” I fumble with my backpack zipper, my hand still not cooperating. As I pull my swimsuit out of my pack, I mumble, “I don’t date, remember?” “So?” “So,” I say and head to the bathroom to change. Once I’m outside, the beach breeze blows cool against my sweaty neck. I unlock my bike by the light of the moon, coast down the three blocks to the ocean, and then ride ten short blocks south, parking at Old Man Mike’s place. He’s my old surf coach from when I was a kid, a retired guy who lets me stash my bike in his side yard. And my wetsuit. I wriggle into the neoprene, and it’s a bit of a struggle since it’s still damp from yesterday. With my legs and arms suctioned in the suit, I reach over my shoulder and pull the zipper up my back. I get goose bumps from the cold, and my teeth start chattering, but it’s worth it. It’s always worth it. I hurdle over the pile of towels, his skateboards, and his two surfboards, then back out the gate. I jog through the alley to the boardwalk, empty except for one lone cyclist with a flashing light. The cold sand squeezing between my toes, I walk onto the beach, look out at the majestic expanse of dark water, and charge at it in full sprint. The moon, whose reflection makes a walkway from me to her, shimmers as white water explodes and crashes at my feet. I don’t hesitate before I leap into the ocean and dive under the cool, churning waters. A smile starts deep inside of me and finishes on my face. The heavens declare the glory of God. This is where I’m home. I don’t know why I feel more alive in the water than on the land, but it’s like I can float and fly and dive, and nothing’s impossible, and the world’s okay. It’s where I feel closest to God, like He’s holding me on all sides and reminding me, “I’ve got you.” And I feel His embrace most in the waves. I don’t care if they crash over me, if they tumble me, if I get tossed around, because even when I’m submerged, I still feel safe. When it all settles, I know the ground’s right there. An hour later, I walk into my house, my hair still tangled and wet from hosing it off at Old Man Mike’s. I wrap it in a T--shirt as I walk down the hall. Dad pokes his head out of my parents’ bedroom. “Hi,” he whispers. “Mom’s already asleep. How was the Y?” Usually he says, “How was it?” so I don’t feel like I’m lying when I say, “Great,” but today, he asks how the YMCA was—which is where he’s assumed I go every day since it’s right next to my work, and I come home from Billy’s Buns with wet hair. I’ve never corrected him. “Hmm?” I say because I hate lying. Like hate hate it. There are certain sins you do without thinking about them, and that’s bad enough, knowing sin put Jesus on the cross. But lying’s one of those sins that you know you’re doing, and that’s just mean to Jesus. It’s like saying you’re His friend while hammering another nail on that cross. “How was it?” I exhale, because the YMCA’s no longer part of his question. How was it? It could mean anything. “Good! Really good,” I say. He comes into the hallway, closing his door. Darts a look back toward their room. “Matty’s coming home next month to surprise your mom for her birthday.” My brother’s in his third year at UC Santa Cruz, and he’s way closer to my parents than I am, but I’m fine with that because when he was younger, he almost died. If I had a kid who was basically brought back from the dead, every day with him would feel like my birthday. “Hey.” Dad puckers his lips, brings his face close to my scalp, and inhales. “They cleaning that pool at the Y?” I don’t answer because, again, the lying thing. “You don’t smell like chlorine.” “Oh,” I say to his second statement. “I rinsed off before I came home.” Which is true, and once again, I’ve avoided lying. But I feel a little twisty in my stomach. Dad salutes me. “Well done, soldier,” he says, which is kind of dorky, but I like it, because he musses my hair and it makes me feel like he’s proud and I’ve changed the world a little. I enter my room, close the door, and apologize to God for my non--lie lies. My mind drifts back to Jake Evans. Why did he want to know when my shift was over? Was he really interested? I’ve never been interested in dating. I mean, why bother entertaining those thoughts if I’m not going to marry the guy? And I’m definitely not getting married until I finish college, which is, like, in six years. So he’s off--limits, which means thinking about him now would only be bad. Remember King David? He thought about Bathsheba when she was off--limits and ended up having sex with her and getting her pregnant, then sending her husband to the front lines of war to cover his butt. No, thank you. But what if I think about future Jake Evans—-like the Jake Evans that I meet again six years from now. I can dream about that Jake . . . right? He would love animals, build houses for the homeless, and lead worship, and we’d go on night hikes, live on the ocean, and swim twice a day. His shoulders would be the same, I think as I sink into my pillow. They’re already perfect. Chapter Three At youth group two days later, I’m still in the parking lot looking for Kelly when I see her wave and hop off the brick wall she’s sitting on. That should’ve been my first clue. Kelly doesn’t hop. She moseys. Her feet don’t leave the ground when she walks. Her hair’s always in a messy bun, with that single inch--wide streak of purple bright against her blond. One of the leaders blows the conch, which means we’re starting the group game downstairs in five minutes. Church has been a second home to me since sixth grade, and there’s a rhythm to it that I’ve come to love. Big--group game, followed by same--sex small groups, and then back together for worship and prayer. I love the pattern of it, the routine. Every week, I know what I get. Lydia tried to explain to me once that’s why she loves her Catholic church. Something about tradition, and how we’re creatures of habit, and something else that I’m sure’s all good, but there’s no way I’d ever leave my church for hers, not when this place is the reason I love God so much. Or at all. “Did you see him?” Kelly says and squeezes my hand. She loves touching people while she talks. “Who?” “Who!” she squeals back, which doesn’t help me. She twirls my hair into ringlets. “You’re going to say ‘hit’ with an S in front, you’ll see, but I call dibs.” Is someone back from college? Sometimes old youth--group kids come back to visit for a night. Whenever it’s a guy, the girls swoon, like being out of high school makes him perfect boyfriend material. Of my two best friends, Lydia’s the crazy one, but Kelly’s usually mellow, so seeing her like this means she must like this guy, whoever he is. I’m guessing Tim Rainsforth. It’s like a movie premiere when he comes back on his semester breaks. The music blares from the speakers downstairs, something about eternity, and the way the drums and the bass pound, it makes me feel like heaven’s gotta be way better than roller coasters or bungee jumping. Kelly loops her arm through mine as we walk down the steps to the youth room, side--hugging anyone we pass. Brett, our youth pastor, is on the microphone as we enter. “Hey, hey! There are three large squares on the carpet I made with painter’s tape. Find your way into one of those squares.” The carpet’s so thin that you could sweep up a spilled can of Coke with a broom. Or drape it with long pieces of painter’s tape. Our youth room is how I imagine college apartments. Mismatched, comfy couches. A Ping--Pong and foosball table in one corner. Three Nerf basketball hoops. The walls covered in posters of extreme sports—-a skier midair with a snow cliff above, a rock climber hanging from a precipice by his fingertips, a base jumper sailing through a bottomless sky—-and on each poster, a quote about living for Christ. Some kids start yelling, “Poop deck!” and divide themselves up between the three carpet “squares.” Brett laughs. “Yes! We’re playing poop deck! It’s about to get ‘lit’ in here, you know what I’m sayin’, brahs?” He doesn’t notice the groans and eye rolls. Brett is the best youth pastor. He doesn’t talk to us like we’re five, or yell at us to stop chatting when we’re playing games. The only problem is that he tries to talk like a teenager, but he uses the words in all the wrong places. No one cares, because for the most part, Brett puts up with way more than our parents would. And his talks make you get so fired up for God. “Okay, okay.” He holds the microphone close. “Miggity--miggity--mic check! For the one person who grew up in a cave and hasn’t played this game, here are the rules. There are three large squares in the room: poop deck on the left, half deck in the middle, and quarter deck to the right. If I yell ‘Half deck!’ everyone run to that square. If you’re already in that square, you’re safe. Our leaders will be the refs. Last two people to each square are out. Oh, if I call ‘Hit the deck!’ you’ve all gotta jump down to your bellies. Last two people to the ground are ‘Bye, Felicia.’ If you’re one of the last five remaining, you win—-wait for it, wait for it—-a five--dollar gift card to Two Guns Espresso.” Everyone keeps talking and giggling over him, but Brett doesn’t care. “And one, two, three . . . poop deck!” Instantly fifty teenagers scramble. Kelly and I are already in the poop--deck square, so she embraces me in a bear hug like we’ve already won. The square’s not big enough for fifty teenagers, and it’s a giant mosh pit of laughter and squished bodies. “There he is!” she says in my ear. I try to turn my body around, but I can only stretch my neck. In the corner of the square, his eyes, barely above the other heads, look back at me. Deep -brown eyes peeking out of his slightly too long hair. It can’t be. The refs must’ve pulled the last two people out from that round because I hear Brett holler, “Hit the deck!” and the masses drop to the ground. I don’t. I can’t. Everything in me’s stiff as a surfboard. Not sure I even blink. “Ooh, Lovette, no replay needed,” Brett says through the microphone. Candy, one of the youth leaders, touches me on the shoulder to move me to the wall with the others who are out, now four of us. What’s he doing here? How did he find me? Did he ask my coworker Kim, and did she rat me out? It’s too much. I step outside for some air. “You okay?” someone says in my ear, and I practically jump out of my clothes. It’s Candy. She’s in her thirties, and holy Bibles, she’s intense about the Lord. “Oh. Yeah, just needed a bathroom break.” “Praise God.” “I suppose.” Should I praise Him for that too? “I just mean you looked like something was wrong. I thought you might need prayer.” “Don’t we all?” I smile. “Amen.” She extends her arm for a high five. I slap her hand. Should I tell her about Jake? I imagine her praying in tongues over me for protection. “Thanks, Candy. I’m good.” “No one’s good but God.” “Right. Okay, well, I’m just gonna go pee.” “Be blessed!” she calls. On my way back to the youth room, someone taps me on the shoulder, and I jump again. What’s with Candy sneaking up on me? Then I remember she’s probably on “pot patrol.” Every week, one of the adult leaders is designated to do the rounds of the church property, making sure that none of the teens are slinking away to engage in activities that would make Baby Jesus cry. We call them the “pot patrol.” I turn and say, “I swear I only peed,” but I’m face--to--face with Jake Evans. He grins and scratches his head right above his ear. “I’m not keeping score.” Chapter Four “Ohmygoshyou’renotCandy.” I’m more breathing than talking. “No,” Jake says. “Candy would’ve probably told you not to swear.” I smile and stop. “Wait, how do you know that?” He starts to say something and then doesn’t. He cocks his head, and his hair falls to the side. “You really don’t remember me.” “Of course I do,” I say, as professional as I can. “You bought a sandwich from me.” He smiles, looks up at the ceiling, and then down again. “Yes. Yes, I sure did. I, uh”—-he rakes his hand through his hair—-“I was in youth group here in sixth grade. It was called Fire, right? The first year you started coming to church. Mine too.” “How do you—-” “We were new the same night. I remember because I was so glad they didn’t make me stand in front of the group by myself.” I’m drawing a blank. That following year was rough for me, but I don’t remem—-and then I look. Really look. Dark -brown eyes. It’s a faint memory, like the wisps of a dream as you wake up. “Jacoby,” I murmur. We weren’t close; I mean, not that I remember. Not sure we even talked. “Just Jake now.” “You were so little,” I blurt. He really was. Like a doll. Scrawny with a buzz cut. “I’m sorry, I just—-” “No, no. I get it.” He laughs. “Yeah, I was a drop in the bucket. Anyway”—-he motions toward the youth room, and we start walking back—-“I just moved back. Well, for the weekdays. Long story. Military brat.” I feel my shoulders relax. “Me too. Military kid, that is. Well, Dad’s retired.” “Yeah? Look, we weren’t that good of friends back then. But I remember you. Maybe your name stuck out. When I saw you at the sandwich shop, I thought, she has to be the same Lovette. Anyway, I was going to tell you all that when you got off work, but you rushed off, so . . .” Oh man, I feel like such a tool. He wasn’t trying to flirt with me at all. “I’m sorry,” I say, and I don’t feel the giddiness of that first night. I just feel kind of self--absorbed. He shoos my words away with his hand. “Please. I shouldn’t have bugged you at work. Probably looked like a creeper. Anyway, I’m a senior, and it really sucks being the new kid. Just was trying to—-” “No, I get it! And I’m so sorry. It was one of those days.” Was it? Am I non--lie lying again? He repeats, “One of those days,” as if he had one, too, and now I wish I did have one. We enter the youth room as kids are filing out to their small groups. “Oh, by the way,” I say. “You’re in room fifteen. Senior guys.” “Right. Thanks.” He smiles again. He has a dimple in his left cheek. “I’ll, uh, see you back in here for worship?” I nod, and he turns to go, but then he turns back. “Hey, do you still surf?” Something catches in my throat, stopping my words. I lick my lips, and I can taste my Dr Pepper ChapStick. I shake my head. At least it’s not a lie—-it’s true, I don’t surf—-but it feels as crummy as a lie. “Aw, that’s too bad. You were amazing.” The compliment warms me, and I find my voice. “Eh. Maybe for a sixth--grader.” “Nah. For anyone. You could’ve competed against high--schoolers back then.” Wait. That means he does remember more about me than just my name. The rest of youth group’s a blur. In our junior girls’ small group, Kelly draws designs on my jeans with her finger as we all talk about effective ways to evangelize at school. The girls are having side conversations about “the new guy,” who really isn’t the new guy but the old guy who’s just been out of town for five years. Only Kelly knows this. “Jacoby Evans,” she whispers in my ear as Nicole suggests leaving encouragement notes from Jesus in student lockers. “Just Jake now,” I whisper, and Kelly stops drawing on my jeans. “I ran into him at the bathrooms.” Charlotte suggests making cookies and giving out plates of them for free with a Post--it that says friendship with Christ is free too. “I can’t believe how different he looks,” I say. He’s nothing like I remember. Kelly shifts like the floor got uncomfortable. “Oh, but you still don’t date, right? Besides, I totally said—-” “You guys would make a cute couple,” I say, and I squeeze her arm to emphasize it. “I just mean he used to be so little, I didn’t even recognize him.” “Right?” She resumes squiggling on my pant leg. Back in the youth room, I sit in the front row. I need time to think about God. To sing and remind myself how much I love Him. To remember His faithfulness to me back in seventh grade. The ways He totally took care of me when no one else did. And my single simple promise I made back, not because I had to, but because I wanted to. By the end of worship, it’s a no--brainer. God has given Jake to be my friend and maybe Kelly’s boyfriend. As soon as I hear the final “Amen,” I stand to exit, but Kelly’s hand finds mine. “Kel, I gotta jet,” I say. “You can hang for two seconds. Let’s just make sure he feels welcome.” I look over at Jake, and there are at least two guys and four girls already talking with him. “He looks like he’s doing fine.” But she’s already pulling me, weaving in and out of teens and chairs and trash cans full of empty chip bags and Capri Suns. I recognize Dave among them, leaning on a table, strumming his guitar. He’s not on the worship team or anything. He just likes to bring his guitar everywhere. “—-so bummed you’re not at Mira Costa High,” one of the girls (Carrie, I think) says. “My aunt lives closer to the 405,” Jake says. “So it was either Hawthorne or the charter.” “Ooh, Hawthorne High,” Dave says, and there’s a collective wince from the group. “Yeah, definitely the charter.” The charter? As in Maritime Academy? “Hey, Lovette goes there,” Dave says as he sees me. “She could show you around.” Wait, no. “Jake, this is Kelly,” I say quickly, then add, “She—-” “I remember you from Fire,” Kelly jumps in, releasing my hand to shake his. “Oh, right!” He gives her a friendly handshake, but he glances at me, and I wonder if he remembers her. “Hey, how are you?” “Same. I mean, not same since then, but, you know, nothing much. You?” Oh boy, she’s nervous. I should help. “Kelly goes to Maritime too. She also attends this poetry thing on Tuesday nights at this coffee shop.” He looks from me to her. “It’s a great way to meet people,” I add. “Yeah,” Dave says, plucking his guitar. “It’s cool. I’ve played some of my songs there.” “Kelly can tell you the details,” I say, nudging her forward. “I’ve gotta go.” “Stay,” Kelly pleads. “I’m on my bike, and—-” “But you always stay for at least fifteen.” I back out and wave. “I know, but I’ve gotta hurry.” Jake says, “One of those days again?” I see him grinning at me with that dimple, and I laugh, and he laughs, and then I realize we have our first inside joke. “Yeah, something like that.” I take the stairs two at a time to my bike and pedal down the long driveway before anyone’s made it back to the parking lot. Maybe I should’ve given him my number or a place to meet at school where I can show him around. But that all feels wrong as I picture the look in Kelly’s eyes when she saw him. My feelings feel like sin and not sin at the same time. Dark blurs of trees and houses whiz by, and I look up at the night sky. Clouds cover the moon tonight, and I try to pray but everything feels jumbled, so I settle on one word. Help? Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 10 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 16 hrs 10 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "For fans of Sarah Dessen and Jenny Han, Beyond the Break is a funny and gorgeous debut about a girl experiencing her first love. Well, second, if you count her faith... and that's where things may get complicated.Manhattan Beach native Lovette has two rules in life. One: no surfing. Not after her brother's accident. Two: absolutely, no dating. And going into her junior year of high school, she's pretty happy with that arrangement. She has friends, her church youth group, and God to fall back on when things get dicey. But after Jake Evans walks into her life, following these two simple rules gets a lot more complicated. Jake is the boy from Lovette's childhood who grew up. Handsome and sweet, he unlocks the part of Lovette that wants nothing more than to surf the waves again. And as their relationship grows, she begins to question what it means to be faithful: to her family, to God, but mostly, to herself. Told with humor and heart, Heather Buchta delivers a sparkling debut that asks the question: Can you fall in love, be a teenager, and also be a good Christian?",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Workshop (June 2, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593097017"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593097014"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 - 17 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.88 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#49,235 in Books (See Top 100 in Books) #3 in Teen & Young Adult Christian Relationship Fiction #121 in Teen & Young Adult Fiction on Dating & Sex (Books) #389 in Teen & Young Adult Contemporary Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 223 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "RCL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6GUWNNEJIXTEPMOCQGTB3ACRDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NVQO1K8HL0B5?ASIN=0593097017",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Awesome Book",
                "reviewText": "Heather Buchta in her first novel hits it out of the park. If you're into YA faith based novels, this is a must read. Ms. Buchta creates vivid characters and really zeros in on the church youth group culture. One might say some of the characters are cliche, however, there not cliche because every youth group has them: The hyper spiritual person who can sometimes be cruel, the friend who just comes to be with the crowd and the boy who comes just to get a girl. She weaves solid teaching in with a good story that doesn't pull punches or saccharin over the tougher parts of growing up and falling in love. If your a teen reading it, you will totally relate and if an adult, it will bring you right back to your awkward high school days and struggling to grow up and figure out how life works. Can't wait for her next novel.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Celeste Harrison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5ZTH5FTWRPTGANCJ7XTW4PNUYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D6XHEJ7VJ684?ASIN=0593097017",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2020",
                "reviewTitle": "5.0 out of 5 stars A book that make you happy!!!",
                "reviewText": "Love. Love. LOVE! Beyond the break was such a fun read for me! I am not one who usually reads YA, but I found this refreshing and just an enjoyable read. The characters are sweet and innocent and yet deal with real teen issues. Lovette is a sweet young girl who is struggling with real issues of purity and commitment to God. As a Youth Pastor, I felt like these were the kids in my youth group! I could hear their hearts and their struggles with their faith, their daily life and learning how to not just be a Christian by going to church or youth group, but to live their lives as real authentic Christians.Even if you’re not a Christian, it’s a fun read and filled with the friend and family struggles most teens experience. Great read and would highly recommend it! -and shout out to my sister Lovette! I’ve never seen that name in any show or book before!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ReadWriteShop",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHEZIBAXLUUEJZXAYMK6J67KBOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R85QBFWVOPE1H?ASIN=0593097017",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Really well written!",
                "reviewText": "Favorite part was Lovette’s relatable relationship and conversations with God; very endearing and touching to see in a teenager. And the humor is a close second!But I’m not gonna lie, I’m super disappointed in the ending! Are we getting a sequel? Inquiring minds want to know!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sometido",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGFTDHFJ7Q52ETMDOPUNK2V45IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJP48QD1DKDGY?ASIN=0593097017",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 28, 2022",
                "reviewTitle": "5.0 out of 5 stars Sweet",
                "reviewText": "I liked the romance in this book quite a bit, and I also like the main character. I’d rate this book for ages 12+ (Because there are some scenes that might be triggering, so keep that in mind)",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina Del Rosario",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2ZRJOP6P4CNVENL4BJMAQ6GUXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R8ZYMB1CZK0P?ASIN=0593097017",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 16, 2022",
                "reviewTitle": "5.0 out of 5 stars Can I just say how much I LOVED the ending!",
                "reviewText": "I really enjoyed this book, a nice change from what I usually read! I really loved the ending and wished there was another one to see what happens further with Lovett and Jake",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cc120510",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAYK3PSLFF4Z2T5P3XUKHEYT7IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BQ3CNQSI8C1G?ASIN=0593097017",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2020",
                "reviewTitle": "5.0 out of 5 stars 15 yo daughter, who hates reading, loves it!!",
                "reviewText": "My 15yo, non reader, mentioned that she'd like to read this book after seeing it advertised on IG...so of course I jumped on the opprotunity. She started it 2 days ago and almost has it finished! I don't think I've ever had this happen with her! Looking into books that are similar to keep this ball rolling!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sun & Snow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFC7Y2NURIQD3HBA3TLFPZP7UNSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4L3B1RLHQJ31?ASIN=0593097017",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2021",
                "reviewTitle": "5.0 out of 5 stars Great message in a great story!",
                "reviewText": "Great story! My daughter devoured this book in two days. Perfect message for young people with the beach lifestyle as the background. Looking forward to the author’s future writings!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "josh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESDF2AMXR2UHT6VSF6QNUUYAXGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J3FSICUNQVKA?ASIN=0593097017",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "1.0 out of 5 stars Not appropriate at all!",
                "reviewText": "This is not an appropriate book for young Christians. The description is completely misleading. I get that not everyone has the same values, and that's obviously totally ok 100%. Just please don't try to mislead people to make a buck. We're all trying our best out here. Just be honest about what you're selling so we can all make informed decisions.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}