{
    "remaining_requests": 2259,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hating-Game-Novel-Sally-Thorne/dp/0062439596",
    "body": {
        "name": "The Hating Game: A Novel",
        "price": "$8.38$8.38",
        "originalPrice": "",
        "rawPrice": 8.38,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hating-Game-Novel-Sally-Thorne/dp/0062439596",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/717uYVw9SSL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sally Thorne",
            "link": "https://www.amazon.com/Sally-Thorne/e/B01BLQYDKY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 41547,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “‘Hating someone feels disturbingly similar to being in love,’ says Lucy Hutton, who can’t stand fellow executive assistant Joshua. There’s only one place this could go…but it’s good fun getting there.” — People“Sally Thorne satisfies hearts longing for laughter in their love stories….Their battle of wits is tremendously fun—acerbic and sexy and filled with tension. The result is a wicked, witty romance that will capture readers’ hearts long before Joshua manages to capture Lucy’s.” — Sarah MacLean, Washington Post“Five feet tall and a total oddball, [Lucy] carries the plot by being engagingly self-deprecating, quick-witted and funny. There’s not even an infinitesimal flicker of doubt about where the story is headed, but along the way Thorne reveals an astute command of office politics and the often demeaning realities of workplace dynamics for women. The chemistry between Lucy and Joshua is also gratifying, with both seeming like fully conceived characters rather than passive stereotypes. If there’s nothing new to discern here, it’s at least a vibrant take on an old standard.” — New York Times Book Review“If you miss romantic comedies, the kind that were so funny, you would pay $15 to see them in the theater—plus the cost of popcorn and candy—this novel will make you very happy indeed...The rising tension and Thorne’s biting dialogue will make you wish for the romantic comedies of days gone by—or just more books like this one.” — NPR Books“A breezy tale perfect for a day at the beach, this one’s a real winner.” — Kirkus Reviews (starred review)“A brilliant, biting, hilarious new voice. THE HATING GAME will take the rom-com world by storm. One of the best I’ve read, ever.” — Kristan Higgins, New York Times bestselling author“Funny, smart, fresh, and thoroughly enjoyable from the first delicious page to the last. I highly recommend.” — Susan Elizabeth Phillips, New York Times bestselling author“Thorne is a strong writer and one to watch. Her debut will have readers rooting for both Lucy and Joshua in whatever games they play.” — Library Journal“An addictive, dazzling debut. The Hating Game is bursting at the seams with love (and hate) and heart.” — Christina Lauren, New York Times bestselling author“Deliciously fun and super sexy, Sally Thorne’s The Hating Game stole my life for two days. I couldn’t put it down until Lucy and Josh’s all-consuming hateship changed into a tentative friendship and then a juicy, tender, adorable love.” — Meghan McCain“Be prepared to play the Charming Game with Sally Thorne. The irrepressible Lucy and her starchy, growly counterpart Joshua will win you over from the opening page.” — Elizabeth Jane Howard, author of the Cazelet Chronicles“Some of you might have traveled to the beach for the sole purpose of escaping the office, but we think this funny and romantic workplace comedy just might change your mind…. we know you’ll find their story entertaining and sexy.” — Bookish“Romantic comedy is harder than it looks. …[The Hating Game's] sharp, sexy… candy-like in the best way…it’s a very good quality romantic comedy.” — NPR's Pop Culture Happy Hour“If your reading catnip includes dialogue that crackles, cranky heroes with hidden depths, and vivid, self-assured heroines who take exactly zero crap from said hero, find yourself a copy of this book immediately.” — Sarah Wendell, Smart Bitches, Trashy Books From the Back Cover Lucy Hutton and Joshua Templeman hate each other. Not dislike. Not begrudgingly tolerate. Hate. And they have no problems displaying their feelings through a series of ritualistic passive-aggressive maneuvers as they sit across from each other, executive assistants to co-CEOs of a publishing company. Lucy can’t understand Joshua’s joyless, uptight, meticulous approach to his job. Joshua is clearly baffled by Lucy’s overly bright clothes, quirkiness, and Pollyanna attitude.Now that they’re up for the same promotion, their battle of wills has come to a head and Lucy refuses to back down when their latest game could cost her her dream job. . . . But the tension between Lucy and Joshua has also reached its boiling point, and Lucy is discovering that maybe she doesn’t hate Joshua. And maybe he doesn’t hate her either. Or maybe this is just another game. About the Author Sally Thorne is the USA Today-bestselling author of The Hating Game. She spends her days climbing into fictional worlds of her own creation. She lives in Canberra, Australia with her husband in a house filled with vintage toys, too many cushions, a haunted dollhouse and the world’s sweetest pug. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 28 mins",
            "FREE delivery February 29 - March 5 on orders shipped by Amazon over $35",
            "Or fastest delivery February 28 - March 1"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“I want to live inside Sally Thorne’s brain.\" —Emily HenryNow a movie starring Lucy Hale and Austin Stowell, USA Today bestselling author Sally Thorne’s hilarious and sexy workplace comedy all about that thin, fine line between hate and love.Nemesis (n.) 1) An opponent or rival whom a person cannot best or overcome. 2) A person’s undoing 3) Joshua TemplemanLucy Hutton and Joshua Templeman hate each other. Not dislike. Not begrudgingly tolerate. Hate. And they have no problem displaying their feelings through a series of ritualistic passive aggressive maneuvers as they sit across from each other, executive assistants to co-CEOs of a publishing company. Lucy can’t understand Joshua’s joyless, uptight, meticulous approach to his job. Joshua is clearly baffled by Lucy’s overly bright clothes, quirkiness, and Pollyanna attitude.Now up for the same promotion, their battle of wills has come to a head and Lucy refuses to back down when their latest game could cost her her dream job…But the tension between Lucy and Joshua has also reached its boiling point, and Lucy is discovering that maybe she doesn’t hate Joshua. And maybe, he doesn’t hate her either. Or maybe this is just another game.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Avon (August 9, 2016)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062439596"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062439598"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 0.86 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,821 in Books (See Top 100 in Books) #472 in Contemporary Women Fiction #855 in Romantic Comedy (Books) #3,505 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 41,547 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Second First Impressions 99 Percent Mine The Hating Game Angelika Frankenstein Makes Her Match",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6f83dbc2-7f27-4cfd-ad76-fbc4582bc5c6.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/becea497-982b-4387-a40e-61b1d6715c16.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6aac9f2a-9c39-445b-bf91-82bb74b26810.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/88a3353f-e837-4ddb-90b5-f5053d068b7f.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/52f2c4ff-e5be-463d-9c7b-2bc6a8371efa.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/63b0af95-c2b0-4022-9883-4ffe4bee501a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e5cc3729-800a-4655-a4e5-c39d592bbcc5.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1cf6ca5c-292a-41bb-989f-e9aa45eb502f.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cynthia Bevill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJT6UPZI2OR5PQRHE6BATMG3QUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VEA8QIUZRQDK?ASIN=0062439596",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Best Feel Good Nooke EVER",
                "reviewText": "I loved this book and the movie! The Characters are real and believable, and you can't help but root for them!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Came in great condition ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGCECAOMXVNIPJU2VM2F4AJKJBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QS2286I5ZB2T?ASIN=0062439596",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Came a little scuffed",
                "reviewText": "The media could not be loaded. It was a bit messed up bc I got a used version but I loved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/10a174b4-77ae-4795-bcfb-3c036a7651fe/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Sua ChoSua Cho",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3YJJGUDAATMSDLMVRIQNUWITDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R302ANHHO8QA67?ASIN=0062439596",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2018",
                "reviewTitle": "5.0 out of 5 stars Get ready to say goodbye to your sleep and hello to the most charming male character!",
                "reviewText": "The Hating Game tells the story of Lucy and Josh, both are executive assistants to co-CEOs and we could say that they are complete opposites. They were working for different publishing houses before both companies decided to merge. Lucy is always full of life, she does everything to really create good relationships with people and she is always called nice, she also very much enjoys wearing bright colors and is often very bold with her color choices for clothing. On the other hand, Josh is extremely good with numbers, which makes others see him as brutal when it comes to the reports that he often receives and sends back because of the many mistakes that other workers make, he can be described as cold and lonely, always believing that relationships with others aren't as important as one's job. As you can clearly notice, their personalities are bound to clash. It is clear that Lucy and Josh absolutely hate each other, yet everything in their lives seems to circle around the other. For instance, they are always so anxious to make the other suffer without making the other co-workers notice, they are always planning to get in the plans of the other and they are always looking for ways to make the other stress, which is why when the announcement regarding the new position as CEO is made, Josh and Lucy are more than ready to compete against each other. Yet, both seem to know so much about the other that it may seem like they have spent a lifetime together, although they do utilize that information to make fun of the other.I just loved everything about this book! I fell in love with the plot, the scenes, the words and the characters!I want to start by talking about the book overall. I loved how funny it is! Everytime that I read it (which I have done about four times now), I laugh so much that my family thinks that I am crazy since they were quite used to me crying all the time while reading. The way the scenes are constructed are brilliant, they are so easy to imagine and be part of and you are able to feel all of those crazy emotions, like the shame, the warmth, and the laugh.I mean, the plot is one of those that most of us have either seen or read already several times because it follows the usual romantic comedy storyline, yet the way everything is narrated is so fun that I didn't even mind the fact that I knew how things were going to be, I was so trapped in this story that I was simply lost in this world.Regarding the characters, I was simply charmed by both. They were so good at their jobs, yet they were so childish, and from time to time they were so cruel to each other, yet they were so humane and they had such a heartwarming relationships with themselves that it really made them seem real and overall well-rounded characters with whom who could cry and laugh. I loved reading about their struggles, especially with family, and the way they reacted to those problems. I believe that by having such traits, the characters really reminded me that even people in real life have personal struggles that they hide and that those could be potentially limiting them in some sort of way.One of the things that I liked the most about this novel is the way the relationship progressed as a whole. It was interesting to understand how their feelings started changing with each other and how even though we don't get to read both points of view, we can start noticing their changes in character, which made their relationship more significant and in this case, Josh's actions and words much more special. Also, I loved how slowly things changed, in the sense that they didn't just become friendly with each other from night to day.Lastly, I absolutely loved the details! The small things were what really made this novel outshine others because it truly demonstrated how much the author cared and how much thought she put into the story. For instance, I absolutely loved the shirt's pattern and I still think about it almost every day.I can truly recommend this novel because it will bring you a lot of laughter, yet it will also bring you a little bit of warmth in your heart. Sally Thorne truly takes the rom-com genre and takes it to the next level in this hit-novel.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/715F5nsw4AL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hope",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWJEODZH4FNLQCPSPN6NHZTNOJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TH66FXIW2ZL9?ASIN=0062439596",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Mistaking hate for love",
                "reviewText": "This was one of the funniest and heart warming books I have read. Great dialogue.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DonnaC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZX5LSERQRKPJLN5R3CFHFBZL2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XLYZ8R90LDZR?ASIN=0062439596",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2016",
                "reviewTitle": "5.0 out of 5 stars Amazing enemies to lovers ~ effortless read and hilarious",
                "reviewText": "The Hating Game by Sally Thorne5 stars!!!“My hostage. My blackmailed, unwilling captive. Stockholm Shortcake.”There is nothing like a good hate/love book to get your reading mojo well and truly pumping and that is exactly what The Hating Game delivered. Sally Thorne captured everything about those office relationships where competition takes on a whole new meaning and to think that this is her debut novel, I was totally blown away.Enemies to lovers is one of those tropes that literally has me salivating. You learn more about a person through their actions in that kind of environment, especially in the work place. It is harder to hate than it is to love and there is often a very fine line between the two. Sometimes there is that genuine hate, because let’s be honest, there are a lot of douches and b****es in the world, but more often than not we hate as a veil of our true feelings and that was definitely the case with these two.“Shortcake, if we were flirting, you’d know about it.”“Because I’d be traumatized?”“Because you’d be thinking about it later on, lying in bed.”Two publishing houses struggling in the economic climate merge to ensure the viability of at least one of them, two CEO’s, two assistants. One male assistant, one female assistant who knock their a**es out week after week to be the best. This was all about one-upmanship. Who could work the longest hours, who was more efficient, who has the best ideas etc.: Their competitiveness was the source of many hilarious scenes, yet so relatable having been in a similar environment myself. But they loved to hate one and other, their inter-office games of “hate” had me laughing so many times and this book was written so well their story effortlessly flowed from page to page. This was an easy read, a real page turner.“The trick is to find someone who’s strong enough to take it. That one person who can give it back as good as they get.”Lucy Hutton was working in a place that she had dreamt of since she was a teenager. For her, publishing had always been her dreams albeit maybe not as a PA to the CEO. Her position had left her friendless because of everyone’s “snitch” mentality and her only source of enjoyment in her working day were her battles with Joshua. These two sat in the same office where daggers were drawn from clock in to clock out. Where juvenile staring competitions were the norm and trying to decipher codes and logins were their speciality.“I feel like your Easter egg.”Joshua was a whizz with numbers, he kept himself to himself and was definitely a closed book. He was an ornery man of rituals and order and was as predictable as they came. But who was Joshua Templeman? With a new position being made as COO, a promotion for Lucy or Joshua, battle lines are well and truly drawn as both know that neither one could work for the other. This was a fight to the death in more ways than one. Lucy begins to see a different side to Joshua when little chinks in his armour are slowly revealed, could this be who Joshua Templeman really is and god forbid Lucy for actually…falling in love.“The energy that usually lashes ineffectively inside each of us now has a conduit, forming a loop of electricity between us, cycling through me, into him. My heart is glowing in my chest like a bulb, flashing brighter with each movement of his lips.”The humour and banter in this book was contagious from start to finish, the dialogue was spot on and the chemistry was seriously off the charts. Even in hate mode you could feel those flickers of electricity and you were constantly on edge just waiting for them to ignite into a raging inferno. These two as enemies were hilarious, as lovers totally swoon worthy. I adored EVERYTHING about this book. I made the mistake of starting this late in the day and then read into the early hours of the morning, I couldn’t put it down. The characters were infectious, the plot was riveting and as each layer of Joshua Templeman was revealed my heart just got mushier and mushier. For those that love enemies to lovers this is a must read and the story will speak for itself.“This is the best game I’ve ever played in my entire life.”",
                "reviewVotes": "68 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeremy & Amber",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE443RVSRP3DWAXWZ3IU7MFT2ACA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36Q4RV1E3P3DA?ASIN=0062439596",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "3.0 out of 5 stars I saw the movie first",
                "reviewText": "Ive heard that people were mad about the movie/book difference but honestly I think they made a book that is very cute but sometimes a little immature and elevated it to be a little more realistic dynamic between the two main characters. Good book. Great movie.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 17, 2023",
                "reviewTitle": "LISTEN!!!",
                "reviewText": "Okay see this book? This book changes lives.This is the first romance book I picked up in the good year of our lord 2023 and I proceeded to spend the next 12 months CHASING the romantic tension high this right here darn novel gave me. I experienced my first ever ‘close the book to giggle and kick your feet in the air while screaming’ moment reading this book. Like.. the elevator… THE ELEVATOR.I digressAnyways I think I’ll go reread it now.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laesio Enormis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 24, 2023",
                "reviewTitle": "Binge-reading material",
                "reviewText": "I couldn’t put this book down. What I loved in it the most is that the whole story is a gigantic cliche, however, the way it’s implemented felt fresh and entertaining. In other words, some parts of the story managed to be non-cliche still.Some elements are annoyingly repetitive (Lucy being short and Josh being big and having a good body), but ultimately, it makes sense in terms of the dynamic between them and both of them protecting each other in different ways and in different situations.The two major plot-twists towards the end were completely predictable for me but the story and the characters were enjoyable and engaging notwithstanding.I give 5 starts in any case, cos in its category, this book stands for what it is meant to be: a captivating, enjoyable and entertaining easy read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Taleen Muwafaq",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on June 25, 2022",
                "reviewTitle": "Not my cup of tea exactly",
                "reviewText": "I kind of disliked the beginning of the book, all these games that made me confused. The end was pretty okay I guess, but it was pretty predictable. And then we have these damned tiktok stickers that are plaster at the front of the book smh…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emmi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 14, 2023",
                "reviewTitle": "Super witzig",
                "reviewText": "Ich hab das Buch vor der Verfilmung gelesen! Ich finds super lustig! Wie sie immer mit einander spielen aber insgeheim man schon weiß das sie sich lieben ist Mega zu lesen. Außerdem gibt es ein paar Wendepunkte die super süß sind.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scally",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 9, 2021",
                "reviewTitle": "Absolutely brillant!",
                "reviewText": "A million thanks to this author!!! I loved it! No typo, well written, fantastic love scenes. Nothing rude about them. I thoroughly enjoyed this novel. 🤩🤩🤩🤩",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}