{
    "remaining_requests": 2310,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cottage-Sea-Novel-Debbie-Macomber/dp/039918127X",
    "body": {
        "name": "Cottage by the Sea: A Novel",
        "price": "$7.99 $6.79",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cottage-Sea-Novel-Debbie-Macomber/dp/039918127X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81yY9+mx2qL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Debbie Macomber",
            "link": "https://www.amazon.com/Debbie-Macomber/e/B000AQ451E/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Jenson Books Inc and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 12389,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Romantic, warm, and a breeze to read—one of Macomber’s best.”—Kirkus Reviews“Macomber never disappoints. Tears and laughter abound in this story of loss and healing that will wrap you up and pull you in; readers will finish it in one sitting.”—Library Journal (starred review) “Macomber’s patented recipe of idyllic small-town life with a touch of romance is sure to result in a summer best-seller.”—Booklist “Macomber’s story of tragedy and triumph is emotionally engaging from the outset and ends with a satisfying conclusion. Readers will be most taken by the characters, particularly Annie, a heartwarming lead who bolsters the novel.”—Publishers Weekly About the Author Debbie Macomber, the author of It's Better This Way, A Walk Along the Beach, Window on the Bay, Cottage by the Sea, Any Dream Will Do, If Not for You, and the Rose Harbor Inn series, is a leading voice in women's fiction. Thirteen of her novels have reached #1 on the New York Times bestseller list, and five of her beloved Christmas novels have been hit movies on the Hallmark Channel, including Mrs. Miracle and Mr. Miracle. Hallmark Channel also produced the original series Debbie Macomber’s Cedar Cove, based on Macomber’s Cedar Cove books. She is, as well, the author of the cookbook Debbie Macomber’s Table. There are more than 200 million copies of her books in print worldwide. Excerpt. © Reprinted by permission. All rights reserved. CHAPTER 1Annie Marlow hated to disappoint her parents, but she simply wasn’t going to fly home to Seattle for Thanksgiving. She’d already made the arrangements for Christmas and it was too late to change everything now. She had plans.Working as a physician assistant, Annie didn’t get many four-day weekends, and Trevor was cooking a turkey and had invited her over for the day. Steph would be there, too, and they were both anxious to meet a cute young doctor who had recently joined the clinic at another site.What her mother really wanted, Annie realized, was a family photo for the Christmas card her parents routinely sent out each year. For all she cared, they could photoshop her in. There wasn’t any need for her to change her plans, especially now, less than a week before Thanksgiving.Gabby, her cousin, was flying to Los Angeles to join them. Giving up time with Gabby for a Christmas-card photo? Not happening. Besides, Annie had a new pair of four-inch designer heels and a dress she intended to use for a girls’ night out on the town.Her mother tried again, laying on the guilt. “Annie, please?”“Mom, you can’t change everything at the last minute like this.” She glanced at the time and inwardly groaned. Much more of this conversation and she’d be late meeting Steph for their yoga class.“Your brother is coming with Kelly and the baby.”This was her mom’s best inducement? Her brother? The favored son? She had already seen Mike and his family twice this year. “He was planning to be there for Christmas, too, remember.” Mike was the one who needed to change everything around. It was unfair that she should rearrange her entire life to suit her brother’s schedule.“We haven’t been together as a family since August.”Pressing the phone to her ear, Annie became impatient as her mother continued speaking.“You haven’t seen the baby in a while. Did you know Bella is walking already?”“I’ll see Bella when I drive up this Christmas. I’ll make sure to stop in Portland on my way through,” Annie protested. “Mom, please. We’ve been through this already.”Her phone dinged, indicating she had a text message. Putting her phone on speaker, she checked the text to see that Steph had sent her a selfie. Her friend was gorgeous, with her purple-tinged hair. She’d made a pouty face and looked like she was kissing through the phone.Annie laughed.“Annie? Are you laughing at me?”“No, sorry, Mom,” she said, squelching her amusement. “Steph just sent me a text.”“I’d so hoped you would change your mind.”“Sorry, Mom, really I wish I could, but I simply can’t.” Well, she could, but not without ruining her own plans. “You won’t miss me,” she said, trying to soothe her mother’s disappointment. “You’ll be involved with Kelly and the baby, and Dad will spend all of his time with Mike.” Bella would command all their attention; they cherished this first grandchild. To be fair, Bella was adorable. It was hard to believe she was walking already.“Promise me you won’t change your mind about Christmas, then, will you?” her mother asked. Annie had been given the chance to work last Christmas, and with money so tight, she’d jumped at the chance at double-time. Her parents had no idea what the cost of living was like in southern California, and how hard it was to make ends meet.“I’ll be home for Christmas, Mom, I promise.” She hated it when her mother doubted her. One time, one measly time when she didn’t get home for the holidays, and her mother refused to forgive her.“I’m sorry to harp on you,” her mother said. “It’s a disappointment is all.”“I know. I’m sorry, too, but Gabby and I have the entire weekend planned. If I’d known sooner I could have made other arrangements, but it’s too late now. It’s only a few weeks and I’ll be home for Christmas. I have my own life, you know.”Her mother’s frustrated sigh came through the line. “Don’t be like that, honey.”“Like what?”“Stubborn,” her mother countered. “Family is what’s important. I know you have a lot going on, but your father and I are getting up in age. We won’t be around forever, you know.”Annie couldn’t believe her mother. This was a new low when it came to making her feel bad, reminding Annie that at some point in the future her parents would die. It was ridiculous, seeing that they were both healthy and in the prime of their lives. Biting down on her lower lip, she resisted the urge to tell her mom that she was being absurd.Her mother seemed to sense that she’d gone too far with the guilt. “I have an idea,” she quickly rebounded. “Invite Trevor.”What her mother didn’t understand was that she wasn’t romantically interested in Trevor. She’d happened to mention his name a time or two, and she had yet to hear the end of it ever since then. Inviting him to Seattle would only perpetuate the idea that they were involved. He was a friend, and besides, Steph had set her sights on him. There’d never been any sparks between him and Annie. She liked him, though, and he was fun to hang out with. It didn’t hurt that he was a terrific dancer and being on the floor with him generated her a lot of attention.“You like him, right?”“He’s a friend, Mom, nothing more. Besides, you’re forgetting about Gabby. She’s already purchased her ticket. I’m picking her up at LAX early Wednesday afternoon.” Annie had already mentioned her cousin’s visit a dozen times or more.“Oh right.”Her mother had yet to recognize how unreasonable she was being. “I’m genuinely sorry to disappoint you, Mom, but this whole family Thanksgiving just isn’t going to work this year.”“Okay, honey, I understand. We’ll miss you.”“Mom, I really need to go.”“Okay. Just one more thing. I wasn’t going to tell you since I thought you’d be home for Thanksgiving, because I wanted to surprise you.”Time was ticking away. Grabbing her yoga mat and her bag, Annie headed for the front door of her condo.“Dad and I remodeled the kitchen. We bought all new appliances and countertops. You won’t recognize it!” Her parents loved their home and had saved thirty years to build it. It was on a hillside that overlooked Puget Sound. The views were stunning. Her parents had purchased the property years earlier and then diligently saved and sacrificed to build the home of their dreams.“That’s great, Mom. I’ll see it at Christmas. Love you.”“Love you, too.”“Before you go, your dad wants to say hi.”“He’s not going to pressure me about Thanksgiving, is he?”“No, silly.” She must have handed off the phone because the next voice Annie heard was her father’s.“How’s my daughter, the doctor?” her father asked. He’d wanted Annie to continue on to medical school.“I’m not a doctor, Dad.” Annie had grown tired of school. The breakup with her college boyfriend had devastated her, and she’d been eager to be done. Instead of continuing school to get a medical degree, she’d opted to become a physician assistant.“Someday,” her dad said. He never seemed to lose a chance to remind Annie of her dream of working in medicine. What he didn’t understand nor seem to appreciate was that she did work in medicine, just not as a physician.They spoke, and Annie found herself glancing at the time. “Dad, I’d love to chat more, but I’m meeting a friend.”“Bye, sweetheart.”“Bye, Dad.”Annie pulled into the gym at the last minute and found Steph impatiently waiting outside. Together they rushed into their class. Afterward, Annie felt worlds better, relaxed and in good spirits.They stopped for a smoothie at the juice bar, and while Steph wasn’t looking, Annie snapped a selfie of the two of them and tweeted it.“Let me see, let me see,” Steph protested and then laughed. “You’re bad.”“Hey, we both look great.”“Is it Gram-worthy?”Annie laughed. “Looks like it to me,” she confirmed, and posted the photo on Instagram, so Gabby would see it. She couldn’t wait for Gabby to arrive on Wednesday; Annie had looked forward to cousin time for weeks. The two were close in age and had been best friends nearly their entire lives. Gabby had recently ended a six-month relationship, and Annie intended to do everything she could to make her forget Geoff, starting off with a pre-Thanksgiving party with friends from the clinic at a popular night spot.Thanksgiving morning, Annie woke with a killer hangover. Her head felt like someone was inside swinging a sledgehammer, and her mouth was as dry as an Arizona riverbed. The incessant ringing of her phone, which was sitting on the nightstand by her bed, made it even worse. Caller ID showed that it was her aunt Sherry, Gabby’s mother. Why, in the name of all that was decent, was she calling Annie at this time of the morning? Gabby had checked in with her mom when she landed. She was more than ready to hand the phone off to her cousin, who rolled over and grumbled at the interruption.“Hello,” Annie barely managed to say, holding her hand firmly against her forehead, hoping that this would appease the tiny men inside her brain, so they’d stop hammering.“Annie.” Aunt Sherry’s voice was breathless, as if someone had knocked the wind out of her. “Oh Annie . . . Annie.”Sitting up in her bed at the sound of tears in her aunt’s voice, Annie asked, “Aunt Sherry, do you need Gabby? She’s here.”“No . . . no. I need to tell you.”“Tell me what?”A gasping sob escaped her aunt.Annie tensed and keeping her voice steady and low, asked, “Are you okay, Aunt Sherry?” Seeing how serious the conversation was sounding, Annie put the call on speaker for Gabby to listen in.By this time, her cousin had sat up and was rubbing the sleep from her eyes. The two exchanged looks and Annie shrugged, unable to decipher what was happening.“Do you . . . Do you . . . television . . . Is it on?” her aunt asked, barely getting the words out.“No. Aunt Sherry, for the love of heaven, just tell me what’s happened.” As Annie spoke, she reached for the remote and turned on the television, switching channels to the twenty-four-hour news station. She tuned in, and the first thing that popped onto the screen was a Thanksgiving Day advertisement from Macy’s, which told her nothing.Instead of answering, her aunt started sobbing. “It’s horrible, Annie. I . . . I don’t even know how . . . I don’t know . . . how to tell you.”As a physician assistant, Annie had often dealt with people in crisis mode. “Take a deep breath, count to five, then take another breath, and start at the beginning,” she advised her aunt in a calm, soothing voice. Her immediate suspicion was that something had happened to Lyle, the man her aunt had been dating for the last fifteen years. That didn’t make sense, though. She would have called Gabby if that had been the case.“I’m . . . trying.” Aunt Sherry counted softly, out loud, and sucked in another breath, just as Annie had recommended. “Your mom . . . and dad . . .”Annie tensed. “My mom and dad?”“They . . . invited me to breakfast.”Her mother had always made a big deal about breakfast on Thanksgiving, inviting family and friends over.“I . . . wanted to see . . . the baby . . . Bella.” Her words were staccatolike between sobs; she was having trouble even getting the words out.“Aunt Sherry,” Annie said softly. “Has something happened to my parents?”Her aunt ignored the question. “When I got . . . close . . . just . . . two blocks away . . .” She continued in the same jerky speech. “The police . . . they . . . stopped me.”“The police?” Annie repeated, her mind whirling. “What were the police doing there?”“They . . . had . . . It was barricaded.”“A barricade?” Annie hated that she sounded like an echo, but her aunt wasn’t making a whole lot of sense.“It’s . . . been raining . . . and raining.”“Well, that happens in Seattle quite a bit.” Annie impatiently added, “Especially around this time of year.” The Seattle area was known for its rainfall, which was another reason Annie chose to live in California.“Annie,” her aunt said, sobbing hysterically, while sucking in deep breaths between her words. “You . . . You . . . don’t understand, the entire hillside . . . is gone. It . . . simply . . . gave way, taking . . . taking everything with . . . it.”Gabby gasped at the news.Annie slowly rose out of her bed, standing with one hand pressing against her forehead while the other pressed the phone to her ear. “Are you telling me Mom and Dad’s house slid off the hillside?”“Yes,” Aunt Sherry said and gasped. “Their house . . . and . . . twenty . . . other homes.”Annie froze and glanced at the television screen. Breaking news had just interrupted the newscast. A helicopter was flying over the water, identified on the screen below as Puget Sound. A single home was breaking apart in the mud-caked waters below the helicopter and sinking into the water.“Mom and Dad?” Annie pleaded, as her heart pounded at the seriousness of what had happened. “Did they get out?”“I . . . I don’t know . . . I don’t know how they could have. Everyone said it happened so fast, and so early . . .”Annie fell back onto her bed, her legs shaking so hard they wouldn’t hold her up any longer. Her entire body began to tremble. “How early this morning?”“The officer said . . . it happened around four . . . They think . . . most everyone was still in bed. No . . . notice. No . . . warning.”The tightness in Annie’s chest made it impossible to speak. It was highly likely that her entire family had just been wiped out in a mudslide.Her mother.Her father.Her brother.Her sister-in-law.And her baby niece.Annie’s mind couldn’t absorb what she was hearing and seeing on the television. Her aunt’s sobs echoed in her ear and seemed to be reverberating against the walls of her head.“Annie?” her aunt sobbed. “Are . . . Are you there? Say . . . something.”“I’m here,” Annie managed to whisper. She inhaled and followed her own advice, counting to five and then breathing in again, hoping the technique would calm the rising sense of panic that threatened to overcome her. “I . . . I need . . . I’ll get there as soon as I can.”“Good. Have Gabby . . . make . . . Have her do . . . the flight arrangements.”“I will.” How calm she sounded, Annie thought to herself, but her voice wasn’t her own. It seemed to come from across the room somewhere. Her cousin placed her arms around her, hugging her closely. “Find out what you can before I get there.”“I’ll . . . do what . . . I’ll see what I can learn.”“There must be survivors,” Annie insisted, doing her best to think positively, convinced her parents had somehow found a way to escape. She had to believe they were alive, because anything else would be impossible to accept.“I’ll do . . . what I can. I promise, but . . .”“But what?” Annie demanded, her voice gaining in strength.“But . . . Annie . . . there’s little hope for survivors. I’m so sorry, so very sorry.” Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 17 hrs 33 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 17 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER • A seaside town helps one young woman reclaim the light after darkness in an uplifting novel from #1 New York Times bestselling author Debbie Macomber.“Romantic, warm, and a breeze to read—one of Macomber’s best.”—Kirkus Reviews Annie Marlow has been through the worst. Rocked by tragedy, she heads to the one place that makes her happy: Oceanside in the Pacific Northwest, the destination of many family vacations when Annie was a teenager. Once there, Annie begins to restore her broken spirit, thanks in part to the folks she meets: a local painter, Keaton, whose large frame is equal to his big heart—and who helps Annie fix up her rental cottage by the sea; Mellie, the reclusive, prickly landlord Annie is determined to befriend; and Britt, a teenager with a terrible secret. But it is Keaton to whom Annie feels most drawn. His quiet, peaceful nature offers her both comfort and reprieve from her grief, and the two begin to grow closer. Then events threaten to undo the idyll Annie has come to enjoy. And when the opportunity of a lifetime lands in her lap, she is torn between the excitement of a new journey toward success and the safe and secure arms of the haven—and the man—she’s come to call home. In this heartwarming tale, Annie finds that the surest way to fix what is damaged within is to help others rise above their pain and find a way to heal.Praise for Cottage by the Sea“Macomber never disappoints. Tears and laughter abound in this story of loss and healing that will wrap you up and pull you in; readers will finish it in one sitting.”—Library Journal (starred review) “Macomber’s story of tragedy and triumph is emotionally engaging from the outset and ends with a satisfying conclusion. Readers will be most taken by the characters, particularly Annie, a heartwarming lead who bolsters the novel.”—Publishers Weekly",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Ballantine Books; Reprint edition (June 18, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Mass Market Paperback ‏",
                "value": "‎ 448 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 039918127X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0399181276"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 4.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.1 x 0.96 x 6.9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#81,851 in Books (See Top 100 in Books) #1,769 in Family Saga Fiction #3,375 in Contemporary Women Fiction #21,522 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 12,389 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24a260c0-8ff7-475e-ac5e-b78614308542.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBKYN7P6NU6SC2V77SLROBBMUYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZWR3N0L53AP8?ASIN=039918127X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Book",
                "reviewText": "Very good book to read it will make you want to keep reading it and not put it down wonderful love story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "UtahNana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFC5Z73VT5OXY2EZ6G2WWVG5CTDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UDD183GB7W95?ASIN=039918127X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Enjoyed Very Much",
                "reviewText": "I loved this story, and I loved how the author finished the book. This is one of few books that I enjoy reading multiple times.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "linda estrada",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKF3RM6QXVCKIEIRWCBUDCUHJTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30QQ0QGT87L2D?ASIN=039918127X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Great book",
                "reviewText": "Love her stories great writer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Love2read",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSLSUMDXSNDWEJRPFQ5WNAQ3PCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA8B2LBTYMFFM?ASIN=039918127X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2018",
                "reviewTitle": "5.0 out of 5 stars Delightful if at times hard to read through the tears",
                "reviewText": "Debbie Macomber delivers a strong and emotional story that will tear at your heart in more ways than ever in COTTAGE BY THE SEA. With her trademark writing style, she delivers a story that is full of heart and at times lots of pain though tinged with hope. I loved this new release by one of my favorite authors. She created a story that is at times quite emotional, loving and with a sweep of her pen, romantic as well. When I first met Annie, she was full of life, hope and delight, determined to have a four-day weekend with her friends, to have fun without family obligations getting in her way. In all reality, a typical twenty-something who thinks she has the whole world to get to the heart of things later. As many know, life sometimes doesn’t deliver all rainbows and sunshine, especially when tragedy strikes. Annie made me love her and I in turn loved how she was able to finally breath, find peace and a chance to love once more. The small town of Oceanside worked its magic on Annie and I found it so irresistible. I was longing to see if this special town was real just to visit it one day. With each page I read, I was sucked not Annie’s story, of her coming to grips with her loss and finding her new normal; grieving yet also finding peace that has eluded her for over a year. The story flows so smoothly I didn’t know I was at the end of the book until I turned the page and saw there was nothing left of Annie, Keaton and their friends story.Ms. Macomber delivers a story that is at once powerful yet charming. A story that will stay with you long after you are done with the book. The characters made me laugh, cry, smile and sigh. I loved meeting Annie, Keaton and the residents of Oceanside so very much. Ms. Macomber has a knack to creating a story that leaves you breathless and longing for more. If you haven’t tried one of her books before, this is a perfect introduction into her writing. I do want to point out you may need a box of tissues at times as you fall into Annie’s life and loss. COTTAGE BY THE SEA is a fast-paced story that will leave you with a smile in your heart and on your face. I look forward to seeing where this author goes next as I know I won’t be disappointed with her next story.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary17",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENKF7N7YWOMMDVK3O5EBP7VVLWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q0MQABCGKUNT?ASIN=039918127X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "Fast reading",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carol v.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHS5RIFI3CIBLHCF7S4GODX47TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IC1DJR0M59M3?ASIN=039918127X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "I read most of Debbie Macomber books. And as usual this one was hard to put down. She draws you into a story and you become part of it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bookworm SarahD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDMUC6QA5R2XBROODF52SMO4ECA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KT99U2MLYTIP?ASIN=039918127X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2021",
                "reviewTitle": "3.0 out of 5 stars Sweet summer read",
                "reviewText": "This was my first novel by her. While I liked the premise of the story it wasn't hitting all my boxes. I just think personally it was her writing style...too sweet...too cheesey. The story had a good plot but at times rushed a lot, the timeliness felt off. She tended to repeat herself a LOT! I didn't feel as connected to the mc as I wanted. The sub characters had better personalities in my opinion.It wasn't a bad story or even written bad...just simply not my taste. Her work definitely has a home but this work did not for me. In time I may try another.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marjay's Reading Blog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMFN2WDLFHJSSSM5U4LRVNU5UZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F0PVE8GF46DT?ASIN=039918127X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2018",
                "reviewTitle": "5.0 out of 5 stars a sweet romance",
                "reviewText": "Debbie Macomber’s newest book, Cottage by the Sea is a sweet romance. There is no other description that works better. She takes characters that have been thrown curves in life (Curves that would take most people down.) and allows them to find a home with hope. This skill is highlighted in her newest novel.Annie was enjoying life as a young person. She had a great career, friends and had a fun time. When she was asked to come home for Thanksgiving, she declined having made prior plans. It was that simple plan that changed Annie’s world and now she needs to find a way to move on. It is hard to start again, so she goes to her last happy place, a small beachtown in the Pacific Northwest.Keaton has always known what it is like to be an outsider. He was big, ungainly and didn’t speak. He knew he was unloved and unlovable. He has a few friends and a life in the seaside town, when he saw the woman who was the girl he fell for so many years ago…Keaton and Annie have a chance to change their hopes and expectations, but along the way they bring Mellie and Preston. The ability to move beyond the past and start again. The story takes many twists and turns and each step allows you to fall deeper and deeper in love with the characters and their plight.This sweetness in a story is not my usual level of enjoyment. I like books that are a little edgier, but I will take a Debbie Macomber novel like this any day! It was a fast read, the characters, stories and problems to resolve. I was all in from the first.Thank you NetGalley for the opportunity to read this book. A Cottage by the Sea by Debbie Macomber is a great read.",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lesley A Shaw",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 22, 2021",
                "reviewTitle": "Poignant and sweet",
                "reviewText": "Brought back memories of my own dear departed husband. We spent many happy times on the western coast. Smiles and tears came easily. Love never fails.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vaishali",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 8, 2020",
                "reviewTitle": "Worth reading!",
                "reviewText": "A story well written, and with every chapter you get to understand the characters on a deeper level. Its not just the story of loss and sad times, but also that of friendship, love and hope- happy times.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jule",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 9, 2019",
                "reviewTitle": "Dive into Oceanside",
                "reviewText": "I really loved this book! The characters are so lovable and you really can dive deep into this book. I was so sad as I turned the last page. Hope to read again about Annie, Keaton and all their friends!!! Please Debbie ❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nikkib",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 17, 2018",
                "reviewTitle": "Well worth a read!",
                "reviewText": "I couldn't put this book down, Debbie Macomber has done it again - I'm biased as she is one of my favourite authors, if not my absolute favourite but this is a wonderful story of loss and finding love again back where you were happy, once upon a time when you were young.Annie loses her family in tragic circumstances and finds herself in a deep depression wondering how to get out of it, functioning day to day but not going anywhere. She goes back to her happy place and sets about finding her place in that community.I loved the characters and setting, one day I'll get to the Pacific Northwest to see what it's like for myself!Could there be another story about Annie in this? Who knows... I'm looking forward to the next new offering from Debbie now...",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jenny mathers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 19, 2022",
                "reviewTitle": "Easy reading",
                "reviewText": "Really enjoyed this story.A real tear jerker in places.Could happen to be anybody in our life.Thank u ♥️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}