{
    "remaining_requests": 2187,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/One-Italian-Summer-Rebecca-Serle/dp/1982166800",
    "body": {
        "name": "One Italian Summer: A Novel",
        "price": "$9.96$9.96",
        "originalPrice": "",
        "rawPrice": 9.96,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/One-Italian-Summer-Rebecca-Serle/dp/1982166800",
        "soldBy": {
            "sellerID": "A25H6JFKDMQ758",
            "name": "-OnTimeBooks-",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A25H6JFKDMQ758&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51dGIbBiUFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51h6-slTTzL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rebecca Serle",
            "link": "https://www.amazon.com/Rebecca-Serle/e/B005Y5SAL2/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "-OnTimeBooks-",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 13295,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Advance Praise for One Italian Summer: “Rebecca Serle is known for her powerful stories that tug at the heartstrings – and her latest is just as unforgettable.” —Woman's World“An unconventional love story that embraces people’s flaws and selfishness as part of what makes them human.”—Kirkus“Poignant and ultimately uplifting. The mouthwatering descriptions of Katy’s food and the lush Italian coast bring a strong, atmospheric sense of place. Recommend to fans of Helen Fisher’s Faye, Faraway (2021) and those who enjoy being transported to other countries through fiction.”—Booklist “A touching story…the mother-daughter bond is made palpable through Katy’s grief and desire for connection.” —Publishers Weekly\"Going down as easy as a limoncello on a hot summer’s day, this daydream of a story affirms what it means to love and be loved. An enchanting book for the last cold days of winter, but also suggest it to readers come summer.” —Library Journal“In these cynical times full of snark and memes, it’s nice to surrender to magic every now and then. Plus, the wanderlust that the book conjures is worth it as is….[A] story about love, loss and that point in adulthood where we learn our parents are human, too, and not always perfect.” —Associated Press“[A] moving novel.” —PopSugarPraise for In Five Years: “What would you do if you glimpsed your life five years from now—and found that it was different, in every way, from what you hoped for and expected? Rebecca Serle pairs this inspired premise with deft, propulsive prose and characters who feel as real as friends. In Five Years is as clever as it is moving, the rare read-in-one-sitting novel you won’t forget.” —CHLOE BENJAMIN, New York Times bestselling author of The Immortalists“Serle takes a fairly generic rom-com setup and turns it into something much deeper in this captivating exploration of friendship, loss, and love.” —Booklist\"The novel is about the real meaning of love and friendship and the bonds that tie us all together.\" ― Good Morning America“Heartbreaking, redemptive, and authentic in all the ways that make a book impossible to put down, I fell in love with this story. In five years, I will still be thinking about this beautiful novel.” —JAMIE FORD, New York Times bestselling author of Hotel on the Corner of Bitter and Sweet“I adored In Five Years, it’s so poignant and tender. It broke my heart, such an unusual idea executed brilliantly, I didn’t see that twist coming! I’m a sucker for great love stories, and this one is just lovely. A keeper on my shelf!” —JOSIE SILVER, author of #1 New York Times bestseller and Reese’s Book Club pick One Day in December“In Five Years is more than just a love story; it’s a half dozen of them, none quite what you expect. Heartwarming, heartbreaking, and hard to put down, it’s a novel about romance, friendship, the magic of good bagels, and what happens after you get everything you always wanted.” —LAURIE FRANKEL, author of New York Times bestseller and Reese Witherspoon Hello Sunshine pick This Is How It Always Is“A heartwarming portrait of a broken heart finding a little healing magic.” —Kirkus Reviews“Serle’s whimsical tale is book club catnip.” —Publishers Weekly“In Five Years is a profound tale of unconditional love and anguish with a touch of the mystical and mysterious.” —New York Journal of Books“You'll devour it.” —Marie Claire“Rebecca Serle has a way of blending a little bit of magic into the every day.” —HelloGiggles“Rebecca Serle has a knack for writing beautiful stories that speak to the anxiety of forging a new road for oneself, of being brave enough to start all over.” —Bustle“Be prepared for deep emotions, a few laughs, and possibly a few tears as well. Reading this book is truly an experience.” —Seattle Book Review About the Author Rebecca Serle is the New York Times bestselling author of Expiration Dates, One Italian Summer, In Five Years, The Dinner List, and the young adult novels The Edge of Falling and When You Were Mine. Serle also developed the hit TV adaptation Famous in Love, based on her YA series of the same name. She is a graduate of USC and The New School and lives in Los Angeles with her husband. Find out more at RebeccaSerle.com. Excerpt. © Reprinted by permission. All rights reserved. Chapter One Chapter One I’ve never smoked, but it’s the last day of my mother’s shiva, so here we are. I have the cigarette between my teeth, standing on the back patio, looking at what was, just two months ago, a pristine white sectional, now weatherworn. My mother kept everything clean. She kept everything. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 19 hrs 21 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 21 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 8 hrs 36 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "INSTANT NEW YORK TIMES BESTSELLER In this “magical trip worth taking” (Associated Press), the New York Times bestselling author of In Five Years returns with a powerful novel about the transformational love between mothers and daughters set on the breathtaking Amalfi Coast.When Katy’s mother dies, she is left reeling. Carol wasn’t just Katy’s mom, but her best friend and first phone call. She had all the answers and now, when Katy needs her the most, she is gone. To make matters worse, their planned mother-daughter trip of a lifetime looms: to Positano, the magical town where Carol spent the summer right before she met Katy’s father. Katy has been waiting years for Carol to take her, and now she is faced with embarking on the adventure alone. But as soon as she steps foot on the Amalfi Coast, Katy begins to feel her mother’s spirit. Buoyed by the stunning waters, beautiful cliffsides, delightful residents, and, of course, delectable food, Katy feels herself coming back to life. And then Carol appears—in the flesh, healthy, sun-tanned, and thirty years old. Katy doesn’t understand what is happening, or how—all she can focus on is that she has somehow, impossibly, gotten her mother back. Over the course of one Italian summer, Katy gets to know Carol, not as her mother, but as the young woman before her. She is not exactly who Katy imagined she might be, however, and soon Katy must reconcile the mother who knew everything with the young woman who does not yet have a clue. “Rebecca Serle is known for her powerful stories that tug at the heartstrings—and her latest is just as unforgettable” (Woman’s World) as it effortlessly shows us how to move on after loss, and how the people we love never truly leave us. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Atria; Reprint edition (March 7, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 288 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1982166800"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1982166809"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8.3 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 0.72 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,803 in Books (See Top 100 in Books) #181 in Women's Friendship Fiction #350 in Contemporary Women Fiction #2,682 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 13,295 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c51197a1-4a7f-4c3e-a6d1-d32f656cda24.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bf80b081-6904-4ac4-a1b4-b4fdff7d63cd.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b623982-dc0d-4442-8f08-c57dbe1644e2.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/87c11290-4fd7-4f68-8117-dc3836f94b8c.__CR0,0,1080,1080_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ellen Conway",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCCPE2RTDDUG3UZ2EE5BGCGKX5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HFG7ZB3PEUS7?ASIN=1982166800",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Great source for used books",
                "reviewText": "Delivered in a timely manner and book was in great condition",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BeckyW01",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5YPYDEQ75S7DGQHJHU2MUMY52A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW2FQCLG0OD9V?ASIN=1982166800",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Good non-sci fi book with a sci-fi element",
                "reviewText": "Books that involve some kind of time traveling element that make a character examine their lives in a new way are probably my favorite kind of books. This one had the added fun of the magical setting of Positano, which I have now added to my travel wish list. I enjoyed the setting, the whimsy, and the main character's interaction with another version of her mother as the main character process her own grief. I saw one twist coming but not all of them. All good stuff.The ending and one of the twists I did not see coming are what prevent me from giving this book 5-stars. I felt that the main character's self-evaluation wrapped up a little too conveniently. I can't say much more without spoilers, which I will detail below....SEMI-SPOILERSAfter all of her pondering about how she just drifted through life, let things happen rather than making things happen, including her own relationship, I was disappointed that she then....went back to her same relationship. It was a little too convenient that oh hai this was good after all. was it, though? Or was she just vulnerable and looking for something familiar?Also - the plotline of a woman leaving her underage children in pursuit of self-fulfillment is one that pops up periodically in fiction. The unstated (or sometimes stated) point is that hey, men having been doing this for years and everyone's fine with it, why is it not ok when women do with it? People: it's not okay for ANYONE of any gender to peace out on their underage children in pursuit of self-fulfillment. Yes, it's hard and it sucks, but it sucks ever so much worse for your confused underage child(ren) for whom you are the entire world. If my husband had peaced out to find himself when I had a six month old at home, I don't think I would have been waiting for him when he came back.So, a good read, and clearly made me think even if I disagreed with the conclusions.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sonia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6O5MK2LZ57LF32Z7IVSRF7X5QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CGBUT8HT25AN?ASIN=1982166800",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2023",
                "reviewTitle": "3.0 out of 5 stars Eric Doesn’t Deserve Katy!! I Want Him Instead!! Give Him To Me!! 😅",
                "reviewText": "Okay, first, I have to say that I didn’t choose this book; it was for my Book Club & it wasn’t my choice of book. I don’t really like magical realism, in general. Okay, that way of the way, I was really excited to get to read this book because I heard of Rebecca Serle before & knew she was supposed to be really good (& also because the audiobook is read by one Lorelai Gilmore herself of the show Gilmore Girls; LOVED that show when I was younger)! HOWEVER, unfortunately, I had a problem with the main character, Katy. I found her to be really unlikeable; she’s very selfish & very whiny! First of all, she leaves her ENTIRE grieving family & goes off to Italy, a trip that she was supposed to take with her mother before she (the mom) died. She doesn’t EVEN consider taking her dad on the extra plane ticket (her mom’s ticket); she actually doesn’t even asked him if he’ll like to go in the first place—let alone also leaving behind her lovingly & supportive husband who is the SWEETEST guy, it seems, (& who also didn’t do ANYTHING wrong, either) just because she’s “bored” of him—or @ least that was just the impression I got. Like she never really loved him; she just married him cause it was the “right answer” to the “Will you marry me?” question. So, then she gets to Italy & she meets her dead mom—but just 30 years younger (not a spoiler; this was in the little “summary” for the book) & a man called Adam … oh, Adam, you really didn’t need to be there … That’s the “romance” part of the book, I guess, if you can call it that …. 😒 Honestly, Adam came off as creepy & a little stalker-y to tell you the truth … I got the impression that he just wanted to sleep with Katy (which Spoiler Alert: he does! Totally not caring that she’s MARRIED & neither does Katy, it seems)!! I didn’t really FEEL the attraction between these two @ ALL!! It was just like “Oh, she’s cute, never mind that she’s married. Oh, he’s handsome, never mind that I’M married … ” , so they sleep together. That’s it … 😒 Where’s all the chemistry that usually comes with a romance?? Where’s that initial first spark?? (Even in the enemies-to-lovers trope, there’s usually that first “spark” … You can probably tell I read A LOT of Romances … 😅) And when they did sleep together, it was kinda … blah … No fireworks 🎆 , if you know what I mean … 😉 Like honestly, Adam didn’t have to be in the story at all … This could have been a lovely story about grief & coming to terms with losing your mother & then coming back to your husband … with NO Adam @ all ANYWHERE!! And that’s another thing: Katy’s relationship with her mother seemed REALLY unhealthy & co-dependent for a 30-year-old woman, even if you ARE really close to your mother. Like seriously, Katy asked her mother if she thinks it’s okay to start having KIDS!! Like, c’mon!! No, woman!! That’s not something you discuss with your MOTHER—even if you are close with her!! I’m siding with poor Eric (her husband) on this one!! (I sorta get “I broke his heart cause he was nice” (I’m a BIG Swiftie) vibe with their whole marriage.) Okay, now, for the BIG * Spoiler Alert * : we find out, towards the end of the book, that WHOLE time Katy sees her 30-year-old mom in Italy is because she’s gone back IN TIME to the 90’s!! Yep, time travel … Now, in general, I don’t like time travel books (unless they involve saving a hippogriff & a man who’s been wrongfully in prisoned for 12 years 😉; sorry, not sorry, I’m a HUGE Potterhead). Think ‘Back to the Future’ or like “Manifest”, the TV show, back in reverse, instead of 5 years in the future, Katy goes BACK 30 years in the PAST & the whole time she doesn’t REALIZE it!! I’m sorry, but HOW can you not realize it’s the 90’s!! Hello!! NO cell phones, big bulky computers, instead of iPads, the fact that EVERYONE has cash, not credit cards … !! 😒 I don’t care that everyone reacts to grief differently, but still … I would DEFINITELY notice if my iPhone wasn’t working … And that’s another thing: What 30-year-old doesn’t check her phone @ least once a day, even if she IS “trying to escape” her life back home (even just to take pictures; she IS in ITALY, after all! C’mon … !! 😒)!! This also means that Adam, the guy she CHEATED on her husband with, would be in his 60’s in the “real world” when Katy sleeps with him!! I’m sorry, WHAT?!?! And Katy doesn’t EVER question ANY of this or freaked out, either!! In fact, we (the reader) don’t ANY explanation for the time travel @ ALL!! Was it all just a crazy dream, alternative reality, a complete mental breakdown as a result of grief, what?! And that’s ANOTHER thing: we (again, the reader) never really FEEL Katy’s grief, either—@ least that’s the impression I got—we are TOLD (by Katy herself) that she was EXTREMELY (again to the point of it being unhealthy) close to her mom. We don’t get to see like a flashback—other than 30-year-old mom in the weird time travel thing—or something to when her mom WAS alive. Maybe if we got flashbacks, I would have FELT Katy’s grief better, instead of just being TOLD it by Katy herself … But, anyway, I gave it 3 stars ⭐️ because, in the end, I DID like the ending. 😊 Also, really liked the descriptions of Italy & Italian food … made me really want to visit Italy & try all the delicious Italian food that was mentioned! 👍🏻",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina Calderaio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMYH3TXY3U2JKBFW4WGNN7YNGJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1L7RWSVAKHZGY?ASIN=1982166800",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Read this book!",
                "reviewText": "Especially if you’re going to Italy, this book is a must read! My friend recommended it to me and it was so descriptive and such a great story. When I was in Positano, I happened to walk past the hotel where a lot of the story took place. It was like a movie scene! It’s so well written. I loved it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2PR7OBARKIUIGRR2GQQLY5S4QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VZ1MYS15GMDH?ASIN=1982166800",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "4.0 out of 5 stars A nice, summer story",
                "reviewText": "For the most part, I enjoyed this book. I had mixed feelings about Katy as a character, but thought the storyline was interesting. I especially liked the scenery descriptions of Italy; and all the food and drinks mentioned, of course.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dianne Woods",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK7MNA5O4OBXZ5PUZK4CSUJKZDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MTBC6IQB0VA?ASIN=1982166800",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars I loved this book!",
                "reviewText": "Definitely worth reading. It transports you just for a short time. Loved it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "grandma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUYVSXTXLAOJRKLLPMAIDJSTP7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WFHUDARLQ69Q?ASIN=1982166800",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2023",
                "reviewTitle": "4.0 out of 5 stars Four stars for the story & author.....one star for the publisher",
                "reviewText": "Love the story, had just gone to Positano this month with my daughter, son-in-law and son. She was reading this book by the pool at Hotel Poseidon where we stayed. So when we got home I decided to order the book to read. Hotel Poseidon is magical and we loved it. I love that its a story about mothers and daughters.But to the publishers of not only this book but others I've noticed lately. PLEASE make the print/ink darker, the print is very light and hard to read, I don't need glasses to read, but still find my eyes straining to read the print even in daylight by the window. I don't know if this is a way to save money on publishing the book or what but please stop scrimping on the ink. If so, how about an option to get it in darker printing, because it's so hard for most of us to read like that. Thanks.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynnie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 16, 2023",
                "reviewTitle": "Best book",
                "reviewText": "I loved this book so much. As soon as I finished I wanted to read it again! I highly recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JT",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 27, 2023",
                "reviewTitle": "What a BEAUTIFUL story!",
                "reviewText": "The way she transports you to Positano, the streets, the restaurants, the views! I loved this book. 100% recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KC'srock",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 13, 2023",
                "reviewTitle": "a story of dejavue perhaps",
                "reviewText": "This flashback in time puts into perspective how sometimes we are drawn to a place we have never been before but feel we know it so well. Fascinating story plus the description of the Amalfi coast has me booking my flight eager to experience some of its magic.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gaby O.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 27, 2023",
                "reviewTitle": "Appassionante",
                "reviewText": "Appassionante storia raccontata nella bellissima cornice di Positano.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dawnie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 16, 2023",
                "reviewTitle": "magical realism contemporary set in a dream location",
                "reviewText": "„history, memory is by definition fiction. once an event is no longer present, but remembered, it is narrative. and we can choose the narrative we tell - about our own lives, our own stories, our own relationships. we can choose the chapters we give meaning.“ (quote)this was wonderfuldifferent than expected -i didn’t know it involved some form of time travel- but great.honestly the only thing i disliked was the cheating.but that was thankfully a very short moment in the book.but i absolutely loved the mother/daughter relationship.how the daughter learns to understand not only herself but also that her mother (her parents overall) are not just her parents but their own people, with their own struggles and history. that they had their own dreams and ambitions and that while as a child your life and their life with you might seem perfect - maybe your parents wanted something else too. not because they are disappointed with what they have or gave up to raise t he r child but just cause they are human beings on their own beside being parents.this was fun and sad but also brilliant and entertaining.it shows the love for italy, how vibrant and life changing that country can be to anyone visiting and that it’s always a good idea to travel and trying to fin yourself first and foremost.can’t wait to read more by this author!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.46",
                "sellerName": "ZBK Books",
                "sellerRating": "4.5"
            },
            {
                "price": "$9.95",
                "sellerName": "Boyd’s Bookstore",
                "sellerRating": "5"
            }
        ]
    }
}