{
    "remaining_requests": 2137,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bride-Ali-Hazelwood-ebook/dp/B0C9GQV1TT",
    "body": {
        "name": "Bride",
        "price": "$11.99",
        "originalPrice": "",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bride-Ali-Hazelwood-ebook/dp/B0C9GQV1TT",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71VprhrGkJL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ali Hazelwood",
            "link": "https://www.amazon.com/Ali-Hazelwood/e/B08ZYW66XW/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4804,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 Indie Next Pick!A Hall of Fame LibraryReads pick!One of People’s Best Books to Read in FebruaryA dangerous alliance between a Vampyre bride and an Alpha Werewolf becomes a love deep enough to sink your teeth into in this new paranormal romance from the #1 New York Times bestselling author of Love, Theoretically and The Love Hypothesis. Misery Lark, the only daughter of the most powerful Vampyre councilman of the Southwest, is an outcast—again. Her days of living in anonymity among the Humans are over: she has been called upon to uphold a historic peacekeeping alliance between the Vampyres and their mortal enemies, the Weres, and she sees little choice but to surrender herself in the exchange—again... Weres are ruthless and unpredictable, and their Alpha, Lowe Moreland, is no exception. He rules his pack with absolute authority, but not without justice. And, unlike the Vampyre Council, not without feeling. It’s clear from the way he tracks Misery’s every movement that he doesn’t trust her. If only he knew how right he was…. Because Misery has her own reasons to agree to this marriage of convenience, reasons that have nothing to do with politics or alliances, and everything to do with the only thing she's ever cared about. And she is willing to do whatever it takes to get back what’s hers, even if it means a life alone in Were territory…alone with the wolf. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C9GQV1TT"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (February 6, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 6, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2437 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 410 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0593641035"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#50 in Kindle Store (See Top 100 in Kindle Store) #1 in Paranormal Vampire Romance #1 in Vampire Romances #2 in Paranormal Werewolves & Shifters Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,804 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c6bca59-6265-4634-95df-46b3312fdd7d.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/611c782a-5f4f-4e65-9248-f051b052ad78.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7b01c754-b25c-4b45-979a-899d3ca32d13.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a0fe143-622c-4261-b1f9-1ffecdbe14a1.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Miss Willa Colyns DiaryMiss Willa Colyns Diary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOD2VVABBTHHIEISGL5CUUU3OKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20EIREPR8WL1M?ASIN=B0C9GQV1TT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Thank you I’ll take ten more please!",
                "reviewText": "Words cannot describe the absolute ecstatic joy I felt when I found out that one of my all time favorite authors Ali Hazelwood was dipping her toes into the Romantasy/Urban fantasy/Paranormal romance genre with Bride. I went into this ARC with so much hope because I literally couldn’t imagine anything better than my favorite STEMinist leaping into my favorite genre and boy did Ali come prepared to knock my socks off! We get the beloved wit, charm, relatability and honesty that she injects into everything she touches while seamlessly stepping into the omegaverse. There’s nothing heavy handed or new feeling here, it’s like she’s been writing Fantasy her whole career. She nailed the pacing, world building, explanation of complex magical and political systems without feeling like an info dump. She masterfully played out the tension until it’s just ready to snap and has you furiously turning pages because will they or won’t they?! Our girl knows what she’s doing and does not belong stuck in just one genre, fling the doors open Ali is here to deliver!Bride is quite literally everything I had hoped for and so much more! I didn’t dislike a single thing. We get some of my absolute favorite tropes like he falls first, forced proximity, found family and touch her and perish. We get a FMC who you just can’t to scoop up and love and remind that she is so incredibly powerful even if she doesn’t know it yet. I altogether felt seen and heard by Misery in ways I haven’t felt since I read Love on the Brain last, (which is a constant reread for me) and as always Ali Hazelwood will have you closing this book feeling that much less alone in this world, even if ours isn’t filled with the paranormal. I just hope that this isn’t the last of her ventures into this genre (and others, go for it Ali!) because I’m ready to devour anything and everything she has to offer after she came out of the gate with this triumph. Can Ali write a bad book? I’m pretty sure the answer is a resounding absolutely not!Thank you so much for the opportunity to read for Berkley. My views are entirely my own.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71VcQkkpXIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "MarieCm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHXDDMJBJVOT7MDBEDHX4GK6EYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SV8E7PCSMSAF?ASIN=B0C9GQV1TT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "4.0 out of 5 stars What’s next!?",
                "reviewText": "As others have remarked, it’s a great book with occasional laugh out loud moments. Hazelwood has improved her writing again, with a lot of creativity so the book feels fresh (and not just another vampire romance) and a book to return to again and again.I hope that she improves on her world building and that she continues the vampire/were/human series - there’s so many questions that aren’t answered and I feel that would draw us in further. Of all her books, Lowe was my least favorite male lead - I think he treated the female lead terribly in one scene (and felt lukewarm in a bunch of others) and the commitment conflict was resolved in a way that seemed detached (Misery has to confront Lowe after Lowe just leaves Misery in vampire land and returns to his territory <<and he doesn’t tell her he’s leaving??? Not acceptable..>> ). These points aside, the other scenes in this book make up for it (e.g., the heartwarming scene where Misery meets Lowe as a wolf). I can’t wait for the next one!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "megan.reads.romancemegan.reads.romance",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7JM4QLJOW3TSMFO3BJ3TILJH3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MDN2Z8UKTGM6?ASIN=B0C9GQV1TT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars This book was SO FUN. 5 big stars!",
                "reviewText": "This was DELICIOUS IN THE BEST WAY. HERE for the Vampyre Were relations.Lowe freaking Moreland. That could be the full review and it would be perfect. But I can't stop there. Y'ALL. EVERYTHING ALI WRITES IS GOLD, but this book was SO FUN.Misery agrees to a forced marriage of convenience in order to enter Were territory to find the only friend she's ever had, who disappeared under mysterious circumstances. What she never expected was:1. A thoughtful \"husband\" who tried taking care of her, despite her \"smell\"2. Ana, whom she comes to care for quite quickly, and whose relationship had me LOLing any time the two conversed3. To find her sense of humor4. To find people who like her for her for the first time in her life and DESPITE the fact that she's an enemy to them in the rules of the natural worldThings I LOVED about this book:- THE BANTER and joking between the two main characters was so fun and flirty yet dry and clever- THE TWIST... to say I GASPED at the third act drama would be an UNDERSTATEMENT- Ana, Sparkles, Ana's shenanigans, Ana's replacement of words that *almost* make sense, all of Ana's existence in this book- Lowe's softer, gentler, more loving side (which is in no way saying he's a soft or gentle lover for Misery... but he is those things at the same time and it's MAGIC)- Lowe's obsession with Misery's fangs- Lowe \"reading Misery's file\" but also just his general need to know things about her- HONEY- Scenting- Feeding- Mates- Misery seeing Lowe as a wolf *woof*- Misery's obsession with baths that leads to Lowe's obsession with baths ;)- The way Lowe makes Misery feel like she BELONGS to someone, finallyThis book took me through all of the emotions, but mostly I just ENJOYED this book SO MUCH. Ali stan forever. Can't wait for book two! :)",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71IVZfjVz6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabriela Liarte",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 16, 2024",
                "reviewTitle": "Amei",
                "reviewText": "Nunca achei que leria um livro sobre vampiros e lobisomens. Só dei uma chance porque é um livro da Ali e amei!!!! Pra quem estiver na dúvida, é um ótimo livro de romance escrito em um outro universo!! Apenas leiam!!Ps: Ali, pelo amor de Deus, faz continuação desse livro. Vi ela falando no Instagram que talvez esse fosse o único livro de fantasia que ela escreveria. Não se atreva!!!! Hahahahah",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Verónica Amézquita Razo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 13, 2024",
                "reviewTitle": "Love it!",
                "reviewText": "Eli Hazelwood lo logró, pareciera que el mito del hombre lobo y vampiros ya no daría para otra historia y me sorprendió que lo utilizó para crear una historia de amor que nos permite fantasear con el amor único y eterno que el mudo de los humanos no podría tenemos de manera irrevocable, nos deja fantasear con lograr un pareja que quede prendada de nosotras y que nos reconozca como la única sin la que no podría vivir con una compatibilidad sexual de nivel instintivo, hermosa!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Morgan Rae",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 11, 2024",
                "reviewTitle": "Immaculate vibes",
                "reviewText": "I'm not sure what I was expecting but I devoured this paranormal romance! It felt like a different take on vampires and definitely left me wanting more of the world but not in a way that distracted from the story. Misery is hilarious and I loved witnessing her relationships and connection to the world! The spice was very delish! While the story of wraps up I wonder if there will be some more interconnected standalones?? I hope so!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 15, 2024",
                "reviewTitle": "Loved it",
                "reviewText": "As always, this one was such a fun book by Ali Hazelwood. It was cutesy, with lots of fun humorous bits and a well-thought out storyline. Loved it to bits!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rs",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 10, 2024",
                "reviewTitle": "Pues me ha encantao",
                "reviewText": "No sabía qué esperar y me ha encantado. Me ha encantado la protagonista, que es una de las cosas que más me cuesta encontrar en un libro. Misery es lista, divertida, independiente y genial. La trama me enganchó y el romance pues ya sabía que me iba a gustar, del estilo de la autora. Algunas cosas previsibles, pero no me quitaron disfrute",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}