{
    "remaining_requests": 2157,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Her-Ruse-Cursed-Duke-Historical-ebook/dp/B0CRJ5RTLF",
    "body": {
        "name": "Her Ruse with the Cursed Duke: A Steamy Historical Regency Romance Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Her-Ruse-Cursed-Duke-Historical-ebook/dp/B0CRJ5RTLF",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81YxIvHDE9L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Maybel Bardot",
            "link": "https://www.amazon.com/Maybel-Bardot/e/B0BP8YYN7X/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 127,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CRJ5RTLF"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Cobalt Fairy LLC (January 3, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 3, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3351 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#21,539 in Kindle Store (See Top 100 in Kindle Store) #145 in Historical British & Irish Literature #156 in Historical Regency Fiction #288 in Victorian Historical Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 127 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/f68cbef1-ae1c-48c1-9baf-ec0ad4a821e8.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/bf99345f-82fe-4900-bae5-026d22010406.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Star-ARC reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIGFBCNE66LOB3K3JDUBIXJXSAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDZJJLB0LLEVR?ASIN=B0CRJ5RTLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars He makes it possible for her to accomplish her list",
                "reviewText": "As a young lady of the 1800’s, Cassia Dowding had to do whatever the men in her life dictated. Her father raised her to believe this way although she felt it wrong that her brother, Edwin, and friend, Frederick, could live such carefree lives while she must stay locked in her home, taking lessons privately and being offered in courtship to only the elderly wealthy men of the Ton because her father needed to pay off his gambling debt. She accepted her fate of marrying not for love but for convenience of wealth but she had made a list of things she wanted to do before she was forced to marry. As fate would have it, her list falls into the hands of her brother’s best friend and her childhood teaser, Frederick Crawford, now the Duke of Seymour. Yet. Frederick doesn’t wish to use the list against her but wants to help her accomplish it because behind all that childhood teasing was a young man smitten with his best friends’s sister but unable to act upon it while her father was alive. But Frederick has just recently lost two important people in his life and he feels he is cursed, keeping him from allowing anyone else into his life. The two will come to a mutual agreement to fake a courtship to help each other out but as all such romances go they soon find it not so fake as they work at crossing off points on Cassia’s list and keeping two unwanted suitors away. The storyline is attention grabbing from the start with wonderful characters to keep the reader emotionally bonded and has several secondary characters involved in different scenarios to make the reader want to continue turning pages to see the outcome. Frederick is a bit of a rake with protectiveness when it comes to Cassia and their interactions together are all delightful. I did question the accuracy of the the man’s clothing on the front cover. He appears to be wearing too modern of a suit to fit the time period of the book. Book covers matter to me but for most probably not and it doesn’t effect the wonderful storyline of the book.I received a free Advanced Readers’ Copy of this book but was given no monetary compensation. I read for the enjoyment and voluntarily review so that others may know what to expect and authors may be helped by critique and encouragement.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXFEMW5RPSWLG5ELU3CBSZHBTWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JPRR9YG2JXYW?ASIN=B0CRJ5RTLF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Never torment a sibling",
                "reviewText": "What happens when a boy has a sister who follows him and his friend around everywhere? Well of course they torment her and she worships them. Then they all grow up and go separate ways, until a ball has them meet again. Only this time the girl is older and can hold her own against the friend. Thus is the story of Frederick and Cassie. Great banting takes place between the two. There is of course a villain and sudden turns in the story and it all leads to a fully engaging story filled with all types of fantastic characters. Another hit for this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gail Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWKS7F5EA5XPXS5VEKEHX7AZEMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DKYS04N1FZQ2?ASIN=B0CRJ5RTLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Finding Your Voice",
                "reviewText": "We all have a voice. Sometimes that voice is waiting for someone or something to bring it to our attention or help to amplify it. Lady Cassia has a voice, a list of want to do’s’ hidden in a locket. Little did she know that she could actually make them happen. Re entering her life, Frederick, a childhood friend of her brother Edwin, interacts with her like oil and water. As they interact that voice, so long squashed starts to come to life. Lady Cassia and Frederick decide on a ‘ruse’ of courting. No surprise, nothing really goes the way either of them expect. They both have issues that need to be resolved. They find their strength together but so many voices are working to keep them apart. I was glad when Lady Cassia finds her voice to help another young lady find hers. Here’s to finding your voice and having someone by your side to support you on the journey. I received an advance review copy for free, and I am leaving this review voluntarily.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BBumbolow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJJOHIAI3G4UULSDJT7LDGRX4VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZP7YH67HRD0H?ASIN=B0CRJ5RTLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars An Unexpected Love",
                "reviewText": "Frederick, Edwin and Casia all grew up together and Frederick was always kidding around and tormenting Casia. After the death of his father Frederick became a Duke and met Casia at a ball where she was having a difficult time against an aggressive Lord Stanhope and seeing her distress he stepped in and rescued her. We see a lot of banter back and forth between Frederick and Casia and she does not know what to make of it as she still was holding some resentment against him for how he treated her when they were young. Frederick was being followed around and pursued by Lady Agnes so he proposed to Casia that they fake an engagement to help her with the aggressive pursuit by Lord Stanhope and his issue with Lady Agnes. The story does have a number of twists and turns and one is drawn merrily along as all the developments unfold.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JustJeri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHBLAHCHQSSHGMWMM23QNR7XAKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HC8BBYJIY0B5?ASIN=B0CRJ5RTLF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Cassia and Frederick",
                "reviewText": "This historical romance focuses on childhood friends who reconnect, and due to a list of desires Cassia lost, brings them closer, with unexpected events. This journey encompasses drama, secrets, villains, and emotional upheavals keeping the reader engaged, knowing the heartwarming HEA will soon arrive. The author was successful in developing great characters, wrapped up in an easily flowing and creative plot, with a resounding finale. The self-discoveries of each character, and the changes in their perceptions was evident. A great read. I received a complimentary ARC, but I am voluntarily offering my personal opinion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindy Lynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKR2GXY3KEX53GQMUMTFGLJTNFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM9FIQEFL23R7?ASIN=B0CRJ5RTLF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "4.0 out of 5 stars So Good!!!",
                "reviewText": "I loved this book! From the beginning to the end, I was captivated by the hero and heroin. A fun read, with a hero who is fun loving and not much of rake, but just enough to know he could be dangerous. The heroin was interesting and understandable in her plight. I loved the way these two came together and the author kept the story moving at a good pace but gave you all the details and moments you could want in a story and couple like this. Highly recommend!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 8, 2024",
                "reviewTitle": "Duke and the wallflower",
                "reviewText": "Childhood friendship turned into a fake courtship turns into love. The chemistry between the characters was great. I enjoyed the build-up to their love.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nicola 14332",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 13, 2024",
                "reviewTitle": "Cassia and Frederick’s Love Story",
                "reviewText": "I found this book to be interesting, with a surprise ending. I don’t like to spoil the story and luckily for me it is quite complex to describe. All the characters have their issues, but Cassia and Frederick are so likeable, so one can really enjoy their journey to find themselves…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pickle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 12, 2024",
                "reviewTitle": "SHE LOST IT - HE FOUND IT WILL SHE ACCEPT HIS OFFER !",
                "reviewText": "DUKE FREDRICK - Known as the cursed duke because his father and his betrothed both died it was believed that anybody that he loved would die this however never stopped young ladies from wanting to marry him.LORD EDWIN - was Fredrick's best friend (more like brothers) they had grown up together he was very closed to his family he had two sisters Cassia was quiet and avoided being the centre of attention her younger sister was quite daring and outgoing.LADY CASSIA - wished she could be as her younger sister outgoing and daring shock people do things she would need date to do, she did not want to marry was unsure what love was or if existed. Fredrick always noticed her as a young girl never really getting involved in games etc she had been trying to change be more outgoing - daring to no avail yet (that changed the day she lost a piece of paper).I HAVE A TENDENCY TO GO ON - SO WHAT I WILL SAY IS I LOVED FREDERICK - ALL GREAT CHARACTERS BRILLIANT STORYLINE could not put it down.Bit of a surprise towards the end did not see that coming.I loved IT.I received an ARC.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 29, 2024",
                "reviewTitle": "Cassia and Frederick love story",
                "reviewText": "You know its a good book when you cannot put it down. Beautiful story of how a shy wall flower conquered all her fears prior to marriage. With the help of Frederick her brother’s best friend she managed to cross out her list and eventually realised she loved him. I Loved both characters as well as her siblings. The story is full of twists and turns, funny, sad at times and full of passion. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G.R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 8, 2024",
                "reviewTitle": "from hopeless to happy",
                "reviewText": "Giving up on yourself never is a good idea. When Frederick and Cassia decide to start a relationship of convenience, they never would have thought it would bring them true happiness in the end. I liked how their romance put a little optimism in my life. I received this book as a review copy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}