{
    "remaining_requests": 2262,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Funny-You-Should-Ask-Novel/dp/0593357329",
    "body": {
        "name": "Funny You Should Ask: A Novel",
        "price": "$9.99$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Funny-You-Should-Ask-Novel/dp/0593357329",
        "soldBy": {
            "sellerID": "A1SYE57IZFNXCN",
            "name": "LuxuryMerchandise (Veteran Owned)",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1SYE57IZFNXCN&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81IcwnhIa-L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Elissa Sussman",
            "link": "https://www.amazon.com/Elissa-Sussman/e/B00J58UKGW/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "LuxuryMerchandise (Veteran Owned)",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 7126,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Funny You Should Ask is the kind of fascinating, intimate character study that feels like reading about real people. A breezy, addictive romance—I couldn’t put it down!”—Rachel Lynn Solomon, author of The Ex Talk“Funny You Should Ask is a smart, sensitive story full of love and longing—not to mention a totally swoonworthy hero. It’s also a page-turning peek into the celebrity machine. Framed by one infamous weekend and its fallout, the book goes beyond the glossy surface to thoughtfully tackle questions of perception versus reality, and which can hurt more: the limitations other people place on us, or the ones we place on ourselves.”—Heather Cocks and Jessica Morgan, bestselling authors of The Royal We and The Heir Affair“Elissa Sussman’s adult debut promises a glamorous celeb romp, but offers a double-whammy with thoughtful, emotional depth. As the narrative jumps back and forth in time, the truth of what happened between Gabe and Chani unfolds and a romance blooms—cautious, sweet, and sizzling with tension. . . . A beautiful, fun, heartfelt love story that I couldn’t put down.”—Maurene Goo, author of Somewhere Only We Know“Sussman makes her adult fiction debut with a smart and sexy tale of second-chance love. The story thoroughly satisfies on a romantic level and packs an emotional punch with genuine characters.”—Library Journal (starred review)“Alternating between past and present, YA writer Sussman’s first novel for adults slowly lays out the events of her characters’ first meeting and how much has changed in the decade since. The result is a sexy, sometimes emotionally fraught tale that is both funny and romantic and that will appeal to fans of Sophie Kinsella.”—Booklist“Young adult author Elissa Sussman may be poised for a breakout hit with her first novel for adults, Funny You Should Ask. . . . Sussman’s smart writing and firm control over the narrative steadily lead you on to the next page, and the next page, and the page after that.”—BookPage“Sussman’s thoughtful adult debut explores the connection forged between an insecure Los Angeles writer and a charming movie star. A decade after Chani Horowitz’s profile of Gabe Parker went viral, the two are reunited for another interview. . . . Sussman’s musings about fame, success, and the bonds between people elevate this fun and charming narrative. This has ALL THE MAKINGS OF A HIT.”—Publishers Weekly About the Author Elissa Sussman received her BA from Sarah Lawrence College and her MFA from Pacific University.She is the author of three young adult novels, and Funny You Should Ask is her debut adult novel. Sussman lives in her hometown of Los Angeles with her husband and their two dogs, Basil and Mozzarella. Excerpt. © Reprinted by permission. All rights reserved. Chapter 1I arrived early and damp. The blue cotton blouse that had looked professional and flattering in my apartment mirror was now stuck to my armpits in dark, wet half-moons. Lifting my arms, I blasted the AC in my car, hoping both to dry my shirt and shock the nervousness out of my system.I’d interviewed celebrities before.I’d even interviewed supernaturally beautiful celebrities before.This was different.Gabe Parker wasn’t just any celebrity. He was my number one, heart-fluttering, palm-sweating, thigh-clenching celebrity crush. I’d entertained multiple extensive, detailed fantasies about him. I’d done numerous searches for paparazzi pictures of him. Until this morning, a shirtless photo of him had been the lock screen of my phone.I had zero chill when it came to Gabe Parker.If Jeremy and I were still dating, there’d be a major possibility he would have tried to veto this interview. He knew how I felt about Gabe. When he’d insisted on us declaring our “free pass” celebrities, I’d chosen Gabe. Jeremy had pouted.It was ridiculous, of course.Gabe would probably be charming and kind and amiable. It wouldn’t be because he liked me, or thought I was interesting, or because we had any sort of deep emotional connection. It would be because it was his job to charm me. And it was my job to be charmed. His management had been very, very clear about the kind of profile they were expecting me to turn in. What they wanted in exchange for the access Broad Sheets was getting to Gabe before he started shooting.They wanted a story that would counter the bad press his casting had caused. They wanted a story that would convince the naysayers that he was the best choice for Bond. They wanted me to sell him to America. To the world. I wanted a story that would keep getting me work.I blogged and sent short stories to literary magazines like I was tossing rocks into the ocean.I’d only gotten one published, and then, just when I was considering that maybe I should give up trying to be a writer, I’d gotten the gig at Broad Sheets. I’d been recommended by a former professor who had once called my writing “mainstream”—as much of an insult as one could get in an esteemed MFA program but apparently exactly what Broad Sheets was looking for. Jeremy called the stuff I was doing “puff pieces,” but we’d still celebrated when I got the job—spending a good chunk of my first paycheck on bottomless fries and happy hour beers.The editors at Broad Sheets seemed to like my writing—at least, they kept giving me work—and every month I could pay my bills with the money I made off my writing felt like an accomplishment.I knew that this interview was an opportunity to show that I could take on more high-profile, better-paying articles. It needed to go well. Even though I’d just checked it five minutes ago, I scanned my bag again to make sure that I had a pen, my notebook with the questions I’d written out last night, and my tape recorder, which had a new set of batteries. I was as prepared as I was going to be.My armpits were now cold and wet. I realized, with horror, that I wasn’t one hundred percent sure I’d put deodorant on. I gave myself a sniff, but couldn’t tell.It was too late now.I glanced in the rearview mirror one last time, grateful that at least my bangs had chosen to be obedient.Gabe was staying in a rental house in Laurel Canyon. I’d expected something grand, with a massive gate and intense security system, but I’d been sent to a modest bungalow set back from the street with nothing more than an unlocked, waist-high gate to keep people out.But even though it was small, I knew the place had to cost at least four times more than the apartment I shared with one stranger and one half-friend.I could feel my heart ricocheting up and down my throat as I walked through the gate and down the pathway. A heart attack or a panic attack or some other sort of attack seemed extremely likely.“He’s just a person. He’s just a person,” I said to myself. I lifted my hand, but before I could even knock, the door swung open and there he was.Gabe. Parker. I’d done enough interviews like this to know firsthand the difference a camera and a crew could make in someone’s appearance. Actors were usually shorter than they appeared, their heads often bigger. Round cheeks could make someone look chubbier than they were, just as chiseled features could come off as gaunt in real life.A part of me had been praying that Gabe Parker’s good looks were mostly manufactured.I was swiftly and immediately proven wrong. He. Was. Glorious.Tall, knee-bucklingly handsome, and backlit by the best sunlight California could muster on a brisk winter day. His dark brown hair was mussed, a wavy lock flopped onto his forehead in a way that looked both boyish and rugged. He had a dimple in his left cheek—which I already knew about, but it was on full display as he greeted me with a smile that made my heart stop so abruptly that I put a hand to my chest. He was so beautiful.I was so f***ed.“It’s you!” he said.As if he had been waiting for me. The truth was that I had been waiting for him. Literally. This interview had been scheduled and rescheduled several times already. But none of that mattered now.I felt fluttery. All over.I didn’t like it.It was deeply unprofessional and a complete cliché. The world already assumed that all female reporters slept with—or were trying to sleep with—their subjects. I was here to do my job, not get all hot and bothered over a sexy celebrity. It was enough to keep those tingly feelings at bay.Gabe was still blasting me with that full-force grin. It was so powerful that it took me at least ten seconds to realize he was holding a puppy in his arms. And I loved dogs.“Can you take her for a moment?” he asked.I was apparently incapable of speech so I just nodded and held out my arms. His fingers brushed mine as the wiggling, furry bundle was passed over. My heart stopped again, and the tingly feelings returned.Dammit.At this rate, if he shook my hand, I was likely to pass out at his feet. After giving me the dog, he turned and headed back into the house. The puppy shifted in my arms, craning her head so she could take a swipe at my chin with her soft, pink puppy tongue. I inhaled deeply, breathing in her puppy breath. Pure. Unfiltered. Good.It stabilized me. “Come on in!” Gabe said from inside the house.I followed his voice, taking in the beautiful rental with its wood-paneled walls and warm, cabin-like feel. The back of the house was open—glass sliding doors pushed to the side—and I could see a big, grassy lawn with a pool and hot tub. The rental itself had maybe two bedrooms, but the property was spacious. It was exactly the kind of Laurel Canyon home where you could easily imagine the Mamas and the Papas or Fleetwood Mac doing drugs, having sex, and making music during the seventies.I walked into the kitchen and found Gabe on his hands and knees. Without a shirt on.“Sorry,” he apologized, using his cotton T-shirt to wipe the floor. “I still have no idea where any of the rags are, and we’ve been having a hard time with house-training.” He looked up at me, and I realized I was holding the puppy in front of me like a shield. Standing, Gabe looked down at the pee-stained shirt in his hand and winced before tossing it in the trash. Then he came toward me.“It’s okay,” he said to the dog. “I still love you.”“Unngh,” I said.He took her from me, cuddling her against his bare chest. It was smooth and sleek—all those muscles perfectly defined—exactly how it looked on the big screen. Well. Not exactly. He was actually a little thinner than I had expected. Not that I minded.He still looked good. Beyond good.I laced my fingers behind my back to keep from reaching out and touching, but my imagination did not hesitate in envisioning how his skin might feel beneath my palms. Because if I was going to touch—even if it was just a fantasy—I was going to be putting my whole hands on him. Maybe my mouth too.If I had the time, there was a long list of my body parts interested in touching his body parts.It was completely inappropriate, but it was just in my head. What harm could there be in that?“Sorry about that,” Gabe apologized again.We both stood there for a moment. He made no motion to indicate he was going to put a shirt on, and I wasn’t going to prompt him to do so. As far as I was concerned, this was a once-in-a-lifetime opportunity to ogle one of the hottest up-and-coming stars of our time and I was going to ogle my brains out. Silently. Covertly.I knew I was justifying my unprofessional thoughts, but the truth was, I wasn’t sure I could help it. He was just so handsome and my pulse was racing like I was being chased. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 18 hrs 28 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 18 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NATIONAL BESTSELLER • A restless young journalist with big dreams interviews a Hollywood heartthrob—and reunites with him ten years later to discover exactly how he feels about her in this sexy and engrossing novel “You will absolutely devour this book. It’s filled with delightful banter, hot romance, and a love story that’s worthy of the big screen.”—Kate Spencer, author of In a New York Minute and host of Forever35ONE OF THE BEST BOOKS OF THE YEAR: Cosmopolitan, NPR, The Washington Post, Book RiotThen. Twenty-something writer Chani Horowitz is stuck. While her former MFA classmates are nabbing high-profile book deals, all she does is churn out puff pieces. Then she’s hired to write a profile of movie star Gabe Parker: her number one celebrity crush and the latest James Bond. All Chani wants to do is keep her cool and nail the piece. But what comes next proves to be life changing in ways she never saw coming, as the interview turns into a whirlwind weekend that has the tabloids buzzing—and Chani getting closer to Gabe than she had planned. Now. Ten years later, after a brutal divorce and a healthy dose of therapy, Chani is back in Los Angeles as a successful writer with the career of her dreams. Except that no matter what new essay collection or online editorial she’s promoting, someone always asks about The Profile. It always comes back to Gabe. So when his PR team requests that they reunite for a second interview, she wants to say no. She wants to pretend that she’s forgotten about the time they spent together. But the truth is that Chani wants to know if those seventy-two hours were as memorable to Gabe as they were to her. And so . . . she says yes. Alternating between their first meeting and their reunion a decade later, this deliciously irresistible novel will have you hanging on until the last word.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Dell (April 12, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593357329"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593357323"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.19 x 0.73 x 7.96 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,541 in Books (See Top 100 in Books) #1,048 in Contemporary Women Fiction #1,816 in Literary Fiction (Books) #7,323 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 7,126 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6eaffec7-f309-4236-8d7f-6a47aeebc832.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/406ba6a4-c461-49e3-81f7-6e709b0374f6.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e95c170d-e2a9-431f-96b5-d8d2c52c94cb.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a89782ed-49d2-4bc8-b390-99e85036ddcc.__CR0,2,1056,327_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cc14d768-9e5b-4cb5-b48d-97a84acd7d34.__CR0,2,1056,327_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jeeves Reads Romance",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6B3EUW7YMJAHO24XTUU4HD6F7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QVYM0FEYP9VM?ASIN=0593357329",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2022",
                "reviewTitle": "5.0 out of 5 stars Loved it",
                "reviewText": "As a general rule, I HATE second chance romances... but I LOVED this. I was hesitant to pick this up because of the couple's complicated past, but that all faded into the background as I became immersed in this truly unique love story. Told in flashbacks, present day, and snippets of articles that fill in the gaps, we see how these characters have changed and grown over the last ten years. We see all of the ways they messed things up in the past, as well as all of the ways they are PERFECT for each other in the present. If you're someone who enjoys puzzling out a mysterious hero, then you're going to love this one - piecing together all of the little breadcrumbs that show the depth of his feelings and just how much he thought of her in their time apart. These two fell hard and fast over the course of a single weekend, and they've had ten years apart to let those feelings simmer, fester, or grow. There's really no way to tell until the whole story is told. And one of the best things - beyond the obvious zap of chemistry - is that the story is told in such a way that I was completely and utterly invested in seeing how things played out in the past AND the present.The story follows Chani, a journalist who couldn't have predicted the countless ways that one interview would change her life. As a 26-year-old, she was starstruck and smitten to meet sexy actor Gabe. Tasked with writing an article that would make Gabe look good, Chani was surprised to discover that they seemed to have a connection that had nothing to do with the article she was writing. And the time they spent together that weekend seemed to confirm that... until it didn't. Ten years later, Chani would like to believe that she's both older and wiser. That article changed the trajectory of her career, and the whispers about that weekend have not quieted in the years since. So when Chani is asked to interview Gabe again - now a star who has lost his shine after a divorce and a few trips to rehab - she's hoping to get some closure and move past it once and for all. But spending time together again makes those old feelings come rushing back, and it's possible that finally getting everything out in the open will change everything.I've gotta give it to Sussman - she managed to make this relationship feel rich and deep, despite the fact that Chani and Gabe have only spent a handful of days together. They had that first potential-filled weekend that went horribly wrong, then only brief interactions in the years since. So it's amazing how much history they have, and how much the intimacy grows between them. The story seems to be a bit polarizing to readers, and I can see how that element wouldn't work for some - but it definitely did for me. There are plenty of lighthearted moments, splashes of angst, longing, and a TON of unfulfilled potential. As much as I wanted to shake them over the miscommunication, it was also easy to see that the Chani and Gabe of the past wouldn't have worked out. They needed that time apart, and Gabe needed to get sober. I was even (shockingly) okay with the fact that they both married and divorced other people during those years as well - hurt people hurt people, and returning to safer relationships made sense to me. Besides, they'd only spent a matter of hours together, and neither one was entirely sure of the other's motivations. Once they face the truth of their feelings, the entire dynamic shifts. It's a complex story that drew me in more and more as it progressed, until I was incredibly engrossed. I loved it.Audio note: The audio is great! The story is told exclusively from Chani's point of view, so it's a single narrator, but she does an excellent job. Her performance brought Chani to life, and it was also easy to differentiate between the characters. The runtime (under 8 hours) was perfect for bingeing in one sitting, which is great because that's exactly what I wanted to do. And the tone of the book was ideal for the audio format, especially given the narrator's strong performance. It's an achingly slow burn with just a little spice, so the book is also a good pick for a workday listen - you'd even be able to fit the whole story into a day at the office. While this would be a great read in any format, the audio enhances it even further.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kylee Grimwood",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7AGGF6CQT5J3UFSPGZWPP2MBOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W743VC6AV5DE?ASIN=0593357329",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2023",
                "reviewTitle": "4.0 out of 5 stars a worthwhile debut",
                "reviewText": "When we first meet our journalist, Chani, she is a little ball of anger and embarrassment, most of which is directed at Gabe Parker, irrationally hot former movie star. One fateful interview a decade ago led to a whirlwind weekend between them, but things didn't end the way either of them (or the rest of us) hoped.Rather than flat up front, their story is told through a series of flashbacks, articles, and snapshots from the present.While I can definitively say I enjoyed reading Funny You Should Ask, I also found myself regularly rolling my eyes at Chani. I found her immature and incapable of recognizing her own faults, so much so that *SPOILER* Gabe literally calls her on it shortly before the book ends. I think the structure of their story is thoughtful, and their characterizations include a lot of wit and charm. I just also want to hold Chani by the shoulders and very sternly remind her that she is nearing 40.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LA Day",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBEFRPI2YDMSBXIRITWIPLXK2DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z8T1OZ308PD4?ASIN=0593357329",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 1, 2023",
                "reviewTitle": "3.0 out of 5 stars liked but not loved.",
                "reviewText": "This book was cute and I liked the plot structure, how it shifted between time lines with articles peppered in between. But the actual storyline is like a Hallmark or Lifetime movie. Very predictable. There isn’t anything you couldn’t see coming which makes the jump between time lines a bit boring when you have it all figured out. I struggled to finish the last 50 pages just because I felt I knew how it would end, and I was right. Even the phone call gabe has with chani that’s hinted at in the novel as being something important just ends up being him drunk dialing her randomly one night. There is a lot of foreshadowing in this book that comes to nothing. It’s kind of what isn’t great about these publishers having so much creative control. Authors tend to play it safe and then you wind up with a big bore of a book. This wasn’t a total bore though and if you’re into romcoms you’ll probably like it. It’s just been done a lot and really isn’t anything fresh or progressive.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GracieW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQVHBN3NXDUU7GJ46LZHBQHOSJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SO1HBSEKZCFM?ASIN=0593357329",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful book!",
                "reviewText": "Enjoyed the characters and the writing. Elissa Sussman definitely has a new fan. I'm immediately going to go read her other book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ezinwanyi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIBORZYQECBNQWGXDIWLLFVJQMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE3ESPGJCFM6U?ASIN=0593357329",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Sweet second chance love",
                "reviewText": "I’m usually not a fan of celebrity romances but I really liked Gabe and Chani as main characters.Gabe had a serious case of imposter syndrome and that contributed to his alcoholism. Chani has a serious case of impostor syndrome as a writer. They both had issues that made them not ready for each other. Learning to deal with their esteem and gaining confidence was part of their journey to love.I enjoyed the friends who were the wind beneath their wings. I hate that they both were so hampered by the opinions of the public. The dangers of basing our worth on the whims of others. It was a really cute story with a cute ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ARNALDO SOCCODATO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 15, 2023",
                "reviewTitle": "Avaliação Positiv",
                "reviewText": "Gostei de tudo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sofía",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 16, 2022",
                "reviewTitle": "Without a doubt one of my favorite books.",
                "reviewText": "I book hasn’t made me feel so many things in a long time. I read it so fast and couldn’t wait to have some time to seat and read. I love it so much. It’s so well written and I feel so connected to it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 20, 2022",
                "reviewTitle": "BEST WRITTEN BOOK OF 2022",
                "reviewText": "Listen, I rarely post reviews but Sussman’s writing is out of this world. I have goosebumps just thinking of how incredibly beautifully crafted each sentence was in this book. There was absolutely NOTHING i didn’t LOVE in “Funny You Should Ask”. Gabe is so authentic, clever, humble, funny and sexy. Chani is the perfect protagonist. She’s a gift that keeps on giving. Her name alone is so epic. Look, I could spend my whole day talking about how much I adored this book but it still wouldn’t be enough praise. You MUST purchase this book now. I’m going on Goodreads right now to sing her praise because I want more books like this from Sussman forever.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 31, 2024",
                "reviewTitle": "Fast shipment",
                "reviewText": "Very nice and good quality",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gregorio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 23, 2024",
                "reviewTitle": "Ottimo",
                "reviewText": "Ottimo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.31",
                "sellerName": "COTCHE FAMILY",
                "sellerRating": "4.5"
            }
        ]
    }
}