{
    "remaining_requests": 2327,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/One-Day-December-Josie-Silver/dp/0525574689",
    "body": {
        "name": "One Day in December: A Novel",
        "price": "$8.89 $7.67",
        "originalPrice": "$17.00",
        "rawPrice": 8.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/One-Day-December-Josie-Silver/dp/0525574689",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41VL8lsdXFL.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61GWdnoITJL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Josie Silver",
            "link": "https://www.amazon.com/Josie-Silver/e/B07D126534/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Jenson Books Inc and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 50957,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Get ready to be swept up in a whirlwind romance. Laurie falls in love at first sight with a stranger, and spends the next year looking for him. Fate brings them back together at Christmas, but not in the way anybody expects: turns out he’s dating her best friend. It absolutely charmed me.” —Reese Witherspoon“Josie Silver writes with a warmth so palpable her characters sneak their way into your heart and stay for a long time. One Day in December is an exploration of love that reads like a thriller, filled with secrets and heart-aching betrayals. The perfect book to get lost in this holiday season.” —Jill Santopolo, author of The Light We Lost“Consider setting aside some time and prepare to be charmed as author Josie Silver takes readers on a captivating journey — where female friendship is as important as romantic love…One Day in December is an unmistakable winner.”—USA Today“One Day in December is the SWEETEST love story. It’s gorgeous, absolutely lovely. Readers are going to love it.” —Marian Keyes “A must-read. In Josie Silver’s charming rom-com, Laurie experiences love at first sight through her bus window… then the car pulls away… What follows is a decade of heartache, betrayal, and destiny.”—US Weekly“In Josie Silver’s One Day in December, a chance encounter on a London bus turns into a Bridget Jones-inspired romp.”—Cosmopolitan, Best Month Ever“Love at first sight! But he’s her BFF’s new BF. What to do? Do you really have to ask?” —Entertainment Weekly“The pacing is just right, the tone warm, and the characters sympathetic… Anyone who believes in true love or is simply willing to accept it as the premise of a winding tale will find this debut an emotional, satisfying read.”—Kirkus Reviews“It’s never too early to get into the Christmas spirit. Pick up One Day in December for a heartwarming holiday romance about a love triangle that spans 10 years.” —HelloGiggles \"For when you watch \"Love Actually\" on repeat in December...get all the holiday feels in your reads too.\"—theSkimm “One Day in December will have you believing in love.”—Refinery29“The perfect cold weather rom-com.” —Bustle “One Day in December is a charming story about love and serendipity for the hopeless romantic in all of us.” —PopSugar“This poignant romance warmed my heart like a mug of cocoa on a snowy day!”—First for Women “One Day in December is a joyous, heartwarming and immensely moving love story to escape into and a reminder that fate takes inexplicable turns along the route to happiness.”—Modern Mrs. Darcy“If Love Actually met Sliding Doors and became a novel influenced by Jojo Myers, you’d have One Day in December. There’s just something about Christmas and the UK that’s a recipe for modern rom-coms that will have you running for the mistletoe.”—Fodor's\"The novelistic equivalent to Love Actually.\"—The Bookseller“A holiday love triangle and the pursuit of new and unlikely romances make this new novel simply magical.”—SheReads “Silver’s lovely debut follows two young Londoners after a missed connection alters the course of their lives… Silv­­er’s propulsive narrative is enjoyable, and the mix of tension and affection between Jack and Laurie is charming, addictive, and effective. Readers who like quirky love stories will be satisfied by this cinematic novel.”—Publishers Weekly“Silver writes with verve and charm in this debut, and readers will be pulling for Laurie and Jack as they detour through missteps and misunderstandings.”—Booklist\"Readers who enjoy contemporary romance will root for Laurie and Jack as they work through laughter-through-tears experiences and toward a happily-ever-after worth fighting for.\"—Library Journal“I recently devoured this delicious novel, which follows a young woman who falls in love at first sight with someone who soon becomes her best friend’s long-term boyfriend. I finished it in one sitting — it was like candy.” —Hannah Orenstein, author of Playing with Matches About the Author JOSIE SILVER is an unashamed romantic who met her husband when she stepped on his foot on his twenty-first birthday. She lives with him, her two young sons, and their cats in a little town in England called Wolverhampton. Excerpt. © Reprinted by permission. All rights reserved. December 21 Laurie It’s a wonder everyone who uses public transport in winter doesn’t keel over and die of germ overload. In the last ten minutes I’ve been coughed on and sneezed at, and if the woman in front of me shakes her dandruff my way again, I might just douse her with the dregs of the lukewarm coffee that I’m no longer able to drink because it’s full of her scalp.I’m so tired I could sleep right here on the top deck of this swaying, rammed-full bus. Thank God I’ve ﬁnally ﬁnished work for Christmas, because I don’t think my brain or my body could withstand even one more shift behind that awful hotel reception desk. It might be festooned with garlands and pretty lights on the customer side, but step behind the curtain and it’s a soulless hellhole. I’m practically asleep, even when I’m awake. I’m loosely planning to hibernate until next year once I get home to the nostalgic familiarity of my parents’ house tomorrow. There’s something soothingly time warp-ish about leaving London for an interlude of sedate Midlands village life in my childhood bedroom, even if not all of my childhood memories are happy ones. Even the closest of families have their tragedies, and it’s fair to say that ours came early and cut deep. I won’t dwell though, because Christmas should be a time of hope and love and, most appealing of all at this very moment, sleep. Sleep, punctuated by bouts of competitive eating with my brother, Daryl, and his girlfriend, Anna, and the whole gamut of cheesy Christmas movies. Because how could you ever be too tired to watch some hapless guy stand out in the cold and hold up signs silently declaring to his best friend’s wife that his wasted heart will always love her? Though—is that romance? I’m not so sure. I mean, it kind of is, in a schmaltzy way, but it’s also being the shittiest friend on the planet.I’ve given up worrying about the germs in here because I’ve undoubtedly ingested enough to kill me if they’re going to, so I lean my forehead against the steamy window and watch Camden High Street slide by in a glitter of Christmas lights and bright, foggy shop windows selling everything from leather jackets to tacky London souvenirs. It’s barely four in the afternoon, yet already it’s dusk over London; I don’t think it got properly light at all today.My reﬂection tells me that I should probably pull the tacky halo of tinsel from my hair that my cow of a manager made me wear, because I look like I’m trying out for Angel Gabriel in a primary school nativity, but I ﬁnd that I really can’t be bothered. No one else on this bus could care less; not the damp, anoraked man next to me taking up more than his half of the seat as he dozes over yesterday’s paper, nor the bunch of schoolkids shouting across each other on the back seats and certainly not dandruff woman in front of me with her ﬂashing snowﬂake earrings. The irony of her jewelry choice is not lost on me; if I were more of a bitch I might tap her on the shoulder to advise her that she’s drawing attention to the skin blizzard she’s depositing with every shake of her head. I’m not a bitch though; or maybe I’m just a quiet one inside my own head. Isn’t everyone?Jesus, how many more stops is this bus going to make? I’m still a couple of miles from my ﬂat and already it’s fuller than a cattle truck on market day.Come on, I think. Move. Take me home. Though home is going to be a pretty depressing place now that my ﬂatmate, Sarah, has gone back to her parents’. Only one more day and then I’ll be out of here too, I remind myself.The bus shudders to a halt at the end of the street and I watch as down below a stream of people jostle to get off at the same time as others try to push their way on. It’s as if they think it’s one of those competitions to see how many people can ﬁt into one small space. There’s a guy perched on one of the fold-down seats in the bus shelter. This can’t be his bus, because he’s engrossed in the hardback book in his hands. I notice him because he seems oblivious to the pushing and shoving happening right in front of him, like one of those fancy special effects at the movies where someone is completely still and the world kaleidoscopes around them, slightly out of focus. I can’t see his face, just the top of his sandy hair, cut slightly long and given to a wave when it grows, I should imagine. He’s bundled into a navy woolen pea coat and a scarf that looks like someone might have knitted it for him. It’s kitsch and unexpected against the coolness of the rest of his attire—dark skinny jeans and boots—and his concentration is completely held by his book. I squint, trying to duck my head to see what he’s reading, wiping the steamed-up window with my coat sleeve to get a better look. I don’t know if it’s the movement of my arm across the glass or the ﬂickering lights of dandruff- woman’s earrings that snag in his peripheral vision, but he lifts his head and blinks a few times as he focuses his attention on my window. On me. We stare straight at each other and I can’t look away. I feel my lips move as if I’m going to say something, God knows what, and all of a sudden and out of nowhere I need to get off this bus. I’m gripped by the overwhelming urge to go outside, to get to him. But I don’t. I don’t move a muscle, because I know there isn’t a chance in hell that I can get past anorak man beside me and push through the packed bus before it pulls away. So I make the split-second decision to stay rooted to the spot and try to convey to him to get on board using just the hot, desperate longing in my eyes. He’s not ﬁlm-star good-looking or classically perfect, but there is an air of preppy disheveledness and an earnest, “who me?” charm about him that captivates me. I can’t quite make out the color of his eyes from here. Green, I’d say, or blue maybe? And here’s the thing. Call it wishful thinking, but I’m sure I see the same thunderbolt hit him too; as if an invisible fork of lightning has inexplicably joined us together. Recognition; naked, electric shock in his rounded eyes. He does something close to an incredulous double take, the kind of thing you might do when you coincidentally spot your oldest and best friend who you haven’t seen for ages and you can’t actually believe they’re there. It’s a look of Hello you, and Oh my God, it’s you, and I can’t believe how good it is to see you, all in one. His eyes dart toward the dwindling queue still waiting to board and then back up to me, and it’s as if I can hear the thoughts racing through his head. He’s wondering if it’d be crazy to get on the bus, what he’d say if we weren’t separated by the glass and the hordes, if he’d feel foolish taking the stairs two at a time to get to me. No, I try to relay back. No, you wouldn’t feel foolish. I wouldn’t let you. Just get on the bloody bus, will you! He’s staring right at me, and then a slow smile creeps across his generous mouth, as if he can’t hold it in. And then I’m smiling back, giddy almost. I can’t help it either. Please get on the bus. He snaps, making a sudden decision, slamming his book closed and shoving it down in the rucksack between his ankles. He’s walking forward now, and I hold my breath and press my palm ﬂat against the glass, urging him to hurry even as I hear the sickly hiss of the doors closing and the lurch of the handbrake being released. No! No! Oh God, don’t you dare drive away from this stop! It’s Christmas! I want to yell, even as the bus pulls out into the traffic and gathers pace, and outside he is breathless standing in the road, watching us leave. I see defeat turn out the light in his eyes, and because it’s Christmas and because I’ve just fallen hopelessly in love with a stranger at a bus stop, I blow him a forlorn kiss and lay my forehead against the glass, watching him until he’s out of sight. Then I realize. Shit. Why didn’t I take a leaf out of shitty friend’s book and write something down to hold up against the window? I could have done that. I could even have written my cell phone number in the condensation. I could have opened the tiny quarter-pane and yelled my name and address or something. I can think of any number of things I could and should have done, yet at the time none of them occurred to me because I simply couldn’t take my eyes off him. For onlookers, it must have been an Oscar-worthy sixty-second silent movie. From now on, if anyone asks me if I’ve ever fallen in love at ﬁrst sight, I shall say yes, for one glorious minute on December 21, 2008. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 5 hrs 36 mins",
            "FREE delivery February 26 - 28 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 23",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 14 hrs 6 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NEW YORK TIMES BESTSELLER • “Get ready to be swept up in a whirlwind romance. It absolutely charmed me.”—Reese Witherspoon (A Reese’s Book Club Pick) “The perfect book to get lost in . . . Josie Silver’s characters sneak their way into your heart and stay.”—Jill Santopolo, author of The Light We Lost Two people. Ten chances. One unforgettable love story.Laurie is pretty sure love at first sight doesn’t exist anywhere but the movies. But then, through a misted-up bus window one snowy December day, she sees a man who she knows instantly is the one. Their eyes meet, there’s a moment of pure magic . . . and then her bus drives away. Certain they’re fated to find each other again, Laurie spends a year scanning every bus stop and cafe in London for him. But she doesn’t find him, not when it matters anyway. Instead they “reunite” at a Christmas party, when her best friend, Sarah, giddily introduces her new boyfriend to Laurie. It’s Jack, the man from the bus. It would be. What follows for Laurie, Sarah, and Jack is ten years of friendship, heartbreak, missed opportunities, roads not taken, and destinies reconsidered. One Day in December is a joyous, heartwarming, and immensely moving love story to escape into and a reminder that fate takes inexplicable turns along the route to happiness.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Women's Fiction",
                "link": "https://www.amazon.com/Womens-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=542654"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Random House Publishing Group; First Edition (October 16, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0525574689"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0525574682"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.19 x 0.94 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,423 in Books (See Top 100 in Books) #296 in Women's Friendship Fiction #543 in Contemporary Women Fiction #4,087 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 50,957 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/50999296-2c0e-41dd-a450-21649eaf72cd.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/96fb1bdc-f447-4a30-97d0-75566cf61323.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/597b9285-b3cd-4ec1-821f-145505ac2162.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/07df4c0c-60ec-4d3d-ad92-933f4d6f5226.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1af9f98f-2aff-42ff-852f-e3cb2a8d76ec.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2c92ac05-8643-422f-9696-2c4d01b6976e.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/514572c3-4e97-4a38-a3e8-f272b012a374.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVAGLE7GI7W7YVBFOLAW4ITL6DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O9WY3QPXVWE5?ASIN=0525574689",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful",
                "reviewText": "Why was this not made into a movie? The ending especially is so movie-worthy; unlike what many are saying who thought it was “short” or rushed -not so! The ending was perfect. Warm, sweet, spontaneous, uplifting, just … words can’t exactly describe it. Happy. Incredibly warm and happy. We need that from our novels! I can’t wait to read more by this author.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeneva G.Jeneva G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJGV4PVSUZS2B6TIA6ZUVOWN4UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HQYBU1N45XL7?ASIN=0525574689",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Great holiday read",
                "reviewText": "Oh my gosh, what a rollercoaster. I both loved and didn't love this story. I could see how someone might get so incredibly frustrated with it but I can also see how someone would completely understand the why behind this love story. I can absolutely bet money that we've all had some version of this story in our own life at some point. Love is crazy like that. This was a great read but didn't give me that 5 star feeling unfortunately. But still, really good. I laughed, I cried. It was gut wrenching at points. But it felt real. If that makes sense.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71g-OEiDuZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY52ST2HDGRLL5HZTHBLPPDKPXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H0543AJ7D15A?ASIN=0525574689",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 18, 2019",
                "reviewTitle": "5.0 out of 5 stars Loved it! (SPOILERS)",
                "reviewText": "OK. OK. I admit...I actually liked this book. I liked it a lot.Before I start, here's a warning...SPOILERS GALORE AHEAD!A classic tale of love at first sight that took years, actual years, to resolve. We've seen this story, we've read about it, whether in real life, or in books, or in movies. I was very wary about getting this book or reading it, I didn't want the frustration of wanting two characters to end up together for the WHOLE. FREAKING. BOOK.But...this wasn't like that. I mean, sure, there was frustration. But it's not that bad. For many reasons.1. The 'love at first sight' part was kind of silly, and although Laurie spends a good while searching for this random stranger at the bus stop, he remains just that - a stranger. So when she does actually get introduced to him eventually, as her best friend's boyfriend no less, it's frustrating, but not THAT frustrating, because hey! You don't actually know this guy, OK? And to Laurie and Jack's benefit, they both realize that as well, and deal with it.2. You actually can't help but love Sarah (the best friend). And you want what's best for her. And you really like her relationship with Jack, and so you can't be that frustrated, because they work.3. Jack and Laurie's evolving friendship is endearing, and although you can tell there are underlying romantic connotations there, it's still a really sweet friendship.That being said, ten years is a really long time for someone to be in love with someone else. Ten years is a really long time and people change. I really enjoyed the whole first section of the book, when Sarah and Laurie were flatmates, and all the ups and downs and evolution of friendships and relationships.The second section, when Laurie leaves England was also very interesting, and I really liked seeing Laurie separated from Sarah and Jack. Finding herself, relying on herself, and really discovering her own identity separate from these 2 individuals who have shaped her life and character for so long.The third section, when she's back, was rocky, but needed I guess. Seeing the changes in Sarah and Jack, the shift in their relationship, seeing Laurie happy in her own relationship, it was all very realistic.Then came Jack's accident, and that part was...dramatic? I don't know, I wasn't a huge fan. Did Jack need more reason to be a jerk? He was already acting like one prior to his accident. It also seemed to go on for a while, and I kind of just wanted to get on with the story.Then there was Laurie's wedding...and the big revelation the night before when Sarah discovers, well, pretty much everything. Another super dramatic event that wasn't necessary. Personally, I didn't see any reason for Sarah to ever find out about Jack being the bus boy. Also, there was absolutely no reason for her to ever find out about the kiss that happened a hundred years ago. And also, she had no right to get THAT upset about all of it because she wasn't with Jack anymore, and at that point, hadn't been with him for a while! So to miss your best friend's wedding, the best friend who just gave you her dead sister's bracelet, is a HORRIBLE thing to do and is inexcusable.The ending, with the whole radio thing, and the letter, and all that cute stuff. I mean, God, FINALLY. I really, truly enjoyed this story. Not because it was the best story, and not because it was out of this world fantastic and different, but I think the main reason I really enjoyed this story is because I genuinely liked all the characters in this book. Every single one of them. So good on you Josie!",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYP5LIGX672OWSDQ64XQI6MK4PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F6FOVI4EXC0H?ASIN=0525574689",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "3.0 out of 5 stars Predictable",
                "reviewText": "Too long and drawn out for a predictable ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Georgia M. Tabor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2JW5ADU7HNWXTGQJGVPU6DBDCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHMD7BLW0UHGM?ASIN=0525574689",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Great characters!",
                "reviewText": "I enjoy the writing style.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZQMQM5IJLML3FHVWFKZWTFVWKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMOEY5CUTRJA0?ASIN=0525574689",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Seems to be a used book - not new",
                "reviewText": "I didn’t choose the ‘used’ option, yet the book I received seems to be used. There were thumb mark indentations on the pages, like it had been read before, and ink on at least one of the pages…(page 213 so far). Just doesn’t look like a crisp new, unread book at all. I don’t mind a used book if I know it’s used and I pay for a used book. But this one was represented as being new.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIGXWFOFIMPVYRLG4BMD6VGMM7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QQFV8P6JYIVZ?ASIN=0525574689",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Finally read this book",
                "reviewText": "I started and stopped reading this novel twice. I finally decided to read this novel. I have to say that it did not disappoint. The characters were flushed out. Many twists and turns. A little funny the way it ended. Good banter.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ali",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3RIQIKELQGURHUA42H7PYGKQQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WJ67NEU8VKAR?ASIN=0525574689",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "4.0 out of 5 stars Super cute",
                "reviewText": "This book is super cute and I cried at the end. It’s a journey for the two to finally get together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Olivia Lindon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 20, 2024",
                "reviewTitle": "A lovely Christmas read",
                "reviewText": "A friend recommended this book and I was not disappointed! I liked the main character and the depth of her friendship with Sar. I could imagine a movie being made of it. A very enjoyable read and a bit of a tear jerker too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 17, 2021",
                "reviewTitle": "Precioso!",
                "reviewText": "Es un libro hermoso con una historia de amor y amistad que se unen, de que en esta vida el destino existe y por más que se luche hay veces donde las personas siguen unidas de alguna manera!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chelsea ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 7, 2023",
                "reviewTitle": "Lovely book",
                "reviewText": "Nice story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PhotoGlenn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 2, 2020",
                "reviewTitle": "Only one problem with this book...",
                "reviewText": "Problem? I couldn’t put it down. I’m getting really hungry! Seriously, this book really pulls you in and holds you. I was surprised at that given the gaps in time throughout the book but Josie very masterfully kept you in the story as though you were there with them. I found the story took some unanticipated turns which kept me coming back for more. The characters were very believable and not the “perfect” people I’ve seen in some well known romance movies. Novels are a subjective thing so my review is a personal one obviously, but that said I highly recommend this book. Just make sure you make a few meals ahead of time <G>.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elena",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 2, 2021",
                "reviewTitle": "Great for English learners",
                "reviewText": "I was looking for a new book to expand ny vocabulary and I definitely found it. There are many slang expressions and complex daily vocabulary (aprox C1). Grear story too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.02",
                "sellerName": "Murfbooks",
                "sellerRating": "5"
            }
        ]
    }
}