{
    "remaining_requests": 2212,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Missing-Texas-Harlequin-Romantic-Suspense/dp/1335593713",
    "body": {
        "name": "Missing in Texas (Harlequin Romantic Suspense, 2244)",
        "price": "$4.98",
        "originalPrice": "$6.50",
        "rawPrice": 4.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Missing-Texas-Harlequin-Romantic-Suspense/dp/1335593713",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81XaOTSl3hL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Karen Whiddon",
            "link": "https://www.amazon.com/Karen-Whiddon/e/B001IXMF6A/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 27,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Karen Whiddon started weaving fanciful tales for her younger brothers at the age of eleven. Amidst the Catskill Mountains of New York, then the Rocky Mountains of Colorado, she fueled her imagination with the natural beauty that surrounded her. Karen lives in north Texas, where she shares her life with her very own hero of a husband and five rescued Boxer dogs. She is now a full-time writer! Check out her website, www.karenwhiddon.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 24 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A child in dangerAnd two parents who have never met When her adopted daughter is abducted, Edie Beswick suspects the man who claims to be her little girl’s father…until she sees how Jake Cassin reacts to Laney’s disappearance. Working together increases their chances of finding the child they both love, but it complicates their looming custody battle. Is indulging in their attraction just a welcome release for two people in pain—or do they have a future as a family?From Harlequin Romantic Suspense: Danger. Passion. Drama.Feel the excitement in these uplifting romances, part of the series:",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Harlequin Romantic Suspense; Original edition (August 22, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Mass Market Paperback ‏",
                "value": "‎ 288 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1335593713"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1335593719"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 5.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.13 x 0.8 x 6.53 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#288,808 in Books (See Top 100 in Books) #14,743 in Romantic Suspense (Books) #18,956 in Suspense Thrillers #46,803 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 27 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Linda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDB3AJPXCIDE4TZ3Y6J45LTU2CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PM14UHGLO6OJ?ASIN=1335593713",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Believe In Yourself",
                "reviewText": "This book has suspense, love and a puzzle to solve. Laney is taken and her .I'm and dad are on the hunt to find her. Love conquers all.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna Repsher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXGQMOHHPMU43B7BKRTPQX3ESTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R127F94QNHSYI9?ASIN=1335593713",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Gripping romantic suspense",
                "reviewText": "Missing in Texas is the first novel I've read by Karen Whiddon, and as far as romantic suspense novels go, this one gets off to one heck of a rousing start with a serious and terrifying event--a child abduction, and apparently it isn't the first time this child has been abducted--if you're looking for angst, this novel has it in spades. 4 stars.When 5-year-old, new kindergarten student, Laney, doesn't gets off the school bus where her adoptive mother, Katie, is waiting to take her home, it's panic time. As it turns out, Katie learns that Laney got off 2 stops before her usual stop to play with 2 of her school friends, but when Edie races to their house, the police are already there, and Laney is not. Her two schoolmates say that a man in a white Honda Accord dragged her into his car and drove away, and the search is on. But Edie is not alone in looking for her daughter--her biological father, Jake, has been searching for his abducted daughter, Noel, for the past 4 years, and just when he finally thinks he's found her, she's abducted again. It's a parents worst nightmare, but these two parents eventually decide to work together to try and find her, despite the fact that the police are doing all they can--they simply can't just sit around waiting, and who can blame them?This is a tale fraught with fear, Ambert Alerts, and the ups and downs of thinking you've found your missing child, only to have that hope snatched away. In the case of Edie and Jake, a slow building attraction leads to some steamy scenes as the pair finds comfort in one another, and the slow building attraction builds as the pair helps bolster each other up. But the sex doesn't make either parent forget that they both have a stake in Laney/Noel's safe return, and they avoid discussing the elephant in the room--which parent will end up with the child they both love--the father Laney/Noel hasn't seen and doesn't remember, who was only a year old when she was abducted, or the mom she's lived with and loved for the past 4 years. Jake lives in Houston, Edie in the tiny town of Getaway, Texas, and the abductor believes himself to be the child's biological father. Lots of mysteries to solve, but you'll find no spoilers here.If you're looking for a tense, race against time, romantic suspense read, I think you'll enjoy this one--I know I did.I voluntarily read an advance reader copy of this novel. The opinions stated are my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nancy ku",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXYN3GWOMNNHBGAY5E32DNUBXYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE8IFKKDKHTDU?ASIN=1335593713",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Romantic Suspense",
                "reviewText": "Missing in Texas (Harlequin Romantic Suspense) by Karen WhiddonThis is my first Karen Whiddon book and I loved it and will be looking for more. Edie and Jake are both very strong H/h and Laney means everything to both of them. There is angst, kidnapping, danger, misunderstandings, some evil, wonderful small town, teamwork, edge of your seat stuff and steam to get to a very HEA.Reasons I enjoyed this book:Happily Ever After Haunting Great world building Unpredictable Action-packed Steamy Scary Entertaining Wonderful characters Page-turner Tear-jerker Romantic Tragic Witty Easy-to-read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan Frank",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM7JJRH2NRF6EINCZ5XC7BBEJCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R312NUVK6TD03V?ASIN=1335593713",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2023",
                "reviewTitle": "4.0 out of 5 stars Good book",
                "reviewText": "Good book that grabbed my attention from the start, and didn't let go until I was finished. The book opens as Jake arrives at Edie's bakery, looking for the daughter who was kidnapped four years earlier. Edie is stunned by the resemblance to her adopted daughter, Laney, but sends the man on his way without telling him anything. What follows is a parent's worst nightmare, as Laney is abducted as she gets off the school bus.Edie immediately suspects Jake, and he is horrified to discover that he'd been that close to finding his Noel only to have her disappear again. Jake has been on a leave of absence from his Houston police job for four years while looking for Noel. His website has received several tips, the latest pointing him to this small town. Desperate to find Laney, Edie teams up with Jake to search for her themselves.The determination, tension, and fear leap off the pages as Amber Alerts and Jake's website provide hints that don't pan out. With both focused on finding Laney/Noel, they soon find themselves giving support and encouragement to each other. Neither expects the sparks of attraction that flare between them or the need that drives them to find comfort in each other. Nor can they forget the question of who will end up with Laney/Noel once she is found.The tension ramps up when they receive a credible hint from someone who claims they have Laney/Noel. The hope and fear leap off the page as they face someone who believes they have a better right to Laney. I didn't see the unexpected twist in this person's claim coming. The final confrontation was intense and had me on the edge of my seat until it was over.I loved the ending, and the epilogue was terrific. I loved seeing Jake and Edie getting to know each other better. Seeing Jake with Laney was sweet. I was rooting for good news for Jake and loved how things turned out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexis Coy ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXIQ4ERYR4TM7UXFWW5E2KBJMNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29FEXRVE9WLFM?ASIN=1335593713",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2023",
                "reviewTitle": "4.0 out of 5 stars a great book!",
                "reviewText": "This was a really good book. I really enjoyed the story and I kept me hooked from the first page. I liked Edie and Jake's relationship and how they kept each other grounded and supported each other. I look forward to more books by this author",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michaela",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYP4GTMKKBO2T3F736GWAZUJXNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HPB4FYKUIH7W?ASIN=1335593713",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Child Kidnapping",
                "reviewText": "Grabbing books without looking at the blurb is something I’ve been doing for a while now. I usually read by trusted authors or suspenseful romance by Harlequin. This one hit home way more than many as it dealt with the kidnapping of a child. Thankfully I had the time to read it in one sitting and mitigate the internal terror. Every mother’s nightmare. The storyline was engaging with the addition of natural disasters. The physical coming together of our mains in multiple steamy scenes felt a bit odd and unrealistic. The characters were solid though, as was the plot and the journey through conflict to resolution.I received an ARC of this book and am voluntarily leaving an honest review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JoAnn S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV7PEC77IZ5RX2D7GASJQN7BHXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ICT5Q70DXP02?ASIN=1335593713",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Romantic suspense",
                "reviewText": "Missing in Texas is a great romantic suspense. Great plot and character dynamics. I recommend this book. I received an advance ebook from the publisher and N. This is my unbiased review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}