{
    "remaining_requests": 2269,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/What-You-Do-Me-Novel/dp/1662508271",
    "body": {
        "name": "What You Do To Me: A Novel",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/What-You-Do-Me-Novel/dp/1662508271",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81x00I-81PL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rochelle B. Weinstein",
            "link": "https://www.amazon.com/Rochelle-B-Weinstein/e/B007OXBU78/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 499,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Good music vibes and compelling characters make this good for public libraries.” ―Booklist“Bestselling author Rochelle B. Weinstein had me at ‘mix tape.’ Her nostalgic new page-turner, What You Do To Me hits all the high notes: a strong, determined female protagonist, a dreamy love interest (ahh, the lead singer in a band), forbidden love, family drama, journalistic pursuits, suspense, and second chances. Rolling Stone reporter Cecilia James has committed the cardinal sin: She has become emotionally involved in her story, as she deep dives into finding the truth behind a hit love song while trying to detangle her own messy love life and family secrets. I sang, I wept, I laughed, and I applauded―holding my lighter high for an encore performance. Weinstein’s latest must-read gem doesn’t miss a beat.” ―Lisa Barr, New York Times bestselling author of Woman on Fire“Weinstein had me at music. Throw in a retro timeline that brings back all the 90s feels and I’m a forever fan. What You Do To Me has everything I love in a story: romance, mystery, and suspense, the trifecta of an unputdownable read. Weinstein savvily crafts not one, but two love stories, each with a heart tugging emotional end, wraps them both in some of my favorite tunes from the best decades (IMHO), plus some new ones, and adds in a mystery detailed so visually I could easily picture this on screen. Fans of Daisy Jones & the Six and novels with music themes and persistent protagonists both flawed and edgy will obviously love this book, but I think Weinstein’s novel packs an extra punch for us romantics who grew up falling for a rock star or two, even if he was only a poster on the wall above our bed.” ―Kerry Lonsdale, Wall Street Journal bestselling author of Side Trip“Long a master of the family saga, Rochelle Weinstein now turns her formidable talent to a passionate and playful love story. What You Do To Me is the story of star-crossed lovers Eddie, a musician, and Sara, his muse, and Cecelia, the journalist who is trying to rewrite their ending―and her own. Fans of Taylor Jenkins Reid’s Daisy Jones & the Six will flock to this sweet and soulful book about first love and second chances, and will be moved and inspired to revisit the playlist of their own lives.” ―Pam Jenoff, New York Times bestselling author of Code Name Sapphire“With a deft hand, Rochelle Weinstein has crafted a fascinating, multi-layered tale expertly weaving between then and now. She introduces not one, but several intriguing elements from the past and how they shaped the present, and I desperately needed to know how everything would end. And all I can say is, what a wild and wonderful ride.” ―Tracey Garvis Graves, New York Times bestselling author of Heard It in a Love Song“Sometimes a book gets everything exactly right―the ultimate love story and a heart-pumping mystery all wrapped up in a Daisy Jones & the Six vibe. What You Do To Me is storytelling perfection.” ―Annabel Monaghan, author of Nora Goes Off Script“I love everything Rochelle Weinstein writes, and I am still swooning over What You Do To Me, a story brimming with suspense, rock music, forbidden love, and a heroine who is determined to uncover a decades-long secret. Sexy, sweet, and ultimately so satisfying―you need to read this one!” ―Maddie Dawson, bestselling author of Matchmaking for Beginners About the Author Rochelle B. Weinstein is the USA Today and Amazon bestselling author of seven women’s fiction novels, including When We Let Go, This Is Not How It Ends, and Somebody’s Daughter. A former entertainment industry executive, she splits her time between sunny South Florida and the mountains of North Carolina. As Miami’s NBC 6 in the Mix monthly book contributor, Rochelle is on the hunt for the next great read while she teaches publishing workshops at Nova Southeastern University. She loves hiking, beach walks, her two dogs, and finding the world’s best nachos. She is currently working on her eighth novel. Please visit her at www.rochelleweinstein.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 29 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the bestselling author of This Is Not How It Ends comes a moving novel of two unfinished love stories and the music and lyrics that bring them together.Journalist Cecilia James is a sucker for a love song. So when she stumbles across a clue to the identity of the muse for one of rock’s greatest, she devotes herself to uncovering the truth, even as her own relationship is falling apart.While writing an article for Rolling Stone, Cecilia works to reveal the mystery that has intrigued fans and discovers a classic tale of two soulmates separated by fate and circumstance. Rock star Eddie Vee once sang with his soul, dedicating love songs to Sara Friedman, his inspiration and first love. Now, Eddie takes refuge in anonymity, closed off to the past. Sara, too, has distanced herself from their love, moving thousands of miles away to live the life she once railed against. As Eddie and Sara tentatively open up to Cecilia about broken dreams, she struggles to give them a happy ending. In the process, she learns that broken hearts can be healed―even her own.What You Do To Me is the story of a love song and of the triumph of the heart over the greatest of odds. Even for those who have written off love forever. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Lake Union Publishing (October 17, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 363 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1662508271"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1662508271"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#17,993 in Books (See Top 100 in Books) #608 in Family Life Fiction (Books) #925 in Women's Domestic Life Fiction #1,027 in Contemporary Women Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 499 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/a58ced74-604a-4be6-b175-60f75dc56b1f.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "sharlp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJZNY6UJAUJDXGQP2X76P22RXJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RY70DCAI8RLAF?ASIN=1662508271",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved this book!!!!",
                "reviewText": "What You Do To Me by Rochelle B. Weinstein is a book I loved from the very first page! Have you ever wondered what the inspiration was behind a great song? Well, Cecilia does that for a living working for Rolling Stone magazine. She wants to find out the hidden story of who the song What You Do To Me was written for. So from the 1990's we go back to the 1970's where we meet Eddie and Sarah. Sarah and her family vacation in Florida every year and that is where she meets Eddie who lives with his Grandfather at the place where they stay. Sarah's Jewish family is very strict and already has her future husband all lined up for her until Eddie comes along. He is her first true love. But her parents have other ideas. Years later tragedy strikes and their lives are changed forever. Cecilia knows there is more to this story and won't give up until she finds out what really happened. I can't say more without giving too much away but you NEED to read this book!!!!!! LOVED IT!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Glitterjen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM3AX2LID7LAJ6XYC5RS27WR5EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSF1JV1ZNNTIK?ASIN=1662508271",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "4.0 out of 5 stars 4.5 stars!!",
                "reviewText": "Phew. That was a good darn book.I wasn’t sure going in, I really love music too and often wonder about titles and lyrics - and this tale really tells a wonderful story.There is 2 stories in the this: Cecelia life and love story, and then of course - the love story the song is about.Both have twists and turns, both have depth and surprises. Both have hard parts … really hard parts.I devoured this book in 2 days. Amazing book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "teachlz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGU3S2K7SE62MAEDMAV64EWYU3DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V6EH0PUW7MC5?ASIN=1662508271",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Music in Literacy",
                "reviewText": "Rochelle B. Weinstein, the Author of “What You Do To Me,” has written a captivating and exhilarating novel. The theme that runs through this memorable and heartfelt novel is how music encourages our life rhythm, sparks our emotions and dreams, and keeps us in tune and balance between what is magical and reality. The partnership and composition of the melody and lyrics can be so inspiring. Music can be soothing, calming, and therapeutic for children, adults, and pets. Music can remind us of past events and be memorable in happy and sad times. Sometimes, music can be personal. The genres for this novel are Contemporary Fiction, Music, Family, Mother-Daughter Relationships, and Romance.Rochelle B. Weinstein is a master storyteller in this well-written, multi-layered novel. The author brought back memories of songs and the groups that performed them. Rochelle B. Weinstein tunes in to her story and vividly describes the scenery, the lyrics, the rhythm, and her dramatic and colorful characters. Cecilia James is a journalist who writes for Rolling Stone. Cecilia loves music and especially enjoys romantic songs. She is looking for the artist who sang, ‘What You Do to Me” and the person he wrote the song for. This song provides special memories for Cecilia. Cecilia is a workaholic, and time seems to get away from her when she is busy. As a result, she is heartbroken over her relationship with her boyfriend Pete.A mystery surrounds the song “What You Do to Me.” The artist has disappeared, and no one knows where he is. Cecilia is looking for Eddie Vee, who was a famous rockstar. Eddie had been in love with Sara Friedman. Their relationship was broken because they came from two different worlds. Cecilia feels that Eddie wrote this song for Sara and would like to speak to both of them. Cecilia wants to find a happy closure for this couple and, at the same time, hopes that she can fix her relationship.I love how the author uses music in literacy and how she discusses the importance of family relationships, communication, honesty, loyalty, friendship, love, and hope. I highly recommend this novel.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole M WhisnerNicole M Whisner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYV5U5NV4OBTPGOUMVJC3FQ3STA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDNETBGW7GWFZ?ASIN=1662508271",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars What You Do to Me Rochelle Weinstein 5/5 ⭐️",
                "reviewText": "What You Do to MeRochelle Weinstein5/5 ⭐️Journalist Cecilia James is a workaholic, writing for Rolling Stone magazine. When a chance meeting gives her a lead in figuring out the muse of an iconic song, she puts everything on the line even her future with her boyfriend.Millions of fans have listened to this song and wondered who Eddie Vee wrote it for. Cecilia may have lost the love of her life but wants to find the inspiration behind this classic hit. She soon uncovers a classic forbidden love story. Eddie and Sara were each other’s first loves, but too much was at risk for them to be together. Eddie’s fame was short-lived and he now prefers a quiet lifestyle. Without Eddie, Sara gave up on her dreams and fell into the life her parents wanted for her.As Cecilia tries to mend Eddie and Sara’s relationship, she begins to heal her own heart. She finds clarity in her past prompting her to go after what she truly wants.I absolutely loved the musical references mentioned in this book. It felt like I had my high school mixed tapes playing in the background. @rochellebweinstein harmonizes not one but two lyrical love stories. I was very invested in all the characters, especially Sara and Eddie. What You Do to Me is a touching story that will make you feel love, passion, and sorrow. I highly recommend this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81GXfhTgTLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW5XH5DP5ZJTSPPQFIU4MBDJPRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWMBN9E0ZPAKS?ASIN=1662508271",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Rochelle B. Weinstein",
                "reviewText": "This is my first book I've Read by Rochelle. It Was by far the best read this year for me. The way the storyline incorporated Music. Its the easiest thing to fall in love with. The story was beautiful. The characters chemistry gave it enough excitement, where it felt real.I enjoyed Reading and Listening to this book.Thank you Weinstein.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erika",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFFHLEV7Q4ZMAOYEXQJIPVWXPTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JIMSY561MTAY?ASIN=1662508271",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "4.0 out of 5 stars What a Saga",
                "reviewText": "This was a lot. There was a story within a story. There was so much angst. Cecelia was so tenacious. Every time it seemed like she hit a road block, she found a way around it. Eddie & Sara’s story felt like something that could only happen in a romance novel. It got to be a little sappy at times, but I was invested in their outcome. Both of the leading ladies had very complicated relationships with their parents. That felt realistic and relatable. This was an enjoyable ride to a happy ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BookBunnyReads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2LJ6RANOSIKVBM3NWAYPQBJU4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQJ3Z2P9ZG0T1?ASIN=1662508271",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Mystery, love, music, nostalgia… this book has it all!",
                "reviewText": "This book has a little something everybody. It took so many twists and turns that kept me on my toes. I loved the 90s nostalgia, too! Can’t wait to read whatever this author publishes next.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bridgette Anne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6LKJFPVA46332JQ2PASPX7MX7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVY0UVUW3CBCH?ASIN=1662508271",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "3.0 out of 5 stars good up until the last 20%",
                "reviewText": "Way too much rushed and unexplained and the tragedy at the end was idk pointless in my opinion. Deserved a better third act.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda Chatton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 6, 2023",
                "reviewTitle": "Captivating",
                "reviewText": "A powerful story of love , drive,ambition and success, with the inevitable loss and pain. I loved the characters, wanting to stay awake to read just one more page.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}