{
    "remaining_requests": 2267,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ruthless-Villain-Billionaire-Romance-Billionaires-ebook/dp/B0CV5WFMB9",
    "body": {
        "name": "Ruthless Villain: A Hockey Billionaire Romance Novel (Ruthless Billionaires Book 3)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ruthless-Villain-Billionaire-Romance-Billionaires-ebook/dp/B0CV5WFMB9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81tXRC83eOL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Faith Summers",
            "link": "https://www.amazon.com/Faith-Summers/e/B082FCNYY4/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 88,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "My Knight. My Rebel. My Forbidden Villain …In the dazzling lights of Vegas, I indulged in a passionate one-night stand with a man who looked like a Greek god in the flesh.We agreed: no names, no strings attached, just an unforgettable night of fun.The plan was simple—say goodbye and move on.Little did I know fate had other ideas for me.I never expected to run into Mr. Greek god in New York a week later at my father’s fundraiser.Nor to find out that the godlike man is Luc Le Blanche, the NHL star defenseman for the Hawks.The Hawks, as in the hockey team my father just bought.To make matters worse, my father declares me off-limits to him because of the bitter rivalry between Luc's father and mine.Luc has also made an enemy out of my father since the team’s sale.Due to the control my father has over my inheritance and Luc’s career with the team, we’re forced to obey his demands.The problem is we can’t keep our hands off each other.Despite the stakes, neither of us can resist the magnetic pull drawing us together.Caught between desire and duty, Luc proposes a daring solution:We see each other in secret.Of course I agree.I know the risk and what’s at stake if we get caught.I also know he can’t be mine.Yet each stolen moment and every forbidden kiss fuels my hunger for the 6'6 tattooed hockey god.When things get complicated, I’m not sure what will break me more.The exposure of our secret romance.Or falling for him…A man my father calls the villain. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CV5WFMB9"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bliss Romance Publishing (February 6, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 6, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2737 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 328 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#820 in Kindle Store (See Top 100 in Kindle Store) #24 in Billionaires & Millionaires Romance eBooks #60 in Sports Romance (Kindle Store) #63 in Sports Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 88 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Ebook Original Cover Paperback Special Edition Paperback Coming soon Ruthless Villain Read the Ebook on your Kindle or other devices Original Cover Paperback Alternate Cover Special Edition Paperback Listen to the Audio with Joe Arden and Lucy Rivers",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/81fb31df-7ee6-4ac2-8b81-27693df64749.__CR0,34,3240,1002_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/aa11f74a-1e34-4075-9c52-ae03b9d64075.__CR0,45,3240,1002_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/f52516f8-2672-4868-85ec-d5e41d0467db.__CR0,37,3240,1002_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/fbbc315f-695c-4c05-a7ee-07cfe2177d5a.__CR0,0,600,1200_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/941f57ae-74a8-4d0a-976f-fc5b245d32f9.__CR0,0,600,1200_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/104a3e53-cc0a-4c2f-b143-dae01578dde4.__CR0,0,600,1200_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/e3e6f303-2959-4b26-ae07-ed64bf87e4c6.__CR0,0,600,1200_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ashley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELBR4C476FTCGJBAWTHSDXE2SOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14N7JQIJUOB0K?ASIN=B0CV5WFMB9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Potential spoilers",
                "reviewText": "Overall, an entertaining and fairly quick read. I liked the two main characters and was rooting for their happily ever after.I just have one big thing that bothered me and if I'm gonna mention that, then I'm going to mention a potential trigger for some readers as well. I'm not sure if what I want to share is a spoiler or not, so stop reading if you want to avoid those......Autumn's father was granted legal and medical power of attorney over her after she has a rough go of things. He goes as far as firing the doctor she's got a therapeutic rapport with and replacing her with a very unprofessional one who calls her an attention seeking jealous brat, in attempts to keep her under his control. At one point, Autumn is the victim of a pretty violent attempted rape.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Book Lover in Savannah!",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED23EZ7WKPWDZP2ZPOB5RE4WNZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NCY8VQ2Y6XY4?ASIN=B0CV5WFMB9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved this book so much!",
                "reviewText": "I hated it came to an end but what an ending! Luc fell hard and first for Autumn. Her dad was a piece of work and his attitude with Autumn infuriated me, but redeemed himself in the end! Altogether fabulous book and definitely worth 5 stars!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandy S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM2D4VBPXJSWZ7CKIX3HGR7VLRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F986E3ZYL075?ASIN=B0CV5WFMB9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars emotional, captivating, edgy premise",
                "reviewText": "RUTHLESS VILLAIN is the third instalment in Faith Summers’ contemporary, adult RUTHLESS BILLIONAIRES erotic, romance series. This is thirty-one year old, professional hockey player/billionaire Luc Le Blanche, and twenty-four year old heiress/journalist Autumn Jakobe’s story line. RUTHLESS VILLAIN can be read as a stand alone without any difficulty. Any important information from the previous story lines is revealed where necessary. Luc Le Blanche is best friends with Knight (Ruthless Knight 1)and Jericho Grayson (Ruthless Rebel 2).NOTE: Due to the nature of the story line premise, there may be triggers for more sensitive readers.Told from dual first person perspectives (Luc and Autumn) RUTHLESS VILLAIN follows the forbidden relationship between our story line couple. Luc Le Blanche was on leave from the New York Hawks, and Vegas looked like the perfect destination to lick his wounds but Luc never expected to be ghosted by his one-night stand, a woman who quickly would steal his heart but upon his return to the team, Luc would discover the woman of his heart is the team owner’s daughter, a man who has targeted our story line hero. What ensues is the building but forbidden relationship between our story line couple, and the potential fall-out when Luc and Autumn’s affair become public knowledge.The world building is detailed and dark. Autumn’s past is heart breaking,and in the interim she is no longer in control of her life, having all of her personal and private directed without her consent. Having met Luc meant a new start and a new future but lines will be drawn, rules will be broken, and Autumn will become a pawn in a dangerous game. Luc has been proclaimed the bad-boy of hockey but he is struggling in the wake of the team owner’s hatred of, and dislike of everything Le Blanche. A history between families threatens the growing love between our story line couple, and someone else is taking aim at the woman Luc loves.The relationship between Luc and Autumn begins as a one-night stand in Las Vegas, wherein neither one knew the other’s true identity. Unable to locate the woman with whom he would fall in love, Luc would quickly discover that claiming her heart comes with too many barriers he may not be able to control. The $ex scenes are intimate and passionate without the use of over the top,sexually graphic language and text.There is a large ensemble cast of colorful and energetic secondary and supporting characters including several teams members, Autumn’s parents including her father Shawn Jakobe, her sister Charlotte and fiancé Cole; hockey player Evan Kowalski, as well as Knight and Jericho Grayson.RUTHLESS VILLAIN is a story of power and control, betrayal and vengeance, secrets and lies, family and friendships, relationships and love. The premise is emotional, captivating and edgy; the characters are animated, tragic and inspiring; the romance is seductive and provocative.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dztoy1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3FFJOTDJRCHZAFWVHZEN4ASL6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UTYAWGL9YTQ1?ASIN=B0CV5WFMB9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars twists and turns",
                "reviewText": "Ruthless Billionaires #3What should have stayed in Vegas didn't. Luc and Autumn met in Vegas and agreed to a one night only with no names or info about each other. He was her Arias and she was Venus. Both Luc and Autumn are in Vegas to get away from issues they are having. He's been benched so he doesn't show up for any of the games and just wants to get away. Autumn is dealing with an ex who's now with her older sister and the horrible things he's said about her.Luc Le Blanche is the star defenseman for the NY Hawks and is known as The Dragon. He's 31 and lucky enough to win the Cup the last 3 years. He's also a part of the Le Blanche Global family business. The new team owner hates him. He doesn't do relationships.Autumn Jakobe is 24 and her father is the new owner of the Hawks hockey team. She's a journalist working in LA but has moved home to NY for a while after a tragic couple of events in her life.When both of them show up for a charity event they are shocked to see each other and then to find out who the other is. They are happy to see each other but her father has forbidden the two of them to see each other and has pushed Luc's rival teammate into dating her. Luc won't let that stop him and they agree to meet in secrecy. Their chemistry is off the wall and the more time they are together the harder they fall. But there's so much more going on with some twists and turns.5 starsI was hooked as soon as I started reading this book. Ms. Summers is a new author to me. Totally enjoyed this book.This does talk about issues that could be a trigger for some.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}