{
    "remaining_requests": 2119,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hideaway-Lauren-K-Denton/dp/0718084225",
    "body": {
        "name": "The Hideaway",
        "price": "$10.29$10.29",
        "originalPrice": "",
        "rawPrice": 10.29,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hideaway-Lauren-K-Denton/dp/0718084225",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51VYD5nP3nL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51zTLLZJIkL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lauren K. Denton",
            "link": "https://www.amazon.com/Lauren-K-Denton/e/B01KEICVB8/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 47648,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 17 hrs 13 mins",
            "FREE delivery Monday, February 26 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Christian Books & Bibles",
                "link": "https://www.amazon.com/Christianity-Religion-Spirituality-Books/b?ie=UTF8&node=12290"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Fiction-Poetry-Christianity-Books/b?ie=UTF8&node=172806"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Thomas Nelson (April 11, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0718084225"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0718084226"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.7 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.4 x 0.98 x 8.3 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#66,596 in Books (See Top 100 in Books) #188 in Southern Fiction #717 in Small Town & Rural Fiction (Books) #1,753 in Clean & Wholesome Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 47,648 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Hideaway Hurricane Season Glory Road The Summer House The One You're With Lauren Denton's bestselling debut novel, The Hideaway follows Sara as her grandmother’s will wrenches her back home to Sweet Bay, Alabama, where she learns more about Margaret Van Buren in the wake of her death than she ever knew in life. Hurricane Season is the story of one family’s unconventional journey to healing—and the relationships that must be mended along the way. In one summer, everything will change. But for these three strong Southern women, the roots they’ve planted on Glory Road will give life to the adventures waiting just around the curve. Sometimes it takes losing everything to find yourself again. The Summer House weaves Lauren Denton’s inviting Southern charm around a woman’s journey to find herself. Nineteen years after a summer apart, the past that Mac and Edie thought they left behind has come back to greet them.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ae037c5e-e146-410b-87a2-f126ed05a48e.__CR0,0,2910,900_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/feb8fa5c-a8c3-4430-ab1f-5841b23b7f12.__CR0,0,2910,900_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cc762f7e-285f-4bfc-94a7-c73442974a9c.__CR404,0,692,1383_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f8e3df7-bec1-4223-925d-b180c40fca5c.__CR404,0,692,1383_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/edd95175-1001-403e-844d-804dbc000ff3.__CR404,0,692,1383_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2d1fbd02-fedf-4599-8e6e-2f9ffbdb3099.__CR404,0,692,1383_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/565bfe67-47d1-45b1-a645-e6e3b7f705b9.__CR404,0,692,1383_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marie EdwardsMarie Edwards",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4P6A3SEKS2HCISWAKFZVIFM7NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TM2CV1EFKO8K?ASIN=0718084225",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 12, 2019",
                "reviewTitle": "5.0 out of 5 stars Hiding Away To Find Love",
                "reviewText": "I was introduced to Lauren K Denton’s work in March 2019 during a JustRead Publicity social media tour four “Glory Road”. As I liked the novel, my mother gave me Denton’s two previous ones for my birthday.“The Hideaway” is Denton’s debut novel, a southern and Christian themed book.The story is told between Mags’ and Sara’s points of view. Mags from the past and Sara from current day.Sara is in Sweet Bay after the death of her beloved grandmother, Mags (Margaret Van Buren]. Sara thinks it is a simple reading of the will and she can return to her solitary life in New Orleans immediately. But, Sara becomes the new owner of “The Hideaway”, a run-down bed and breakfast which has seen better days. She’s instructed by her grandmother to fix it up to its former glory, even better than when Mags got it. Sara is given a choice to keep it or sell it, but she has to inform the current residents in advance. Residents who are also like family to Sara.Sara decides that it needs to be renovated anyway so why not spruce the old place up?She hires a contractor (Crawford) and sets out to do what has been asked of her. In the process she begins to learn about her grandmother’s past and what led the older woman to the Hideaway in Sweet Bay and how she came to possess it. The story that others tell about Mags is vastly different from the life Sarah uncovers. How is it she knew nothing of this? Why did her grandmother keep the secrets she did?Sarah also learns the truth about her mother and her own past. But, Sara now seemingly has a future there in Sweet Bay – especially with Crawford.But, Sara also has her life in New Orleans, or believes she does. The longer she stays in Sweet Bay, the less she wants to return to her prior life. When a land developer starts making plans for the property, Sara is torn between staying and fighting for the Hideaway and returning back to the life she’s crafted for herself. Sara is also wondering if she wants to make the same mistake her grandmother did when it came to love? The Hideaway is more than a place to visit; it holds deep memories and love.For her first outing, Denton does a remarkable with this story. It blends the past and present together to weave a beautiful story. It has romance with a not-so-happy ending. It reveals that often we don’t know those we’re closest to. The story also teaches us that what we want isn’t what we need.For some readers their pet peeve was that Mags’ unrequited love story and Sara’s current love story are almost mirror image. I found it interesting in that Sara learned from her grandmother’s mistake. I found it a beautiful part of the story.This book can seem to drag on, but it can also draw one in. I was drawn into and found there were times I couldn’t put it down.If you’ve never read any of Denton’s works – this book and “Glory Road” are stand alone stories so the reader can start with any one of them. If you’ve read “Glory Road” and enjoyed it, you will likely enjoy this. Denton’s second novel is “Hurricane Season”, again, a standalone title.This, like “Glory Road”, is a clean Christian Romance read. There are no “sex” scenes in it. The language is mild and completely inoffensive. For those who are fans of “clean” romance reads, this one definitely fits into that category. As of note, I have not yet read \"Hurricane Season\", but it is on my TBR (To-Be-Read) list.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/819yglRBzGL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Married to garden enthusiast",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6TA5TQGSBB2XA5KC6BGFNSMLRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHB56FG85S7KN?ASIN=0718084225",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars life’s surprises and how they are entwined.",
                "reviewText": "Mags had a surprising and rather colorful past that she never revealed to her daughter or granddaughter while living. Upon inheriting a crumbling B&B , her granddaughter Sara finds herself drawn back to a quiet beach town in Alabama. She leaves behind her busy New Orleans life and discovers not only Mags’ secrets but herself in the process. A good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Lynch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECQTPPS5BWVJCKUCBKFVPDHL25Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RJ200JJE9L8P?ASIN=0718084225",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful story",
                "reviewText": "A wonderful story of what really matters in life, set in a beautiful southern backdrop. It makes me want to run away to the south.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda Holman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHRYTDVDDRA2GMJNTGFB4VASQYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PS31UHWE412G?ASIN=0718084225",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 23, 2020",
                "reviewTitle": "3.0 out of 5 stars It was good. But just good.",
                "reviewText": "I bought this as a gift a few years ago and ended up with a copy of my own recently. I hadn’t read it but now that I have here I’m review. If it’s helpful please marks it helpful!It’s about a grandmother and granddaughter, their own love stories and how an old bed and breakfast hidden in the woods of Alabama changed both of their lives. It’s written in two points of view, one of the past and one of the present.Mags, the grandmother, dies, and Her granddaughter Sara returns home to Alabama to meet with lawyers and attend a funeral. When she arrives she learns that Mags hideaway home has been willed to her, and her grandmother has left a note requesting that she use her artistic skills to return it to its former glory. Along the way Sara learns a lot about her grandmother and herself. It’s an interesting story of family and love that had me appreciating being home with my family and on my porch. Soaking in the quiet moments and the simplicity that comes with our current situation.In some ways I loved it. I found a lot of similarities between the grand daughter and myself. She loved quirky things and art and upcycling and home improvement and also lists and organization and her grandmother. All of these things are me. I was disappointed in the writing style, how the story was rushed at various times and then overly detailed without any visualization other times.The author really failed at all of the large climax situations. I’d anticipate something for chapters on end and when it finally happened, it happened in a few sentences and without any depth. She did so well at developing the two main characters, it was a shame that such large parts of their stories and the other characters were breezed over.I’m going to give it 3.5 starsIt could make a fantastic movie. The author spent so much time describing movements and leaving unanswered questions, that as a movie there may be more time to enhance the meaningful details. Which is usually the opposite when it comes to books vs movies. I’d be interested in how a script writer would interpret the past and present points of view that were so important to how it all fell in to place.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWJASUSLF4GMUBRFP7CLOLNY5DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HK1NFR8INFOO?ASIN=0718084225",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Romance & Mystery",
                "reviewText": "The story goes between the memories of a grandmother and the discoveries her granddaughter makes. Love, friendship, and finding where one belongs.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NiK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 9, 2023",
                "reviewTitle": "Great Read",
                "reviewText": "This was a wonderful pair of stories. The characters were appealing and the setting was lovely. I really enjoyed both storylines and couldn’t put it down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julie ann west",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 22, 2022",
                "reviewTitle": "Hideaway",
                "reviewText": "This is a excellent book it's worth buying and worth the money. At the end tear jerker so have tissue ready",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnneB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in France on June 8, 2018",
                "reviewTitle": "Disappointing",
                "reviewText": "A bit flat. The two women depicted are unsubstantial in spite of the author's efforts. Things and people happen to them, without much input from them. Especially Sara. She is passive. She takes but doesn't give much. And has been uncaring towards her grandmother. I didn't warmed to her. She takes avantage of people who don't know the value of their belongings to sell them to her show off customers with a fat profit. She looked at her grand mother's furniture with that in mind. I ressent having paid 8,99€ for this average book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jeanne adamek",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 16, 2017",
                "reviewTitle": "!!!!!!!!!!!!!!!!!!!!!!!!!!",
                "reviewText": "The Hideaway wasn't the book I expected, one does have expectations on a storyline that is described on the back cover... I read with amazement. I was drawn in quietly, almost shyly, from the first page and the words that the author wrote didn't leave me until I read the last word. And not even then.Lauren K. Denton is a author whose books I will be watching out for. I found that her powers of characterization simply amazing. She didn't just characterize just people but also the house and Sweet Bay, where the house was located. I loved the diversity of all the people she wrote about and could actually picture them, hear them speaking. I also adored the descriptions of the Hideaway (the house) and the surrounding area, all my senses came alive.While I realize that this simple but powerful story will not be for everyone, for those who come to this book and loves it like I do, it will be a comfortable hideaway.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Del Nevins",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 5, 2017",
                "reviewTitle": "Loved this story",
                "reviewText": "I had a few years running down my face by the time I finished this book. I fell in love with all the men and the women were all a joy. Ill be looking out for more stories from this author for sure",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.19",
                "sellerName": "newbooksonly",
                "sellerRating": "5"
            },
            {
                "price": "$10.29",
                "sellerName": "Emadko",
                "sellerRating": "4"
            }
        ]
    }
}