{
    "remaining_requests": 2282,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/A-Not-So-Meet-Cute/dp/B09J97T32C",
    "body": {
        "name": "A Not So Meet Cute",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/A-Not-So-Meet-Cute/dp/B09J97T32C",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51fbKJ2wIoL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Meghan Quinn",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Meghan+Quinn"
        },
        "brand": "Meghan Quinn",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 48382,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From USA Today best-selling author of The Highland Fling comes a brand new romantic comedy about a desperate billionaire seeking to find a fiancée. This modern day take on Pretty Woman is brilliantly clever and hilariously pause-resisting. How did you two meet?The quintessential question asked to every couple. And the answer is usually some bubbly, lovey dovey tale of being struck in the bum by Cupid’s arrow. My meet cute (well, not so meet cute) is slightly different. I was trolling a wealthy neighborhood in Beverly Hills, searching for someone to take me as their bride, you know, to make my arch nemesis jealous who consequently just fired me. He was stomping around the block like some sort of gorgeous ogre, mumbling about a business deal gone wrong and attempting to finagle his way out of it. And that's when we bumped into each other. There were no sparks. Not even a hint of blossoming love. But next thing I knew, I was scarfing down free chips and guac, listening to this man lay out all of his problems which led to his big ask...he wanted me to be his Vivian Ward, you know, from Pretty Woman - minus the frisky behavior. We're talking about living in a mansion, intimate double dates, and pretending we were head over heels in love...and engaged. Can you imagine?The absolute audacity.But people do crazy things when they’re desperate. And I reeked of desperation. So, I struck up a deal.My one big mistake, though...big...HUGE? I accidentally fell for the incomparable Huxley Cane. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "Romantic Comedy",
                "link": "https://www.amazon.com/Romantic-Comedy/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9059885011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "11 hours and 53 minutes"
            },
            {
                "name": "Author",
                "value": "Meghan Quinn"
            },
            {
                "name": "Narrator",
                "value": "Ava Erickson, Aaron Shedlock"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 02, 2021"
            },
            {
                "name": "Publisher",
                "value": "Hot Lanta Publishing LLC"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09J97T32C"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,570 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #45 in Romantic Comedy (Audible Books & Originals) #385 in Romantic Comedy (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JessiJessi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY22COONV7KVVGVBPO7P4RWA6KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13KDOL5RKX3PI?ASIN=B09J97T32C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Get ready for another fictional boyfriend.",
                "reviewText": "I was hooked from the start. The story started quick but the build-up was slow (in a good way). Both Huxley and Lottie had great POV's. Meghan Quinn NEVER disappoints with the whitty banter. I found myself LOL-ing multiple times!! I bought the next book in the series before I was even finished with this one because I knew I had to keep going. Spicy, sweet and comical- what more could you ask for!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7111pbVzBML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexciz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAV6SQK2ZF6F7YAOTQCGEVQ26YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26AL84XK6XVN9?ASIN=B09J97T32C",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars A SO meet cute!!",
                "reviewText": "SQWEEEEE! I can’t remember the last time I laughed so much! This story still has me smiling as we speak. The pretty woman vibe, the outlandish story line. The outlandish adventures all totally made this THE ROMCOM of the year so far for me. Hands down, one of the best stories that will live rent free in my head for all time. Some of these antics they got up to were so insane I maniacally laughed out loud so many times my coworkers peeked over my cubicle at times to make sure I was okay while listening to the audiobook portion. I switched off and on as usual between reading and listening. Aaron Shedlock & Ava Erickson (I love her!!) truly gave this story wings on the comedic portion in addition to lending emotion to the dramatic. Aaron had a VERY smëxy thing going with his voice that made the stëamy scenes that much more fire 🔥!! All in all a super sweet story that is making my heart so happy and warm. Loved it, as Meghan Quinn delivered yet again. I mean, did you ever doubt it for a second??",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina Garcia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZXZAUFXFDKR437CHDY44SVYTVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFKD2H7KXVASK?ASIN=B09J97T32C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect book to get out of a book slump",
                "reviewText": "This was the perfect book to get out of my book. It’s lighthearted, spicy, funny, and I loved every second of it, and I understand why people who are looking for depth would not love this book, but it’s a perfect quick read if you’ve been bored. I laughed out loud multiple times!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEBJVCKDXEJLOBUIQGGFFGIGWKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UUN162OXEZLJ?ASIN=B09J97T32C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Read this book!!",
                "reviewText": "Huxley Cain is my new favorite book boyfriend and I don’t see him being replaced soon, if ever!This book was perfection! Great banter! The spice was on point!!!Fake datingEnemies to lovers(kinda)Billionaire/employee",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shirley L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPYCHNOMGOYD7DDMS2LPV6DKMIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30ZIKW3U1ORA6?ASIN=B09J97T32C",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2022",
                "reviewTitle": "3.0 out of 5 stars a really cute read, yet for this reader drawn out and yet still interesting...",
                "reviewText": "this IS a rom-com, albeit a very cutesy one.....playfulness, humor ...interactions with the H's brothers, Huxley is a workaholic alpha.... the h is bold and proves herself to be strong and stubborn to the point of being obnoxious.... (in my opinion) ........a hot slow burn from strangers to enemies to lovers.....The story follows Huxley, a guy who is married to his job. There’s never been anything more important in his life than work, especially since he’s in business with his brothers. So when a deal seems to be slipping through his fingers, Huxley lets loose a few lies in an act of desperation. He claims to be engaged also and with a baby on the way, when that couldn’t be further from the truth. Unsure how to handle the predicament he’s gotten himself into, Huxley’s caught off guard is when he meets an unusual woman.......................Lottie is exasperated with her life and so called friends and when she gets fired she and her sister jokingly ..?? maybe .. talk about finding a rich husband on or around the flats ...... she ends up meeting Huxley while wandering through a rich neighborhood (looking for a rich husband, as one does), and she’s also feeling desperate. The two discover that they might be able to help each other out, and that’s the foundation of their not so meet cute. But as the two spend time together, they begin clashing....it begins to escalate – and there seems to be a fine line between love and hate.It has tons of humor and great family connections, as well as the sexual tension .....is fan-worthy at times, with a torturous slow growing on each other ..........Huxley and Lottie have zero problems with their chemistry – it’s their communication that could use a little help. he is a workaholic discovering that he’s got a jealous, possessive side......... It was for this reader ..... almost as bad as reading a teenager romance with a lot of sex. It was immature to a degree, it was definitely drawn out, and the characters were just at times very unlikable........ I think the best, funniest part was the scene with Judith... so so funny and i was laughing out loud.....simply put the book is about ...Huxley needing a fiance' to close a deal ........Lottie needs needs a rich date to impress her ex best friend/former boss at her upcoming class reunion. It isn't until after the deal is struck that they realize how much they drive each other crazy, ....the old saying \"in for a penny in for a pound,\" or something like that......... they are determined to to see this through to the end. They just have to hope they don't kill each other first - or wind up naked. Cause nothing screws up a business deal like getting naked......... (which they do several times) if I recall.....witty banter and more than a couple laugh out loud moments......",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amber Garabrandt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB2UZSEAVENMKOZIZUZSSO6WWKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ABE9KYKXE5JV?ASIN=B09J97T32C",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "4.0 out of 5 stars funny, sexy and an all-around good time",
                "reviewText": "While I loved this book, I feel like we took the misunderstandings trope a bit far. Would it have KILLED Huxley to talk about the things he was doing for her? About their relationship? I liked the characters, (after accidentally reading book #3 first, I knew I would). The premise is amazing, and it was just outright fun. There’s mid-level spice, and the plot does seem to take the large portion of the plot-to-smutt ratio. It was a fun, fast, sexy read and I enjoyed myself immensely. I will say, though, that I liked A Long Time Coming better, but it was a great book by itself. Still, the characters are great, the plot was well executed and it had a good flow to the writing. For me, this was a four star book.⭐⭐⭐⭐Rating: 4 out of 5. As far as adult content goes, there is sexual content (level five spice), language, and drinking. This one is targeted towards the adult crowd.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AER4RJI6KOSHYC5ATC36KHIAWCZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS7VWI1J0Y13A?ASIN=B09J97T32C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars loved it!!",
                "reviewText": "I honestly really loved this book! There were some chapters where I actually laughed out loud for pages at a time - so funny! I loved the characters and the way the author kept referencing things from the very beginning of the story - very full circle. It was adorable and hilarious and truly an amazing read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVW7IWANHLUH7HQ7OHAW36NTHQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MRTOORQJ0QRE?ASIN=B09J97T32C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars could not put this down!!",
                "reviewText": "I flew through this book and finished it within a week! Such an easy read, romantic, funny, and a happy ending. I honestly didn’t LOVE Lottie’s character at first because she was so stubborn and self-sabotaging, but it makes you love her even more in the end. Can’t wait to read the next one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rebeca nunes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 20, 2022",
                "reviewTitle": "love it!",
                "reviewText": "I was laughing trough the whole, amazing! I already miss them! This was one of my favorites of the year!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juliana Acevedo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 2, 2023",
                "reviewTitle": "Cute rom-com",
                "reviewText": "5 ⭐️ 3.5🌶.This is the first time I read Meghan Quinn's work and definitely won't be the last.Wow, I really enjoyed reading this book, truly laughed out loud, the spice took its time to arrive though (don't know if Meghan is a Slow Burn writer) and when it came it was totally worth it. I specially love when a book shatters my heart, that feeling in my chest... when the hero really messed it up and is trying to get the heroine back, idk it does something in me as if I like to suffer 🫠Huxley and Lottie are everything 😍, once Huxley opened up and showed the real him to Lottie things started getting very well between them, oh and I think he fell for her first. Lottie a very funny, spitfire, kind-hearted woman, who put everyone else before herself, I love her.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "joe hall",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "The page turner I've been searching for",
                "reviewText": "Absolutley fabulous book,full of ups 🌶 n downs excuse the pun,this book reeled me in slowly but by the end I could not put it down,Huxley n lottie now live rent free in my head,I'm so glad I decided to give this author a shot,on to the next meghan quinn book I go x",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AzCe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 10, 2024",
                "reviewTitle": "Top",
                "reviewText": "Toll",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AGAG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 2, 2023",
                "reviewTitle": "Loved it",
                "reviewText": "It’s a must buy book for every book lover",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71VUtZNKHtL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}