{
    "remaining_requests": 2226,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Red-White-Royal-Blue-Novel/dp/1250316774",
    "body": {
        "name": "Red, White & Royal Blue: A Novel",
        "price": "$10.90$10.90",
        "originalPrice": "",
        "rawPrice": 10.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Red-White-Royal-Blue-Novel/dp/1250316774",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41hv25yqOCL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51zQ5W7BnEL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Casey McQuiston",
            "link": "https://www.amazon.com/Casey-McQuiston/e/B07HNJ5FNV/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 55080,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 19 hrs 25 mins",
            "FREE delivery February 29 - March 4 on orders shipped by Amazon over $35",
            "Or fastest delivery February 25 - 27"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ St. Martin's Griffin (May 14, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 448 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250316774"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250316776"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 5 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.4 x 1.15 x 8.15 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,370 in Books (See Top 100 in Books) #60 in TV, Movie & Game Tie-In Fiction #136 in LGBTQ+ Romance (Books) #556 in Romantic Comedy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 55,080 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/0f8643d8-72de-4673-b110-b4f6ad7f0fec.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/51f2ab7d-9aba-42e7-a9c0-7f10b7ba531c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5adbb512-00ae-4e80-9f98-3199dbc2314d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/21007f75-b519-4c87-b7ee-ef02db6db5f5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/55933d9d-8921-4030-b5b8-6fca63e4b253.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "The Hopeless Romanticist",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNTIIAK64KQ4HP2PRJ7VIXN3U4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18R941BD9CGK6?ASIN=1250316774",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2023",
                "reviewTitle": "5.0 out of 5 stars If Harry & Meghan Were Two Dudes and Got a Better Ending.",
                "reviewText": "Red, White & Royal BlueCasey McQuiston2020422 pagesOverall Rating: 5/5MM Contemporary RomancePlot: Rising political star and overachiever Alex Claremont-Diaz gets a kick out of being a tabloid darling, thanks to his association with the most famous family in the world. Raised to work hard and dream big, the First Son of the United States is busy trying to finish college and become the youngest person ever elected to Congress. But those same tabloids he always laughs at won’t quit comparing him to the equally handsome and debonair First Son from Across the Sea, Prince Henry of the UK– as if the two are involved in a heated contest for Most Eligible Bachelor in the World or something. And Alex hates to lose any competition, especially if it involves his royal arch-nemesis.After an embarrassing public mishap occurs between the two young men during the middle of a contentious election season, some speedy damage control is required, forcing Alex and Henry into a fake friendship to help keep the peace between the two nations. And as it turns out, they have a lot more in common than they thought.First Take: This book will always hold a special place in my heart as the one that turned me on to dudes— as in gay romances. I was always afraid to dip my toes in the MM pond because it felt so forbidden, but then I picked up this book and never looked back. I was obsessed immediately. This book is so earnest and sweet and dang did it make me remember my own first love and the intense, I-will-die-without-you feelings that go along with that. Nothing gets me going like a high stakes forbidden love story with a strong emotional connection, and this book is that– political empires are at stake here, people! There may or may not (emphasis on may) be a gay awakening that is just so believable and beautiful to watch. And who doesn’t love the idea of a prince falling in love with a commoner? This one hit all my buttons.Characters: The story is told entirely from Alex’s perspective, so we get great insight into his thoughts and feelings. He is sarcastic, loud and playful, but not afraid to be serious and follow his heart when it points him in the right direction. Henry, on the other hand, is outwardly the epitome of “stiff upper lip” until you get to know him, and then all his ooey gooey sweetness comes out. He is passionate with a Capital P. There is also a great supporting cast, with Alex’s stylish and protective older sister, June, and super-smart number-crunching best friend, Nora. Special appearances by a no-nonsense Madame President with a heart of gold and aging queen who specializes in cold shoulders.Praises: There are so many things to praise about this book. Alex’s voice is so earnest and introspective, and I really enjoyed going with him on his journey of self-discovery. The romance is sweet and intensely emotional, and the high stakes feel real– my heart was racing to the very end. The writing has a sense of poetry and yearning that I really enjoyed. The story takes place in an alternate universe that felt both familiar and unique, and ultimately very relatable.Critiques: If I have one critique, it would be that it’s a tad heavy on the politics. I understand the author wrote this book in response to real-world events and the fear and uncertainty that people really felt at the time, and ultimately it is meant to be a story of hopes and dreams of what the world could be. That being said, the election process is a big part of the story and the politics lean pretty heavily democrat, which might alienate some people. I would hazard a guess that many of those alienated people aren’t terribly interested in MM romance, so it’s likely not a huge problem for most.Themes: Politics, Coming of Age, Contemporary Romance, Identity, Man v SocietyOverall Tone: Earnest, heartfelt tone with plenty of sarcasm and wit mixed inProse: Some of the descriptions are so vibrant and feel like poetry when you read them. This book is full of beautiful yearning.Steam: 3/5: The s*x scenes lack the nitty gritty details of some of the more erotic romances. They are sweet and meaningful and rather oblique– you have to use your imagination a bit.Trigger Warnings: Some discussion of the death of a family memberTropes: Fairytale, Bi awakening, Enemies-to-Lovers, Coming Out, Forbidden LoveKinks: NoneSwear Jar: 5/5: If you made this a drinking game, you’d be drunk AFMemorable quotes:“As your mother, I can appreciate that maybe this isn’t your fault, but as the president, all I want is to have the CIA fake your death and ride the dead-kid sympathy into a second term.”“Should I tell you that when we’re apart, your body comes back to me in my dreams?”The lines of him are long and languid in the moonlight, and he’s so beautiful that Alex thinks this moment, the soft shadows and pale thighs and crooked smile, should be the portrait of Henry that goes down in history.He wants to match the new freckles across Henry’s nose to the stars above them and make him name the constellations.Worthy of a reread? Obviously. Already read this one like 4 times. I think I actually read it twice in one week– basically finished it and then immediately started over. It was that good.Stand-Alones, Prequels, Sequels, & Tangents: Stand-alone novel. Would dearly wish for a sequel but will likely be waiting in vain.Check out more romance reviews at The Hopeless Romanticist blog!",
                "reviewVotes": "91 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deyaneira Vientos",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEF2DMEP3XABCJYHFJ3G6NGOJICA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R0PLLUIM8F9Z?ASIN=1250316774",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2023",
                "reviewTitle": "5.0 out of 5 stars My comfort book of 2023, maybe even forever!",
                "reviewText": "“Red, White, and Royal Blue” has been in my TBR since I decided to jump back into reading at the beginning of this year. I've been a sucker for \"White House-related” romances since I can remember and this book drew me in like a magnet. But I'm a fantasy junky so I didn't pick up the book until the first trailer for a “RWARB\" movie came forth from Amazon Prime.Fast forward two days before the movie comes out. I had just finished reading another fantasy book and after much debate, I decided I wanted to read the book before watching the movie. So I proceeded to do nothing other than work and come home to completely devour this book.By the end of chapter one, I was hooked. This book is unapologetically funny, I've never laughed harder while reading a book, every other page if not every single page. Even the sad or slower pages had me screaming laughter. Casey's comic timing deserves a medal, truly spot on *chef's kiss*.As for her charters, Alex is PERFECT!!! His internal battle over Henry, over his sexuality, over his career, is so painfully real. He's so relatable. His charm and personality which he's built over the years, are clearly built for others, not himself. Henry is DREAMY and also painfully perfectly imperfect. Always wearing a shield his family build so no one sees him for who he truly is. Alex being the only person who's broken the shield, finally seeing him the true Henry, not what the royal crown has created of him. I love how hard yet easy it was for them to learn how to take care of and love each other. Henry's anxiety and ticks, Alex's trauma responses. The plot twists are truly delicious. A bit predictable but in the best way possible.Alex, June, and Nora will forever be one of my comfort trios. How they complete each other. How they protect each other. Each one having a role they play so beautifully it should be a sin. June's relationship with Alex is everything a sibling should aspire to have with their sister or brother. Nora is the kind of best friend everyone wishes they had but is incredibly hard to find in this world. Nora with the emails killed me. Luna and Nora completely sneaked up on me in that chapter but filled my heart with so much joy and love knowing it was Luna, I almost cried.Speaking of which, can we just talk about the diversity of this book? Holy crap! Casey truly didn't hold back. Alexander, named after Alexander Hamilton, the mixed son of the first divorced, Woman President of the United States of America. One of Alex's mentors, Raphael Luna, is an openly gay senator who's also Hispanic. How unapologetically strong Zarah, the president’s Chief of Staff. All these people strong and beautiful and portrayed as they should be. All the mentions of gay, bi, etc characters. Nora, Bea, Liam, etc. Again, Perfect.Is there a little bit of spicy? yes. Is it tasteful? absolutely. I read this book with the audible narrator (which I 1,000% recommend, he's brilliant) and it made the experience 10x better. Nothing was overly explained, They came together and they made love, simple as that. In more words obviously but you get my point. Not really smut, more sensual than sexual. I love smut but this was beautiful and exactly what it needed to be.It's almost impossible to put into words how beautifully rich this book is. In story. In love. Inequality. The way the story unfolds reminds me of aged fine whisky, smooth and rich in flavor. Pacing, like the majority of this book, was spot on as well. I was never bored or trying to look ahead, it was incredibly well-paced so I was just living in the moment. Enjoying every page, paragraph, and sentence. Without much effort at all, this book has become hands down my comfort read of 2023, possibly my comfort book forever.If you decided not to read this whole thing, I understand, it’s a lot. And it’s more for me than it honestly is for you. But, nonetheless, at least read this sentence. Take this one thing with you. It’s worth it, read it. Enjoy it. Devour it. You won’t regret it!",
                "reviewVotes": "74 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 6, 2024",
                "reviewTitle": "Hilarious",
                "reviewText": "This book is the best I've ever read, honestly it was pretty funny, cute and down right cackle worthy. The characters are simply swoonworthy and they are adorable together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 16, 2023",
                "reviewTitle": "Parece apenas um livro adolescente, mas é mais que isso",
                "reviewText": "Já parou pra pensar que o simples fato de vc amar alguem pode ser o fator da sua derrocada na vida? Pode arruinar nao so sua carreira mas a da sua familia? Por que o amor entre duas pessoas do mesmo sexo pode ser transformado em algo que causa tanta miseria e dor para as partes envolvidas? Sao essas as narrativas nas entrelinhas desse livro maravilhoso que me arrebatou nas 48h que eu levei para devora-lo. Perfeito!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leonardo Reyes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 15, 2023",
                "reviewTitle": "Excelente libro, envío rápido en caja, hermosa edición",
                "reviewText": "The media could not be loaded. Me llegó en tres días, pedí la Collector’s Edition. Mi mayor miedo era que lo enviaran en sobre pero llegó en caja. Con algunas manchitas en a portada pero se pudieron quitar fácilmente. El libro es precioso, el precio es bueno, incluso más barato que comprar en físico la versión en español. No me arrepiento para nada de esta compra, me hizo muy feliz.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/E194Ve5586L.mp4"
                }
            },
            {
                "reviewerName": "Bernhardt Klibingat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 5, 2024",
                "reviewTitle": "Eine sehr gute Geschichte .",
                "reviewText": "Ich kenne dieses Buch mittlerweile fast schon auswendig, so gut geschrieben ist es. Auch der Film ist ganz nett, ist aber leider so stark vom Buch abgewichen. Die Hauptdarsteller/innen sind grandios und glaubwürdig, aber es fehlen in der Verfilmung, meiner Meinung nach, sehr wichtige Charaktere , wie die Schwester June, der Stiefvater und vor allem der Gegenkandidat der Präsidentin, der letztendlich eine wichtige Rolle in dem Buch spielt. Auch der Senator Luna spielt im Buch eine sehr wichtige Rolle, wie auch die Mutter von Henry.Es ist mehr als genug Stoff für eine gute Serie in diesem Buch vorhanden, und mit diesen hervorragenden Darstellern wäre es sicher ein großer Erfolg.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 28, 2024",
                "reviewTitle": "excellent !!",
                "reviewText": "came in great quality, bought the used but might as well be brand new, minimal damage and overall a great read! if you're hesitant to buy this book just like i was, i strongly recommend buying it either way 🙏 (keep in mind that there's a lot of american/british history terminology that you might not understand 😭)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}