{
    "remaining_requests": 2015,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Love-Wild-Retelling-Emma-Castle-ebook/dp/B086S18VDJ",
    "body": {
        "name": "Love in the Wild: A Tarzan Retelling",
        "price": "$3.99",
        "originalPrice": "",
        "rawPrice": 3.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Love-Wild-Retelling-Emma-Castle-ebook/dp/B086S18VDJ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/A1ewJNtuzHL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Emma Castle",
            "link": "https://www.amazon.com/Emma-Castle/e/B07F2KRG7W/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 691,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B086S18VDJ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (September 28, 2020)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 28, 2020"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2805 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 380 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#127,694 in Kindle Store (See Top 100 in Kindle Store) #3,463 in New Adult & College Romance (Kindle Store) #5,594 in Contemporary Romance Fiction #6,460 in Fantasy Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 691 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Katie Reads & Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDMAVXKRPPL5CVMGPZM6WOMZMQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HSSH6B51040G?ASIN=B086S18VDJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Exactly what I was looking for...Tarzan as a romance",
                "reviewText": "Ok...this morning I put on the classic cartoon movie Tarzan for my kids. It's been so long since I watched it and I thought to myself \"I bet I can find a retelling of this as a romance book.\" And sure enough I found this. Thanks reddit!It's Tarzan with instalove and all the corniness and decent spice. (Not super spicy but just enough). It was EXACTLY what I was looking for. This isn't going to be some super realistic version (it has a magical jungle) and that was OK for me. This was a quick easy read and it was perfect for what I was looking for!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nalia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJPTSX7WZ35Y53FFMBT4JREY4RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VUGU2UEFQXYC?ASIN=B086S18VDJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 12, 2023",
                "reviewTitle": "4.0 out of 5 stars This is the reason why I love Retellings!",
                "reviewText": "In this Tarzan retelling Thorne has been through a lot in his life, the only thing is he doesn't remember because once his parents were gone, he was raised by gorillas. But he does notice over time that he is different from the rest of his family. Eden is a journalist and wants to spread the story about how they can save more of the animals in the jungle of Uganda. What she doesn't know, is that she will meet a very handsome man that has no clue about what it means to be a human. What will happen when two people meet in a place where they seem so different from each other even though they look the same?I love the storyline and I love the emotional rollercoaster it has put me on. The only thing that was a bit hard for me was, that it was told in 3rd Person. Personally, I am not the biggest fan of that but I do understand why the authors decided to go with that. I still loved the book and I would read it again any day!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kswag",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELIFWFEQEAPDMJP6DA722SD3C7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OGZ7EIHDT3FO?ASIN=B086S18VDJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 22, 2021",
                "reviewTitle": "5.0 out of 5 stars Love this!",
                "reviewText": "Love in the Wild by @emmacastlebooks…………“You are my future, my mate, my destiny. My everything.”………….This book is a beautiful retelling of the Tarzan story. The story varies differently than any of the other Tarzan rendition I’ve seen. This book will pull at your heart strings! 😭 It’s told with many points of view, including gorillas, but the main two are Thorne and Eden. So you get a true connection with the characters.…………..“This jungle has a heart, And it protects its own.”………….This book follows Eden who is touring the African jungle to take pictures of the Gorillas when her group is attacked. She is saved by Thorne aka Tarzan and he sweeps her away to his home in the jungle. They are sweet together and there is an instant connection with them. Eden helps Thorne remember his family and piece together parts he doesn’t know. They grow together and ultimately devise a plan that will save the jungle from any more attackers who would want to steal its treasure.…………….“He’s coming for you.”……………..There is a bit of mystery around Thorne and his tie to the jungle. He is considered a jungle God and I thought that was a very interesting storyline. This book is very well written and very informative of the jungle and conservation without seeming to jam it down your throat. This is a beautiful romance however I will admit that I thought it would be more primal and darker sexually, so I feel like I have to admit that 🤣 but other than that I highly recommend it as I’ve never read a Tarzan retelling before and I would love to read others like it! And that epilogue! 😭😭 The best ending to this story!!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "@FourFiveFox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPW6RHBMFR2LWCBWUKLWQUPRQSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CAGIHGW6T84?ASIN=B086S18VDJ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2020",
                "reviewTitle": "3.0 out of 5 stars A bit of a struggle for me",
                "reviewText": "So we know going in that this is a modern retelling of Tarzan.It had lots of potential, but felt a little rushed. The author's note at the beginning mentioned the amount of research she did to learn about the jungle, etc, but I didn't get that feeling reading it.The love story was way to insta love for me. I get that Thorne would approach taking a mate like an animal would, but eh...the relationship between he and Eden felt so underdeveloped.Mild spoilers....I ended up not liking Eden's character. She pushed Thorne a lot, to do things out of his comfort zone. Which sure, could mean growth and all, but it came across like nagging. Like please Thorne, wear this blue shirt because its its what's expected of you. I don't know, I just didn't care for that.Overall, a strange adaptation that felt like it was missing something. I love the idea of Thorne so much, but wish we could have gotten to know him much better.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW3KLKG6WJJZTBPGCFBTCWH5FBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y73HG9902ACG?ASIN=B086S18VDJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2020",
                "reviewTitle": "5.0 out of 5 stars Great modern retelling",
                "reviewText": "Our heroine Eden Matthew is deep in the jungles of Uganda capturing the beauty of the Gorillas with her tour guided group when they are all set upon by poachers. Eden is facing death when a beast-like man comes to her rescue and sweeps her away from danger. Eden finds herself stranded in the middle of nowhere with this bigger than life man. She soon discoveries who he is and is pulled into the magic of Thorne and the jungle.Thorne Haywood has been raised in the jungles by gorillas since he was three after his parents were murdered. As he grew up he realized that he was different from his gorilla family. He was among them but not a part of them. Thorne is drawn to Eden right away and wants to mate her. Thorne sets out to woo her for mating but then finds himself trying to win her heart too.What a wonderful surprise this book and new to me author was. This modern retelling of Tarzan has a beautiful romance interwoven with action and mystical undertones that had me enthralled from the first page. The jungle and all the beautiful animals were brought to life and I could literally feel the energy of it all with Emma Castle’s words. She did a fantastic job of highlighting and making me feel like the essence of the jungle and all its powerful inhabitants did possess magic.The romance between Thorn and Eden unfolded beautifully. We were given enough backstory to make me believe in their connection and strong feelings for each other. There was a nice balance of steam and substance to their romance. Eden is one lucky lady because 'oh boy' when Thorne is focused on her his magnetism is pretty powerful.I adored this book very much. Love the exotic setting, love the H/h, and definitely enjoyed all the other characters introduced. That epilogue was perfection and made my heart smile. All this together made this a fantastic read for me",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sdj573",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 19, 2024",
                "reviewTitle": "Has it's flaws but still worth it",
                "reviewText": "Delivers as promised even though the ending is very 'Stephen King'. Still recommend it even if that's something you'll complain about. With the lack of options for versions of 'Tarzan' I'd defiantly recommend it if you're bothering with reading the reviews.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nz_0w",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 7, 2023",
                "reviewTitle": "AMAZING",
                "reviewText": "i couldn’t bare to put this down, absolutely brilliant writing. all the characters were beautifully written and the love story itself was amazing. absolutely recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melanie Haubensack",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 15, 2021",
                "reviewTitle": "Fantastisch",
                "reviewText": "Seit ich mich erinnern kann liebe ich die Geschichte von Tarzan. Sie neu erleben zu können, mit so viel Magie, Liebe und Herzblut hat mich einfach bezaubert und begeistert!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Avid Bibliophile",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 11, 2022",
                "reviewTitle": "What a Gem",
                "reviewText": "Everyone knows the story of Tarzan, but the depths that Emma went to brought it to life! My absolute favorite bedtime story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alannah",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 29, 2020",
                "reviewTitle": "A modern take on Tarzan",
                "reviewText": "At the start of the book, the author states she tried to do as much research as possible to accurately depict Uganda, and to not generalize it as ‘Africa’.While I can’t speak to her accuracy, I can say she carefully crafted Uganda and made a truly unique entity that becomes a major character in the story.The story doesn’t necessarily go in the direction I had hoped but it’s not boring, and it reminded me of my childhood dream of being an ‘animal rescue hero’ like I’d seen on tv.The reason I rated this at 4.5 as opposed to 5, is the lack of development of the antagonist. Pieces of his characterization felt a bit cartoonish at one point but the foundations for a strong villain were set. I would have also liked to see a bit more of surviving in the jungle and what that would entailed for someone like Thorne vs someone like Eden. There is also one or two things that happen at the start of the book (no spoilers, don’t worry), that I would’ve liked to seen addressed again at the end of the book or in the epilogue.All in all, I thought it was a good read and I recommend it. :)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}