{
    "remaining_requests": 2052,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mooncakes-Suzanne-Walker/dp/154930304X",
    "body": {
        "name": "Mooncakes",
        "price": "$12.22$12.22",
        "originalPrice": "",
        "rawPrice": 12.22,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mooncakes-Suzanne-Walker/dp/154930304X",
        "soldBy": {
            "sellerID": "A25H6JFKDMQ758",
            "name": "-OnTimeBooks-",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A25H6JFKDMQ758"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71pbsZWxv3L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Suzanne Walker",
            "link": "https://www.amazon.com/Suzanne-Walker/e/B07QDPP69P/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "-OnTimeBooks-",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1344,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"This sweet, spellbinding story will appeal to fans of magic and romance.\" ― School Library Journal (starred review)“Mooncakes is heartwarming, playful and absolutely magical! A story about love and family, with a kind and powerful core that radiates through the vibrant cast of characters.” -- K. O'Neill, author of The Tea Dragon Society\"Mooncakes is spellbinding.\" -- Tillie Walden, creator of Spinning and On a Sunbeam\"This graphic novel is the joyful fantasy romance we all need right now, and it might just restore your faith in magic.\" -- Charlie Jane Anders, author of All the Birds in the SkyCOSMOPOLITAN, These LGBTQ+ Witch Books Will Cast a Spell on YouTHE ADVOCATE, The Best LGBTQ Graphic Novels of 2019BOOK RIOT, Best Witch Romance BooksBUSINESS INSIDER, 21 Amazing Books Starring Transgender and Non-Binary CharactersBUZZFEED, 13 Witchy Books That Will Keep You Spellbound NBC NEWS, 18 Fiction Books to Read for Asian Pacific American Heritage MonthAUTOSTRADDLE, 8 Trans-Inclusive Fantasy Books for Harry Potter Fans About the Author Wendy Xu is an award-nominated Brooklyn-based illustrator and comics artist with three upcoming graphic novels from Harper Collins. Her work has been featured on Catapult, Barnes & Noble Sci-fi/Fantasy Blog, and Tor.com, among other places. You can find more art on her instagram: @artofwendyxu or on twitter: @angrygirLcomics"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 6 mins",
            "FREE delivery February 27 - March 1.",
            "Or fastest delivery Saturday, February 24."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"If Mooncakes were a spell, it would be a housewarming charm that settles with care into the softest parts of a home and makes the houseplants grow. I wish I could live inside this book.” — New York Times bestselling author Casey McQuistonA story of love and demons, family and witchcraft. Nova Huang knows more about magic than your average teen witch. She works at her grandmothers’ bookshop, where she helps them loan out spell books and investigate any supernatural occurrences in their New England town. One fateful night, she follows reports of a white wolf into the woods, and she comes across the unexpected: her childhood crush, Tam Lang, battling a horse demon in the woods. As a werewolf, Tam has been wandering from place to place for years, unable to call any townhome. Pursued by dark forces eager to claim the magic of wolves and out of options, Tam turns to Nova for help. Their latent feelings are rekindled against the backdrop of witchcraft, untested magic, occult rituals, and family ties both new and old in this enchanting tale of self-discovery. 2019 Goodreads Choice Award Finalist 2019 Cybils Award Finalist 2020 Hugo Award Nominee A 2020 ALA Rainbow Top Ten Book",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Oni Press (October 15, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 256 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 154930304X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1549303043"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 - 16 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 8 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.2 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.7 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#37,214 in Books (See Top 100 in Books) #17 in Young Adult Romance Comics & Graphic Novels #30 in Teen & Young Adult Science Fiction & Fantasy Comics"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,344 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3HHL7MI4NVMGY73FFRYALGRWRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMSZJS4BV9FGA?ASIN=154930304X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 27, 2022",
                "reviewTitle": "5.0 out of 5 stars An adorable, fantastical love story with great representation!",
                "reviewText": "If you’re looking for representation, this is a great book for you!- Nova has hearing aids, and the book does a pretty good job of being accurate without making a big deal out of it! The color of them also matches Tam’s hair :)- Nova lives with her two grandmas, who are wholesome and badass witches!- Tam is somewhere under the nonbinary umbrella! When meeting Nova’s grandmas again, Tam lets them know that their pronouns are now they/them. The two correct themselves casually and it’s nice to see changing pronouns flow so smoothly. Tam also kept their birth name, which is nice to see since there’s not much representation for trans people who don’t want to change their names!- There’s a decent variation of body types among the main cast, so that’s nice too.Overall, I adored this book and read it in one sitting. If a love story between a witch and a werewolf isn’t enough to draw you in, there’s also themes of childhood best friends, found families and accepting life changes. If you enjoy fantasy creature design, I won’t spoil it but oh my god the forest spirits are the cutest little bunch I’ve ever seen! The magic theme is very captivating, but underneath it I think everything can be read as metaphors that are very relatable to lgbt people and/or teenagers. I think Tam’s character as a werewolf and the way it affects their life is very symbolic of what it’s like to be a trans teenager in the real world. Mooncakes is a coming of age story that touches on queer identities and experiences with a fun twist of witchcraft. It can be lighthearted and taken as purely fantasy if you want to, but it can also be deeper if you’re looking for fantasy characters that you can project onto as a queer person. I highly recommend this book to any lgbt person or ally, especially if you’re younger and just discovering your identity. Outside of the story, I also recommend this book for its fun character and setting design, the art was lovely and engaging. I’m definitely inspired to make fanart..It’s a pretty quick read, but 100% worth it in my opinion!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen Burke ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVQ4K2C4ENEE4OEVMW5R4O4BM5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHH8269WK3A76?ASIN=154930304X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Beautiful story",
                "reviewText": "A wonderful story of found family, love, and magic from a new perspective. Enjoyable read over a cup of tea :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tabitha D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAF7FQSQDWHKPEXD3NWTNUHV35A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SAP20EOXG3I2?ASIN=154930304X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 22, 2022",
                "reviewTitle": "4.0 out of 5 stars So happy to finally read this",
                "reviewText": "I’ve been wanting to read this book for over a year now. Ever since I first heard about it on booktube and then saw the cover I was hooked. And I wasn’t disappointed either. The story was wonderful and the characters just so well-done. While it wasn’t a 5 star for me as I felt like I wanted a little something more from the ending? It’s still a solid 4 star and definitely a graphic novel I’d recommend as it has beautifully done D/deaf and HoH as well as LGQBT+ representation. I was also happy to see old characters as well. And while I want to give a warning for the following sensitive material such as mentions and discussion of parental loss, grief, depression, and abuse? I also have to say that I felt it was handled well. Though a quick disclaimer that you should look up the content warnings for yourself in case I missed any. Last, though certainly not least, the art was lovely and just absolutely jaw-dropping at some parts especially in the depictions of magic. Hopefully one day soon this will grace my shelves cause I’d love to own a physical copy of something this beautiful.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elysa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO2EDF6SJCWMBQSOULNUQ6OL6YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VTA03Z7UOAII?ASIN=154930304X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Absolutely adorable",
                "reviewText": "\"Mooncakes\" is a sweet story with a bit of adventure featuring a witch and a werewolf. I loved the art and all the characters. I'd love more books in this world with these characters, but I'm also happy to reread this one over and over.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lilly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2EUVE6OG3RKHQCXIW56X4C7RPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1799A0YR406DF?ASIN=154930304X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "3.0 out of 5 stars Still forming my opinion...",
                "reviewText": "I'm really not sure where it's landing for me quite yet. This isn't usually how I write reviews, but here are some of my initial thoughts.Some things I LOVED:-the artwork is BEAUTIFUL.-all of the creatures are so cute and magical-loved the witchy/autmnal vibes-loved the hard of hearing representation (it really made me realize that this is not represented in media often enough/really at all)-loved the identity and family diversity amongst the MCs and other charactersSome things I DIDN'T LOVE:-where are the mooncakes?-I went into this expecting a cozy baking story (also indicated by the cover) and am a bit confused over the title and cover because neither of them really feel like they have anything to do with the story-the insta-love trope (not really a fan of this)-there is no background given on any of characters (this was huge for me), story just kind of abruptly startsI think I'll likely need to return to this review at some point once I've had some time to think about this book more.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4LYCS4R5HCQY63C6WQLICGVRGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IUWHU2D8AONE?ASIN=154930304X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 31, 2023",
                "reviewTitle": "5.0 out of 5 stars so cute !!",
                "reviewText": "this book has everything ! nonbinary rep, fruity rep, cute witchy shenanigans, beautiful art, and a great plot too !! would recommend this to anyone looking for a wholesome but interesting story !! :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara Krauthamer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCOHCMKBN3T6NX2VREJSAKRLWOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5RP337JEDQ1V?ASIN=154930304X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2022",
                "reviewTitle": "5.0 out of 5 stars One of the most pleasant uplifting reading experiences I've had in a while",
                "reviewText": "This is a story I will reread (on my second read now). Flawless combination of story and artwork. Just as heartwarming as the description claimed. Lived up to all the blurbs on the back cover: heartwarming, magical, clever, loveable characters. Author and artist do a phenomenal job of creating an inclusive story so fluidly and naturally - the whole story, taken together, is deeply affirming.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TC Books and MoreTC Books and More",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4S5SB44GKBE2GWLKRCHNIAAQMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EPNZOHFGP8YX?ASIN=154930304X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2023",
                "reviewTitle": "4.0 out of 5 stars A mix of queer romance, witches, werewolves, and first loves",
                "reviewText": "This is a cute, witchy graphic novel with an intriguing art style.I really liked Nova, a witch who uses hearing aids and non-verbal spells and lives with her grandmas in a small town. She works at the Black Cat bookstore, and there are plenty of eponymous black cats. Tam is a werewolf and an old friend of Nova. Their relationship is super cute.I liked the story and loved the LGBQTA representation.Recommend for people who liked Tara and Willow from Buffy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81QNprcFA3L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "robbie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 14, 2023",
                "reviewTitle": "Amazing",
                "reviewText": "I loved it !! Couldn’t put it down. Such a sweet book and I loved all the 2SLGBTQIA add ins ! Makes it totally normal in the world as it should be in ours. The book felt comfortable 💖",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rosa E.Rosa E.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 21, 2022",
                "reviewTitle": "Lindo",
                "reviewText": "Las ilustraciones son hermosas! Tienen un nivel de detalle precioso, pero, coincido en que la portada no tiene mucha relación con la historia.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71GIq47qgHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "sarah💕sarah💕",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 8, 2023",
                "reviewTitle": "so beautiful",
                "reviewText": "mooncakes is one of the most beautiful books i have ever read in my life, the art is so beautiful. the plot was incredible, i read it all in one day, i read about 150 pages in school and finished the rest at home i could not drop the book, it is amazing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719hHyu6iEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zSACI9whL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71TVK7KhMUL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabriela",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 23, 2020",
                "reviewTitle": "Um amorzinho!!!!",
                "reviewText": "Se você gosta da ideia de uma hq leve e fofa com magia, cafeteria, avós bruxas e protetoras, amizade de aquecer o coração, romance bonitinho e representatividade abordada de forma super natural, essa hq foi feita pra você.Nova é uma bruxa que vive com as avós e descobre que há algo misterioso acontecendo na floresta, e junto de Tam lobisomem e não-binárie (não sei se está certo, qualquer coisa me conta como é) que retorna para a cidade depois de um tempo fora, ambos vão tentar resolver o que está causando problemas. A melhor amiga da Nova é suuuuper legal e ama ciências, gostei das atitudes dela em relação à magia.Amei esse universo em que a magia é algo natural, sabe? Sem falar que OS TRAÇOS DESSA HQ SÃO MUITO LINDOS! Com certeza vou reler todo Halloween.p.s: o inglês dessa hq é fácil de compreender.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jess YoungJess Young",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 21, 2022",
                "reviewTitle": "Beautiful graphic novel with disabled and LGBTQIA+ representation!",
                "reviewText": "Lovely graphic novel, one of my favourites! Minimal to no damage when I received the book. I personally find Amazon books arrived damaged or are sent out damaged so it’s refreshing received an undamaged book! Also great queer LGBTQIA+ and disabled representation!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71eW9Q42dRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/612OXN9L-3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71S-TO6Ch0L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}