{
    "remaining_requests": 2247,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Challenged-Changing-Krysset-Novel-1/dp/152344911X",
    "body": {
        "name": "Challenged (A Changing Krysset Novel)",
        "price": "$2.33",
        "originalPrice": "",
        "rawPrice": 2.33,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Challenged-Changing-Krysset-Novel-1/dp/152344911X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51bs eMVl L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Fz5rfYTdL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kate Carley",
            "link": "https://www.amazon.com/Kate-Carley/e/B01AOPS4TE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 12,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 17 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b?ie=UTF8&node=23"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/Contemporary-Romance-Books/b?ie=UTF8&node=13354"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ CreateSpace Independent Publishing Platform (January 27, 2016)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 340 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 152344911X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1523449118"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.25 x 0.77 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#264,598 in Books (See Top 100 in Books) #1,151 in Small Town Romance (Books) #44,610 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 12 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tracy Broemmer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP4YOF3FLEKIPKMTCWTYGGPMZMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VH7JO1NTET9U?ASIN=152344911X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 8, 2016",
                "reviewTitle": "5.0 out of 5 stars Though Sophia decides to throw herself whole-heartedly into the challenge issued by her grandfather-Jackson’s longtime boss and",
                "reviewText": "A phone call from Krysset, Minnesota, hundreds of miles and several years away from Sophia Lancaster’s current life, lures her back home. Sophia is stunned to learn her grandfather has just passed and has named her in his will. All she has to do to inherit his lake resort in Krysset-the place Sophia called home until she was eight years old-is live on the property for a year and run the resort with her childhood friend, Jackson Cooper. If they turn a profit after a year, they will be coheirs.Though Sophia decides to throw herself whole-heartedly into the challenge issued by her grandfather-Jackson’s longtime boss and friend-she quickly learns success will not come easily. First she has to fight through the sorrow the memories bring; she’s been gone from the resort for twenty-one years, and walking back into her childhood home is much harder than she’d thought it would be. Then there’s Jackson, childhood friend turned angry and bitter for how she walked out on her grandparents. Jackson’s all grown up, and he’s pretty easy on the eyes. Oh, and it seems someone in Krysset doesn’t want Sophia and Jackson to succeed with the resort.Kate Carley’s debut romance, Challenged, is a scorcher. Kate describes the resort in such beautiful detail that readers will want to call Lancaster’s and book a week’s vacation in one of the new A-frame cabins Jackson built. Her characters are well developed, with their own pasts and motivations, and Carley builds the sexual tension higher and higher, until finally bringing the heat. Readers who enjoy sweet, but smoking hot romance, and a little mystery besides, are going to love this one! Tracy Broemmer, author of the Lorelei Bluffs series",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suzanne M-H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQAB2SEEXW2AEGV6TER6CBBURFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDOKJTVLW73BI?ASIN=152344911X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2016",
                "reviewTitle": "4.0 out of 5 stars A strong debut romance suspense",
                "reviewText": "I enjoyed reading Kate Carley's debut novel, Challenged. She did a great job with developing the backstory of each character, Sophia and Jackson, as well as creating their distinct character identities. There was something in this book for everyone - drama, intrigue, romance and a happily ever after ending. I'm looking forward to her next book in the series.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7YZFJSKTLRTU67775PRY53ZDKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36LQJZWJA1TE4?ASIN=152344911X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 3, 2016",
                "reviewTitle": "5.0 out of 5 stars A wonderful first novel",
                "reviewText": "Such a treat to read this novel from a new author. The minute you begin reading you feel as if you are part of the story. By the end of the book you wish you could continue on with the life of the people and the resort.I can't wait to read more!!!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trish (I read too much!)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHTY3PV4UK4PNC2GMMTXF6N6GMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KWL76SRR1BMV?ASIN=152344911X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2016",
                "reviewTitle": "4.0 out of 5 stars Romance with a good story backing it.",
                "reviewText": "Challenged is quite a good read.It’s a blend of romance and suspense with a touch of mystery. When her grandpa passes away, Sophie faces the challenge of a lifetime. Work together with long-lost friend, Jackson, to prove they can run the resort successfully, or bow out and give him the resort, passing on an opportunity to rediscover her past and forge a new future. She takes the challenge.What I like most about this story is the mystery. There’s someone out to get Sophie and Jackson, or at least to get their inheritance, but it isn’t obvious. Not only do the two need to figure it out, the stakes get higher and higher the longer it takes them. We get some glimpses into their opposition, and at one point it seemed like the villain was named, but I think maybe I just misinterpreted it, staying up too late to read.Another thing I liked was how the budding romance plays out between Jackson and Sophie. They fight their instincts and attraction, holding out for a real connection, but when they finally give in, it’s all fireworks and playful banter and sweetness rolled together. Their intimate scenes are detailed, but tasteful and realistic, and I love how the emotions don’t play second.I’m not completely sold on the perspectives switching off, especially during the intimate scenes, but it does let you get into the heads of both Jackson and Sophie. Still, I think it was pretty well done overall. Each character’s voice comes through so you aren’t left guessing who’s thinking what. There are a few times where the story kicks into full third person, but for the most part, it’s limited third person, covering either Sophie or Jackson.Overall, I really liked this story. It’s a great blend of suspense, mystery and romance in a modern, small town setting. Folks who dig romance with a good story backing it will likely either really like or even love this one. On the other hand, folks who don’t prefer a lot of focus on attraction and intimacy might not find this a good fit, as those are a huge part of this story.I received a copy of this book from the author in return for a non-reciprocal review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alasdair C Shaw",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE73X3NRSYPPG736UBK4S3O5LKBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31JVJZ3OU7TCI?ASIN=152344911X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2016",
                "reviewTitle": "3.0 out of 5 stars Don't be put off by the cover",
                "reviewText": "I liked the set-up of this story - the classic two childhood enemies having to work together for their mutual gain. The external world intruding on their private reckoning adds tension to the novel, and lifts it.The cover does not do it justice. There is more to this book than the boring and terribly cliched 'shirtless man' would suggest. Indeed, the plot develops nicely, and it goes beyond the usual cardboard cutout characterisation one usually encounters in books with such a himbo on the front.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "buzymomof2",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEE7YYCN6H2DMDCOD5H2A6KSKLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CLM8MK0TIBL9?ASIN=152344911X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2019",
                "reviewTitle": "5.0 out of 5 stars Loved it!!!",
                "reviewText": "I truly loved this novel from Kate Carley. She does a wonderful job writing where you feel like you are right there in the story with the characters and living their lives with them. Every once in a while you find an author who writes a story that you don't want to end and this is definitely one of those. Well developed story line and strong characters make it even more enjoyable. A job well done by a new author who quickly joined my list of favorite authors.I received a free copy of this book via Booksprout and am voluntarily leaving a review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda Davies",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 25, 2016",
                "reviewTitle": "I enjoyed it, an easy read.",
                "reviewText": "This was easy to read because it was well written with great descriptive writing and believable characters. The suspense element added another dimension to the romance and the steamy sex for a very enjoyable read. Only 4 stars because sometimes I found it too repetitive, but that is my only criticism.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}