{
    "remaining_requests": 2263,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Once-Upon-Charming-Bookshop-Texas-ebook/dp/B0BW9HFL28",
    "body": {
        "name": "Once Upon a Charming Bookshop (Charming, Texas Book 6)",
        "price": "$4.99",
        "originalPrice": "",
        "rawPrice": 4.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Once-Upon-Charming-Bookshop-Texas-ebook/dp/B0BW9HFL28",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81BQPgt8E0L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Heatherly Bell",
            "link": "https://www.amazon.com/Heatherly-Bell/e/B00PCY9WOO/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 61,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BW9HFL28"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Harlequin Special Edition (November 28, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 28, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1665 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 233 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#391,611 in Kindle Store (See Top 100 in Kindle Store) #1,533 in Small Town Romance eBooks #1,739 in Small Town Romance (Books) #2,369 in Small Town & Rural Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 61 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "lep",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH4HXFETDCFUY6DAPZGDZQ3NVZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H64BRBPCVYK5?ASIN=B0BW9HFL28",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars The couple become best friends as youths and grows stronger as they become adults.",
                "reviewText": "From the beginning, I have loved the relationship between Twyla and Noah. Very rarely do romances contain heroes and heroines who experience extremely close, platonic friendships. Especially friendships that last more than half of their lives, and have no conditions or expectations except to be there for each otherYet, truthfully, not everything in this friendship is as it seems. In fact, Twyla has always loved Noah, even as a young girl. Noah, also, has always been infatuation with Twyla. However, he knew that his older brother, Will, also liked her. Therefore, since Noah adored his brother, he made the decision to step aside and let Will and Twyla date. Even, after Will dies, Noah continues to hide his feelings because he believes it is impossible for him to compete with Will’s memory.Twyla also hides her true feelings because she does not believe that Noah feels the same way as she does. Thus, Noah and Twyla become very close friends, and they continue to deny their feelings. At this point, neither one of them wants to change their relationship because it may ruin their necessary friendship.Noah, who had move away from Charming, now chooses to return home where his mother, friends and Twyla lives. In a controversial decision, he decides to buy a boat charter when its current owner retires. Even though this upsets his mother, Twyla and some other townspeople, Noah is determined to take over the business.This story mainly concentrates on Twyla and Noah strong friendship and their suppressed emotions. The more they are together, the more they become aware of these deeply hidden feelings for each other. Even though Twyla wants to reveal her love, Noah does a fantastic job of keeping his love a secret.To further complicate the couple’s journey to love, Noah’s mother still refers to Twyla as Will’s girlfriend. Because of that she believes that Noah and Twyla do not belong together.Readers will greatly appreciate the hard-working and good-hearted main characters of Twyla and Noah. They will also have great respect for a friendship that allows them to always be there for each other!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle Pierce",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEQZQY2RIHVBZ3U42RC66Z5VFFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QPYV4DL408W6?ASIN=B0BW9HFL28",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Endless Possibilities Ahead",
                "reviewText": "This book is all about reading, my favorite thing. From our heroine who owns the bookstore and loves books, the Almost Dead Poets Society who has meetings in the bookstore and share their poetry, she also has a costume party where you dress as your favorite book character and the christmas tree lighting and ornament idea was a great idea. I really liked our main characters, Twyla and Noah and learning so much about their past and how Will (Noah’s deceased brother) still affects things years later. These two are best friends but each has underlying feelings for the other and neither of them wants to admit it or make the first step and rock the boat, so to speak. However when Noah comes back to town for good, things change in a major way. I was definitely rooting for these two but then Noah’s ex comes back into town on a mission to get him back. I have to say I was not a fan of his ex. However when things are at a bad point, these two find their way back to each other and I look forward to seeing what comes next for them. I loved how Will (Noah’s deceased brother) comes into play in this book especially with the boat and the angel investor’s name, a coincidence, I think not. I would definitely love to hang out with Twyla and talk about all the books in her bookstore with a cup of tea or hot chocolate. Wonderful book!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Becca",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGECDTLSX5S2CY2ZZAJUA3MKHPUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TR3TB9SGQV2W?ASIN=B0BW9HFL28",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Friends to Lovers",
                "reviewText": "I love the friends to lovers trope and Heatherly Bell does not disappoint in this next installment of the Charming, Texas series. Great chemistry between Noah and Twyla. I highly recommend the whole series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steamy book momma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMAPFTBHFICHGYGSXKCWHQPTHUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDSW7YZ2THJMP?ASIN=B0BW9HFL28",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2023",
                "reviewTitle": "4.0 out of 5 stars Will it finally by Twyla and Noah's time?",
                "reviewText": "This is the sixth book in this series. They can be read as stand alone romance. I haven’t read any of the others in this series and wasn’t confused. This is also the first book by Heather I have read. Twyla and Noah have been friends for most of their life. Everyone around them knows they are in love but neither will admit it for fear of being rejected. There is also the small matter that Twyla had dated Noah older brother Will. The death of Will still hangs over both of them. Some people in their small town have trouble moving forward. Noah has moved back home from Austin. Will it finally be their time? Noah is tired of fighting what he feels for Twyla. The people around them may be what finally bring them together but will it be enough to keep them together? This was a sweet small town friends to lovers romance with a tiny bit of heat. These two have been in love with each other from almost the moment they met. However they both let fear keep them apart. This book was a great sweet read. I look forward to reading more books by Heather in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elainec",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7ATO5V5WV5V3VDNI4XZAKNTFBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MI43B3RFU73A?ASIN=B0BW9HFL28",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Once Upon a Charming Bookshop ~ Charming Texas #6 by Heatherly Bell",
                "reviewText": "Once Upon a Charming Bookshop ~ Charming Texas #6 by Heatherly BellSimply... brilliant, I just love reading Heatherly's books, they each draw you in from the very first page until the end, which you don't want to happen:)I have read a few from this series, and the characters feel like family. Noah and Twyla have been best friends for years, both had feelings for each other but didn't act on them back then. Could now be the time?Once Upon a Charming Bookshop is very well written with wonderful characters and a very strong believable storyline, put together over the Christmas season this is magical. What's not to love about this book?I highly recommend this book to all, and hopefully, I shall be catching up on the ones I missed as well as more to come.Reasons I enjoyed this book:Easy-to-read, Entertaining, Great world building, Happily Ever After, Inspirational, Page-turner, Romantic, Realistic, and Wonderful characters",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}