{
    "remaining_requests": 2159,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/One-Duke-Down-Rogues-Lovers-ebook/dp/B09XL7G8XR",
    "body": {
        "name": "One Duke Down: A Rogues to Lovers Novel",
        "price": "$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/One-Duke-Down-Rogues-Lovers-ebook/dp/B09XL7G8XR",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81gWiJaZjfL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Anna Bennett",
            "link": "https://www.amazon.com/Anna-Bennett/e/B01ILCHXYO/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 157,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The next delightful novel in Anna Bennett's Rogues to Lovers series!\"Tantalizing...readers will be swept away.\" - Publishers WeeklyA FISHERMAN’S DAUGHTERMiss Poppy Summers is determined to keep her family’s fishing business afloat. Her poor widowed father has fallen ill, and her foolhardy brother has moved to London, leaving her precious little time to read or pursue her own dreams. But she’ll do anything for her family, so she cheerfully spends mornings in her rowboat, casting her nets. The very last thing Poppy expects or wants to find tangled in them is a dangerously attractive man. Especially one with a head wound—who’s convinced he’s a duke.AND A DUKE OUT OF WATERAndrew Keane is the Duke of Hawking, but he’s having the devil of a time convincing his fiery-haired rescuer of that fact. The truth is he came to the seaside resort of Bellehaven Bay to escape his life in London. Unfortunately, someone in Bellehaven wants to kill him—and he intends to find out who. He implores Poppy to tend to his injuries and hide him on her beach, reasoning it will be easier to find his attacker if that man assumes Keane is already dead. She wants no part of the scheme but can’t refuse the generous sum he offers in exchange for food and shelter while he recovers. It’s a mutually beneficial business arrangement…nothing more.ARE ABOUT TO MAKE WAVESUnder Poppy’s care, Keane regains his strength—and a sense of purpose. As they work together to solve the puzzle of his would-be murderer, he’s dazzled by her rapier wit and adventurous spirit; she’s intrigued by his mysterious air and protective streak. Though Poppy’s past gives her every reason to mistrust someone like Keane, the seawalls around her heart crumble in the storm of their passion. But when clues hint at the prime suspect in Keane’s attempted murder, Poppy must decide where her loyalties lie. Torn between the world she’s always known and the one she’s always dreamed of, she’ll need true love for a shot at her fairytale ending.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09XL7G8XR"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ St. Martin's Paperbacks (January 24, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 24, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3240 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 349 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1250793939"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#295,583 in Kindle Store (See Top 100 in Kindle Store) #6,601 in Regency Historical Romance #7,817 in Regency Romances #34,161 in Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 157 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Melanie Valente",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPL54ZLAVN3ORD3GJWWAQ6S2JOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AFJW6ZVVMQ37?ASIN=B09XL7G8XR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "4.0 out of 5 stars An enjoyable historical romance",
                "reviewText": "One Duke Down was a fantastic read with a romance between two people from entirely different worlds.Miss Poppy Summers is determined to keep her family's fishing business running while her father is ill and her brother is in London. Each morning she goes out in her rowboat, casting her nets until one day she goes out and finds an unconscious man tangled in them. Andrew Keane, the Duke of Hawking, is having the hardest time convincing his beautiful rescuer that he's actually a duke and that someone is trying to kill him. After finally convincing her of his identity, Poppy agrees to shelter Keane for a hefty sum. As they work together to find the person that's trying to kill Keane, the attraction between them grows. Torn between the world she's always known and the one she's dreamed of, Poppy will have to make a choice if she wants a shot at happily-ever-after.Poppy's character caught my attention in Girls Before Earls so I was excited to get her story in this book. I love her loyalty to her family and I think it's admirable how she cares for her father and keeps his business running. I do think she has a hard time taking things for herself and I liked seeing her grow to be more willing to express her wants as the book went on. Keane was an interesting character and I wondered why someone would be trying to kill him. I loved how quickly he fell for Poppy and that he was open about wanting a real relationship with her right away. Their relationship isn't without complication based on their vastly different lives but I liked seeing them work through those issues. Plus the two have amazing chemistry and the steamy scenes are fantastic so I was very happy with their romance.The plot surrounding who was trying to kill Keane was interesting. As for the circumstances, he was hit on the back of the head and then dumped in the ocean to drown. After Poppy rescues him and he persuades her to help him, he already has a list of a few potential suspects. Each person on the list has reason to want him dead so the pair, along with Keane's valet Diggs, set out to find out the whereabouts of each person on the night Keane was attacked. I really enjoyed the group's investigation and their methods for eliminating suspects. The perpetrator ended up being someone I didn't expect and I was surprised at their reasoning for trying to kill Keane. I liked the way the author wrapped things up and thought the plot was well done.Overall One Duke Down was an amazing book and I'm looking forward to reading Kitty's story soon in It Takes a Rake.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "overflowingwithreviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZUCEYNBMJLMVDB5KJZVW2REWBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WU8Q5XFSZR8O?ASIN=B09XL7G8XR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Great!",
                "reviewText": "Anna Bennett is a new-to-me author, and after seeing this cover pop up numerous times in my feed, I decided to give this a try, based on a particular review that really spoke to me. The review, in my opinion was entirely accurate. Low-angst, full of absolutely wonderfully romantic moments and romantic dialogue, and with a touch of mystery, One Duke Down did not disappoint at all. I read it in a single sitting, and the low amount of angst was like a soothing salve for my soul. Keane is a hopelessly devoted hero in every sense of the word, and Poppy is the sort of heroine I just adore in a historical romance: strong when she needs to be and tender needed, too. There is a bit of insta-love between them, especially on Keane's behalf in the beginning, but it's done in a way that isn't too rushed, and is believable through both his actions and his words. What I also love about Keane is that he never tries to force Poppy into a box she doesn't belong in. He's wise enough to let her decide on her own what she wants to do. Together, they are delightful in every sense of the word, and I can't wait to read more from Anna Bennett in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daffodilbookshelf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTRTPH3UUA44XRXRYKFNLUAYOMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LUBUCE0Z88QM?ASIN=B09XL7G8XR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars Cute, light historical romance",
                "reviewText": "One Duke Down was a cute, light historical romance with plenty of steam. When fisherman's daughter Poppy Summers saves the Duke of Hawking from drowning, sparks quickly fly.This was a quick read with banter and a touch of adventure. While there are a couple of parts that seemed a tad unbelievable, Poppy and Keane were likable characters. It was easy to root for them to find their HEA against the odds. I look forward to the final book in the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "romancereadsandtea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCPFAOZH47HAKA75RXZIE3EBC5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35IE1V7B6XC5J?ASIN=B09XL7G8XR",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "3.0 out of 5 stars A beautiful story with a happy ending",
                "reviewText": "One Duke Down follows the ladies of Bellehaven, a small beachy town where everyone knows everything that goes on. I absolutely LOVED the first book in this series, so this was one of my most anticipated books of this year. Keane and Poppy were the stars of this romance, and I loved them both so much. One thing I loved the most about Anna Bennett’s writing is that I always have so much fun when I read her. I loved the low angst romance, the beachy setting, and NO third act breakup!!This story started off with a bang. The first meeting between Poppy and Keane had me laughing out loud and the banter that these two convey with each other is outstanding. The murder aspect that is laced within this plot was surprising, but I found myself immersed in the mystery of it all.I found the middle/end of the book to drag a bit. I felt like nothing was happening and the plot was at a standstill. However, the characters made up for the lack of plot in the middle. I loved the sweet and adorable romance that the two had and never felt a dull moment between the two! I can’t wait to revisit this town with the next book!I received this as an ARC from the publisher via NetGalley.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ja Fisher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFL3B5IRHXME3YOFMIHCOQPHBE7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QQ6KIFZZ5MKW?ASIN=B09XL7G8XR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2023",
                "reviewTitle": "5.0 out of 5 stars A Pleasant and Delightful Romance",
                "reviewText": "This was my first Anna Bennett romance. Andrew Keane, Duke of Hawking, washes up on Poppy Summer's beach where she is fishing. He was knocked unconscious and dumped in the bay. She is vexed that he has ruined her day's catch and doesn't believe his claim to be a duke on holiday from a scandal in London involving a married Marquees.Poppy soon realizes that Keane is telling the truth about being a duke. And strikes a bargain to help him find the identity of the person who knocked him out in exchange for cash payment. Along the way they fall in love and realize that they are just right for each other. I adored Kean. He is a truly nice guy and wants to do the right thing. Poppy is lovely, smart, and resourceful. Reading about them falling in love was fun. I appreciated that the author gave them a fun romance and kept out excessively graphic love scenes. (Not a closed door but a few details are left to the reader's imagination.)I look forward to reading more from Anna Bennett.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Terri B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7BRMES2FSM66UMERHL7TD6XVGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQOUO60IFLYC7?ASIN=B09XL7G8XR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Enjoyable read",
                "reviewText": "A very enjoyable read with loveable characters. Recommend. Looking forward to the next book in the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}