{
    "remaining_requests": 2204,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beginning-Everything-Robyn-Schneider/dp/0062217143",
    "body": {
        "name": "The Beginning of Everything",
        "price": "$8.79 $6.59",
        "originalPrice": "$11.99",
        "rawPrice": 8.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beginning-Everything-Robyn-Schneider/dp/0062217143",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51pU6uMLvRL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51hyO1AkFkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Nqa-WI bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yW-e2aAcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41j43GH-nUL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Robyn Schneider",
            "link": "https://www.amazon.com/Robyn-Schneider/e/B001JS1D1C/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Jenson Books Inc and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4289,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for THE BEGINNING OF EVERYTHING: “Smart writing and a compelling narrator raise this book above ordinary depictions of high school drama. Efficient use of language, evocative descriptions and subtle turns of phrase make reading and rereading this novel a delight.” — Kirkus Reviews (starred review)“This thought-provoking novel about smart kids doing interesting things will resonate with the John Green contingent, as it is tinged with sadness, high jinks, wry humor, and philosophical pondering in equal measures.” — Booklist (starred review)“Schneider shows remarkable skill at getting inside her narrator’s head as his life swings between disaster and recovery.” — Publishers Weekly (starred review)“This is a wonderfully told story. The dialogue moves the plot along at a fast pace, and Ezra, with all his flaws, is a character to whom readers can relate. Teens won’t want to put this one down.” — School Library Journal“The Beginning of Everything is a tragic romance of the best kind that leaves the reader feeling as though they are part of the story, and wishing there was more.” — Voice of Youth Advocates (VOYA)“Dazzling. Full of razor-sharp wit, a keen sense of observation, and surprisingly tender compassion.” — Jeannette Walls, New York Times bestselling author of The Glass Castle: A Memoir and The Silver Star“Heartbreaking and hilarious. I have no doubt that girls everywhere are going to fall madly, deeply, hopelessly in love with Ezra Faulkner.” — Sarah Mlynowski, author of A Little Bit Broken“Smart, funny, heartbreaking, and so true it hurts…this is a book you will never forget.” — Lauren Barnoldt, author of Two-Way Street and Sometimes It Happens“Robyn Schneider can write.” — New York Times Book Review“It’s an endearing book filled with similarly touching little moments and plenty of snappy dialogue.” — New York Times Book Review From the Back Cover Ezra Faulkner was supposed to be homecoming king, but that was before—before his girlfriend cheated on him, before a car accident shattered his leg, and before he fell in love with new girl Cassidy Thorpe. About the Author Robyn Schneider is the bestselling author of The Beginning of Everything, Extraordinary Means, and Invisible Ghosts, which have earned numerous starred reviews, appeared on many state reading lists, and been published in over a dozen countries. She is a graduate of Columbia University, where she studied creative writing, and the University of Pennsylvania Perelman School of Medicine, where she earned a master of bioethics. She lives in Los Angeles, California, but also on the internet. You can find her at www.robynschneider.com. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 26 on orders shipped by Amazon over $35",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 19 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Robyn Schneider's The Beginning of Everything is a witty and heart-wrenching teen novel that will appeal to fans of books by John Green and Ned Vizzini, novels such as The Perks of Being a Wallflower, and classics like The Great Gatsby and The Catcher in the Rye.Varsity tennis captain Ezra Faulkner was supposed to be homecoming king, but that was before—before his girlfriend cheated on him, before a car accident shattered his leg, and before he fell in love with unpredictable new girl Cassidy Thorpe.As Kirkus said in a starred review, \"Schneider takes familiar stereotypes and infuses them with plenty of depth. Here are teens who could easily trade barbs and double entendres with the characters that fill John Green's novels.\"Funny, smart, and including everything from flash mobs to blanket forts to a poodle who just might be the reincarnation of Jay Gatsby, The Beginning of Everything is a refreshing contemporary twist on the classic coming-of-age novel—a heart-wrenching story about how difficult it is to play the part that people expect, and how new beginnings can stem from abrupt and tragic endings. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Katherine Tegen Books; Reprint edition (July 29, 2014)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062217143"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062217141"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 - 17 years"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 930L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 8 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 0.79 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#137,363 in Books (See Top 100 in Books) #280 in Teen & Young Adult Coming of Age Fiction #336 in Teen & Young Adult Friendship Fiction #946 in Teen & Young Adult Contemporary Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,289 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Larry Hoffer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTWA5URATBOFF5JT75W32W4QO2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E9YTRKG2YFZL?ASIN=0062217143",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 17, 2013",
                "reviewTitle": "5.0 out of 5 stars If Robyn Schneider talks this way in real life, I want to be her friend. (Oh, and this book is pretty fantastic, too.)",
                "reviewText": "\"I still think that everyone's life, no matter how unremarkable, has a singular tragic encounter after which everything that really matters will happen. That moment is the catalyst--the first step in the equation. But knowing the first step will get you nowhere--it's what comes after that determines the result.\"So says Ezra Faulkner, the president of his high school's junior class and captain of the varsity tennis team. For Ezra, that tragic encounter is when his BMW is blindsided by a hit-and-run driver, leaving his leg shattered, his wrist injured, and ending any hopes of ever playing sports again. After spending the summer recovering from his injuries, he returns for his senior year of high school and everything is different--his girlfriend has found someone new, his friends have moved on without him, and he's not sure what life is like outside of the \"in crowd.\"But after reconnecting with his childhood best friend, and being suckered into joining the debate team, he meets Cassidy Thorpe, an intelligent, beautiful, mischievous, and mysterious transfer student who was a legendary debate competitor at a rival high school before she disappeared, only to return as a student at Ezra's high school. She forces Ezra to embrace his intelligence and realize he needs to work for his dreams instead of expecting everything to be handed to him as it always has been. And as the pair's friendship turns to romance, Ezra realizes that Cassidy is the type of girl he has been looking for all along. Until the relationship suddenly sours for reasons he can't understand.I absolutely loved everything about The Beginning of Everything. Robyn Schneider did such a terrific job creating and giving depth to her characters and creating a plot that draws you in instantaneously and hooks you completely. Schneider's dialogue is tremendously intelligent and witty without being overly precious--honestly, if she thinks this way in \"real life,\" I totally could see myself being friends with her. It truly is, as Kirkus said in its review of the book, \"Here are teens who could easily trade barbs and double entendres with the characters that fill John Green's novels.\"This is a book about trying to figure out where you belong, even though you've truly known it all along. It's about being pushed beyond your comfort zone, being forced to believe you're more than you've always thought you were, and how important it is to find friends you truly identify with rather than feel obligated to be with to uphold expectations. And more than that, this is a story about not letting your life be defined by the adversities you're dealing with.I've said quite often how impressed I've been over the last few years with the outstanding quality of YA fiction, particularly stories that aren't dystopian in nature and/or don't include vampires, werewolves, angels, or others with superpowers. (Not that there's anything wrong with those books.) While The Beginning of Everything may be classified as a YA novel, it's equally as good as--if not better--than some \"adult\" novels I've read recently. Besides, it's not every novel that makes me wish I could relive my high school days with the kind of awareness and self-confidence that the characters in this book do!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHL2I4FO55STLUQJZQNO6OZBXYKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDRDH1U9S7BQX?ASIN=0062217143",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 9, 2017",
                "reviewTitle": "4.0 out of 5 stars Abby Greskovic Book Review",
                "reviewText": "The Beginning of Everything Book Review AG “Sometimes I think that everyone has a tragedy waiting for them...That everyone's life, no matter how unremarkable, has a moment when it will become extraordinary…” (Schneider 1). The Beginning of Everything is a novel that explores a young boy’s life that has been completely turned upside down. Ezra is a teenager that has everything going for him. For instance, he is the star tennis player, a jock, and dating the popular girl Charlotte. His world is suddenly changed when he faces one tragedy that affects him physically and mentally. Ezra feels as though all humans are faced with a tragedy at least once in their lifetime. Ezra’s traumatic event will never bring him back to the boy he once was. Tennis is now over for him and his reputation of a jock has now transformed into a crippled young boy. However, one day he meets the new, mysterious girl named Cassidy. Cassidy had been the leader of her former private school’s debate team. Hence, she is intelligent, confident, and unpredictable. Ezra does not realize that even Cassidy, the girl who is always seeking an adventure, has a traumatic past that she keeps buried beneath the surface. The Beginning of Everything takes you into the relationship of Cassidy and Ezra and the hidden stories that will drive them apart, but will help one of them discover who they truly are.Robyn Schneider’s novel is heart-wrenching, suspenseful, and worth reading. It is a book that focuses on new beginnings and accepting the past. The Beginning of Everything shows the readers that an individual does not have to remain broken, but can overcome any obstacle thrown at him/her. The book portrays the message of individuals being judged on their outside presence. Humans tend to view each other by the image cultivated in their own mind. Ezra looks at Cassidy as an intelligent girl seeking thrill and adventure. In reality, Cassidy is someone who is alone and does not seek a committed relationship. She feels as though any person she likes will leave and for that she refuses to get close with people especially the ones she loves.My sole criticism for the book, which may be the dealbreaker for some audiences, is that the plot is predictable. Hence, it contains many average stereotypes that teenagers and people in young relationships are categorized as today. I felt myself knowing the base of what would happen in the upcoming chapters without even having to read more pages. It was typical for the boy to fall in love with the girl. However, without thinking about all the stereotypes, the book has taught me and others many lessons about life. The Beginning of Everything is a well written novel that I would recommend for readers of all ages, but especially teenagers. The story is not the ending everyone is hoping for, but it is the ending that is best for the characters. The ending is for the readers to decide for themselves if the love story ends in a tragedy or a wedding. “Life is the tragedy,' she said bitterly. 'You know how they categorize Shakespeare's plays, right? If it ends with a wedding, it's a comedy. And if it ends with a funeral, it's a tragedy. So we're all living tragedies, because we all end the same way... “(Schneider 296). This conclusion, just like the book as a whole, was a realistic look into the lives of many young Americans today facing hardships.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKWV45DVQ5D5MOEG3VYPGNFFUXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYOGMH5BNBMSY?ASIN=0062217143",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 27, 2014",
                "reviewTitle": "5.0 out of 5 stars Loved It!!!",
                "reviewText": "Almost everyone has experienced that moment in their life, when they stopped to take personal inventory and reflect on themselves. Ezra's moment came in the form of a car accident. He had been BMOC: dating one of the prettiest girls in the junior class, class president, varsity tennis, honors and AP classes, with a BMW. When leaving a party at the end of junior year, a black SUV rams into his roadster and never looks back. When Ezra returns to school in the fall, he is left with a sense of identity theft. He no longer understands who he is or where he fits in. This was the beginning to everything, which would shape his character and help guide him on his path to self-discovery.I loved this book. It is filled with so many colorful and interesting characters. Ezra, our poor struggling narrator, who is trying to move on with his life and deal with the loss of who he thought he was. Cassidy, the mysterious new girl, who ignites a flame in Ezra, encouraging him to function outside of other people's expectations. Toby, his estranged childhood friend, who understands that our real friends are the ones who are there for us at our lowest points.This book was honest, funny, sad, tragic. I felt all sorts of emotions. The book is filled with philosophical musings, literary discussions, mock debates and heart-to-heart discussions. I kept wanting to find out what was going to happen next and at the end, I wanted more.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "melanie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 20, 2021",
                "reviewTitle": "Daughter loves this book!",
                "reviewText": "Such a great read my daughter loves it. Thanks",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ronei De BortoliRonei De Bortoli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 30, 2020",
                "reviewTitle": "É um bom produto",
                "reviewText": "O produto é simples, a capa tem uma leve textura ao fundo e o material não é de alta qualidade, mas compensa pelo preço.O inglês é ótimo para quem está no nível intermediário ou avançado e gostaria de praticar mais. Foi uma ótima compra.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715fOC7i7uL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71XbAfgRjvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Solaris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 15, 2020",
                "reviewTitle": "Absolut lesenswert!",
                "reviewText": "Ich kann coming of age Geschichten eigentlich nicht besonders leiden, aber diese hat mich sehr berührt. Die Charaktere haben eine ungewöhnliche Tiefe und die Story entwickelt sich unvorhergesehen. Endlich eine Erzählung, die versteht und beschreibt, dass auch junge Menschen ein Schicksal haben - lesen!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs. Ann Goulding",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 19, 2019",
                "reviewTitle": "Ideal book for teenagers to read",
                "reviewText": "The book delivered to My grandaughter she liked to book nice quality well presented",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 13, 2018",
                "reviewTitle": "Five Stars",
                "reviewText": "worth for money",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.33",
                "sellerName": "We.Live.To.Read",
                "sellerRating": "4.5"
            },
            {
                "price": "$4.25",
                "sellerName": "Greg's",
                "sellerRating": "5"
            },
            {
                "price": "$8.79",
                "sellerName": "Buy AM",
                "sellerRating": "5"
            }
        ]
    }
}