{
    "remaining_requests": 2299,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Things-We-Hide-Light-Knockemout/dp/172827611X",
    "body": {
        "name": "Things We Hide from the Light (Knockemout Series, 2)",
        "price": "$11.66$11.66",
        "originalPrice": "",
        "rawPrice": 11.66,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Things-We-Hide-Light-Knockemout/dp/172827611X",
        "soldBy": {
            "sellerID": "A15F2R3V6T4F02",
            "name": "GoodyStoreBooks",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A15F2R3V6T4F02"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81yfJVV4LlL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lucy Score",
            "link": "https://www.amazon.com/Lucy-Score/e/B00G2DKSBU/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "GoodyStoreBooks",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 79637,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 32 mins",
            "$3.99 delivery February 27 - March 1.",
            "Or fastest delivery February 23 - 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (February 21, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 592 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 172827611X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728276113"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.14 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 1.48 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#217 in Books (See Top 100 in Books) #11 in Small Town & Rural Fiction (Books) #71 in Romantic Comedy (Books) #255 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 79,637 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Explore more from Lucy Score!",
                "media_link": []
            },
            {
                "media_text": "Things We Never Got Over Things We Hide from the Light Things We Left Behind By a Thread Forever Never Rock Bottom Girl",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7d98d8e-e762-4039-ae34-2100e10f62c7.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a7c8bfb4-ff59-4222-81f0-fc8e524974f0.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/44407050-e88c-4231-bbf2-168ac8889f8f.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e443b76-abce-4a88-8885-720fb5660df8.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aeb5dbfd-5a29-40a2-8ef4-9368b843eee8.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b096a56-09f9-43d1-9703-5c33233c2ee9.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97b71e3f-59f5-4fea-b297-04ec478925a5.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3de28bd4-b351-4a06-b7f5-40f8f0a0ce7e.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5a05e2a4-180c-4e33-957b-97e38f6f69b7.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "megan.reads.romance",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7JM4QLJOW3TSMFO3BJ3TILJH3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15K4ZK0XPMRWJ?ASIN=172827611X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Nash, the man with a heart of gold + a possessive streak a mile-wide... couldn't put it down!",
                "reviewText": "This was one of my highly anticipated releases in 2023, and I was not disappointed!We head back to Knockemout for book 2, featuring Knox’s college girlfriend Lina and his brother, Nash. And let me just say, I did NOT expect to love this book as much as I did, and I did not expect to fall in love with Nash the way that I did, and I did not expect to love Knockemout more than I already did. So needless to say, this book was everything I needed it to be and more, and I can’t wait to return to Knockemout later this year for book 3!This book opens just weeks after the end of Things We Never Got Over, where Nash is still trying to heal from his wounds… and Lina is still in town “visiting” her friend Knox while working “in insurance.” I love how Lucy Score weaves romance, drama, and quite a few twists throughout this series, while also bringing in some lighthearted humor.“Baby’s breath is stupid. Fight me.”“Until I got here and met Nashhole.”“What’s happening? Did the fat blob just punch Nash? Who are the other two blobs?”Like I mentioned, I ended up loving Nash and Lina, and I loved them together. Nash is having a hard time recovering from his gunshot wounds, being the natural protector that he is. He wants to keep everyone safe, and he’s doubting himself because he couldn’t even keep himself safe. He wears the weight of the world on his shoulders and wants to do the right thing for everyone, but especially for his family and his community.Lina is fighting her own demons. Her own trauma erected walls around her life so that she remained firmly in control of things, but those walls ended up shutting out all the good relationships that could’ve blossomed, leaving Lina feeling lonely while clinging to her independence. It’s a struggle for her to let go of her control to let anyone in, let anyone touch her (both physically and emotionally), which becomes impossible when she moves next door to Nash.“I live alone and I like it. I hate sharing the remote. I like not having to consult with someone else before ordering dinner. I don’t want to have to move the seat of my car every time I drive. The idea of passing my decisions through an ‘us’ filter leaves me feeling vaguely nauseated. I love my parents but their constant need to check up on me drives me insane, and that problem could become yours if this goes anywhere. I like to splurge on clothes and shoes, and I’m unwilling to justify that. I get up early and I work a lot. I don’t want to have to change that to accommodate someone else.”Nash waited a beat. “Okay then. The only TV I watch is the occasional football game. The remote can be yours the rest of the time. I don’t mind cooking, but if you tell me you want takeout burgers, I’ll get you takeout burgers. I promise to always move your seat back to the original position after I drive. I wouldn’t mind having some nosy parents worry about me for a change. I like the way you dress just fine so I’ve got no problems with your shopping habits. Long as you let me spoil you once in awhile. As for the schedule thing, I think you’re just reachin’ because, Angel, I’m a cop. Enough said. And when it comes to making decisions together, I need a say in your personal safety. I expect you to want a say in mine. Any decisions that affect us together, we make together.”Nash won’t take no from Lina, but he’s the MOST respectful he can be about it (swoony for sure). I love how Nash wants to have the conversations and be on the same page so that there is no misunderstanding regarding their relationship. While he does do some of the dumb stuff men do, like push her away when he thinks he’s becoming dependent on their relationship, these two match each other step for step along the way.“For the record, this is you pushing me away and this is me sticking.”I love that they both found what they needed, and they both pushed back. The tension between them screamed off the page, and I love that even their physical relationship came secondary to that tension, the push-and-pull. While their physical relationship was SO GOOD, it was everything else that made me love this book!“Listen to me, baby. You freak out all you want. I’ll still be here when you’re done.”It would be a disservice not to mention the town of Knockemout and the secondary characters in this story. One of my other favorite things about Lucy is that she creates a WORLD for each of her books, and that world just feels so full of love and hope and gratitude and friendship that you can’t help but want the same thing in your own life. That’s true within the pages of Things We Hide From the Light as well. The Knockemout PD (and how Piper wandered around the bullpen to get treats) and the U.S. Marshal inserting himself into the community and how residents show up for businesses like the cafe and Honky Tonk and the gym and the library and everyone who showed up to the school for career day and the various community events like the library… it truly adds up to something special that makes you just love these people even more. Not to mention that ALL THE LOVE is on display in these pages… makes the world seem like a more hopeful place than it can be IRL, and I’m not complaining at all.“Friends make friends better.”Rating: 5 big, fat, heart-eyed stars from me",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NCR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTKQ63UUQ27G6DVST6BTFVQTQCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H4LVSRBOEKJ8?ASIN=172827611X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 8, 2023",
                "reviewTitle": "4.0 out of 5 stars WOWWWWWWWW SHE DID IT AGAIN",
                "reviewText": "Okay so I read the first book and I had a pretty passionate review about it. My main qualm was these are adult characters acting like children (handling relationships and emotional drama very poorly). Well a year later I decided to read the second book because I was actually honestly curious how Nash and Lina would get together. I think a couple things that made this book better for me:1. Lucy Score's writing is really drawn out. The first time I read her book \"Things We Never Got Over\" (the first Knockemout one), I was very annoyed I spent 500+ pages reading a book that could have been 300 pages. HOWEVER this time I knew her book would be long b/c shes very into character development and I just know her writing style is long. I think that helped me actually enjoy and appreciate the development here. The reality is I want to be in this town. The people seem so great and I care about these characters. I love this friend group. AND THAT is the beauty of these long books. YOU JUST STAY AND CARE. It's like relationships where being there for the daily moments helps you get to know the person. I got to really know these people. So why is this important?2. Lucy tackles complex relationship trauma and allows room for us to watch the characters actually heal. The thing is these characters are not like secure or healthy LOL. These are traumatized (and physically attractive) grown adults like all 30+ plus (I'm pretty sure everyone is in their 30s and maybe Knox is even in his 40s??). They all have relationship trauma (parents who left them, alcoholism, toxic siblings who are criminals, medical problems, near-death experiences, etc, etc). I think Lucians family has some even crazier stuff cause that man is dark. but alas more on Lucian when we read book 3. ANYWAYS, the point is these characters are not going to just quickly fall in love in a 200-300 page book. They are too afraid, too self-sabatgoing, and frankly all insecure attachment styles (the main adults in the book). BUT GUESS WHAT? If we stay with them long enough, watch them fight their battles which we do...its actually more BELIEVABLE how they end up being strong enough to conquer their fears and choose love. and choosing love when its hurt you its SUPER FREAKING BRAVE. THESE ARE SOME BRAVE CHARACTERS HERE. I MEAN VERY BRAVE. Love can be scary when you've got a lot of baggage...these people end up figuring it out.Thoughts on the book:3. Okay so Nash and Lina are the love story. I mean its interesting like Nash was so grumpy in this book for the middle of it?! I was like is this Nash or Knox? But sometimes Nash was written and it was a little tooooo similar to Knox. Like they even encouraged it by saying \"he's so broody\" right now. Nash was supposed to be like the sweet guy, and I guess he still is. But like he's also very much like his brother. I guess that's also life though. Lina is a bad-a$$. Very different than Namoi, I mean Lina's got that spunk. But many bad-a$$ woman do get scared when it comes to love...so it was funny seeing Lina be so like shy and nervous LOL. Lina is probably an avoidant attachment, and Nash is like a fearful-avoidant/disorganized style (Nash has got a LOTTTTTT of trust and betrayal wounds...my goodness). I think their relationship is very much like respect/best friends/teasing each other in a way that felt fun to read. I liked them. Maybe they were like a little more boring tbh than the previous book. And the spicy scenes took a long time to happen and it was like cute, but nothing like super crazy. These two really felt like best friends idk. Like it was cool to watch them work together and be a team. I felt like they were a bit more of equals. More mutual respect (Very different than how I felt with Knox and Naomi). Also yes kind of strange Lina and Nash got together so fast and allegedly didn't know each other?! How does Nash not know his brother's best friend/former partner? Not super clear. Also the relationship is basically like guy sees hot girl when he's lonely and depressed, really wants to do the deed with her, she pushes him away causes he's depressed, but then actually they hang out and fall in love and then sex comes in. So I actually kind of liked that too. A different kind of progression. Score made us wait. I like when guys have to wait, they get all passionate and patient. And sex is more like the cherry on top. Okay! So yeah maybe this was a good couple. I think I support!Anyways...would I recommend this book? Yes but know that this book is kinda long-winded. And only read it if you've read the first book in the series b/c what Lucy does well is character development so its definitely good to know the characters from before as well.AND THE EPILOGUES OMG!! I actually felt so happy when I finished those two epilogues. The epilogues might be the best chapters in the book. But part of why it's so good is because you've got to know the characters for long in the previous pages. Alright...off to the next book :)",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bookworm.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEND65Z5APD6QBBJGKSZOJD6XLJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFK2NUJPD9X4S?ASIN=172827611X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Lots lots of emotional and actions.. And hot romance👌😍😍😍🥰🥰🥰🔥🔥🔥",
                "reviewText": "Well this one doesn't make cry.. 😉... Knox and Naomi story make me cry while reading it. This book make me want to smack Nash behind his head.. But when you are surrounded with lots of insecurity all your life. I love Lina.. She's strong and beautiful and smart. Nash and Lina been through a lot in the short time they met. The way LS wrote the story how their live intertwine each other is so totally sweet and emotional. Anxiety is a hard thing to overcome. There's lot of lol moments.. Some actions and lots of family moments and don't forget the steamy smexy moments.. They are 🔥🔥🔥🔥. The bad guys are not who I expected. Love these series. Going for the 3rd one..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "leonora",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 1, 2023",
                "reviewTitle": "Muy bueno 😊",
                "reviewText": "Me encanta",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Power Librarian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 21, 2023",
                "reviewTitle": "A romance with suspense, comedy, and deeper themes",
                "reviewText": "This book is just as incredible as the first in the series! It’s a delightful combination of romance, suspense, comedy, with some deeper themes thrown into the mix. This book follows the events from the first book, which features Knox and Naomi, but you don’t have to have read that book to enjoy or be able to follow this one.Lucy Score is one of the handful of authors that have actually made me laugh out loud. There’s situational humour as well as witty dialogue that elevates this book from a five star read to a five +++ star read.The book itself is a slow burn romance. Lina is an insurance investigator, and she’s in town searching for a 1948 Porsche that was stolen by the man who shot Nash at the end of the first book. Nash is the small-town sheriff who has demons of his own. Ever since his shooting, he’s been suffering from depression, and he’s unable to pull himself out of the darkness. Lina isn’t without her own past traumas, and the author somehow manages to perfectly balance their leaning on each other for support in a way that’s not at all toxic or detrimental to their long-term mental health.This book also has fantastic side characters, turning this book into a well-rounded, must-read for fans of romances and comedies with substance.5+++ stars!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 28, 2023",
                "reviewTitle": "If the first one was amazing, book 2 is just mind-blowing",
                "reviewText": "Things we hide from the light is perfect! It has all the electricity of a couple that deny they’re in love but can’t keep their hands from each other, way more adventure and mistery than in the first book, not to mention that Nash and Lina are a way better couple then Knock and Naomi as well. Nash has all of my heart (where can I find one?) It is a perfect reading for hot romance suckers, can’t wait for the next book!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 7, 2024",
                "reviewTitle": "Perfect",
                "reviewText": "En très bon état",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CharliiCharlii",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 30, 2024",
                "reviewTitle": "Hooked, routed and spicy",
                "reviewText": "I couldn’t wait to read this one I couldn’t get enough of ‘Things we never get over’. The first in the Knockemout series so now on to the second.So this one focuses on Lina & Nash, let me tell you this book doesn’t disappoint. All the other characters and story line do carry on so don’t worry about that. Life in a small town it seems is never dull and also everyone is family, family sicks together and now we get to see how all the characters stories continue and are interwoven beautifully.Again this small town spicy laugh out loud book is a real page turner. I love how Lucy Score writes from both main characters points of view. It’s catchy, it’s sad but overall it has you routing for the romance, with some steamy scenes that have you hooked.I can’t wait to read the final on in this series.I have throughly enjoyed reading this book and highly recommend the series so far.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Whe64Uh0L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.66",
                "sellerName": "Husband's Leftovers",
                "sellerRating": "5"
            }
        ]
    }
}