{
    "remaining_requests": 2062,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Same-Time-Next-Year-Novella/dp/B0CMJRPR4H",
    "body": {
        "name": "Same Time Next Year: A Novella",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Same-Time-Next-Year-Novella/dp/B0CMJRPR4H",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51xnK9bzBGL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Tessa Bailey",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Tessa+Bailey"
        },
        "brand": "Tessa Bailey",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 23414,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From New York Times bestselling author Tessa Bailey comes a steamy novella full of hope and humor tracking a couple’s fake marriage for a year after the wild New Year’s Eve when they first say “I do.”Adored by all, Britta is an ambitious waitress working at Sluggers. The popular bar holds a special place in her heart and is a regular hangout for the Bridgeport Bandits, the local hockey club. With a half brother on the team, Britta has a strict no-dating policy for hockey boys. But she does have a soft spot for one particular player.A beast on the ice, Sumner Mayfield is on the brink of breaking into the NHL. But time’s running out. With his work visa about to expire, Sumner’s only chance to stay in Bridgeport is to marry an American—and get a green card. Otherwise, it’s back to Canada for the defenseman.On New Year’s Eve, the team begs Britta to marry Sumner that very night. Sum is embarrassed yet hopeful—he’s desperately in love. But Britta balks at first. Until something about Sumner’s soulful brown eyes and ripped physique makes her reconsider… Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Holidays",
                "link": "https://www.amazon.com/Holiday-Fiction/b?ie=UTF8&node=9059882011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "4 hours and 14 minutes"
            },
            {
                "name": "Author",
                "value": "Tessa Bailey"
            },
            {
                "name": "Narrator",
                "value": "William LeRoy, Carmen Vine"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "December 01, 2023"
            },
            {
                "name": "Publisher",
                "value": "Amazon Original Stories"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0CMJRPR4H"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,334 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #4 in Holiday Fiction (Audible Books & Originals) #51 in Holiday Fiction (Books) #109 in Holiday Romance (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLOCEP2ZMCAFSMLOJQMT65TXK6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EZ6BI8IKXCMI?ASIN=B0CMJRPR4H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars What A Way To Bring In The New Year!",
                "reviewText": "Same Time Next Year, a New Year’s Eve Novella-My rating is 5 stars.Who would have thought that a short, little novella would evoke tears AND a five star rating out of me??! Surely, not I. Novella’s typically are quick reads that are too short to really leave much of an impact. That’s just not the case with this story…This was a short, very quick but intense read, for me. It was plot driven and paced adequately, for a novella. Tessa was able to write this story to evolve over a one year timeline and it hit the points that it needed to, to drive the story.Britta and Sumner come together through a marriage of convenience. To avoid returning to Canada, Britta marries Sumner so that he can continue to play hockey in the United States, something he needs to do to make his goal and dreams of playing in the NHL. They’ve always been friends and they come to a business arrangement, an expirationship and they marry on New Year’s Eve.Britta was a great FMC. She was fiercely independent and loved by everyone that knew her. She didn’t put up with anyone’s crap yet was still able to relate to people in a way that isn’t easily achieved. She had been hurt badly by her father, as a young girl and it made her incredibly tough but also terrified of relationships and commitment. She didn’t believe that everyone got a love story. She wasn’t willing to take a chance on anyone because she believed that everyone will eventually leave, nothing lasts forever.I absolutely fell in love with Sumner. Tessa Bailey wrote him to be the most perfect husband possible. He was so incredibly loyal to Britta and committed to breaking down her sky-high walls that she’s hidden behind for her entire life. He understood her aversion to commitment so well that he was able to reel himself in (for the most part,) and give her the time she needed to figure out that he would only ever need her, that he would always choose her.There were moments with Sumner that brought tears to my eyes:“Can you not see that I’m starving to death for you? Can’t you tell that I missed you so horribly that my family couldn’t even make me smile?”“Sumner, what did you do? He has the never to look proud of himself. Made you off limits, Britta. It’s a rule that is rarely invoked among the group. But once it’s done, it’s ******* done. He leans over until our foreheads are a breath apart. If you don’t like it, then stop being my dream girl.”“You don’t have to stop me from looking at anyone but you, because I don’t want to look in the first place. Put parental controls on my phone, my laptop, block porn sites. Track my location. Lock my dick in a cage. I’ll do whatever it takes to make you realize I’m not going anywhere. I’m staying right here. I’ll make you feel secure until you realize it’s only ever going to be you.”I mean, who wouldn’t want to have someone feel like this about them?!Sumner and Britta had so much chemistry, it was fiery, passionate and they had a difficult time controlling themselves around each other. They had some incredibly tender moments together but, the spice was definitely spicin’!There weren’t a ton of support characters in this short read but I really loved the dynamic and relationship between Britta and her half-brother Bryce. That “Come to Jesus” talk that he had with her was pretty powerful.I loved how Britta stood up and faced her fears, at the end. She put her big girl pants on and realized that living without Sumner just wasn’t an option and, I was so proud of her. Sumner got what he wanted all along and Britta gets to experience a mad, passionate, soul engulfing love with him. A perfect HEA.I think it’s safe to say that I really loved this novella. I wasn’t expecting much from this book and I certainly wasn’t expecting to have it hit me so hard in the feels. If you’re looking for a powerful novella, this is the book for you.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sherrejon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHORG455LCH6ALAQLB2YVEE77S7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QWG9W0II66S4?ASIN=B0CMJRPR4H",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "4.0 out of 5 stars Ufffff. The obsession Sumner feels though 😮‍💨",
                "reviewText": "I’m aware; I know, and I admit I had to suspend belief a lot 🤣. But you know what? Celibate heroes are my KRYPTONITE 😭 so I’m gonna mark this as a win for me 🤣.Sumner’s (27) Canadian and is going to get deported back unless he finds a way to stay in the states and potentially play for the NHL (I know. I was side eyeing this one too 🤣). Enter his obsession, Britta 👀.Britta’s (26) half-brother plays with Sumner and needs her to do the team a solid- marry Sumner until he can get a green card/get scouted. Britta doesn’t believe in marriage; her father was a cheater and basically had a whole other family (hence the half-brother) so she doesn’t trust easily.But she’s never met someone as FAITHFUL and OBSESSED as Sumner 👀And he’s gonna gets her to trust him…AFTER they get married 😉What I liked/loved: possible spoilers—JK? Is this you? 👀😅😭 (see last bullet down below). I swear, this gave me JK vibes 😭 even with the 🔥 talk and the smacking of lots of things. And the ❤️ declaration? Come on 👀—how OBSESSED Sumner is with Britta 🥰. This man is one of the most obsessed heroes I’ve ever read 👀. Women LITERALLY DO NOT EXIST for him… only Britta 🥰 like 😭🥹🫶 SWOOOOOON!—he shares his location with her 😭. Gahhhh 🥹 tell me you’re a faithful man without telling me you’re a faithful man 😭👏🏻👏🏻👏🏻—he 👏🏻 falls 👏🏻 first 👏🏻—diiiiiirty diiiiiirty mouth 🥵—the 🔥. This man’s only crime is that he’s about to bust too early just being in the same room as Britta 🤣 but daaaaayum, he makes it up with enthusiasm and intensity 😅😮‍💨—she comes first 👀. LITERALLY 🥵💦 each and every time 🔥. I love me a selfless man 💅 (he’s especially into her b00bs too 👀)—how big he is to her small-ness 👀. I always love a good throw over the shoulder scene 😮‍💨—9 in 😉—how JP he is 👀. Bahahahaha men sure feel threatened by him 🤣—how jealous she gets 😅. But I love that he gets upset she even thinks about being jealous. Because she has no reason to be 🫶—meeting his family 🥰—the epilogue 🥹🫶What I wanted more of/was baffled by: spoilers—length (of the book)—he got a meeting within months with immigration? 😅 I was just talking about this with a student about how her mom’s been waiting for years 😬, so… I had to suspend my belief her—the whole NHL/Canada aspect 😅—the immigration officer sees them grinding outside the office and he’s like “You can relax… I know the real deal when I see it.”” 🤣🤣🤣 bahahaha come on 💀. I couldn’t help but giggle and roll my eyes at this—he… um… self-soothes to a wedding 🤣😅 his wedding to Britta… this gave me JK vibes!!!! Okay, so maybe I don’t hate this anymore 🤣 I’m gonna add this to my likes now 🤣Overall, I loved this 🥰",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karley Sloma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETRRNMM3GJELPDIJIWKYX2MIO5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4GUYHX13TONH?ASIN=B0CMJRPR4H",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2023",
                "reviewTitle": "3.0 out of 5 stars Fake Marriage. Forced Proximity. He Falls First",
                "reviewText": "“If it makes you feel better, I’ll even pretend we’re just friends while I’m nine deep, ringing your bell.”Same Time Next YearAuthor: Tessa BaileyRating: ⭐️⭐️⭐️Spice: 🌶️🌶️🌶️Britta finds herself in a difficult spot when her brother’s teammate is in need of a green card to stay in the States and play hockey. The team has made a last-ditch effort to keep Sumner on the team by recruiting Britta to marry him, there are only a few problems with their plan…it’s illegal but Britta also has a strong aversion to marriage. Her parent's relationship growing up has left her less than enthused about the idea but she finds herself feeling pressured into agreeing. She knows that Sumner has always had a thing for her but she is determined to keep things strictly platonic. We will see how long that lasts…This story was adorable and had me laughing from the very start, Britta’s aversion to love and relationships paired with Sumner’s desire to treat a woman right makes for some pretty commercial moments between the two when you add in their quick wit. As a fast read, I feel we lost some of the story with the time gaps but we still get a good amount of relationship and personal development with the characters. Overall, if you are looking for a lighthearted, quick read with a sprinkle of spice, this is the book for you!If you like:Fake MarriageForced ProximityHe Falls FirstReviewed by: Karley🧡This review was written by members of the Sporty Spice Book Club (sporty.spice.book.club on both Instagram and TikTok).",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurie ‘The Baking Bookworm’",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 9, 2023",
                "reviewTitle": "A fun, sweet with heat RomCom with a dollop of Canuck for good measure",
                "reviewText": "This was a quick, Prime freebie that I snapped up! I'm the one Canadian who isn't a hockey fan, but I am a fan of sweet with heat RomComs, especially those with handsome Canadian leading men. Those romance elements melt the cheese curds on this Canadian's poutine!This novella centres around a Canadian hockey player who enters a marriage of convenience so he can stay in the US and play hockey professionally. Readers get first-person POVs from both Britta, the bartender and Sumner, the hockey player. Sumner has been obsessed with Britta since the day they met, but Britta isn't quite so smitten and continues to push away the hockey player for her own reasons.I loved Sumner (despite his snooty butler's name) for his emotional intelligence and his awesome Canadian family (who I wish had been given more page time). He's a swoony cinnamon roll character, but I could have done with less of his cringy dirty talk between the sheets and less desperation for Britta to lurrve him. And while this Canuck loved the Canadian rep, I think Bailey should have leaned into it a lot more.Same Time Next Year is a balance of sweet romance with spicy scenes and although readers will have to suspend disbelief about the immigration process, this was a quick and enjoyable novella with a couple I easily rooted for.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "UM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 3, 2024",
                "reviewTitle": "Amazing",
                "reviewText": "I liked it too much, Such a outstanding book.A good read for youngsters .Same time next year: A novella",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 14, 2024",
                "reviewTitle": "Quick, addictive read",
                "reviewText": "Adorable. Spicy. Wish it had been a full length novel! Britta marries her brother’s hockey teammate who needs a green card. It is purely meant to be a marriage of convenience, but it doesn’t stay that way.Sumner was an adorable book boyfriend, and enjoyed his wholesome family vibe. Britta’s character development was also pretty heartwarming.What to expect:- novella- marriage of convenience- he falls first- very spicy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Komal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 8, 2023",
                "reviewTitle": "Tessa bailey can write a great Story in less than 150 pages",
                "reviewText": "I wish Tessa's book are all in kindle unlimited but it's okay .This story is sweet and short but still it has all the elements to make a great story in itself.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IV",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 11, 2024",
                "reviewTitle": "a fun love story",
                "reviewText": "I read this as part of a romance readathon. It was a quick and fun read. Characters are loveable and pacing is excellent",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}