{
    "remaining_requests": 2120,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Prayer-Box-Carolina-Heirlooms-Novel/dp/1414386885",
    "body": {
        "name": "The Prayer Box (A Carolina Heirlooms Novel)",
        "price": "$9.99$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Prayer-Box-Carolina-Heirlooms-Novel/dp/1414386885",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/815I8K+-rVL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lisa Wingate",
            "link": "https://www.amazon.com/Lisa-Wingate/e/B001HCX5WK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 11358,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 13 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 17 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Tyndale House Publishers (February 5, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1414386885"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1414386881"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.4 x 1.1 x 8.1 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,859 in Books (See Top 100 in Books) #36 in Biographical Historical Fiction #251 in Mothers & Children Fiction #4,218 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 11,358 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/80c07ea0-847f-41bb-a1a4-3c8faf57796d.__CR0,24,1811,560_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/929c9b57-5b63-4f8f-9d64-4319e629b475.__CR17,37,410,821_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9bf7a0e2-be54-4d60-b40c-5c0dc1686d4d.__CR24,41,410,821_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/10a8af42-d882-4bf7-83f3-fdc495595e5e.__CR24,41,410,821_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/53d4e9f5-2b3f-4180-8acb-34cfeff8bb19.__CR24,41,410,821_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5cb88a0c-5b75-4b75-b73a-91be0b4b63cc.__CR0,0,450,900_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Patty Olson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSY5WQQFUKJDNRIGYRAL6KAGNNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IFF5U6JPT1GM?ASIN=1414386885",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful Read!",
                "reviewText": "This is a wonderful book! It has inspired me to start writing my own letters to God! What a great way to have a daily connection.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jodie Wilbanks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCUXZHLYU5Q7UWVTTXTVLIX6GLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KCVY3OEQPPIB?ASIN=1414386885",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Best Book Ever!!!",
                "reviewText": "This is, by far, one of the best books I have ever read! I could not put it down, I was drawn in by every page!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sara B. Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE63C4VLHAN4CUJTVV5TFUUE7SZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SGKQFEFVU5UW?ASIN=1414386885",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "4.0 out of 5 stars sweet book",
                "reviewText": "The story started for me a little slow. A woman relocated to a bungalow and is running for something. The owner of the big house and bungalow dies almost immediately, and who she is is revealed slowly through out the rest of the book. It is worth the read and a christian novel. I will say some of the characters or story lines are not tied up with a bow at a end so that is somewhat annoying.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blue Jeans And Teacups 👖☕",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJFRVXBQ7GHJDQKJWMYIEII3WJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11ZFIJ60180MO?ASIN=1414386885",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2014",
                "reviewTitle": "5.0 out of 5 stars •°o•:*:•.Beautiful & Moving as Past meets Future.•:*:• o°•",
                "reviewText": "The Prayer Box – Prayer Box Series #1Lisa WingateI downloaded this eBook when my favorite author, Jen Turano, posted about it on her FB page. I tucked it away to be read later, and later finally came this weekend. I finished the book in tears (Oh, the Mulberry Girl!) and can’t wait to read the novella, The Tidewater Sisters – Postlude to the Prayer Box.I generally read Christian Historical Fiction, but this was a free download, Jen recommended it, and there was a great video from the author under the paperback version posted on C B D. So I gave it try. I am so glad I did.The book really took off around Ch. 4 when we begin learning about the elderly Iola Anne Poole and her letters. I had never heard of prayer boxes before this. They are a place to tuck your prayers into, and let your cares go. This book so beautifully describes them, and although Iola is fictional, she is someone I wish I could know. I have tried journaling before, and tend to do it most when I am going through great turmoil, and then stop when things are good. I would hate for someone to just read those someday and think my whole life was turmoil. Maybe a prayer box would be good for me.Tandi is a broken young woman with two kids, who finally had the strength to leave a controlling marriage. She has returned to her childhood hometown where her grandparents occasionally were able to bestow love to her and her sister Gina. She hopes to lay low and start fresh. Little does she know that small town people tend to notice, and this small town intends to help her. She is renting a cottage from the elderly Iola Anne Poole, who lives in a historic Victorian home next door.She has a new boyfriend, Ross who seems to care about her. I prefer not to include spoilers about him. Her 9 year-old son, J.T., seems to making an impression on the locals and his teacher, Paul Chastain has taken a real liking to him and his helping grow his interest in science. Paul wears outrageous Hawaiian shirts, proving once again you cannot judge a book by its cover. Tandi’s 14 year-old daughter Zoey has fallen in with the wrong crowd, and it will take some time and the love of the community to help her out of it.Iola also had a difficult life. I believe she was born in the 1920s. Her father was white and her mother was a black servant. Sometime after her father died, the patriarch of the home she lived in, Mr. Benoit had married a woman who did not approve of her and insisted she be sent away to a missionary school. She prayed and prayed to be returned home. God molded this young girl into someone so beautiful who would have such a passion for His people around her, and even far from her. It was amazing. She never sought recognition, but quietly served. So quietly that the people of her community made up lies about her which spread all throughout the town so much that many people believed them. That part was sad.There is a delightful reference to banana beignets. Unfortunately the author did not include the recipe, but I did my own internet search and look forward to trying them. I found one on Taste of Home magazine, from a lady in VA, which would be close enough to the region of the story set in Hatteras, NC and The Outer Banks. If it does not get deleted, I am including the link here: W w w tasteofhome dot com /recipes/banana-beignet-bites/printThere is also an ugly black cat in the book who adds great fun to the story. In this book he has no name. Maybe in the next one?Sandy is the owner of Sandy’s Seashell Shop. She is included in the book at the request of the author’s own Aunt Sandy who offered up much input about what her shop should look like. The character is spunky and kind, generous and protective. I definitely enjoyed her and would love to go sit, have a cup of tea, and gab in her shop with the Shell Shop Sisters. I believe her story starts in the novella, The Seaglass Sisters, prelude to The Prayer Box.The only thing that did not add to the story for me was the overabundance of ocean themed metaphors, that were sometimes so over-the-top I had to re-read them trying to understand them. But, maybe that’s just me.I recommend this book, but have your tissues ready!4.5 out of 5 starsAlso included: Discussion Questions for Reading Groups© 2013 Tyndale House385 PagesI downloaded this eBook from Amazon for free and offer my honest opinion for no compensation.Read: 8/8,9&10/2014Reviewed: 8/10/2014",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGACZH3OCV5OPBG5YS7A3KTEZVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YG4FZTQCPVKQ?ASIN=1414386885",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice story",
                "reviewText": "very nice book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trey Hawkins/Elizabeth Hawkins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5LKSC2YK6OAGBW4IFZI3LDIH6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQI0HJC62WGEV?ASIN=1414386885",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars A great idea to start",
                "reviewText": "This story was an emotional read for me personally. I have passed the book on to another Christian woman I know who will also benefit from the story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathi Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVMCTKHIEDPG7JW3XAMIGWVRHLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R368XKMF9KV9WS?ASIN=1414386885",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2014",
                "reviewTitle": "5.0 out of 5 stars A Book that fills me up...",
                "reviewText": "...with warmth, light, hope, and a promise. Lisa Wingate has moved to first place in the category of favorite authors. She has such a way with words, God gave her the gift to write, to be an author and with this book she has made that gift mine. A gift given to anyone who reads The Prayer Box.I began reading this book last night not knowing how the story would draw me in, how the characters would become almost real, how Ms. Wingate would wrap me up with those letters, Iola's life. At 2:00am I wanted to write a recommendation for this book, to let you know how I felt at that moment...safe and loved and secure...the letters reminding me again what faith can do when that faith is in my Father.The descriptions of life on the island created a clear image of water, earth, village, and the people lucky enough to live there. But then we are shown that island life isn't what we see in our dreams. Those lucky enough to make a living on any island are not immune to the struggles and worries we face. That reality doesn't occur in my daydreams. This novel is written around the inevitable storms and hurricanes that anyone living on an island fears. The water damage or destruction of homes and businesses. Communication with the mainland cut off, no way to travel on or off the island because of damage to bridges. Loss of life.Yet we still build there, move there, daydream of making a life on an island understanding that hurricane can happen at any time. Every place has its dangers. Preparation, knowledge, and hard work along with islanders ready to help where and when needed will get you through every time. This book tells the tale of a woman who lived most of her life on the small island in a home that survived every storm, hurricane and flood waters Mother Nature sent their way. Tourists make up the majority of income for the businesses in the village but during the off season they can catch up on what happened to who, how everyone is doing, until everyone knows everything about each other, whether you want them to or not. But for Iola Anne, an old lady who stays in her home, the rare visitor being the UPS driver, delivery of groceries, or someone to mow the lawn.Assumptions made long ago with no effort made to verify, known but left I corrected by Iola led to Iola dying alone in the house. No one to notice her absence, no one to check on her but a newcomer to the island renting a small cottage located on Iola's property. We get to know the renter and her two children, the life she lived that she struggled to overcome. We get to know other villagers, their businesses and struggles to repair hurricane damages before the tourist season opens. But most of all we get to know Iola as a child, the life she lived because of who she was didn't define who she became. In her letters to her Father, letters stored in prayer boxes that give us glimpses of 80 years of her life.No one really knows who we are, they know only what we want them to see. We can't hide ourselves from everyone all the time...during times of stress and pressure our masks can crack giving a glimpse of our true selves to anyone looking beyond our surface. Iola's mask never slipped, successfully hiding her true self from the rest of the town. But in her case that mask hid goodness, kindness, and faith from a daughter for her Father. Faith and assurance that helped the islanders survive as well as many others who she happened to notice or hear about.I will end by saying this is a book full of highlighted pages, passages that I will be reading over many times because of how they make me feel. I never wanted the book to end because it meant the end of Iola's letters. Letters I didn't think much about when I started the book.If Lisa Wingate could publish a book that contained the rest of the letters (yes...all 80 years worth!) I would never want for anything again. This book satisfies me that much, fills all those empty places. I cannot recommend it enough.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dorothy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 17, 2020",
                "reviewTitle": "Awesome book!",
                "reviewText": "This is a great book! I picked it to read after reading Before We Were Yours, which I absolutely loved.This is the story of a reclusive woman's life as seen through her prayer letters, and how those prayers changed the life of a troubled and struggling young woman, against the backdrop of a small town on the Outer Banks.Having read these two books by Lisa Wingate, I'm now on a mission to read every one of her other books! She's a fantastic storyteller!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rossana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 24, 2014",
                "reviewTitle": "A nice story.",
                "reviewText": "It's nothing life changing but it was a good read and it was free so that was fine. It was written well and I would recommend it as a light read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fiona P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 9, 2014",
                "reviewTitle": "Beautiful story",
                "reviewText": "What a wonderful story, a young mother runs from her abusive husband with her stroppy teenage daughter and her young son, she doesn't know how she will support them and herself. She finds a welcome in the small town and is able to find work, she learns through the letters of an old lady who has recently died that she is loved and valued, and she gradually learns to make better choices for herself and her family.Yes this is a romance, but that takes a lesser role in the story which focusses instead on friendship, mutual support and the story of Iola who was an unseen influence for good in the town and indeed in Tandi's life. It is not at all a preachy book and I recommend it highly.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Murray",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 22, 2021",
                "reviewTitle": "Excellent read!",
                "reviewText": "I loved this book. Very well written, deeply thoughtful and some really good twists and turns. I so admire Iola and learned some wonderful life lessons. Highly recommended.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vicky Dedda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 15, 2017",
                "reviewTitle": "MY OWN PRAYER BOX",
                "reviewText": "I loved this book, and it has encouraged me to get my own prayer box. A beautiful book, showing issues many people face. Well worth reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}