{
    "remaining_requests": 2085,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Trapped-Beastly-Highlander-Medieval-Historical-ebook/dp/B0CNM45RT1",
    "body": {
        "name": "Trapped with the Beastly Highlander: A Medieval Historical Romance Novel (Highland Hellions Book Club 2)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Trapped-Beastly-Highlander-Medieval-Historical-ebook/dp/B0CNM45RT1",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81jXEkS7a-L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lydia Kendall",
            "link": "https://www.amazon.com/Lydia-Kendall/e/B07G4CV1FJ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 588,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“Ye will stay here until I allow ye to leave.”The masked Beastly Laird scares everyone away. Yet everyone expects Keith to find a bride in the next month. It seems impossible - until a lass stumbles right into his bedchambers.Pressured to marry an old Laird, Maisie longs for one last adventure: she sneaks into the castle of the Beastly Laird, planning to steal a rare book.But the Beast catches her. And in order to let her live, she must do what he asks; pretend to be his betrothed for exactly thirty days. After that, she must leave. No matter how much she yearns for the man under the mask...*Trapped with the Beastly Highlander is a steamy Scottish historical romance novel of 60,000 words (around 300 pages) written by Lydia Kendall and published by Cobalt Fairy.No cheating, no cliffhangers, lots of steam and a happy ending.Get this book for free with Kindle Unlimited!",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CNM45RT1"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Cobalt Fairy LLC (November 17, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 17, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3091 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 335 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,528 in Kindle Store (See Top 100 in Kindle Store) #7 in Medieval Historical Romance (Kindle Store) #8 in Medieval Historical Romance (Books) #13 in Scottish Historical Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 588 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/0146fa4c-3aef-4325-a22d-5dc6c4faf4fe.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/d1ff8422-fb0d-4d1b-8ebd-94cd6d3bce0d.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nanna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETDCBAJ5EPAB7VW22RM2QOXQWLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HS3NHPACNI4F?ASIN=B0CNM45RT1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Trapped or Not",
                "reviewText": "Hum, this is a very interesting book to read. It has a little of everything in this story. We have what is supposed to be an evil, beastly Laird most fear and a very spirited outspoken Lady that is an avid reader when most women were not. The Beast is Laird Keith O’Neil, who lost his parents in a fire and was badly burned trying to save them. He wears a mask to cover his scars. He is hides a soft nature under his mask. Lady Maisie Lennox whose mother is pushing her to marry a man old enough to be her father. She doesn’t want to wed period. But knows she will have too. She wants one last adventure before she must give up her life as she knows it. She wants to read a special book and is sure the Beastly Laird has it in his library. So, she plots and plans and sneaks into his castle to borrow it. Only once she has her book, is she caught by none other than the Laird himself. Oh, my these two are so much fun to watch. Both have secrets, longings, pride and together a lot of attraction. He is nothing like she thought, and he can’t believe a Lady would go to so much trouble for a Book! The make a deal for thirty days to which will help him, with his council and she gets a Library all her own.! There is so much going on in this story. Lots of under currents speak of a danger just out of reach. His council and grandmother are pushing him to marry. There is deceit, treason and evil hidden within the castle walls. Lots of twists and turns before all is solved. There is a lot of emotion, feeling, passion and trust in this story. The ending may surprise you. A truly enjoyable read from start to finish. I love when she tells him “Ye will not touch me”. So funny in the end. The title for this book is all wrong as neither of our couple is trapped. I received an ARC from the author and wish to thank her. This is my honest opinion and am freely giving it. Surely a story not to be missed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7YATEHKJDNKFL6TIEDNAOZ455A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O6MB25DPN5IO?ASIN=B0CNM45RT1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "4.0 out of 5 stars Thief in the Night",
                "reviewText": "Lydia Kendall is a great author! She has a gift of giving readers a depth into the minds and action of each character!In, \"Trapped With The Beastly Highlander\", you’ll read about a damaged laird, and a strong minded lady with dreams for adventure. And even temptation. There are rumors which breed fear, devastation, misplaced honor, perceived entitlement, pressure to please, and desperation for love, life and happiness.Maisie Lennox reads to drown out responsibilities. She lives vicariously through her books. Maisie dreams of excitement in her life before having to meet obligations for the clan.Laird Keith O’Neil, Beastly Laird of Castle MacDean is plagued with heartache, rejection, pity and faces deceit and treason. And his council is pressuring him, wanting to control his next steps for the greater good of the clan.This is a story of dreams, heartbreak, obligations, and yes, understanding. There are stressful yet memorable interactions between Maisie and Keith. There are even some laugh out loud moments!Great book!Enjoy! 🌻",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSMBXRVZIUQ4TE37RHBFMC4E63Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XRSGUUC9HTI8?ASIN=B0CNM45RT1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Humor, Excitement, Betrayal and Mystery",
                "reviewText": "Keith O Neil was called the Beastly Laird. He had a mask covering half of his face. Scary rumors swirled about him. He was being pressured by his clan and his grandmother to marry and he wanted no part of it. He was given an ultimatum to find a wife in one month. His grandmother had invited a prospective bride to be and her father to come to the castle.Maisie Lennox was an avid reader. She was being pressured to marry a man who was 15 years older who wanted to marry to secure a male heir. She felt trapped and wanted to have some adventure in her life before she had to marry. She was interested in reading one certain book that she did not have. She thought the neighboring Laird would have it, so she disguised herself as a servant to make herself look inconspicuous. She went in the middle of the night, made it to the library, but it was dark. However she successfully found the book and was making her way out of the castle when she was spotted by a guard who chased her until she successfully ducked into a room to evade him.Unfortunately, it was Beastly Laird's room and she woke him. He surprised her, put a knife to her throat, wanted to know who she was, why she was there, and kept asking questions. He did not believe her story, but did believe her name. He released her, then asked her to show him what she was hiding in her skirts. She decided to come clean and took the book out. He was amused that she would break into his castle and only take a book. That's where she picked up her new nickname, \"Book thief.\" It lasted throughout the whole book!He told her she could keep the book and she was amazed. Then he said she could read any of his books she wanted and she was excited. She would only have to do one thing in return.....marry him.She was shocked. Then he said if she stayed in the castle for one month and pretended she was betrothed to him, he would GIVE her his whole library! Her answer was, \"Can I see the library first?\" They went to the library, he lit the candles, and she was so impressed she agreed to stay. She wanted to write to her brother to let him know where she was. He agreed.There was a lot of humor in the book, plus mystery, excitement and an enemy. I truly loved the book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOAN H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 3, 2024",
                "reviewTitle": "excellent",
                "reviewText": "Loved this book a great read, loved Keith and Maisie the main characters and a great story. I ready the books in the wrong order had read book 3 before 2 but It didn’t spoil the story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G.R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 24, 2023",
                "reviewTitle": "twists turns happiness",
                "reviewText": "Macie is a strong willed woman, ready to stand up for herself, I loved how she gave Keith a run for his money instead of backing down and being frozen in fear of the so called beast. A wonderful combination of sparks flying, redemption and a mystery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "Well put together",
                "reviewText": "Liked the main characters and those around them. Interesting love story full of humour and spirit. I look forward to reading more.I",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marion L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 27, 2023",
                "reviewTitle": "A good read",
                "reviewText": "I liked the book. It’s a good fake engagement story with likable characters, witty banters and steamy chemistry.Maisie loves books and wants a special one owned by Keith. When she tries to steal it from him, he catches her.Keith has to get married within one month, otherwise his counsil will replace him with another laird.Scarred by a terrible incident, in which his parents were killed, he doesn’t want to marry and when he finds Maisie in his room, he offers her a deal: a fake engagement for one month, in return she will get all books from his library…If you like Scottish historical romances with scarred heroes, daring heroines and a touch of suspense, you will enjoy this story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "joyce coates",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 28, 2023",
                "reviewTitle": "Well perhaps not so Beastly",
                "reviewText": "I loved this as the reluctant man stood no chance with a woman who challenges him on every level until he was upside down and inside out as he battled with his feelings. Read it and enjoy it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}