{
    "remaining_requests": 2196,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/There-Are-Saints-Sinners-Duet/dp/172829424X",
    "body": {
        "name": "There Are No Saints (Sinners Duet, 1)",
        "price": "$9.44",
        "originalPrice": "",
        "rawPrice": 9.44,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/There-Are-Saints-Sinners-Duet/dp/172829424X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Hou4ivoaL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sophie Lark",
            "link": "https://www.amazon.com/Sophie-Lark/e/B07YJ37WK4/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 20454,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (October 3, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 272 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 172829424X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728294247"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.68 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,408 in Books (See Top 100 in Books) #226 in Romantic Suspense (Books) #346 in New Adult & College Romance (Books) #1,015 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 20,454 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/48991df5-d25b-4842-8f00-663ac625db12.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7218c8ca-3491-476b-b5a9-a3024e2eb914.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "The Romantic Rush Blog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3C4QUKTBU3P3T7H4XDGG2HZ5YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GOOH5I85PUEI?ASIN=172829424X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2021",
                "reviewTitle": "5.0 out of 5 stars Fantastic!",
                "reviewText": "WOW. Just wow. Grippingly intense and rivetingly psychological, this story consumed me! I’m both mesmerized and aghast- brilliant story telling from Sophie Lark! While I love so many of Lark’s story, I can without a doubt say this is her most creatively inspired piece to date. There Are Not Saints is one of the most interesting stories I’ve read in a while- a story of brilliant contrasts, one existentially bold and expertly told. Psychological thriller, dark suspense, gothic romance, angsty taboo? Everything and none of those- this story stands intrepidly on it’s own. And I can not stop thinking about it.The premise alone is enough to both titillate and chill. Two rival serial killers that have combined their love of the hunt with their artistic expression engaged in a captivating game of cat and mouse, a murderous one-upping feud. Both respected artists, both rich and powerful, one more base and primitive in his antics, the other more strategic and manipulative. And one is our hero. And our young, starving artistic ingenue finds herself the center of their games- at first a survivor, then an unwitting participant, and then suddenly grappling with her own inexplicable desire for the dark and control mercurial artist whose dark edge is clearly more than an artistic persona. Intrigued? You should be. There’s nothing like that- because Sophie Lark is going to make you delirious attracted to a cold, ruthless serial killer. Oh yes, it’s like The Fall meets You, and I was transfixed from the first word to the last.The story unfolds like dangerous seduction- an alluringly slow burn paired with the menacing edge of psychological intensity. Like the blade of a beautiful but bloody knife- something both marvelous and fearsome. Truly, Sophie’s best writing to date- vividly told, atmospherically brilliant, creatively unique, and expertly paced. But the characterization, this is where the story shines. What sets apart a true psychological thriller is just that- the psychology. The nexus of the pathos and logos that make a human mind tick- and tick in a way that isn’t quite normal but still accessible, reliable. And that’s what makes Cole Blackwell such an effective hero. He exudes this Ted Bundy-esque detached charm- a charismatic sophistication paired with a compelling raw magnetism. Sophie so brilliantly constructs and deconstructs this character- gives him depth and nuance that seduces us, but challenges his own essence by inserting emotional chords that are unfamiliar to him. He’s unpracticed in some aspects of feeling- it unsettles but awakens him. Possessive or obsessive, terrifying or enigmatic, sexy or menacing? I don’t care- I’m here for it. And Sophie connects us to him as a character first intellectually, then entirely emotionally- a really brilliant way of evolving a character arc simply by the narrative duality to his point of view. You FEEL his evolution- as much as we also see it in his subtly evolving actions. And we are so wrapped in his mind- we can both recognize psychological “otherness,” and it makes him all the more endearing. Is swooning over a serial killer a thing?And Mara is such an effective foil- she is a FORCE. Surprisingly given how unassuming she is- slight in stature, poor, unnoticeable and powerless, yet she becomes the lynchpin of this story, all because she refuses to let go of her incredibly unsatisfactory life- and then something beautiful happens, her life becomes extraordinary. Like her artistic media, Mara is a collage of pieces- a mosaic of interesting character traits and unexpected moments of character brilliance that made her equally as psychological fascinating as her serial killer beau. We only scratch the surface of her potential to live in the grey, but the glimmers we saw here make me incredibly excited to see just what she’s capable of. There’s a wildness to her that I can’t stop being curious about. And their chemistry is just FASCINATING. Inexplicable, consuming, taboo, toxic- yet beautiful. So much so you even forget about the world around them- because really that’s not what this is about. It’s about the collision of darkness, love, and power- and how they can all find peace in the soul.“Evil men always want to justify what they do….they want to push you, and bend you, and break you until you snap. Until you do something you’d never thought you’d do. Until you can’t even recognize yourself.”Be warned triggers abound. Did you not hear me say serial killer? Expect more than just the unsettling- expect the macabre in places. And Sophie dives into it with gleeful savagery. Normalizes it even- yet another brilliant stroke as we enter the mind of Cole. And it’s also filthy hot- kinky Sophie Lark is definitely my favorite.This is what happens when you step outside of the box- Sophie’s boldness pays off and then some. This is the kind of book that reminds me what I love reading- how words can be art, can challenge our hearts and minds. Brava. I can not wait to see how Sophie brings the story to close.",
                "reviewVotes": "41 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LCullen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIKEKNUSWGTLRXEIA2637LTRRMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMCJZLPFEWO9R?ASIN=172829424X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars morally grey love!!!!!",
                "reviewText": "Quick read! Had me captivated for most of it!! Read it in one sitting!!!! Love the dialogue witty & steamy!!!!! Definitely check the trigger warnings if you’re interested!!! The warnings are meant for a reason as this novel covers some pretty dark & heavy topics, but that said it conveys such emotions that we need to discuss not hide away from! It is sad that these things happen, but how the characters evolve good or bad from this experience is critical to the story!! It ends on a cliffhanger, but Main thing is a HEA in next one which is what I live for in novels!!!! No grammatical errors which is always a plus! The story flowed nicely!!!! Definitely can sense the connection loved that! Omg their fathers were such tools can’t believe them! Props to the author for creating such realistic & engaging characters & plot!! The chemistry between our main characters was AWESOME!!!! Loved the forbidden romance trope!! Possesive male alpha & his love eeekkkssss :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLJCXNI7LJQLZMMWMEW2GNIZRNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA303AZG8SV12?ASIN=172829424X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars absolutely addicting",
                "reviewText": "[𝙉]𝙤𝙩 𝙖𝙡𝙡 𝙤𝙛 𝙪𝙨 𝙬𝙚𝙧𝙚 𝙙𝙧𝙖𝙬𝙣 𝙩𝙤 𝙋𝙧𝙞𝙣𝙘𝙚 𝘾𝙝𝙖𝙧𝙢𝙞𝙣𝙜. 𝙎𝙤𝙢𝙚 𝙡𝙞𝙩𝙩𝙡𝙚 𝙜𝙞𝙧𝙡𝙨 𝙖𝙩𝙚 𝙪𝙥 𝙩𝙝𝙚 𝙨𝙩𝙤𝙧𝙞𝙚𝙨 𝙤𝙛 𝙗𝙖𝙡𝙡 𝙜𝙤𝙬𝙣𝙨 𝙖𝙣𝙙 𝙘𝙖𝙨𝙩𝙡𝙚𝙨 𝙖𝙣𝙙 𝙠𝙣𝙞𝙜𝙝𝙩𝙨 𝙬𝙝𝙤 𝙨𝙡𝙖𝙮𝙚𝙙 𝙩𝙝𝙚 𝙙𝙧𝙖𝙜𝙤𝙣 . . . 𝙒𝙝𝙞𝙡𝙚 𝙨𝙤𝙢𝙚 𝙡𝙞𝙩𝙩𝙡𝙚 𝙜𝙞𝙧𝙡𝙨 𝙧𝙚𝙖𝙙 𝙩𝙝𝙚 𝙨𝙩𝙤𝙧𝙞𝙚𝙨 𝙤𝙛 𝙖 𝙙𝙖𝙧𝙠 𝙥𝙖𝙩𝙝𝙬𝙖𝙮 𝙞𝙣𝙩𝙤 𝙩𝙝𝙚 𝙬𝙤𝙤𝙙𝙨 . . . 𝙖 𝙩𝙬𝙞𝙨𝙩𝙚𝙙 𝙢𝙖𝙣𝙨𝙞𝙤𝙣 𝙬𝙞𝙩𝙝 𝙗𝙡𝙖𝙘𝙠 𝙬𝙞𝙣𝙙𝙤𝙬𝙨 𝙖𝙣𝙙 𝙛𝙤𝙜 𝙘𝙤𝙫𝙚𝙧𝙞𝙣𝙜 𝙩𝙝𝙚 𝙜𝙧𝙤𝙪𝙣𝙙𝙨 . . . 𝙏𝙝𝙖𝙩’𝙨 𝙬𝙝𝙚𝙧𝙚 𝙬𝙚 𝙬𝙖𝙣𝙩𝙚𝙙 𝙩𝙤 𝙜𝙤. 𝙉𝙤 𝙢𝙖𝙩𝙩𝙚𝙧 𝙬𝙝𝙖𝙩 𝙬𝙚 𝙢𝙞𝙜𝙝𝙩 𝙛𝙞𝙣𝙙 𝙞𝙣𝙨𝙞𝙙𝙚 . . .An absolutely addicting, didn’t want to put it down, suspense-filled read.I’m not even going to synopsisize this one. (I’m making it a word!) If you like Dark Romance which involves a serial unaliver falling hard in the most obsessive of ways, filled with suspense and hot chemistry, this is one to check out.Not going to lie, the morals in this one are…👀, and yet, I couldn’t help rooting for this couple because 😮‍💨.So definitely check those TWs because there are definitely some gruesome scenes and some very “questionable” actions by our protagonists…As for me, as soon as I turned the last page, I immediately downloaded the next!What this book is giving:✅ Dark Romance✅ Dual POV✅ Serial Unaliver + Struggling Artist✅ Obsessive MMC✅ Rival Serial Unaliver Nemesis✅ Morally BLACKRating:⭐️⭐️⭐️⭐️⭐️ /5🌶️🌶️🌶️½ / 5",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elias Chase",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQJFQ2BCLEC635CDW6VMZKTI3QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6IWHYMCJBFLG?ASIN=172829424X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "3.0 out of 5 stars Intriguing romance/crime thriller",
                "reviewText": "⭐️⭐️⭐️/5 for story 🌶️🌶️.5/5 for spicePersonally I enjoy a slow burn romance—I would count this story as such. But it’s also very much tiptoeing the line of crime thriller. Cause you put the stalker, obsession love interests aside—we are actually dealing with serial killers and murders!Like how do you redeeem a character like that? I’m reading because I am intrigued to see how this is gonna be wrapped up into a HEA. And I give credit to the author for even giving this idea a go. I guess it’s not so far fetched though… I mean there was an obsession and romanticization with YOU. Even I got caught up for a minute—where you were actually hoping the killer didn’t get caught?! Like… wtf?! I love how well developed stories can mess with your morals like that.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roberta Domingues",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 26, 2023",
                "reviewTitle": "amazing!",
                "reviewText": "I loved this book so much! They have so much chemistry, it’s amazing! I’m already downloading the second one because I can’t get enough of them!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 6, 2023",
                "reviewTitle": "KUDOS TO THE AUTOR FOR SUCH A WELL WRITTEN PROVOCATIVE STORY",
                "reviewText": "This book got me out of a massive book slump. It's one of my first 5 stars reads of the year. It kept me hooked from the very beginnig even though I'm not usually a fan of slow burn, but it was perfect here. So happy I found this duet, now on to the next one...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cypress Koch-DeMaio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 24, 2023",
                "reviewTitle": "Dark Romance Perfection",
                "reviewText": "Characters: 5/5Setting: 4.5/5Writing: 5/5Plot: 5/5Steam: 🔥🔥🔥🔥🔥/5Overall: 5/5“I do not love men: I love what devours them.”I am obsessed with this book. I’ve been wanting to read one of Sophie Lark’s books forever (she’s literally the reason I got KU, all the way back in September) and I’m so glad I finally have. I can’t say for sure if starting with the Sinners Duet was the way to go because, of course, I haven’t read anything else. I can say for sure that this is one of the best dark romance books I’ve ever read.Let’s start off with the plot. I don’t want to spoil too much (though I will provide TWs at the end) but just know that this book is chaotic af and I wouldn’t have it any other way.Our protagonist, Mara, is amazing. I would die for her. She goes through it in this book and has for her whole life, as most DR heroines do, but she’s able to get back up on her feet with Cole’s support. She has some truly iconic moments. I mean, she keeps a serial killer for company. Clearly, she’s a badass.Said serial killer, Cole, is a character I was truly skeptical about. I went into this book wondering how Lark was going to make that work as a love interest, but she absolutely did.I’m halfway through There Is No Devil right now and I can confirm that book 2 is just as dark, steamy, and impeccable.Trigger warnings from a review on StoryGraph. These are not listed anywhere in the book or on the authors website. BIG red flag.Graphic: Blood, Classism, Kidnapping, Cursing, Gaslighting, Toxic relationship, Gore, Sexual assault, Torture, Death, Emotional abuse, Schizophrenia/Psychosis, Injury/injury detail, Murder, Sexual content, Stalking, Violence, Body horror, and BullyingModerate: Self harm, Abandonment, Misogyny, Child abuse, and ConfinementMinor: Death of parent and Alcohol",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 31, 2024",
                "reviewTitle": "Gripping",
                "reviewText": "This book has me booked after the first chapter. Loved it. So many twists and surprises. Looking forward to book two.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nikita Meshram",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 1, 2023",
                "reviewTitle": "No spoilers",
                "reviewText": "First time I felt I read a smart and intellectual plot.👏👏And one of my first dark romance story wherein the heroine was a strong character. On second thought, stronger than the male character.!! 😍Amazing story, i love it how Mara always retaliate and damn unapologetic.Unlike the other books wherein the female characters always gives in... Mara was somehow refreshingly new for me.Spice 🌟🌟🌟🌟🌟/5Plot 🌟🌟🌟🌟🌟/5",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}