{
    "remaining_requests": 2078,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beautiful-Villain-anthology-standalone-romance-ebook/dp/B0CTGKCGD3",
    "body": {
        "name": "Beautiful Villain: An anthology of standalone romance novels",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beautiful-Villain-anthology-standalone-romance-ebook/dp/B0CTGKCGD3",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81uG7zGZOlL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Natasha Anders",
            "link": "https://www.amazon.com/Natasha-Anders/e/B009JXLV3Y/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 42,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CTGKCGD3"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Twisted Mirth Publishing (February 1, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 1, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3229 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 1346 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,681 in Kindle Store (See Top 100 in Kindle Store) #23 in Mafia Romance #78 in Mafia Romance eBooks #87 in Romance Collections & Anthologies (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 42 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Susan_CSusan_C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV6O2OFSHR5GZI7YSS7HYOVMA7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F9E8WPPNWYO1?ASIN=B0CTGKCGD3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Wow A+ for her first RH",
                "reviewText": "4.5 ⭐️ Black Sheep by Gemma Weir her first whychoose she always has the most OTT possessive, obsessive A.holes that I am here for in my books!”I saw the line of okayness and sort of just hopped right over it.”After this remark I wasn’t sure what to expect but Gemma delivers to us. I am positive I would have been plotting ways to ☠️ Dimi, Vik and Lev.Is there such a thing as a psycho golden retriever that is what I think of while reading Lev 😂.If anyone has read her Alphaholes series this is Sebastian times three well maybe two and a half.This was a page turner I just kept reading all the way to the end to see what crazy, sexy things would happen and how they were going to change Alabamas mind. Loved the book but if you are not in to morally dark men who do as they want with no regrets who ☠️ anyone who even looks at her in appropriate way this is not for you. It has parts that will leave you gasping and gripping your pearls if you had them 😂🖤. After all the O’s they had me convinced too 🫠🫠. I will receive your gift with no shame!My vote is for MORE of these four!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41nvNjtC+7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TeresaR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRL3R66QNUUW4YZRHPXX27WPPQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CWAVM78KZV54?ASIN=B0CTGKCGD3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars OMG!! Vengeance is Mine by Lee Savino",
                "reviewText": "OMG!!! Victor and Lula are the hottest couple ever! And I read a lot of erotic books but this one. Wow! I couldn’t put it down it just called to me on a primal level. I’ve always loved Lee Savino’s stories but this one is exceptional!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudia H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXWUKCVLTN4J4YCVHG5TOVVHRUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L2XFGN1DR80J?ASIN=B0CTGKCGD3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Gemma Weir does RH!! You want to read this!",
                "reviewText": "Whoa!! Oh My...Honestly, I've only read the first book in this collection, but I do intend on reading all of them. I just had to review the first one, asap.I am already a fan of Gemma Weir, and all her OTT, Alpha men that when I heard she wrote a RH Bratva story - I had to read it!! Only, this is a nuclear level scorching hot read, that I wasn't prepared for!! I mean, I mostly was... because if you've ever read Gemma's work before, you know she is entirely UNapologetic about her guys being supremely Alpha, doling out punishments and pleasures that in real life, would buy you a restraining order!But this one? With 3 Alphas?! Whew!! It's a lot.The storyline is engaging, keeping the pages flipping, while the steamy chemistry and scenes are addictive. This is definitely not for delicate readers, and frankly, I'm glad this isn't real life. That said, I enjoyed getting lost in the world of Dimitri, Lev, Vik and Alabama for a little while. There's a HFN ending, but I'd love to read more. I really hope this is a start of their story, not the end.Grab this one, and steal some alone time with these characters and pages. Enjoy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diane Sara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELWKGBW37VBFUA6H6MTR76KL6HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8XKIO9O2W01I?ASIN=B0CTGKCGD3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful Read! Vengence is Mine has it all!!!",
                "reviewText": "“Beautiful Villain: An anthology of standalone romance novels. This has Romance, Strong, Dominant Alpha men and woman who are their match. Many of my favorite authors are here! And, what a wonderful way to read and find new authors! Great array of authors who know how to tell a story! Each story is unique and captures your attention from the first page. Loved all the stories because they were each different and were well written and the characters had depth and were well developed. I have enjoyed all the stories!Here is my review for “Vengeance is Mine: A Dark Romance” which is the second book in the series Mafia Bride series by Lee Savinoi. The story is original and not like any Mafia story you have read. Lucrezia (Lula) is the daughter of the head of the Mafia family but she has no interest in being a Mafia princess because she is on a quest! Her cousin, Royal is now head of the family and she feels that he hasn’t done enough to avenge the murder of her mother. Lula has trained for years to take down her mother’s killer who has been difficult to identify and even more elusive to find. Enter the assassin Victor, who totally ruins her carefully laid out plan. AND, he is attracted to her and decides to keep her. LOL Yes, he kidnaps her. I will not say more because this is the time to pick up the book and find out how this turns out.The story is filled with suspense, mystery, romance, aspects of BDSM and lots of HOT, sexy scenes from page one! Lula is a feisty and strong heroine, who holds her own against a strong, Dominant man.Will Victor get Lula? Will Lula be able to accept the truth? The characters are well developed and the chemistry between Lula and Victor is electric! The plot is filled with danger, action, is fast paced and holds your attention!! Through, Lee Savino’s talent, as an author, we are shown how the characters learn more about themselves, each other, their relationships and that together they grow stronger and can realize a brighter future. The suspense and mystery builds, the surprises keep the readers captivated and we just keeps reading and reading…..The ending is a total surprise!! Thank you,Lee Savino for an amazing story!!!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jedi family",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHU7E46DR3QRPHK53WTA7D2RMOUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8L3EXMQE1UQF?ASIN=B0CTGKCGD3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Review for Vengeance is Mine by Lee Savino",
                "reviewText": "I received an advanced copy of Vengeance is Mine by Lee Savino and am leaving my honest review.I didn't realize I had already read Leah and Royal's story in different anthology. It is not necessary to enjoy this one.Lucrezia, Lula to family, wedding day is interrupted when the groom is murdered. All her meticulous planning is out the door. Interestingly, it is not her wedding planning that she is mourning. Victor is intrigued by her reaction, or lack of one, to her groom being killed.This story has an edge to it where Victor's actions could be out of devotion or his crazy showing through. Things could easily tip one way or the other and Lula doesn't know if she should let her guard down with him or not. The answer he gives her is \"you know why.\"I found myself on the same edge. Floored by the sparks and steam that burns between them, but how easily he could take the scene a different way and have a disastrous ending for Lula. His training speaks to the darkness and desire in both of them, but the question is the price. I clung to the hope the connection they found their first time together. It showed a spark as both noticed how special the other was. As Victor lays it all on the line, Lula needs to decide if he has earned her trust.Story had be glued to it as I devoured it. Deep in the mafia world, Lula discovers her voice to demand what she wants and claim her place in it.Looking forward to more mafia brides stories.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miss B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 2, 2024",
                "reviewTitle": "Natasha Anders is bang on",
                "reviewText": "I purchased the anthology specifically for Natasha Anders and her book was a well written and intense bookAt the beginning I didn't understand how Trystan was a villain until his duplicity was revealed halfway through the book and yes he clearly was a villain here. The sexual tension between H and h was hot and the interaction between them and the love you could clearly see blossoming made the book a definite keeper.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda Nolan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2024",
                "reviewTitle": "confused",
                "reviewText": "This is the strangest review I’ve ever written. Bought this for the Natasha Anders book and it’s brilliant as usual. However the others are just iffy… it’s either straight to sex (which I don’t mind) or metaphysical wanderings and sex with 4 men… I suppose what I’m saying is buy Natasha Anders books by themselves…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}