{
    "remaining_requests": 2266,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beautiful-Graves-L-J-Shen/dp/154203633X",
    "body": {
        "name": "Beautiful Graves",
        "price": "$8.59$8.59",
        "originalPrice": "",
        "rawPrice": 8.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beautiful-Graves-L-J-Shen/dp/154203633X",
        "soldBy": {
            "sellerID": "A27EK23NIPUXRO",
            "name": "glenthebookseller",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A27EK23NIPUXRO"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81d4PXEdT4L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "L.J. Shen",
            "link": "https://www.amazon.com/L-J-Shen/e/B00Z81FWWM/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "glenthebookseller",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 11803,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author L.J. Shen is a Wall Street Journal, USA Today, Washington Post, and #1 Amazon bestselling author of contemporary, new adult, and young adult romance. Her books have been sold in twenty different countries, and she hopes to visit all of them.She lives in Florida with her husband, rowdy sons, and rowdier pets and enjoys good wine, bad reality TV shows, and reading to her heart’s content. Connect with her on her website at www.authorljshen.com or on Instagram (@authorljshen), or join her Facebook group at http://goo.gl/QZJ0NC. Sign up for her newsletter at https://bit.ly/3LhsIrb, and text SHEN to 313131 to get new release alerts (United States only)."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 18 hrs 29 mins",
            "$3.98 delivery Tuesday, March 5.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 17 hrs 29 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From USA Today bestselling author L.J. Shen comes a passion- and angst-charged story about a woman caught between a secure relationship and a once-in-a-lifetime spark with her muse.They say first loves are oftentimes the end of one’s innocence.Those words couldn’t ring truer for Everlynne Lawson, whose first brush with romance came with a heartbreak…and the thing that seems to follow her everywhere she goes. Death.After a great tragedy, Everlynne loses all she cares about―her dreams, her family, and her soulmate, Joe.Guilt-ridden, Everlynne decides to isolate herself in Salem, Massachusetts. A shell of the woman she once was, she takes her days one at a time, careful not to allow herself the joy she believes others in her life were robbed of. But when the mysterious, handsome Dominic storms into her life, it becomes more difficult to stay in solitude. Dominic is different: adventurous, joyous, with lust for life and a passion to make her his.Everlynne is on the cusp of reinventing herself once again when the old wounds of her past are resurrected, rawer than ever. There is nothing worse than being in love with two men.Especially when one of them hates you. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Montlake (October 4, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 381 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 154203633X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1542036337"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,704 in Books (See Top 100 in Books) #510 in Contemporary Women Fiction #1,329 in New Adult & College Romance (Books) #3,821 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 11,803 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "danielle kirby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLLEML2EMDUVGW5YDRXT4VCTCZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MB8FH1AQEWN0?ASIN=154203633X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars It felt like greys anatomy but with a twist ish..",
                "reviewText": "The prologue initially left me feeling very lost going into the story, however about 40% in we figure it out. About 65% in I wanted to quit because the FMC was making me mad. However it was like an episode of greys where I could actually hate mcdreamy, and the FMC came to her senses and eventually moved on. Yes everything I said above could be negative and I gave it 5 stars, but I was so absorbed in this book that I could not put it down… and I’d totally read again. I loved this book with a love hate passion of emotions that I have not felt before.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KaryBooBooks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFOD2ZTTVTRLYRYAEJWO2KHOUPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39F0ZAYXNBZPB?ASIN=154203633X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars absolutely recommend it!",
                "reviewText": "Ok I was certainly not expecting the turn this book took after the introductory part of the story. Let alone the other turns it took after that, wow just wow 😮 I must admit some parts had me rolling my eyes because it felt like beating a dead horse (how many times can we have the same battle Ever 😒) but overall I still liked the book & couldn’t put it down so I would definitely recommend it. In my opinion this book is about loss, fear, insecurities, second (& third & fourth) chances, how we can be our own worst enemies & obstacle to living a happier life. We accept we love we think we deserve right?Now as far as the characters…. Joe, oh Joe, how every girl deserves to experience a Joe AT LEAST once in her life (preferably permanently but hey I’m trying to keep it a humble ask). The way this man speaks at 19 leaves a lot to be desired from fully grown men 😮‍💨 Joe at 8% of the book & barely 19 years old is the epitome of why we have book boyfriends & why we love to read. (After reading the whole book this statement was only solidified even more x1000!)Ever, my dear girl, she had it ROUGH 😮‍💨 i must admit her character truly lived through some of the worst experiences. I truly don’t know that i could go on had I been in her shoes especially at that age. However, as much as my heart broke for her there was also aspects of her that were so frustrating & annoying to me that it made her a bit unlikable at certain parts.~~~~ Potential Spoiler ~~~~Honorable (or dishonorable 😒) mention to Dom. His introduction to the story was 😙🤌🏽 perfectly written in my opinion. He literally made me fall in love with him but turned out to give a whole new meaning to the whole love/hate situation because I really went from loving him to hating him. HOW DARE YOU DOM! 😩😫💔",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colbi Taylor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4VZPACBK4YGHKGP3LIADVRELBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Q0YNHJ6TYPPG?ASIN=154203633X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Emotional RollerCoaster",
                "reviewText": "The emotional roller coaster I was on during the entire reading of this book! I was happy, sad, mad, and everything in between but this book made me feel and feel hard! It’s so rare for me to cry at happy endings or sad moments but I swear I spent most of the time reading this in tears happy and sad ones!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOM32UAGR7WFB55OFIKSIDXJG7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A41OGDGM56X3?ASIN=154203633X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "3.0 out of 5 stars Ships Passing",
                "reviewText": "EverLynne Lawson was a little goth and a lot very specific about what she wanted in life, and when she met a young man named Joe on her trip to Spain it seemed that he was the perfect man she had waited for.Then her mother died and she felt like it was her fault and she never saw Joe again, and she dropped out of Berkeley and moved to Salem, MA.Life as a Salem witchy tour guide and a magic store clerk paid the bills, but it wasn’t what ever planned for her life. It was like she was crawling into darkness and refusing to really live. Even when she met a handsome young man who found her lost cat, EverLynne wasn’t interested in taking him up on his invitation to a date. Not until she met him a few weeks later when he looked like he needed friend, Ever decided to be that friend. She took Dominick out for a burger and let him tell her about his day and didn’t ever correct him when he shortened her name to Lynne.Ever and Dominick eventually started dating and he was the first guy in six years as she still missed Joe, but Dominick was so nice and patient she eventually gave in to him. So what they had nothing really in common, they had fun and Dom was sweet to her.Then we find out that the long lost Joe is the brother that Dominick called Steph as in Joseph, and Ever and Joe have to pretend they don’t know each other. Do you think this will be the worst and most complicated pain that Joe and Ever have to deal with? Not by a long shot, so if you are a fan of dark dramas, this is for you. I have no idea how I got here until I was too invested to bail. Not my cup of tea.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "may ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2AB6RMIOVFWTCELQ2PK2S5S5RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RLLA5ZJ7QMA4?ASIN=154203633X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome",
                "reviewText": "I absolutely loved this book. It was so well done and I could read it again tomorrow. A must read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Priscilla Gowan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR5C4G5J5UFOT3PWGZO33Q6AIHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FOQ1O3CZIDY7?ASIN=154203633X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Everlynne is very annoying",
                "reviewText": "I loved the writing and it was a great book. BUT I got halfway and was like “come on now, this is so GD stupid”. By the end of the book I wasn’t even interested in the happy ending because I was so aggravated by how long it took her to finally grow up! Joe was a beautifully written character and I could not stand Everlynne for not seeing the value in his love. I have learned I prefer a much more mature and emotionally aware female main character.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lupe S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF42OEGKVN2ENODQ2FFWUX5T3H7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9O461PH2QSHA?ASIN=154203633X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing book!!!",
                "reviewText": "L.J. Shen is my favorite author because her books are so good that it's hard not to read them in one day. I can't put them down. But this book has become my favorite of all her awesome books! Amazing story, amazing book, amazing author!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JLee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRMOV3D6PDXNNOFAWL5ZGNRXGJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX4HFE5VATVVC?ASIN=154203633X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful Disaster!!",
                "reviewText": "I loved it! Just heartbreaking and soul crushing wonderful! True to life fears and damaging loss. You will not regret this read. L. J. Shen is remarkable!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aat001",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 20, 2022",
                "reviewTitle": "emotional",
                "reviewText": "LJ Shen always finds a way to amaze me with her honesty in all of her characters. I loved this book. There are themes of death and insecurity throughout the book, it was such a different and honest take on how people experience life. I cried three times but just couldn’t put the book down - ending up reading all night. Whether you like the characters or not, they all had depth and were 100% themselves. There are so many morals in this novel and it’s still making me thing hours after I’ve finished.Spoiler:There were so many emotional twists and turns that it was hard to keep up. Some of the twists in the plot were a little obvious but the emotionally wrenching feelings that the characters felt were completely real. The guilt and just self blame for so many scenarios that are completely out of peoples control was so real.Leaving Seph and coming back. So frustrating that he kept taking her back. So many of the relationships in this book were so toxic of people hiding secrets and not just coming out with it and speaking their mind. That’s what makes the book ofcourse because it’s what people do in real life - hide away from their feelings, feel entitled, and give their family members a pass on the bs they do even when it’s wrong.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicola Kelly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 27, 2024",
                "reviewTitle": "satisfying read",
                "reviewText": "More and more I read books lately that I just don’t get satisfaction from. Like it was not worth my time that I spent reading it. THIS book is worth it. It was a roller coaster and I loved it! This will be getting a space on my bookshelf!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 2, 2023",
                "reviewTitle": "Page turner - captivating to the final page",
                "reviewText": "This is one of her best books! A hard read, tough subjects of loss, grief and fate. Sooo good. I couldn't stop once I started. Total hangover, full of emotions, a must read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sara",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 23, 2023",
                "reviewTitle": "Not my cup of tea",
                "reviewText": "I will be honest, the beginning of the book already had me wondering if I was going to like it and unfortunately it just got worst. The first interactions were so cringe... Like taken out of Wattpad or Tumblr. Not what I'm used from this author, and as the book progressed I was wondering were she was going with this, specially when the love triangle appeared, It reminded me to teenage drama in the early 2k. Definitely not my cup of tea. I skipped half of the book but it was well written, cohesive and had great characters.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 18, 2022",
                "reviewTitle": "Another Gem from LJ Shen",
                "reviewText": "Her writing is so amazing- the character development, the story and the details - so beautiful and realLove her writing",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}