{
    "remaining_requests": 2328,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Seven-Husbands-Evelyn-Hugo-Novel/dp/1501161938",
    "body": {
        "name": "The Seven Husbands of Evelyn Hugo: A Novel",
        "price": "$9.99",
        "originalPrice": "$17.00",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Seven-Husbands-Evelyn-Hugo-Novel/dp/1501161938",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41CPnkPQ6dL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51vFkin0dsL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Taylor Jenkins Reid",
            "link": "https://www.amazon.com/Taylor-Jenkins-Reid/e/B00DX8B85M/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 218609,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 36 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Atria Books; Reprint edition (May 29, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1501161938"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1501161933"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 1.1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#53 in Books (See Top 100 in Books) #5 in Family Life Fiction (Books) #15 in Women's Domestic Life Fiction #68 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 218,609 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/820dabac-a18d-4eba-a1d7-e17e8e15e1dd.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a3c0bc7-cfbc-41e7-b350-962e2e74005c.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/81f023fd-9171-4184-8505-2163f420e9ed.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4e9446d3-7094-4fa9-a94d-a07b1deeda81.__CR0,0,1080,1080_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "melanie (meltotheany / jtotheimin)melanie (meltotheany / jtotheimin)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUGNKRPYFQBSKXTLRNN445XABLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28DSKVTIVN490?ASIN=1501161938",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 23, 2018",
                "reviewTitle": "5.0 out of 5 stars 5/5 A True Masterpiece",
                "reviewText": "“I spent half my time loving her and the other half hiding how much I loved her.”This is one of the best books I’ve ever had the privilege to read. It is probably in the top five for best books I’ve ever read in my entire life. I have been looking for a book like this my entire life, and no combination of words I’m about to type, and you’re about to read, is going to do this masterpiece justice. But I will say that Gabby, Joce, Amelie, and Elyse were all right, and I’m so happy I listened to them, because this book is worth every single ounce of hype.And when I say that this book is lifechanging, I truly mean it. This book is sold as a historical romance, where you learn about a fictional, famous, old Hollywood actress and all her marriages. What you get is a book that stars a bisexual, Cuban woman who was never allowed to talk about the love of her life; her wife. And when I say I cried during this book, I truly mean that I probably need to buy a new copy because I was the biggest mess you’ve ever seen.“And it will be the tragedy of my life that I cannot love you enough to make you mine. That you cannot be loved enough to be anyone’s.”On top of this being a powerful book about race, sexuality, misogyny, and having to conform to societies norms, the true meaning I took from this book is that life is short, so damn short, and we shouldn’t spend it pretending to be something we aren’t. And we shouldn’t spend it doing anything less than loving the people who are worthy and deserving of our love.“I didn’t need boys in order to feel good. And that realization gave me great power.”We follow Evelyn from the very start; losing her mother very young, her body developing very quickly, noticing others noticing her developing body, marrying a man so she can leave the dead-end city she grew up in, so she can become something more. Evelyn is unapologetic with her actions, and it is one of the most empowering things I’ve ever read. She plays so many more parts than the roles she is cast in. And Evelyn learns really quickly how to play each and every man she is forced to interact with, and she quickly learns what she can gain from each and every one of them, too.This story is told from two different timelines and two different points of view. One from Monique Grant, who is a biracial (white and African-American) woman who is going through a fresh divorce and trying to make something of herself in the journalism field. And her life changes the day her editor tells her how Evelyn Hugo is demanding her, and only her, to write something for her.“Heartbreak is loss. Divorce is a piece of paper.”The other timeline(s) are all the different times in Evelyn’s life, and the different seven husbands that she had, while she is recounting the events that lead her to be telling Monique this story. Evelyn has lived a very full life, and is in her late seventies now, and is finally ready to talk about her life. But the entire book we are guessing why she has chosen only Monique for this job.“Make them pay you what they would pay a white man.”If you guys have been following my reviews, you’ll probably know that I talk about found family and how important it is to me a lot, but The Seven Husbands of Evelyn Hugo is the epitome of how beautiful a found family can be. Evelyn and Harry’s friendship in this was one of the most beautiful things I’ve ever read in my entire reading life.“When you write the ending, Monique, make sure the reader understands that all I was ever really looking for was family. Make sure it’s clear that I found it. Make sure they know that I am heartbroken without it.”And the romance? The true romance in this book is the most romantic thing I have ever read in my entire life. And you guys know I’ve read a ton of romances, but they are all lesser to this. Every single one of them can’t compare with the romance in this book. I feel like every time I’ve used the word “perfect” to describe something that wasn’t the romance in this book, then I used the word wrong.“Please never forget that the sun rises and sets with your smile. At least to me it does. You’re the only thing on this planet worth worshipping.”How many Evelyn and Celias are there in the world? How many are still playing the role that Evelyn was forced to play? I cry for every single person who must hide who they are, and who they want to love. And this book talks about many big things in LGBTQIAP+ history; from the Stonewall riots to the disgusting Reagan administration, but life still isn't anywhere close to equal in 2018. The prejudices, the discrimination, the virus/syndrome blaming, the looks I’ve experienced holding a girl’s hand while walking into a restaurant? Those are still in 2018, in the United States, but people act like none of those things exists because marriage is legalized, begrudgingly. I’m not writing this review to get on my soapbox, but I promise, we have a lot more work to do. And this book, this book lit a fire under me.I personally identify as pansexual, but I felt like the bisexual rep in this was a tier above anything my eyes have ever seen. Seeing Evelyn love all the parts of her, and all the different parts of her love, was something so awe-inspiring. I am still so overwhelmed with feelings, but if you identify as bi or pan, this is a love letter to you, I promise.“I was a lesbian when she loved me and a straight woman when she hated me.”This book also focuses a huge importance on motherhood throughout the entirety of this book, and then I read the acknowledgement and started weeping all over again. Taylor Jenkins Reid was able to evoke the strongest emotions from me, and I just pray that things will be different for the generation of kids being raised right now.This was the first thing I’ve read by Taylor Jenkins Reid, but I will buy every single new thing she produces. The writing was so lyrical and addicting. I mean, I have a quote between almost every paragraph. This whole book deserves to be highlighted. The characters, well, my mind has now forever imagined that these are real people now, so there is that. The topics, themes, and discussions are beyond important. This book just makes me feel so passionately. This book is one of the most empowering pieces of literature I’ve ever consumed. And I am not the same person I was before this book.“I told her every single day that her life had been the world’s greatest gift to me, that I believed I was put on earth not to make movies or wear emerald-green gowns and wave at crowds but to be her mother.”If you guys ever take a recommendation from me; please have it be The Seven Husbands of Evelyn Hugo. Please, I’m actually begging you. I promise, this book is lifechanging, and I equally promise you that this book changed mine. There is magic between these four-hundred-pages. Pure magic. This story is addicting, enthralling, and so important. And if you’re an Evelyn, in 2018, I see you, but I hope it doesn’t take you as long as it took her to be happy. This will forever be one of the best books of my life, and I’ll cherish it forever.“People think that intimacy is about sex. But intimacy is about truth. When you realize you can tell someone your truth, when you can show yourself to them, when you stand in front of them bare and their response is “You’re safe with me”—that’s intimacy.”Trigger/Content Warnings: death of a loved one, death of a child, talk of suicide, unhealthy dieting, underage sex with an adult, abortion, talk of miscarriage, a lot of physical abuse, cheating, dunk driving, and homophobic slurs.",
                "reviewVotes": "376 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71Yk0YqNCGL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TylerTyler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWUD26UZCDOSGZ7TST2Y52TNLRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R450YTIQJLVNP?ASIN=1501161938",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars ★★★★★♾️",
                "reviewText": "Short synopsisFilm legend & Hollywood starlet Evelyn Hugo tells her life story to reporter Monique Grant, scandals & all. At the age of 79, Evelyn is ready to reveal the true story of her life, which she has hidden from the public for decades.My ThoughtsWhat can I say that hasn’t already been said about this gem? I went into this one blindly, & I am joining the chorus of singing TJR’s praises. If you are like me & have let this one sit on your shelf far too long, I honestly think the less you know about the plot, the better!I devoured this book, every single page from start to finish. I was so invested in Evelyn's history & so desperate to figure out Monique’s connection that I quite literally could not put it down. I was positively floored at the perfect ending & reveal.Just like in Daisy Jones, TJR created iconic characters that I had to remind myself weren’t real, & that what I was reading was fiction. I loved how the newspaper clippings kept the timeline easy to follow. I loved the transition for past to present day. I loved how this story tugged on my heartstrings.I expected a scandalous Hollywood tell all about a famous movie star, but instead I got heartfelt, emotional story about true love, ruthless ambition, secrets, & heartbreaking loss.♡ The Seven Husbands of Evelyn Hugo has secured a special place in my heart as one of my favorite books ever. This book will be one I re-read, rave about, recommend & remember forever. ♡",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7180yUOmxaL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emily Layne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCQJHKAYG3G7WJQJWQHRGABDDVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S604ZF3UMPYJ?ASIN=1501161938",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "4.0 out of 5 stars I finished this book in less than six hours",
                "reviewText": "I was utterly captivated for the first 75% or so. While the storyline is interesting, it was Reid’s writing that drew me in. At one point, I remember thinking, “I only thought I’d read 5 star books before this.” But mostly, I wasn’t even aware that I was reading a book. I was too consumed.And then something shifted. The character development peaked and Reid’s writing became rushed as she tried to fit all of her twists into the last few chapters (and marriages) of the book. The story itself wasn’t the problem. The twists fit perfectly into her story and it all could have been great. It just wasn’t. Her writing lost depth and authenticity. I found myself wanting to get to the end already vs getting truly lost in the world she had created, the way that I had previously. I would give the last quarter a 3 star rating, which is ultimately why I settled on a 4.Please don’t get me wrong - there are tens of thousands of glowing reviews for a reason. This is a wonderful read and it’s worth your time. You will be captivated. The decline toward the end doesn’t void out the masterpiece that this book spends most of it time being, it just stops it from reaching its full potential.P.S. I read several reviews that said this book was just a cover for a “woke political agenda.” I don’t see it. It’s impossible to tell the story of a powerful, bisexual woman in the 50s/60s/70s/80s without any mention of the political climate that affects her life’s choices. Part of what made the story so mesmerizing was the fact that it felt so real (til the end, anyway!), and this was largely due to the inclusion of those political truths and challenges.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danna Leal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 6, 2024",
                "reviewTitle": "El mejor libro sin duda",
                "reviewText": "Lo recomiendo por completo! Lo leí en inglés y es súper fácil de leer, la historia es simplemente hermosa. He leído otros libros de la autora y todos son muy buenos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "simone",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 12, 2023",
                "reviewTitle": "muito bom",
                "reviewText": "Diferente dos livros que leio normalmente mas amei a leitura. Com certeza vou ler outros livros da autora no futuro",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "suman dinda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 10, 2024",
                "reviewTitle": "It was amazing👌👌",
                "reviewText": "It was very captivating. It was also kind of fast paced. I could not keep it down... The quality was great too",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marlene",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 6, 2024",
                "reviewTitle": "Interesting lifestory!",
                "reviewText": "I enjoyed this book a lot. The lifestory of Evelyn Hugo is interesting and thrilling! Especially the love of her life was quite a surprise, nonetheless inspiring and beautiful. I think we all want love like these two, connected over their whole life time!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "patricia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 4, 2024",
                "reviewTitle": "Bonita",
                "reviewText": "Está genial para fans de Sidecars",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.99",
                "sellerName": "Academic Book Solutions",
                "sellerRating": "5"
            },
            {
                "price": "$5.74",
                "sellerName": "Page Masters",
                "sellerRating": "4.5"
            }
        ]
    }
}