{
    "remaining_requests": 2326,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dreamland-Novel-Nicholas-Sparks/dp/0593449576",
    "body": {
        "name": "Dreamland: A Novel",
        "price": "$10.50$10.50",
        "originalPrice": "",
        "rawPrice": 10.5,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dreamland-Novel-Nicholas-Sparks/dp/0593449576",
        "soldBy": {
            "sellerID": "A8146B9Q816MQ",
            "name": "Martistore",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A8146B9Q816MQ&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81pF6fAUOOL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Nicholas Sparks",
            "link": "https://www.amazon.com/Nicholas-Sparks/e/B000APGF36/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Martistore",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 26359,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Sparks has the magic touch.”—USA Today“The love that [Sparks] writes and conveys to the reader, and the intricacy of his stories is captivating. . . . These characters feel like people you know in real life—people chasing dreams while maintaining their responsibilities and the tangible parts of life that chain us to reality. . . . The perfect summer read.”—BookTrib“From this singular work it’s clear that [Sparks] . . . continues to hone his craft.”—The Cullman Times“Another fantastic work of Nicholas Sparks, combining elements of finding true love with pursuing one’s dreams, along with hidden family secrets and mental health issues. The author brilliantly presents an idea of a dreamland being not only a wonderful vacation destination, but a person’s state of mind and worldview, as well.”—Fredericksburg Free Lance–Star“Woven throughout is a suspenseful subplot . . . beautiful, heartbreaking . . . [Sparks's] empathetic characters and their down-to-earth personalities make it easy to get immersed in this world. Readers who love epic romantic sagas will want to snap this up.”—Publishers Weekly“Sparks's latest appealing novel is filled with plenty of serious situations among the dreams and romance and rewards with a satisfyingly hopeful ending.”—Booklist About the Author Nicholas Sparks is the author of twenty-three books, all of which have been New York Times bestsellers. His books have been published across more than fifty languages with over 150 million copies sold worldwide, and eleven have been adapted into films. He is also the founder of the Nicholas Sparks Foundation, a nonprofit committed to improving cultural and international understanding through global education experiences. He lives in North Carolina. Excerpt. © Reprinted by permission. All rights reserved. It was morning. She was in the bedroom of the house she’d just rented, and her six-year-old son, Tommie, was asleep in the room across the hallway. She had only recently arrived in town. Yes, Beverly thought, reminding herself. My new life. I’m beginning my new life, and only then was she able to push the covers back. She got out of bed, feeling a thin silky rug beneath her feet, a pleasant surprise. The bedroom door was closed, but she knew the short hallway beyond it would lead to the stairs and that, on the main floor, there was a living room and a small kitchen furnished with an old Formica table surrounded by four scuffed wooden chairs.Beverly slipped into the jeans and T-shirt that had been heaped on the floor and wondered how long she’d been sleeping. She couldn’t remember what time she finally went to bed, other than that it had been really, really late. But what had she done? The memories of the night before were nothing but dream smoke, blurring at the edges and black in the middle. She couldn’t remember what she’d had for dinner or even if she’d eaten at all, but she supposed it didn’t much matter. Starting over always carried with it stress, and stress made the mind do funny things.She crept from her bedroom, peeked in on Tommie, and saw him jumbled under the covers. She quietly made her way down the stairs to the kitchen. As she poured herself a glass of water from the faucet, she remembered a recent night when she’d snuck from her bedroom, moving quietly and without turning on a single light. She was already dressed when she roused Tommie. His small backpack was loaded and hidden beneath his bed. She helped him get dressed and they crept down the stairs. Like Tommie, she carried only a backpack, for ease and speed. She knew that neighbors might remember a woman and child hauling rolling suitcases along the sidewalk in the middle of the night; she knew that her husband, Gary, would seek out those neighbors and they would tell him what he needed to know to find her. In Tommie’s backpack were his favorite Iron Man action figure and Go, Dog. Go!, a book she still read to him every night. She’d also packed two T-shirts, a second pair of pants, socks, underwear, toothbrush and toothpaste, and hair wax for his cowlick. In her backpack were the same sorts of items and other things, along with a smattering of makeup, a brush, sunglasses, an Ace bandage, and a wig. Near the front window, she didn’t bother looking for the black SUV with tinted windows that had been parked along her street for the past three days. She already knew it would be there, even if parked in a different spot. Instead, after she helped Tommie with his jacket, they slipped out the back door. She made sure not to let the screen door bang or squeak, inching it closed as slowly as possible. They crossed the damp grass to the wooden fence that bordered their lawn, and Beverly helped Tommie climb over into the neighbor’s backyard. Through all of that, Tommie had said nothing. He wobbled when he walked as though still partially asleep. They exited through the neighbor’s gate and stayed near the hedges until reaching the street that ran parallel to her own. There, she hid behind a car parked on the street and peered in both directions. She saw no black SUV with tinted windows.Where are we going? Tommie finally asked her.On an adventure, she’d whispered.Is Daddy coming with us?He’s working, she’d responded, which was true, even if it didn’t really answer his question.It was the middle of the night and quiet, but the moon was half full and the streets were illuminated by lampposts at the intersections. She needed darkness and shadows to remain invisible, so she cut across lawns and driveways, sticking close to the houses. In the rare moments when she heard a car coming, she led Tommie to whatever nearby secluded spot she could find—behind bushes or trellises and even an old RV. Occasionally, a dog would bark, but the sound always came from a distance. They walked and walked, but Tommie didn’t whine, didn’t so much as whimper. Residential streets gradually gave way to commercial ones, then, an hour and a half later, to an industrial area, with warehouses and a salvage yard and parking lots surrounded by chain-link fencing. Though there was no place to hide, the streets were empty. When they eventually reached the bus station, the entrance smelled of cigarette smoke and fried food and urine. They went inside. In the restroom, Beverly pinned her hair up with bobby pins and donned the wig that turned her from a long-haired blonde to a brunette with a pixie cut. She wrapped a long Ace bandage around her chest, making her breasts smaller, pulling it tight to the point that it was hard to breathe. She donned a baseball hat, and though it was still dark, she put on her sunglasses. Tommie didn’t recognize her when she emerged. She had told him to sit on one of the benches and explained that it was important not to wander off, and it was only after she removed her glasses while directly in front of him that his eyes widened in recognition. She walked him to an even more isolated bench in the corner of the terminal, one that was out of sight from the ticket window, and told him to sit quietly.There were only a few people milling about in the station when she went to the ticket window and took her place in line behind an elderly woman in a heavy brown cardigan sweater. When it was her turn, she stood before a man with bags under his eyes and a long side patch of stringy gray hair that he swept over his bald spot. She asked for two tickets to Chicago, and as she handed over the money, she mentioned casually that she and her sister were going to visit their mother. She didn’t want the man behind the Plexiglas to know she was traveling with her son, but apparently he didn’t care one way or the other—he barely seemed to notice her as he handed her the tickets. Beverly returned to a bench kitty-corner from Tommie, where she could keep an eye on him but it wouldn’t be obvious that they were together. Every minute or so she would glance at him, then toward the entrance, searching beyond the glass for the black SUV with tinted windows, but thankfully it never appeared. She also studied other faces in the terminal, trying to memorize them, seeing if anyone was paying attention to a little boy sitting all alone, just in case. But no one seemed to care.Dawn arrived, a bright late-spring glare. In time, the engine of the appropriate bus began to idle beneath one of the aluminum canopies out back. With her stomach in knots, she sent Tommie ahead so he could pretend to be boarding with a man in a bomber jacket, a father and son traveling together. Through the windows, she watched Tommie follow the man toward seats near the rear of the bus. Others boarded, then she finally stepped aboard, walking past the thin, dark-haired bus driver. She took a seat in the second-to-last row; on the opposite side, in the next row up, was an older woman knitting, moving the needle like a conductor standing in front of an orchestra. Tommie remained in his seat ahead of her until the bus started moving, just as she’d instructed, and when they reached the highway, he joined her. There, he leaned his head against her shoulder while she continued to watch the people on the bus, forcing herself to remember them and trying to figure out whether any of them had noticed anything amiss.She reminded herself of how careful she’d been. Gary was out of town, doing whatever secret thing it was he did for the government. They’d also left on a Saturday, and on each of the four previous weekends she’d made sure not to leave the house or even let Tommie play in the yard, establishing a pattern that would hopefully buy time. Using money she’d secretly saved over a period of six months, she set up automatic timers on the lights, which would come on and then go out in the evenings. With any luck, the driver in the black SUV wouldn’t know they were gone until the school bus showed up on Monday morning. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 35 mins",
            "FREE delivery February 26 - 28 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 23",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 10 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NEW YORK TIMES BESTSELLER • A twist you won’t see coming. A love story you’ll never forget. From the acclaimed author of The Notebook comes a powerful novel about risking everything for a dream—and whether it’s possible to leave the past behind. We don’t always get to choose our paths in life; sometimes they choose us.ONE OF THE BEST BOOKS OF THE YEAR: PopSugarAfter fleeing an abusive husband with her six-year-old son, Tommie, Beverly is attempting to create a new life for them in a small town off the beaten track. Despite their newfound freedom, Beverly is constantly on guard: she creates a fake backstory, wears a disguise around town, and buries herself in DIY projects to stave off anxiety. But her stress only rises when Tommie insists he’d been hearing someone walking on the roof and calling his name late at night. With money running out and danger seemingly around every corner, she makes a desperate decision that will rewrite everything she knows to be true. . . . Meanwhile, Colby Mills is on a heart-pounding journey of another kind. A failed musician, he now heads a small family farm in North Carolina. Seeking a rare break from his duties at home, he spontaneously takes a gig playing in a bar in St. Pete Beach, Florida, where he meets Morgan Lee—and his whole life is turned upside-down. The daughter of affluent Chicago doctors, Morgan has graduated from a prestigious college music program with the ambition to move to Nashville and become a star. Romantically and musically, she and Colby complete each other in a way that neither has ever known. In the course of a single unforgettable week, two young people will navigate the exhilarating heights and heartbreak of first love. Hundreds of miles away, Beverly will put her love for her young son to the test. And fate will draw all three people together in a web of life-altering connections . . . forcing each to wonder whether the dream of a better life can ever survive the weight of the past.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Random House Publishing Group (August 8, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593449576"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593449578"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.16 x 0.8 x 7.98 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,296 in Books (See Top 100 in Books) #79 in Family Life Fiction (Books) #102 in Contemporary Women Fiction #952 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 26,359 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/82ebedcf-93d2-4aec-b503-19aed774586c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0560f833-df80-4994-89f8-493739a7402a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/27cbc74a-3c7f-4c71-9ac8-205171394b4a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/22dd621a-44d6-498a-ac5e-e479b64a7709.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Shelly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIIEQOEM74WTDSOSJNFUU4GG2YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BT38YN6CHK2L?ASIN=0593449576",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved the book",
                "reviewText": "The craziest thing is I do have a boyfriend, he is a farmer and I could never figure out why we can't be together most of the time. Reading this book did put things into perspective, I know our story isn't like Morgan and Colby's but kudos to you Nicholas.I loved every line in this book, and it maintained a bit of old school that I always find and makes me love reading novels. Every now and again it helps me escape the reality of the world we live in.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roberta",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDV6RX53TVDRRML3JTDARQBPZTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGMGG5EUGNS3E?ASIN=0593449576",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars dreams",
                "reviewText": "I was amazed the way the story went back and forth like it was two separate stories. It had me wonder why but at the end, putting it together as one story, I was amazed but really surprised at Nicholas Sparks imagination. Outstanding writer! I love every book I’ve read of his!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Avidreader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDB2JCUKSZLK222NB3LWNA3HVLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KH9N6QVF2NI4?ASIN=0593449576",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2023",
                "reviewTitle": "4.0 out of 5 stars Strange Plot - Good Book",
                "reviewText": "I almost dumped the book from my Kindle because of the plot design: two seemingly unrelated characters, Colby and Beverly, with absolutely no connection. Colby’s story seemed like the typical Nicholas Sparks romance novel. Beverly’s story was very unsettling and upsetting, almost like a thriller/mystery. I thought, after a couple of chapters, I’ll just read the “Colby” chapters. But I persevered begrudgingly and suffered through the Beverly story too. (Spoiler Alert) My mother had Bipolar 1 mental illness all her life. Too many memories were evoked as I read about Beverly. Nicholas Sparks either did a lot of research or knows someone with Bipolar 1 very well: he absolutely nailed not only the daily chaos, but the inner workings of the mind, especially during the “manic” phase. In the end, Colby’s story had a predictable resolution. Trust me when I say, Beverly’s story will be on a repeat cycle for the rest of her life…sadly.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna Colvett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEXYBKYGDI2FZYSSBY5P5CGYJ3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2632W9ZSGA3KA?ASIN=0593449576",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Great read",
                "reviewText": "It’s a little confusing to start because a character is introduced without any explanation, but by then end you pick up on who it is. It was a nice easy read and actually my first Nicolas Sparks book, now to move on to another one of his! I see why his name is so popular.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC7XMPE6L4MPXB6MHGO62KIE5YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW6031Q8SWW4V?ASIN=0593449576",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars love Nicholas Sparks books",
                "reviewText": "Love Nicholas Sparks books. Always such a fun quick read. Loved the twist toward the end and, as always, the happy ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lori",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMEKQJ23FCVZXHS3UR5T2ZJRCZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17IL0UWI0OVFX?ASIN=0593449576",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "3.0 out of 5 stars it isn't really that large of a print",
                "reviewText": "THE PRINT ON THIS BOOK ISN'T AS LARGE A PRINT THAT I WOULD EXPECT FROM WHAT LARGE PRINT IS . IT ISN'T AS BIG AS THE WAY I AM TYPING RIGHT NOW. DISAPPOINTED",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie Espinoza",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEO4BRSGA3OA4MDV54ID76F5NR7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLBATLNPO1H2P?ASIN=0593449576",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Astonished",
                "reviewText": "Its the first Nicholas Sparks book I've read (I've seen movies based on his books)But i was shocked and interested on how both stories came together.It was something unexpected and I couldnt stop reading.Definitely Recommend this book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marc Devereux",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBDMG4T57CFGSTWMWYKUCCBZSNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SDQ7E3SITEKD?ASIN=0593449576",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "4.0 out of 5 stars kept me turning the pages",
                "reviewText": "It was a very romantic and seriously passionate read. It was also very suspenseful! I really liked part about the sister Paige",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adriana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 26, 2022",
                "reviewTitle": "Fraco",
                "reviewText": "Eu achei o enredo fraco, não envolvente como os livros do Nicholas Sparks geralemente são. A conexão dos personagens foi interessante, mas ficou faltando emoção. Foi o primeiro livro que não me levou as lágrimas e ao final, eu pensei: só isso?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 5, 2024",
                "reviewTitle": "Two sides to every love story",
                "reviewText": "I loved it! The way the 2 stories came together at the end. the sister said it right that Love has 2 sides and is shared with pain. This was a wet one for me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "khushboo Patel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 4, 2023",
                "reviewTitle": "As always mesmerizing.",
                "reviewText": "Nicholas Sparks, the name is enough for anyone to feel the Dreamland described in the book, he's truly exceptional and the storyline is like no other. Great read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 24, 2022",
                "reviewTitle": "Dreamland... To much!",
                "reviewText": "Good book, but not my favorite of Nicholas Sparks the global bestseller.May be better as a storyboard for a movie...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 23, 2024",
                "reviewTitle": "What a wonderful story!",
                "reviewText": "It was so great to read this wonderful insight and story of love, forgiveness and a brother’s understanding of mental health.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.49",
                "sellerName": "Husband's Leftovers",
                "sellerRating": "5"
            }
        ]
    }
}