{
    "remaining_requests": 2304,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Things-We-Leave-Unfinished/dp/1682815668",
    "body": {
        "name": "The Things We Leave Unfinished",
        "price": "$9.62$9.62",
        "originalPrice": "",
        "rawPrice": 9.62,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Things-We-Leave-Unfinished/dp/1682815668",
        "soldBy": {
            "sellerID": "A30F61PSZN4NEG",
            "name": "Cover To Cover Buy Sell Trade",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A30F61PSZN4NEG"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71cz1gtKxQL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rebecca Yarros",
            "link": "https://www.amazon.com/Rebecca-Yarros/e/B00HYKBU1W/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Cover To Cover Buy Sell Trade",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 20113,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Readers will be wowed.\" - Publishers Weekly (Starred Review) \"Everything I love in a story and it's all held together by superb writing. Prose, passion, plot. This book has it all.\" -- Amy Harmon, New York Times bestselling author\"I am staring into space with my heart on the floor and tears streaming down my face. Wow. This is my first Rebecca Yarros novel and I'd now like her to continually break my heart and put it back together in the pages of a book.\" -Brittany Z., NetGalley\"Talk about an emotional rollercoaster the author puts you through! Weaving two stories of love, deception, heartbreak and heartbreak. The characters are so real, and you become so invested that your heart breaks for all they are going through! This a book like this is a rare gem, one that will leave you emotionally satisfied.\" -Claire S., NetGalley\"Yet again Rebecca Yarros has shown her skill and prowess with beautifully presented manipulations of the written word. She can produce just about anything with her trusty pen, typewriter or computer.\" -Pauline C., Goodreads\"The Things We Leave Unfinished is a captivating and immersive read that introduces two unforgettable romances.\" -Julie P., Goodreads\"The \"feels\" that jumped off the page and the romance so beautifully written are just a couple of the elements that elevated this story.\" -Shirley Q., Goodreads\"For anyone who is a fan of epic love stories, sacrifice, and the occasional steamy sex scene this is a must read.\" -Crossroads Reviews\"I'm positive this book will top my Best Reads of 2021 list! If I could give this book more than five stars, I would do so in a heartbeat.\" -Stephanie T., NetGalley\"Rebecca Yarros wrote an amazing, enchanting story filled with love, heartbreak, tragedy, sadness and happiness. I will note that I was totally blindsided by a twist at the end, which made this even more intriguing. Very well done. The Things We Leave Unfinished is a captivating must read.\" -Barb L., Goodreads\"I finished this book with tears in my eyes, feeling emotionally drained, and had a smile on my face. Rebecca Yarros definitely knows how to rip your heart out and still leave you with a happily ever after.\" -Stephanie P., NetGalley\"I'm utterly speechless, this book has rendered me emotionally spent and my jaw hurts from hitting the floor with the ending!\" -Rhonda B., Goodreads\"This story that Rebecca Yarros has given us will take you on one incredible journey that is sure to deliver all the feels.\" -Amy B., NetGalley\"Engrossing storytelling that goes deep into the complexity of emotions; compelling circumstances in which Yarros's protagonists above which forced to rise...or sink, followed by the poignancy of finally realizing that they have to fight for each other as they undertake a journey together.\" -Unstuck Pages\"I loved everything about this book and could not recommend it more! This is a stellar romance!\" -Pink Cowland Reads\"THE THINGS WE LEAVE UNFINISHED is a captivating women's fiction read with a surprise ending that left me reeling.\" -Olivia F., Goodreads About the Author Rebecca Yarros is the New York Times bestselling author of more than fifteen novels, with multiple starred Publishers Weekly reviews and a Kirkus Best Book of the Year. A second-generation army brat, Rebecca loves military heroes and has been blissfully married to hers for more than twenty years. She’s the mother of six children, and she and her family live in Colorado with their stubborn English bulldogs, two feisty chinchillas, and a cat named Artemis, who rules them all.Having fostered, then adopted their youngest daughter, Rebecca is passionate about helping children in the foster system through her nonprofit, One October, which she cofounded with her husband in 2019. To learn more about their mission, visit oneoctober.org.To catch up on Rebecca’s latest releases and upcoming novels, visit RebeccaYarros.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest Same-Day delivery Today 5 PM - 10 PM. Order within 7 hrs 5 mins",
            "$4.43 delivery Monday, February 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Told in alternating timelines, THE THINGS WE LEAVE UNFINISHED examines the risks we take for love, the scars too deep to heal, and the endings we can’t bring ourselves to see coming.Twenty-eight-year-old Georgia Stanton has to start over after she gave up almost everything in a brutal divorce―the New York house, the friends, and her pride. Now back home at her late great-grandmother’s estate in Colorado, she finds herself face-to-face with Noah Harrison, the bestselling author of a million books where the cover is always people nearly kissing. He’s just as arrogant in person as in interviews, and she’ll be damned if the good-looking writer of love stories thinks he’s the one to finish her grandmother’s final novel…even if the publisher swears he’s the perfect fit.Noah is at the pinnacle of his career. With book and movie deals galore, there isn’t much the “golden boy” of modern fiction hasn’t accomplished. But he can’t walk away from what might be the best book of the century―the one his idol, Scarlett Stanton, left unfinished. Coming up with a fitting ending for the legendary author is one thing, but dealing with her beautiful, stubborn, cynical great-granddaughter, Georgia, is quite another. But as they read Scarlett’s words in both the manuscript and her box of letters, they start to realize why Scarlett never finished the book―it’s based on her real-life romance with a World War II pilot, and the ending isn’t a happy one. Georgia knows all too well that love never works out, and while the chemistry and connection between her and Noah is undeniable, she’s as determined as ever to learn from her great-grandmother’s mistakes―even if it means destroying Noah’s career.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/Contemporary-Romance-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13354"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Entangled: Amara (February 23, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 448 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1682815668"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1682815663"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.35 x 1.2 x 8.1 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#484 in Books (See Top 100 in Books) #449 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 20,113 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Great and Precious Things The Last Letter Full Measures Eyes Turned Skyward Beyond What is Given Fall in love with Rebecca Yarros… Discover a moving story of family, betrayal, and just how far we'll go for those who need us most. A soldier falls in love through letters and returns home with a secret that could destroy his fragile new relationship. Overwhelmed by grief and responsibility, she wonders if she’ll find solace—or heartbreak—with the hockey player next door… She’s always played it safe, until a hot-but-reckless pilot saves her life…and turns it upside down. An attraction that pulls two roommates into dangerous territory now faces the ultimate test: the truth.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/05b8931f-261b-4975-8a1a-98fb4445d058.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3f3b93fe-cf7c-4a95-9bbb-211bd36951b5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2d6799ec-6a48-40f4-a7f6-ce999829ac6c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/381c7922-de39-4580-9546-afe5880f9206.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e6ee13cc-ddd6-4fbd-9cbc-a840bba0703e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7ee00848-8a3d-4def-b602-65d2a730d9ef.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b028e46f-aa96-41d1-9c59-148b3d3c0dd8.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8c6fcb90-9b70-40c6-8b15-58188a0950b5.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fb8c3f90-e2e5-4ee6-ab81-fd214d891b2b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d04a60c9-8385-47f4-9057-0815925c7fdb.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76fd2955-03bb-49b5-85e7-6c08e471d2c2.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Meighan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMBIJKCX6RQI2DSPWO6SPGPK4UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLHWGWHELN36Z?ASIN=1682815668",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars two beautiful stories",
                "reviewText": "📚𝐁𝐎𝐎𝐊 𝐑𝐄𝐕𝐈𝐄𝐖📚The Things We Leave Unfinishedby: Rebecca Yarros4⭐️In the past, we find Scarlett and Jameson falling in love in the middle of World War II. Their love story was so powerful and complicated. Scarlett and her sister, Constance, have dedicated themselves to the war despite their parents wishes, only further complicating what they want for their futures.In present day, Georgia and Noah are butting heads over turning her late grandmother's life story into a published novel. Noah is a popular romance writer with a big ego, so naturally he thinks he is perfect for the job. Georgia disagrees with him at almost every turn, but Noah is insistent that he will eventually win her over. Spoiler alert- he does. But Noah does the one thing he promised Georgia he'd never do- he hurts her.This one is actually really hard to review! There are two stories happening in two different timelines and I won't lie, at times it made my brain hurt. I would get invested in what was happening in one timeline just to be thrown back into the other. One thing I had to remind myself of was to lower my expectations a little bit. I loved In The Likely Event so much that I expected this one to hook me just as hard.Rebecca Yarros is a master at writing stories that stay with you. When I finished this one, I texted a few friends that it was \"nowhere as emotionally damaging as In The Likely Event\" but guess what happened the next day? I got in my car and started thinking about it again and the tears started flowing. I wanted so badly to figure out how RY was going to throw me for a loop that I didn't let myself feel the important and painful parts that made the story so beautiful. With each RY novel I read, I am finding it to be incredibly important to be patient and let everything come together.I texted @_bookstamandy_ an insanely long voice message around 77% with my theory of what was happening and I guessed it almost to a T. The clues were there and I was pretty pleased with myself that I picked up on them.—you'll find:📆dual storylines✈️WWII setting🇺🇸a brit x an american🗣️enemies to lovers📖book in a book",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brandy Thomas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVFHLZLCIRARNO5FG5F7QNNKNMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMZ906M6YZ0QC?ASIN=1682815668",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars I consumed this in less than 24 hours",
                "reviewText": "A captivating novel with intertwining love stories, compelling supporting characters, and a believable surprising twist that keeps the reader engaged. The author skillfully weaves together the various narratives, creating a rich and immersive reading experience. However, the frequent and at times unnecessary point of view shifts can be a bit distracting, impacting the overall flow of the story. Additionally, while the characters are well-developed, the exception feels like the FMC. I found the female lead a bit unlikeable. Despite these drawbacks, the novel is a four-star read, offering an engaging and emotionally resonant story that lingers in the mind long after the final page.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Clara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7MI6Q5W2AKYLGLNVHLX4CIUOXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IEHLSK5SD6DK?ASIN=1682815668",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Brilliant story",
                "reviewText": "\"I'm fine. I haven't teared up; it's all good,\" I told a friend while reading The Things We Leave Unfinished. Could this be the one Rebecca Yarros book that wouldn't make me cry? Guess what? I was wrong, and I should have known better. Because by the time I reached the last 20%, I was sobbing in public.The book follows two storylines four generations apart. The first occurs amid WWII when Scarlett meets American pilot Jameson Stanton as he volunteers for the Royal Air Force. Theirs is a timeless and hard-fought love with an unimaginable ending.The second storyline takes place 80 years later when Scarlett's great-granddaughter Georgia must approve the unfinished manuscript of her grandmother's love story, which will be completed by novelist Noah Harrison. Love is not on their agenda; they antagonize each other at every turn.The book's structure and writing are brilliant: the past timeline is told in the third person and reads as historical fiction, while the present is in the first POV and is a contemporary romance. The transitions between past and present are flawless, as the storylines intersect through Scarlett and Jameson's letters.What makes Things We Leave Unfinished a powerful book is that it focuses on the many forms of love, making its story universal. While heartbreaking, it also gives hope.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWZEFV536AEZDBVDCNHYG56XGSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31ET0CS8YNQ0V?ASIN=1682815668",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars GO FOR IT & GO IN BLIND!",
                "reviewText": "It is hard to put into words what this book did to me. It's been almost 24 hours and I am still reeling from all the emotions. I must admit this was one of the best going in \"blind\" books I could have ever chosen. I felt like I knew the characters or wished I had known them in person. It made me yearn for things (can't give too much away). All were lively, amusing, and distinct, and each faced their own demons. It's amazing how a writer can capture so much of what a character is going through as if you were the one going through it yourself. In some sense, maybe we all are. I do not know if I can do this book justice, but I would highly recommend it. Go in blind like I did. Sometimes the books we randomly choose have a way of being carried in our hearts and becoming a part of our soul. As well as becoming one of our favorites. Also, if you do happen to read it, make sure you also check out the audiobook as well. It is currently a free listen on Audible, and let me tell you, the narrators were phenomenal.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrea Loaeza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 19, 2023",
                "reviewTitle": "El mejor libro",
                "reviewText": "Este libro es de los mejores que he leído, lo recomiendo ampliamente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ksenia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 7, 2023",
                "reviewTitle": "Amazing!",
                "reviewText": "This is, hands down the best read of 2023 for me! I was so emursed from page one. It's a must read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sara",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 31, 2024",
                "reviewTitle": "Unexpected Ending Makes it Worth it",
                "reviewText": "Beautifully written, passionate love stories of two couples. No matter what you think during reading, the ending will be unexpected! :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "zowie dublin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 26, 2024",
                "reviewTitle": "Amazing Book",
                "reviewText": "This was book was amazing, highly recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fathima",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 25, 2023",
                "reviewTitle": "Haven't cried this much reading a book in a veryy long time.",
                "reviewText": "Loved it so much. The writing, characters, story everything was on point. I have lost count on how many times I cried while reading this. Would recommend it, hundred percent.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}