{
    "remaining_requests": 2214,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Remember-Me-Phillippas-Story-Ravenswood-ebook/dp/B0BFZX87BB",
    "body": {
        "name": "Remember Me: Phillippa's Story (A Ravenswood Novel Book 2)",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Remember-Me-Phillippas-Story-Ravenswood-ebook/dp/B0BFZX87BB",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81h2hQ8+dTL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mary Balogh",
            "link": "https://www.amazon.com/Mary-Balogh/e/B000APVMYI/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2050,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Can Lady Philippa Ware forgive the man who once shattered all her youthful dreams? Discover the passionate and heartwarming new novel on the redemptive power of love from New York Times bestselling author Mary Balogh.Philippa, elder daughter of the Earl of Stratton, grew up eagerly anticipating a glittering debut and a brilliant marriage. Then her brother caught their father out in a clandestine affair and denounced him publicly. The whole family was disgraced, and Philippa’s hopes grew dim, then were fully shattered when she overheard the dashing, handsome Marquess of Roath viciously insult her upon learning of her father’s identity. Only years later does Philippa find the courage to go to London at last to meet the ton. She is an instant success and enjoys a close friendship with the granddaughter of a duke. Only one man can spoil everything for her, but surely he will not be in London this year.The Duke of Wilby is nearing death and has tasked his grandson and heir, Lucas Arden, Marquess of Roath, with marrying and producing a son before it is too late. Lucas, who usually shuns London, goes there early in the Season in the hope of finding an eligible bride before his grandparents come and find one for him. He is instantly attracted to his sister’s new friend, until that young lady asks a simple question: “Remember me?” And suddenly he does remember her, as well as the reason why the daughter of the Earl of Stratton is the one woman he can never marry—even if his heart tells him she is the only woman he wants.Unfortunately for Philippa and Lucas, the autocratic duke and his duchess have other ideas and believe them to be perfect for each other. They will simply not take no for an answer. Telling Philippa the full truth is the hardest thing Lucas has ever faced, and the discovery of it will change them both before they discover the healing power of love.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BFZX87BB"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (June 20, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 20, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2796 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 365 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0349431582"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#42,633 in Kindle Store (See Top 100 in Kindle Store) #973 in Regency Historical Romance #1,040 in Regency Romances #9,621 in Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,050 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Becket Hampton Warren",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4O7YWEED6AI7LWYJCWTEXNNO6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14Z6RYDNWZ9Z3?ASIN=B0BFZX87BB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Remember Me is Deeply Satisfying",
                "reviewText": "As is uniformly the case, I opened this newest Mary Balogh novel’s cover with the full anticipation of a delightful read. As usual, I was not disappointed. Remember Me is not as heart-wrenching as some of her novels, the Survivors Club novels, for instance, with the setting (England at the time of the Napoleonic Wars) featuring as background rather than foreground (Remember Me is set in London just before the Battle of Waterloo, but only the heroine’s absent brother is currently engaged in military action). The war isn’t a character in this book.The tension between hero and heroine, the romance at the center of this novel, focuses on blurted words overheard rather than strife in the turmoil of martial conflict. Here, romance almost doesn’t come into full bloom because of a misunderstanding: careless, cruel words uttered by our hero and overheard and internalized by our heroine.What Balogh does so well is create stories that delve into what matters when two humans are swept into a budding romance, no matter the relative storm or calm of the story’s world. In some of her novels, her characters are involved in (or in the aftermath of) Big Conflicts (war, disfigurement, loss); in other books, like Remember Me, the conflict is on a much more immediate scale, involving only the two would-be lovers and rash words and misunderstandings based on behavior of their family’s previous generation.It is obvious that Lucas and Pippa will find love despite the poor example their respective parents, his mother and her father set for them. When Pippa asks Lucas the titular question four years after their initial contact, she stirs up more than just an embarrassing memory for Luc and a painful one for herself; she sets in motion a courtship that rushes breathlessly through the Ton’s bright, whirling spring season. Attraction plays a part, but grandparents bully and prod the couple towards to altar, not knowing the impediment that exists between them.The secondary characters are, as in every book by this wonderful novelist, delightful in their own right, from Pippa’s younger sister, Stephanie—who has always been Pippa’s friend and ally although she is much younger— and Lucas’s sister, Jenny—who despite being crippled and unable to participate fully in Ton events, becomes Pippa’s newest and dearest friend—to Lucas’s grandparents, the Duke and Duchess of Wilby—whose aforementioned forceful matchmaking and relentless meddling is both exasperating and funny and ultimately successful.Altogether satisfying to read, although quieter and less fraught than some of the other books this author has penned, Remember Me is a worthy addition to Mary Balogh’s canon. I hope novels giving both Stephanie and Jenny a chance at love are in the works, in addition to books centered around Pippa’s yet-unmarried brothers. I will buy them all, and read them with great pleasure.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Betty Stover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5QLTOTG67RXVVU46RFL2PYZYXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R90H1Z103EJ91?ASIN=B0BFZX87BB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Very well written and hard to put down.",
                "reviewText": "I loved reading it. Am going to order others of the series.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JKom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHQHFRCW4NDZVXPFTEI4L6WXX4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R132QS3UR5V6ZX?ASIN=B0BFZX87BB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Bk 2 of the Ravenswood series: Lady Philippa and the Marquess of Roath",
                "reviewText": "Mary Balogh is one of the best of the post-Georgette Heyer Regency genre. Her early short, \"The Temporary Wife\", is a book I rank as the best non-Heyer Regency (and which thankfully for later fans, was finally reissued after used copies started to climb into the $300+ range). Her family series on the Bedwyns, led by the icily arrogant Duke of Bedwyn, is one of my favorites, although I consider the prequel, \"A Summer To Remember\", not only an essential read to begin the Bedwyn series (and to understand the remarkable Freyja Bedwyn), but also her most perfect full-length novel.This story, \"Remember Me\", continues the saga of the Ware family, whose estate is Ravenswood. They are contemporaries of the Bedwyns, and know of them although they are none of them close friends. We do get a brief glimpse of Lady Morgan, the youngest Bedwyn who finds the ton infinitely boring (her story is \"Slightly Tempted\" by Balogh).Lady Philippa Ware, eldest daughter, is finally making her come-out after the scandal and tragedies that struck the Ware family (Bk 1, Ravenswood saga). She is (gasp!) twenty-two years old, almost old enough to be considered 'on the shelf' and 'an ape leader' – except that she is stunningly beautiful with a very, very large dowry.Despite those advantages, Pippa is surprisingly modest. She hides a secret, an incident years ago that devastated her self-confidence and was magnified by the catastrophes that broke apart the Ware family. But when the ancient and autocratic Duke of Wilby decides she is the perfect match for his bachelor grandson and heir, Lucas Arden, Pippa is utterly flummoxed.Because of all the eligible gentlemen in London, the one man she absolutely does NOT want to marry – or even talk to – is Lucas Arden, Marquess Roath. Except....she does like his delightful sister, Jenny. And his aunt, Lady Catherine. And his cousin Sir Gerald. And well, to be honest she might even be on her way to loving that slyly manipulative Duke.But not the Marquess. No matter how handsome, no matter how much she admires his sense of humor and kindness to his crippled sister. No, this is the one man she could never, ever even consider loving.There is little angst in the Pippa/Lucas romance. It has the feel of inevitability, and fulfills all the reader's expectations.What was a surprise to me was the secondary romance, and the beauty of its own ending. It is that pathos which made this a worthwhile read, giving stock characters a much-needed depth. I won't say that Balogh's creative well has run dry, but her characters in too many of her later novels are beginning to lack a distinctive personality. I still enjoy her novels, but I have not kept any of her more recent books for my personal collection. YMMV.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHU6LFKXGUJCZ7N2EWA7UCHMSCMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGAIUUPLGA9HU?ASIN=B0BFZX87BB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Remember Me",
                "reviewText": "A wonderful addition to the Ravenswood series! I love the characters as well as the continuation of the story. Looking forward to the next one in the series. Can't arrive soon enough!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grammie Lynda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6NUU6XTES2G6TI73OHCX6ZLTOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R274HI69XPMU4G?ASIN=B0BFZX87BB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars great as always",
                "reviewText": "A little predictable.But lovely characters and sweet love story.Left you wanting to know the rest of the storiesEspecially Jennie and Nicholas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roberta",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7U3HW5SQOYXZGHM62TXHOK77MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R201HASDO0M8F1?ASIN=B0BFZX87BB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "5.0 out of 5 stars All about love",
                "reviewText": "Words spoken and overheard hurt deeply, resulting in several years of pain for Philippa. When she encounters the man who unknowingly spoke the hurtful words, she confronts him. He can’t share the story behind the words, or can he?Cast together repeatedly, their families become entwined and expectations arise that they will form a union, against Philippa’s desire—or so she thinks. An engaging story with intriguing characters that I thoroughly enjoyed and highly recommend!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne Miskey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPA6BWQUEPGFCVK7LEVCOO3PD6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH6DC3E5MC3L3?ASIN=B0BFZX87BB",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 24, 2023",
                "reviewTitle": "3.0 out of 5 stars Going down hill.",
                "reviewText": "Balogh has been one of my favorite authors for years. I've read every single one of her books. I have found the series in the last few years to be not nearly as solid as previous ones, and this was no exception (although I enjoyed the 1st one in this series much more). The grandfather that everyone loves(!) is truly a tyrant and showed real cruelty when the hero's parents died and then manipulated everyone afterward.The hero is spineless and uninteresting. Okay, he's handsome with red hair, but other than that, he lacks personality. I would have liked him so much better if he actually had a spine. Also in her later books Balogh shoves in way too many characters - obviously to lead to new stories - but it all becomes super confusing. Sad, but I'm losing my love for this author.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Billytoast",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMKEBOLZN7BW3MO74EN7YFJTRJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QEJ5DZMCRX14?ASIN=B0BFZX87BB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "4.0 out of 5 stars I love Mary Balogh!!",
                "reviewText": "A good story, not as detailed as some of her previous novels but a good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 13, 2023",
                "reviewTitle": "Outstanding",
                "reviewText": "A wondrous mixture of laughter and the reality of tragedy. Beautiful novel that I highly recommend. Another amazing story by a timeless author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathryn Revell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 4, 2024",
                "reviewTitle": "Remember Love x2",
                "reviewText": "Remember Me is the story of Luc & Pippa, but also by the last chapter, the story of Percy & May, Luc's grandparents.Luc inadvertently, unwittingly & uncharacteristically destroyed Pippa's confidence & therefore her bright future when they were both teenagers. Now they're both on the marriage mart of the Ton & Luc's unstoppable grandparents have decided Pippa is the perfect for for him, & everyone except he & Pippa agrees, because no one knows about what happened years ago (except her brother, & even he doesn't know why). The Dukal matchmaking is very amusing & the ending has me crying buckets on every reading. A heartwarming love story (or two).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Happily Hopeless Romantic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 1, 2023",
                "reviewTitle": "Less steam, more heart.",
                "reviewText": "For the same reason that I preferred Queen Charlotte to Bridgerton Series 1 and 2, I would recommend Miss Balogh’s latest offering, even though it is very different to her earlier novels. There is less bedroom action and conflict resolution but more insight into solving difficult situations and building lasting love. Lucas is physically attractive but younger than the usual hero at twenty-six and without the swagger and pride often present in the alpha male. Both he and the lovely Philippa carry emotional wounds but are willing to deal with them honestly. They both value “family” and love well. Their road to happiness together is bumpy at first and then a gentle journey.While Miss Balogh often includes elderly relatives, Luc’s grandparents play a special role in this book and their love story is one to last a lifetime.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sejuti",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 28, 2023",
                "reviewTitle": "Beautiful",
                "reviewText": "Every time I read a Mary Balogh, I think it could not be any more beautiful. Philippa and Lucas’s journey was joyful, peaceful and it soothed the soul. The love between Percy and May was so precious. I loved every little dialogue. Some were so profound and some were so very true. I fell in love with them again and again. Absolutely gorgeous novel. But can a novel be gorgeous?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Booklover130",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 21, 2023",
                "reviewTitle": "A fresh storyline in a lovely slow-burn romance",
                "reviewText": "A very enjoyable read. I liked this one more than the first book in the series, and now I look forward to the release of Book 3, Jenny and Ben's story, Always Remember.The plot of this book was not your usual cliche HR story. It felt like a fresh storyline, which was great. It took place in London around the time of the great Battle of Waterloo, before, during and after. One of the secondary characters was fighting there, but it was mostly just a background to this story. It felt historically accurate, though, and gave a richer feel to the story. It must have been an incredible time to live through, confusing, frightening, and ultimately victorious but still at an enormous cost to both sides, which the writer acknowledges.A nice aspect of the story was the elderly Duke and Duchess of Wilby, Luc's grandparents. They are old and frail, but desperately want to live to see Luc marry and have a child of his own. Their long marriage and their devotion to each other was a charming addition to the book.A nice little surprise was a couple of fleeting mentions of the Duke of Bedwyn and his sister Morgan, who star in Balogh's Bedwyn series. (Slightly Dangerous, the duke's story, is one of my top fav HRs). I love that Balogh did this little cross-sharing with perhaps her best series (IMO).Remember Me is a slow-burn book, and the whole story is paced quite slowly. But it moves along steadily and builds to a truly wonderful, emotional concluding section. I don't often cry when reading, but I did this time, to my surprise.Overall, a well-written, period-accurate and emotional historical romance. Thanks heavens Mary Balogh is still writing :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}