{
    "remaining_requests": 2055,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Midnight-at-Blackbird-Cafe-Novel/dp/1250198615",
    "body": {
        "name": "Midnight at the Blackbird Cafe",
        "price": "$10.61$10.61",
        "originalPrice": "",
        "rawPrice": 10.61,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Midnight-at-Blackbird-Cafe-Novel/dp/1250198615",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/511TwmiAu9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31OAlaUS3 L.jpg",
            "https://m.media-amazon.com/images/I/51zQtP5k63L._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Heather Webber",
            "link": "https://www.amazon.com/Heather-Webber/e/B001IQW8BE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 9413,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Full of family secrets, undeniable charm and that particular touch of magic so often found in the South, MIDNIGHT AT THE BLACKBIRD CAFE is a heartfelt and redemptive tale of a daughter looking to move forward in the place her mother couldn’t wait to leave behind. Heather Webber creates a town as dynamic and real as her characters―and a story so compelling that it will stay on readers’ minds long after the final page. I savored every word.\" ―Kristy Woodson Harvey, national bestselling author of Slightly South of Simple \"Midnight at the Blackbird Cafe is an enchanting gem of a novel, brimming with charming characters, heartwarming connections, old secrets, and a southern setting that makes you want to move there. As refreshing as a glass of blackberry tea, this is truly magical realism at its best!\"--Karen White, New York Times bestselling author \"Family, fate, and magic intertwine in this endearing Southern tale of long-held secrets, homemade pie, and building one's future from the remains of the past. A tantalizing, delicious delight, through and through. Heather Webber writes with so much detail and imagination that I’ll be craving some Blackbird Cafe pie―and the comfort that comes with it―for a long time to come.\" -- Kristin Harmel, international bestselling author of The Room on Rue Amélie and The Sweetness of Forgetting About the Author HEATHER WEBBER is the national bestselling author of more than thirty novels--including Midnight at the Blackbird Cafe, the Lucy Valentine novels, and the Nina Quinn Mysteries--and has been twice nominated for an Agatha Award. She loves to spend time with her family, read, drink too much coffee and tea, birdwatch, crochet, watch cooking competition and home improvement shows, and bake. Heather lives in southwestern Ohio and is hard at work on her next book."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 7 hrs 21 mins",
            "FREE delivery March 3 - 13 on orders shipped by Amazon over $35",
            "Or fastest delivery March 2 - 10",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 15 hrs 21 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "THE USA TODAY BESTSELLER Heather Webber's Midnight at the Blackbird Cafe is a captivating blend of magical realism, heartwarming romance, and small-town Southern charm.Nestled in the mountain shadows of Alabama lies the little town of Wicklow. It is here that Anna Kate has returned to bury her beloved Granny Zee, owner of the Blackbird Café.It was supposed to be a quick trip to close the café and settle her grandmother’s estate, but despite her best intentions to avoid forming ties or even getting to know her father’s side of the family, Anna Kate finds herself inexplicably drawn to the quirky Southern town her mother ran away from so many years ago, and the mysterious blackbird pie everybody can’t stop talking about.As the truth about her past slowly becomes clear, Anna Kate will need to decide if this lone blackbird will finally be able to take her broken wings and fly. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Forge Trade; Reprint edition (January 7, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250198615"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250198617"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.4 x 1.05 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32,407 in Books (See Top 100 in Books) #447 in Magical Realism #1,390 in Women's Domestic Life Fiction #1,647 in Contemporary Women Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 9,413 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Julie Galloway",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMDETWL7GCAKTJIOEU2EXBJV7HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QQ57DJMI2BS?ASIN=1250198615",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 8, 2021",
                "reviewTitle": "5.0 out of 5 stars Blackbird pie that gives you dreams from those that have passed!",
                "reviewText": "After seeing multiple positive reviews over and over again, I took the bait and read this and I am SO GLAD THAT I DID!!!\"All of you will always be in my heart, and part of me will always be in yours. That's a damn good legacy, if you ask me.\"This book is a mixture of grief, love, friendship, magic, and forgiveness. \"Grief can change a person to the point where they become someone they don't know, or even like very much.\"Anna Kate Callow has come to the town of Wicklow, Alabama since her Granny Zee died. Part of Zee's will stated that Anna Kate could inherit the Blackbird Cafe, if she came to Wicklow and ran it for at least 60 days. And Granny Zee knew EXACTLY what she was doing!!!Anna Kate is planning on becoming a doctor. However, when Zee dies, she has to go run the Blackbird Cafe. Not knowing what to expect since her mother ran off with her (she was pregnant with her) right after her father died, Anna comes to the town of Wicklow. Her father's family, the Lindens', blamed her mother Eden for her father's death. Even though the car accident was ruled an \"accident\", the Linden's, specifically Seelie, insists that it was no accident, and Eden murdered her son AJ.Anna dives head first into running the Cafe and figuring out what what Granny Zee put in the \"Blackbird pie\" to make it taste so good. Ewwwwww....blackbird pie? But the pies aren't made with actual blackbirds, but rather various fruits such as blueberries and blackberries and a \"secret\" ingredient Anna must figure out. After eating the pie, you have dreams that night from loved ones that have passed on that provide messages. On top of that, the rare birds come at midnight and put on a show that soon begins attracting bird watchers from all over.This was a beautiful, magical realism southern book. I loved all of the characters from Mr. Lazenby banging on the cafe's door every morning wanting his pie in hopes of receiving messages from his late wife (completely oblivious that Pebbles is in love with him wanting him to get over her), to Faylene who knows everyone and everything about everyone and is always playing matchmaker, to the mysterious gray cat that keeps appearing out of nowhere leading Anna on various escapades.Then, of course there is love!!! Lots and lots of love. If you are looking for a heartfelt book about overcoming hardships and grief, dealing with family drama, love, some good cooking and a little bit of magic, this book is for you.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "andrea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBBIP67K44AI4DPM2PE26C7QPNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MG75SEJKM2YA?ASIN=1250198615",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Family, light magic",
                "reviewText": "The story is about family and two main characters Anna Kate and Heather. There are alot of characters so I suggest you keep track at the start, it helps. The story is set in a small quaint town of Wiklow, Alabama. The description makes you want to go there.When Anna's grandma Zee dies, She goes to the funeral. Thinking she will sell the Cafe and move on to college towards the end of the summer. However, oh, the family drama!Natalie returned to Wiklow because her husband died of a tragic accident and she has an adorable child Ollie. She is easily one to love. Natalie goes to live with her mom and dad, Doc and Seely. However, the mom has not gotten over the death of her son AJ and how he died.The story has so many emotional topics described well such as forgiveness, grief, death, love, independence, and moving on from the past.The book has many long sentences which appears to be a quote about life and how to live it. They give you pause to takeaway and agree.Additionally, there is a light touch of magic connected to the Cafe, the pies that are made by Anna Kate and the blackbirds which appear at midnight. Can it all really bring a connection with the dead love ones.I totally enjoyed the story even though at times the writing seems to get stalled. I enjoyed the characters but there are those you always question. The things I would have liked expanded is more information about Grandma zee. Also an expansion of the few love interests that develop but at the end of the story. Surely, there will be a follow-up to this book so we know what happens?A good one to get lost in, keep track of who is who, and have some pie!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa C. Alexander",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRC3QUF3XM3JIXUISWSQB42NI3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KFIDHWRJ27IX?ASIN=1250198615",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2021",
                "reviewTitle": "5.0 out of 5 stars Amazing southern fiction with just the right amount of magic",
                "reviewText": "This book is everything I want my writing to be. Immersively descriptive. Emotional. I even teared up over the death of some zucchini plants.The protagonist is Anna Kate Callow who came to Wicklow when her grandmother Zee passed away and left her the Blackbird Cafe. Anna Kate inherits only if she spends two months running the cafe. She has help in Len and Bow, two mysterious people who showed up over 20 years before and never left.Despite being Zee's granddaughter, Anna Kate has never stepped foot in Wicklow. Her pregnant mother left after Anna Kate's father died in a car crash and she was accused of murder. Her mother wouldn't talk about Anna Kate's father, what happened, or anything to do with Wicklow and its denizens. But Anna Kate learned about the town and the cafe through her grandmother's fantastic stories about blackbirds and magical pies that enable people to get messages from loved ones who have passed on.Anna Kate's father was the son of the town doctor. His wife Seelie believes Anna Kate's mother murdered her son. Fearing they would try to get custody of Anna Kate, no one ever told them that Anna Kate's mother was pregnant when she left town.Now Anna Kate is taking over the cafe, and the whole town is talking. Long-buried secrets are unearthed, families and friendships are forged, and Anna Kate gradually uncovers the mystery behind the pies and the blackbirds, discovers a new family, and makes peace with her life.I unabashedly loved this novel. It's set in a fictional Alabama town, and every page oozes with the sights, sounds, smells, and even the textures of the south. I grew up in small town west Tennesse, and this book evoked the best of those years.My own novels are set in the South, but I have a lot to learn to make them as immersive and evocative as this amazing novel.The novel isn't perfect. I struggled with the multiple First Person POV, a POV I, personally, do not like. I understood why she made the POV choices she made, and at one level I could appreciate her technique. I simply don't like First Person Multiple. I honestly didn't see anything here that would have been lost if the novel had been in close Third Limited.That was, overall, just a personal preference and not really a weakness of the book, so I gave it a solid 5 stars. Beautiful-but-still-accessible writing, deeply drawn characters, and a seamless injection of magic. I definitely recommend the novel and hope someday I can write something equally amazing.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGFZ7CILF3AQBBCAXNBGBZIQKEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGZRA22FFRANQ?ASIN=1250198615",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Great story!",
                "reviewText": "Great story! It felt like I was in the small town of Wicklow. I am ready to read more by this author.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shivz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 22, 2021",
                "reviewTitle": "Sweet and tender! A bit flaky too just like pie",
                "reviewText": "Such a tender and sweet little tale of mystical birds and folklore. Of grief , secrets and forgiveness all woven together with the threads of family, friendship and good old nature.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "matteo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 8, 2020",
                "reviewTitle": "Ottimo",
                "reviewText": "Un regalo Quindi non saprei",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LEP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 30, 2019",
                "reviewTitle": "A lovely book",
                "reviewText": "A lovely magical book of sadness, loss and family, love and redemption. Very like Sarah Addison Allen's book and even The Sparrow Sisters books in it has that added ingredient of magic. 24 year old Anna Kate Callow has returned to the little American town of Wicklow in order to settle her late grandmother's affairs and undertake the terms of her will which left Anna Kate her grandmother's Blackbird Café. Anna Kate has never been to Wicklow before as her mother Eden refused to return to the small town because of the Linden family who accused her of the murder of their son AJ who was the love of Eden's life. In Wicklow Anna Kate has to deal with the animosity of Seelie Linden, the curiosity and friendship offered by regulars of the Blackbird Café, and meets Natalie Linden Walker and her adorable daughter Ollie. Also, there is the legend of the famous blackbird pies and the mysterious flock of blackbirds who only sing at night. Lovely book, I hope this author writes others.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monika",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 1, 2021",
                "reviewTitle": "A feel good story",
                "reviewText": "Absolutely loved this novel. Made me feel all warm and fuzzy. Such a feel good story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 7, 2024",
                "reviewTitle": "A quick read that offers nothing special",
                "reviewText": "Heather Webber spins a tale about pies, 24 blackbirds and a midnight chorus that when threaded together have, it is suggested, the ability to brings messages from the dead to those who mourn their passing.The premise is a good one, the characters reasonably well-crafted, but I struggled to find little to either engage or keep my interest. There are few surprises and in fact little imagination is needed to see how things will shake out in the end.A pleasant read that filled a few hours, but it’s unlikely I’ll be in the market for any of her other books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}