{
    "remaining_requests": 2256,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Until-I-Get-You/dp/B0BZTCT323",
    "body": {
        "name": "Until I Get You",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Until-I-Get-You/dp/B0BZTCT323",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41VXGmFJAmL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Claire Contreras",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Claire+Contreras&search-alias=audible"
        },
        "brand": "Claire Contreras&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 15386,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "My reputation at Fairview University preceded me. I was the projected number-one pick in the NHL draft and the fan favorite at the rink. People wanted to be me or be with me.Except for Lyla James Marichal.She didn't look at me like I was her next meal. She eyed me with disdain.Instead of vying for my attention, she ignored me and pushed me away.She was completely unattainable, and I became obsessed with her.When I finally got her, it felt like I was on top of the world. I was going to help the team win another championship, going into the draft, and had Lyla by my side.And then, without warning, she left me.Vanished.It took me three bitter, angry, long years to find her, but I did, and now she owes me a lot more than just an explanation.Three years ago, she ruined my life.Now, I was going to become her worst nightmare.Tropes: hockey romance, new adult, obsessed/possessive hero, boy falls first, #JP hero, dark themes (content warning in the book) Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b?ie=UTF8&node=23"
            },
            {
                "name": "Romantic Suspense",
                "link": "https://www.amazon.com/Romantic-Suspense-Romance-Books/b?ie=UTF8&node=13389"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "15 hours and 12 minutes"
            },
            {
                "name": "Author",
                "value": "Claire Contreras"
            },
            {
                "name": "Narrator",
                "value": "Joe Arden, Kasha Kensington"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 29, 2023"
            },
            {
                "name": "Publisher",
                "value": "The Wicked Pen"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BZTCT323"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,374 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #36 in Romantic Suspense (Audible Books & Originals) #38 in Billionaires & Millionaires Romance #276 in Romantic Suspense (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVX5WQDNZQUIGJNKRICUO6DMKMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A2A5LOTXKFJ5?ASIN=B0BZTCT323",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Trauma, Drama, and Love",
                "reviewText": "I struggled at first and wasn't sure if I was going to like this story but then things started to unravel and I got sucked in. Lyla is a bada$$ FMC and Lachlan reminds me a little of Carter Beckett with a touch more obsessive tendencies (damn those hockey boys lol). Lots of trigger warnings but I'm good with that. There's trauma, drama, suspense, a little violence, some craziness, and a whole lot of love. I highly recommend this book and I'm excited to read what else this author has to offer!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AshlanAshlan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSB6V5HMA5OAIBG7HCESD5FWRCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJSMYNH460BG5?ASIN=B0BZTCT323",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Until I Get You",
                "reviewText": "Y’ALL. I have seen so many mixed reviews over this book but I actually really really liked it. What an absolute emotional rollercoaster! It’s been awhile since I’ve read a suspense-focused story. I loved the plot, the characters, the ✨drama✨. This book is a dark romance, and some content may be triggering, however while this story was emotionally-devastating, it also featured a very raw and heartwarming romance.While this book is coined a “hockey romance”, hockey wasn’t actually a huge factor to the story. However, this really does not deter how enjoyable it was to read. The characters were super genuine for me. Our characters are put into an insane situation, and this story features not just how trauma can shape someone but also what it looks like to overcome it. This story is about the beauty in strength. This story is gut wrenching but I LOVED these characters.If you’re looking for a emotional DARK romance that features:✨ love at first sight✨ second chance romance✨ obsessed hero✨ TRAUMA✨ “touch her and die” vibes✨ revenge✨ mental health repThen this story is for sure for you!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71hexOsFPDL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebecca",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6MF6DWXT7CV2C7TTUQVEXDL62Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DDX4XXJOM11E?ASIN=B0BZTCT323",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars so good!",
                "reviewText": "This is my first book I’ve read by Claire. I must say I am so glad I took a chance and ventured out to someone new! This book is amazing. From the storyline to the side characters to the main characters. This book has it all. I read it in basically one day. Now! On to my second book by Claire! I can’t wait!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jane Bibliophile",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECY3SZUOO3TUZ5BQD2LI6GVDDXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE0MNVXUAL90C?ASIN=B0BZTCT323",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars the newest Claire Contreras fan",
                "reviewText": "Title: Until I get youAuthor: Claire ContrerasTagline: “3 years ago she ruined my life, now I’m going to ruin hers”Genre: romantic suspense/sports romanceTropes: he falls first, touch her and I kill youRating: ⭐️⭐️⭐️⭐️⭐️What it’s about: It’s the improbable love story of Lachlan and Lyla. Their story was instant like a match to a can of gasoline, there was no stopping it and it was more dangerous than either of them realize.What I loved: the writing sucked me in immediately. I’m mentally beating myself up for not reading Claire Contreras sooner. Now I’m on a deep dive into her books! The chemistry was off the charts for Lachlan and Lyla. I also loved the angst in the middle when they’re apart. I love love love love the touch her and you die trope and this one was just ✨ chefs kiss ✨My thoughts: i loved these characters so much I didn’t want the book to end. I immediately signed up for Claire Contreras email list just to get the bonus scene and it did not disappoint. I think the best sign a book is good is when you never want it to end and in this case it was very true. This book and author are my new favorites!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashli Lyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHROXYZ54UUDT6D3YW3Q6BQ5GC2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LPH2IAJATWQE?ASIN=B0BZTCT323",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "3.0 out of 5 stars It’s Okay",
                "reviewText": "It’s weird. The book itself is choppy and full of layers that make it almost tedious. There is so much unnecessary information and then not enough necessary information. The character development is seriously lacking and slightly frustrating. They’re basically the same people. They never lose their childish antics from college. Kudos to Lyla for wearing the wire and getting her own evidence. But it’s also seriously unrealistic that nothing could have been done to prevent this entire book. Also, there is only two hockey scenes. Kind of annoying. As for Lach’s stalking, it’s basically non-existent. Everything you think you’ll get from this book, you won’t get it. It’s also way too long for the story itself. Overall, this is a college romance with an arrogant jerk and an emotionless chick. She “HAS” to leave and it takes him three years to find her. He’s still a jerk, but much more so. They guilt trip and manipulate one another and then it’s a HEA with a cheap and easy sense of “justice”. It’s not bad, but it’s not great.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "crain",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKKCNELBMN3JP757AZUNUE6X2BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LO7LUTZ2Z3YE?ASIN=B0BZTCT323",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "4.0 out of 5 stars Loved it!",
                "reviewText": "I absolutely loved this one! I wasn't sure where it was going at first because the prologue didn't have a time stamp on it and I wasn't sure when it took place, and I was afraid at first that Lachlan was the stalker in a bad way. But it all worked out!I loved these characters! They were strong and lovable and compelling and heartbreaking. I loved getting to see their struggles and triumphs and see their characters grow and learn and become happy. Their Present timeline was impeccably done with the anger on his side and the sadness on hers until they discovered each other's secrets and why they felt that way. The side characters were amazing! I loved Marissa and Prescott and Banks! I really want stories for all of the side characters and the other hockey players!The only reason this isn't getting 4.5 or 5 stars is because there were times that the writing felt lackluster and like I was being told things instead of experiencing them with the characters and it took me out of the story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sabrina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 23, 2023",
                "reviewTitle": "perfect!!!",
                "reviewText": "I loved this book. It has everything and more. The characters are amazing.I’m going to miss them!!! I would love to read more books about them ❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hayley Giroux",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 27, 2023",
                "reviewTitle": "Dark & twisty in all the right ways!!",
                "reviewText": "What an amazing read! This book surpassed every expectation I had.It had it all, from romance to steam to angst and suspense. Claire Contreras takes you down a dark and twisty road that no hockey romance I’ve read has gone down before.Lyla and Lachlan draw you in from the very beginning, with their traumatic and emotional histories that have made them who they are as college seniors. Then, part two of the book takes place 3 years later. This is where you get into more of the mystery and suspense that’ll have you unable to put this book down. Sprinkled throughout are some amazingly written, hot and steamy scenes, and it’s finished with the perfect HEA.This was the best emotional rollercoaster I’ve been on in a while, and I loved every bit of it!🏒 College Sports Romance🏒 Trauma & Tragedy🏒 Mystery & Suspense🏒 Possessive & Protective MMC🏒 He Falls First🏒 Second Chance🏒 Steamy scenes",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MelvinMelvin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on December 6, 2023",
                "reviewTitle": "Skadad på flera sätt",
                "reviewText": "Plast har lossnat från omslaget av boken, toppen och botten av boken ser både använda och slitna ut & och det ser som någon har målat på ett papper och använt boken som ett underlag",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61a9uygVW+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71q+5g8qy6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "May",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 18, 2023",
                "reviewTitle": "I loved it!",
                "reviewText": "ARE YOU KIDDING MEEEEEE!!! This book had me on my knees. My heart!Ok so. I had read 2 comments saying it took a while to have action and, personally, I got sucked into it super quickly though I do agree, it got slow for a little while, like, 3-4 chapters?The story line was so well thought out and everything/everyone was introduced perfectly. Lyla’s feelings and angst and anxiety radiated through the book. Lachlan’s anger and obsession was the same. To me, I couldn’t escape relating to them and feeling what they were feeling. They made me cry and laugh and love them too.Even the side characters were so present, nothing felt unfinished to me when I sadly had to turn the last page.It is well written, the pace of the story was perfect (yes it got slow for a few chapters but trust me, it’s necessary for what happens next as it’s a whirlwind. You need to take a breath babe!), the characters are easy to get attached too.Now, beautiful readers, read the warnings! Especially the last one because it gets difficult. Keep your mind safe :) and thank you Claire Contreras for an excellent book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DISHA SINHA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 28, 2023",
                "reviewTitle": "Captivating and Interesting",
                "reviewText": "This is amazing read. Although I felt it was a bit stretched at the second half. Nevertheless it was good book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}