{
    "remaining_requests": 2322,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Icebreaker-Novel-Maple-Hannah-Grace/dp/1668026031",
    "body": {
        "name": "Icebreaker: A Novel (1) (The Maple Hills Series)",
        "price": "$11.32",
        "originalPrice": "$17.99",
        "rawPrice": 11.32,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Icebreaker-Novel-Maple-Hannah-Grace/dp/1668026031",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41UE7tGCsTL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51 Ll4BRNoL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Hannah Grace",
            "link": "https://www.amazon.com/Hannah-Grace/e/B0B6CRSKWX/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 67675,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Sweltering chemistry, sizzling banter and swoonworthy romance. Icebreaker melted me head to toe.\" —Elena Armas, New York Times bestselling author of The Spanish Love Deception About the Author Hannah Grace is an English self-labeled “fluffy comfort book” author, writing predominantly new adult and contemporary romance from her home in Manchester, England. When she’s not describing everyone’s eyes ten-thousand times a chapter, accidentally giving multiple characters the same name, or using English sayings that no one understands in her American books, you can find her hanging out with her husband and two dogs, Pig and Bear. Excerpt. © Reprinted by permission. All rights reserved. Chapter One: Anastasia Chapter One ANASTASIA “AGAIN, ANASTASIA!” If I hear the words again and Anastasia together in a sentence one more time, it might be the thing that finally tips me over the edge. I’ve been on the edge since I woke up this morning with a hangover sent directly from the pits of hell, so the last thing I need right now is more grief from Coach Aubrey Brady. I focus on suppressing my annoyance, like I do every training session when she makes it her mission to push me to my limits. Rationalizing it’s her dedication that makes her such a successful coach, I decide throwing my ice skates at her is something that should stay in my imagination. “You’re being sloppy, Stas!” she yells as we fly straight past her. “Sloppy girls don’t get medals!” What did I say about not throwing skates at her? “Come on, Anastasia. Put in some effort for once.” Aaron snickers, poking his tongue out at me when I shoot him a cold glare. Aaron Carlisle is the best male figure skater the University of California, Maple Hills, has to offer. When I was offered a spot at UCMH and my skating partner wasn’t, Aaron was luckily in the same position, and we became pairs. This is our third year of skating together and our third year of getting our asses kicked. I have a theory that Aubrey is a Soviet spy. I don’t have any evidence, and my theory isn’t well developed. Developed at all, actually. But sometimes, when she’s screaming at me to straighten my spine or lift my chin, I swear a slight Russian accent slips out. Which is peculiar for a woman from Philipsburg, Montana. Comrade Brady was a figure skating superstar in her heyday. Even now, her movements are delicate and controlled, and she moves with such grace it’s hard to believe she can shout as loud as she does. Her graying hair is always pulled back into a tight bun, which accentuates her high cheekbones, and she’s always wrapped tight in her signature faux-fur black coat, which Aaron jokes is where she hides all her secrets. The rumor is she was supposed to go to the Olympics with her partner, Wyatt. However, Wyatt and Aubrey were practicing those lifts a little too often, and she ended up holding a baby instead of a gold medal. That’s why she’s been in a bad mood since she started coaching twenty-five years ago. “Clair de lune” fades as Aaron and I finish our routine nose to nose, our chests heaving against each other as we try to catch our breath. When we finally hear a single clap, we move apart and skate toward what will undoubtedly be the source of my next headache. I haven’t even stopped moving when her green eyes lock on me and narrow. “When are you going to land your Lutz? If you’re not going to deliver, it needs to come out of your long program.” Aside from Brady, successfully doing a quadruple Lutz and not landing on my ass is the current bane of my existence. I’ve been practicing for God knows how long, but I can’t quite manage to nail it. Aaron can execute it flawlessly, which is why I convinced the choreographer to put it into our routine in the first place. Pride is a foolish thing. It’s incredibly foolish when it comes to figure skating, since when you get it wrong, you bounce your face off solid ice. I’d take face-planting over the annoying, fake-disappointed face Aaron pulls anytime it’s suggested we take it out. “It’s coming, Coach,” I say with as much fake enthusiasm as possible. “I’m getting there; it’s not perfect yet, but I’ll keep practicing.” It’s a minor lie, a harmless one. I am getting there. What I’ve failed to mention is I’m only getting there off the ice, specifically when I’m attached to equipment that helps me get there. “She’s getting there,” Aaron lies, throwing an arm around my shoulders. “Just a bit longer, A.B.” It’s nice for Aaron to be on my side and show a united front to KGB Aubrey. What he says in private is that the only way I’m going to pull it off is if I start doping and build a time machine to get my prepuberty body back. She mutters something inaudible and waves us off flippantly. “I’ll see you two back here tomorrow, and if you could both not be hungover, that would be great. I’m fairly certain eating Kenny’s before training isn’t going to get either of you onto the Olympic team. Understood?” Shit. “Yes, Coach,” we say in harmony. Aaron is staring at his phone, waiting for me in the lobby when I finally exit the women’s locker room. “I fucking told you she’d know.” I groan, swinging my bag toward him as soon as I’m close enough to hit him in the stomach with it. “I didn’t even have anything!” He grunts at the impact, tugging the bag from my hands and flinging it over his shoulder. “The woman has the nose of a bloodhound.” Like most things in life, skating is far easier when you’re a man because nobody is picking you up and launching you across the room twice a day. Freshman year, I gained the freshman fifteen. Well, it was more like the freshman five, but Aaron said I was getting too heavy to lift, so I haven’t put on an ounce since. I try to stick to my meal plan religiously, with the odd party here and there to keep me lucid. My best friend’s twenty-first birthday yesterday was the perfect opportunity to let loose a little, even if it did mean braving Brady with a hangover. We climb into Aaron’s new G-Wagen, the latest guilt gift from his adulterous but wealthy father, and head home. Aaron and I decided it would be cool to live together, with my best friend, Lola, at the end of freshman year. Our schedules are similar, and our lives revolve around skating, so it made sense. Aaron takes the turn onto Maple Avenue and looks over at me while I rummage through my purse for my most prized possession. “What does the planner say you’re doing tonight?” I roll my eyes, ignoring his teasing tone. “Getting laid.” “Ew,” he says, the tip of his nose wrinkling as he grimaces. “It’s bad enough you plan what time you sleep and eat, but do you need to plan having sex?” He’s not lying about the sleeping and eating thing—every minute of my life is meticulously scheduled in my trusty planner, which my friends find equal parts hilarious and ridiculous. I wouldn’t necessarily say I’m a control freak, but I’m a woman who needs to be in control. There’s definitely a difference. I shrug, suppressing the urge to point out that at least I’m getting some, unlike him. “Ryan is a busy guy and I’m a busy girl. I want to see him as much as I can before basketball season.” Ryan Rothwell is six feet six inches of pure athletic perfection. UCMH point guard and team captain, he’s as serious about his sport as I am, which makes for a perfect no-strings-attached situation. The added benefit is Ry is the sweetest guy, so we’ve become great friends through our mutually beneficial arrangement. “I can’t believe you’re still fucking around with him. He’s, like, double your size, how does he not crush you? No, wait. I don’t want to know.” “I know he is.” I giggle, pinching his cheeks until he bats me away. “Sorta the whole point.” Most people assume Aaron and I are more than partners, but we’re more like siblings. It’s not that he isn’t good-looking, we’ve just never had any romantic interest in each other. Aaron is much taller than me and lean like a dancer with his sculpted, muscular body. His black hair is kept short, and I swear he wears mascara because his sky-blue eyes are framed with the darkest, jealousy-inducing lashes, contrasting prominently against his pale skin. “I officially know too much about your sex life, Anastasia.” Aaron can’t decide if he likes Ryan or not. Sometimes he’s cool with him and Ryan gets to see the Aaron I see—the one who’s fun to be around. You’d assume Ryan had personally ruined Aaron’s life or something the rest of the time. Aaron can be so abrupt and harsh that it’s embarrassing. It’s unpredictable, but Ryan brushes it off and tells me not to worry about it. “I promise to not talk about it for the rest of the drive home if you promise to give me a ride to Ryan’s later.” He contemplates for a minute or so. “Okay, deal.” LOLA LOOKS UP FROM THE salad she’s stabbing aggressively with her fork and huffs. “I’m just saying, whose dick is Olivia Abbott sucking to get the lead role for the third year in a row?” I can’t help but cringe at her harsh words, but I know she doesn’t mean it. She was already feeling delicate this morning after the copious amounts of alcohol we consumed last night for her birthday, so today wasn’t the best day to find out she didn’t get the part she wanted. I’ve watched every show for the past two years, and Lo knows as well as I do, Olivia is an exceptionally talented actor. “Can she not just be very talented? And not be sucking someone’s dick?” “Anastasia, will you please let me be petty for five minutes and pretend I don’t know she’s better than me?” Aaron throws himself into the chair beside me and reaches over to pick a carrot stick from my plate. “What’re we being petty about?” “Olivia Abbott,” Lola and I respond in unison, the distaste in her tone evident as hell. “She’s hot. Might be the hottest girl on campus,” he says nonchalantly, clearly not paying attention to how Lola’s jaw drops. “Is she single?” “How am I supposed to freaking know? She doesn’t talk to anyone. She swans in, gets the role I want, and carries on being an anomaly.” Lola studies performing arts, and it must be an unwritten rule that you have to have a larger-than-life personality, because everyone I’ve met in her major is like her. It’s usually an exhausting battle for attention, even as a spectator, but Olivia keeps to herself, and for some reason, it seems to bother people. “I’m sorry, Lols. There’s always next time,” I offer. We both know it doesn’t mean anything, but she blows me a kiss anyway. “If it makes you feel any better—I still can’t land my Lutz. Aubrey is going to work it out soon and banish me to Siberia.” “Oh no. You’re officially a failure, how can you ever step foot on the ice again?” She grins, her eyes shining as I scowl at her. “You’ll get there, babe. You’re working hard.” Her eyes move to Aaron, tapping away on his phone, totally uninterested in our conversation. “Hey, Ice Princess! You gonna help me out here?” “Huh? Sorry, yeah, you’re hot, too, Lo.” I’m surprised I don’t see the steam leave Lola’s ears as she yells at him about not listening to her. I slowly retreat to my bedroom, eager to not draw attention to myself and get caught in the crossfire of my roommates’ argument. Living with Aaron and Lola is like living with siblings who always wanted to be only children. Aaron, like me, is an actual only child. The miracle baby to his two aging, midwestern parents desperate to keep their marriage together. Living with other people after being his parents’ pride and joy for eighteen years was a big transition for him, and for us, who are the ones who have to live with him and his mood swings. Now he’s not in Chicago, things between his parents aren’t great, and we always know when they’re extra bad because Aaron gets an obnoxiously expensive and unnecessary gift. Like a G-Wagen. In contrast to the two of us, Lola is from a huge family. Being the youngest and the only girl guaranteed her the number one spot in her house, and she has no problem putting Aaron in his place. I’m still hiding out in my room when my phone buzzes, and Ryan’s name flashes on my screen. RYAN The boys wanna throw a party tonight. Your place instead? They were supposed to be going to a pep rally or some shit, but now they’re staying home. Just wanna be alone w you. Sure, roommates are in though. Will have to be quiet. Ha Should probably give yourself that instruction in a mirror. You free now? Yeah, come over. Omw. Bringing snacks. “Everyone friends again?” I call out cautiously as I make my way from my bedroom to the living room. They’re both fixated on the Criminal Minds rerun on the TV, but I get a faint “Yeah” in response, letting me know it’s safe to approach. I lean over the couch for a handful of popcorn from the bowl resting between them, making a mental note to add it to my food tracker when I get back to my room. “So, the basketball team is having a party. I was wondering—” “If we will go with you?” Aaron interrupts, sounding uncharacteristically hopeful. “No?” Lola spins to face me, her red curls bouncing around her shoulders and delight written all over her face. “If we mind that Ryan wants to come here?” “Yeah. How did yo—?” “Cough up, Carlisle,” she laughs, holding out her hand. He presses a few twenties into her palm, muttering something under his breath as she counts them out. “We heard about the party, and I didn’t think you’d wanna get railed with drunk freshmen making out on the other side of the door. We’re going to walk there.” Our home is one of Aaron’s dad’s better forgive me presents. It was either after his affair with his secretary or before he decided to have sex with the interior designer. Maple Tower is a beautiful condo block on the edge of campus, and our place has a great view and tons of natural light. The building isn’t exclusive to students, so it’s a peaceful place to live, but it’s close enough to everyone else that stumbling home from parties is easy. Aaron and I aren’t supposed to be at parties, but what Aubrey doesn’t know won’t hurt her. I’VE ALREADY WATCHED LOLA TRY on ten different outfits when Ryan texts to let me know he’s finally on his way up, giving me an excuse to leave her and her ten almost identical black dresses. The butterflies I get when there is a knock at the door and I know Ryan is on the other side of it were strange to me at first, but now it’s cute. He’s practically filling the doorway when I open the door to let him in. His messy blond hair is still damp, and he smells strongly of orange and something I can’t quite put my finger on, which is now weirdly comforting to me. His head dips to mine, and his lips press against my cheek lightly. “Hello, beautiful.” He hands me the bag of snacks he always insists on bringing because apparently, I don’t eat enough, and I don’t have anything good to eat when he’s here. Ryan eats more than any person I know, and his version of good is loaded with sugar. For some reason, Aaron and Lo are watching us from the living room like they’ve never seen other human beings before. Ryan laughs when he spots them; fortunately, he’s used to their antics by now, and he offers them a quiet “Hello” as I lead him in the direction of my bedroom. “Hey, Rothwell?” Lola shouts as we reach my door. He lets go of my hand, turning around to face her. “Yeah?” She’s leaning over the back of the couch, and I know from the mischievous look on her face I don’t want to hear whatever she has to say. “Since my bedroom is next to Stassie’s and I’m going to be listening to your grunting and balls slapping all night”—my eyes widen as far as they can go from behind him—“can I have the code for your room, so I don’t have to fight for the shared bathroom at the party at your place?” Campus housing has electronically coded locks on bedroom doors for security. Ryan’s room has a private bathroom, so Lo’s request is a good idea since the bathroom line gets ridiculous the drunker people get. It’s her delivery that’s going to require some serious work. “Sure, I’ll text it to you. No snooping, Mitchell. I’ll know if you have.” She holds up a peace sign. “Scout’s honor. Enjoy all the sex.” “Jesus, Lols.” I groan loud enough for her to hear as I drag Ryan into my room away from her. “I’m so sorry.” “I like her. She’s funny.” He chuckles, taking my face between his hands and tilting my head up so he can kiss me. It’s soft at first, then more urgent as his tongue moves against mine. His hands travel down my body gently until they reach my thighs, scooping me up in one quick motion. My legs automatically wrap around his waist, my body familiar with his after doing this so many times. There’s banging outside of my room, which I think is my roommates leaving, but every hot kiss Ryan places on my neck steals my attention away. I should check if it is them going, but it suddenly plummets to the bottom of things on my mind when Ryan lowers me to the bed and climbs on top of me. “How was your day?” he mumbles beneath my ear. He always does this. He kisses me perfectly, positions his body between my legs, applies enough pressure to have me squirm, scrambles the thoughts in my head, and then asks me something mundane like how my day was. The second I try to formulate a response, his fingers journey beneath my T-shirt, and he traces the curve of my jaw with his nose. Every inch of my skin feels like it’s buzzing, and he hasn’t even done anything yet. “It was, uh, uhm, fine, I, mhmm, skated…” His body rocks as he laughs. “You mhmm skated? Sounds interesting. Why don’t you tell me more, Allen?” I hate him. I really, really hate him. I incoherently mumble something about ice and Russians as he strips us of our clothes until we’re both in our underwear. Ryan’s body would make a Greek god weep; tanned skin from his summer home in Miami, and a torso with more abs than I can count. Forget a Greek god, it makes me want to weep. Gripping my panties on each hip, he waits until I nod before slowly pulling them down my legs, throwing them behind him, and spreading my legs wide. “Stas.” “Yeah?” His forehead creases. “Can Lola really hear my balls?” Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 12 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NEW YORK TIMES BESTSELLER Over 1 million copies sold! A TikTok sensation! Sparks fly when a competitive figure skater and hockey team captain are forced to share a rink.Anastasia Allen has worked her entire life for a shot at Team USA. It looks like everything is going according to plan when she gets a full scholarship to the University of California, Maple Hills and lands a place on their competitive figure skating team. Nothing will stand in her way, not even the captain of the hockey team, Nate Hawkins. Nate’s focus as team captain is on keeping his team on the ice. Which is tricky when a facilities mishap means they are forced to share a rink with the figure skating team—including Anastasia, who clearly can’t stand him. But when Anastasia’s skating partner faces an uncertain future, she may have to look to Nate to take her shot. Sparks fly, but Anastasia isn’t worried…because she could never like a hockey player, right?",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/Contemporary-Romance-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13354"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Atria Books; Reprint edition (February 7, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 448 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1668026031"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1668026038"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 1.1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#57 in Books (See Top 100 in Books) #16 in Sports Romance (Books) #24 in Romantic Comedy (Books) #80 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 67,675 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/17e2a617-d34f-4e0e-8578-301447c936f4.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2d5c2fc2-4053-4dbb-9229-55785bde5576.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9995c10-b9f6-4b8c-a85a-0cdf2c5e41de.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ebeb85c-d4d2-4ab4-b80e-4a0ea93d0e0a.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kimberly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM3PJ63CCT6I5SDY7NMCQBWXXMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D4M4HNIP6PR5?ASIN=1668026031",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Fail on my end. Joy for her. Shock for family. Laughter for us all.",
                "reviewText": "Almost 15 year old niece requested this book for Christmas. I however am the aunt that is always YES to every request. Including this one. Total fail for me. I should’ve read the reviews or at least looked into the book. Lmao. When I say I was in SHOCK opening up to a RANDOM page in the book before wrapping. I’m not even exaggerating. The page I opened up to was very descriptive of the sexual situation going on at that point in the book and the conversation the two were having was like a fifty shades scene. Lmfao. I however had already purchased it. She requested it. I obviously know this isn’t the first book nor the first moment of interest into things such as these because she’s almost 15 and let’s face it social media and our society has become way more complex therefore I continued to wrap it & gifted it. Not without the dramatics of reading a tid bit out loud for our family to hear after she opened it. Everyone was dying of laughter and shock, was a memory to keep for sure.The quality of the book was as expected, she read it & loved it, added to her collection. Would recommend if you’re an open aunt like myself and your niece takes advantage of that to request edgy gifts such as these. Lol.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Riniya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3OSK2H2ICQZO4S53AXDYKBH2ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RM5SXTUYY97K?ASIN=1668026031",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 12, 2023",
                "reviewTitle": "4.0 out of 5 stars 3.5 ⭐️ — Don’t read the epilogue",
                "reviewText": "Tropes/Key Points:✨Sports/College Romance✨Enemies to Lovers✨Warped Love Triangleish✨Dual POV3.5⭐️🌶️🌶️🌶️🌶️Blurb:Anastasia is a junior in college on track to be an Olympic Figure Skater. It’s all that she has worked towards since she was five years old. She managed to get a full scholarship, but her pairs partner wasn’t interested in furthering his career. So, as a freshman she was paired up with Aaron who was in the same boat.Stasis comes to win and nothing will get in her way. She has a meticulous schedule, regime and diet that will not be put off track for anybody or anything. Until she gets summoned along with the entire sporting department for a mandatory meeting that disrupts her day. This disruption continues when they are informed that Rink Two, the Hockey Teams Ice, is out for the count and they all have to share one ice rink.Nathan is the captain of the schools hockey team. He has never met a problem he couldn’t solve, that is until his ice rink is flooded and they have to share with the figure skating team. He sees Anastasia arguing with her coach after the meeting, and his attempt to smooth things over backfires in his face.Anastasia’s partner gets injured so Nathan steps in to fill the role. Swapping out a puck for a toe pick, the pair find themselves stuck together and closer than ever.Review:I don’t even know where to fully start here.The premise is amazing and reminded me of the movie “The Cutting Edge”. It’s a semi-accurate comparison but only in certain spots. I give this author credit though as she made it her own and it didn’t feel like a rip off of a timeless classic. I’m not even mad at the execution of the story, as it kept me hooked.One complaint though is the spice level. It comes out of the gate swinging and while it does calm down after chapter two until a bit later in the book, this was just too much for my personal preference. Not to mention that the first sexual encounter between Anastasia and Nate left much to be desired. She just used the bathroom dude and you knelt…. Well. You get it. 🤮My second complaint is the epilogue. It just wasn’t needed. I got to the last chapter of the book and thought I was done only for there to be a very predictable epilogue. I think the epilogue actually ruins the story and rushes achievements for the Main Couple. It felt out of place from what we learned through the book, like the author wanted it so it happened. The lady chapter would have been the perfect ending.One thing I absolutely loved about this story was the cast of characters. It wasn’t just about the main duo, it included such lovable hockey players on Nathan’s team and an amazing best friend for Anastasia. The author managed to flush out these characters and give them their own personalities and problems. It really felt like I could be in a room with a group of friends.Banter is also my weakness. Coming in strong with not only enjoyable back and forth between Ana and Nate, the way the hockey team comes together and ribs on each other was so perfect. There were multiple spots outside of the main couple that had me laughing. The team even accepted Ana and Lola into their group and they joined in on the fun of driving Nate crazy.I have to say that the way the author really delved outside of the romance to introduce complex backstories and emotions for these characters was really well done. Anastasia is in therapy and we see how her anxiety and obsessive planning became established. We see how it affects her daily life and even those around her. It wasn’t just a throwaway plot point, the author actually disperses it throughout the story in a great way.We also get to see some healing in regards to how Ana looks at food. This is such a delicate subject and I think it was handled so well. Of course, I’m coming at this from someone who has (luckily — but no shame to anyone who hasn’t been so lucky — I support you) never experienced trauma with food. I hope that the author truly did portray it in a healthy way and if not, can someone please educate me?The climax of the story was pristine but there were some moments that had me rolling my eyes. Development that we worked through only for it to be torn down to further the plot. But, that’s the way the stories are written so what can you do?Overall there were some really great moments through the book but it wasn’t enough to overpower the ending. The ending really ruined it for me and unfortunately that’s a big ding taking away from the rating.",
                "reviewVotes": "84 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHZWPMWBIP34ONOGPL4WRQ6G27A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R302BS9TDGTHTJ?ASIN=1668026031",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Oh swoon!💕💕",
                "reviewText": "I'm not going to lie, this book took me a long time to really get into. I wasn't a huge fan of the characters in the beginning. I felt that they were very immature but they're only 21. I really began to respect Stassi when she started to realize how unhealthy her lifestyle was, both mentally and physically. I loved Nate's golden retriever personality and I loved how supportive he was of her growth. I feel like they both had healthy boundaries with one another and I loved how they learned to communicate and work together through their issues. By 50% into the book, l was fully invested in the characters. The way that they grew to love each other was sweet and hilarious.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alyssa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL5HFRAYOEN24JAMAXFYN2VCVOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9U212U38TWK0?ASIN=1668026031",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Book Review",
                "reviewText": "Icebreaker by Hannah Grace (Maple Hills #1)⭐️⭐️⭐️⭐️⭐️/5I really enjoyed this book and I’m excited to read the next in the series. I normally struggle a little bit with sports romances, but I didn’t have that problem with this one. The characters are extremely complex, the hockey players are super funny, and I love a good enemies to lovers. Hannah Grace did a wonderful job tackling mental health issues like OCD, anxiety, and eating issues. Read this book if you like:⛸️sports romance⛸️forced proximity⛸️he falls first⛸️mental health representation⛸️grumpy/sunshine reversed",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tsu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIMZ6KH6HQPOAEATMJPPXD7HFLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R42HNV2I3UAP?ASIN=1668026031",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "3.0 out of 5 stars Explicit writing, not appropriate for middle schoolers",
                "reviewText": "I bought this book for my 8th grader not realizing it contained such s3xually graphic writing…apparently I don’t know what “spicy” romances are, and I definitely don’t follow TikTok trends 😆 Her English teacher very kindly handled things, talking to my daughter discreetly first (my daughter showed me a questionable page when she got home) and then calling me to make sure I knew about the book’s content. She said students in her class AND another district middle school were reading the book, and the teachers determined it wasn’t appropriate to bring to school or use for reading assignment credit. I’m sure it’s a great book, and my daughter is by no means 100% innocent, listens to explicit music, etc, but parents beware. Some portions of the book are borderline p*graphic, using all the explicit words, and painting mental pictures I’d rather my daughter not be imagining.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs. Alexander ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 14, 2024",
                "reviewTitle": "Cute!!",
                "reviewText": "Such a cute book I really enjoyed it. The character are amazing and what a lovely love story. Will probably reread I enjoyed it so much.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniela",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 13, 2024",
                "reviewTitle": "Excelente",
                "reviewText": "De los mejores de este año",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "maria eduarda mota",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 4, 2022",
                "reviewTitle": "amei!",
                "reviewText": "Conheci “Icebreaker” por indicação do booktok e me apaixonei logo de cara. Vocês já sabem como eu amo um bom romance universitário com esporte envolvido, e com esse aqui não foi diferente.Anastasia é o clichê da personagem forte que aprendeu a ser assim na base da porrada, mas ainda assim, quer confiar em tudo e todos e acreditar que todo mundo quer o melhor pra ela (quando a gente sabe que não é verdade).Já o Nathan é o puro esteriótipo do capitão do time que tá sempre de olho no que os outros jogadores tão fazendo e tá sempre cuidando de todo mundo. Aquele que pode mover mares e terras pra ver aqueles que ele ama bem.Gostei MUITO do desenvolvimento deles. Eu diria que eles começaram sendo um “haters to lovers” que nao durou tanto porque o Nathan é irresistível demais pra isso (bem do jeito que ele gosta de se achar).É um romance pra passar o tempo, que era justamente o que eu tava procurando. Tem alguns debates sobre temas legais mas não é o tipo de livro que vai MUDAR a sua vida, então não vá procurando por isso. É pra se divertir, e ponto!*Acredito que o livro ainda não foi traduzido pra português, mas tá disponível no Kindle Unlimited e o inglês é beeem facinho!*",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 10, 2024",
                "reviewTitle": "Libro en ingles",
                "reviewText": "El precio es económico.El libro es perfecto para los estudiantes de inglés adolescentes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yv's recentie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on January 25, 2024",
                "reviewTitle": "Goed en netjes binnen gekomen",
                "reviewText": "Prima geleverd. Geen deuken of ezelsoren. Netjes ingepakt in papier! Fijn om het zo binnen te krijgen. Blij met mijn pakketje!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}