{
    "remaining_requests": 2321,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ugly-Love-Novel-Colleen-Hoover/dp/1476753180",
    "body": {
        "name": "Ugly Love: A Novel",
        "price": "$10.31$10.31$7.78$7.78$10.31",
        "originalPrice": "$16.99",
        "rawPrice": 10.31,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ugly-Love-Novel-Colleen-Hoover/dp/1476753180",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41mBCtaJ1XL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51z2nHK KZL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Colleen Hoover",
            "link": "https://www.amazon.com/Colleen-Hoover/e/B006SKAK42/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Shakespeare Book House and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 142324,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Hoover builds a terrific new-adult world here with two people growing in their careers and discovering mature love.” -- Booklist (starred review)\"A must-read book of the year! I loved every word, I felt every moment, and I will never forget this story. I don’t give out a lot of 6 star ratings (in fact this will be the first one I’ve given this year) but the truth is that this book went above and beyond. The story was powerful, the writing was stunning, and the way every single piece of it was woven together was simply breathtaking.” -- Aestas, blog review“By the end of this book, my heart was aching and rejoicing at the same time from the countless emotions it had been exposed to. This is the sexiest, most heart-wrenching Colleen Hoover book to date—a book that shows us a brand new side of this author’s writing genius, and it is in my humble opinion, her best work thus far.” -- Natasha is a Book Junkie, blog review“Colleen Hoover once again proves she’s a master storyteller in her best and boldest work to date.” -- Vilma Iris' Blog“She's done it again, my friends. And to be honest I didn't think she was ever going to write something I loved more than MAYBE SOMEDAY, but I was book hung over for 2 full days after UGLY LOVE.” -- Me, My Shelf, & I, blog review“I fell in love with this book from the very first chapter.” -- Owl Always be Reading, blog review\"Ugly Love is another hit from Colleen Hoover that will leave your heart open and exposed to the myriad of emotions Tate and Miles' story will inflict upon it.” -- Lovin Los Libros, blog review“ Colleen Hoover has given us a story that is full of emotion.... she stayed true to her reputation of writing characters that are real and a story that is both compelling and powerful.” -- A Literary Perusal, blog review\"Colleen Hoover just demolished me. Completely and 100% blew me away…not that I’m surprised or anything because she never ceases to amaze me.... I was pulled in from the beginning…and I loved every second of it!” -- True Story Book Blog, blog tour review\"Thank you for another 'rip my heart out' excursion ... and with Ugly Love you somehow managed to do it TWICE! And I loved every bit of it!” -- The Real Housewives of Romance, blog tour review“If you were to only read one book this year, make that book Ugly Love.... It's definitely my favorite book of all time, and that's not a phrase that I use lightly.” -- Kayla’s Reads & Reviews, blog tour review“I LOVED this book. I stayed up until 1:00 a.m. to finish it, something I haven’t done in ages.... Ugly Love was a riveting page-turner that I couldn’t put down.” -- Reading Books like a Boss, blog review“Colleen is an artist. She has this uncanny ability to take normal, everyday words and somehow turn them into the most beautiful poetry I’ve ever read. The beauty of her lyrical writing style made me teary-eyed countless times. She can take something so simple and make it so powerful.” -- Nestled in a Book, blog review“Colleen Hoover does it again. She always creates a story that gets under your skin and hits you right in the heart. Ugly Love was no exception. Miles and Tate have a very intense story to be told and only Colleen Hoover could do it justice.” -- Readers Live a 1000 Lives, blog tour review“I’m not sure my heart will ever forget this book. Incredible read!!!” -- Flirty and Dirty Book Blog, blog tour review“Colleen Hoover has done it again. Her words have wholly altered me, mind, body, and spirit. I can’t explain what I’ve done or where I’ve been the past few hours, and the only thing that is in my mind is WOW.” -- The Scarlet Siren, blog tour review\"Ugly Love carries the kinship of stellar writing, (poetry, really), searing emotion, and a story that hits you in your very core.” ― I Heart Big Books, blog tour review\"I LOVE everything and anything that this woman writes…This is everything we come to expect from Ms. Hoover and SO MUCH more! You know when you come across a book and you don’t know what to say about it other than that you loved it and it was amazing?! Well thats how I feel about Ugly Love. JUST READ IT! TRUST ME!” ― Shh Mom’s Reading, blog tour review From the Author Colleen Hoover is the author of five New York Times bestselling novels. Her first series was published in 2012 and includes SLAMMED, POINT OF RETREAT and the companion novel THIS GIRL. Her second series, published in 2013, includes the #1 NYT's bestseller HOPELESS and the companion novel, LOSING HOPE. She has released a free novella, FINDING CINDERELLA, as a thank you to her readers for their continued support. The novella is a companion to her Hopeless series, but can be read as a standalone. You can follow Colleen on Instagram @colleenhoover if you want to watch her pointless, random videos. You can also follow her on TWITTER, but she rarely tweets anything worth following. You can also find her on her blog at colleenhoover.com or on her very active Facebook page at facebook.com/authorcolleenhoover where she loves to give away free stuff when her husband isn't looking. About the Author Colleen Hoover is the #1 New York Times bestselling author of more than twenty-three novels, including It Starts with Us, It Ends with Us, All Your Perfects, Ugly Love, and Verity. Colleen lives in Texas with her husband and their three boys. For more information, please visit ColleenHoover.com. Excerpt. © Reprinted by permission. All rights reserved. Chapter One: Tate chapter one TATE “Somebody stabbed you in the neck, young lady.” My eyes widen, and I slowly turn toward the elderly gentleman standing at my side. He presses the up button on the elevator and faces me. He smiles and points to my neck. “Your birthmark,” he says. My hand instinctively goes up to my neck, and I touch the dime-sized mark just below my ear. “My grandfather used to say the placement of a birthmark was the story of how a person lost the battle in their past life. I guess you got stabbed in the neck. Bet it was a quick death, though.” I smile, but I can’t tell if I should be afraid or entertained. Despite his somewhat morbid opening conversation, he can’t be that dangerous. His curved posture and shaky stance give away that he isn’t a day less than eighty years old. He takes a few slow steps toward one of two velvet red chairs that are positioned against the wall next to the elevator. He grunts as he sinks into the chair and then looks up at me again. “You going up to floor eighteen?” My eyes narrow as I process his question. He somehow knows what floor I’m going to, even though this is the first time I’ve ever set foot in this apartment complex, and it’s definitely the first time I’ve ever laid eyes on this man. “Yes, sir,” I say cautiously. “Do you work here?” “I do indeed.” He nods his head toward the elevator, and my eyes move to the illuminated numbers overhead. Eleven floors to go before it arrives. I pray it gets here quickly. “I push the button for the elevator,” he says. “I don’t think there’s an official title for my position, but I like to refer to myself as a flight captain, considering I do send people as high as twenty stories up in the air.” I smile at his words, since my brother and father are both pilots. “How long have you been flight captain of this elevator?” I ask as I wait. I swear this is the slowest damn elevator I’ve ever encountered. “Since I got too old to do maintenance on this building. Worked here thirty-two years before I became captain. Been sending people on flights now for more than fifteen years, I think. Owner gave me a pity job to keep me busy till I died.” He smiles to himself. “What he didn’t realize is that God gave me a lot of great things to accomplish in my life, and right now, I’m so far behind I ain’t ever gonna die.” I find myself laughing when the elevator doors finally open. I reach down to grab the handle of my suitcase and turn to him one more time before I step inside. “What’s your name?” “Samuel, but call me Cap,” he says. “Everybody else does.” “You got any birthmarks, Cap?” He grins. “As a matter of fact, I do. Seems in my past life, I was shot right in the ass. Must have bled out.” I smile and bring my hand to my forehead, giving him a proper captain’s salute. I step into the elevator and turn around to face the open doors, admiring the extravagance of the lobby. This place seems more like a historic hotel than an apartment complex, with its expansive columns and marble floors. When Corbin said I could stay with him until I found a job, I had no idea he lived like an actual adult. I thought it would be similar to the last time I visited him, right after I graduated from high school, back when he had first started working toward his pilot’s license. That was four years and a two-story sketchy complex ago. That’s kind of what I was expecting. I certainly wasn’t anticipating a high-rise smack dab in the middle of downtown San Francisco. I find the panel and press the button for the eighteenth floor, then look up at the mirrored wall of the elevator. I spent all day yesterday and most of this morning packing up everything I own from my apartment back in San Diego. Luckily, I don’t own much. But after making the solo five-hundred-mile drive today, my exhaustion is pretty evident in my reflection. My hair is in a loose knot on top of my head, secured with a pencil, since I couldn’t find a hair tie while I was driving. My eyes are usually as brown as my hazelnut hair, but right now, they look ten shades darker, thanks to the bags under them. I reach into my purse to find a tube of ChapStick, hoping to salvage my lips before they end up as weary-looking as the rest of me. As soon as the elevator doors begin to close, they open again. A guy is rushing toward the elevators, preparing to walk on as he acknowledges the old man. “Thanks, Cap,” he says. I can’t see Cap from inside the elevator, but I hear him grunt something in return. He doesn’t sound nearly as eager to make small talk with this guy as he was with me. This man looks to be in his late twenties at most. He grins at me, and I know exactly what’s going through his mind, considering he just slid his left hand into his pocket. The hand with the wedding ring on it. “Floor ten,” he says without looking away from me. His eyes fall to what little cleavage is peeking out of my shirt, and then he looks at the suitcase by my side. I press the button for floor ten. I should have worn a sweater. “Moving in?” he asks, blatantly staring at my shirt again. I nod, although I doubt he notices, considering his gaze isn’t planted anywhere near my face. “What floor?” Oh, no, you don’t. I reach beside me and cover all the buttons on the panel with my hands to hide the illuminated eighteenth-floor button, and then I press every single button between floors ten and eighteen. He glances at the panel, confused. “None of your business,” I say. He laughs. He thinks I’m kidding. He arches his dark, thick eyebrow. It’s a nice eyebrow. It’s attached to a nice face, which is attached to a nice head, which is attached to a nice body. A married body. Asshole. He grins seductively after seeing me check him out—only I wasn’t checking him out the way he thinks I was. In my mind, I was wondering how many times that body has been pressed against a girl who wasn’t his wife. I feel sorry for his wife. He’s looking at my cleavage again when we reach floor ten. “I can help you with that,” he says, nodding toward my suitcase. His voice is nice. I wonder how many girls have fallen for that married voice. He walks toward me and reaches to the panel, bravely pressing the button that closes the doors. I hold his stare and press the button to open the doors. “I’ve got it.” He nods as if he understands, but there’s still a wicked gleam in his eyes that reaffirms my immediate dislike of him. He steps out of the elevator and turns to face me before walking away. “Catch you later, Tate,” he says, just as the doors close. I frown, not comfortable with the fact that the only two people I’ve interacted with since walking into this apartment building already know who I am. I remain alone on the elevator as it stops on every single floor until it reaches the eighteenth. I step off, pull my phone out of my pocket, and open up my messages to Corbin. I can’t remember which apartment number he said was his. It’s either 1816 or 1814. Maybe it’s 1826? I come to a stop at 1814, because there’s a guy passed out on the floor of the hallway, leaning against the door to 1816. Please don’t let it be 1816. I find the message on my phone and cringe. It’s 1816. Of course it is. I walk slowly to the door, hoping I don’t wake up the guy. His legs are sprawled out in front of him, and he’s leaning with his back propped up against Corbin’s door. His chin is tucked to his chest, and he’s snoring. “Excuse me,” I say, my voice just above a whisper. He doesn’t move. I lift my leg and poke his shoulder with my foot. “I need to get into this apartment.” He rustles and then slowly opens his eyes and stares straight ahead at my legs. His eyes meet my knees, and his eyebrows furrow as he slowly leans forward with a deep scowl on his face. He lifts a hand and pokes my knee with his finger, almost as if he’s never seen a knee before. He drops his hand, closes his eyes, and falls back asleep against the door. Great. Corbin won’t be back until tomorrow, so I dial his number to see if this guy is someone I should be concerned about. “Tate?” he asks, answering his phone without a hello. “Yep,” I reply. “Made it safe, but I can’t get in because there’s a drunk guy passed out at your front door. Suggestions?” “Eighteen sixteen?” he asks. “You sure you’re at the right apartment?” “Positive.” “Are you sure he’s drunk?” “Positive.” “Weird,” he says. “What’s he wearing?” “Why do you want to know what he’s wearing?” “If he’s wearing a pilot’s uniform, he probably lives in the building. The complex contracts with our airline.” This guy isn’t wearing any type of uniform, but I can’t help but notice that his jeans and black T-shirt do fit him very nicely. “No uniform,” I say. “Can you get past him without waking him up?” “I’d have to move him. He’ll fall inside if I open the door.” He’s quiet for a few seconds while he thinks. “Go downstairs and ask for Cap,” he says. “I told him you were coming tonight. He can wait with you until you’re inside the apartment.” I sigh, because I’ve been driving for six hours, and going all the way back downstairs is not something I feel like doing right now. I also sigh because Cap is the last person who could probably help in this situation. “Just stay on the phone with me until I’m inside your apartment.” I like my plan a lot better. I balance my phone against my ear with my shoulder and dig inside my purse for the key Corbin sent me. I insert it into the lock and begin to open the door, but the drunk guy begins to fall backward with every inch the door opens. He groans, but his eyes don’t open again. “It’s too bad he’s wasted,” I tell Corbin. “He’s not bad-looking.” “Tate, just get your ass inside and lock the door so I can hang up.” I roll my eyes. He’s still the same bossy brother he always was. I knew that moving in with him would not be good for our relationship, considering how fatherly he acted toward me when we were younger. However, I had no time to find a job, get my own apartment, and get settled before my new classes started, so it left me with little choice. I’m hoping things will be different between us now, though. Corbin is twenty-five, and I’m twenty-three, so if we can’t get along better than we did as kids, we’ve got a lot of growing up left to do. I guess that mostly depends on Corbin and whether he’s changed since we last lived together. He had an issue with anyone I dated, all of my friends, every choice I made—even what college I wanted to attend. Not that I ever paid any attention to his opinion, though. The distance and time apart has seemed to get him off my back for the last few years, but moving in with him will be the ultimate test of our patience. I wrap my purse around my shoulder, but it gets caught on my suitcase handle, so I just let it fall to the floor. I keep my left hand wrapped tightly around the doorknob and hold the door shut so the guy won’t fall completely into the apartment. I take my foot and press it against his shoulder, pushing him from the center of the doorway. He doesn’t budge. “Corbin, he’s too heavy. I’m gonna have to hang up so I can use both hands.” “No, don’t hang up. Just put the phone in your pocket, but don’t hang up.” I look down at the oversized shirt and leggings I have on. “No pockets. You’re going in the bra.” Corbin makes a gagging sound as I pull the phone from my ear and shove it inside my bra. I remove the key from the lock and drop it toward my purse, but it misses and falls to the floor. I reach down to grab the drunk guy so I can move him out of the way. “All right, buddy,” I say, struggling to pull him away from the center of the doorway. “Sorry to interrupt your nap, but I need inside this apartment.” I somehow manage to prop him up against the doorframe to prevent him from falling into the apartment, and then I push the door open farther and turn to get my things. Something warm wraps around my ankle. I freeze. I look down. “Let go of me!” I yell, kicking at the hand that’s gripping my ankle so tightly I’m pretty sure it might bruise. The drunk guy is looking up at me now, and his grip sends me falling backward into the apartment when I try to pull away from him. “I need to get in there,” he mutters, just as my butt meets the floor. He makes an attempt to push the apartment door open with his other hand, and this immediately sends me into panic mode. I pull my legs the rest of the way inside, and his hand comes with me. I use my free leg to kick the door shut, slamming it directly onto his wrist. “Shit!” he yells. He’s trying to pull his hand back into the hallway with him, but my foot is still pressing against the door. I release enough pressure for him to have his hand back, and then I immediately kick the door all the way shut. I pull myself up and lock the door, the dead bolt, and the chain lock as quickly as I can. As soon as my heart rate begins to calm down, it starts to scream at me. My heart is actually screaming at me. In a deep male voice. It sounds like it’s yelling, “Tate! Tate!” Corbin. I immediately look down at my chest and pull my phone out of my bra, then bring it up to my ear. “Tate! Answer me!” I wince, then pull the phone several inches from my ear. “I’m fine,” I say, out of breath. “I’m inside. I locked the door.” “Jesus Christ!” he says, relieved. “You scared me to death. What the hell happened?” “He was trying to get inside. I locked the door, though.” I flip on the living-room light and take no more than three steps inside before I come to a halt. Good going, Tate. I slowly turn back toward the door after realizing what I’ve done. “Um. Corbin?” I pause. “I might have left a few things outside that I need. I would just grab them, but the drunk guy thinks he needs to get inside your apartment for some reason, so there’s no way I’m opening that door again. Any suggestions?” He’s silent for a few seconds. “What did you leave in the hallway?” I don’t want to answer him, but I do. “My suitcase.” “Christ, Tate,” he mutters. “And… my purse.” “Why the hell is your purse outside?” “I might have also left the key to your apartment on the hallway floor.” He doesn’t even respond to that one. He just groans. “I’ll call Miles and see if he’s home yet. Give me two minutes.” “Wait. Who’s Miles?” “He lives across the hall. Whatever you do, don’t open the door again until I call you back.” Corbin hangs up, and I lean against his front door. I’ve lived in San Francisco all of thirty minutes, and I’m already being a pain in his ass. Figures. I’ll be lucky if he lets me stay here until I find a job. I hope that doesn’t take long, considering I applied for three RN positions at the closest hospital. It might mean working nights, weekends, or both, but I’ll take what I can get if it prevents me from having to dip into savings while I’m back in school. My phone rings. I slide my thumb across the screen and answer it. “Hey.” “Tate?” “Yep,” I reply, wondering why he always double-checks to see if it’s me. He called me, so who else would be answering it who sounds exactly like me? “I got hold of Miles.” “Good. Is he gonna help me get my stuff?” “Not exactly,” Corbin says. “I kind of need you to do me a huge favor.” My head falls against the door again. I have a feeling the next few months are going to be full of inconvenient favors, since he knows he’s doing me a huge one by letting me stay here. Dishes? Check. Corbin’s laundry? Check. Corbin’s grocery shopping? Check. “What do you need?” I ask him. “Miles kind of needs your help.” “The neighbor?” I pause as soon as it clicks, and I close my eyes. “Corbin, please don’t tell me the guy you called to protect me from the drunk guy is the drunk guy.” Corbin sighs. “I need you to unlock the door and let him in. Let him crash on the couch. I’ll be there first thing in the morning. When he sobers up, he’ll know where he is, and he’ll go straight home.” I shake my head. “What kind of apartment complex are you living in? Do I need to prepare to be groped by drunk people every time I come home?” Long pause. “He groped you?” “?‘Grope’ might be a bit strong. He did grab my ankle, though.” Corbin lets out a sigh. “Just do this for me, Tate. Call me back when you’ve got him and all your stuff inside.” “Fine.” I groan, recognizing the worry in his voice. I hang up with Corbin and open the door. The drunk guy falls onto his shoulder, and his cell phone slips from his hand and lands on the floor next to his head. I flip him onto his back and look down at him. He cracks his eyes open and attempts to look up at me, but his eyelids fall shut again. “You’re not Corbin,” he mutters. “No. I’m not. But I am your new neighbor, and from the looks of it, you’re about to owe me at least fifty cups of sugar.” I lift him by his shoulders and try to get him to sit up, but he doesn’t. I don’t think he can, actually. How does a person even get this drunk? I grab his hands and pull him inch by inch into the apartment, stopping when he’s just far enough inside for me to be able to close the door. I retrieve all of my things from outside the apartment, then shut and lock the front door. I grab a throw pillow from the couch, prop his head up, and roll him onto his side in case he pukes in his sleep. And that’s all the help he’s getting from me. When he’s comfortably asleep in the middle of the living-room floor, I leave him there while I look around the apartment. The living room alone could fit three of the living rooms from Corbin’s last apartment. The dining area is open to the living room, but the kitchen is separated from the living room by a half-wall. There are several modern paintings throughout the room, and the thick, plush sofas are a light tan, offsetting the vibrant paintings. The last time I stayed with him, he had a futon, a beanbag chair, and posters of models on the walls. I think my brother might finally be growing up. “Very impressive, Corbin,” I say out loud as I walk from room to room and flip on all the lights, inspecting what has just become my temporary home. I kind of hate that it’s so nice. It’ll make it harder to want to find my own place once I get enough money saved up. I walk into the kitchen and open the refrigerator. There’s a row of condiments in the door, a box of leftover pizza on the middle shelf, and a completely empty gallon of milk still sitting on the top shelf. Of course he doesn’t have groceries. I can’t have expected him to change completely. I grab a bottled water and exit the kitchen to go search for the room I’ll be living in for the next few months. There are two bedrooms, so I take the one that isn’t Corbin’s and set my suitcase on top of the bed. I have about three more suitcases and at least six boxes down in the car, not to mention all my clothes on hangers, but I’m not about to attempt those tonight. Corbin said he’d be back in the morning, so I’ll leave that to him. I change into a pair of sweats and a tank top, then brush my teeth and get ready for bed. Normally, I would be nervous about the fact that there’s a stranger in the same apartment I’m in, but I have a feeling I don’t need to worry. Corbin would never ask me to help someone he felt might be a threat to me in any way. Which confuses me, because if this is common behavior for Miles, I’m surprised Corbin asked me to bring him inside. Corbin has never trusted guys with me, and I blame Blake for that. He was my first serious boyfriend when I was fifteen, and he was Corbin’s best friend. Blake was seventeen, and I had a huge crush on him for months. Of course, my friends and I had huge crushes on most of Corbin’s friends, simply because they were older than we were. Blake would come over most weekends to stay the night with Corbin, and we always seemed to find a way to spend time together when Corbin wasn’t paying attention. One thing led to another, and after several weekends of sneaking around, Blake told me he wanted to make our relationship official. The problem Blake didn’t foresee was how Corbin would react once Blake broke my heart. And boy, did he break it. As much as a fifteen-year-old heart can be broken after the span of a two-week secret relationship. Turned out he was officially dating quite a few girls during the two weeks he was with me. Once Corbin found out, their friendship was over, and all of Corbin’s friends were warned not to come near me. I found it almost impossible to date in high school until after Corbin finally moved away. Even then, though, the guys had heard horror stories and tended to steer clear of Corbin’s little sister. As much as I hated it then, I would more than welcome it now. I’ve had my fair share of relationships go wrong since high school. I lived with my most recent boyfriend for more than a year before we realized we wanted two separate things out of life. He wanted me home. I wanted a career. So now I’m here. Pursuing my master’s degree in nursing and doing whatever I can to avoid relationships. Maybe living with Corbin won’t be such a bad thing after all. I head back to the living room to turn out the lights, but when I’ve rounded the corner, I come to an immediate halt. Not only is Miles up off the floor, but he’s in the kitchen, with his head pressed against his arms and his arms folded on top of the kitchen counter. He’s seated on the edge of a bar stool, and he looks as if he’s about to fall off it any second. I can’t tell if he’s sleeping again or just attempting to recover. “Miles?” He doesn’t move when I call his name, so I walk toward him and gently lay my hand on his shoulder to shake him awake. The second my fingers squeeze his shoulder, he gasps and sits up straight as if I just woke him from the middle of a dream. Or a nightmare. Immediately, he slides off the stool and onto very unstable legs. He begins to sway, so I throw his arm over my shoulder and try to walk him out of the kitchen. “Let’s go to the couch, buddy.” He drops his forehead to the side of my head and stumbles along with me, making it even harder to hold him up. “My name isn’t Buddy,” he slurs. “It’s Miles.” We make it to the front of the couch, and I start to peel him off me. “Okay, Miles. Whoever you are. Just go to sleep.” He falls onto the couch, but he doesn’t let go of my shoulders. I fall with him and immediately attempt to pull away. “Rachel, don’t,” he begs, grabbing me by the arm, trying to pull me to the couch with him. “My name isn’t Rachel,” I say, freeing myself from his iron grip. “It’s Tate.” I don’t know why I clarify what my name is, because it’s not likely he’ll remember this conversation tomorrow. I walk to where the throw pillow is and pick it up off the floor. I pause before handing it back to him, because he’s on his side now, and his face is pressed into the couch cushion. He’s gripping the couch so tightly his knuckles are white. At first, I think he’s about to get sick, but then I realize how incredibly wrong I am. He’s not sick. He’s crying. Hard. So hard he isn’t even making a sound. I don’t even know the guy, but the obvious devastation he’s experiencing is difficult to witness. I look down the hallway and back to him, wondering if I should leave him alone in order to give him privacy. The last thing I want to do is get tangled up in someone’s issues. I’ve successfully avoided most forms of drama in my circle of friends up to this point, and I sure as hell don’t want to start now. My first instinct is to walk away, but for some reason, I find myself oddly sympathetic toward him. His pain actually appears genuine and not just the result of an overconsumption of alcohol. I lower myself to my knees in front of him and touch his shoulder. “Miles?” He inhales a huge breath, slowly lifting his face to look at me. His eyes are mere slits and bloodshot red. I’m not sure if that’s a result of the crying or the alcohol. “I’m so sorry, Rachel,” he says, lifting a hand out toward me. He wraps it around the back of my neck and pulls me forward toward him, burying his face in the crevice between my neck and shoulder. “I’m so sorry.” I have no idea who Rachel is or what he did to her, but if he’s hurting this bad, I shudder to think what she’s feeling. I’m tempted to find his phone and search for her name and call her so she can come rectify this. Instead, I gently push him back into the couch. I lay his pillow down and urge him onto it. “Go to sleep, Miles,” I say gently. His eyes are so full of hurt when he drops to the pillow. “You hate me so much,” he says as he grabs my hand. His eyes fall shut again, and he releases a heavy sigh. I stare at him silently, allowing him to keep hold of my hand until he’s quiet and still and there aren’t any more tears. I pull my hand away from his, but I stay by his side for a few minutes longer. Even though he’s asleep, he somehow still looks as if he’s in a world of pain. His eyebrows are furrowed, and his breathing is sporadic, failing to fall into a peaceful pattern. For the first time, I notice a faint, jagged scar, about four inches long, that runs smoothly across the entire right side of his jaw. It stops just two inches shy of his lips. I have the strange urge to touch it and run my finger down the length of it, but instead, my hand reaches up to his hair. It’s short on the sides, a little longer on the top, and just the perfect blend of brown and blond. I stroke his hair, comforting him, even though he may not deserve it. This guy may deserve every single bit of the remorse he’s feeling for whatever he did to Rachel, but at least he’s feeling it. I have to give him that much. Whatever he did to Rachel, at least he loves her enough to regret it. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 6 hrs 49 mins",
            "FREE delivery February 25 - 27 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 23",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Monday, February 19. Order within 16 hrs 34 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From Colleen Hoover, the #1 New York Times bestselling author of It Starts with Us and It Ends with Us, aheart-wrenching love story that proves attraction at first sight can be messy. When Tate Collins meets airline pilot Miles Archer, she doesn't think it's love at first sight. They wouldn’t even go so far as to consider themselves friends. The only thing Tate and Miles have in common is an undeniable mutual attraction. Once their desires are out in the open, they realize they have the perfect set-up. He doesn’t want love, she doesn’t have time for love, so that just leaves the sex. Their arrangement could be surprisingly seamless, as long as Tate can stick to the only two rules Miles has for her. Never ask about the past. Don’t expect a future. They think they can handle it, but realize almost immediately they can’t handle it at all. Hearts get infiltrated. Promises get broken. Rules get shattered. Love gets ugly.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Atria Books; Standard Edition (August 5, 2014)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1476753180"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1476753188"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 8.25 x 5 x 0.9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#202 in Books (See Top 100 in Books) #18 in Contemporary Women Fiction #62 in New Adult & College Romance (Books) #242 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 142,324 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6021cc0c-9539-461f-bdd8-839245f89dec.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1b67116e-3fe5-4c2b-9fab-5bc5a7143998.__CR0,0,4500,4500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/804c03d2-5872-4d88-bead-1a420ab0622b.__CR0,0,2160,2160_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aaa302ca-24f0-4ce2-8527-fc6ef97471ba.__CR0,0,2160,2160_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lisa Maurer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQWLFLVO5RC2HJI44DMJ32MI73A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q6W59P7XBZWV?ASIN=1476753180",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 13, 2014",
                "reviewTitle": "5.0 out of 5 stars Might be physically impossible for Colleen Hoover to write a book I don't love...",
                "reviewText": "5 “liquid” “my new favorite words” “We’ve got this.” KissesHoly bananas Colleen Hoover just demolished me. Completely and 100% blew me away…not that I’m surprised or anything because she never ceases to amaze me but…OMG! Let the book hangover commence because this one is going to be a doozy to recover from. I was pulled in from the beginning and giving the angsty ride of my life...and I loved every second of it!Elizabeth Tate Collins...where do I begin with Tate. I freakin adored her...I couldn’t help myself. I can’t even tell you the exact moment when it happened or what pushed me over the edge…she took me by storm. Tate really is a force to be reckoned with. She’s so freaking smart…already a nurse at the age of 23 and pursuing her master’s degree in nursing…she’s driven, focused and determined…genuine, kind and caring…but she’s not a pushover. I loved her sense of humor…she’s sweet, funny and sassy. She’s got her own little quirks but I just found them more adorable. I liked her attitude and I think, as usual, the key for me was that I was totally emotional connected to her. Everything she felt…I felt. I related to her in some ways, but that wasn’t even the half of what drew me to her. Tate is a very compelling heroine…she’s just one of these extremely relatable girls that is easy to fall in love with…and it’s easy to see why Miles did as well..‘Something strange is going on in my chest. A flutter, flutter kind of thing. I hate it, because I know what it means. It means my body is really starting to like Miles.I just hope my brain never catches up.'Miles Mikel Archer...oh Jesus Lord in heaven this boy, where do I even begin. He stole my heart…held my heart...he crushed my heart...and then he healed my heart. As closed off and emotionally detached as Miles was, I was still incredibly drawn to him...and that's saying something considering I am an emotional reader. I think it's because the glimpses of emotion that we get in the beginning from him are like moments of gold...I clung to those because they were just...so amazing! Knowing how much those affected me...how could I not want more?!? I swear…the moment he stroked Tate’s foot and cracked a smile I was DONE FOR people. Just done. I know…I sound crazy, but that boy melted my heart and he continued to do so for the remaining 80% of the book. Oh Miles…Miles Miles Miles…every time I thought I had no more feels left to give…he painfully extracted them from my body…every time I thought he cannot be more perfect (yes…even with his walls!)…he proved me wrong with his words and actions. Miles is very understated...he’s sexy but it’s not shoved in your face and he doesn’t act like a conceited @#% hat. He’s successful but he doesn’t brag about it or let it go to his head. He’s sweet, kind and thoughtful…but its like he doesn’t want anyone to know. But Tate knows… ‘I’ve always been a sucker for the quiet types of guys. Primarily because most guys talk too much, and it’s painful having to suffer through every single thought that goes through their heads. Miles makes me wish he were the opposite of the quiet type, though. I want to know all the thoughts that pass through his head. Especially the one thought that’s in there right now, hiding behind that unwavering, stoic expression.’Hmm...how do I describe Miles and Tate...hot...sensual...electric...passionate...just YES! How can it not be? Their relationship is based of one thing...sex. Now…before we get crazy, it’s not erotica, it’s tasteful but it’s still sexy as hell. Heck…everything about Miles and Tate was sexy and addictive…I truly could not get enough of them. I thrived off of Miles and Tate together...they are just that amazing. You could see even in the littlest things how happy and complete he made her and as much as he tried to fight it, I could tell she was chipping away at that hardened shell. It was hard though…seeing the impact of his decisions and what that did to Tate…it hurt my heart, but…I never once questioned her decisions. I was waiting for that point when I would get frustrated or angry with what Tate was doing…it didn’t come. I got it…because I understood her feelings for him…I would have done the same thing! Truly, the thought of her walking away from him killed me more than the angst they were experiencing.‘He brings his hands up and slides them through my hair, brushing his thumbs across my cheeks. He inhales a shaky breath while looking down at my mouth. “You make it so hard to breathe.”He punctuates his sentence with his kiss, bringing his lips over mine. Every remaining part of me that had yet to melt in his presence is now liquefied like the rest of me. I try to recall a time when a man’s mouth felt this good against mine. His tongue slides across my lips, then dips inside, tasting me, filling me, claiming me.Oh….my.I.Love.His.Mouth.’Tate and Miles are so…unique. I loved that we got both of their POV’s…I love the way both of their POV’s are presented…and I’m being intentionally vague on that because I don’t want to spoil things because that was part of the surprise for me. I wasn’t expecting to get both but it was honestly genius and a totally different approach. I guess…the best way for me to describe without giving too much away is that I fell in love with Miles twice…which is probably why he got to me so deeply. You get to see two very different sides to him, both of them are amazing and wonderful (hence…the falling in love) but that’s where my struggle began. Now…before I go on, we’ve established, I love Miles…I love everything I know about him and every second I learned more I fell more…I love the good, the bad and the ugly…I felt like a part of my heart broke with him…I shed tears for him…flaws and all he is still perfect in my eyes. So…here’s the problem…I was so connected with Tate and feeling her pain…so I was getting double duty pain…with her and for him…it sometimes felt like I was being ripped in two. The struggle is real… ‘A kiss is so much easier than what we’re doing. When you kiss, you can close your eyes. You can kiss away the thoughts. You can kiss away the pain, the doubt, the shame. When you close your eyes and kiss, you protect yourself from the vulnerability.This isn’t us protecting ourselves.This is confrontation. This is a standoff. This is eye-to-eye combat. This is a dare, from me to Miles, from Miles to me. I dare you to try to stop this, we’re both silently screaming.’I could babble on and on all day about these two…but that’s not all there is. There are two other very important men in Tate’s life and I thoroughly enjoyed the relationships she had with them. First…her brother Corbin…he is the typical older brother, super protective, loving to a fault and no one is good enough for his little sister. I liked their closeness…at a time when Tate needed someone, he was there for her in his own way and they had a very easy relationship…except when it comes to Tate’s dating life, but I thought it was cute that he was so caring and wanted what was best for her. In all honesty…if it wasn’t for Corbin…there would be no Tate and Miles…so it’s really all his fault. Then we have Cap….his real name is Samuel but it just looks weird calling him that cause…well, he’s Cap. He’s an 80 year old man that turned into one of Tate’s closest friends and I don’t think I could have loved their relationship more if I wanted to. He was this little injection of comedic relief, his timing was perfect and there is no other word for Cap besides awesome.‘“What do you think would make a man never want to experience love again?”Cap doesn’t answer my question for at least five floors. I eventually look at him, and he’s looking right at me, his eyes narrowed, producing even more wrinkles between them. “I suppose if a man lived through the ugliest side of love, he might never want to experience it again.”I contemplated his answer, but it doesn’t help much. I don’t see how love could get ugly enough for a person to just shut himself off from it completely.’Of course the writing is absolutely flawless…it’s Colleen Hoover, there was never any doubt in my mind. I’m in awe of her. I literally don’t feel like I’m reading when I read her books…it’s an experience…I live it with the characters. I immerse myself in her stories and I think it’s genuinely impossible not to walk away from them a changed human. Every sentence blends perfectly…the flow is smooth…I’m just effortlessly pulled in. It’s torture to stop reading and you never want the journey to end. I liked that this book was a little different from some of her others…but it still had that CoHo vibe to it – her tone is still there, the characters still have that special edge that make them classically hers, but it was just a little more mature. Seriously, the one common thing with all of her books is the level of emotion that she pours into them…especially this one. Every time I think there is no way she can out do it…can make me cry again…can angst my heart out more…can create characters that I can love to bits and pieces…and yet she does. Every. Single. Time. It’s brilliant wrapped in genius dipped in amazing…shot straight through my brain and into my heart.‘She’s absolutely beautiful. Her hope is beautiful. The smile on her face is beautiful. The tears streaming down her cheeks are beautiful.Her love is beautiful.’I am a self professed clinger…and I’m struggling to let go of Miles and Tate but…I can’t deny…Ugly Love is a perfect standalone. Do I think Corbin deserves a book? Your darn tootin’…that boy is a man whore and I LOVE my man whores…he is a recipe for awesome in the making when combined with Colleen’s brain…but that still doesn’t change that I couldn’t have asked for anything better than the way Miles and Tate’s story ended. It was perfection…big red bow and all. I laughed…I cried…I loved…it was beautiful and ugly and everything I wanted and I will never look at water the same way again.",
                "reviewVotes": "117 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JBenoit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3YCN2D7SOFBHI576C3NO6CAB6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C2UJU3O4RYHH?ASIN=1476753180",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2015",
                "reviewTitle": "5.0 out of 5 stars Pure Colleen Hoover Magic!",
                "reviewText": "“If I were capable of loving someone… it would be you.”Colleen Hoover is a genius, plain and simple. I’ve read Slammed/Point of Retreat/This Girl and Maybe Someday/Maybe Not and I’ve loved them all, but after reading Ugly Love I can easily say that this was my favorite CoHo book that I’ve read so far! This woman has such a way with words, her writing is just a joy to read, even when she’s tearing your heart out. I don’t know how she does it, she doesn’t use big fancy words or complicated prose, these are just ordinary everyday words but the way she puts them all together is simply magical. It’s hard for me to describe, but if you’ve read any CoHo books I think you know what I’m talking about. All of her stories are so unique and amazing but one thing they all have in common is Colleen Hoover’s gift with words. I know exactly what I’ll be getting when I pick up one of her books in terms of writing and quality, but I am always surprised with the direction her stories take. It’s always an incredible adventure and I love going along for the ride.I loved how this book was narrated, it’s told from dual POVs, alternating every other chapter between Tate and Miles. The thing that made this book unique is that Tate’s chapters were set in the present day and (with the exception of the last few chapters) all of Miles’ chapters were set 6 years earlier. So we essentially get two separate love stories that are both wonderful and beautiful that come back together in such a great way. I loved getting Miles’ backstory in the form of these flashback chapters, first off they were so amazingly written, they just flowed like poetry and I found myself lost in these simple words:‘My new favorite flavor is Rachel. My new favorite thing is Rachel. I want Rachel for my birthday. I want Rachel for Christmas. I want Rachel for graduation. Rachel, Rachel, Rachel. I’m gonna fall in love with you anyway, Rachel.’Secondly, in Tate’s chapters Miles really is an enigma and without his current day POV you really don’t have much clue what’s going on behind that wall he’s put up:‘Still no smile, though. Jesus Christ, this man. Does he now realize that facial expressions are supposed to accompany speech?’But reading his flashback chapters really helped understand what Miles’ potential to love was. Before you find out what happened to him in the past that caused him to be so closed off you get to see what a huge heart he has and his great capacity for love. This book was just as much Miles and Rachel’s love story as it was Miles and Tate’s story, you’d think that as a reader you’d have ill feelings towards the “other woman” because you know you should be rooting for Tate but there’s none of that. I felt Miles and Rachel’s story just as fully as I did him and Tate.Colleen Hoover’s characters are always so well written, they are well developed, incredibly detailed and 100% relatable. I totally loved Tate, she was a riot and she said and did things that I could see myself doing in those situations and I connected with her right away. I loved her inner musings as she tried to figure Miles out or tried to soak up any little scrap of hope he threw her way:‘“You look pretty, Tate.” I want to plaster those four words on a billboard and require myself to pass it on my drive to work every day. I would never take another day off work again.’There were some times when Miles would do something where Tate totally should have walked away, but I think she reacted how many women would react and I know that she didn’t give up completely on Miles because she knew what was happening between them was real even though he would never admit it. Miles intrigued me from the start and from their first meeting where she witnessed his very private breakdown I knew that I was in for a doozy when his past was revealed. I knew he must have endured some horrible event(s) that caused him to swear off any form of love, and wow was he dedicated to his rules:“Don’t ask about my past,” he says firmly. “And never expect a future.”I’ve never seen a character hold so steadfastly to rules like he did. We got to see moments, tiny glimpses of actions or a slipped word that gave us some hope but just as quickly as we grasped that hope he snatched it right back. I was so sad for him and falling so in love with him at the same time (much like Tate, only with the added bonus of seeing what a wonderful guy he was six years earlier when he was still full of life and love) and I just wanted to hug him. My heart completely broke for him as his full past is finally revealed, and I will say that what actually happened was not at all what I was expecting. But I love how once we hit that point the story shifts to all present day and it’s seamless and I love how it put my heart back together again and wrapped up in a totally believable and satisfying way.In addition to Tate and Miles I loved all of the secondary characters. I’ve already mentioned Rachel and I did really love her. I also loved Corbin and his friendship with Miles and his protectiveness of his sister. I also liked seeing Ian and Miles’ relationship both in the past and in the present day. My favorite secondary character however was Cap, I LOVED Cap! I love how Colleen Hoover can throw in a quirky random character like this and make you totally fall in love with them and have them end up being so important to the overall story.I read this book over the course of a few hours spread out the day, I simply could not put it down. I struggled though because I wanted to read as fast as I possibly could to find out what happens next but at the same time I wanted to slow down to savor every single word on the page! In the end speed won out but I think I highlighted half the book with passages I wanted to always remember! I’m going to have to re-read this book someday because I don’t think one time is enough for something written as well as this was. I’m sad I don’t have more time with Miles and Tate but I am so glad that I was able to spend one wonderful afternoon/evening in their world with them and I know I will never forget this amazing, beautiful, ugly love story! 5+++ stars!‘But the second she opened her eyes and looked at me, I knew. She was either going to be the death of me… or she was going to be the one who finally brought me back to life.’",
                "reviewVotes": "51 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Alvarez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 24, 2023",
                "reviewTitle": "Hermoso",
                "reviewText": "Gran libro, fácil lectura aún en inglés. Muy entretenido",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 2, 2024",
                "reviewTitle": "genuinely don’t think another book could top it!",
                "reviewText": "would do anything to read this for the first time again. if you love books where the girl fixes the boy you will love this. a mix of romance and a lot of 🌶️🌶️🌶️. was genuinely amazing would 100% recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Boris Schewe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 30, 2024",
                "reviewTitle": "Gut",
                "reviewText": "Lässt sich gut lesen",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nuruddin Mohammed",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 18, 2023",
                "reviewTitle": "Worth buying the product",
                "reviewText": "An amazing book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 23, 2023",
                "reviewTitle": "Loved it",
                "reviewText": "I LOVED this book. It was easy to read, intense, and beautifully written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.79",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            },
            {
                "price": "$5.80",
                "sellerName": "Shakespeare Book House",
                "sellerRating": "5"
            },
            {
                "price": "$6.36",
                "sellerName": "Lalageez",
                "sellerRating": "4.5"
            }
        ]
    }
}