{
    "remaining_requests": 2230,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Seven-Days-June-Tia-Williams/dp/1538719096",
    "body": {
        "name": "Seven Days in June",
        "price": "$12.74$12.74",
        "originalPrice": "",
        "rawPrice": 12.74,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Seven-Days-June-Tia-Williams/dp/1538719096",
        "soldBy": {
            "sellerID": "A1OVE6SOYPPH9T",
            "name": "RNA TRADE LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1OVE6SOYPPH9T&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41930K0dTSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31zo9 xiz7L.jpg",
            "https://m.media-amazon.com/images/I/51eQQy6KvWL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Tia Williams",
            "link": "https://www.amazon.com/Tia-Williams/e/B001IR1Q1G/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "RNA TRADE LLC",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 18457,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “[Seven Days in June is] filled with important observations and tidbits about Black life, giving the reader something that goes a step beyond the basic rom-com format.”―USA Today“While this is a sumptuous, fun, romantic story about two authors who reunite at a conference, it's also an ode to anyone who goes through life wishing they were more normal.”―Good Morning America“Sultry.”―Marie Claire“A read as sultry as the summer heat.”―Harper’s Bazaar“Steamy.”―Essence“Gutting, arousing, and sparklingly witty… a love story with depth.”―Vogue“One of the most anticipated romance novels of the summer…Eva and Shane's story gets steamy, so be sure to read by the water so you can cool off.”―Oprah Daily“If this cover doesn't raise your temperature a few degrees, the story will. Grab a fan before reading this one, because it really heats up.”―Good Housekeeping“Readers will delight in the opportunity to become a part of Eva’s world, in a novel that seamlessly weaves young love, true love, addiction, pain, and hope.”―Shondaland“Very steamy…This one’s going to be everywhere.”―The Skimm“Seven Days in June is a beautiful ode to Black joy.”―PopSugar“Seven Days in June had me laughing out loud and crying with the characters as their hearts are broken and healed. Tia Williams’ book is a smart, sexy testament to Black joy, to the well of strength from which women draw, and to tragic romances that mature into second chances. I absolutely loved it.”―Jodi Picoult, #1 NYT bestselling author of The Book of Two Ways and Small Great Things\"In Seven Days in June, Tia Williams conjures a seductive fantasy-rich friendships, star-crossed lovers, artistic fulfillment. But Williams, a canny anthropologist of contemporary urban life, is writing realism, exploring personal pain, family entanglements, and the negotiation of black identity in a world defined by whiteness. The result isn't escapism (though the book is a delight) but a vision of life at it truly is: complications and difficulties punctuated by profound joy.\"―Rumaan Alam, author of National Book Award finalist Leave the World Behind\"I can always rely on Tia Williams for a novel with a delicious plot, compelling characters, and all of the pop cultural references my heart desires. Seven Days In June is nothing short of a good time. It's funny, thoughtful in both a real and thotty way, and its protagonist Eva Mercy may not know it, but she is my new favorite pretend writer.\"―Michael Arceneaux, New York Times bestselling author of I Can't Date Jesus and I Don't Want To Die Poor\"What’s on its face is a delightfully steamy read is a story layered with nuance that gracefully examines thornier topics of parenting in the modern age, life with chronic pain, and Black identity. Through it all, Williams’ clever and witty writing will leave you clamoring to be part of Mercy’s world.\"―Reader’s Digest\"Williams has a knack for realistically portraying how childhood trauma lingers into adulthood. In her exploration of how people cope, she also delivers hope: psyches can be mended and relationships can help to resolve pain. Williams doesn’t shy away from the darker aspects of human experience, and her characters are fully formed and believable as a result. This is a winning romance.\"―Publishers Weekly\"Williams’ novel is a tour de force, capturing Eva’s experience as part of the Black literati in Brooklyn, her urge to hide generational trauma from her daughter while still celebrating their ancestors, and the ways in which fate brings people together. The structure of the novel is complex but ultimately rewarding and provides a portrait of a richly layered world. A hugely satisfying romance that is electrifying and alive.\"―Kirkus (Starred Review)\"Williams proves once again that there is much more to romance novels than meet-cutes and other reliable tropes. As she deepens the genre with multilayered characters living full and interesting lives beyond their burgeoning romance without skimping on explicitly perfect sex scenes, her characters embody this storytelling duality. The well-crafted love story alone would delight readers, but Williams generously provides even more. She explores motherhood and womanhood, the passion to write, and the sometimes fine line between romance and heartache.\"―Booklist“With funny, snappy writing and a strong eye for detail, Williams builds a compelling, glamorous Black literary world for the protagonists to inhabit. The book balances a second-chance romance with themes of motherhood, childhood trauma, and life with chronic pain.”―Library Journal“Williams' writing is zippy and fun to read, but her characters are also complicated individuals, making their love feel authentic.”―The Week\"Sparkling with delicious sensuality and an intriguing plot, Seven Days in June by Tia Williams [is] a captivating contemporary story of romantic connection and love in an unforgiving world, overlaid with challenging themes of poverty, disability and childhood trauma that the author fearlessly addresses with grace and tenderness. [It] also shines in its celebration of strong female friendships and the unabashed pursuit of joy, reminiscent of Terry McMillan's beloved '90s classic How Stella Got Her Groove Back. Williams skillfully blends uplifting, hilarious moments into the story through a sensational supporting cast.\"―Shelf Awareness\"Through this gripping love story, Williams reckons with family histories and shows the power in rewriting our origin stories. Readers will feel as attached to these characters as Eva and Shane are to each other.”―BookPage“Steamy as all get-out but also laugh-out-loud funny.”―Scary Mommy“This story is so much more than a rom-com: It grapples with motherhood, chronic pain, and familial bonds. Sharp, funny, and thoughtful, Seven Days in June is exactly what you’d want in a romance-focused novel, and then some.”―Apartment Therapy“An incredibly witty, slightly tear-inducing romance that gives a beautiful nod to the sometimes complicated relationships women can have with their mothers.”―PopSugar“An emotional journey you’re not soon to forget.”―Bookriot“Warm and emotional.”―Insider“The characters are vibrant, bleeding, pulsing, living creatures that crawl off the page and stomp on your heart. Equal parts swoony and razor-sharp, when it's done, you'll want to go again.”―Nikki Payne, Bustle About the Author Tia Williams had a fifteen‑year career as a beauty editor for magazines including Elle, Glamour, Lucky, Teen People, and Essence. In 2004, she pioneered the beauty‑blog industry with her award‑winning site, Shake Your Beauty. She wrote the bestselling debut novel The Accidental Diva and penned two young adult novels, It Chicks and Sixteen Candles. Her previous novel, the award‑winning The Perfect Find, is being adapted by Netflix for a film starring Gabrielle Union.Tia is currently an editorial director at Estée Lauder Companies and lives with her daughter and husband in Brooklyn."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 16 hrs 40 mins",
            "FREE delivery February 27 - 29 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 28",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow 7 AM - 11 AM. Order within 10 hrs 25 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The instant New York Times bestseller and Reese Witherspoon book club pick is \"a heady combination of book love and between-the-sheets love.” (Ruth Ware)“Tia Williams’s book is a smart, sexy testament to Black joy, to the well of strength from which women draw, and to tragic romances that mature into second chances. I absolutely loved it.” —JODI PICOULT, #1 New York Times bestselling author of The Book of Two Ways and Small Great ThingsSeven days to fall in love, fifteen years to forget, and seven days to get it all back again... Eva Mercy is a single mom and bestselling erotica writer who is feeling pressed from all sides. Shane Hall is a reclusive, enigmatic, award-winning novelist, who, to everyone’s surprise, shows up in New York. When Shane and Eva meet unexpectedly at a literary event, sparks fly, raising not only their buried traumas, but the eyebrows of the Black literati. What no one knows is that fifteen years earlier, teenage Eva and Shane spent one crazy, torrid week madly in love. While they may be pretending not to know each other, they can’t deny their chemistry—or the fact that they’ve been secretly writing to each other in their books through the years. Over the next seven days, amidst a steamy Brooklyn summer, Eva and Shane reconnect—but Eva’s wary of the man who broke her heart, and wants him out of the city so her life can return to normal. Before Shane disappears though, she needs a few questions answered... With its keen observations of creative life in America today, as well as the joys and complications of being a mother and a daughter, Seven Daysin June is a hilarious, romantic, and sexy-as-hell story of two writers discovering their second chance at love.A Best Book of the Year: NPR • Kirkus • Marie Claire • PopSugar • New York Public Library • Bustle • Reader’s Digest • Literary Hub A Best Book of the Summer: Harper’s Bazaar • Oprah Daily • Shondaland • The Los Angeles Times • CBS News • PureWow • Good Housekeeping • BuzzFeed • theSkimmA Best Romance of 2021: The Washington Post • USA Today • Vulture • Goodreads • BookPage • BuzzFeed • Happy Mag",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Grand Central Publishing; Reprint edition (June 7, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1538719096"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1538719091"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.3 x 1.25 x 7.95 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,527 in Books (See Top 100 in Books) #44 in Black & African American Women's Fiction (Books) #57 in Black & African American Romance Fiction #65 in Mothers & Children Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 18,457 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5a0030c-9c4f-4b96-a3a2-c3a4c5a887ec.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b30ad4d-3e80-4a50-b0bc-607fffa25192.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/63d56f9e-53ad-4ae6-9244-1e8dbcc441f3.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b45a7150-5a89-4972-9c4f-5de19933fca4.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/06664946-2b51-4a26-ad49-7a7dd4d7919f.__CR0,0,1080,1080_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Christine Melanie Benson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMG6RKM7Y62PZ64MIRH4EPYP7EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QPDB4TFE4RVB?ASIN=1538719096",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2022",
                "reviewTitle": "5.0 out of 5 stars Defies categorization! These characters grew on me...",
                "reviewText": "I initially bought this book simply because I'm an author with a women's fiction book coming out soon, and I wanted to read another women's fiction book by a fellow UVA alum! At first, since the book is about an erotica author and contains pop references out the wazoo, I was tempted to write it off as trendy and trite. That said, this novel quickly drew me in, far exceeding my expectations, mainly because the characters totally drew me in. I'll mention a few notables...Shane: For me, Shane was the perfect male love interest. As a person who's been through my own addictive struggles with food and relationships, I'm a sucker for recovering addicts. As far as I'm concerned, recovering alcoholics are the best of both worlds - they're bad boys, but they're being good! What could be better? Shane was deep and complex and weird and dark but also sweet and kind and vulnerable - not to mention those hazel eyes. Plus, I'm a marathon runner, and I loved that he channeled his addictive tendencies into long distance running. In case I haven't made it clear: Shane checked ALL my boxes.Audre: This tween girl - protagonist Eva's daughter - was so cool! I didn't want to like her, because I don't have kids and don't relate to the whole mom thing. But Audre was really fun! I loved that she was a tween practicing therapy - without a license, obviously, and more competently than plenty of adult shrinks, from the sound of it. It busted and poked fun at a lot of the navel-gazing therapy stereotypes. At the same time, Audre had moments of true childishness which made her a credible and endearing character. In short, an atypical daughter character who kept surprising and delighting me!Cece: I found Cece's borderline cynicism and pragmatic personality refreshing. If this book had any major flaw, it might be the over-the-top romantic nature of the Eva-Shane dynamic. Salty Cece was a welcome counter-balance to this hyper-romanticism. I appreciated that while she was apparently happy and content in her own marriage, her romantic relationship with her husband, Ken, was more ordinary and \"normal\" than the celestial fire between Eva and Shane - good, and good enough, but not unattainably, hyperbolically romantic.Eva: Protagonist Eva was the character who grew on me the most. I'm pretty hyper-healthy, and although I've dealt with my own \"invisible\" health issues in the past, Eva's crippling migraine problem was new for me. Her disability was described in a way that made me have compassion for her without making her seem pitiful or annoyingly needy. In addition, as a writer myself, I also enjoyed hearing about the often ludicrous ins and outs of the writing world. When it came to her writing, Eva's saving grace was that she didn't take herself too seriously. I appreciated the arc of her creative development and how she ultimately abandoned her crowd-pleasing fantasy writing to write about what matters to her.Aside from these main characters, there were many other engaging and enjoyable minor characters who made the book very fun and lively - the literary equivalent of the best sort of people-watching. And as a native New Yorker, I loved all the Brooklyn details. The happy ending was happy, and even better, it didn't come too quickly. The delayed gratification made it that much sweeter.All told, it's clear that UVA alums write fabulous books! Thank you, Tia Williams, for entertaining me, educating me, making me laugh, and opening my heart to the world just a little bit more.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J-Phi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZDLNFSCJY4UFQ7FVWXNDITTN6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB9Z6WGPE3USU?ASIN=1538719096",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2021",
                "reviewTitle": "4.0 out of 5 stars 4.5 Stars of Wow!",
                "reviewText": "There’s a lot going on in this book in the best of ways. On the surface it is witty and smart and incisive as it comments on contemporary Black culture without being a book about race. But what it actually is a story about a society where two young Black kids, representative of so many others, fall through the cracks of dysfunction and end up in toxic cycles of relationships and substance abuse. It’s a love story about a woman with an invincible chronic illness, self-harming tendencies and a lot of emotional baggage, and an emotionally-damaged man struggling with addiction, being brave enough to feel, and a lot of emotional baggage. Somehow when these two lost souls meet, they have to figure out a way to heal and lighten each other’s load.The premise is that single mother Eva is struggling with writer’s block for her long running paranormal erotic romance series when she meets blast from her past, Shane, at a panel about race and is blown away by the strong feelings that never left. But with the trauma and toxicity associated with their past relationship and the weight of the baggage they both still carry, any chance of a second chance romance seems dead on arrival.The best thing about this book is it’s sharp take on contemporary society. It’s full of smart, funny observations and perfectly excerptable quotes about Black culture and Black lived experience that you’ll find yourself nodding to in agreement as you picture the exact cultural reference the author means. This book is heavy on trauma and is potentially very triggering- there is severe addiction, self-harm, sexual assault, abandonment, neglect, self-harm, chronic pain (chronic illness), misogyny, toxic relationships, and others don’t like it. The story itself and the way it is told is also absolutely gorgeous- you fall in love with the characters and root for them from the very beginning. Particular favourites of mine were Eva, Shane and Audre, and perhaps I didn’t really “buy” that Eva-Cece-Belinda friendship and didn’t think it was utilized to the max, but even they were likable and inoffensive. I loved that the book featured marginal groups from society and positioned them as romantic leads- Eva with her debilitating chronic migraines, and Shane, actively in recovery from addiction. I loved the choice of these characters and how they were portrayed. If anything, there was so much unresolved trauma and damage in their lives, it would have been nice for some more of the healing to be on page. This is one of those where you love the couple together but wonder if they’ll be able to overcome the dysfunction long-term.One thing that bothered me a bit about this book is it’s attitude towards romance. It’s not that it was disparaging in anyway- but there’s an air of tongue-in-cheek speak about it in this book sometimes that make it feel like a second class genre or not “worthy” or serious. And I felt like sometimes the author’s fatigue with writing her erotic romance series made her indirectly disparaging of the genre and I didn’t like that. I would have liked to see more of Eva’s relationship with her mother once she decided looking into her family tree.Overall, there’s no denying how fabulous this was. I highly recommend it to everyone- be safe and consider your triggers.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caren McPherson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 6, 2023",
                "reviewTitle": "new book",
                "reviewText": "arrived on time and in perfect condition",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beatriz PradoBeatriz Prado",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 22, 2022",
                "reviewTitle": "se eu amasse mais o livro, meu coração explodia",
                "reviewText": "não sei nem o que dizer. Seven Days in June superou todas as minhas expectativas, que já eram altíssimas. todos os elogios são reais e vai ficar na minha cabeça por um bommm tempo.isso é romance. é esse tipo de drama e angústia e tensão e conexão que eu amo nas histórias. foi impecável, desde enredo, escrita, desenvolvimento do casal até os personagens secundários.e saber que livros como este existem me faz levantar da cama todos os dias.aviso de conteúdo: drogas, automutilação, assédio sexual, alcoolismo, overdose.tropes:- Black love- Second chance romance- Single mom",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41U2O4KpycL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "María Blanco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 4, 2022",
                "reviewTitle": "Great romance story.",
                "reviewText": "There are a couple of scenes in the book that are so well described and developed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claire louise",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 10, 2024",
                "reviewTitle": "Just stunning!",
                "reviewText": "Just wow! What an absolute masterpiece this was. I was hooked from the first paragraph, all the way to the last word. It isn't just a romance, it is so much kire. The character ARCs and growth are handled with such care, even the spice scenes were described perfectly. This book has everything, trauma, addiction, abandonment, fierce black females, strong single mum and love... so much love. Especially between Eva and Audre. I was absolute rooting for Shane the whole way through. The mental health and disability rep was written with such poignancy and tact. It was beautiful, honest, raw and touching and I didn't want it to end!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 7, 2024",
                "reviewTitle": "Super",
                "reviewText": "Tres beau livre, bon état, je recommande",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}