{
    "remaining_requests": 2097,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pestilence-Four-Horsemen-Laura-Thalassa/dp/1728280168",
    "body": {
        "name": "Pestilence (The Four Horsemen, 1)",
        "price": "$11.54$11.54",
        "originalPrice": "",
        "rawPrice": 11.54,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pestilence-Four-Horsemen-Laura-Thalassa/dp/1728280168",
        "soldBy": {
            "sellerID": "A263RIO308P3G8",
            "name": "Goodwill Retail Services, Inc.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A263RIO308P3G8"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/918UPgNLhjL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Laura Thalassa",
            "link": "https://www.amazon.com/Laura-Thalassa/e/B00DN9YA3S/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Goodwill Retail Services, Inc.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 23815,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 10 mins",
            "$3.99 delivery Wednesday, February 28."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=16272"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (August 15, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1728280168"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728280165"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.3 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.25 x 1.04 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,290 in Books (See Top 100 in Books) #109 in Post-Apocalyptic Science Fiction (Books) #655 in Fantasy Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 23,815 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Filipino BookwormFilipino Bookworm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNN7HT4MHSAYI3A54KBYHQPNIFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IL31U4LNZTBL?ASIN=1728280168",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2023",
                "reviewTitle": "5.0 out of 5 stars BOOKWORM REVIEW: Pestilence by Laura Thalassa",
                "reviewText": "RATING: ⭐⭐⭐⭐.5SPICE: 🔥🔥When I first read this book, I was FASCINATED with paranormal romance. The idea of falling in love with an imaginary non-human character, much less a bringer of the apocalypse, was a new concept to me, and I fell in love with this book. Almost four years later, I assumed that re-reading this with a more experienced lens would change my view.I assumed wrong.The Four Horsemen arrived on Earth, creating havoc on humanity. They have killed power sources, infrastructures, and most of all people. One day, they just disappeared, which had humans assuming that they have finally received some reprieve. That is, until Pestilence comes back and starts his ride of doom in North America.In Whistler, Canada, Sara Burns drew the short straw to be the last person standing in her town as most of the townsfolk, including her family, evacuated. Her mission: To end Pestilence as he passes through. The brave firefighter faces her goal head-on but quickly realizes that the Horsemen could not be killed. Now she is his prisoner, going with him through every town as he remorselessly doles out the plague. What's worse is that she isn't sure if it is Stockholm Syndrome or some dystopian disorder, but she certainly could not be developing feelings for him, is she? Maybe the same disorder is making her imagine the looks he throws her way as well..This story is a cult classic because it contains all of the right ingredients with the right balance. The storytelling is perfection. Laura Thalassa did a fantastic job of setting the right pace for different moments in the book. We get the right details to induce an adrenaline rush during the action- and suspense-packed scenes, and I love how she slows down the pace just at the appropriate amount to draw compassion for Sara, Pestilence, and some of the people they meet along the way.The story itself is engaging. Sara and Pestilence are two opposite lenses into humanity, and throughout this journey, we start to see those lenses converge together to see both the beauty and ugliness of this world. No matter at what point or from what perspective in life you approach this read, it gives you a reminder that 1. not everything in life will be roses and rainbows and 2. despite adversities and changes, there is always some good among the people. I love how those reminders are cleverly set up to be the foundation of Sara and Pestilence's connection.Speaking of, the arc of their relationship was well done. You can't get any more enemies than someone trying to end the other, and to slowly untangle that into a happy ending is a feat. A feat that Thalassa crushed really well. I mean, how she managed to create tension even when Sara discovers that Pestilence isn't gone is mind-blowing.The spice is relatively tame. It is not fade-to-black, but it isn't as prolific and creative as I've read in others. (This was the only change in my POV of this book since I last read it. Yeah, I've read a whole lot of spicy books since 2019, it seems.)It is the first of the four-part series, so it can be read as a standalone. I am kicking off a month of binge-reading the series, so I am excited to move on to War.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Ham+XBo6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lady Sashi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKWCMOEXMQFP46TSNSTJ3VMQ4QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38M4JED6RL2BS?ASIN=1728280168",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2019",
                "reviewTitle": "4.0 out of 5 stars Pros/Cons - An Honest Review",
                "reviewText": "All of my reviews for books take this same pro/con format and there are SPOILERS, so be warned. Here we go....PRO: Original take on the 'Four Horsemen of the Apocalypse' trope. The concept that these are Old Testament ANGELS who have been set on a path of destruction by the Christian Yahweh (God) is forgotten by a lot of readers out there, who think of angels as \"Touched By An Angel\" soft and sweet. Not so. Laura T. reminds us of this continually in the story, so we won't make the mistake of believing these creatures are humans with souls. They are not. They are harbingers of the end of times, merciless and driven to one purpose that is theirs alone (re: spreading disease, famine, war, and death to innocent and guilty alike).CON: World-building was very ethno- and religio-centric. Writer assumes the audience is well-versed in Christian mythology, particularly the Apocrypha/Revelations portions of that religion's holy book (we live in a global society now, and many readers come from different cultures and religious backgrounds but can read English, too, and so a little context would have helped them to connect better with the story premise, I believe). Furthermore, it is not stated at the beginning of the book how/why the end has come to the earth, only that it has. This felt like a cheat. A simple one page Prologue would have simplified the matter for us and fixed a lot of these problems with the novel.PRO: Heroine was no push-over; she was feisty and compassionate at her core. I believed this characterization of her merely in the mentioning of her career choice, pre-Apocalypse (a firefighter). That was a clever choice by the author, as it made everything the heroine did believable (from lighting Pestilence on fire to knowing how to fight her way through most scrapes to staying with the dying, not letting them go until they passed).CON: Heroine was cold, distant, and vicious at times, too. I felt like I was being introduced to Katniss Everdeen from \"The Hunger Games\" one moment, then some Victorian romance novel heroine the next. The dichotomy was too difficult a crevasse to jump at times.PRO: Pestilence's drive to fulfill his purpose, the magic that compels him, was a good angle as it brought into the plot the equation of free will versus destiny, and allowed the opportunity for the hero to evolve beyond his 'programming'. That made the romance with a human possible.CON: Pestilence's personality is modeled on the Talmudic idea of angelic behavior, not post-Jesus/new covenant ideas, and so his character is very Old Testament-wrath-and-ruin. It was difficult to like him until the last few chapters of the book, even during moments when he was evolving and learning how to feel emotions. I couldn't connect with his character on a deeper level, honestly, because a lot of his thinking was in his head and we didn't get that POV.PRO: Slow burn narratives are wonderful when you really want to make the audience pant for a couple of come together. Laura T. delivers here, beginning the hero/heroine as enemies, then over time forcing them to respect each other and become something akin to friends, and building up to a romance and sexual interest. The story felt well-paced for this type of narrative.CON: I admit, I was turning pages fast during the first read-through to get to the sex, which is almost at the end of the book. When it finally arrived, though, the sex scene felt..flat. No heat. We'd waited for so many pages for these two to come together physically as well as emotionally, and when they did, it was quickly over and described.....too bit too thin for my tastes. I'd prefer a bit more explicit romance, as I felt this story was classified as New Adult (NA) and not Young Adult (YA), due to the fact the main heroine is a woman in her mid-20's, and not some 16 year old. We don't need erotica, but I've read Regency era romances with hotter sex scenes, honestly.PRO: Use of secondary and tertiary characters was well-done, given all of them were doomed to die anyway. I did like the randoms who showed up to chase them off or inflict drama, and the use of the elderly couple to move the hero into a place of compassion was well done.CON: Saying that, when the end comes, people always feel cheated to varying degrees, regardless of their age and the circumstances of their death. There's always a bit of resentment and fear there, a wish for more time, a regret for something undone or left unsaid. That's been my experience, anyway. That's why I felt the elderly couple inflicted by disease was too unrealistic for me to take seriously. Their forgiveness and acceptance of their death at his hand was a bit over-the-top, especially since they died so horribly. It's one thing to make it quick and find peace from that, but quite another to suffer in agony at the end. There's no dignity there, and that's bound to make even the gentlest hearts angry.PRO: The magic of the horse and the horseman is interesting in this tale. There is suffering by both when injury is inflicted, but regeneration is constant and unfailing. That's an ingenious plot device, as it not only allows for Pestilence to do his heavenly duty (reminding us again that he is sanctified by the one and only deity in this universe to get done what must be done), but it also reiterates for us that the hero is immortal, and one layer removed from humans as a result. It keeps that distinction there, so we never forget that he will not die, yet he has chosen to live with a mortal who will. He will suffer for that choice for eternity once she passes (for all living things MUST eventually die), and all for the sake of love.CON: Pestilence having the power to save his beloved from his disease seemed...far-fetched. He's got one job - to spread illness to kill humans. How does he magically now have the ability to turn that on and off? This is not well-explained in the first book and it breaks the established world-building. One hopes Laura T. will explain this better in future novels.As I look at the future of this series, I now wonder what the end game is for the four horseman? Will their god allow these four imperfect angels (who must all fail in their duties, as to save their one true love from death at their hands) the ability to sire the new generation of hominid life on the planet in the aftermath of the earth's human population meeting its end? Is that, perhaps, what Laura T. is angling for -- a 'Neon Genesis Evangelion' (to borrow the anime title) - a new gospel for the new century? The Old Testament and the Talmud both make reference to beings who were born of angel-human couplings (Nephilim, of which David's giant, Goliath, was believed to be the last). I wonder if this won't be the author's final twist to this series. She so does tend to have delightfully ingenious endings to her stories.Overall, I give the book 3.95 stars out of 5 (chose 4 stars for this review, but since it's really close...well, always round-up, I say!). \"Pestilence\" was well-written (I found no SPaG issues), with fascinating characters and a compelling plot. I purchased it when it was version 1.0, and so got the lovely cover of the couple embracing on the front (revision 2.0 is nice, but I prefer the original, honestly). I never once grew bored with the tale and was anxious to always pick it back up whenever I needed to put it down for a bit.I have already read the preview of \"War\" (Book 2 in this series) that Laura Thalassa has posted on her Facebook Community, \"The Thalassalites\", and it looks quite intriguing. It's to be released soon (most likely July 2019), she says. I cannot wait for the opportunity to tear my teeth into it.",
                "reviewVotes": "57 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGGGXIBAQ3FDLYOOLP43REZGROQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTYE4EAFGRABI?ASIN=1728280168",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Romance with a thought-provoking narrative",
                "reviewText": "This captivating story deals with some deep philosophical questions while not feeling too preachy and providing a romantic love story. I was not really expecting that, but found the narrative to be interesting and thought-provoking. It’s a monster romance reimagined as an apocalyptic event unfolding, where a human is pitted against Pestilence, one of the four horseman. The horseman learns more about humanity while the human learns more about the evils humans do. It’s an interesting balance and I will admit, I wasn’t sure how it was going to resolve, but I was mostly pleased with the outcome. I am curious to see how the story will fit in with the other horsemen’s stories.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Read What I Like",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 18, 2021",
                "reviewTitle": "The First Horseman 👑",
                "reviewText": "Pestilence is the first book in the series The Four Horsemen series by Laura Thalassa, I can tell you this: I’m glad the series is complete because I’m binge reading this!!Laura has a talent with words. Every time Pestilence uttered a sentence, it was beautiful, even when he was being merciless.The couple has a rough start since Sara is chosen to kill the horseman. She didn’t know he couldn’t be killed. That’s when starts a forbidden/enemies-to-lovers relationship. How could two beings so different and with beliefs so distinct work together? One word: love.I would also like to highlight the roles of Ruth, Rob and, of course, Trixie Skillz! I just loved them all! However, if I have to give my heart to one of this characters, it’ll be to Pestilence, no doubt.Now, “Pray for the world, dear Sara. War is coming.”",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruth Hinojos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 5, 2021",
                "reviewTitle": "Love it!",
                "reviewText": "Cuando la peste llega a la tierra y al pueblo donde vive Sara, ella intenta matarlo para que no se propague más la enfermedad, pero lo que no sabe es que no pueden matarlo. Por consecuencia el la toma como su prisionera para hacerla sufrir. Lo que ellos no saben es que este viaje los llevará por caminos que nunca esperaron.Realmente amé este libro, ¡un verdadero enemigos a amantes! Realmente recomiendo esta serie.When pestilence comes to earth and to the town sara lives, she tries to kill him so it doesn't spread the disease anymore but what she doesn't knows is that he ca not be killed. He then takes her as his prisoner to make her suffer. They don't realizes that this journey is going to take them to paths they never expected.I really loved this book, a true enemies to lovers! I really recommend this series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trisha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 7, 2024",
                "reviewTitle": "Amazing!",
                "reviewText": "Devoured this book in 24 hours. It pulled me out of my book slump and I’m jumping straight into the next one. If a book can make me cry it’s an instant 5⭐️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "maram benyounes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 27, 2023",
                "reviewTitle": "amazing book",
                "reviewText": "i really liked it!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle-klant",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on November 16, 2023",
                "reviewTitle": "It's.. fine",
                "reviewText": "Het idee is leuk, de karakters kloppen. Het verhaal komt echter niet op gang en het blijft tot het einde het gevoel van een intro geven.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}