{
    "remaining_requests": 2312,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Meet-Me-Lake-Carley-Fortune/dp/0593438558",
    "body": {
        "name": "Meet Me at the Lake",
        "price": "$10.63$10.63",
        "originalPrice": "",
        "rawPrice": 10.63,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Meet-Me-Lake-Carley-Fortune/dp/0593438558",
        "soldBy": {
            "sellerID": "A1OVE6SOYPPH9T",
            "name": "RNA TRADE LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1OVE6SOYPPH9T&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81ZTFZg5rsL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Carley Fortune",
            "link": "https://www.amazon.com/Carley-Fortune/e/B09D3B3LSK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "RNA TRADE LLC",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 16169,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Fortune explores the aftermath of losing a beloved parent and reclaiming a relationship in this unputdownable, witty, soulful and stirring novel.\"—GMA“This novel, set in Toronto and on a nearby lake, is beautiful, charming, witty, poignant, and all the things you could want in a spring read.”—Katie Couric Media\"Meet Me at The Lake is a beautiful, heart-tugging, love story about secrets, lies, missed connections and second chances. Set against the idyllic backdrop of a family hotel on a rural lake, this novel brims with the warmth of summertime and the feeling of home. An exquisite, emotional read.\" —Jill Santopolo, New York Times bestselling author of Stars in an Italian Sky“A breathtaking tale of star-crossed lovers that gripped me from page one. Meet Me At The Lake is nostalgia, summer breeze, second chances and pure heart.”—Elena Armas, New York Times bestselling author of The Spanish Love Deception “A perfect summery blend of sexy romance and second chances, Meet Me at the Lake is a poignant waltz between evergreen pines and poplars and heartache. I fell in love with Will and Fern over and over and over again.”—Ashley Poston, New York Times bestselling author of The Dead Romantics“Meet Me at the Lake is a tender, sweet story that captures the joy and sorrow of growing up. Carley Fortune's latest is a love letter to moms and daughters, as well as second chances.”—Elissa Sussman, bestselling author of Funny You Should Ask“Carley Fortune is the master of the love story, tapping into our most primal needs—to be valued and seen for who we really are. Meet Me At The Lake is story telling perfection.\" —Annabel Monaghan, author of Nora Goes Off Script“A completely addicting love story about the ways we find who we are and what we want amidst changing dreams and chances missed. Carley Fortune gives us another perfect summer read brimming with heart, a book to devour in a day, swept away in the nostalgia of young, sexy love. Every Summer After fans, this will not disappoint!\" —Ashley Audrain, New York Times bestselling author of The Push \"Readers experience Carley Fortune's writing with all five senses. In Meet Me At The Lake, that means you'll taste Peter's sourdough. You'll hear the sound of the trees swaying by the lake. You'll smell the gin and the watered-down tonic. You'll see Fern waiting down by the docks. And you'll feel every pulse of electricity from Will. This is a beautiful story of letting go of expectations, growing into who you're meant to become, and letting love in when you don't feel you deserve it. The perfect summer read and an excellent follow-up to Every Summer After. Carley's talent sings on every page.\"—Iman Hariri-Kia, author of A Hundred Other Girls\"THE quintessential book of summer. Nestled in the heart of Canada's cottage country, Fortune masterfully crafts yet another enthralling tale of love and second chances that will burrow itself deep into your soul long after the last page.\"—Amy Lea, author of Exes and O’s“Carley Fortune's Every Summer After found TikTok success, and her new romance, Meet Me at the Lake, continues to dazzle.”—Popsugar\"Meet Me at the Lake by Carley Fortune is emotional, fun, and stunningly real.\"—Culturess“There is no summer without a Carley Fortune novel.”—BookRiot\"A perfect beach read to add to your summer TBR list!\"—The Nerd Daily“Fortune (Every Summer After) shines in this beautiful tale of love, loss, and forgiveness. This searing story of hard-won second chances is not to be missed.”—Publishers Weekly“This contemporary romance is an immersive second-chance love story that will transport readers with its dual evocative settings of stunning rural Ontario and thrilling Toronto.”—Library Journal (starred review) About the Author Carley Fortune is an award-winning Canadian journalist who’s worked as an editor for Refinery29, The Globe and Mail, Chatelaine, and Toronto Life. She lives in Toronto with her husband and two sons. Every Summer After is her first novel. Excerpt. © Reprinted by permission. All rights reserved. 1NowI make it as far as the front desk without anyone noticing me. It’s a striking piece, carved from a large tree trunk— ­rustic but not shabby, the epitome of Mom’s aesthetic—­and there’s no one behind it. I hurry past, to the office, then shut myself inside and lock the door.The room is more fishing hut than work space. Pine walls, two ancient desks, a small window trimmed with a flimsy plaid curtain. I doubt it’s changed much since the lodge was built in the 1800s. There’s nothing to suggest how much time Mom spent here, except for a photo of me as a baby pinned to the timber and a faint whiff of Clinique perfume.Dropping into one of the worn leather chairs, I switch on the plastic tabletop fan. I’m already sticky, but it’s stifling in here, one of the few spots in the building without air-­conditioning. I raise my elbows like a scarecrow and swing my hands back and forth. Pit stains are the last thing I need.While I wait to cool off before changing into heels, I stare at a stack of our brochures. Brookbanks Resort—­Your Muskoka Getaway Awaits, declares a chipper font above a photo of the beach at sunset, the lodge looming in the background like a country cottage castle. It almost makes me laugh—­it’s Brookbanks Resort I’ve failed to get away from.Maybe Jamie will forget I agreed to do this tonight, and I can sneak back to the house, slither into stretchy pants, and douse myself with a bucket of cold white wine.The door handle rattles.No such luck.“Fernie?” Jamie calls. “What’s with the lock? You decent in there?”“I need five minutes,” I reply, voice pinched.“You’re not gonna bail, right? You swore you’d do this,” he says. But the reminder is unnecessary. I’ve been dreading it all day. All my life maybe.“I know, I know. I’m finishing up some paperwork.” I clamp my eyes shut at the mistake. “I’m almost done.”“What paperwork? Is it the linen order? We have a system for that.”My mom had a system for everything, and Jamie doesn’t want me messing with any of them.He’s worried. It’s peak season, but many of the guest rooms are vacant. I’ve been back for six weeks, and Jamie thinks it’s only a matter of time before I shake things up. I’m not sure if he’s right. I’m not even sure if I’m staying.“You can’t shut me out of my own office. I have a key.”I curse under my breath. Of course he does.It’s going to be embarrassing if he has to drag me out of here, and I’m pretty sure he’ll do it. I haven’t made a scene at the resort since my senior year of high school, and I’m not about to start. Being here sometimes makes me feel like I’ve regressed, but I’m not a reckless seventeen-­year-­old anymore.Taking a deep breath, I stand and smooth my palms over the front of the dress. It’s too tight, but the ripped jeans I’ve been living in aren’t appropriate for the dining room. I could almost hear Mom when I changed earlier.I know you’d rather wear pj’s all day, but we have to set the tone, sweet pea.I open the door.Jamie’s flaxen curls are cropped short and styled into obedience, but he has the same baby face from when we were young and he thought deodorant was optional.“Is it the linen order?” he asks.“Absolutely not,” I say. “You have a system.”Jamie blinks, not sure if I’m teasing. He’s been the resort’s general manager for three years, and I can’t get my head around it. In pressed pants and a tie, he looks like he’s playing dress-­up. In my mind, he’s still a lake rat in swim trunks and a bandanna.He doesn’t know what to make of me anymore, either—­he’s torn between trying to please me, his new boss, and trying to prevent me from wreaking havoc. There should be a cosmic law against exes working together.“You used to be fun,” I tell him, and he grins. And there, with his deep smile lines and sky blue eyes, is the Jamie who once sang the entirety of Alanis Morissette’s Jagged Little Pill stoned and wearing a purple caftan he’d nicked from Mrs. Rose’s cabin.The fact that Jamie loved attention as much as he loved going commando was one of my favorite things about him—­no one looked at me when Jamie was around. He was a good boyfriend, but he was also the perfect diversion.“So did you,” he says, and then squints. “Is that your mom’s dress?”I nod. “It doesn’t fit.” I pulled it from her closet earlier this evening. Canary yellow. One of at least two dozen brightly colored sleeveless shifts. Her evening uniform.There’s a beat of silence, and it’s all it takes for me to lose my courage. “Listen, I’m not feeling—­”Jamie cuts me off. “Nuh-­uh. You’re not doing this to me, Fernie. You’ve been dodging the Hannovers all week, and they check out tomorrow.”According to Jamie, the Hannovers have stayed at Brookbanks for seven summers, tip like they’ve got something to prove, and refer a ton of guests. From the way I’ve caught him frowning into his computer screen, I think the resort needs good word of mouth more desperately than Jamie’s let on. Our accountant left another message today asking me to call him.“They’ve already finished dessert,” Jamie says. “I told them you’d be right out. They want to give you their condolences in person.”I scrape my nails across my right arm a few times before I catch myself. This shouldn’t be so hard. In my real life, I manage a trio of indie coffee shops in Toronto’s west end called Filtr. I’m overseeing the opening of our fourth and largest location this fall, the first with an on-site roastery. Talking to customers is second nature.“Okay,” I tell him. “I’m sorry. I can do this.”Jamie lets out a breath. “Awesome.” He gives me an apologetic look and then adds, “It would be extra awesome if you stopped by a few tables to say hello while you’re there. You know, carried on the tradition.”I do know. Mom visited the restaurant every single evening, making sure this person liked the rainbow trout and that person had a restful first night. It was bonkers how many details she could recall about the guests, and they loved her for it. She said being a family-­run business didn’t mean anything unless you put a face to the Brookbanks Resort name. And for three decades that face was hers. Margaret Brookbanks.Jamie has been not-­so-­subtly hinting that I come to the dining room to greet the guests, but I’ve shrugged him off. Because as soon as I go out there, it’s official.Mom is gone.And I am here.Back home at the resort—­the last place I planned to end up.Jamie and I make our way to the front desk. There’s still no one behind it. Jamie pauses at the same time I do.“Not again,” he mutters.The desk clerk who’s on tonight started a few weeks ago and tends to disappear. Mom would have fired her already.“Maybe we should cover the desk until she’s back,” I say. “Just in case anyone comes.”Jamie raises his eyes to the ceiling, considering. Then he narrows them on me. “Nice try, but the Hannovers are more important.”We continue toward the French doors that lead to the restaurant. They’re propped open, and the clinking of cutlery and happy hum of conversation drift into the lobby along with the smell of freshly baked sourdough. There are soaring beamed ceilings beyond the entrance and windows that look over the lake in an impressive semicircle. It’s a renovation my mom choreographed after she took over from my grandparents. The dining room was her stage. I can’t picture it without her walking among the tables.Taking a quiet breath, I tuck my white-­blond bob behind my ears, her voice in my head.Don’t hide behind your hair, pea.As we’re about to pass through the doorway, a couple exits arm in arm. They’re in their sixties and swathed almost entirely in beige linen.“Mr. and Mrs. Hannover,” Jamie says, hands spread by his sides. “We were just coming to find you. Let me introduce you to Fern Brookbanks.”The Hannovers give me their kindest smiles, the facial equivalent of a there, there pat on the shoulder.“We were so sorry to hear about your mother’s passing,” says Mrs. Hannover.Passing.It’s a strange word to describe what happened.A dark night. A deer through the windshield. Steel crushed against granite. Ice cubes scattered across the highway.I’ve been trying not to think about Mom’s last moments. I’ve been trying not to think of her at all. The daily barrage of grief, shock, and anger can make it hard to put weight on my feet in the morning. I feel a bit wobbly now, but I try not to let it show. It’s been more than a month since the accident, and while people want to express their sympathy, there’s a limit on how much suffering others can tolerate.“Hard to imagine this place without Maggie,” Mr. Hannover says. “Always had that big smile on her face. We loved catching up with her. We even talked her into having a drink with us last summer, didn’t we?” His wife nods enthusiastically, as if I might not believe them. “I told her watching her run around was making me dizzy, and boy, did she laugh.”My mother’s death and the future of the resort are two topics I’m not prepared to discuss, which is the other reason I’ve avoided the restaurant. The regulars will have something to say about both.I thank the Hannovers and change the subject to their holiday—­the tennis, the beautiful weather, the new beaver dam. The small talk is easy. I’m thirty-­two—­too old to resent the guests or worry about their judgment. It’s her I’m furious with. I thought she’d accepted that my life was in Toronto. What was she thinking by leaving the resort to me? What was she thinking by dying?“We’re terribly sorry for your loss,” Mrs. Hannover says again. “You look so much like her.”“I do,” I agree. Same small stature. Same pale hair. Same gray eyes.“Well, I’m sure you want to head up to your room to enjoy your last night. You’ll have a great view of the fireworks from your balcony,” says Jamie, rescuing me. I give him a grateful smile, and he sneaks me back a wink.We were a good team when we worked together as kids, too. At first, we used a code word when one of us needed rescuing from an annoying or overly needy guest: Watermelon. The elderly widower who wouldn’t stop telling me how much I reminded him of his first love: Watermelon. The bird-watcher who gave Jamie a detailed description of every species he’d seen in the area: Watermelon. But after a summer spending every day together down at the outfitting hut, hauling canoes and kayaks out of the lake, we began communicating silently—­a slight widening of the eyes or a curl of the lip.“Not so bad, was it?” he says once they move toward the elevator bank, but I don’t reply.Jamie extends his arm to the dining room entrance. Many of the people inside will be guests of the resort, but there’ll be plenty of locals. With my luck, someone I went to high school with will spot me as soon as I step inside. Blood roars in my eardrums like a transport truck on the freeway.“I don’t think I can do this,” I say. “I’m going to go back to the house. I’m exhausted.”It’s not a lie. The insomnia began as soon as I got back. Every day, I wake in my childhood bedroom underslept and a bit disoriented. I look at the dense tangle of tree branches out the window, reminding myself where I am and why I’m here. In the beginning, I’d put a pillow over my head and go back to sleep. I’d rise around noon and stumble downstairs, filling the rest of the day with carbohydrates and episodes of The Good Wife.But then Jamie started calling with questions, and Whitney popped by without warning often enough to give me a talk about how much time I was spending in my pajamas—­the type of tough love only a best friend can provide—­and so I began getting dressed. I began leaving the house, visiting the lodge, wandering down to the family dock for a swim or to drink my morning coffee, the way Mom used to. I’ve even gone out in a kayak a few times. It feels good to be on the water, like I have a shred of control, even if it’s just steering a small boat.I’m still greeted by a procession of grief, anger, and panic when I open my eyelids, only now it passes quietly instead of clanging like a marching band.Over the last couple of weeks, Jamie has patiently updated me on everything that’s changed in the many years since I’ve worked here, but what’s wilder is all the stuff that hasn’t. The sourdough. The guests. The fact that he still calls me Fernie.We knew each other long before we started dating. The Pringle cottage is a couple bays down the lake. His grandparents knew my grandparents, and his parents still come to the restaurant for fish and chips every Friday. They spend most of the summer in Muskoka now that they’ve retired, venturing back to Guelph in September. Jamie rents a place in town, but he bought the vacant lot next to his family’s to build a year-­round home. He loves the lake more than anything.“It’s Canada Day,” Jamie says. “It would mean something to the guests and the staff to see you. It’s the start of summer. I’m not asking you to get up on the stage and make a speech before the fireworks begin.” He doesn’t need to add, The way your mom did. “Just go say hello.”I swallow, and Jamie holds my shoulders, looking me in the eyes. “You can do this. You’re so close. You’re already dressed. You’ve been in there a million times.” He lowers his voice. “We’ve done it in there, remember? Booth 3.”I let out a huff. “Of course you know what booth it was.”“I could draw you a map of all the spots we desecrated. The outfitting hut alone . . .”“Stop.” I’m laughing now, but it’s slightly frantic. Here I am with my ex-­boyfriend, talking about the places we’ve had sex at my recently deceased mother’s resort. I’ve been punked by the universe.“Fernie, it’s no big deal. That’s all I’m saying.”I’m about to tell Jamie that he’s wrong, that it’s a very big deal, but then I see an excuse in the corner of my eye. A very tall man is wheeling a silver suitcase up to the front desk, and there’s still no one behind it.The skyscraper’s back is facing us, but you can tell his suit is expensive. Custom made, probably. The black fabric is cut to his frame in the kind of impeccable manner that requires precise measurements and generous room on a credit card. I doubt an off-­the-­rack number would be long enough for this guy’s arms, and the cuff of his sleeve is perfect. So is his slicked-­back hair. Inky and glossy and as meticulously styled as his jacket is tailored. He’s overdressed, to be honest. This is a beautiful resort, one of the nicest in eastern Muskoka, and the staff is always well put together, but the guests tend to keep things casual, especially in the summer.“I’m going to go help him,” I tell Jamie. “I need practice with check-­ins. Come make sure I do it right.”There’s no arguing. We can’t just let the fancy man stand there.As we round the desk, I apologize for making him wait.“Welcome to Brookbanks Resort,” I say, glancing up quickly—­ even with me in my heels, he’s got almost a foot on me.“Did you have any trouble finding us?” I ask, punching a key to wake up the computer. Tall dude still hasn’t said anything. The last stretch of road is unpaved, unlit, and has some wicked turns through the bush. Sometimes city people find it stressful, especially when they arrive after sundown. I’m pegging this guy as a Torontonian, though he could be from Montreal. There’s a medical conference starting next week—­some of the doctors are arriving early, making a holiday of the long weekend.“No.” He runs a hand down his tie. Says nothing more.“Good.” I type in my passcode. “Are you with the dermatologists?” I navigate to the main menu, and when he doesn’t answer, I clear my throat and try again. “Do you have a reservation with us?”“I do.” He says the words slowly, like he’s scanning them for errors. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 19 hrs 34 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 49 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 18 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "THE INSTANT #1 NEW YORK TIMES BESTSELLER!A Most Anticipated Book by Today ∙ Oprah Daily ∙ Katie Couric Media ∙ BuzzFeed ∙ SheReads ∙ Zibby Mag ∙ PopSugar ∙ BookRiot ∙ Culturess ∙ Her Campus ∙ The Everygirl ∙ and more!A random connection sends two strangers on a daylong adventure where they make a promise one keeps and the other breaks, with life-changing effects, in this breathtaking new novel from the New York Times bestselling author of Every Summer After.Fern Brookbanks has wasted far too much of her adult life thinking about Will Baxter. She spent just twenty-four hours in her early twenties with the aggravatingly attractive, idealistic artist, a chance encounter that spiraled into a daylong adventure in the city. The timing was wrong, but their connection was undeniable: they shared every secret, every dream, and made a pact to meet one year later. Fern showed up. Will didn’t.At thirty-two, Fern’s life doesn’t look at all how she once imagined it would. Instead of living in the city, Fern’s back home, running her mother’s lakeside resort—something she vowed never to do. The place is in disarray, her ex-boyfriend’s the manager, and Fern doesn’t know where to begin.She needs a plan—a lifeline. To her surprise, it comes in the form of Will, who arrives nine years too late, with a suitcase in tow and an offer to help on his lips. Will may be the only person who understands what Fern’s going through. But how could she possibly trust this expensive-suit wearing mirage who seems nothing like the young man she met all those years ago. Will is hiding something, and Fern’s not sure she wants to know what it is. But ten years ago, Will Baxter rescued Fern. Can she do the same for him? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Women's Fiction",
                "link": "https://www.amazon.com/Womens-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=542654"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (May 2, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593438558"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593438558"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1.1 x 8.1 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,573 in Books (See Top 100 in Books) #332 in Women's Domestic Life Fiction #337 in Contemporary Women Fiction #2,580 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 16,169 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55c86407-3938-4e05-8cdc-ce78124abf8f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c5b1268-70c4-4689-92c2-fdd193ad72e6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a77c4ab-c71e-4bd4-8536-6599e548e923.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Librarian Linda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUH3AIMBVL3YQUK4QXGDW5D5UCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NN0HXJZMMB0I?ASIN=0593438558",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Better late than never!",
                "reviewText": "I picked up this book because of the hype around it. When it was announced it might be turned into a movie and why and by whom, I wanted to see for myself why it was believed it was similar to another couple's story. I don't see the connection, and hope that it remains as a book only, as I don't think it can be approved upon, as a movie. Ms. Fortune wrote it, as it should be and not muddled to fit any particular actress.As for the story itself, it is well worth the read. It is also educational, particularly after the \"Behind the Book\" chapter.I enjoyed the story thoroughly and read it in one sitting. The characters are well developed, the story is intriguing, and the conclusion will give you pause to think about when to give up on something and when to fight for what is important, and what it means to be truly vulnerable.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZA27KYIOMC5T3T2MDOGMNFIUSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZN6JNTPZGSHA?ASIN=0593438558",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Good read",
                "reviewText": "I really enjoyed this book. She has an interesting writing style with each chapter switching from past to present telling the story of how the two main characters lives came together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sophie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMNMC2TRPUF2377NEN3N7S52S5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KUFH3A36VJEG?ASIN=0593438558",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 28, 2023",
                "reviewTitle": "3.0 out of 5 stars Missed opportunity.",
                "reviewText": "3 starsDo you ever feel bad for the author when writing a less than perfect review? Because that’s how I feel right now especially after having read the author’s notes in which Carley explains that she really struggled to write this one.But I swore to always be honest in my reviews so here we go, no matter what.Is that book bad?No.There are plenty of things that I loved like:-The set of side characters. From Fern’s best friend looking like an overenthusiastic puppy to the Roses, the old eccentric guests making cocktails, to Peter’s solid and discreet presence, they all helped me see that world, make it real.-The setting. A resort alongside a Canadian lake. I could see myself swimming or hiring a canoe. I heard the birds in the trees, saw the dining room with guests etc. It felt like being on holiday.-The pacing. It was just right for the story. We switch between past, when Fern met Will and now, ten years later. It was steady, not too fast nor too slow and fitting to have the story unfurl slowly, recounting past events and present traumas.-The meet cute. Fern and Will’s day in the city ten years ago was the perfect romantic meet. It felt like a bubble in time where everything is ripe with possibilities. Will was the promising and handsome artist, Fern was prickly and undecided yet about her future. Both on the brink of a new life.-Fern. I think Carley Fortune wrote Fern very realistically. She is full of doubts, is looking for her path in life. Past Fern had her demons, understandably so and went through a wild phase. New Fern is more mature but still struggling after her mother’s death. She will grow a lot in the story.-The ending. Thank god we had these last 10 percent! That helped explain a lot about Will’s decision and had me feeling a smidge better.ButI am a reader and reviewer very much driven by my emotions and feelings.And what I felt very often was extremely frustrated!I was angry with Will. He never showed up nine years ago and now that he is back, he gives no explanation, no excuses. And Fern chooses to go with it???Sorry but if you don’t show up and you make a mistake, you GROVEL!You explain and hope it’s a fantastic explanation to beg for forgiveness.Not knowing what happened had me keeping Will at arm’s length. I didn’t trust him and didn’t warm up to him, even if he was kind of a baby whisperer. And I didn’t understand Fern in her decision to take a risk, knowing that her heart could be crushed again. Even if at the same time I admired her bravery.As a character driven reader, not liking Will really dampened my enjoyment and is the main reason for my low rating alongside the lack of groveling.What I would have liked to see more of was grief.Fern just lost her mom. We get passing mentions that she misses her mom and see her reading her diary but I think the story would have gained even more depth if we focused more on the grief stages. I don’t mean to make it a sob story or the core of the book but it was nearly brushed under the rug. Or at least, that’s how I experienced it.As you can see, that book has a lot of assets but also missed the mark for me.Does that mean that Carley Fortune is a “one book” author like she feared? Certainly not as she has proven that she can write. I just hope for her that her next story will “spill out” of her like Every Summer After did.Also, I haven’t looked at any review yet so I might be in the minority here. So go check other opinions (like I’ll do now 😉 ).",
                "reviewVotes": "67 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katrina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHH4MYKGFOEQGDURMBOMWJ5MNJ7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XUZEL5NC3JNX?ASIN=0593438558",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars So good",
                "reviewText": "I loved it. Vivid portrait of the impact one day can have on two young lives. Loved the mother daughter relationship. I'm also a lake person loved the evocative setting. Don't miss this one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lyndsey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDOYRF6HK647MYFL42WCGL5H4QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5E6Z63ZAZ7ZN?ASIN=0593438558",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "4.0 out of 5 stars fell good story",
                "reviewText": "This was a feel good story that was easy to love from start to finish. I was rooting for Fern all along.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stefanie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEQQDB6BDYWNILA4EZT3ZX6PY7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OILWNJAC4ITY?ASIN=0593438558",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Second Chance Romance With Dirty Dancing Vibes",
                "reviewText": "When I love a book (or anything, really) I cannot shut up about it. Enter: Meet Me at the Lake by Carley Fortune. In her sophomore release, two characters meet by chance in Toronto and spend the day together, making plans to see each other again one year later. When Fern shows up and Will doesn't, she's left heartbroken and wondering what could have been — until he shows up 9 years later at the resort she's taken over from her mom.Meet Me at the Lake is equal parts funny and tender. I loved the way Fortune brought the characters to life, giving each of them quirks that complicated their relationship and, ironically, drew them together in the end. Both characters are loyal and committed to the things and people they love, and it's these characteristics that almost threaten their HEA. (Don't worry! You'll get one!)Fortune's descriptions are also worth mentioning, as she has some truly great one-liners that made me giggle alone in an empty room:\"I don't know why I find his ankles so compelling. I'm like a Regency Era viscount hoping for a flash of flesh.\" (As a historical romance reader, I CACKLED)\"'You are officially cut off,' I say, trying to act like it doesn't bother me that Will's ex is as hot as a Jonas brother wife.'\"So far, I've posted all about this book on my socials, texted my friends about it and bought it as a birthday gift. I loved it so much that I'll probably read it again before the year is over. I bet if you give it a shot, you will too.This book is for anyone who loves:👙 Vacation reads🔥 Steamy open-door scenes⛺ Summer camp resort / Dirty Dancing vibes🗣️ Dual timelines, including a day-long, love-at-first-sight meet-cute🎨 \"A business dude with the soul of an artist\"💕 Mutual pining, second chance romance, and men in aprons (IYKYK)💊 Mental health visibility👑 A satisfying happily-ever-afterNote: As a trigger warning, please be aware that this text has a storyline that includes grief, anxiety and an off-page death of a parent.Thank you to NetGalley and Berkley Publishing Group for allowing me the chance to read and provide an honest review of this book! I've posted this review on GoodReads and across my social platforms, as well as Amazon and B&N listings.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Camy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV2PBRGNNOYKLSPZQATRJKZQSVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A3M1X15OXGZ5?ASIN=0593438558",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Love love love it!",
                "reviewText": "After being obsessed with every summer after, I needed another read like this ! I loved reading the past chapters but also loved seeing how Fern was able to develop! Can’t wait for the next book in May!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica Fernandes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2024",
                "reviewTitle": "loved it from start to finish",
                "reviewText": "There are many versions of live stories in this book. Mother and daughter. Brother and sister. Best friends. And lovers. A beautiful book about imperfect messy lives.Carley is quickly becoming my favorite author for these feel good books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 28, 2023",
                "reviewTitle": "couldn’t put down",
                "reviewText": "Great read, well written , started one day and finished the following day.Loved the characters all with lots of depthThank you Carley",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maranda Franklin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 14, 2024",
                "reviewTitle": "A beautiful second-chance romance",
                "reviewText": "\"Meet Me At The Lake is a charming, romantic summer read based upon second chances and missed connections. It is a very heart-warming and emotional read.\" ~nerdywordyreviewsFern Brookbanks never wanted to take over the family resort. She pushed that off years ago when she decided she wanted to stay and live her life in Toronto as she saw fit. However, the universe had different plans for her. Here she stands at her family resort in the Muskoka's trying to decide what to do. Does she continue her life in Toronto and sell the family resort, or stay and make it her own? Fern has lived most of her adult life reminiscing and wondering what could have been with Will Baxter. The one who got away ten years prior. While the Brookbanks resort has her full attention and the decisions need to be made a stranger from the past arrives at the resort. Fern is shocked, confused, and overwhelmed at seeing Will Baxter, in the flesh checking in.Will Fern get the answers she wanted from 10 years ago when her heart crumbled?This is the second Carley Fortune novel I have had the pleasure of reading and I LOVE her contemporary romance stories. They are so well written and descriptive that you can feel the emotion of the characters within the story.The timeline goes back and forth from the present to the past when Fern and Will originally met. Giving the reader a full view of their story. The back-and-forth transitions are smooth and easy for the reader to follow.Carley Fortune writes her books based in Canada which helps Canadian readers, or travelers put themselves into the character's locations.This is a beautiful novel about missed opportunities/relationships, and second-chance romance.Meet Me at the Lake was a nominee for Goodreads Best Romance 2023.Carley Fortune has a new novel \"This Summer Will Be Different\", set to release May 7, 2024. The setting will be on Prince Edward Island. Her first novel also based in Ontario is titled, \"Every Summer After\".",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Catherine A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 28, 2023",
                "reviewTitle": "Boring Characters",
                "reviewText": "Almost gave up finishing this novel. Too much like a Harlequin romance which I haven’t read in years. Too much fixation on Will. Will not recommend it to my friends!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "little bookworm",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 13, 2023",
                "reviewTitle": "Second chance romance",
                "reviewText": "Following the sudden death of her mother, Fern's life is turned upside down. She finds herself back at Brookbanks Resort, the family business that has now been left to her, but that she had never wanted, and even worse, it is now in trouble. Still it is the final straw when Will Baxter turns up to announce he is here for the summer, as arranged with her mother, to offer his expertise to help with the business. Will and Fern met ten years ago, shared one glorious day together, after which he failed to show up to meet a year later as arranged. It was enough that he broke her heart all those years ago, such that she couldn't possibly stand to have him around now, and yet it turns out she might just need his help enough to have to put up with him.I loved Fortune's debut novel, Every Summer After, and was very much looking forward to her follow up. I will say from the off, that this for me at least, was not a patch on the former. It did share certain similarities with Every Summer After, in that for the most part the story alternates between past and present, and much of the setting is at a Canadian lake-side resort, giving the book a very summery vibe.I did for the most part still enjoy this book, though the pace did rather drag at times, especially in the present day setting, and one of my main gripes was that I didn't really find the situation between Will and Fern believable. Their day together in the past is fun to read, and I did think they had great chemistry, however, it was a bit too insta-love, and frankly a bit hard to believe that Fern would be so hung up over him for so long when he didn't show up a year later, after just that one day, not to mention that neither ever made any attempt to reach out to the other on social media at any point.Then in the present day, the author's reasoning for why Will is now so changed and mysterious, and why he continues to keep Fern at arm's length just lacked conviction for me. The mental health aspects I could understand and appreciate, however, I don't necessarily think they were explored as well as they could have been. Will just comes across in the present day as blowing very hot and cold a lot of the time, and to be honest the author's reasons came across as somewhat forced.Much of the book, both in past and present time frames, deals with life choices in general, the complexities of pleasing those you love and yet also living the life you want. This particularly applies to Fern, but also to Will in the present day. I did generally appreciate this theme, and the way that, at different times in their lives, Will and Fern are able to help each other when they are struggling with these choices. It did, however, at times feel a bit repetitive and as if we were going around in circles, as in the past and present Fern is very much facing the same question, does she take up the business at Brookbanks or live her own life in the city?There were some fun side characters such as Jamie and Whitney, and I liked Peter in particular, however, their roles were quite minor.The book also looks at coping with loss, and there is a thread throughout regards to what was Fern's often complex relationship with her late mother, which I thought was rather bitter-sweet. I'm not sure how much actually having her mother's diary entries added for me personally though, nor the focus on her relationship with Peter. It wasn't that I didn't like the idea, it was just the execution that fell a little flat and overall just felt somewhat clunky.Overall, this book probably had a more melancholy and reflective vibe than Every Summer After, that I could appreciate, however, aspects of the pacing let it down, and whilst parts of the romance were sweet, it didn't have me as invested as her debut.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}