{
    "remaining_requests": 2317,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Only-Beloved-Survivors-Club-Novel-ebook/dp/B013Q70EWM",
    "body": {
        "name": "Only Beloved: George's Story (A Survivors' Club Novel Series Book 7)",
        "price": "$7.99",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Only-Beloved-Survivors-Club-Novel-ebook/dp/B013Q70EWM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81mBtBOnjUL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mary Balogh",
            "link": "https://www.amazon.com/Mary-Balogh/e/B000APVMYI/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4165,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B013Q70EWM"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (May 3, 2016)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 3, 2016"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 784 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 399 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#126,205 in Kindle Store (See Top 100 in Kindle Store) #688 in Historical British & Irish Literature #3,245 in Regency Historical Romance #3,564 in Regency Romances"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,165 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Desirée Power Dutcher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUCEQSPZOWGAE6BK5NAB6TBOJXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWNELTX9Z9OMI?ASIN=B013Q70EWM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars fabulous ending",
                "reviewText": "Wow, George gets his happy ever after. Such a good story. Although reading this at age 38 and feeling a bit touchy about all the old people comments… haha reminds me to get up and make sure to love my life to its fullest. This story and the epilogue were so good. Loved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Judge Tabor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEWMHGPPQF7HDFVR53CIS6RLX6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18MWFO3HJGLAW?ASIN=B013Q70EWM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 11, 2016",
                "reviewTitle": "4.0 out of 5 stars At Last - George Finds Love",
                "reviewText": "The Survivor Series has never been a favorite series of mine. Still, it's Balogh and I think I've read nearly every book she's written, if it's out on Kindle. This book is probably my favorite of all the Survivor books. Although there is what I consider to be a somewhat slow and methodical manner in the build up in the storyline, it still held my interest enough to give a four star rating.I didn't find the H/h all that exciting, but the fact they were both older than the typical pairing in these types of books - the fact Dora was a spinster virgin who was firmly on the shelf at nearly 40 years of age brought a freshness to the romance, in my opinion. Our handsome, George, who gave much of his life toward bringing about healing for the Survivor group must, of course, be a first rate person all the way around. I adored the way George treated Dora - the reassurances, the lovely gifts, his appreciation of her musical gifts, the lack of expectations placed upon her \"duchess\" role - he was a gem.As the book progresses, it's soon evident that George's backstory is much more involved than anyone could imagine. Perhaps other readers guessed about 1/3 of the way into the book the reason George simply would not talk about his former wife nor the circumstances surrounding her death - being very vague about his life before the Survivors came into his world. Dora doesn't insist George share, but her puzzlement becomes deeper and deeper. At some point, it becomes obvious, George was foolish not to share certain details with Dora. The one part that seemed silly beyond measure was when the \"sensible\" Dora makes decisions that place her life on the line. Some of this seemed a bit contrived. Still a lovely \"love\" story in many ways.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Texanne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNLHLGEKNQSRJ5WZTQCQM33GQLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O2DMILGZZNEN?ASIN=B013Q70EWM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 17, 2016",
                "reviewTitle": "5.0 out of 5 stars A FITTING CLOSURE TO A WONDERFUL SERIES",
                "reviewText": "I am a fan of Mary Balogh's writing. I have enjoyed each book which is a part of the Survivor's Club series. This final book in the series is a fitting conclusion.George has been the glue which held the group together. He opened his home to soldiers who were severely injured in the Napoleonic War. He spent his own money to hire medical personnel to help with treatment. He devoted his life to making better lives for the injured. In the process, he found 6 friends who became special to him. For 3 years, the friends stayed, supported one another and finally felt strong enough to leave his home and return to life.After the sixth member of the group has married, George realizes that his life is a very lonely one. He is a Duke, he is very wealthy, but he feels alone. Seeing others develop new lives and relationships has brought home to him that at the end of the day, he lives alone.George realizes he wants to marry. He also realizes that the woman he wants to marry is Dora.Dora is a music teacher. Her sister Agnes, has married one of the members of the Survivor's Club. She is a single woman who has built her life in a small village. Dora is certain that she will live alone for the rest of her life, but she has learned to be content. She has happy memories of the few days when she became acquainted with The Duke of Stanbrook. He made her feel special. He admired her musical talent and he spent time being attentive to her. He was kind.When George shows up at her cottage and proposes marriage, Dora is stunned. But, after the realization that this is really happening, she accepts. A new life begins for both of them.Ms Balogh builds each story with a strong foundation. In the early part of this book, we get to know Dora and George. Their personalities shine through. Both of them have had some hurdles to overcome. Hardships from the past have created strength of character.Neither one of these people are “young”. In the Regency period, they were considered past the time when passion, love and attraction would be a part of life. This story illustrates that at any age, passion, love and attraction can grow.Life does not go in a straight line. At the wedding there is a shocking interruption. George ignores it. Dora believes things will be explained in the future and is willing to wait.Both Dora and George have secrets which have influenced who they are. It takes a longer time for George to become willing to share. He feels his secrets are more damaging and dangerous. Slowly, Dora puts clues together and believes she understands his past.Each of the couples from the earlier Survivor's Club books appear here. But, they are mostly peripheral characters. This is the story of two people who must learn to adjust to one another and to life as a couple.This is a character driven plot. The development of the married life of Dora and George is the main theme. The reader learns of life of the wealthy during that period in Britain. We also learn how Dora and George learn to thrive and blossom in their new lives. As secrets are exposed to light, life seems to become easier. But, things are not always as they appear.Dora and George are two very good people. They deserve not only their own story, but also the chance for a new life, filled with surprises, serenity and joy.I have enjoyed this final chapter. I am grateful to Ms Balogh for giving us a sunny finish to the series. I feel sure I will reread all the stories to be reminded of courage, strength of character and the power of love.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 24, 2023",
                "reviewTitle": "Truly incredible!",
                "reviewText": "What a book to end such a great series! Maybe my favorite?!... Unsure really... The story is so rich, so touching and so full of love. Loved the epilogue as well. I am sure I will re read this series many times!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MMBA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 23, 2020",
                "reviewTitle": "Great!",
                "reviewText": "A great book for those who likes a more realistic historical romance, but don’t want to leave the romance behind.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 27, 2017",
                "reviewTitle": "HAPPY ENDING TO THE SERIES!",
                "reviewText": "George, a Duke, meets Dora at a soirée held by his dear friends Sophia and Vincent. Dora is the village’s music teacher and both Vincent and Sophia receive lessons from Dora. She is also the older sister to Agnes, now being courted by Flavian, Lord Ponsonby. Dora plays the pianoforte as well as a harp for the guests and is later walked home on George’s arm.As we fast forward to the next year, imagine Dora’s shock when George comes calling and proposes marriage! She accepts and the societal whirlwind begins. At their wedding, however, George’s previous brother-in-law stands up to make a horrifying accusation. He says George had murdered his wife and son and shouldn’t be allowed to put his betrothed in such danger.Of course, there is a lot more to this story and it is thus that Mary weaves her tale.This series has been an eye-opener as to what life was like for women in earlier eras and I couldn’t recommend it to all with great enthusiasm,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mj",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 26, 2016",
                "reviewTitle": "Interesante y Conmovedor",
                "reviewText": "Es una historia preciosa, todo lo relacionado con la edad de los protagonistas hace un tema muy interesante y conmovedor. Me da pena terminar esta serie.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "patricia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 17, 2016",
                "reviewTitle": "Gelungene Liebesgeschichte mit zuviel Nebenpersonen, die durch die Zeilen huschen",
                "reviewText": "George Crabbe, Duke of Stanbrook, führt den letzten Survivor zum Traualter u erkennt, dass er nicht mehr alleine sein möchte und eine Partnerin u Freundin wünscht. Und zwar nicht irgendeine, sondern möglich scheint ihm in dieser Rolle nur Dora Debbins zu sein, die ältere Schwester von Agnes Keeping, die er beide vor einem Jahr kennenlernte.Was nun folgt ist einerseits eine eher ruhige, reife Liebesgeschichte, die mir sehr gut gefallen hat. Ergänzt wird sie durch die Aufarbeitung der schwierigen Vergangenheiten sowohl von Dora als auch von George, dessen \"vergrabene Leichen\" besonders undurchsichtig sind und der hartnäckig schweigt, was besonders unangenehme Folgen hat. Dieser Anteil der Geschichte bringt zwar Spannung und Lebensgefahr, war aber keine storyline, die mir sehr behagt hat.Als Störung empfand ich die häufigen Auftritte der anderen Survivors, samt Ehegesponsen und Erklärung deren Vorgeschichten. Manche Leser lieben es, wenn im Abschlussband einer Serie alle Teilnehmer nochmals ausführliche Auftritte haben und man erfährt, wie es mit ihnen weitergegangen ist (und wie die Kinder alle heißen, die sie gekriegt haben ..) – ich fand es nervig.Plus: Beide Helden sind sehr sympathisch und handeln authentisch.Minus: Ein zu verschlossener Held und zu viele Kurzauftritte der Helden früherer Bücher.Knappe 4 Sterne.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}