{
    "remaining_requests": 2144,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Her-Duke-Thirty-Days-Historical-ebook/dp/B0CS4MS3H3",
    "body": {
        "name": "Her Duke for Thirty Days: A Historical Regency Romance Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Her-Duke-Thirty-Days-Historical-ebook/dp/B0CS4MS3H3",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/816njeeTYUL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Tiffany Baton",
            "link": "https://www.amazon.com/Tiffany-Baton/e/B08TB3PXFC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 197,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CS4MS3H3"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Cobalt Fairy LLC (January 10, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 10, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3504 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 408 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,442 in Kindle Store (See Top 100 in Kindle Store) #59 in Historical Regency Fiction #95 in Victorian Historical Romance (Kindle Store) #161 in Regency Historical Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 197 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/5f537a4b-a1da-4d62-b941-0daf709e8670.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marcy G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE76BAELYPHA2Q6CIHRWEHZVVXMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TJZS2IYXJL8D?ASIN=B0CS4MS3H3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Thirty Days Of Pretend Turns Into A Lifetime Of Love !",
                "reviewText": "Her Duke For Thirty Days is a deal made to have a Pretend Relationship ! Thinking they could fool their families . Neither believing in Love it should be easy ! With a scandal thrown in the plans take a turn. A sudden wedding takes place. Plans Out The Window ! Emotions Running High ! Feelings Being Fought ! Pasts Keeping The Future At Bay ! Family Interference ! Oh MY ! Everything Going Amuck ! Can this Fake Marriage become A Real Love ? It is quite sad !Phyllis St.Clair the daughter of the Earl of Cregstone was the middle daughter. Her older sister and Mother left some damaging feelings of what Love can do. Now left with her younger sister and Father things were still not so great. The Earl was demanding her to marry .Something she had no intentions of doing.Alexander Gale the Duke of Woldave needed to marry to save his family from ruin and debt. He only wanted a marriage of convenience not believing in Love.Phyllis and Alexander meet when her Father decided she was to do her duty to the Family and marry. After talking with Alexander they devised a plan that for 30 days they would pretend that they were suited for each other and go along with the Betrothal . When a scandal happened the wedding got moved up ! Now suddenly married what were they going to do ? Can Faking Love bring out the Real Deal ?This Emotional Tale brings out the sadness that they had suffered . Begging for Happiness , Opening Up to Love ! Looking for the Happy Ending ! Expect Tears along the way ! A Wonderfully Told Story !",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JustJeri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHBLAHCHQSSHGMWMM23QNR7XAKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CNKLMZ2OAPLK?ASIN=B0CS4MS3H3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars Phyllis and Alexander",
                "reviewText": "This simple, sweet historical romance focuses on two individuals, Phyllis and Alexander, who never have had an interest to marry, and are forced to do so due to a scandal occurring with the Phyllis’s sister. Initially the marriage is tolerable for the couple, as they each try to find their footing in this unexpected relationship. The author does an excellent job in providing believable conflict for the couple, and emphasizing their past histories and insecurities to express their uncertainties about their relationship. I enjoyed how the author paced the story, as the scenes flowed easily and logically. The story is similar to a cozy romance, without the major dramas and villains, but heartwarming and perfect for any age reader.There were a few editing errors that subtracted a star. Several gender/personification errors, his for her, her for him, and several typos. Also, after her sister was married, her husband was incorrectly called “her betrothed.” I received a complimentary ARC, but I am voluntarily offering my personal opinion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6CJJE3JRO3OU4GC5OQFUIK4O7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXELB5EW7YFAV?ASIN=B0CS4MS3H3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Best laid plans",
                "reviewText": "Phyllis and Alexander both had similar plans regarding marriage in the beginning. After coming to know each other, they found that they liked each other or loved each other secretly. Through trials and tribulation they eventually admitted the love that they had for each other when they could have lost each other because of misunderstanding and interference with their families. It was a happy ending for both of them when they confessed true love for each other. It was nice to see that their original plans did not take place. Great storyline looking forward to the next one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tracy B. Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGPYTWVHRDS4YSMHMV3SIISGCGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MWED3YKWLV50?ASIN=B0CS4MS3H3",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "3.0 out of 5 stars Not bad.",
                "reviewText": "Her Duke for Thirty Days: A Historical Regency Romance Novel is a clean, nice, kind of sparkly story where everything is delightful and perfect. The people are all beautiful and everything is gently and \"delicately\" resolved. The H/h have a difficult time communicating due to personal fears but come to understand their fears and overcome their doubts. Perfectly, gently and delicately. This book is a little hard for me to rate because it wasn't bad, just a little boring. I think it needed more humor and contrast to balance it out.Now, saying this, a soft easy book is not always a bad thing. Sometimes we need gentle sunny perfection in the stressful times of our lives.However, if you are looking for something grittier with less expositon from the main characters, this is not the book for you.To me, the book finally got more interesting when Charlotte showed up. And even her issues were solved just a little too neatly.I think this story would be better served with a little more ugliness to balance all the sweetness. For example, we have hints as to why the mother left but nothing concrete. And where did she go? How did she die? Why did none of the daughters realize how selfish she was? Did the Father truly love her? What were his motivations? These things were hinted at, like just the smallest taste of a dish, but to me needed more meat. I kept waiting for something exciting to happen but it never really did.The writing could use a little assistance as well. There was a lot of same word repitition and it was just a bit cloying. Quite a bit of 'telling' but not really enough 'showing'. Again, not dreadful but rather bland.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BBumbolow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJJOHIAI3G4UULSDJT7LDGRX4VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FJTTEF83QWD1?ASIN=B0CS4MS3H3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars 30 Days to Forever",
                "reviewText": "Both Alexander and Phyllis had rough childhoods that really changed how they viewed marriage. Phyllis was determined to never marry but her father had just informed her that he had an arrangement to marry her to the Duke of Wildaves. She was fighting with him about it when her sister, Joyce, told her that their father had said that unless Phyllis married first then she could not marry the man she had fallen in love with. Phyllis was torn but she loved her sister and would do anything to see her happy and so she told her father she agreed to the match. The couple has their ups and downs but mostly due to their own insecurities and inability to communicate effectively with each other about their innermost thoughts. A very good book and certainly worth the read and to see how things work out between them once they realize how they truly feel about each other.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G.R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 22, 2024",
                "reviewTitle": "do better",
                "reviewText": "Alexander and Phyllis'childhood experience do not make them big fans of marriage but when they are forced by circumstance they slowly realise there is always a chance to do better and not repeat the mistakes your parents made (but surely you will make your own mistakes, but as long as you learn from them...)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D Henderson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 16, 2024",
                "reviewTitle": "True Love Will Win Through",
                "reviewText": "I enjoyed this story. Duke Alex needs money to save the family finances. He offers to marry Phyllis without meeting her. Phyllis is told she must marry him and she has to obey her father. However, when they meet, Alex and Phyllis decide to have a fake courtship for thirty days. He would not have her dowry but would be able to forge business links with her father. She would be free to look for someone to love. Unfortunately, their plans are thwarted when Phyllis' sister is caught in a compromising situation. Phyllis has to marry quickly to save her family reputation. As she takes on her role as a Duchess, Phyllis tries hard to adjust. Alex's mother is against her and Phyllis' sisters are worried about her. It is only when Phyllis runs away, that Alex realises that he must take action is he is not to lose her. Will he succeed?A clean enjoyable read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 19, 2024",
                "reviewTitle": "Alexander and Phyllis",
                "reviewText": "Phyllis is a spinster sworn to never marry but it took a special duke to change her mind. Alexander has resigned himself to do his duty and marry to save himself and his family from financial ruin. Love caught them both unexpectedly. Lovely book packed with unexpected twists, grab a copy to find out how they both navigate through the challenges to reach their happy ending. Highly recommended",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pickle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 17, 2024",
                "reviewTitle": "EVEN THE BEST PLAN'S HAVE A WAY FALLING APART - DO ANY OF THEM GET WHAT THEY WANT ?",
                "reviewText": "DUKE ALEXANDER - NEVER wanted to marry, yet after the death of his father he realises the financial mess his family has been left in - the only way out and to avoid bankruptcy and save his families reputation is to marry for money.LADY PHYLLIS - DAUGHTER OF EARL OF ST CLAIR - set in her ways and adamant she will never marry ( she wants the freedom and education man has) , her father however has different plans he has told her she must marry before her younger sister Joyce, who is very much in love and her suitor has asked permission to marry her on more than one occasion her father has refused(SHE CANNOT MARRY UNTIL PHYLLIS DOES) this changes everything.THE EARL HAS ARRANGED A MARRIAGE FOR PHYLLIS - TO A GENTLEMAN SHE HAS NEVER MET, THEY TRAVEL TO HIS HOME FOR THE INTRODUCTION - PHYLLIS AND ALEXANDER DEVISE A PLAN.I absolutely loved this the interaction between Alexander and PHYLLIS is brilliant LOTS of other great character's in this as well brilliant storyline.I RECEIVED AN ARC COPY.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Narrelle Day",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 2, 2024",
                "reviewTitle": "Delightful",
                "reviewText": "I can safely declare that this is a thoroughly enjoyable read. Please read it so that this author can write more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}