{
    "remaining_requests": 2211,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Off-Limits-Alpha-Daddy-Pregnancy-ebook/dp/B0CT6XV6W6",
    "body": {
        "name": "Off Limits Alpha Daddy: An Enemies to Lovers Surprise Pregnancy Romance",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Off-Limits-Alpha-Daddy-Pregnancy-ebook/dp/B0CT6XV6W6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81MSwJetxuL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Josie Hart",
            "link": "https://www.amazon.com/Josie-Hart/e/B0B4PQ4X9Z/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 35,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CT6XV6W6"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (February 14, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 14, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2372 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 324 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,360 in Kindle Store (See Top 100 in Kindle Store) #7 in Rockstar Romance (Kindle Store) #10 in Rockstar Romance (Books) #14 in Workplace Romance eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 35 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "buffpuff",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYG3MUTIVGKC7LYJFX4S3QMUSIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SJIERL2Y0BYE?ASIN=B0CT6XV6W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars 10/10++ - An Absolute MUST READ!",
                "reviewText": "This review will be hard for me because I always have a Spoiler Alert on my review. That being said, because this is an ARC review, I will tone myself down.This book is amazing. It has a great storyline that when you get to the end of a chapter, you can’t help yourself, you binge the next chapter. (And the next, and so on…) But to go with the great storyline are the knockout punch the characters do. Lena and Jackson with the constant push pull of their love/hate relationship. With them constantly pushing them along it seems are Tyson and Maeve, a love/love relationship. Tyson is a member of Jackson’s band.Jackson has experienced so much hurt in his past that it is all encompassing his life, but most particularly his relationships. The more love that happens for people he knows, the more it scares him. I do think that Jackson’s PR firm is good because it got him in the classroom. But I think at times they can be almost as pushy as fans just in a different way. One thing you might expect from other Josie Hart books but this one you don’t expect it really is the amount of erotica flowing throughout the story.Am I sharing the ending, you have to read the book. It is Josie Hart perfect but this one is sooo different because of the extreme hate for love – Jackson/ and the hatred Lena feels for Jackson.It is an absolute MUST READ!10/10++",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXWWNA5HZ57K42Q44ZADIYLHIUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2K4NQTQGSEV2I?ASIN=B0CT6XV6W6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "4.0 out of 5 stars 🌻You are my sunshine, my only sunshine🌻",
                "reviewText": "Meet 25yr old Jackson Whiss, one of the brothers from the Off Limits Baby Daddies series. Remember Eli and Luke? Well, this time it's the bad boy rockstar's turn for a possible romance. Don't worry this can be read as a standalone. Jackson is a party guy. He flirts, he's blunt, and the guy is against relationships. Nope! Not for him.👎🏻Love isn't real. In his eyes, women are unreliable, they only want money, and break mens' hearts in the process. Sheesh. Really dude? Men can play that game too. Not every woman will do that, Jackson. Obviously, he has issues from his mother and her abandonment of the family years back. His Dad didn't help matters either. Hence the lasting impression. And yeah, after awhile, Jackson got annoying with his outlook. I understand it but he needed to start the healing process quick. He needed to grow up too. To me, he wasn't the most mature guy. And then he meets a woman at a meet and greet after one of his concerts who changes things. She didn't go gaga over him like other fans. Other women. Imagine that.😆😆Lena Harris is 23, an elementary music teacher and she isn't impressed with Jackson at all. His ego, his rudeness rubbed her the wrong way. As it should. He's a jerk. But Lena is there with her BFF Maeve who hooked up then fell in love with Tyson, the guitarist of the band. I like them!!! They were such a cute romantic couple. Anyway. The attraction is there between our main couple. Jackson and Lena are drawn to each other. And yes, they do get involved. It's spicy.🔥🔥 But since Jackson is a hot mess in the media, (the party lifestyle, having altercations, an ex talking trash about him) his personal image has to be cleaned up. Which leads to singing at Lena's school with the kids and then having a fake relationship and engagement with her. This story has tons of angst, high drama, and deep questions of what their connection truly means. Is it real? Does he feel the same way like Lena? Does Jackson want more despite the rules he has about relationships and women? Will this couple get their HEA despite the rocky twists of a fake relationship spilling into becoming more? Bring on the realness.Extra notes: I think the last half of the book was much better than the first half. It seem to flow more easily. But I wanted Jackson to start having the heart feels before the last few chapters. To get more excited for it and Lena. Instead of the yeah okay, I do love her realization. Does that make sense? I mean Lena gave her all to this man. What he wanted, she did. No hesitation. I wanted her to make Jackson work and earn to have her as his special woman. Even when she confessed her true feelings of loving him and shared her pregnancy news, Jack just stood there. Surprise! You're scared. But so is she. Talk. Support. Don't run. It's like every time he wanted something from her, for his image etc, they were intimate first then he would tell her about what the PR people needed. That's not cool. And dude don't tell your bandmates you got involved with the lady.🙊 He used another word I can't use here. Think of the word duck. Quack. Quack.🤣🦆🤣 I still liked it and would definitely recommend. I just noticed these little things. And look at the great book cover. He's a bad boy alright.😘 Happy reading.♥️♥️🎶🤩Thank you for an early read via Booksprout. This is my honest opinion on the story I read.🤩🎶",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JaimeG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE65KACRYBHGBKUMRVMPOQGS6ZYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXIZI0B1TH4YH?ASIN=B0CT6XV6W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars WONDERFUL!!",
                "reviewText": "I really enjoyed reading this book. Once I started reading it, I had a hard time putting it down. The storyline of Lila and Jackson grabbed my attention from the first chapter and held it until the end. They have a love/hate relationship but end up with an HEA. This is a MUST read for sure!.I received a free copy of this book and am voluntarily leaving a review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2DSGCWJRXBZSKP4EMTT2SJ3FRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27HI3EBLD676C?ASIN=B0CT6XV6W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars HOT and SEXY Romance Book",
                "reviewText": "OH, HOLY MOTHER of GOODNESS is this book give you HOTNESS or what. Jackson sounds like he is a HUNK that you want to devour instead of Lena doing the job. :) This is a FABULOUS story line and characters that you will read until you are 100% finished reading about them.I received a free copy of this book and am voluntarily leaving a review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMCBYZ3E4T3PMAOLACTNCECZRUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TKY7CYE0ZEJS?ASIN=B0CT6XV6W6",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "3.0 out of 5 stars Enemies to lovers surprise",
                "reviewText": "Great storyline, good background provided in characters with build up on story well drawn out. Surprise baby thrown into plot let to great conclusion.I received a free copy of this book and am voluntarily leaving a review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annaluvs2read",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFECFFOO6XTYUWNAXY2S3HJ2VDHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12HYC6E7YJFMX?ASIN=B0CT6XV6W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Rockstar romance worth reading",
                "reviewText": "Lena and her friend Maeve scored a backstage pass to meet their favorite rock band and were super excited until Lena and Jackson cross paths. Lena really loved his music until she met him. He came across as an arrogant typical rockstar. Jackson told her she was uptight and needed to loosen up and have fun. Maeve hit it off with Tyson who was in the band and he asked them both to come to his house afterwards. Lena was against it but her and her friend always promised to stay together when they were out so Lena reluctantly agreed to go and of course Jackson was there. When Lena can’t be found Jackson goes looking for her only to find her asleep in another room. He watched he sleeping and realized how beautiful she was and when she woke of course they had a few heated words but them they kissed and the spark was undeniable. Jackson of course was a bad boy who was determined to never be in a serious relationship after what happened with his parents. Lena was totally opposite and wanted to be friends, fall in love and have the rest fall in place. Well, his PR team has a plan for Jackosn to fix his bad boy image but will Lena go along with it?This is a great story and I liked both main and secondary characters. Lena and Jackson had off the chart chemistry but will they be able to work through all their differences?.I received a free copy of this book and am voluntarily leaving a review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}