{
    "remaining_requests": 2197,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/House-Witch-Humorous-Romantic-Fantasy/dp/B0B1P4RWHF",
    "body": {
        "name": "The House Witch: A Humorous Romantic Fantasy: The House Witch, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/House-Witch-Humorous-Romantic-Fantasy/dp/B0B1P4RWHF",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51qAS3LHUjL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Delemhach",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Delemhach"
        },
        "brand": "Delemhach",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 10716,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A heartwarming and humorous blend of fantasy, romance, and mystery featuring a witch with domestic powers and the royal household he serves...dinner.When Finlay Ashowan joins the staff of the King and Queen of Daxaria, he’s an enigma. No one knows where he comes from or how he came to be where he is, which suits Fin just fine. He’s satisfied simply serving as the royal cook, keeping nosy passersby out of his kitchen, and concocting some truly uncanny meals.But Fin’s secret identity doesn’t stay hidden for long. After all, it’s not every day a house witch and his kitten familiar, Kraken, take to meddling in imperial affairs. As his powers are gradually discovered by the court, Fin finds himself involved in a slew of intrigues: going head-to-head with knights with less-than-chivalrous intentions, helping to protect the pregnant queen, fending off the ire of the royal mage, and uncovering a spy in the castle. And that’s only the beginning—because Fin’s past is catching up with him just as his love life is getting complicated . . .Filled with fascinating characters, courtly intrigue, political machinations, delicious cuisines, cuddly companions, magical hijinks, and will-they-won’t-they romance, The House Witch is the first in a captivating new series, guaranteed to satisfy the tastes of any listener.The first volume of the hit romantic-fantasy series—with more than a million views on Royal Road! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Action-Adventure/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10159265011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "17 hours and 4 minutes"
            },
            {
                "name": "Author",
                "value": "Delemhach"
            },
            {
                "name": "Narrator",
                "value": "Matthew Wolf"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 21, 2022"
            },
            {
                "name": "Publisher",
                "value": "Podium Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0B1P4RWHF"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,614 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #28 in Paranormal Romance (Audible Books & Originals) #35 in Witch Romances #49 in Fantasy Romance (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5VDPZLE6KSSZ3ZYPWBTL7K5NRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Q1D2842ZD9WU?ASIN=B0B1P4RWHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic!",
                "reviewText": "I didn't want it to end, I was so swept up in the characters and the story. When I did finally reach the end of the book I was briefly disappointed, feeling it was a bit abrupt — but hooray, I see there is a sequel! The first few pages will require an adjustment for readers unfamiliar with fantasy writing (it can take a while to keep all the place names straight); just stick with it and soon the reading gets easier. Just think of the countries as L-something and T-something until it makes sense. Worth it!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra Iler Kirkland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKFRC3Q6AIE6FOJDDP5AXTUZQ5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJEJGG2PRYUYM?ASIN=B0B1P4RWHF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "4.0 out of 5 stars The First House Witch Novel",
                "reviewText": "Fin Ashowan has just arrived at the castle in Daxaria where he has been hired to be the new cook. Fin is an excellent cook but takes control the minute he arrives and puts up the back of the other servants and the knights who like to hang out in the kitchen. He makes it clear that the kitchen is his domain and no one is allowed that he doesn't approve of. Fin is a house witch and he doesn't like others to know that. When someone knows you are a witch, they expect that you will be able to help them whenever they are ill or in a fix and sometimes no one can help.Soon Fin is in command and making progress. Everyone loves his food. He is able to start teaching the knights how real men behave, not the boorish behavior they are used to. He doesn't get along with the royal mage as witches and mages are like oil and water but each agrees to stay out of the other's way. Fin also meets a Viscountess that he immediately is drawn to and soon loves wholeheartedly but a member of the royalty and a cook are not a romantic pairing that would ever be allowed.All is not good however. War is threatening and his Viscountess is in danger as a spy for the country. The Queen is pregnant and has a long history of miscarriages and Fin saves her life one night when another threatens. Soon the King is using Fin and his magic as a resource and perhaps the love affair will work out. Who knows?This is my first work by Delemhach who is a Canadian author. The work is humorous and a romance fantasy so light and enjoyable. Fin can't believe in his powers or his ability to make others' lives better but as the days go by, he starts to realize his power and the gift of the chosen family he makes in Daxaria. The only thing I didn't care for was the abrupt ending that left everything up in the air with the main plot points unsettled until the reader gets the next book. This work is recommended for fantasy readers.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Malaika H. Kambon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4ZEY5AQSGGS3A7IBEUE2TBB4CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVZIGYIWSVHQ3?ASIN=B0B1P4RWHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars The House Witch: A Humorous Romantic Fantasy - Book I",
                "reviewText": "12/25/2023I was enchanted by the title and though I know nothing about the author, I decided to buy and read. I’m not disappointed! The characters are fantastic, I’m enthralled by the story development and am eager to purchase books II & III.The read is particularly grand for how the protagonist disallows homophobia, sexism, caste, ableism, class, & racist discrimination in any space he calls home. It’s also intriguing that the house witch is male. I wonder if we’ll see any female mages… It seems doubtful as mage craft possesses a lot of male pomposity.I’m also hoping to discover (1) how the protagonist’s lady knew to bring him a familiar; (2) the continued adventures of KRAKEN; (3) the plans of the protagonist’s mother toward a certain evil lord; (4) what’s been afflicting the health of Queen; (5) & a great deal more about The Gardener!The House Witch: A Humorous Romantic Fantasy - Part I has my provisional approval so far.Brav@ Delembach",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R Zeman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3XLUIADJSNFFLSZLOLVYGWJHKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IL28BJA6DTH5?ASIN=B0B1P4RWHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Delemhach is basically a genius.",
                "reviewText": "Dear Lord, this book was freaking awesome. The charcter arches were filled with growth that had me all but stsnding and cheering.I want to be Hannah and Lady J.I didn’t think I’d ever fall in love with a red headed man, but here we are.Favorite line at the end? About needing a doctor to remove a stick.Oh and the heartstrings that were expertly plucked will have me smiling for days.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jere",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSJQIC5NQWAYGJFW6REJSZAB76Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R6CN9X9QU4AY?ASIN=B0B1P4RWHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Good Book!",
                "reviewText": "This was an enjoyable read! There are quite a few characters but they are easy to keep track of. I’m anxious to begin the next book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina Wodtke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJ6JTJCOSWAWPG3OUTQTGXSXQYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6ZEZEZ2WUHSA?ASIN=B0B1P4RWHF",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2023",
                "reviewTitle": "3.0 out of 5 stars Don't get it, unless you can stop with Book One.",
                "reviewText": "I have no idea what happened. The series went from Yay to Nay.Book 1. Delightful! Every so often I want a cozy fantasy. This delivered beautifully. Strong characters, no icky sexism or other mean things, and solid plotting/good writing. Everyone lives!Book 2. Not as well crafted. The plot was there, but there were occasional discontinuities and odd sentence.Book 3: OH HELL NO. The series goes off the rails. The characters all seem the same, I loved these people; now they were all the same and that way is like s a stupid 8 year old. The plot makes no sense, with people rushing off to do things for no reason or a bad one. Are these people idiots? The writing tanks. There were some sentences I had to read 3+ times to figure out what they were saying. And so many are simply bad.Random examples:\"Glancing up at the captain, whose blue eye was slightly widened, Fin called out, breaking into a slightly friendlier grin, “I don’t even have my frying pan, yet!”\"The witch had changed into a plain tunic and trousers, and while many of the men present would have seen Fin at his mother’s funeral, and would have therefore heard he was ennobled, it didn’t necessarily mean they would immediately respect him.\"\"The king’s expression was less than impressed with the retort as Mr. Howard at his side began shaking his head; he drank deeply from a wine goblet that no one had seen in his hand when they’d first entered …\"These aren't the worst, but this representative. Run on sentences, telling when you could be showing, repeating yourself, confusing parentheticals... ugh.As well, the author makes a bunch of homophobic jokes while saying how it doesn't matter who is what... yeah, sure. The token gay character has zero personality as well, and betrays his country to a gay member of the enemy army. It's offensive.Finally, Book Three breaks the promise of a cozy: a beloved character dies. That death feels meaningless and random, like the author thought, it's getting boring here.I told a friend, \"It's like she started with a dev editor, a copy editor and a proofreader. For the second book, she fired the copy editor and for the third she fired her dev editor.\" ChatGTP could write a better book than Book Three. Maybe the author dictated it and didn't revise it? It's literally unreadable (by me, anyhow.)The main plot is resolved in Book One, but there are others that aren't (will there be a war? Who will win?\" I recommend not even starting these.The only good thing I can say is the words are spelled correctly. But that is not enough.",
                "reviewVotes": "60 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J Titterington",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 14, 2024",
                "reviewTitle": "Humour, magic, romance, spies ...",
                "reviewText": "What's not to love? It's a fun read (And even has a plot!)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 20, 2023",
                "reviewTitle": "Gostei",
                "reviewText": "Apesar de ter humor no título, não achei o livro extremamente engraçado. Ainda assim é uma leitura boa, suave, sem muita angústia nem muito suspense. A história é bem contada e cativante, e achei o enredo bem original. No geral é um livro bom para relaxar.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daisy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 21, 2024",
                "reviewTitle": "Light hearted fun, slice of life",
                "reviewText": "Very enjoyable read with fun characters. I think if you enjoy slice of life anime you will enjoy this book as it gives off some of the same vibes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bodo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 20, 2024",
                "reviewTitle": "absolutely wonderful",
                "reviewText": "This is a book you cannot put down once you’ve started reading! Funny, mysterious, sexy, romantic, thrilling, unexpected developments, and never stopping",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 5, 2023",
                "reviewTitle": "Absolutely great !",
                "reviewText": "This is book is the perfect cozy story for me. It has the right amount of fluff mixed with the right amount of struggles and scenario.There are quite a lot of characters to keep track of, but not in an overwhelming way. Most of them have distinct personalities and unique relationships with one another (except for the group of knights, I'm sorry dear author but I will keep mixing them up).I'm looking forward to reading the next book in the series !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}