{
    "remaining_requests": 2260,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wildfire-Novel-Maple-Hannah-Grace/dp/1668026279",
    "body": {
        "name": "Wildfire: A Novel (The Maple Hills Series)",
        "price": "$13.94",
        "originalPrice": "",
        "rawPrice": 13.94,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wildfire-Novel-Maple-Hannah-Grace/dp/1668026279",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51GTzZcgkCL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51pKOVf3E L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Hannah Grace",
            "link": "https://www.amazon.com/Hannah-Grace/e/B0B6CRSKWX/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 12413,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Atria Books (October 3, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1668026279"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1668026274"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.5 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#445 in Books (See Top 100 in Books) #80 in Sports Romance (Books) #114 in Romantic Comedy (Books) #425 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 12,413 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cd877995-305b-4d77-83d4-eb94b88c1d8e.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0840ccbf-95c7-486e-b057-bc627ce6274f.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3213eef-32b8-4e01-af5a-99c58b64242e.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Danyelle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPFR7OY4Y3SYGSG3EFHKN56SB2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KJNY4E9X5QC9?ASIN=1668026279",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Forced Proximity Romance with No Third Act Break-up",
                "reviewText": "I cannot read anything that Hannah Grace writes fast enough. I absolutely devoured this book. After sharing a passionate night together, Aurora sneaks out of Russ' bedroom only to find out that they are going to be spending the next ten weeks together working at a summer camp. If you aren't a fan of the third act break-up that happens in most romances, this book is for you. Hannah Grace deftly circumvents any of the pitfalls that befall our typical leading couples.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alyssa Reads and Reads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIIKTD7ZKS3CVA2Q3A5SEPCJGBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18PKLM207GW6Q?ASIN=1668026279",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Steamy new adult romance",
                "reviewText": "Wildfire is another entertaining new adult romance from Hannah Grace. Set in the world of Icebreaker, it is a light, steamy romance that’s utterly enjoyable.⭐️⭐️⭐️⭐️Shy goalie Russ and seemingly flighty Aurora hook up at a Maple Hills end of the year party. But Aurora sneaks out afterwards, and doesn’t expect to see him again. Except she does, when it turns out they are both spending the summer as counselors at her beloved overnight camp. After an awkward beginning, though, it seems their biggest issue might be the camp’s staff no fraternization policy. Can they keep a lid on their growing attraction and feelings?Russ is a sweet golden retriever hero who doesn’t think he’s good enough for Aurora. And, Aurora is the commitment-phobic character who can’t fathom how to be in a relationship. While both characters have pressing family issues, it’s fun watching them bring out the best in each other. I adored their “secret for a secret” exchanges, which managed to build their relationship and show off their growing chemistry.Wildfire clearly works as a standalone story. But if you liked Icebreaker, you’ll enjoy this book too. And while Russ is a hockey player, this is a story about college students, not hockey. Sometimes a low angst book with likable characters is exactly what you are looking for in a romance, and Wildfire fits the bill.Wildfire is a light, steamy new adult romance. If you are a fan of likable college student characters with a hero who connects with actual golden retrievers, you will be entertained by this enjoyable book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Megan EasleyMegan Easley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH26OMGLY52M5HLBXQQTUDFYSVYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L428IIYG4R07?ASIN=1668026279",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "3.0 out of 5 stars Wasn’t Bad, Wasn’t Great.",
                "reviewText": "Cheers to book number 5.86 for October because (I have read 5and DNF’ed 1 at 86%)😂•Title: #wildfireAuthor: @hannahgraceauthorPub Day: October 3, 2023Publisher: @atriabooks•I saw Icebreaker ALL OVER SOCIAL MEDIA before I took the jump and read it earlier this month, so it was only fitting that I read Wildfire this month too! Although Wildfire was super cute, I can definitely say that I prefer romance books deep in the sports scene (hockey, baseball, basketball), with a bit more spice.•I did really like how the female main character, Aurora, brought out the confident side of the male main character Russ. THAT DARE and SPICY JENGA!🙈😅 I’d feel all hot and bothered to Russ, so don’t be embarrassed. I also really enjoyed the #foundfamilytrope because I love seeing my favorite characters get what they deserve (especially since I do not have that in real life), so I live vicariously through them.•Overall, I’d rate the storyline/plot a ⭐️⭐️⭐️/5 stars and the smut/spicy scenes a 🌶️🌶️/5. I am going to share some of my favorite quotes below:1. “People mistake me being quiet for being shy, but I’m not shy. I prefer to sit and listen than be the focus of everything. There is too much pressure with being the center of attention. I’m much happier being an observer, watching from the outside”.2. “George Washington, John Adams, Thomas Jefferson”.3. “I have a habit of leaving a path of destruction in my wake, both literally and metaphorically…. Like a wildfire”.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61HGHPLby2L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQER6CDMYCOI6HSHWWCCXMNKLUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FGFBJ9F8F26C?ASIN=1668026279",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Russ + Aurora",
                "reviewText": "My god I don’t know what Hannah Grace is putting in her books but I’m completely addicted!!! I absolutely LOVE Icebreaker and was worried this one wouldn’t be as good because it was set at a summer camp so I thought the amazing friend group from Icebreaker would be missing. I’m so happy that not only was that not the case (I swear I giggled every time Henry made an appearance because I’m so obsessed with him) but we also get some amazing new friends with Xander and Emilia. I honestly kinda hope we get a Xander book someday in the future. All the people we know and love from UCMH are still so involved in this story because they all love Russ so much and of course have their usual shenanigans lolRuss is such an amazing MMC and there were several times when he’d be explaining how he views his dad and their relationship because of his addiction where I just really felt seen for the first time in the way I view my own father’s addiction versus other addicts. Russ was also so great at making Rory feel wanted like she needed. He would say the sweetest things and every time he’d blush I fell more in love with him.Aurora is hilarious first of all. I would have had the exact same reaction if I felt something touch my foot in any body of water lol There were parts of Rory and her relationship with her dad that also made me feel seen. It’s rare I think to be able to relate so much to both the FMC and the MMC on something so closely related. I think that just goes to show how amazing of a writer Hannah Grace is. There’s also a scene where Jenna is telling Rory that “dad” is just a word without any action behind it and it was definitely an emotional conversation for me to read. Rory is just all around an amazing character.There definitely isn’t as much spice in this book as there is in Icebreaker. This goes from a one night stand to a slow burn. But because it’s Hannah Grace, the spice is spicing when you get to it.Finally - I’m so excited that Henry’s book is next lolSpice: 2.5/5",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blabla ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 3, 2024",
                "reviewTitle": "simplesmente perfeito!",
                "reviewText": "Tome muito cuidado para não se apaixonar pelo Russ, não acho que tenham muitos dele pelo mundo ! Melhor leitura para uma hopeless romantic reader !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonymous",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 31, 2024",
                "reviewTitle": "Fantastic Read",
                "reviewText": "Flew through the first book - Icebreaker. Loved this one as well, great character development for the first book’s secondary characters. Cannot wait for the third book to be released!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allie War",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 6, 2023",
                "reviewTitle": "Excelente",
                "reviewText": "Me encantó esta historia, de mis favoritas este año.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alperen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 25, 2024",
                "reviewTitle": "Gefällt meiner Freundin sehr!",
                "reviewText": "Habe dieses Buch als Geschenk für meine Freundin gekauft und nach rund einem Monat lesen, bekam sie es durch. Sie bewertet es mit einer 9 von 10 Punkten!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maisie Dickinson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 21, 2023",
                "reviewTitle": "Even more romantic than Icebreaker",
                "reviewText": "Hannah Grace’s Wildfire follows Russ Callaghan and Aurora Roberts, two college students at Maple Hills. They meet at a party, hook up, and then Aurora disappears whilst Russ is in the bathroom. Then they both find themselves helping out at the same summer camp. They don’t get along at first, but this book is all about two people learning how to communicate, and falling in love. I loved Icebreaker but Wildfire is much more romantic. My favourite character is Aurora because she’s so relatable; she’s 5’7, curvy, loves food, cares about the environment, loves books. Something I love about Hannah Grace’s female character is how they aren’t the stereotypical female love interest, they aren’t innocent girls waiting for a bad boy to add excitement to their life. They’re strong, independent, and exciting all on their own. My least favourite character is Aurora’s dad, because he’s useless. I recommend this book because Aurora and Russ really understand each other, they make each other feel wanted and valued, and they want each other for who they are. The found family in the Maple Hills universe will get me every time. ‘This group is a family more than they’re friends, and they’re so welcoming that it’s impossible not to fall in love with every single one of them.’ Also, it’s very different to Icebreaker which makes me more intrigued for Daydream. “It’s no secret that I love books. I love stories about people I don’t know, and places I haven’t been to. I’ve lived a thousand lives between a thousand pages, but no story, no life, no page has ever made me as happy as you do, Russ Callaghan.”",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.00",
                "sellerName": "Vassal Books",
                "sellerRating": "5"
            },
            {
                "price": "$13.75",
                "sellerName": "Friia's",
                "sellerRating": "5"
            },
            {
                "price": "$13.94",
                "sellerName": "DDV Sales and Resources LLC",
                "sellerRating": "5"
            }
        ]
    }
}