{
    "remaining_requests": 2274,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wife-Before-Shanora-Williams/dp/1496731115",
    "body": {
        "name": "The Wife Before: A Spellbinding Psychological Thriller with a Shocking Twist",
        "price": "$10.03",
        "originalPrice": "",
        "rawPrice": 10.03,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wife-Before-Shanora-Williams/dp/1496731115",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/812P2GgB2TL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Shanora Williams",
            "link": "https://www.amazon.com/Shanora-Williams/e/B00BHQUULU/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 5873,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for The Wife Before “Williams does give both Melanie and Samira multiple dimensions; they're flawed but also strong and determined, and the twist at the end is a surprise.” —Kirkus Reviews\"Shanora Williams drew me in from the beginning and held me captive to the very end. With all the scenarios that came to mind as the truth, the ending was truly riveting. This was my first book by Williams, but it will not be my last. For lovers of a good suspenseful romance, check this one out.\" —Urban Reviews “I couldn’t wait to see what would happen next with these messy lives and I was hooked, there was definitely some juicy material here making this an ideal summer thriller. Definitely recommended as a weekend binge read, this was really addictive!” —Novel Gossip “Similar to the iconic cosmopolitan, Shanora Williams’ newest thriller starts off sweet, but quickly turns sour when a passionate marriage takes a deadly turn. Sexy, scandalous, and striking, this twist-filled psychodrama, like a cosmo, is definitely worth the hype.”—Readers Entertainment MagazineAdvance Praise for The Wife Before from Booksellers & Librarians: “Shanora Williams has a keen eye for the tension that can build in a relationship... that paired with strong characters and a carefully built plot make this a read that absolutely begs to be finished in one sitting (which I did!). And that ending—let's just say it comes to a very satisfying conclusion! Plus, I'm a sucker for anything that plays on REBECCA and I got wild REBECCA vibes here!” —Becky LeJeune, Bookbar Denver (Denver, CO) “This heart-pounding twisty thriller is an unexpected story of suspicion and redemption.” —Cari Dubiel, Twinsburg Public Library (Twinsburg, OH) \"An exceptional novel that you don't want to miss.” —Laura Fowler, J.V. Fletcher Library (Westford, MA) “Shanora Williams weaves an intricate tale of domestic suspense. Readers will be gripped right from the very first sentence. This a must-read for thriller fans.” —Nicole McManus, My Sister's Books (Pawleys Island, SC) Praise for The Perfect Ruin “This twisty thriller takes readers into a high-class, sinfully privileged world populated with characters who will stop at nothing for what they want. Williams stretches out the tension as readers wonder what Lola did to hurt Ivy and whether their shared past will be revealed. With diabolical turns and surprises at every corner, it’s an ideal summer read.” —Booklist STARRED REVIEW “A delicious and decadent cocktail of jealousy, passion, and revenge. I was hooked from the very first twist. You’ll love this addictive psychological thriller.” —Alessandra Torre, New York Times bestselling author of Every Last Secret \"Twisty and impossible to put down! With a cast of diverse characters, Williams brings to life a twisty thriller that'll leave you reeling long after you've read the last page. 10/10 recommend.\" —Claire Contreras, New York Times bestselling author \"You're going to pick a side, make no mistake. And then you won't put it down until you know the truth. A shocking, sensual thriller with sharp twists.\" —Tarryn Fisher, New York Times bestselling author of The Wives “Williams is an award-winning author of romance and suspense novels; her tale of revenge will find an easy spot in fiction collections. Tailored for book clubs and for those who like to read about the sleazy side of rich elites.” —Library Journal “In The Perfect Ruin, author Shanora Williams serves up an ice-cold revenge thriller set in the glamorous and steamy hot city of Miami.” —Book Riot “The glamour of Miami has a dark side in this twisting story where nothing is what it seems.” —WRAL-TV (NBC) North Carolina “This is a great story of revenge and the lengths someone will go to get it, and how there are many layers to people’s lives. It’s a great mix of female friendship and thriller.” —Parkersburg News and Sentinel/Marietta Times “This fast-paced and incredibly entertaining book is perfect for devouring by the poolside. Everyone in this book is terrible, but I mean that in the best way possible. Williams is so incredible at writing her characters that despite the horrible things they do, you still want to root for them.” —Off the Shelf About the Author Shanora Williams is the New York Times and USA Today bestselling author of more than twenty-five suspense and romance novels, including her traditional publishing debut, The Perfect Ruin, a selection of the Target Diverse Book Club. She began self-publishing in 2012 and first landed on the New York Times bestseller list when she was only nineteen years old. She lives with her husband and three sons near Charlotte, NC and can be found online at ShanoraWilliams.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 2 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Fans of Verity will be engrossed by this unpredictable novel of suspense as a new bride’s fairytale marriage becomes a prison of secrets. From the New York Times and USA Today bestselling author of The Perfect Ruin, this insidiously sexy, twist-filled psycho-drama is reminiscent of the classic gothic tale Rebecca. “Sexy, scandalous, and striking, this twist-filled psychodrama, like a cosmo, is definitely worth the hype.” –Readers Entertainment MagazineBookBub’s Best Mysteries & Thrillers of 2022 | PopSugar’s Best New Thriller and Mystery Books of 2022 | SheReads Best Mystery Books Coming in 2022 | Word Wonder Most Anticipated Non-Speculative Releases For 2022 | Goodreads What to Read Next After Colleen HooverSamira Wilder has never had it easy, and when her latest lousy job goes south, things only promise to get harder. Until she unexpectedly meets a man who will change her life forever. Renowned pro golfer Roland Graham is wealthy, handsome, and caring, and Samira is dazzled. Best of all, he seems to understand her better than anyone ever has. And though their relationship moves a bit fast, when Roland proposes, Samira accepts. She even agrees to relocate to his secluded Colorado mansion. After all, there’s nothing to keep her in Miami, and the mansion clearly makes him happy. Soon, they are married amid a media firestorm, and Samira can't wait to make a fresh start—as the second Mrs. Graham . . .Samira settles into the mansion, blissfully happy—until she discovers long-hidden journals belonging to Roland’s late wife, Melanie, who died in a tragic accident. With each dusty page, Samira comes to realize that perhaps it was no accident at all—that perhaps her perfect husband is not as perfect as she thought. Even as her trust in Roland begins to dwindle and a shadow falls over her marriage and she begins to fear for her own life, Samira is determined to uncover the truth of Melanie’s troubled last days. But even good wives should know that the truth is not always what it seems . . .“Truly riveting.\" –Urban Reviews “A shocking, sensual thriller.” —Tarryn Fisher, New York Times bestselling author on The Perfect Ruin",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Kensington (June 28, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1496731115"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1496731111"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.46 x 0.81 x 8.24 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,485 in Books (See Top 100 in Books) #43 in Black & African American Women's Fiction (Books) #243 in Psychological Thrillers (Books) #375 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 5,873 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7a0e658e-d9b0-4bae-bf0a-d7def03ad8ad.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/edac0ab8-a058-4fcd-914c-52ffe58256cd.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0cec7681-ef4d-4050-b020-1104cb296755.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3e641a1d-9909-49c0-902f-bbd23a2bead9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4449503f-96f8-4ba9-bc4b-081395a1265b.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cassandra Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNA7RLMBWJMLXEYRPQQDTKWY7ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2POIZPYRL6Z4?ASIN=1496731115",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars What a thriller",
                "reviewText": "Oh my, the suspense in this book kept me going. I must admit the twists in the book were good. Samaria followed her instincts and her gut and was able to find all she wanted to know and a lot of what she didn’t want to know about the wife before. If you love thrillers I recommend this book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ja'LisaJa'Lisa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5SFL3SN4CCGMDXXR5KWN36EK6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5EYFQ048OXFQ?ASIN=1496731115",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "4.0 out of 5 stars A Compelling Suspenseful Thriller",
                "reviewText": "⋆⋆⋆⋆ 4/5This was a compelling suspenseful thriller that I did not see coming. I am a thriller and suspense lover so at first I wasn't too interested in this story thinking it was focusing on romance. However, as it built over the first 50 pages, I started to become attracted. I was pulled in by the mystery behind what really happened to Melanie. Nothing is ever as it seems. I really appreciated how the author built the suspense around the characters and the drama being unpacked. Thrillers are not for the weak so if you are triggered by cursing, drugs, violence, etc. This book is not for you.The twists in this story are not seen or predictable at all and I love how Shanora reveals them and allows us as readers to dissect them with explanation, but not over the top. This allows us to connect the dots and really hone in on the story getting deep into it. I like to put myself in the main character's shoes and while I didn't agree with many things that Samira chose, I really enjoyed the ending and was talking to the book in the end like she could hear me 😅.Pros: Quick read, unpredictable twists, intriguing plotCons: Uneven chapters, action held until the endFavorite Character: Yadira",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/617KBx2xG8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shanel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEDY3RVAKJWWZGMQVARW3AFLMCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K7ED3ER1XC9L?ASIN=1496731115",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Wow",
                "reviewText": "Okayyyyyy! This is my first read by this author and I was fully invested. I literally could not put it down. I just had to know what happened. This was insane. I knew that something wasn't right and somebody was lying. I just couldn't pinpoint who. I didn't trust Roland the entire book. Like down to the last chapter, I just knew he was involved in all this.I'm def diving into the next book.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR5QV4KQNGQV2F6CKAVWXTGZTFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ETUMW7K8IG60?ASIN=1496731115",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "3.0 out of 5 stars Even the dead can cause insecurities in relationships",
                "reviewText": "I initially felt that Samira married out of Desperation She didn't know much about Rowland and it really seemed as if he was trying to isolate her from her loved Ones. It's crazy that Melanie a dead woman was able to make a woman feel the way Samira was feeling , but that can be expected when you marry someone you barely know. There were a lot of Secrets in this book. Dylan had that much hidden hatred and Jealousy of his cousin and Melanie seemed delusional. Rowland opened the door for infidelity by accepting it once before marriage. Good Read with a surprise ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave Summer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVUVMJAQWEY2TNRMSPUOH5NDBOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Q3HKFYVGIOEA?ASIN=1496731115",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars twists and turns",
                "reviewText": "I loved the book, first you think he actually did it. Then you think she was crazy as a loon. Then the twin sister and the cousin. For a minute I thought the housekeeper was as suspicious too. Started the book at noon and with a few interruption finished it by 4PM.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T Michelle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESE4WY5PBA52LT5DTACWKCBNR3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18W51BRYMFCGH?ASIN=1496731115",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Kept me guessing",
                "reviewText": "Well developed story. A classic did he or didn't he? A well known golfer is only suspect in wife's death. Did he do it or can he clear his name? I enjoyed all the twist and turns and behaviors of the characters. Would definitely read more from this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPRMA2COE2AJ6SQRBJV2HKJUIYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WA2UKQFKX8I7?ASIN=1496731115",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars 👏🏾👏🏾👏🏾",
                "reviewText": "Omg job well done! I could not put this book down. I read this book within just a couple of hours and I’m honestly still shooked. Just when I thought I knew what was going to happen boom 💥 plot twist. 10/10 would recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tina M Linhart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSG5AWMVYZX447YD62XAWVTTQPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKM2034OZH0BJ?ASIN=1496731115",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars great read",
                "reviewText": "I couldn’t put it down it was a page turner you will be on the edge of your seat the whole time",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marian Chawner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 12, 2022",
                "reviewTitle": "Guilty until proven otherwise",
                "reviewText": "Gosh this book keeps you on the edge of your seat right up until the last sentence. Shanora really knows how to write an incredibly absorbing thriller, with some extremely dark hidden secrets. The characters are so believable, and the heroine so determined. Samaria a young lady finding it difficult to focus on the necessities of life is forced to stand on her own to feet and not rely on hand outs from her brother Kellan and her friend Sheila. Jell is soon to be a Dad, and his fiancée does not get on with his sister particularly well, and Sheila, wants space when her boyfriend moves into her flat. A chance encounter whilst Mira is waitressing has her meeting Roland a professional golfer with a sinister past. A widower, who although walking around freely fell deeply under suspicion when his first wife committed suicide, whilst under the influence of heroine. He was never proved guilty but everyone had opinion that reflected on his career. The two start a whirl wind romance and finish up married and moving into Roland’s home. The one he built with his first wife. Journals that Mira finds written by her hand, the first wife, cast shadows of doubt, and so the incredible journey of deceit, encounters and plots unfold. It is so well written that when the end does arrive the reader is most definitely wanting more. Cruel characters weave in and out. Those you thought you knew you didn’t, and those you thought were fair left you realising that perhaps you only saw what they wanted. The heroines sheer determination, continues throughout the book, and is basically the total backbone of this exciting novel. One not to miss. One to digest and ponder. Some topics are difficult to absorb, and some are quite macabre, but all essential for a phenomenal story. Well worth more than 5 stars. This ladies work always is. Totally excellent.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}