{
    "remaining_requests": 2154,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cowboy-Next-Door-novella-Montana/dp/1538711176",
    "body": {
        "name": "The Cowboy Next Door: Includes a bonus novella",
        "price": "$5.99$5.99$1.09$1.09$5.99",
        "originalPrice": "$7.99",
        "rawPrice": 5.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cowboy-Next-Door-novella-Montana/dp/1538711176",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51MiDVcojPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/515Sr7iapUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41laHzjz22L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41b7lO6P5JL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "R.C. Ryan",
            "link": "https://www.amazon.com/R-C-Ryan/e/B004GBNHH2/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by glenthebookseller.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 199,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"R.C. Ryan delivers it all with page-turning romance.\"―Nora Roberts, New York Times bestselling author\"Satisfying....This sweetly domestic story should win Ryan many new fans.\"―Publishers Weekly \"The Cowboy Next Door is a work of art.\"―Fresh Fiction\"A strong, protective hero and an independent heroine fight for their future in this modern rough-and-tumble Western.\"―Library Journal on Cowboy on My Mind\"(The) Montana Strong series begins with a fabulous story....This talented writer... invites you to join a little journey that has you biting at the bit for more.\"―Fresh Fiction on Cowboy on My Mind\"4 stars! A heartwarming plot filled with down-to-earth cowboys and warm, memorable characters. Reed and Ally are engaging and endearing, and their sweet, fiery chemistry heats up the pages, which will leave readers' hearts melting...A delightful read.\"―RT Book Reviews on Reed\"Ryan creates vivid characters against the lovingly rendered backdrop of sweeping Montana ranchlands. The passion between Ryan's protagonists, which they keep discreet, is tender and heartwarming. The plot is drawn in broad strokes, but Ryan expertly brings it to a satisfying conclusion.\"―Publishers Weekly on Luke\"Ryan has created a gripping love story fraught with danger and lust, pain and sweet, sweet triumph.\"―Library Journal starred review of Matt\"Beguiling...Touching and romantic, Ryan's portrayal of a city slicker falling for a cowboy delves into the depths of each of their personalities to find common ground in their love for the land. Readers will eagerly anticipate future installments.\"―Publishers Weekly on Matt\"4 stars!!! With tough, sex cowboys set against the beautiful, rural landscape of Montana, Ryan's latest is a must-read.\"―RT Book Review on Matt About the Author New York Times bestselling author R.C. Ryan has written more than ninety novels, both contemporary and historical. Quite an accomplishment for someone who, after her fifth child started school, gave herself the gift of an hour a day to follow her dream to become a writer. In a career spanning more than twenty years, Ms. Ryan has given dozens of radio, television, and print interviews across the country and Canada, and has been quoted in such diverse publications as the Wall Street Journal and Cosmopolitan. She has also appeared on CNN News and Good Morning America. R.C. Ryan is a pseudonym of New York Times bestselling author Ruth Ryan Langan. You can learn more about R. C. Ryan and her alter ego Ruth Ryan Langan at:RyanLangan.comTwitter, @RuthRyanLangan Facebook.com"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 16 mins",
            "$3.98 delivery Monday, March 4.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 6 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From New York Times bestselling author who \"delivers it all with page-turning romance\" (Nora Roberts) comes a story about a down-on-her-luck teacher, a carefree cowboy, and finding second chances in the most unlikely places. After weeks on the trail, Sam Monroe is looking forward to a hot bath, a home-cooked meal, and a real bed. In that order. But he's greeted by something even better when he opens the door to his family's ranch house. Seems the new housekeeper is a gorgeous young woman who cooks like an angel and wrangles his family like a pro. If only she didn't dislike him so much...Penny Cash is down on her luck, and the last thing she needs is a flirtation with a wild, carefree cowboy. Sure, he's funny and sexy, but they're as different as whiskey and tea. And she'll be leaving town as soon as she finds a full-time teaching position. But when trouble comes calling, Penny will find out how serious Sam can be when it comes to protecting the woman he loves...Also includes the bonus novella Saved by the Cowboy by A.J. Pine! Olivia Belle has always believed in fairy tales...until the moment her boyfriend dropped to one knee. When Olivia speeds into Cash Hawkins' town like a modern-day Cinderella in a ball gown and glass slippers, Cash's careful existence is thrown for a loop. Olivia could be his happily ever after... if this runaway bridesmaid doesn't run off with his heart.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Forever (February 26, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Mass Market Paperback ‏",
                "value": "‎ 464 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1538711176"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1538711170"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.25 x 1.55 x 6.75 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#198,562 in Books (See Top 100 in Books) #4,635 in Western & Frontier Romance #11,883 in Romantic Suspense (Books) #37,990 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 199 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bookworm K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7ZTW467XQ57CZN5EQLNHXI3XHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3A5DT1C6B0B3D?ASIN=1538711176",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 27, 2019",
                "reviewTitle": "5.0 out of 5 stars GOTTA LOVE THEM COWBOYS!!!",
                "reviewText": "LOVED IT!!R.C. Ryan did it again with an outstanding story that leaves me wanting more. As well as looking forward to the next book.I was drawn into this book from the first page. I couldn't put the book down.As they say opposites attract. Sam and Penny are the opposite of each other. Penny and Sam characters had me laughing one moment and saying \"Oh, How sweet\" the next. It did have some intense scenes which added to the story.Thank you Netgalley and Forever.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUK6CK44UR3HFAH25GOHH3AVPLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RED81MJZU5VQW?ASIN=1538711176",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 26, 2019",
                "reviewTitle": "5.0 out of 5 stars Great Read",
                "reviewText": "Love R.C. Ryan's work. The setting of a cowboy getting to know the young housekeeper. Her name is Penny Cash and brings a lot of laughs to Sam. She see him as gambler and silly man. But as they get to know each other she changes her mind and he changes. There is also a little mystery involving one of her brother's. You will enjoy the family dynamic and them getting to know and love each other.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HannahPilar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAZKNKV3IB6L7CY36NIXCQR2A5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWQ151ZUNFJLM?ASIN=1538711176",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 1, 2019",
                "reviewTitle": "4.0 out of 5 stars ARC REVIEW Love me a Cowboy",
                "reviewText": "Montana Strong #2, can be read as a standalone. All things are quiet on the Monroe Ranch but it's about to get shaken up when Mac Monroe does a favor for a very dear friend. Mac hires Penny Cash on at the ranch to help out with cooking and cleaning when her teaching job at Haller Creek falls through. When Mac adopted Sam and his brothers over sixteen years ago he turned the three foul-mouthed troublemakers into ranchers. Sam Monroe took to ranching like it was something he was meant to do. Sam was in no hurry to settle down he was content to go out drink beers, hustle a little at pool, and sleep around that was until he walked into the house after three weeks out with the cattle and found Penny in his kitchen.Penny was used to being in a household of all men, she practically raised her three brothers all by herself after their parents death, so she was prepared for what to expect when she started on at the Monroe Ranch. What she wasn't prepared for was how strongly attracted she was to Sam. A slow burn romance that builds their relationship before anything else. Both are hard workers who know the value of a hard days work but where Sam knows how to kick back and relax Penny doesn't. Penny has worked hard her whole life when she wasn't taking care of her brothers or her elderly aunt she was studying to be a teacher, it's been her dream for as long as she can remember. Penny discovers that her youngest brother is working on a ranch outside Haller Creek, she also finds out he's been betting and losing money playing pool and when trouble follows him Penny gets caught in the middle. Sam just found happiness with Penny and now he's will to put his life on the line to save her.Overall, it's a contemporary western with a splash of suspense, just the way I like it. R.C. Ryan hits the spot with this heartwarming family relationship, sexy and smart cowboys, a picturesque setting, and a romance that burns slow but hot. Sam and Penny have a lot in common but just enough to keep it interesting. Finn said the dreaded famous last words of a single man, \"I guess it's up to me to stay strong and resist whatever love virus is going around.\" *maniacal laugh* I can't wait for his book. Thank you to Forever Publishing for this ARC, as always this review is Honestly and Voluntarily Given.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L Davenport",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF5A7ZOZU4N7EYLKTHWBZS5IYHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25DW5AORHBBL8?ASIN=1538711176",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 15, 2019",
                "reviewTitle": "5.0 out of 5 stars R.C.Ryan continues the tradition of excellence.",
                "reviewText": "This is the 2nd in a trilogy. It is just as great as # 1 and I can't wait for the release of #3. Ryan mixes together love, family values and a \"page turner\" story line. Love her writing style. Congratulations R. C. Ryan on another winner!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kiki Otto",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJMVQIWZTSOMN4WGKXUVLVCXHBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23RB0KJXDKDFV?ASIN=1538711176",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 31, 2019",
                "reviewTitle": "5.0 out of 5 stars Read the series!",
                "reviewText": "R.C.Ryan writes a fabulous story. Interesting characters and storyline. Her cowboy series are fun reads for everyone one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa Zaragoza",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWJBJVOYZRZF5JMOUW4Y2HFTYYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YM2U5K3YQEL8?ASIN=1538711176",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 14, 2019",
                "reviewTitle": "5.0 out of 5 stars Fantastic read",
                "reviewText": "Loved the book. Didn't want to stop until I was done reading the whole thing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley hall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4KN4SKCW3LXJMMLD75GQSOB6AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18MR0JMZSW5OX?ASIN=1538711176",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 11, 2019",
                "reviewTitle": "5.0 out of 5 stars Great read",
                "reviewText": "Love the book cant wait to read the next one",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alecia (The Staircase Reader)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKLYGGARGONSKNXMQEXNG3ISZMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM2PU5W7V0MET?ASIN=1538711176",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 27, 2019",
                "reviewTitle": "4.0 out of 5 stars A slow burn with a swoony cowboy? YES, PLEASE!",
                "reviewText": "♥ Slow Burn♥ Swoony Cowboy♥ Loads Of Suspense♥ Irresistible Love StoryThe Cowboy Next Door is the second book in R.C. Ryan's Montana Strong series.This series is based on three brothers who were born into abuse and neglect, fighting their way through life until they ended up on Mac's property and Mac took a hand at taking the boys in and raising them to be decent human beings instead of hellraisers.The Cowboy Next Door is Sam Monroe's story.Sam has always been the son Mac worried most about. He was the one that hid his pain behind laughter and smiles. Now Sam is living his life as a rancher by day and a pool hustler by night.But when Penny is hired on as the housekeeper at the Monroe Ranch, Sam finds his thoughts are taken up by the beauty and slowly he begins to change his ways.This is the second novel I've read by R.C. Ryan, To be honest, I liked the first book in this series (Cowboy On My Mind) but I didn't love it. So I was a bit hesitant to request a copy of The Cowboy Next Door. But because I love cowboys so damn much, I couldn't resist! And I'm so damn glad I caved into the temptation. I loved Every Single Thing about this romance. The slow burn, the suspense towards the end along with those final heartstopping moments. This one definitely had me on the edge of my seat hoping for the best, but preparing for the worst.Penny and Sam's romance is so freaking adorable. I loved their playful banter that ignited in two nights of endless passion. Couples like them are the reason why I read romance novels!Even though the first book in this series didn't spark my attention I have to say, after reading The Cowboy Next Door I'm more intrigued by this series and I can't wait to get ahold of Finn's story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bibitte",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 23, 2019",
                "reviewTitle": "Pleasant to read",
                "reviewText": "I can’t wait for the third novel",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}