{
    "remaining_requests": 2163,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Not-Plan-totally-addictive-consuming-ebook/dp/B0CPM8TLNL",
    "body": {
        "name": "Not in the Plan: A totally addictive and consuming lesbian romance (Single in Seattle)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Not-Plan-totally-addictive-consuming-ebook/dp/B0CPM8TLNL",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71GmnKkfJbL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Dana Hawkins",
            "link": "https://www.amazon.com/Dana-Hawkins/e/B0CPRPKXWS/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 77,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CPM8TLNL"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Storm Publishing (January 31, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 31, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1180 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 180508206X"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,075 in Kindle Store (See Top 100 in Kindle Store) #25 in Lesbian Fiction #35 in Gay & Lesbian (Kindle Store) #38 in Lesbian Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 77 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "What readers are saying about Not in the Plan",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/9477fa13-2991-43c0-abbd-1effdb7c7e05.__CR0,0,1080,1080_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/5be9a2ac-041f-44cc-8a9f-d48733a02e1f.__CR0,0,1080,1080_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/071f6bd4-8074-44a7-9c93-3a2827c3aeb7.__CR0,0,1080,1080_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Swoon-worthy sapphic romance for fans of Ashley Herring Blake, Casey McQuiston and Alexis Hall",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/6dd04e10-c58f-4b20-936d-e0d93b8eff21.__CR0,0,1080,1080_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/30c6e101-8079-4a80-b7ed-b74efd6f6578.__CR0,0,1080,1080_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/f8dbd9fb-f43f-4f69-986b-8e9d3ae3cdc7.__CR0,0,1080,1080_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "More spicy queer romance from Dana Hawkins",
                "media_link": []
            },
            {
                "media_text": "Not in the Plan In Walked Trouble Single in Seattle Book 1 Book 2",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/9477fa13-2991-43c0-abbd-1effdb7c7e05.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/5be9a2ac-041f-44cc-8a9f-d48733a02e1f.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/071f6bd4-8074-44a7-9c93-3a2827c3aeb7.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/6dd04e10-c58f-4b20-936d-e0d93b8eff21.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/30c6e101-8079-4a80-b7ed-b74efd6f6578.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/f8dbd9fb-f43f-4f69-986b-8e9d3ae3cdc7.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/7653dec7-c09d-4577-8806-e51ea2856def.__CR0,0,600,1200_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/332506e2-82ba-4d1a-978e-e4898708d024.__CR0,0,600,1200_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Erica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3R6YZVOTYKMLKKZF5PINKUHO5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N4XOAXVKBY9R?ASIN=B0CPM8TLNL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars 5 star read love this book",
                "reviewText": "A full, happy, hearty five star for NOT IN THE PLAN! I loved this book!! The story followed two women, super bubbly Charlie, and a quieter and shy, Mack. A genuine opposites-attract tale, where you can feel the spark between the women immediately. The story keeps it real with what it is like to struggle with personal issues, deadlines, and running a small business while also keeping it light-hearted and warm. The character descriptions were so good I felt like I knew them. The side characters took on a life of their own, and I absolutely loved the goofy dad and the best friend, Ben. The chapter titles were original and fun, and the coffee shop setting was perfect! The story had just the right amount of steam- not too much and not too little. Highly recommend this to everyone!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Loren",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKQC4ARID23OOKV3Q4IV3GBYS5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS0TGL3KGXMLT?ASIN=B0CPM8TLNL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars This adorable book explores the feelings of self-doubt and healing in your 20s and was fun to read.",
                "reviewText": "This sapphic rom-com explores the feelings of self-doubt, healing, and growing in your mid-20s. Everything starts with Mack, 25 years old and allergic to anything resembling a relationship, and her decision to run away from New York to Seattle to escape a looming deadline. Charlie is drowning in self-doubt and hiding truths from her only person, her childhood best friend, Ben. After opening her coffee shop, Sugar Mugs, six months prior, debt collectors started ringing, and every lost coffee counted against her. When Mack stumbles into Sugar Mugs, she finds her muse and the missing piece to help her write her second novel but doesn't tell Charlie. The pressure on Macks's shoulders isn't only from the success of her first book. This thriller made the New York Times best-seller list and is loved by thousands, but the financial pressure of the second book advance is already being used to help her parents out without their knowledge. Andrew and Kellie, Mack's parents, are high school sweethearts who moved from the West Coast to the East Coast to raise Mack but moved back to Seattle to take over the family construction business. Just when everything is going right, as Mack begins to write her first book, Kellie is diagnosed with breast cancer. Bills pile up as they often do with the American medical and insurance systems. Instead of allowing her parents to stress and chance the possibility of her mother not getting better, Mack has cleared all of it away without their knowledge. But if Mack doesn't deliver this second book, the advance will be called back, and the money is no longer there. Charlie is the piece that Mack was missing in more ways than one. After two years of healing from her divorce, Charlie finally feels like herself, but all the work and love she put into her business isn't enough to keep all the confusing notices away. She converted her late aunt's home into a cozy coffee shop where all are welcome. She did her best, but contracts are confusing, especially when timelines are extended. Charlie expects someone with red tape and a frown to shut Sugar Mugs down. But Mack might be Charlie's missing piece as well. Dana Hawkins built Charlie, Mack, and the gang so that they felt real. The balance between humor and real-life problems that everyday humans encounter is palpable to the reader. All of the emotions expressed anxiety, the mix of nervousness and excitement, and the all-consuming feeling of falling entirely in love while being afraid to trust or commit fully were all felt through Hawkins's language. It was utterly beautiful. Was it the funniest rom-com book I have ever read? No, but a few times, I did catch a laugh escaping me as I read, but it was delightful. Another compliment towards Hawkins' writing is that the setting was never far from my mind, and in this sense, the atmospheres surrounding the settings and characters were always visible to the mind's eye. The coffee shop, Mack's parent's condo, the guest room where half of her second book was written, the parade, the market and restaurant scenes, and Charlie's loft were all written so that the reader was watching all the events unfold. The pacing of a romance book is a critical detail that can often be overlooked and become a plot hole. While the first week or two of Mack and Charlie meeting and knowing one another made up approximately 75% of the book, the last 25% of the book happened over a one to two-month period, where both characters focused on the individual endeavors of their careers while also focusing on their relationship. Unfortunately, Ben, Charlie's best friend and co-worker, felt like a joke. It was disheartening to see yet another pansexual character being used as comedic relief. Although there was depth to him, Charlie's memories of Ben were shallow. This character trope is problematic for many reasons and needs to be put to bed once and for all. If you want a sapphic romance book that will make you swoon, check out *Not in the Plan* by Dana Hawkins. It's funny, yet the characters could jump off the page, and it didn't feel like reading. It's a relatively quick read, which would be an excellent choice for a \"pick me up\" read. Thank you to Storm Publishing for allowing me to be an early reader. All opinions expressed in this review are my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vincent89",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXMBCEPSNPTJHKIW6WXBNXNCJAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17IV21WBF7GR2?ASIN=B0CPM8TLNL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Sweet, Well-Written Romance With Rainbow Sprinkles",
                "reviewText": "I really enjoyed this author's writing style! Mack was relatable and I totally understood why she did the things she did. Charlie was a perfect muse. I love coffee shops and I found myself wishing I could hang out at Sugar Mugs. This deals with real-life issues without ever getting too heavy, and I loved seeing the slow burn romance develop. Mack's parents are really refreshing. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJDE2OS4MDKRMDWBG7YRXKYGDDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJK0COECA6D9U?ASIN=B0CPM8TLNL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars A feel good read!",
                "reviewText": "A fun and lighthearted read that finds you cheering on all of the characters. Whether you enjoy queer romance or simply a “feel good” story of love and redemption, this delightful novel is like a mocha: warm, sweet, and leaves you with a little more energy than when you started!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kait D'Souza",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXIO2OY7F2ETLCM23GRU4I7WVKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JQIWAVGNRQKY?ASIN=B0CPM8TLNL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Cute sapphic romance!",
                "reviewText": "I absolutely adored this debut sapphic love story from Dana Hawkins. Being a former barista and currently living in Seattle, I related to Charlie from the first page. From her love of tattoos to her hatred of complicated, contradictory coffee orders, her personality reminded me of myself. Charlie was a character I was rooting for throughout the whole story.Mack, on the other hand, was downright adorable, I loved how her chapters were written with a clean writer’s touch, her narration poignant and filled with vivid, colourful descriptions. Her creativity showed through the page and it was fascinating to step into her head and see how she viewed the world as a writer desperate for inspiration. From the moment she walked into Charlie’s coffee shop, I wanted them to get together thanks to the sheer juxtaposition of their two characters. They complement each other perfectly, which I adored about this book.Fair warning, this book is a slow burn. At times I was biting my nails waiting for either Mack or Charlie to finally work up the courage to confess their feelings. At other times, I was relishing in the anticipation of them getting together, and savouring the cute moments when their relationship was budding, I adored the way they danced around each other, but I know that type of romance book is not for everybody.This book also has a third-act breakup that you can see coming from a mile away that honestly the book could have done without. The ephemeral angst felt very inconsequential and rushed to me. As a lover of Ali Hazelwood, I am used to the third-act breakup, but this one could have been written better.Shout out to Netgalley and Storm Publishing for sending me a copy of this book for my thoughts.Four out of five stars.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ranger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJFVQRPEMASZ72JIZ3UDR5UBGRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N18I2JEGVSQN?ASIN=B0CPM8TLNL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Very Entertaining!",
                "reviewText": "I liked the MCs and enjoyed how they fell in love despite being total opposites. The story gave me many smiles. The writing was excellent and I definitely will read the next book by this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rebecca timm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETVK6F6XYK2FKD2YZJLJQXVPV4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UVI6T4G04TL0?ASIN=B0CPM8TLNL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Great read!",
                "reviewText": "Loved, Loved, Loved this sapphic book! You can just about taste a hot cup of americano while immersed in the Seattle vibe. The characters are relatable and feel like they could be friends of your own. Perfect read for a relaxing day on the beach or curled up in your favorite reading nook on a Sunday afternoon.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}