{
    "remaining_requests": 2116,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Temptation-Hunted-Book-Ivy-Smoak-ebook/dp/B00VVG6LMI",
    "body": {
        "name": "Temptation (The Hunted Series Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Temptation-Hunted-Book-Ivy-Smoak-ebook/dp/B00VVG6LMI",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/911JMXrcfiL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ivy Smoak",
            "link": "https://www.amazon.com/Ivy-Smoak/e/B00TUORWMQ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 32427,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00VVG6LMI"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Loft Troll Ink (April 8, 2015)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 8, 2015"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2601 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 353 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,000 in Kindle Store (See Top 100 in Kindle Store) #12 in Billionaires & Millionaires Romance #85 in New Adult & College Romance (Kindle Store) #100 in Billionaire Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 32,427 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "eBook Paperback Audiobook Special Edition Paperback Special Edition Hardcover Other Editions Read free in Kindle Unlimited! Put Professor Hunter's face on your shelf! Narrated by the amazing Meghan Crawford A gorgeous special edition paperback A gorgeous special edition hardcover",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/5db9c233-8d7c-4332-b3b4-129ac00948e0.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/75d9f120-c715-43a3-9034-1d89ce55bac0.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/bbf4a8a0-49ef-4178-a590-b786ea7dca00.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/1ad82b75-c229-4e59-a4ae-cb623952f7bb.__CR0,2,4047,1252_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/5be03a83-62a4-4fac-88f9-2ac9b928a0f9.__CR0,0,1251,2501_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/3dcb622b-69af-4a75-9573-0eeae8a51f5c.__CR0,0,1251,2501_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/e1e29f5f-d853-4416-89ab-84aa4d525419.__CR0,0,1251,2501_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/9c5c7b97-b39b-4d53-ae1b-482b4b54d222.__CR0,0,1251,2501_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/0ae56d0e-ab81-4944-b4ad-97fb9be8fc9c.__CR0,0,1251,2501_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "OptimisticXennial 2023",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2WCG34CPLSVFZMKVMJMFEGFGUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19ZTONW9EEZR9?ASIN=B00VVG6LMI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved this series",
                "reviewText": "I’m reading this series for the second time, and I truly enjoy it! Penny and James are not just soulmates but also twin flames. They sure complement each other. Now I am ready to read Addiction for the second time.🔥",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francheska Ortiz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPMMXF6DRBRBV2DMFSANLQAZV7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NRFAH0II8HTL?ASIN=B00VVG6LMI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars penny and the professor",
                "reviewText": "It was good,.. a little slow to start and left in a cliffhanger but I’m anxious to see how the next chapter of their story plays out",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danielle B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOGRIX2G24XSDM46XTUTLRYZVXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R342C4FVM86RQ8?ASIN=B00VVG6LMI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars LOVE this series!",
                "reviewText": "This is a spicy book and I love how it's written and finished the book very fast. I love Penny's and James's relationship and feel like they have a relatable relationship!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Simmom2001",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELWNPLQ7MFWUKBO6IPHYUUW32OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FFSZ7VW7ZGUU?ASIN=B00VVG6LMI",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2023",
                "reviewTitle": "3.0 out of 5 stars taboo romance of mediocre proportions",
                "reviewText": "TLDR: Horny immature college student has mediocre affair with Hot young Professor.If I could sum this book up in one word, it would be “Blah.” Clumsy, insecure, college student crushes on Hot young Professor who is really running away from his problems. This book definitely deserves a YA rating, but reads more like a bad High school trope. The plucky FMC has no real character depth other than she’s a horny girl with low self esteem issues who can’t figure out how to deal with expressing herself when it comes to men. Her roommate/BFF/moral compass is pushy rather than supportive. The male love interests have more brains than both girls put together. The whole story is more of a meet-cute turns scandalous age-gap. If you can even call 7 years an age gap. The FMC shows her age mentally and emotionally. She gives “lost my v-card at spring break” and “stage 1 clinger” vibes. I felt like I was reading a dirty version of High School Musical meets Cruel intentions. Not really sure where the story could possibly go from here as far as HEA but I guess I’ll subject myself to the torture of following the story.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shannon Martin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWFM3MIOBLNOJVDLY7DDUHGNDOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GEGONYCMW854?ASIN=B00VVG6LMI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars excellent",
                "reviewText": "I tandem read this with Obsessed , Professor Hunter’s POV and I highly recommend doing it that way. These books were amazing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jamie hiatt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHDKMIPWREYYWOYTY534Z3W2BMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLOEVES98X4VY?ASIN=B00VVG6LMI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars awesome book",
                "reviewText": "I read this is 3 days! That’s how good it was!!!! Totally worth the read. I can’t wait to read the others.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathyhannahrblack",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDUQPHIU2CDIJEGKMNGQPDAKS4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TZW25AC74C4V?ASIN=B00VVG6LMI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 12, 2023",
                "reviewTitle": "4.0 out of 5 stars I would give it Four and One Half with Expectation of More...Temptation.",
                "reviewText": "I first was introduced to Ivy Smoak on a different platform and fell in love with her writing style and so I searched for some more books by her, and I found several and decided to read this series. This story took me a little bit by surprise. With Penny a student and in fact a sophomore, which I know is not a really bad thing seeing as he is only 27 but at first, I did not know that but eventually it did come out that he was a young professor. Seeing that Professor Hunter was young for a professor, and I can’t see it being that uncommon to find an attraction to someone else however frowned upon it is. Love is love. However, Penny’s character was unable to make her mind up what she wanted. She wanted James, but when she was around Tyler, she wanted Tyler. It became an annoying back, and forth which showed her age and her inability to own up to the fact that she is only 19 and could not let James know because maybe it was only lust that they were feeling for one another. In the end I was convinced that they will eventually get together, but they were probably going to go through a lot of tests and trials between their selves and with others to get there. We have not even heard from that wife of his that has been holding out signing the divorce papers. I think James has every reason to divorce her but seems like she wants to hang onto her fantasy life with him. Can't wait to read the next books in this series.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth Bennet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5MXNYGOFMWIIC6K3Q5FYJXY7FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GB146467R1W7?ASIN=B00VVG6LMI",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 5, 2017",
                "reviewTitle": "2.0 out of 5 stars 2 1/2 stars",
                "reviewText": "I found this book on my facebook page and it was free so I took a chance. I wanted so bad to like the story. The idea was one that appealed to me. James is a college professor and his student is Penny. She has only been with one other man and he treated her like crap after getting what he wanted. James is gorgeous 27 year old mature adult. It's one of the things that attracts Penny. Her roommate, Melissa, tries to encourage her to get out more but because of Austin (ex) she thinks poorly of herself and being hurt again. The other character worth mentioning is Tyler. He is in her class with Professor Hunter. It's important I bring up the name professor Hunter as several pages in the book are riddled with it. It was one of the biggest problems I had with the delivery of this, \"adult couple.\" This is a 19 almost 20 year old woman who falls for the teacher. You are pulled to sympathize with Penny. How she has been wronged by an immature man and Tyler who also came acrossed as only wanted one thing at first. So why even after the pair have been together several times is she still calling him as a student addressing a teacher instead of James?I guess it is meant to appear sexy and forbidden but for me it kept reminding me of how immature Penny sounded. The next thing that bothered me was apparently this girls wardrobe consisted of nothing but tank tops. Seriously it was like groundhogs day with Bill Murray all over again. Different day a different tank top. It was like the author had no imagination. I just want to sayagain the idea was wonderful it was in the delivery that made it crash. Another poorly thought out idea was that performs oral on her twice and it is the following day he asks if she has any STD's. I guess you only worry if it's your junk unprotected. This is also a man that later admits he has been with over 15 women from his college years wouldn't you think in order to keep himself clean he would go to greater lengths to protect himself. He had to notice her inexperience. Usually in books I tend to favor the h. I know that sounds sexist but I find that I am harder on my H in most books. It was not the case with this one. Penny was such an immature idiot. For all that she preached of wanting a man and not a boy she herself was adolescent.I could not see why a successful man almost 8 years older would choose such a weak and confused person. Burnt once in love that changed the course of his life it is so confusing what he is attracted to. She's into James, no wait she is going out with her ex Austin. She's pep talking to herself in the mirror so she doesn't jump back into bed with Austin. She's into James, no Tyler asks her out, James is a man, Tyler is sweet, James is mature, Tyler is gorgeous, she makes love to James in his house and things are great but wait while in the shower Penny finds something James has kept hidden. A shocker but a real adult would not jump to conclusion without hearing his side and refuse to talk to him for a week. She would not so freely be willing to jump in bed with Tyler, would she? One conversation two or three sentences are formed by James to explain what happened and her mood totally switches. If Melissa had not walked in she would have followed through with Tyler. At one point she is giving a speech about why she chose her major and flips out and runs from the room. James tracks her down to question what happened because he thought she was happy. Her reasoning and approach was so high school temper tantrum, not to mention how she hurts Tyler. Irresponsible and again made one question what was it James saw in her. The last thing I will mention is the secret she keeps that causes the separation at the end that causes the cliffhanger; because she finally chooses to be totally honest and this is what would push him away. Not all of her ridiculous behavior but when she finally tries to behave like an adult, that's irony for you. I hate to bring this up but I also felt like key points were ones I read in Fifty Shades. I'm not in anyway saying she stole them as they are different just reminiscent of ones I remember from that series. This is not BDSM though. I would like to say that I did laugh when Penny hid under the desk at lunch time, that was priceless. I can't see myself carrying on with the series, wish I could tho. I hope with future work she creates stronger characters that are more mature and know what they want and are not back and forth. Now, why she did not actually cheat on James the fact that it was clear that her feelings were for what was what was in his pants, ironically enough it's what she resented Austin about. That was my only conclusion when she could so easily just blow James off and go for Tyler and even look at Tyler the way she did was not consistent with a woman that was supposed to be falling for James.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emi Sasaki",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 2, 2023",
                "reviewTitle": "loved it",
                "reviewText": "It’s a teen romance mixed with wild sexuality. It’s not the kind of real life we are used so, if you like reality it’s not for you. Great for those who enjoy fantasies and those who remember how to be young and in love.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josiane larose",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 10, 2023",
                "reviewTitle": "La série qui m'a fait connaitre Ivy.",
                "reviewText": "La série Hunted est la première série que j'ai lu de Ivy Smoak. J'adore ca façon d'écrire et ses personnages haut en couleurs et attachants. Elle nous fait passer du rire au pleur, de la frustration en passant par la peur. C'a façon est unique et je l'adore. Je vous la recommande. Merci Ivy pour cette magnifique série. J'adore James :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kirsty",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 21, 2024",
                "reviewTitle": "Oh. My. Days.",
                "reviewText": "The plot twists, the thrills, the heightened excitement! It's sooooooo good! The mystery & intensity of thrill of them seeing each other is insane. 10/10.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shweta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 24, 2022",
                "reviewTitle": "Quick read for romance afficiniados",
                "reviewText": "Romance, erotica, interesting. The protaganist as expected very clearly defined and a man of every woman's fantasy. Fun to read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dri",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 1, 2020",
                "reviewTitle": "James & Penny",
                "reviewText": "I heard about James Hunter in the beautiful and very interesting series “Made of steel.” It made me very curious to know who he was. I love the way Ivy’s show the age gap in TEMPTATION this so passionate book. You can see how different the experiences of life is between the immature Penny and the mature Professor Hunter. I can’t blame either of them for their insecurities and fighting for their Relationship and love to survive. Looking Foward to read Addiction, Book 2 in Hunted series by Ivy Smoak.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}