{
    "remaining_requests": 2272,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beach-Read-Emily-Henry/dp/1984806734",
    "body": {
        "name": "Beach Read",
        "price": "$8.89$8.89",
        "originalPrice": "",
        "rawPrice": 8.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beach-Read-Emily-Henry/dp/1984806734",
        "soldBy": {
            "sellerID": "A1ZWVJTZO5RWFA",
            "name": "ZBK Wholesale",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1ZWVJTZO5RWFA&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41BK2XKbLFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31lkQzPK55L.jpg",
            "https://m.media-amazon.com/images/I/51AO2GbG9pL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Emily Henry",
            "link": "https://www.amazon.com/Emily-Henry/e/B01BW7AX4W/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ZBK Wholesale",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 67195,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Once I started Beach Read I legit did not put it down.”—BetchesOne of... The New York Times Book Review's Summer Romance Reads Entertainment Weekly’s Hottest Summer Reads of 2020Oprah Magazine's Best Beach Reads of Summer 2020Betches’ 20 Books to Read in 2020SheReads’ Most Anticipated Books of Summer 2020 Goodreads' Big Books of Spring Popsugar's 25 Exciting New Books Coming Out in May Bustle's Most Anticipated May Titles Shondaland's Five Books to Read in May TheSkimm's 11 Buzzy Books for Your Imaginary Beach Bag Good Morning America's 25 Novels You'll Want to Read this Summer The New York Post's Required Reading Good Housekeeping's 25 Best Beach Reads Huffington Post's Best Books to Read during QuarantineCNN's Perfect Summer ReadsLitHub's Ultimate Summer 2020 Reading List BookRiot's 6 Captivating New Books“Reader, I swooned! Beach Read is a breath of fresh air. My heart ached for January, and Gus is to die for—a steamy, smart and perceptive romance. I was engrossed!”—Josie Silver, #1 New York Times bestselling author of One Day in December“This is a touching and heartfelt book about love, betrayal, grief, failure, and learning how to love again. I adored going along on Gus and January’s journey, and I closed this book with a satisfied sigh.”—Jasmine Guillory, New York Times Bestselling Author of The Proposal“Beach Read is original, sparkling bright, and layered with feeling. Has trying to see the world through your long time crush/rival’s eyes ever been this potent and poignant? If whipcrack banter and foggy sexual tension is your catnip, you’ll adore this book.”—Sally Thorne, USA Today bestselling author of The Hating Game and 99 Percent Mine“Beach Read is exactly the witty, charming, and swoony novel we always want; it also happens to be the unexpected wallop of emotional wisdom and sly social commentary we need right now. I adored it.”—Julia Whelan, author of My Oxford Year “[It] has everything the title promises—a romping plot, family secrets, and the thrill of falling in love, all set on the sweeping shores of eastern Lake Michigan. I cannot wait to read what Henry writes next.”—Amy E. Reichert, author The Coincidence of Coconut Cake and The Optimist’s Guide to Letting Go“Delightfully romantic and slyly poignant, Beach Read is brimming with crackling banter and engrossing prose. It has every flavor of booklover catnip: rivalry, creative struggle, family secrets, and the sweet head-over-heels tumble into love. Emily Henry's Beach Read is 2020's perfect anywhere read.”—Christina Lauren, New York Timesbestselling author of The Unhoneymooners“If you liked Sally Thorne’s The Hating Game and Linda Holmes’s Evvie Drake Starts Over, you will definitely be into this, which feels like their spawn. (No one asked me to say this, by the way. I’m just high on that happy-sad feeling of finishing a book I enjoyed, that I wish wasn’t over.) Well played.”—Heather Cocks and Jessica Morgan, bestselling authors of The Royal We“Readers are sure to fall hard for this meta, heartfelt take on the romance genre.”—Publishers Weekly (starred review)“A heartfelt look at taking second chances, in life and in love.”—Kirkus Reviews“This will still sweep readers off their feet. January’s first-person narration is suitably poetic and effervescent, the small-town beach setting is charming, and the romance is achingly swoony.”—Booklist“That Henry can manage to both pack a fierce emotional wallop and spear literary posturing in one go is a testament to her immense skill.”—Entertainment Weekly About the Author Emily Henry is the #1 New York Times bestselling author of People We Meet on Vacation and Beach Read. She studied creative writing at Hope College, and now spends most of her time in Cincinnati, Ohio, and the part of Kentucky just beneath it. Find her on Instagram @emilyhenrywrites. Excerpt. © Reprinted by permission. All rights reserved. 9781984806734|excerptHenry / BEACH READ1The HouseI have a fatal flaw.I like to think we all do. Or at least that makes it easier for me when I’m writing—­building my heroines and heroes up around this one self-­sabotaging trait, hinging everything that happens to them on a specific characteristic: the thing they learned to do to protect themselves and can’t let go of, even when it stops serving them.Maybe, for example, you didn’t have much control over your life as a kid. So, to avoid disappointment, you learned never to ask yourself what you truly wanted. And it worked for a long time. Only now, upon realizing you didn’t get what you didn’t know you wanted, you’re barreling down the highway in a midlife-­crisis-­mobile with a suitcase full of cash and a man named Stan in your trunk.Maybe your fatal flaw is that you don’t use turn signals.Or maybe, like me, you’re a hopeless romantic. You just can’t stop telling yourself the story. The one about your own life, complete with melodramatic soundtrack and golden light lancing through car windows.It started when I was twelve. My parents sat me down to tell me the news. Mom had gotten her first diagnosis—­suspicious cells in her left breast—­and she told me not to worry so many times I suspected I’d be grounded if she caught me at it. My mom was a do-­er, a laugher, an optimist, not a worrier, but I could tell she was terrified, and so I was too, frozen on the couch, unsure how to say anything without making things worse.But then my bookish homebody of a father did something unexpected. He stood and grabbed our hands—­one of Mom’s, one of mine—­and said, You know what we need to get these bad feelings out? We need to dance!Our suburb had no clubs, just a mediocre steak house with a Friday night cover band, but Mom lit up like he’d just suggested taking a private jet to the Copacabana.She wore her buttery yellow dress and some hammered metal earrings that twinkled when she moved. Dad ordered twenty-­year-­old Scotch for them and a Shirley Temple for me, and the three of us twirled and bobbed until we were dizzy, laughing, tripping all over. We laughed until we could barely stand, and my famously reserved father sang along to “Brown Eyed Girl” like the whole room wasn’t watching us.And then, exhausted, we piled into the car and drove home through the quiet, Mom and Dad holding tight to each other’s hands between the seats, and I tipped my head against the car window and, watching the streetlights flicker across the glass, thought, It’s going to be okay. We will always be okay.And that was the moment I realized: when the world felt dark and scary, love could whisk you off to go dancing; laughter could take some of the pain away; beauty could punch holes in your fear. I decided then that my life would be full of all three. Not just for my own benefit, but for Mom’s, and for everyone else around me.There would be purpose. There would be beauty. There would be candlelight and Fleetwood Mac playing softly in the background.The point is, I started telling myself a beautiful story about my life, about fate and the way things work out, and by twenty-­eight years old, my story was perfect.Perfect (cancer-­free) parents who called several times a week, tipsy on wine or each other’s company. Perfect (spontaneous, multi­lingual, six foot three) boyfriend who worked in the ER and knew how to make coq au vin. Perfect shabby chic apartment in Queens. Perfect job writing romantic novels—­inspired by perfect parents and perfect boyfriend—­for Sandy Lowe Books.Perfect life.But it was just a story, and when one gaping plot hole appeared, the whole thing unraveled. That’s how stories work.Now, at twenty-­nine, I was miserable, broke, semi-­homeless, very single, and pulling up to a gorgeous lake house whose very existence nauseated me. Grandly romanticizing my life had stopped serving me, but my fatal flaw was still riding shotgun in my dinged-­up Kia Soul, narrating things as they happened:January Andrews stared out the car window at the angry lake beating up on the dusky shore. She tried to convince herself that coming here hadn’t been a mistake.It was definitely a mistake, but I had no better option. You didn’t turn down free lodging when you were broke.I parked on the street and stared up at the oversized cottage’s facade, its gleaming windows and fairy tale of a porch, the shaggy beach grass dancing in the warm breeze.I checked the address in my GPS against the handwritten one hanging from the house key. This was it, all right.For a minute, I stalled, like maybe a world-­ending asteroid would take me out before I was forced to go inside. Then I took a deep breath and got out, wrestling my overstuffed suitcase from the back seat along with the cardboard box full of gin handles.I pushed a fistful of dark hair out of my eyes to study the cornflower blue shingles and snow-­white trim. Just pretend you’re at an Airbnb.Immediately, an imaginary Airbnb listing ran through my head: Three-­bedroom, three-­bath lakeside cottage brimming with charm and proof your father was an asshole and your life has been a lie.I started up the steps cut into the grassy hillside, blood rushing through my ears like fire hoses and legs wobbling, anticipating the moment the hellmouth would open and the world would drop out from under me.That already happened. Last year. And it didn’t kill you, so neither will this.On the porch, every sensation in my body heightened. The tingling in my face, the twist in my stomach, the sweat prickling along my neck. I balanced the box of gin against my hip and slipped the key into the lock, a part of me hoping it would jam. That all this would turn out to be an elaborate practical joke Dad had set up for us before he died.Or, better yet, he wasn’t actually dead. He’d jump out from behind the bushes and scream, “Gotcha! You didn’t really think I had a secret second life, did you? You couldn’t possibly think I had a second house with some woman other than your mother?”The key turned effortlessly. The door swung inward.The house was silent.An ache went through me. The same one I’d felt at least once a day since I got Mom’s call about the stroke and heard her sob those words. He’s gone, Janie.No Dad. Not here. Not anywhere. And then the second pain, the knife twisting: The father you knew never existed anyway.I’d never really had him. Just like I’d never really had my ex Jacques or his coq au vin.It was just a story I’d been telling myself. From now on, it was the ugly truth or nothing. I steeled myself and stepped inside.My first thought was that the ugly truth wasn’t super ugly. My dad’s love nest had an open floor plan: a living room that spilled into a funky, blue-­tiled kitchen and homey breakfast nook, the wall of windows just beyond overlooking a dark-­stained deck.If Mom had owned this place, everything would’ve been a mix of creamy, calming neutrals. The bohemian room I’d stepped into would’ve been more at home in Jacques’s and my old place than my parents’. I felt a little queasy imagining Dad here, among these things Mom never would’ve picked out: the folksy hand-­painted breakfast table, the dark wooden bookshelves, the sunken couch covered in mismatched pillows.There was no sign of the version of him that I’d known.My phone rang in my pocket and I set the box on the granite countertop to answer the call.“Hello?” It came out weak and raspy.“How is it?” the voice on the other end said immediately. “Is there a sex dungeon?”“Shadi?” I guessed. I tucked the phone between my ear and shoulder as I unscrewed the cap from one of my gin bottles, taking a swig to fortify myself.“It honestly worries me that I’m the only person who might call you to ask that,” Shadi answered.“You’re the only person who even knows about the Love Shack,” I pointed out.“I am not the only one who knows about it,” Shadi argued.Technically true. While I’d found out about my father’s secret lake house at his funeral last year, Mom had been aware much longer. “Fine,” I said. “You’re the only person I told about it. Anyway, give me a second. I just got here.”“Literally?” Shadi was breathing hard, which meant she was walking to a shift at the restaurant. Since we kept such different hours, most of our calls happened when she was on her way into work.“Metaphorically,” I said. “Literally, I’ve been here for ten minutes, but I only just feel that I have arrived.”“So wise,” Shadi said. “So deep.”“Shh,” I said. “I’m taking it all in.”“Check for the sex dungeon!” Shadi hurried to say, as if I were hanging up on her.I was not. I was simply holding the phone to my ear, holding my breath, holding my racing heart in my chest, as I scanned my father’s second life.And there, just when I could convince myself Dad couldn’t possibly have spent time here, I spotted something framed on the wall. A clipping of a New York Times Best Sellers list from three years ago, the same one he’d positioned over the fireplace at home. There I was, at number fifteen, the bottom slot. And there, three slots above me—­in a sick twist of fate—­was my college rival, Gus (though now he went by Augustus, because Serious Man) and his highbrow debut novel The Revelatories. It had stayed on the list for five weeks (not that I was counting (I was absolutely counting)).“Well?” Shadi prompted. “What do you think?”I turned and my eyes caught on the mandala tapestry hanging over the couch.“I’m led to wonder if Dad smoked weed.” I spun toward the windows at the side of the house, which aligned almost perfectly with the neighbor’s, a design flaw Mom would never have overlooked when house shopping.But this wasn’t her house, and I could clearly see the floor-­to-­ceiling bookshelves that lined the neighbor’s study.“Oh, god—­maybe it’s a grow house, not a love shack!” Shadi sounded delighted. “You should’ve read the letter, January. It’s all been a misunderstanding. Your dad’s leaving you the family business. That Woman was his business partner, not his mistress.”How bad was it that I wished she was right?Either way, I’d fully intended to read the letter. I’d just been waiting for the right time, hoping the worst of my anger would settle and those last words from Dad would be comforting. Instead, a full year had passed and the dread I felt at the thought of opening the envelope grew every day. It was so unfair, that he should get the last word and I’d have no way to reply. To scream or cry or demand more answers. Once I’d opened it, there’d be no going back. That would be it. The final goodbye.So until further notice, the letter was living a happy, if solitary, life in the bottom of the gin box I’d brought with me from Queens.“It’s not a grow house,” I told Shadi and slid open the back door to step onto the deck. “Unless the weed’s in the basement.”“No way,” Shadi argued. “That’s where the sex dungeon is.”“Let’s stop talking about my depressing life,” I said. “What’s new with you?”“You mean the Haunted Hat,” Shadi said. If only she had fewer than four roommates in her shoebox apartment in Chicago, then maybe I’d be staying with her now. Not that I was capable of getting anything done when I was with Shadi. And my financial situation was too dire not to get something done. I had to finish my next book in this rent-­free hell. Then maybe I could afford my own Jacques-­free place.“If the Haunted Hat is what you want to talk about,” I said, “then yes. Spill.”“Still hasn’t spoken to me.” Shadi sighed wistfully. “But I can, like, sense him looking at me when we’re both in the kitchen. Because we have a connection.”“Are you at all worried that your connection isn’t with the guy who’s wearing the antique porkpie hat, but perhaps with the ghost of the hat’s original owner? What will you do if you realize you’ve fallen in love with a ghost?”“Um.” Shadi thought for a minute. “I guess I’d have to update my Tinder bio.”A breeze rippled off the water at the bottom of the hill, ruffling my brown waves across my shoulders, and the setting sun shot golden spears of light over everything, so bright and hot I had to squint to see the wash of oranges and reds it cast across the beach. If this were just some house I’d rented, it would be the perfect place to write the adorable love story I’d been promising Sandy Lowe Books for months.Shadi, I realized, had been talking. More about the Haunted Hat. His name was Ricky, but we never called him that. We always spoke of Shadi’s love life in code. There was the older man who ran the amazing seafood restaurant (the Fish Lord), and then there was some guy we’d called Mark because he looked like some other, famous Mark, and now there was this new coworker, a bartender who wore a hat every day that Shadi loathed and yet could not ­resist.I snapped back into the conversation as Shadi was saying, “Fourth of July weekend? Can I visit then?”“That’s more than a month away.” I wanted to argue that I wouldn’t even be here by then, but I knew it wasn’t true. It would take me at least all summer to write a book, empty the house, and sell both, so I could (hopefully) be catapulted back into relative comfort. Not in New York, but somewhere less expensive.I imagined Duluth was affordable. Mom would never visit me there, but we hadn’t done much visiting this past year anyway, apart from my three-­day trip home for Christmas. She’d dragged me to four yoga classes, three crowded juice bars, and a Nutcracker performance starring some kid I didn’t know, like if we were alone for even a second, the topic of Dad would arise and we’d burst into flames.All my life, my friends had been jealous of my relationship with her. How often and freely (or so I thought) we talked, how much fun we had together. Now our relationship was the world’s least competitive game of phone tag.I’d gone from having two loving parents and a live-­in boyfriend to basically just having Shadi, my much-­too-­long-­distance best friend. The one blessing of moving from New York to North Bear Shores, Michigan, was that I was closer to her place in Chicago.“Fourth of July’s too far off,” I complained. “You’re only three hours away.”“Yeah, and I don’t know how to drive.”“Then you should probably give that license back,” I said.“Believe me, I’m waiting for it to expire. I’m going to feel so free. I hate when people think I’m able to drive just because, legally, I am.”Shadi was a terrible driver. She screamed whenever she turned left.“Besides, you know how scheduling off is in the industry. I’m lucky my boss said I could have Fourth of July. For all I know, he’s expecting a blow job now.”“No way. Blow jobs are for major holidays. What you’ve got on your hands is a good old-­fashioned foot job quid pro quo.”I took another sip of gin, then turned from the end of the deck and nearly yelped. On the deck ten feet to the right of mine, the back of a head of curly brown hair peeked over a lawn chair. I silently prayed the man was asleep—­that I wouldn’t have to spend an entire summer next door to someone who’d heard me shout good old-­fashioned foot job.As if he’d read my mind, he sat forward and grabbed the bottle of beer from his patio table, took a swig, and sat back.“So true. I won’t even have to take my Crocs off,” Shadi was saying. “Anyway, I just got to work. But let me know if it’s drugs or leather in the basement.”I turned my back to the neighbor’s deck. “I’m not going to check until you visit.”“Rude,” Shadi said.“Leverage,” I said. “Love you.”“Love you more,” she insisted and hung up.I turned to face the curly head, half waiting for him to acknowledge me, half debating whether I was obligated to introduce myself.I hadn’t known any of my neighbors in New York well, but this was Michigan, and from Dad’s stories about growing up in North Bear Shores, I fully expected to have to lend this man sugar at some point (note: must buy sugar).I cleared my throat and pasted on my attempt at a neighborly smile. The man sat forward for another swig of beer, and I called across the gap, “Sorry for disturbing you!”He waved one hand vaguely, then turned the page of whatever book was in his lap. “What’s disturbing about foot jobs as a form of currency?” he drawled in a husky, bored voice.I grimaced as I searched for a reply—­any reply. Old January would have known what to say, but my mind was as blank as it was every time I opened Microsoft Word.Okay, so maybe I’d become a bit of a hermit this past year. Maybe I wasn’t entirely sure what I’d spent the last year doing, since it wasn’t visiting Mom and it wasn’t writing, and it wasn’t charming the socks off my neighbors.“Anyway,” I called, “I’m living here now.”As if he’d read my thoughts, he gave a disinterested wave and grumbled, “Let me know if you need any sugar.” But he managed to make it sound more like, Never speak to me again unless you notice my house is on fire, and even then, listen for sirens first.So much for Midwestern hospitality. At least in New York, our neighbors had brought us cookies when we moved in. (They’d been gluten-­free and laced with LSD, but it was the thought that counted.)“Or if you need directions to the nearest Sexual Fetish Depot,” the Grump added.Heat flared through my cheeks, a flush of embarrassment and anger. The words were out before I could reconsider: “I’ll just wait for your car to pull out and follow.” He laughed, a surprised, rough sound, but still didn’t deign to face me.“Lovely to meet you,” I added sharply, and turned to hurry back through the sliding glass doors to the safety of the house, where I would quite possibly have to hide all summer.“Liar,” I heard him grumble before I snapped the door shut. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 30 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 17 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "FROM THE #1 NEW YORK TIMES BESTSELLING AUTHOR OF PEOPLE WE MEET ON VACATION AND BOOK LOVERS!A romance writer who no longer believes in love and a literary writer stuck in a rut engage in a summer-long challenge that may just upend everything they believe about happily ever afters.Augustus Everett is an acclaimed author of literary fiction. January Andrews writes bestselling romance. When she pens a happily ever after, he kills off his entire cast. They’re polar opposites. In fact, the only thing they have in common is that for the next three months, they're living in neighboring beach houses, broke, and bogged down with writer's block.Until, one hazy evening, one thing leads to another and they strike a deal designed to force them out of their creative ruts: Augustus will spend the summer writing something happy, and January will pen the next Great American Novel. She’ll take him on field trips worthy of any rom-com montage, and he’ll take her to interview surviving members of a backwoods death cult (obviously). Everyone will finish a book and no one will fall in love. Really. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (May 19, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1984806734"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1984806734"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.52 x 1.06 x 8.27 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#778 in Books (See Top 100 in Books) #69 in Contemporary Women Fiction #196 in Romantic Comedy (Books) #667 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 67,195 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brenda Murray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGF7MRFPP4SC345J5RQKFZCIMOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37YXRIL759WQI?ASIN=1984806734",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Swoon",
                "reviewText": "Okay, I loved this Emily Henry more than the last. Though, it’s probably because I related to January a bit too much. For me, this wasn’t so much a rom-com as a book about the complexities of grieving the death of a deeply flawed parent. I’m probably projecting here.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eunice Viana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEX5QMNOYWT5HQ2XBGC2XDJPUF6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4C0XWA06V3D2?ASIN=1984806734",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "4.0 out of 5 stars a feel-good read…",
                "reviewText": "…Just what I needed!It was more slow-paced than I’m used to, but very light-hearted. I was expecting a bigger, more impactful ending after all that had unraveled through the story.I wish there was more about January’s relationship with her mom. That felt a little short to me, but still felt like a good read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mollieeee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUQGJHBZZFDNFCLGK26ZUQOW6TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34C3O0W0BQ2C9?ASIN=1984806734",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars SO GOOD 😍🤩😍🤩😍🤩",
                "reviewText": "So so so so so so so good.I’ve been deep in the romantasy world for a bit now and between Sarah J. Maas and now Fourth Wing (plus some other, non-magical Rebecca Yarros books), I thought it couldn’t get any better than that.I was wrong.I loved everything about this book and might just read it again now because I don’t want to leave January and Gus. And Pete and Maggie and Shadi.So so so so so so so good. I laughed almost constantly, I cried somewhat (and I DO NOT cry), and I felt so much, it was perfect.I can’t recommend this book any more vehemently - read it!! You won’t be disappointed (unless you’re a soulless ball of crusty goo).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Altaira Leon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDGYVXYSL5AMYA6A2KIOICXE6CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TYMBQMZSIIXM?ASIN=1984806734",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2021",
                "reviewTitle": "3.0 out of 5 stars Ok",
                "reviewText": "I saw this book so many times on amazon before buying it, because it was on the 2nd place in goodreads choice awards 2020 in Romantic genre, and was so interested on reading it, i even started reading it on my birthday’s eve, bc i went to a hotel to celebrate and all. I’ve seen it a lot on bookstagram and it has so many good reviews. I could not help buying it.-Pros: A clear picture of the process of writting a book by a full-time writter, some quotes are phenomenal, the friendship between January and Shadi and how a true friend will go to rescue, inspiring to see how a person can accomplish a task/project that seems impossible or hard to finish, cope with problems, hope perspective on love matters, strong family boundaries.-Cons: The romance was too much of a cliché for me, i can’t simply enjoy neither believe player male characters who are relationship-phobes to keep falling for the main female character and completely change for them and fall in love almost begging them, idk, it feels like the same old story changing characters everytime, that inevitably and predictably keeps happening in most love stories. I could not connect with none of the personalities, i could not tolerate January that much, she had no special traits as to amaze me for her story and was way too selfish, like, the story could no conclude until she received “explanations” of her father reassuring her he loved her in letters. I mean, he was a great father, he was there for her, there was no doubt he loved her, yet she stops talking to her mother, the victim, punishing her more just because she (January, the queen), was not aware of the situation happening between her parents. Totally unfair and selfish attitude, did not like at all, No human being is that perfect to give everything to their partner, sometimes that’s why people are unfaithful, and that has nothing to do with the kids; i felt like the same line complaining of her father was rewinding all the story long. It was too predictable, no mistery to me, no surprise. I did no like the connection between January and Gus neither. Did not feel goose bumps when they had their moments.It was obvious they were falling in love since the first chapters. Two adults alone in a beach city, both single, spending weekends together, and flirting all the time, just because they said they weren’t falling in love wasn’t going to distract from the obvious, so it was very much predictable.I don’t pretend to be hurtful, this is just my personal opinion. I don’t think i’ll read any other books by the author, idk if I’m in a moment of my life where I’m not much into romance, but i did not enjoy that much.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leah B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOW3YQXKQV3OYRR2M7AY2D22WDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N84UKQGB7TGF?ASIN=1984806734",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "What a great read! I love anything Emily Henry rights because it brings the emotions. January's loss of her father really struck a cord because I also lost my father unexpectedly 11 years ago. So all the emotions surrounding her loss got to me. Totally recommend!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXYZALN7LAOXOT2OZBLZITDDROQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I8OZUXAL1VPJ?ASIN=1984806734",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Happy for Now…",
                "reviewText": "This book made my heart absolutely swell. Although a little slow at times, I rooted for these characters with every passing page and absolutely adore how it all came together in the end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VRamirez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTFITTBG4FRRJMVKYR3PZZN5PGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EV3Q14B4B8W6?ASIN=1984806734",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "This is the kind of book you read while relaxing by a pool or beach. I love it. Just a cutesy romance read. It’s a one time read type of book, but a good one nonetheless.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX3KHE77SLHXXSQIWGJNYTEDTFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28ROJHDZO7423?ASIN=1984806734",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars wonderful Romance",
                "reviewText": "This is a fun book that will give you moments of pure joy but help you digest and appreciate the difficulties in life. Beautifully written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariana R.Mariana R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 31, 2021",
                "reviewTitle": "Uma das melhores leituras do ano",
                "reviewText": "Com toda certeza, um dos melhores livros que li durante todo o ano. A escrita é linda, a história é encantadora e os personagens são incríveis. A história consegue ultrapassar os limites de um livro de comédia romântica, sendo capaz de criar camadas complexas que vão muito além do romance.Recebi a indicação como um livro leve para ser lido nas férias, acredito que isso pode interferir na experiência de alguém que deseja uma leitura simples, pois o livro tem diversos momentos complexos e introspectivos. Porém, para mim, foi uma grata surpresa.Gostaria de ver livros como esse sendo traduzidos e lançados no Brasil.O produto chegou sem defeitos, mas é bom destacar que a a qualidade dos livros internacionais é muito diferente dos brasileiros, com os quais estamos acostumados.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/B1ndtr+HO+S.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/B1iLxxD7T2S.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bete Noire",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "A gorgeous romance",
                "reviewText": "A beautifully bittersweet story - featuring relatable, complex characters who have serious personal mountains to climb before they can reach that elusive (and well-earned) HEA. A gorgeous, 'grownup' love story, this one will stay with you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on January 24, 2024",
                "reviewTitle": "Leuk boek, verschrikkelijke verzending",
                "reviewText": "Het boek was leuk. Zou het niet snel aanraden aan anderen.Zoals ik al bij andere bestellingen geschreven heb, werd ook dit boek in slechte staat toegestuurd. De kaft was opnieuw geplooid en de pagina's verkreukeld. Ik koop geen boek van 13 euro om dat eentje te hebben wat in een slechtere staat is dan als ik het tweedehands zou kopen voor 4 euro.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sudhir Rao",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 15, 2023",
                "reviewTitle": "My first romance book didn't disappoint!",
                "reviewText": "This is my first romance book that I bought with my own money on my own time and read cover to cover. I loved reading every page and was completely hooked on it! I was especially intoxicated by the descriptions of the people and floored by the plot twists!As a writer myself and having published a book - I usually avoid reading books of contemporary writers, lest I feel underwhelming and inferior to them and their work, but this is that one book which inspires me!Emily Henry is a top tier writer and I wish her the very best with all her books! The first I'll do now after posting this review is purchase a copy of another of her books!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josefina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 23, 2023",
                "reviewTitle": "Depends",
                "reviewText": "It’s a bit airy, but I loved it. Easy to read and easy to like if you’re into rom coms.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.44",
                "sellerName": "ZBK Books",
                "sellerRating": "4.5"
            },
            {
                "price": "$3.45",
                "sellerName": "Gama1521",
                "sellerRating": "4.5"
            }
        ]
    }
}