{
    "remaining_requests": 2290,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Things-We-Never-Got-Over/dp/194563183X",
    "body": {
        "name": "Things We Never Got Over (Knockemout)",
        "price": "$11.20",
        "originalPrice": "$18.99",
        "rawPrice": 11.2,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Things-We-Never-Got-Over/dp/194563183X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81WklxcuSZL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lucy Score",
            "link": "https://www.amazon.com/Lucy-Score/e/B00G2DKSBU/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 176851,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Lucy Score is a #1 New York Times, USA Today, and Wall Street Journal bestselling author. She grew up in a literary family who insisted that the dinner table was for reading and earned a degree in journalism. She writes full-time from the Pennsylvania home she and Mr. Lucy share with their obnoxious cat, Cleo. When not spending hours crafting heartbreaker heroes and kick-ass heroines, Lucy can be found on the couch, in the kitchen, or at the gym. She hopes to someday write from a sailboat, oceanfront condo, or tropical island with reliable Wi-Fi."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Bearded, bad-boy barber Knox prefers to live his life the way he takes his coffee: Alone. Unless you count his basset hound, Waylon.Knox doesn’t tolerate drama, even when it comes in the form of a stranded runaway bride.Naomi wasn’t just running away from her wedding. She was riding to the rescue of her estranged twin to Knockemout, Virginia, a rough-around-the-edges town where disputes are settled the old-fashioned way…with fists and beer. Usually in that order.Too bad for Naomi her evil twin hasn’t changed at all. After helping herself to Naomi’s car and cash, Tina leaves her with something unexpected. The niece Naomi didn’t know she had. Now she’s stuck in town with no car, no job, no plan, and no home with an 11-year-old going on thirty to take care of.There’s a reason Knox doesn’t do complications or high-maintenance women, especially not the romantic ones. But since Naomi’s life imploded right in front of him, the least he can do is help her out of her jam. And just as soon as she stops getting into new trouble he can leave her alone and get back to his peaceful, solitary life.At least, that’s the plan until the trouble turns to real danger.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (January 12, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 570 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 194563183X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1945631832"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.35 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 1.43 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#80 in Books (See Top 100 in Books) #5 in Small Town & Rural Fiction (Books) #31 in Romantic Comedy (Books) #115 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 176,851 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lola KilgusLola Kilgus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHN77GN6NS4ESCJQEHIX6AJVABDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JC7I1OVAPCXD?ASIN=194563183X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Loveddd!!",
                "reviewText": "I’ve had this series sitting in my kindle library since probably this time last year and I just have one thing to say for myself.. WHY DIDN’T I START THIS SOONER!!!I ADORED this book!!! I love the storyline so much! I connected with Naomi on so many personal levels. I truly felt for Wayway and what she had to go through with her mom. And Knox?!? UNFFF! There’s so many things I could say but the way he looked out for her and Wayway just melted meee. Also the relationship build up was amazing!!! The ending was the cherry on top!!!I felt like I was on a rollercoaster ride reading this book (that’s a good thing) Had me laughing, crying, angry, happy all the thingssss! I was so full of emotion I felt like I was there watching it all happen. I love reading books like this that really pull me in! YES YES YES!!I highlighted so many quotes and things that made me laugh, angry etc! Theres a thing Naomi says when she first met Knox that absolutely cracked me up.“I sighed. “Get out of my way, Leif Erikson.” “The name is Knox. And why are you here?” What the hell kind of name was that? Was it a hard Knox life? Did he tell a lot of Knox Knox jokes? Was it short for something? Knoxwell? Knoxathan?”A quote that really hit home for me:“You’re the one who has to live your life. Don’t apologize to other people for the decisions you make for yourself.”",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51ukT2HtZrL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "CaitlynnCaitlynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIKTEZLIG7L35U6K3YTTPTOHWRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36V8245DOKYEQ?ASIN=194563183X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Cute and Wonderfully Unrealistic Rom-com",
                "reviewText": "3.75/5 ⭐️Age Rating: 18+Pros:Loveable charactersComforting ReadGreat escape (I would so live in this town if I could)It made me really want to read the other books in the seriesHad me feeling all the emotions!Cons:Very unrealistic (I don't think that's too much of a bad thing, though...)The ending felt slightly rushedSometimes cringey dialogueThis book was honestly such a good romance! I loved how unrealistic and cheesy it was at times and it proved to be such a fun escape. I don't think it's peak quality but I can't doubt or complain about how much I enjoyed reading it. I try to base reviews off of how the book made me feel while also being realistic about how good of quality the book objectively is.Make sure that going into it, you know that this is supposed to be an unrealistic, feel-good book. Now there are some emotional and intense scenes in it but that just makes it all the more intriguing! I honestly was on the edge of my seat with how invested I was in these characters. A couple of them felt like cliche characters but Lucy Score still managed to make them interesting and enjoyable. The situations she came up with just made me laugh and they did a good job of showing off the characters and how they behave.One thing I did find annoying, however, was how back and forth Knox was with things. And I know that's the point of things... man says he doesn't care or want to help and yet still does anyway even though he wants not commitment. But I felt it was slightly too constant and obvious. That didn't stop it from making me slightly giddy every time though...Honestly, if you know the purpose behind the book and what you're signing up for, this is an amazing storyline. I'm super excited to read the rest of the Knockemout books because I'm WAY too invested in this small town!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/615hu9nbNiL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6J3DEQUBKMTGQP625DYJQ2ABZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R197F8MTBYH07P?ASIN=194563183X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars 5 STARS, WONDERFUL, PAGE-TURNER, 😍😍",
                "reviewText": "5 STARS for Book 2 of Lucy Score's wonderful exciting Series: Knockemout. This is my first book by this author & I was impressed by her well written storyline with its excellent tempo cadence style of words & put together so smartly it made the reading of it as if singing a wonderful song. Great BLURB provided.Characters are terrific, you know if you pulled up to a gas station in that town that you would recognize everyone of them. Plus you wish they were real people so you could meet them & be friends with these crazy loyal stand-up people.This is Naomi & Knox's story which begins with him mistakens her for her twin sister, Tina. Boy, let me tell you, she hasn't had her caffeine yet today & sparks fly both ways. The sexual chemistry between them is charged in the air & people can see it, but they act as if they don't. Later the sex is highly electrifying.Crime, attempted police chief assassination, break-ins, a 6th grade teacher with a grudge against a child because of an adult affair, bikers, tattoos, hair salon, homeless shelters, & so much more. This is a sit down dinner with full courses of love, childhood drama, physical abuse, the full emotional gamult, and then for desert laughs that will do your heart good, tender moments with a young child to let her know it's not her fault because of who she is, and just a rip roaring good time.I read this author for the 1st time all the way through, could not put it down & as an avid reader that speaks volumes. I'm going on to Book 2 & maybe a little sleep, first to prepare for another marathon read.RECOMMEND.WARNING::::::::: SEXUAL EXPLICIT ACTIVITY",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gwendalyn ♡",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKLSG5FJOEDU6XBWG6SI65PWWXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S3UZR4PRJRX9?ASIN=194563183X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars THINGS WE NEVER GOT OVER REVIEW",
                "reviewText": "Rating: ⭐️⭐️⭐️⭐️⭐️Spice: 🌶🌶🌶Review: I was not expecting this book to be so damn good! I have no idea why but the book size always made me not wanna read it and now I'm thanking God there's two more the same size 😅Naomi is just the ultimate badass FMC. Her heart is so dang pure, her drive is remarkable and the way she cares is just perfect!Knox is absolutely the best combo of sweet, obnoxious, and 🥵🥵🥵!! Very much a 'touch her and died kind of man. I loved this book was dual POV because just seeing how he thought completed this book!Nash, WayLay, Stef, Lina, Liza, Jeremiah... all the side characters had small things I loved about them.This was my first Lucy Score book and I cannot wait to start the next one! 😍",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DIBS420",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFEBFJFSYVXAU4VRZUP77ER2T6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SIKPYGY9Y21S?ASIN=194563183X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars GREAT READ",
                "reviewText": "I normally don't write reviews but I would like to say this book was very well written and somewhat relatable to me. The sarcasm, dry sense of humor, bad language and the personalities are hilarious and is so intriguing it gets you hooked. Lucy, if you're anything like the characters you write, you're one bad ass woman and anybody would be lucky to call you a friend! Half the characters reminded me of people I've known in real life lol thank you for the great read! On to the 2nd Knockemout 🙂",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leyendo Forever",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 18, 2023",
                "reviewTitle": "Amazing!",
                "reviewText": "5⭐️Ok, this book took me longer than usual. But I kept waiting until I had no distractions to read it!I laughed super hard, I loved the town, the secondary characters and I already have a crush on Nash & Lucien.The girl gang is aspirational and I wanna work in the Honky Tonk, with the best girl mates ever.Knox is a layered character, with the perfect balance of original and different background but with the sense of reality. Not OTT, making it eye-rolling incredible but in a mix that actually makes sense.Naomi is also very interesting, yet super funny and with the best BFF in the world. Also, her Sloane addition was cool.Anyway, jumping straight into the next one!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vitor Manoel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 22, 2023",
                "reviewTitle": "Compre, ótimo",
                "reviewText": "Facil de entender, de ler, dando conectivos com outras palavras, fazendo vc ler com fluidez...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ShubhShubh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 12, 2024",
                "reviewTitle": "Great book",
                "reviewText": "I recently had the pleasure of diving into \"Things We Never Got Over\" This emotionally captivating book takes readers on a poignant journey through the intricacies of human relationships, delving into the complexities of love, loss, and resilience.The author's prose is beautifully crafted, evoking a range of emotions that linger long after the final page is turned. Each character is intricately developed, with their own struggles and triumphs that readers can easily relate to. The narrative effortlessly weaves together multiple storylines, keeping the reader engaged and invested throughout.What truly sets this book apart is its raw honesty. The author fearlessly explores the darker aspects of human nature, tackling themes of heartbreak, betrayal, and forgiveness with a refreshing authenticity. Through the highs and lows of the characters' journeys, readers are reminded of the universal truths that bind us all together.\"Things We Never Got Over\" is a powerful reminder of the resilience of the human spirit. It's a book that will make you laugh, cry, and ultimately, reflect on the depth of the human experience. I highly recommend it to anyone looking for a compelling read that will stay with them long after they've finished the last chapter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/31fNytsKrIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "michaela strauss",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 11, 2024",
                "reviewTitle": "Love-Fun-Tears-Family-Sex-Friendship-Crime",
                "reviewText": "I really loved to read all the books of this series! It's a all in one. You get love-crime-family-friendship-sex-fun and tears. Really enjoy reading them!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CharliiCharlii",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 18, 2024",
                "reviewTitle": "Small town spicy page turner!",
                "reviewText": "I was hooked as soon as I read a few chapters. I couldn’t put it down, it’s funny, uplifting, spicy but without loosing a great storyline with some wonderful characters.The characters are witty ;) fun, so opposite but small town living with all their lives intertwined slowly but surly your routing for that love story, you know the one which seems an odd match but perfect. And this one is definitely a rollercoaster of a story with a mess going on that is sad, laugh out loud funny and some super spicy scenes that keep you hooked.I don’t like to put any spoilers in, as me myself hate them when looking at reviews, I’d rather have the enjoyment of reading the book to find out why the reviews say just how good it is. Let me tell you it’s definitely worth the read!I finished this book so quick, I couldn’t wait to read the next two in this series! I’d highly recommend this book.This was the first book I’d ever read by Lucy Score and I know she will become one of my favourites now that’s for sure!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71JW9K1hr+L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.00",
                "sellerName": "VikaSP",
                "sellerRating": "4.5"
            },
            {
                "price": "$10.00",
                "sellerName": "family library",
                "sellerRating": "4"
            },
            {
                "price": "$5.75",
                "sellerName": "readhearnow",
                "sellerRating": "4.5"
            }
        ]
    }
}