{
    "remaining_requests": 2268,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Heiress-Bride-Dukes-Romance-Book-ebook/dp/B0BFC8VD2M",
    "body": {
        "name": "The Heiress Bride: A Thrilling Regency Romance with a Dash of Mystery (A Duke's Heiress Romance Book 3)",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Heiress-Bride-Dukes-Romance-Book-ebook/dp/B0BFC8VD2M",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81i2Qw5EmjL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Madeline Hunter",
            "link": "https://www.amazon.com/Madeline-Hunter/e/B001ILMAVW/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1639,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BFC8VD2M"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Zebra Books (May 23, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 23, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2246 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 318 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#63,262 in Kindle Store (See Top 100 in Kindle Store) #643 in Women's Historical Fiction #1,596 in Regency Historical Romance #1,705 in Regency Romances"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,639 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f30272e6-bd23-40a2-9fee-6dc5be994706.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/39a50cd8-a5df-4a75-81fe-5a78f1be7728.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3541d0c7-aa55-4f57-af58-f5c8aa1220d7.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sheila M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEKDE4QV6FQYX4JVAPAQQCV2D6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MMZO0WDMQ532?ASIN=B0BFC8VD2M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Resolution to the Series",
                "reviewText": "FINAL DECISION: This is a delightful historical romance. Nicholas and Iris's relationship crackles with flirtation and intense chemistry. The story concludes satisfactorily, but I wanted more time for the couples to savor their happy endings at the end of the series. Still, it's a thoroughly enjoyable and engaging read.THE STORY: In the final installment of the trilogy, \"The Duke's Mysterious Heiress,\" Nicholas Radnor finds himself in a precarious situation as the new Duke of Hollinburgh. Despite his handsome appearance and charm, Nicholas is burdened with financial difficulties due to his land-poor status. More difficulties arise when Iris Barrington, the last of the three enigmatic women named in the duke's will, unexpectedly arrives at Nicholas' doorstep. Nicholas should be skeptical of Iris as she is clearly hiding something, and her story and history are suspicious. Nevertheless, Nicholas is an honorable man, and he works to help determine whether she is the rightful heiress, which is complicated by his immediate and intense attraction to Iris. Iris, an independent and unconventional woman, is a rare book dealer who enjoys a sophisticated and adventurous lifestyle. While she possesses secrets she must protect, she finds it difficult to resist Nicholas' curiosity and amorous advances. Although she should keep him at arm's length, his seductive skills make it challenging to maintain her resolve. As the two interact, their mutual attraction complicates matters, but they soon realize that personal gains are not their sole concerns. Nicholas must navigate his newfound responsibilities as the duke, unravel the mystery surrounding Iris' inheritance, and determine whether their family legacies make them enemies or allies.OPINION: This is a delightful story that kept me reading to the end in one sitting. One of the standout aspects of the book is the enchanting relationship between Nicholas and Iris, which is both flirty and simmering with intense chemistry. From the very beginning, their connection is palpable, and it's clear that they are drawn to each other. Despite their undeniable attraction, the characters' honor and the weight of their secrets prevent them from complicating their relationship, adding a layer of tension and anticipation that kept me eagerly turning the pages.The book skillfully weaves together the ongoing story surrounding the death of the prior duke, providing a satisfying conclusion to the trilogy. The mysteries and secrets that have been built throughout the series are tied up nicely, offering a sense of closure and fulfillment. Hunter's ability to seamlessly connect the threads of the overarching plot is commendable, leaving no loose ends and leaving readers satisfied with the resolution.While there is much to love about this book, the ending left something to be desired by me. The absence of an epilogue where all three couples from the series come together is a missed opportunity. It would have been a joy to see them all in one place, celebrating their love and the triumphs they've experienced. Additionally, Nicholas and Iris deserved more time to savor their happy ending, allowing readers to revel in their love story and witness the growth of their relationship.Despite this slight disappointment, the book remains a highly enjoyable read. The captivating romance between Nicholas and Iris, the well-crafted plot, and the satisfying resolution of the overarching story make it a worthwhile journey. This book left me with a warm and fuzzy feeling, even if I ended up craving just a little more time with the characters.WORTH MENTIONING: I really enjoyed the foray into book collecting depicted here.CONNECTED BOOKS: THE HEIRESS BRIDE is the third book in A Duke's Heiress series. The romance is self-contained in this book, however, there is an overarching mystery about the death of the duke that continues through all three books and is easier to understand if the books are read in order.STAR RATING: I give this book 4.5 stars.NOTE: I received an eARC of this book via Netgalley in order to prepare this review. I was not required to write a review or to write a positive review. All opinions contained herein are my own.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Coffeeandbooks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI4NZD3KS44D4DNEVODVWMB55NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU4NWEHWWQ1CA?ASIN=B0BFC8VD2M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "4.0 out of 5 stars A good completion",
                "reviewText": "While each book is its own story, the underlying plot of who killed the last duke, Frederick, weaves through all 3 stories. This 3rd installment completes the mystery and gives Nicholas and Iris their story.The author did a fine job hinting at possibilities but keeping the reader slightly off kilter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas W Shepherd",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGZVTVX5HKDDO43FVVXYH63JVIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25EAZWKKYTGXV?ASIN=B0BFC8VD2M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Best Duke's Heiress Book in the Series",
                "reviewText": "This series interweaves the lives and stories of three commoner women who unexpectedly receive an inheritance from the estate of the same English duke of the Radnor family. Of course, the family pitches an aristocratic hissy fit, and several members try to derail the legacies so they can divide the money and property among themselves. Then young men of the Radnor become romantically involved with these low born damsels of questionable character... And the game is afoot.Great fun, with a little murder mystery slicing the plot. Did somebody \"do in\" the old duke, who allegedly fell off a high wall at his ducal estates?HIGHLY RECOMMEND. You'll love Iris Barrington and her love-hate battle with the new Duke Nicholas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frank McDermott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPICHYISM76ELAR4B73EWYII6JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G0FFRCWPECI3?ASIN=B0BFC8VD2M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Inappropriate Bride",
                "reviewText": "Fascinating, mysterious, romantic and fun, this story checks all the boxes. I especially enjoyed the camaraderie of the men and of the women, and how they helped and supported each other.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tabby1249",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUGZMUYC6ACA733MBXXNZBRTE4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HZ44WD4JCZ9H?ASIN=B0BFC8VD2M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Very good series",
                "reviewText": "This has been a very good series especially because it features strong women who are not afraid to be exactly who they are and need no man to “save” them. Indeed, in this series it is the women who save the men from themselves.Book 3, the last in the series, got off to a bit of a slow start, but soon picked up the pace and resolved the mystery that binds the series together in satisfying, if not exactly surprising, way. The live story between Iris and Nicholas was also very good.I feel very comfortable recommending this series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jenartiles",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIPJ22QIVJ35YDYY4Y45GAYIKYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RQ2X2EM2YYE6?ASIN=B0BFC8VD2M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Nicholas and Iris",
                "reviewText": "What an enjoyable read! So many questions were answered in this final book of the trilogy.I loved how the women were strong, intelligent and clever, especially Iris. She was determined to clear her grandfather's reputation and found love as well, in spite of everything. The characters were well-developed and the dialogue well done. I have enjoyed Ms. Hunter's books for years and look forward to her next endeavor. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CSX",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBTEUJ64WBMX6OGWXMX3LYMTXOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C47RMU5NE1WT?ASIN=B0BFC8VD2M",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 25, 2023",
                "reviewTitle": "3.0 out of 5 stars Disappointing: dull story, wooden writing",
                "reviewText": "I've enjoyed most of Madeline Hunter's previous books: although some are much better than others, they've been inventive and well-written. Also, I quite liked the two previous books in this series, and had been looking forward to this one. Unfortunately I found it pretty disappointing, and way below her usual standards. (It's almost as if an understudy wrote it.) I found the writing stilted and wooden, as if it had been a first book by a mundane writer, not the flowing and pleasing narrative from the hand of an experienced and accomplised author. I also found the story rather dull: it seemed to be stuck in a circle, going on and on about the heroine's love of rare old books and of course her investigation of the scandal that ruined her grandfather. Not much happens for a long time, unless you're entertained greatly by the familial conflicts that are discussed every few pages, or the mysterious attacks on our newest heiress. I was bored enough that I skimmed through to the end -- essentially a DNF for me.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "audiobookfan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM32WVQ3AFA7ZWJGD46BDO2BGUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2N3J9VMY7NTYR?ASIN=B0BFC8VD2M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Fabulous end to terrific series",
                "reviewText": "The Heiress Bride illustrates why I am such a fan of Madeline Hunter's books. This plot is original, and the love affair between the Duke and Iris is moving -- and hot! The convoluted murder from Book 1 is finally solved, with surprising twists. We also revisit the couples at the center of Books 1 and 2. I love that the three heiresses are smart, but their sensibilities generally reflect the times. Loved learning about the book-selling business in the 1800s.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LakeLady",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 7, 2023",
                "reviewTitle": "recommend",
                "reviewText": "I really enjoyed this book even tho I have not read the previous 2. Plenty of mystery and romance to keep you turning pages.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frances Bard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 6, 2023",
                "reviewTitle": "Nearly",
                "reviewText": "This ended too suddenly. It really really needed an epilogue. Generally a good story arc . I liked the characters and that the baddie(s) were always there and are not just plucked out of nowhere.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H. St.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 29, 2023",
                "reviewTitle": "kleine Korrektur",
                "reviewText": "S. 34 der KindleAusgabe:Bonne chance statt bon chance (chance ist feminines noun).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}