{
    "remaining_requests": 2323,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/King-Wrath-Kings-Sin-1/dp/1728289726",
    "body": {
        "name": "King of Wrath (Kings of Sin, 1)",
        "price": "$10.50",
        "originalPrice": "$17.99",
        "rawPrice": 10.5,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/King-Wrath-Kings-Sin-1/dp/1728289726",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81cMua2TpUL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ana Huang",
            "link": "https://www.amazon.com/Ana-Huang/e/B00X0CEQNW/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 52154,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Ana Huang is a #1 New York Times, Sunday Times, Wall Street Journal, USA Today, and #1 Amazon bestselling author. Best known for her Twisted series, she writes new adult and contemporary romance with deliciously alpha heroes, strong heroines, and plenty of steam, angst, and swoon.Her books have been translated in over two dozen languages and featured in outlets such as NPR, Cosmopolitan, Financial Times, and Glamour UK.A self-professed travel enthusiast, she loves incorporating beautiful destinations into her stories and will never say no to a good chai latte."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "*A NEW YORK TIMES BESTSELLER*An arranged marriage billionaire romance standalone from New York Times bestselling author and BookTok sensation Ana Huang.She was my North Star, the brightest jewel in my sky.Ruthless. Meticulous. Arrogant.Billionaire CEO Dante Russo thrives on control, both personally and professionally.He never planned to marry…until the threat of blackmail forces him into an engagement with a woman he barely knows.Vivian Lau, jewelry heiress and daughter of his newest enemy. The wife he never wanted, and the weakness he never saw coming.It doesn't matter how beautiful or charming she is. Dante will do everything in his power to destroy the blackmail and their betrothal.There's only one problem: now that he has her, he can't bring himself to let her go.***Elegant. Ambitious. Well-mannered.Vivian Lau is the perfect daughter and her family's ticket into the highest echelons of society.Marrying a blue-blooded Russo means opening doors that would otherwise remain closed to her new-money parents.While the rude, elusive Dante isn't her idea of a dream partner, she agrees to their arranged marriage out of duty.Craving his touch was never part of the plan.Neither was the worst possible outcome: falling in love with her future husband.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books; Reprint edition (April 25, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1728289726"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728289724"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 14.7 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1.04 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#224 in Books (See Top 100 in Books) #60 in Billionaire Romance #73 in New Adult & College Romance (Books) #270 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 52,154 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/828e0c79-00cc-4eee-a000-4e4c39d3b7bb.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6ac5ba47-bcf2-4a61-9d0b-4c614329a517.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aba50377-e703-4077-871c-9acd9e01c25a.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ana Pineda-Gonzalez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHXIWZUQS2MDOYLQ27TL2UMLSPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SBLWHFV4X5WX?ASIN=1728289726",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars i love dante and vivian",
                "reviewText": "ARC ReviewI've literally been waiting for this book since we found out about Vivian and Dante in Twisted Lies and I'm so excited that I was able to read it beforehand. Ana Huang has easily become one of my favorite authors and the way she portrays her characters is just done so well and she executed that so well in this book. I was truly amazed but how much detail and depth she added to these characters, and I feel like it's something that I don't see too much.I assumed that Vivian was going to be a soft character but she was completely different. The depth of her character was so beautifully done and I absolutely love her character because of that and since I was able to relate to her so well. The struggles that she goes through with her family is something that many children with a cultural background go through. It was just so relatable and heartbreaking the things that Vivian had to go through because of her parents, people that she expected would always be there and support her through everything. I think that the culture aspect and parent relationship was done so well and something that I heavily enjoyed since it was done well.Dante, the man he is, just non-stop hits from him because the way he tried to avert himself from Vivian but was so soft for her made me fall in love with him. I just loved everything about his character and the way that he was so straightforward about who he was and never apologetic. Although there are many male characters like this, Dante just had a way of doing that I just ate it up and I loved every bit of it.Overall, I love this book and I'm so excited for the next book, and this series as a whole. Ana Huang will always have me in a chokehold with her books because they never disappoint me and they always leave me wanting more. I heavily recommend this book and I would say that if you want a little bit more fun to start with the twisted series since Dante is introduced in Twisted Lies which made me really excited for this book. Let me know what you all think about this book!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jaylyn Gardner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHDXCEEWHFXMADPUEP5XT53XV5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QEOIY1OY6VND?ASIN=1728289726",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "4.0 out of 5 stars 🦅",
                "reviewText": "Ana Huang absolutely obliterates the competition once again. This book was so perfectly detailed, but at the same time, not that that doesn’t make a lot of sense but let me try to explain better. This book gave us so much detail. Like the perfect amount of detail if you get my drift because it is a common issue that sometimes it will be under-detailed or over-detail especially in romance books. The attention to detail, and yet the precision of not giving us too much detail was probably my favorite part of this book. It gave us enough detail that we could visualize the story, but not too much detail where we felt overwhelmed by it, and that is was the entirety of the word count. The tension, the backstory, the whole whole thing was absolutely outstanding. The reason I did doc some points only because I stop reading the book for probably a couple weeks and I came back and I was like lost. But I pick right back up after a couple chapters and that was my only gripe with this book. The spicy scenes in this book were out of this world. I can’t explain about how much I loved those scenes. The. FL was a Woman after my own heart, because as the daughter of a very “controlling father” I completely got her struggle in going against her parents choices for her. This Fl was absolutely truly just so beautifully written. She was sassy and in charge and spunky when she had to be in this book and then complete personality shift and her perfectly explained. The ML in this book well, good Lord, he was beautifully explained as well. The complexities to his character in the struggle against the Fl and her family were so amazingly described. Overall, this book was absolutely amazing and I can’t wait to read the sequels.8.5/10🦅(388pgs)",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Norchelle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNOMMNFA7BD4HM5ZKESJ5D2B3DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y9XT93U1I6LW?ASIN=1728289726",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Dante & Vivian’s story ❤️‍🔥",
                "reviewText": "Book review: King of Wrath by Ana Huang 👑❤️‍🔥“You can’t see the stars from New York, so I brought the stars to you.”“Per te aspetterei per sempre, amore mio.”“Mia cara.”⭐️⭐️⭐️⭐️⭐️/5Ugh. Why did I take so long to read this??? From the first chapter, I already knew I was going to love this book. As always, Ana’s writing is so easy to read and the way she develops the story and characters feels so natural without any awkwardness or plot holes.King of Wrath has arranged marriage, enemies to lovers, and forced proximity tropes and I’m all for it. The tension between Dante and Vivian? 😮‍💨 the spice? 🥵 and the way their banters and talks had me giggling and smiling omfg.I loved the story and how it was written, it didn’t feel forced. I loved Viv’s character, I felt like I could relate with her in the sense of feeling like always having to please my family (except my parents weren’t like hers lol, they’re supportive of me). As for Dante? I was swooning nonstop at his words. I loved both the characters throughout the book - it kinda gave me Josh and Jules vibes, except less… hate. 😂I can’t believe it took me this long to start this book, but I absolutely loved it. As always, def recommend! Can’t wait to read the rest of the kings of sin series ❤️",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 1, 2024",
                "reviewTitle": "One of the most spectacular books I’ve ever read.",
                "reviewText": "I’m honestly having a hard time putting all my thoughts and emotions into words. This book is the definition of perfection. The way Dante and Vivian’s love story was written, it’s just beautiful. It’s heartbreaking at some points but it’s still so beautiful. Dante being so in love with Vivian, it always gave me a warm feeling in my heart whenever he showed her just how much he loved her. I got butterflies every time he said something sweet to her (or naughty hehe). Him being cold towards her in the beginning, to being the most romantic person who will do anything for her, it makes me want to cry. I love them so much and I’ll never forget this book and will never forget them and their beautiful love they have for each other💜 I’ll miss them and will miss Dante’s funny clap backs but I’m so happy they got their HEA🦋 Also, THE SMUT OH MY GODDDDDD THE SMUT IS IMPECCABLE HOLY OMFGGGGG I DIED IN HEAVEN😭😫❤️‍🔥🦋 Just had to say that lol but I can’t believe it’s over. There’s no more story to read. It’s bittersweet. I’ll miss them but I’m glad they got the ending they deserved. I’m glad they’re happy and together♥️ Thank you Ana for creating this masterpiece that no one will forget. I’ll always love Dante and Vivian. They have my whole heart🤧♥️💜🦋❤️💕 Thank you❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 5, 2023",
                "reviewTitle": "Perfect",
                "reviewText": "10000/10 perfection, everything about this book is addicting. Finished it in one and a half days 10 out of 10 would recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rhanna Penalva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 22, 2022",
                "reviewTitle": "King of Wrath Review",
                "reviewText": "King of Wrath marked the beginning of Ana Huang's new series, and I must say that she started the new era in a excellent way. King of Wrath's narrative is simple, yet cohesive and coherent. And Ana Huang's writing has evolved a lot over time,and the evolution is fully noticeable when I compare it to the first book I read by her, Twisted Love. I really like the way Ana led the story, I devoured the book in one day because I was so involved in the story.Vivian Lau is one of Ana Huang's best protagonists, in my opinion. She is simply fantastic and she has a beautiful evolution throughout the book. It was beautiful to be able to follow her evolution. Vivian had a beautiful development and all her psychological aspects were very well elaborated.Dante was a perfect character too. I've been curious about him since Twisted Hate's first appearance, and the wait to learn more about him was well worth it. Ana Huang developed all aspects of the character, from the personality to the psychological and emotional aspects.Dante and Vivian's relationship was wonderful from start to finish, and I loved the fact that Vivian stood up to Dante at every turn. Ana Huang managed to develop every detail of their story as a couple very well, from the moment they hated each other to the moment they found themselves in love. The only thing I missed was the presence of more domestic scenes between the two of them.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marco Stubig",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 6, 2024",
                "reviewTitle": "top",
                "reviewText": "alles super",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shirsha Roy Choudhury",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 30, 2024",
                "reviewTitle": "He looks at her like he never wants to look away 😭",
                "reviewText": "This is such a good book!! The arranged marriage angst hits so good. The tension, the hate that they are feeling attracted to each other despite knowing this marriage is only of convenience, the desire to call make each other theirs, the confusion, the lust and finally the love, acceptance, partnership and possessiveness. Vivian is one hell of a strong women and Dante as dangerous as he is, compliments Vivian so beautifully, they are one of the strongest yet one of the graceful couples to exist in the King of Sin series. I thoroughly enjoyed this book !!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}