{
    "remaining_requests": 2003,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Walking-Air-Valence-Family-Book-ebook/dp/B00DYX9O4I",
    "body": {
        "name": "Walking On Air (Valence Family Book 1)",
        "price": "$5.99",
        "originalPrice": "",
        "rawPrice": 5.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Walking-Air-Valence-Family-Book-ebook/dp/B00DYX9O4I",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81jLEnmf3vL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Catherine Anderson",
            "link": "https://www.amazon.com/Catherine-Anderson/e/B00E6AEMJU/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1003,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From “incomparable” (Fresh Fiction) author Catherine Anderson comes a novel of lost souls, second chances, and love everlasting....Random, Colorado, is just another stop on the road for solitary gunslinger Gabriel Valance. Known for his drinking, gambling, and womanizing, he prefers to remain a stranger to anyone who crosses his path. But when an upstart gunslinger catches Gabe off guard and shoots him down, he regrets his empty, lonely life with his dying breath....Golden-haired beauty Nancy Hoffman settled in Random after fleeing an abusive past. Caring for her younger sister and working in a hat shop help her to forge ahead, though she remains fearful and mistrustful of men—and marriage.... Their paths will cross when Gabe gets a second chance at life and a divine mission: to sweep Nancy off her feet, gain her trust, and convince her to believe in his love. And in doing so, the once-hardened cowboy may save himself....From the Paperback edition. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00DYX9O4I"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (February 4, 2014)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 4, 2014"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2417 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 434 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#289,879 in Kindle Store (See Top 100 in Kindle Store) #1,202 in Small Town Romance eBooks #1,337 in Small Town Romance (Books) #1,835 in Small Town & Rural Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,003 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "L. G. Vernon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVANYPPLVPOXNCIRAJNALRXBARA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17ZVYVR1J9S35?ASIN=B00DYX9O4I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2014",
                "reviewTitle": "5.0 out of 5 stars Phenomenal Second Chance Romance",
                "reviewText": "Catherine Anderson has done it again~~stolen my nights, my sleep, my thoughts~~and left me wishing the next book in this series was already ensconced on my Kindle. This is an expertly drawn historical romance with strong elements about faith, hope, and the endurance of love.This story opens with murder, the murder of the Gabriel Valance, a gunslinger, having killed many during the course of his short life. Prone on a snowy boardwalk in Random, Colorado, his last cogent memory is seeing a beautiful 'Christmas Angel' standing in the candlelit window of her millinery shop across the street.That's when fate intervenes. Now standing before the pearly gates (in this instance, a table in a crumbling shack), Gabriel is given an opportunity to live life over. He has a month to save a lost soul in Random, and is provided the names of three individuals who fit that bill. One of them is the milliner he glimpsed as he died: Nan Sullivan. Gabe chooses her, and so begins the spiritual journey of a very bad man named Gabriel Valance.Armed with information provided by the angels at the gates of heaven, Gabe is redeposited in Random, not only burdened with his responsibility toward Nan, but also with a host of rules by which he must abide. He knows, too, that at the end of his do-over-month, he will again die at the hands of his killer, his only hope for heaven being his successful redemption of Nan.Nan Sullivan has secrets of her own. Believing she has murdered a despicable suitor, Nan is on the run. With her is her much younger sister, Laney, whom she passes off as her daughter. The two have been living successfully, however fearfully, in Random. But terror comes knocking when Gabriel Valance shows up on their doorstep, and he wants only one thing~~marriage with Nan.During his month, Gabe finds it increasingly more difficult to abide by the rules the angels at the gates have mandated. Complicating the situation is the fact that he's fallen in love with Nan and her 'daughter', Laney. The idea that he's preordained to die again on Christmas Eve is almost more than he can bear.This is a magnificent, heartwarming, heartbreaking story that had me laughing and crying, sometimes simultaneously. The characters are so well-drawn I keep hoping any or all of them will show up on my doorstep. The plot elements have kept me thinking about my own life, my own comfort zone, and how often I cast a blind eye on the circumstances of others.Ms. Anderson has written a love story featuring the personal redemption of a very bad man.We should all be so lucky.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kath68144",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2JZSCV4DTGJOUJBFBSPYCNEYJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19HVV83N2I8YK?ASIN=B00DYX9O4I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2014",
                "reviewTitle": "5.0 out of 5 stars Walking on Air, a Heart Warming story of Second Chances",
                "reviewText": "The storyline starts off as many with a gunslinger's death, but from that point on, everything changes! The Heavenly Angels intervene on Gabriel's behalf and offers him a second chance to change his lifestyle and to make a difference in others. However, when given the choices of who he wanted to change, he let his lustfulness make the decision for him and chose Nan, the dressmaker. As he works through the various scenarios with the Angels, he realizes that taking on an obvious spinster might just test him; but nevertheless, he takes on the challenge, while still remembering the boy he found under the staircase.Gabriel is given 30 days to turn Nan's world upside down, more or less, to allow her to see she can love again and find that special someone she wants to spend the rest of her life with. She has a \"daughter\" Laney, that she tries to protect. But Gabriel is given insight into Nan's and Laney's pasts, and immediately comes to the rescue. Her \"daughter\" is actually her sister and is attempting to stay hidden from their father and what Nan believes is a murder charge against her.The 30 days goes by faster than Gabriel thought possible, but because he had been shown future events that can change other's lives and he finds it so difficult not to get involved in order to make sure others don't suffer losses before Christmas; even though he believes that he is going against the Heavenly Hosts' original plan and will eventually be the end of his life for good this time.Gabriel is constantly reminded by Gabriel, the Angel, to \"follow your heart\". and as he does, his life becomes so much more better than he could ever imagine. The little Valance family grew from just Laney to include Christopher, the boy huddled underneath the staircase and even to a beautiful golden retriever the kids have named Jasper. One last piece is to include a bitter old man who has seen his wife and 8 beautiful children die from sickness a long time ago and who continues to live in the dilapidated family home.All in all, without giving too much of the book away, it was a cute story, providing gentle reminders that many of us could do well if we also followed our hearts/listened to our hearts.I can't wait to see what the next book will be like, since this is a Valance Family novel. I'm sure Catherine will ensure good reading as well and help us to believe in God and miracles.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan.W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT4RMARM47NOCIMBJQTCUWAOLIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AS4P7KUAPA3A?ASIN=B00DYX9O4I",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2014",
                "reviewTitle": "4.0 out of 5 stars First time with this author and I loved this book",
                "reviewText": "A must read! First time with this author and I loved this book.i loved the concept of this book. A cowboy that is a quick draw who loves his alcohol and women.my kind of cowboy. But someone just happens to want to make a name for himself and kills him..that's where this story gets good..he gets to the pearly gates and meets 2 angels who goes through his life (hilarious) then he gets 30 days to save his soul, back on earth to help someone else in need. Let's just say this book is really good and funny and also makes you think about your own life. Like would you help a stranger in need, or a starving animal or do what most people do look the other way.. this books was well written but not in a preachy way. Great job!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 14, 2020",
                "reviewTitle": "none",
                "reviewText": "It leaves plenty action to the imagination refreshing and amusing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Terry Mulder",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 24, 2021",
                "reviewTitle": "Second chance love",
                "reviewText": "A second chance historical western romance story with a few twists. He is a gunslinger and in the early hours of Christmas morning a gunfight ensured where he and his attacker both end up dead. He ends up in front of a couple of angels and is given a second chance at life but only for a month. For this to happen he is given a mission to sweep a particular woman off her feet, gain her trust, and convince her to believe in his love. He agrees with the request and is told that under no circumstances must he change any events that had happened within that month or interfere in anyone's lives. He marries her and along the way they fall in love with each other. He also changes the outcome of a few things but does it in a round about way to avoid the angels wraith. When the day finally arrives a Xmas gift saves him from death. HEA ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 20, 2014",
                "reviewTitle": "Another great read",
                "reviewText": "One of my favourite 'go to' authors. CA's story lines are always that bit different. This one is a bit daft but who can really object to the intention?Loved it, including the long epilogue - i do like a decent sized epilogue!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darima",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 10, 2014",
                "reviewTitle": "Mal wieder ein gutes",
                "reviewText": "Nachdem mir die letzten Bücher von dieser Lieblingsautorin gar nicht gefallen haben war dieses wieder mal ein toller Zeitvertreib. Mein neuer Favorit wird es zwar nicht, aber immerhin. Der einzige Punkt ist das Auftreten der Engel. Ich bin mir sicher, dass es eine andere Möglichkeit gegeben hätte.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 28, 2017",
                "reviewTitle": "Not my fave",
                "reviewText": "Love Catherine Anderson, but this one was difficult to get into.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}