{
    "remaining_requests": 2184,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Graham-Effect-Campus-Diaries/dp/1728283272",
    "body": {
        "name": "The Graham Effect (Campus Diaries, 1)",
        "price": "$9.90",
        "originalPrice": "$17.99",
        "rawPrice": 9.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Graham-Effect-Campus-Diaries/dp/1728283272",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71ydRtxIvgL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Elle Kennedy",
            "link": "https://www.amazon.com/Elle-Kennedy/e/B002WHBZOO/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 20755,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 20 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/Contemporary-Romance-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13354"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (October 31, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 496 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1728283272"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728283272"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1.24 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,614 in Books (See Top 100 in Books) #252 in Sports Romance (Books) #561 in New Adult & College Romance (Books) #1,670 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 20,755 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fac64388-e7bc-48b2-a295-d1033756e4d2.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a02243c4-1405-4cc6-84a8-1fee9ad648b2.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/232a5661-3e77-4f75-8450-8ab618b8f074.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sara J Reynolds",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMG2WZ7EY64MQ2VW7XQYP47RRUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SHKZ8W69E10C?ASIN=1728283272",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Next Gen Gold!",
                "reviewText": "I'll confess, I was hesitant to start this one, as I wasn't sure how I felt about a next generation of some of my all time favorite series (Off Campus & Briar U). That was crazy though, because Elle Kennedy delivers a fantastic story with high heat once again!I absolutely devoured Gigi & Ryder's story! I love how they were both so committed and dedicated to their teams & being the best that they could be & reaching for the highest goals! Plus them together, whether they were \"faking\" or not was intense & HOT!I think this one was more emotional that any of the first gen books, with Gigi wanting to make her father proud as well as have accomplishments that were her own, & Ryder dealing with his past trauma. I was an emotional mess the last 25-30% of this one.100% add to your TBR if you're a fan of Off Campus/Briar U or hockey romances in general!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabrielle (BookishandBallgowns)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF546KQLKJOC4EB7WKQROUDM6D6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3W4JAR94M0EOE?ASIN=1728283272",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Me? Obsessed with Gisele and the Prom King? Yes.",
                "reviewText": "I unabashedly love Elle Kennedy’s books. She’s writing for the feral little 20 year old inside of me and nearly 30 year old me is still living for it.Gigi Graham is destined for greatness. She has her sight set on joining the National Team so she can win Olympic Gold, but there’s one giant hurdle standing in her way: She’s struggling to handle the puck when she gets stuck behind the net, and the coaches have taken notice. Determined to overcome this set back she turns to the only person she can trust to give her honest feedback and up her game. He’s kind of a jerk, but there’s no denying that he’s an incredible hockey player.Ryder is navigating the merger of two rival hockey teams, his new position as co-captain, and a horrible first impression with THE Garrett Graham and he needs Gigi’s help. He’ll agree to teach her how to keep her cool under pressure behind the net, but only if she’ll do him a favor of his own. He’s aiming for a summer coaching job with her legendary father which seems impossible after they got off on the wrong foot. Now she’s the only one that can change her dad’s poor opinion of him.Normally next gen series are cringey because they feel like beating a dead horse but gosh dang, if this wasn’t the most fun way to continue the series. I love the direction Elle took with this! Making Gigi the hockey star was just chef’s kiss!!! It can feel so redundant when it’s a son falling in his fathers footsteps with just slightly different tropes, but this book was so different & UGH, THE GIRL POWER!!!!! Gigi is so hardworking and ambitious. And I love the way her character and Ryder were portrayed. Strong characters don’t have to be tough 100% of the time, and true strength is knowing when to lean on others.I laughed, I cried, and laughed again. This book had so much heart and I don’t know how to properly convey how cute it was. Gigi and Ryder are an excellent pair. They had such great banter and complement each other so well even when they’re being rude. I think the part of I loved most about this book was how things didn’t always work out for them. Instead, there was a healthy dose of reality. Things aren’t always going to be shiny and wonderful and seeing the way the characters handled those struggles was awesome. The characters in general were just so fun. There are a million new side characters that I want books for, and I hope Elle Kennedy delivers all of them.That’s not to say it was PERFECT. If we’re being completely honest here I lost the plot about mid way through. And when it finally wrapped up at the end I definitely had a moment of OH YEAH. That WAS the whole point of this book. But, I was still living for it. It’s was cute and fun, and made me smile. I cannot wait to see how the rest of the series unfolds. Consider me hooked!",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy A. Pasquale",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5T2FKG5WSOUAPR3IE6AMEF26AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EGEX0QP0B11C?ASIN=1728283272",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Wait till you get to the rest of the stories!!!!",
                "reviewText": "💖First of all, Elle Kennedy is a new author for me. I started with The Graham Effect – – and then I went down a gorgeous rabbit hole 🕳 reading all of her other works around Briar U. Suffice it to say, I disregarded all of my other potential reads in a week to read all of these other books. I loved every single one of them – – stories of Garrett, Dean, Logan, Hunter, Tucker, Conor (ughh, Conor ❤️‍🔥) all of them each and every one distinctly different, but so beautifully put together, and very very steamy! 🔥 Normally I don’t like to go backwards – – meaning GiGi and the Graham Effect is a result of parents in another book. But I didn’t know that going in. And it made no difference because I love the book so much I dove in to the other reads. And I am so glad I did. I will miss these characters and wish there was more to the Briar U series. Hoping that happens some day. Until then, I urge you to get your Graham on, the go down that rabbit 🐇 🕳 and enjoy hours and hours of delicious hockey 🏒 gods and their phenomenal women—Summer, Brenna, Rupi, Demi, Taylor & more! #GoBriarU🖤💛🖤",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBSHSJ3QTIVSDP4WBXNIEP2Q7QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROF778QIFBRC0?ASIN=1728283272",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars I loved, loved, loved everything about this book!!!!",
                "reviewText": "If I could give it 1000 stars, I would. I have been following the off-campus group since Elle first released The Deal in 2015. She is the queen of the hockey romance genre. All others come second. In my opinion, to fully appreciate this book, you MUST read at least the off-campus series. Garrett Graham is always my number 1 book boyfriend, and his relationship with Hannah has always just felt so honest and real to me in a way a lot of other series fall flat. When I'm in a book slump, my go-to is always The Deal. With that said, getting to see the next generation is such a gift. Gigi is a beautiful blend of Dad and Mom. Elle weaves the off-campus characters in so well that you find yourself excited to see them, but not overwhelmed by their presence. They truly add to Gigi's story and help to add to the back story and development of the overall plot. I love that Gigi ends up with a guy similar to her Dad...Garrett was alway so afraid of what kind of father he would be. Obviously, no worries there. Gigi stands out on her own though, and her relationship, coupled with the background and personality of Ryder, makes for a unique experience, while also weaving in some fantastic throwbacks to her own family history. The way Elle Kennedy constructed this was so masterful. It is a true testament to her talent as an author. She is the queen of mixing deep content, with spice, while throwing in just absolutely laugh out loud events and dialogue. When I tell you I cried from emotion AND laughter, I couldn't be more serious! It's everything I love about her writing and this fictional setting/family. Thank you Elle, for taking us back to Briar and Hastings. I can't wait to keep reading!!!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Julia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 28, 2024",
                "reviewTitle": "amei muito",
                "reviewText": "Um dos melhores casais da série - não poderia ser diferente já que amava os pais de Gigi! 5 estrelas!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2024",
                "reviewTitle": "Loved everything about Thai book! Gigi and Ryder are amazing",
                "reviewText": "Hands-down this is my favourite Elle Kennedy book I have read! To say I couldn’t put this down is an understatement. I haven’t stayed up as late reading as I did with this book in a very long time.I was instantly hooked and connected to both Gigi and Ryder from the prologue. I smiled and laughed so much while reading. The found family vibes between all the friends was amazing, it was such an wonderful collection of characters. Although the guys started out rough after Briar and Eastwood merged colleges, and men’s hockey teams, this really added to the character arc of Ryder in a beautiful way.Honestly, I have nothing bad to say about this story, Gigi or Ryder; I loved it all. The progression of their friendship and relationship was organic, addictive and beyond sweet. Let’s not forget the delicious tension and playful banter between these two. They did not lack in the spicy department and their chemistry was off the charts, and they had no problem showing that with one another.Gigi is hilarious, I enjoyed her inner thoughts so much. She is strong, fun, hardworking and determined. Ryder is quiet, stern, comes across his grumpy and closed off man is he so much more than meets the eye. What they both brought out of each other was real and the connection showed was easy to feel-there was support, care, understanding and no judgment ever, they truly made each other and their lives better. Not just with their respective hockey careers, but finding someone to trust with all the things they kept locked inside.There was even a couple fun twists in this read and I loved every second of it!It was so great getting to see a few of the ‘Off-Campus’ characters, especially Garrett and Hannah. The introduction of new characters leading into the next book, I am beyond excited to continue this series.5+",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leyendo Forever",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 5, 2023",
                "reviewTitle": "A must read! this universe is one of my faves",
                "reviewText": "4.25 ⭐️I absolutely ENJOYED this book. This universe is one of my favorites! Garret Graham and his family are everything I like, and updates about Jake Connelly are MY FAVE!Gigi was really funny and her dynamic with Ryder was entertaining, charming and adorable. I loved their connection, their story and felt pretty happy with everything that happened in their lives.I’m loving the new gen of Briar hockey players and I’m waiting for amazing stories with Beck, Shane, Colson and everyone else!Shipping Shane and Diana obvs! And would love to read a novella about Alex and Owen. I liked that.Also, Colson’s story is promising!It was a pleasure to come back to these family, and the new additions are perfect. 🩵🩷",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MARIJA M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 14, 2024",
                "reviewTitle": "J'aime le Hockey et J'aime les romances Parfait !",
                "reviewText": "Dans la lignée des autres tomes, c'est toujours un plaisir de lire cette autrice, j'ai adoré toute la série off campus et Briard ainsi que The Legacy qui est une suite de Off campus reprenant la suite des aventures des héros et héroïnes de la 1ère série. Alors qu'elle plaisir de découvrir ce tome avec la fille de Garrett et Wellsy. Les personnes sont tellement attachants, qu'on a du mal à les lâchers, je comprends le titre \"The Graham effect\", c'est sûrement ce couple qui m'a le plus touché ...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah Coggins",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 5, 2024",
                "reviewTitle": "Loved it!",
                "reviewText": "I read the off campus series quite a while ago and was just about to start the Briar U until I saw The Graham effect was being released, so decided to read this one instead. I really enjoyed all of the off campus books so was looking forward to this next generation spin off and it didn’t disappoint! Not only were the characters of Gigi and Ryder written well but I also got snippets of past characters and a whole new story on top, as well as a decent amount of smut. I loved how Ryder was so broody but caring too and throughout the story you really got to know why. Gigi was strong and full of sass and although neither one of them seemed to have the best first impression of each other, it was really nice to read how their relationship developed and grew. Several parts of this book made me laugh out loud, not only through the conversations between Gigi and Ryder but the side characters were so funny aswell and I can not wait to read the next in this series!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}