{
    "remaining_requests": 2164,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dirty-Talk-Lauren-Landish/dp/1983401048",
    "body": {
        "name": "Dirty Talk",
        "price": "$10.99",
        "originalPrice": "",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dirty-Talk-Lauren-Landish/dp/1983401048",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51GQ3xxVKlL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41heyYfptVL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lauren Landish",
            "link": "https://www.amazon.com/Lauren-Landish/e/B00SNT0Z0U/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 6802,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 18 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Women's Fiction",
                "link": "https://www.amazon.com/Womens-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=542654"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ CreateSpace Independent Publishing Platform (December 29, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 300 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1983401048"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1983401046"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 0.68 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#36,741 in Books (See Top 100 in Books) #2,726 in Billionaire Romance #3,855 in New Adult & College Romance (Books) #12,180 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 6,802 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCA57MJK2YONTUIRBYTHTKIP6EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4XUSQSDFM9YD?ASIN=1983401048",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Light and Dirty",
                "reviewText": "It's a light hearted read to help in relievimg everyday life stressors. The main characters are lovely. Plus points to all the dirty talking. I was quick to finish this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chrisda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYVWWYAHKK2VUARDZ2FUGE2DOAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R8H73XC7QZ6C?ASIN=1983401048",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 6, 2018",
                "reviewTitle": "4.0 out of 5 stars Fantastic Reads",
                "reviewText": "There are two (2) full stories and part of a third book that will have you dying to get your hands on the last book to read. Yes, they are all that good.Book 1: Dirty TalkDerrick the talk show host that goes by the name 'The Love Whisperer' is the type of guy every girl dreams of. That guy who knows is way around a females body in ways and means that will have any woman dripping wet and sobbing for more. Throw in decent and conscientious guy with a streak of machoism and a whole heap of dominance..... Oohhhh lalalalala.Then there is Katarina who is such a geek so involved in embedding codes and thinking and talking data resulting in really great apps. She has not been lucky in relationships to date. Her current boyfriend cheated on her and did it viral which she found out about mistakenly and was devastated at first. Then she called Derrick's show to talk a out it and got some really great advice from 'the love whisperer', who took a personal interest in her situation and requested a call back as to the results of her confrontation with her douche bag boyfriend.There interaction with each other was bit unorthodox and the reverse of dating but they are able to make it work for them. Kat has a lot of issues to work through due to unhealthy relationships previously but Derrick is showing her everyday that h eis definitely in it for the long haul.Book 2: MotorheadEvan is your dominant military guy, who served his country well, but return a semblance of himself with a few memories that would traumatized a sane man. His way of dealing with it is to avoid everyone, not make friends or allow anyone to get close to him, come off gruff and rude to others just to try and survive a normal and routine day. His bike helps to keep some of his sanity on those long rides when he needs to get away and clear his head.McKayla is tired of the Hollywood scene and she and her best friend Brad decided that a change of scenery in a quiet town away from the city is just what the doctor recommended. Right across from Evan and his brother's mechanic shop, they opened their beauty salon.The day Evan and McKayla met fireworks went off, very explosive. Instant antagonistic vibes that Evan started even though McKayla tried to diffuse it and Brad just stood and watch the fireworks go off. Right there and then something ignited between the two combatants, while Evan decides to avoid them, McKayla set her sights on Evan and started strategizing her battle plan to win him over. Oh, but they might be someone who decided that they are going to do everything to thwart them.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sherrejon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHORG455LCH6ALAQLB2YVEE77S7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FF8V1QAI6IAC?ASIN=1983401048",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2020",
                "reviewTitle": "5.0 out of 5 stars Get ready for your kindle to melt, because Derrick and Kitty Kat are 🔥🔥🔥",
                "reviewText": "Wow. What a dirty-talk book, in the most delicious way! I am mad at myself for barely reading a Lauren Landish book!Kat is a tech/nerd and is proud of it. Shes great at her job and wants to keep moving forward and up with it. She’s been in a relationship with Kevin for a while and hasn’t been touched by him in a long time. One day, her friend Elise is showing her an adult website and notices that Kevin’s private area is in full display, and the woman he’s with is not her. So she ends it, basically determined to never date again since the perfect man and happily-ever-afters don’t exist. Her previous relationships haven’t been the greatest either (she’s been cheated on one too many times now).Enter the Love Whisperer, aka Derrick. Derrick is a radio host and talks about adult topics. When Kat discovers Kevin’s infidelity, she calls in and vents to Derrick. He gives her advice and has her stay on the line after she gets off the air. They talk afterwards and he gives her his real number. He tells her to call him after she breaks up with Kevin so he can check in with her. But, when she does, things get hot and heavy quickly.I’ve never had my eyes bug out as fast as they did when I read how dirty their conversations got. I was glad I was in my room, alone, because I was blushing! I devoured EVERY. SINGLE. WORD! 🔥😅😋🥵. It was so good! No wonder Kat wondered if men like Derrick really existed cause, dayummmm, was he good! She gave back just as much but he listened to her needs and felt what was good for her and continued it. Woah- so good! This book is named Dirty Talk for a reason!The problem is that Kat doesn’t believe in love like she used to. Whereas Derrick is a man that wants serious relationships only. They need to communicate and talk through their problems. On top of that, we have Derrick’s co-host who keeps putting pressure on Derrick to take his job seriously.Such a good book! I’m definitely going to reread this one and one-click the rest of the series. Amazing!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Magellan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4G2FFJCQPJJ7FNHOME37YIDGNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VYAMXXO5H8HO?ASIN=1983401048",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2023",
                "reviewTitle": "3.0 out of 5 stars Hot!! But left wanting",
                "reviewText": "The Good: This book delivers in the title. All of the dirty talk and sex scenes were super HOT!! 🔥🔥🔥 Also, the beginning and ending was also really good. Finally, I really liked the friends/side characters.The Bad: (semi-spoilery) The actual character and story development left a lot to be desired. The place where both characters started in the book brought a lot of opportunity for growth and I was really excited to see how their relationship could stretch them in learning how to trust and rely on someone else. But unfortunately, I felt like the author chose to focus on the physical part of the relationship in replacement for the emotional connection. As a result, the story arc and character development never truly happens. Or more accurately, the reader never gets to experience it along with the characters. So much so, that we don't even get to see the reactions of when they first say, \"I love you\" to one another. What a bummer! We are told more of how they are in love rather getting to see how or why they fall in love. I could keep going on but I will stop here. Thoroughly disappointed that what could have been a great book was more meh...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Xox2read",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 29, 2017",
                "reviewTitle": "Deserves 10⭐️ - an amazing read",
                "reviewText": "I wish I could give Lauren more then 5⭐️ for this book - OMGOSH I loved it! This story is about Derrick and Katrina. Derrick, aka the Love Whisperer is at the radio station reviewing tonight's topic for his show - sex and relationship advice. Tonight he’s topic is: Cheating. Katrina just found out some upsetting news about her boyfriend, Kevin and calls into Derrick’s radio show for advice. Even though it’s only a verbal conversation, Derrick feels protective of Katrina immediately and not only wants to help but wants to know more about her. Kit starts listening to Derrick’s show and becomes infatuated with him. They finally exchange numbers and then decide to meet. They are both on opposite ends of the spectrum, Derrick is looking for his soulmate but Katrina believes if they hook up, it will be a one nighter. Kat has insecurities from her past which seem to show up whenever anything good happens in her life. They both come from completely opposite backgrounds, Derrick had a loving home, Kat had a broken one. This is an original story, I loved it from start to finish. Not to be missed out, and highly recommended. I voluntarily read an ARC but loved it so much I bought a copy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "julie dawson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 22, 2018",
                "reviewTitle": "What's Derricks phone number??",
                "reviewText": "Wow what another fantastic book by a great author Lauren Landish,it tells a story of Derrick( aka The Love Whisperer king)who has a phone in radio program who gives advice on love, relationships and all aspects of sex, single himself and happy to stay that way and Katrina(aka Kitty Kat or Kat) who phones in for advice after finding out her boyfriend has cheated on her, the chemistry between them is electric sending tingles down the phone line and there begins a very steamy sexy and oh so dirty love affair both on and off the phone, no spoilers here.Derrick and Kat's life soon become entwined which was unusual as they both had trust issues.Can they both have a happy ever after? Is someone not as they appear to be? Get the book you will not be disappointed. I was given this as an ARC via Hidden Gems in exchange for an voluntary honest review.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nastassja Swan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 17, 2021",
                "reviewTitle": "Flawless",
                "reviewText": "This book is amazing. I can’t give it enough praise. It was funny, smooth, lovely, sexy, spicy and flowed amazingly. I am so excited to read more from this author!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cookie Munchkin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 13, 2018",
                "reviewTitle": "Talk Dirty To Me :)",
                "reviewText": "If you like a dirty talking man then I cannot recommend this book more. This book draws you in from the start and I for one couldn’t out it down.Kat is out celebrating her new promotion with her best friend when she discovers that he boyfriend of a year has been cheating on her. In her heart of hearts she knows that she needs to dump Kevin but calls in to “The Love Whisperer” who just confirms that she is doing the right thing. They connect straight away and Derrick gives her his personal number to call if she needs to talk anymore. Kat follows his advice and calls to update him and that’s when things heat up.Derrick is a popular DJ and his love show is taking off and getting bigger every day. He’s flirty and there is something about Kat that draws him in from the start and he feels that there is something special there. Derrick believes in love but he can tell that Kat has been hurt by men before and he knows he will have to go slowly to get her to open up to the possibility that this is going somewhere. But as always there is always someone hanging in the background to make things difficult.This is one hot little number that’s fast paced and will get you hot under the collar.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mel McC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 10, 2022",
                "reviewTitle": "Chemistry and the fairytale",
                "reviewText": "Loved reading this book. Flowed seemlessly, with plenty of fun banter and the chemistry between these two was off the chart. Fantastic!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}