{
    "remaining_requests": 2257,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/My-Beastly-Duke-Historical-Regency-ebook/dp/B0CTXBXJRJ",
    "body": {
        "name": "My Beastly Duke: A Historical Regency Romance Novel (Dashing Rogues Book 3)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/My-Beastly-Duke-Historical-Regency-ebook/dp/B0CTXBXJRJ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81DLc+igI-L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sally Vixen",
            "link": "https://www.amazon.com/Sally-Vixen/e/B09XKD9PV4/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 103,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CTXBXJRJ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Cobalt Fairy LLC (February 2, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 2, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4136 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 453 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,928 in Kindle Store (See Top 100 in Kindle Store) #6 in Historical Regency Fiction #8 in Historical British & Irish Literature #16 in Victorian Historical Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 103 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/2ccc752e-0fb8-460e-bd78-7252de8df835.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/1dfa3257-0f92-4611-8a7a-88098520bdda.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sarah Marcum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBF55RY3NK7GWVUOEAAE5Z35QZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GXXQWEVE0FR3?ASIN=B0CTXBXJRJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Fun and romantic read",
                "reviewText": "So I have recently found Sally Vixen as an author and I have been binge reading her books like crazy. So with that in mind here is my review.I really like this book. Although I did find some similarities between some of her other works, it was a good read. All of her books feature a strong female lead and Mary is no different. She is observant in the two novels before this one, and her character stays true to the character presented in the other books. I enjoyed reading Mary’s point of view, but at some points it felt a bit like it was repeating itself.Edmund is a new character that is presented and he is a strong and haunted character. While I enjoyed reading Mary’s point of view, I loved reading Edmund’s. He was a very thoughtful character and a lot of times just what he was thinking was interesting because it defined him and gave the reader a different view of this stoic Duke.This story line was a fun read in its entirety and I had trouble putting it down. I loved the way they met and I loved following the evolution of their relationship and eventual happily ever after. The spicy bits also lend themselves to furthering the story line and never feel like it’s being used as filler.Overall I would definitely recommend this book and this author. I loved this book and I will continue to read all her books!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JayP.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIGY7JEWTKGZJOZME7BAWOBOQKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P1I28VPYJ8B5?ASIN=B0CTXBXJRJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Devastation caused by malicious rumours",
                "reviewText": "Lady Mary is desperate to avoid being courted by the Marquess of Repington, a man almost old enough to be her father, and who makes her feel uncomfortable, so she invents a betrothal to the Duke of Huxley, never expecting to be forced to write a letter to him. Her ruse ends with her marrying the Duke, a man who sees himself as a beast after having been a soldier for many years and who feels responsible for his older brother's death, albeit indirectly. He offers Mary a marriage of convenience, promising her that he will never force her to do anything she does not wish to do and that she will also have the freedom to do as she wishes He feels that she will help him to regain his place in society, thus helping him to find out who spread the rumour that he was dead.Edmund is a lovely man even though he feels he is a beast, and Mary brings light into his life, but he fears that he will somehow destroy her if he allows her to get to close to him.I enjoyed the interactions between Mary and Edmund, especially the conditions she insists upon in her marriage, but do not understand why everyone but Mary and her friends seems to view the Duke as a beast. Yes, he has scars on his body and wears an eye patch as he has lost one eye, but the Ton cannot see the scars that are beneath his clothing, and Mary describes him as \"the most stunning man she had ever seen\". I accept that the Ton was very superficial and judgemental, but I cannot see why Edmund elicits the reactions he does.I really enjoyed reading the story and loved both the main characters and Mary's family and friends, and I think that this is my favourite of the series so far.My one complaint is that every so often modern day words or phrases appear and this irritates me a little. Not enough to make me want to stop reading, but it does jolt me out of the story occasionally, hence the 4 stars.I received an ARC and this is my honest and unbiased opinion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BBumbolow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJJOHIAI3G4UULSDJT7LDGRX4VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE4KBHR7DNR86?ASIN=B0CTXBXJRJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars A Man Who Is Not. Beast",
                "reviewText": "Edmund had suffered in the war but came home once he learned his older brother had died in a shipwreck while searching for him. Edmund held himself as well as the person who started a rumor that he had passed in the war which was the reason why his brother was on that boat that went down. Mary was shocked when the man who was old enough to be her father said he was going to ask her father for permission to court her. Panicked she told him that she was already betrothed to the Duke of Huxley not realizing that the newly titled Edmund was actually back in town. Thinking he did need a wife to help him reemerge back into society Edmund shocked Mary when he went to her father and announced their engagement and not only that proposed a marriage in three weeks time. The story is quite delightful and the back and forth between the war hardened Edmund and the feisty and tiny Mary is amusing and enjoyable. We do have our enemy and the thwarting of evil but that only reinforces that the live that has grown between them is real.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. V.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETXK5TIREK2IFI3DEU3PNISARIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROG0XDMIQB76H?ASIN=B0CTXBXJRJ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "3.0 out of 5 stars Okay not as good as the Julia's story",
                "reviewText": "This is Julia's sister Marys story. Mary is often overlooked as the bookish wallflower, because of her sister whose personality is bold and vibrant. To avoid a disastrous arranged marriage, she concorts and engagement with the Duke of Huxley, only to have him appear and propose a marriage of convinience.They are both attracted to each other, but Huxley aka Edmund has to work through some emotional scarring from loosing his brother and war.What starts out as convinience slowly morphs into more, with the attraction growing beyond the physical to that of character as well.Overall this book was okay, sometimes a little slow. I am also not fond of the italic thoughts on the page. I think perceptions and feelings can be written differently not as italics as it gets repetitive and does not seem to always add value to the narrative",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2RDJSGZIN6JDNHLNXCYJAHX23Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQCEHAW2SZ9BY?ASIN=B0CTXBXJRJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Sweet read",
                "reviewText": "Another well written story by this author. This is book three ti the series, you can read alone or as a standalone. Full of love, steam, romance, intrigue, a marriage of convenience, twists and turns. Has a great storyline/plot. The characters are bad or good, strong or weak, heroes or villains. Mary and Edmund have issues they both will have to work on. Mary invents a fake relationship with Edmund so that she isn't pushed into a marriage that she doesn't want. Edmund is a scarred man from a war who finds it easier to hide then reface the ton. He shows up and talks her into his offer of marriage. After the marriage , both develop feelings for each other. Glad the get their happily ever after.I am an ARC and leave this unbiased, honest review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marion L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 12, 2024",
                "reviewTitle": "Nice Story",
                "reviewText": "I liked the book. The story is well told, with very likable characters, some steamy love scenes and a touch of suspense. I enjoyed meeting the characters from the previous books in the series again.Unlike her older sister, Mary is known to be levelheaded and a wallflower, until an unwanted suitor proposes to her and she invents a relationship with the missing Duke Edward, who was thought to be dead. Except that he is very much alive.Edward has returned from the war wounded but alive and is searching for the person who spread rumours of his death and thus unintentionally caused his brother's death.When he learns of Mary's deception, he offers her a marriage of convenience. He needs her dowry and help in society and she is free to determine her own life. But he cannot and will not give her love...If you like heartwarming romances with a marriage of convenience theme, recluse heroes, compassionate heroines, steam and a touch of suspense, you will enjoy this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D Henderson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 6, 2024",
                "reviewTitle": "Steamy but Good",
                "reviewText": "I enjoyed this well-written story. After the death of his brother, Edmund had an unexpected elevation to a Dukedom. He was battle scarred and did not enjoy society events. Lady Mary was considered to be a wallflower. When Lord Repington tells her is going to speak to her father and ask for her hand, she tells him she is already bethrothed to Duke Edmund. No-one has seen Edmund and it was assumed he was dead. She writes a letter to the 'ghost' Duke assuming that he was not in the house. She pretends they are bethrothed. However, the letter is found and Edmind realises that he could marry Mary and that would mean he would not need to go into society much. They marry and at first they have a rocky relationship. Mary is determined to change Edmund for the better and works hard to get him to socialise. Someone else is trying to ruin their marriage and there is danger before all is safely settled. An enjoyable, steamy read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 11, 2024",
                "reviewTitle": "Mary and Edmund",
                "reviewText": "I Loved both characters. Mary complements Edmund. He’s broken from the war and she’s a wallflower. She brought the best out of him and he couldn’t help but fall in love with her. Beautiful story and worth a read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paula",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 6, 2024",
                "reviewTitle": "Hot and steamy",
                "reviewText": "This is a recency story at its best Edmund is scared from the war and has become Duke by default where as Mary is scared of being forced into a marriage she does not want. Fate steps in and they have an arranged marriage that turns into a love match. This is the third daughter of the Earl of Powell to have a marriage turn into a love match",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}