{
    "remaining_requests": 2016,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Misty-Hollow-Massacre-Discovery-Novel-ebook/dp/B0BVY5LNR5",
    "body": {
        "name": "Misty Hollow Massacre (A Discovery Bay Novel Book 1)",
        "price": "$4.99",
        "originalPrice": "",
        "rawPrice": 4.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Misty-Hollow-Massacre-Discovery-Novel-ebook/dp/B0BVY5LNR5",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91AJ3T-s25L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Carol Ericson",
            "link": "https://www.amazon.com/Carol-Ericson/e/B001KC6B5K/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 59,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Working as a team Can they stop a killer targeting their hometown? Child psychologist Hannah Maddox’s father once helped send the man she loved to prison. Now Jed Swain is free and back on Dead Falls Island to clear his name. Until his accuser is murdered and Jed again becomes the prime suspect. Hannah knows Jed is innocent, and before long, so do the locals. But when another single mother is found dead, Hannah must convince Jed to trust her before a killer turns their focus on them.From Harlequin Intrigue: Seek thrills. Solve crimes. Justice served.Discover more action-packed stories in the Discovery Bay series. All books are stand-alone with uplifting endings but were published in the following order: Book 1: Misty Hollow MassacreBook 2: Point of Disappearance Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BVY5LNR5"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Harlequin Intrigue (November 28, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 28, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2002 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 219 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#112,219 in Kindle Store (See Top 100 in Kindle Store) #159 in Police Romance eBooks #414 in Police Romance #561 in Small Town Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 59 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Rosemary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT6E2TAOIYXP4LIHG6L5MLUPSDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PD7XUHF90LEI?ASIN=B0BVY5LNR5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Will the Truth Be Revealed",
                "reviewText": "Hannah never believed that the man she loved was guilty. Now Jed is back. He was exonerated. He wants to clear his name, but now his accuser has been murdered? There is no escape. I admire Hannah. She faced the fact that her father the Sheriff framed the man she loved. What an impossible situation. Jed is battered but determined to find why his life was destroyed. These two make a powerful team. I was shocked to see where the trail lead. Carol Ericson certainly kept me guessing. This is a powerful story with unexpected consequences. As Hannah and Jed investigate they find that a cold case holds the answers. The unknown killer wants to stop them. Will Hannah be his next victim? This plot is full of twists, and the characters and the murders take center stage. I was hooked. I couldn't stop reading until I knew the truth.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan Frank",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM7JJRH2NRF6EINCZ5XC7BBEJCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQUC5OP5W63CK?ASIN=B0BVY5LNR5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Second chances",
                "reviewText": "Terrific start to a new series, with a gripping mystery and a second chance romance. The story opens as Hannah, a forensic psychologist, is working with a small boy whose mother was murdered. Complicating matters, the dead woman once accused Hannah's high school boyfriend of rape, sending him to prison. Jed has since been exonerated and is back on the island but is once again a prime suspect.I liked that Hannah never believed Jed was guilty, but her sheriff father disapproved of their relationship and did everything possible to break them up. Things are a bit tense between Hannah and Jed when they first meet again, thanks to confusion about letters never received. When a second single mother is murdered, Jed gets a request from his friend, the woman's brother, to investigate. Because Jed has a private investigator's license, he doesn't have to play by the same rules as law enforcement. This includes inviting Hannah to work with him on the investigation.The suspense of this story had me hooked from the beginning. I felt Jed and Hannah's frustration as their initial leads seemed to hit dead ends. They didn't let that stop them, and before long, they started to connect the dots between seemingly unrelated clues. One lead sent them to a deserted house that had been the site of a horrific murder-suicide. Their belief in its importance was confirmed when someone tried to kill them. I was glued to the pages as they closed in on the identity of the killer. The final confrontation was a nail-biter with a reveal that I never expected.I enjoyed seeing the rekindling of the relationship between Hannah and Jed. They have a few trust issues to overcome in the beginning, not the least of which is her father's role in Jed's conviction. But Hannah's unwavering belief in Jed's innocence goes a long way toward solving that problem. Working together brings them closer, and the old sparks of attraction quickly reignite. I loved Jed's protectiveness when Hannah was targeted. I also liked that no last-minute misunderstanding drove them apart, just Jed rescuing her from a killer. I liked the ending and seeing them plan a future together.Tate and his sister, Astrid, were excellent secondary characters. I liked their belief in Jed and their willingness to help him get his life back on track. Tate is a forest ranger who is helping Jed join the rangers and giving him a place to live until he finishes repairing his old home. Astrid is a single mom with a little boy. She has matchmaking tendencies and enjoys throwing Hannah and Jed together whenever possible. There is a heart-stopping scene where young Olly disappears, and the circumstances are suspicious. The next book in the series is Tate's story, and I can't wait to read it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robin Daily",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZNSPOXFLWVC5QATBSQXLIFZSQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17VRODME8VLKD?ASIN=B0BVY5LNR5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Entertaining book",
                "reviewText": "This was an entertaining, well-written book. It was suspenseful, sweet and kept me reading. This book is a standalone story and the first in the Discovery Bay Novel series. I enjoyed this book and look forward to reading more books in this series as well as others by this author.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RJ McKay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFROV3N6E5WVWXGR7AW5NW5A2FLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPXEU4Z2RHLG6?ASIN=B0BVY5LNR5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars A tense plot",
                "reviewText": "There is someone lurking in the shadows. Someone who is killing young mothers. But why? Fingers first point toward Jed Swain, an exonerated con who has returned to his home town on Dead Falls Island. Some have always believed in his innocents including Hannan Maddox. They were friends once. They might have been more. But Jed was accused of a crime and sent to prison. And it was Hannah’s father, Sherriff Maddox who provided all the evidence. But I it isn’t Jed, then who? Jed is trying to figure it out. And Hannah is helping. As a Child Psychologist she has access to information that might help, as well as her father’s old records. But as she searches her father’s old files for clues, she stumbles across his information on Jed Swain’s case. And she learns just how far her father was willing to go to keep her and Jed apart. This new series began with a tense plot and characters that captured my attention. From the very beginning I felt pulled into the story. I believe this is the best of Carol Ericson’s books I’ve read. I am looking forward to her next story in the Discovery Bay series.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "April B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEY63MO5FO5VLPKAN3QF5N65UG2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NLOZS2YXSQP5?ASIN=B0BVY5LNR5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Captured my attention from page one!",
                "reviewText": "Thank you Netgalley and Carol Ericson for the opportunity to read the eARC of Misty Hollow Massacre!This book is one of the best Harlequin novels I have read! This book has a unique setup with Hannah's father having a hand in sending her love to prison! What a tough thing to live with! Once Jed is free, instead of moving on with his life with a fresh start, he goes right back to his hometown determined to clear his name. Things fall apart when his accuser dies, the town turns on him again before it becomes clear Jed is obviously innocent. Hannah and Jed team up to find a murderer but the killer has other plans.The dynamic between Hannah and Jed was a Rollercoaster, Hannah had a lot to make up for because of the actions of her Father and years built of broken trust. The chemistry still crackles between them despite it all!I was blown away with this book, this is book 1 in a discovery bay series and this book makes an excellent beginning with not only tough and fascinating main characters but side characters that I can easily see in a book of their own!I will post my review on Netgalley, Amazon and Goodreads",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Big Jude",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2MSPCAZYLED4OVF4D2UIJZBN6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T1VW90DF6XXA?ASIN=B0BVY5LNR5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars There is a serial killer!",
                "reviewText": "First, I love the name of the community: Dead Falls Island!A bad murder to start with. Does the son know anything?Poor Jed!!Who is Stephanie and what was she into??I hope Jed and Hannah's sparks fly into something more. I think Jed deserves it!Zoey, a secret hiding place, where was it and what is in it?? Keldorf property, WOW!!What is up with Olly? Mysterious Dr. Robbins, is he in the mix? or Nate Keldorf? Who or what is AD?Will Alyssa spill the beans or the soup?To find the answers, you will have to read the book! It is well worth it!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}