{
    "remaining_requests": 2243,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Daughter-Moon-Goddess-Sue-Lynn-ebook/dp/B09292T7S9",
    "body": {
        "name": "Daughter of the Moon Goddess: A Fantasy Romance Novel (Celestial Kingdom Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Daughter-Moon-Goddess-Sue-Lynn-ebook/dp/B09292T7S9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91ajnKgqYxL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sue Lynn Tan",
            "link": "https://www.amazon.com/Sue-Lynn-Tan/e/B095B4HTQF/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 5660,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The acclaimed national and international bestseller“Epic, romantic, and enthralling from start to finish.”—Stephanie Garber, #1 New York Times bestselling author of the Caraval series“An all-consuming work of literary fantasy that is breathtaking both for its beauty and its suspense.\"—BookPage, starred reviewA captivating and romantic debut epic fantasy inspired by the legend of the Chinese moon goddess, Chang’e, in which a young woman’s quest to free her mother pits her against the most powerful immortal in the realm.Growing up on the moon, Xingyin is accustomed to solitude, unaware that she is being hidden from the feared Celestial Emperor who exiled her mother for stealing his elixir of immortality. But when Xingyin’s magic flares and her existence is discovered, she is forced to flee her home, leaving her mother behind.Alone, powerless, and afraid, she makes her way to the Celestial Kingdom, a land of wonder and secrets. Disguising her identity, she seizes an opportunity to learn alongside the emperor’s son, mastering archery and magic, even as passion flames between her and the prince.To save her mother, Xingyin embarks on a perilous quest, confronting legendary creatures and vicious enemies. But when treachery looms and forbidden magic threatens the kingdom, she must challenge the ruthless Celestial Emperor for her dream—striking a dangerous bargain in which she is torn between losing all she loves or plunging the realm into chaos.Daughter of the Moon Goddess begins an enchanting duology which weaves ancient Chinese mythology into a sweeping adventure of immortals and magic, of loss and sacrifice—where love vies with honor, dreams are fraught with betrayal, and hope emerges triumphant. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09292T7S9"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Harper Voyager (January 11, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 11, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5571 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 507 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,906 in Kindle Store (See Top 100 in Kindle Store) #5 in Teen & Young Adult Coming of Age Fantasy eBooks #13 in Cultural Heritage Fiction #27 in Coming of Age Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 5,660 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Daughter of the Moon Goddess Heart of the Sun Warrior Tales of the Celestial Kingdom Discover the Immortal Realm Book 1 in the Celestial Kingdom duology Book 2 in the Celestial Kingdom duology A collection of stories set before, during, and after the duology",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/27f1deeb-e6ca-4718-9b3e-43afd4a28d74.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/33c77d88-5f91-4c91-85f1-fb24de8f8731.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e6e0f63d-7130-4d63-a9b5-caf3af08cd35.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/16f67e4d-26ab-44ba-925d-463c73216559.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/48f7dfa9-2443-4d60-a126-e61f8c8a612c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/35364bfd-0617-416b-bd86-02a6784ffaf8.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/faeaa2fb-efe1-4150-9cc1-c425c128485d.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "amanda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7SUXLVDROQPN6MVHGFJF7IXRVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31ZVZHHDB9W7N?ASIN=B09292T7S9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars endearing",
                "reviewText": "i'm not sure why it took me so long to read this. While there's things i dislike (the love triangle especially), i enjoyed it so much overall. It's one of those stories where the romance is integral, but doesn't take center stage and becomes the only thing the characters care about.From the moment Liwei enters the page, i liked him a lot. It's refreshing to find characters that just get along and eventually fall in love, but having their own dreams/goals separate from their love interest. I was suspicious of the second love interest from the start, but somewhere along the line forgot why i was suspicious. But the plot twist did somehow make it a complex subplot that i didn't mind so much.I still wanted Xingyin to end up with Liwei, and i hate the emperor and empress. At the same time, i'm a little sad for Fengmei because she was a sweet character who was meant to fulfil a role and make the best of her situation.Also liked that there was genuine friendships between female characters, which is becoming more rare in fantasy and romance and romantasies especially.I got a little frustrated at the start with the info-dump-ish-ness (totally a word, probably). But i understand why it kind of has to happen, familiarizing a broader audience with the source material. And the prose from Xingyin's perspective gives a much needed sentimental/gentle tone in stark contrast to a lot of the sass and bitterness of many FMCs in the genre -- something i really enjoyed when reading! The prose really did feel fresh among its peers.I actually didn't know this was a debut novel, because it reads like the author had 2 (maybe 3) books under her belt.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXYTXZTJXY3F7F3S5PHAZ6BW2PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8OUB43020R1N?ASIN=B09292T7S9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2022",
                "reviewTitle": "4.0 out of 5 stars I really loved this",
                "reviewText": "Content warnings: girl-on-girl hateRep: secret identities, Chinese mythology, friends-ish to lovers, lovers to enemies, love triangle, forbidden love, Mother/Daughter love/bondThoughtsNeutral thoughts:The writing: In the very beginning of the book, the writing starts off very simple & I didn’t mind that cause I think that it helps represent how Xingyin is in the very beginning of the story. And while it still stays pretty simple, I still thought that it was good & just needed some work with the pacing. But because this is a debut, I am more forgiving when it comes to pacing or more simpler writing.Xingyin: I liked her overall. I though that she was VERY naive in the beginning, and still through the events of the book, but I think that reflects the pureness of her ideals and her unwavering loyalty and her morals. She was just trying her best in order to set her mother free & finding herself and herself worth in the process & I could admire that about her.This honestly is a SOLID debut & I highly recommend! I am not entirely sure where the second book in this duology is going to cover, but I am excited nonetheless!Pros:I really liked the lore in this one and how the Gods and Goddess were actual figures in this world, not just beings that were written about in ancient texts and stories that are told in the present timeline. How the Moon Goddess did things & how they were represented in our mortal world.Some of the lines in this were absolutely beautiful. Like I literally had to stop and take the lines in & just are at them for a second.The chapters in this were short & I honestly was flying thru this book like no other. One second I was on page 56, and the next things I knew I was on page 210 without even realizing it. So while the pacing was a little off in some instances, I was still flying thru the pages.I also liked seeing the Mother/Daughter bond in this. I also have a strong relationship with my mom & it was really nice seeing the love that these two had for each other & seeing all of the sacrifices and actions that they did for one another because of the love that they had.Gripes:As I sit here and write this review I can’t think of any PRESSING issues (aside from the pacing) & the only thing I wasn’t a fan of for the most part was the love triangle that bloomed in this. And while it wasn't THAT bad, it is still a triangle nonetheless & I am NOT a fan of them.The romance(s):There is a love triangle in this 🙈 I know for this is a “buzz word” but for me it is not one at all. And while there is an inkling who Xingyin will be with at the very end of this duology based off what happened at the end of the book, I can see there being a “will they won’t they” and Xingyin going between Liwei and a certain General 😉(if you wanna know his name, by all means look at the spoiler (view spoiler)) in the next book. And while that ANNOYS me, I am hopeful for my boy Liwei 😭Xingyin & Liwei: I REALLY liked them. Could they be described as insta-lovey? Perhaps. But I still liked them. First and foremost they saw themselves as friends, as two people who felt like they were lacking in themselves and the positions/roles that were forced into & just wanted a friend that they could lean on. And that is what I liked about them. It was not an instant physical attraction that they had for one another, it was an emotional bond that they formed first before looks came in to the equation. But lemme tell you, this gets angsty real fast 😹🙈 There is some heartache and some circumstances that separate these two from one another, but they may or may not reform their relationship at the end of the book… AND ALL I CAN SAY IS THAT I BETTER SEE A MARRIAGE CEREMONY AT THE END OF BOOK 2For those who don’t know, Liwei is the Prince of the Celestial Kingdom. I REALLY liked him 😹 HE WAS SUCH A CINNAMON ROLL 🥺 While he did kind of get on my nerves on some things, he was also just trying to do his best & having to make choices that he didn’t want to make, but he had to. But he thankfully pull his head out of his butt towards the end of the story & I was swooning all over again.Xingyin & the other guy 😹: While I understood the blooming of their friendship/relationship, (I even kind of rooted for them at one point) I just do not support them. (When you read the book you’ll know why). But I can totally see people falling in love with him and their relationship.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaitlyn Van Kampen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AET35EYGFKEK5BVYODZDSA4DXOUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PX85UI60ASXA?ASIN=B09292T7S9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars READ THIS NOW",
                "reviewText": "Daughter of the Moon Goddess is the debut novel from Sue Lynn Tan and all I can say is WOW. This book was stunning and is one of my favorite books I’ve ever read. From the start, we are captivated by the story and characters and Tan takes you on an amazing journey over the next 500 pages.To begin, the characters are fascinating. I listened to it on audiobook which was really helpful for the pronunciation of names for me, as the story is based of Chinese mythology. Xingyin is the daughter of the Moon Goddess Chang'e, and is such a great FMC. She goes through a coming of age story in this book, starting with leaving her home and her mother and following her on an epic journey over different lands and through many adventures. I loved how we saw her grow and change and while this is a YA novel, I never felt like she was overly young or immature. There are a few times that her internal monologue gets repetitive, which is why I’m taking away a partial star, but otherwise I loved the writing of the character. There is a love triangle (square?) between her and two male characters, but I thought it was done well and was actually a very mature handling of it.The plot and imagery within this book was phenomenal. This is the second series I’ve read this year that is Chinese mythology inspired and both were given such rich description, it makes me want to travel there! The book is rather long, at just over 500 pages, but the pacing is done really well and the plot is complex and developed without ever dragging or becoming confusing. It moves through the different events in a well thought out manner and kept me intrigued the entire time! There is action and some romance (it is YA so this is light romance), and a great story of friendship.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Natalia Ramirez Gil - Natanimon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBX2TBSCN3T2PJ575DHDMQZ55SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WX4CJWA91POI?ASIN=B09292T7S9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Magical",
                "reviewText": "If I could only choose one word to describe this novel, I would say it was magical. Magical in its narration, its mythology, and its locations. The characters were brilliant and had such significant development throughout the story that kept me reading non-stop. I devoured this book in a couple of hours.If you feel like reading something related to Chinese mythology, this should be your first option. I can't talk enough about the greatness of this story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paloma SilvaPaloma Silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 19, 2024",
                "reviewTitle": "Edição linda!",
                "reviewText": "Livro é lindo. Mas vale a pena comprar a edição em português, a capa também é perfeita. Comprei essa edição pq amo ter várias edições de livros que adoro. 💖",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71nGey9pyFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 5, 2023",
                "reviewTitle": "Absolutely amazing book",
                "reviewText": "I bought this book to get back into reading after like 8yrs of not reading omg I can't stop reading I'm so excited to start the next book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Uriel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 30, 2023",
                "reviewTitle": "Una gran y fantástica historia",
                "reviewText": "Un gran libro que esperé leerlo y no me descepcionó, es una gran aventura la que emprende la prota y te cuenta sobre la mitología china desde su perspectiva y todo lo que ha atravesado y enfrentado pir volver a ver a su madre",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "-AAhmad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 30, 2024",
                "reviewTitle": "Loved the world building and was engrossed throughout!",
                "reviewText": "Really enjoyed this book, which I'm glad about, because not only have I been on a romantasy kick recently but I also brought the special edition companion to the duet from Fairyloot due to the cover being pretty lool. And so, I wanted to see if I actually liked the books before trying to source the special editions for this book and the second book.This plot seemed to be focused around a lot of old Chinese myths and legends - I saw somewhere that it was a reimagined telling? - but I liked how it dipped into the Chinese culture and stories as it reminded me of Mulan and another show I used to watch called W.I.T.C.H. which also had a storyline about 'The Four Dragons.'I really liked the backstory for this. The world building was great, and although this was a very long book, at no point did I get bored. I think fantasy books do have more scope to develop their world building and can get away with being longer, but I still like when it doesn't feel too lengthy, instead drawing me in and making the world more imaginable.Whilst I do feel like some of the fighting scenes felt a little rushed and there could've been more detail in the action, I didn't really mind it too much because all the other scenes were very detailed. Likewise, this had less romance than I'm used to, but it ran as a nice secondary plot and I liked that the focus wasn't solely about that. Although, the love triangle situation did have me going back and forth as to who I was rooting for and the decisions that were made!The FMC had a good story arc too. We initially see her as being talented but quite sheltered and unaware of her true strengths. We gradually get to witness her transformation into becoming more open in certain aspects and branching out without becoming overly cocky.Was very much looking forward to the second part of this duet as imo, this technically could've worked as a standalone with the way it ended. However, I would like to know more about certain issues that occurred and I'm glad it is a duet as it makes it more realistic that other issues would crop up later down the line, rather than just having a bittersweet ending and no further details.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carla",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 1, 2023",
                "reviewTitle": "Bellissimo",
                "reviewText": "L'ho quasi finito e sono rimasta stupita dai continui colpi di scena. All' inizio sembrava solo un libro fantasy che riprende una parte di mitologia,ma si rivela essere molto più di questo 😍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}