{
    "remaining_requests": 2106,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Love-Redesigned-Lakefront-Billionaires-1/dp/1728292131",
    "body": {
        "name": "Love Redesigned (Lakefront Billionaires, 1)",
        "price": "$10.87 $9.35",
        "originalPrice": "$17.99",
        "rawPrice": 10.87,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Love-Redesigned-Lakefront-Billionaires-1/dp/1728292131",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/A1GqbH4RpyL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lauren Asher",
            "link": "https://www.amazon.com/Lauren-Asher/e/B08191LLQJ/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 11425,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Plagued with an overactive imagination, New York Times bestselling author Lauren spends her free time reading and writing. Her dream is to travel to all the places she writes about. She enjoys writing about flawed yet relatable characters you can’t help loving. She likes sharing fast-paced stories with angst, steam, and the emotional spectrum.Her extra-curricular activities include watching YouTube, binging old episodes of Parks and Rec, and searching Yelp for new restaurants before choosing her trusted favorite. She works best after her morning coffee and will never deny a nap."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 4 hrs 56 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 11 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 16 hrs 11 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "JulianIf I ever caught on fire, Dahlia Muñoz would fan the flames with a smile.So, when she returns to Lake Wisteria, I fully intend to avoid the interior designer.At least until my meddling mother exploits my savior complex.The faster I help Dahlia find her creative spark, the sooner she will leave town.But while I was busy getting rid of Dahlia, I overlooked one potential issue.What happens if I want her to stay?DahliaPeople say the devil has many faces, but I know only one.Julian Lopez―my childhood rival and family frenemy.I vow to steer clear of him while recovering from my broken engagement, but then the billionaire makes an irresistible offer.Renovate a historic house together and triple our profits.Our temporary truce becomes compromised as we face years' worth of denied attraction and mixed emotions.Giving into our desire is inevitable…but falling in love?That isn't part of the plan.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/Contemporary-Romance-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13354"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (November 7, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 528 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1728292131"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728292137"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 3.53 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 1.32 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,160 in Books (See Top 100 in Books) #367 in Billionaire Romance #481 in New Adult & College Romance (Books) #1,424 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 11,425 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ana Pineda-Gonzalez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHXIWZUQS2MDOYLQ27TL2UMLSPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GL80OEI8I6TU?ASIN=1728292131",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "5.0 out of 5 stars BEST BOOK OF 2023",
                "reviewText": "ARC ReviewI swear I feel like it's been so long since I've read a book by Lauren Asher and now that I've read Love Redesigned, I feel so content with my life right now. Coming back to her world of new billionaires has me so excited since just with the first book, there was so many great characters. From Julian and Dahlia, I can't even express how much I love them and, honestly, they might be my favorite Lauren Asher couple. Also, the side characters, OMG, I simply can't wait for the next books of this series since I just know that the couples are going to be mind blowingly phenomenal. I kind of have a feeling about who will be the other couples but I'll keep that to myself and just hope that I'm right. I've read a good majority of Lauren Asher's books now and I have to say something about Love Redesigned is just so different, I feel like her writing has improved, not saying that her past work is bad, but this book just had a completely different element from her past ones.I think one of the most important parts that I loved was the constant culture and spanish speaking in the book. It's no secret that I'm Latine and growing up, having main characters that were BIPOC wasn't really seen and even now with a spike in Latino characters, the authors have not grown that much. Based on a study from Wordsrated, Latino authors have increased by 2.96% since 2010 which totals the Latino representation to 7.62% in the publishing industry. I have to appreciate the work that Lauren Asher is doing because not only is she breaking a barrier in the publishing industry but she's having her characters be represented in the best way I've seen. I honestly can't express how much I appreciate Lauren for this book because for some, this might not seem like a big deal, but to little me that was expected to be a minor character in a story, she made us front and center with the best representation that I could've asked her.Now to the book, the banter between Julian and Dahlia was truly addicting and something that I just eat up when I'm reading books. There's just something about it that left me wanting more and I just felt like I was a part of their lives. The chemistry between all the characters was just very comforting since you can tell that there's love within each other and that at the end of the day, when one of them feels alone in reality they're not since their family will always be there to support them. The meaning of family is really strong in this book and I'm just a complete sucker for that since my family has a big impact on me.Julian was a very interesting Hero and I honestly didn't expect him to be the way that he was. Is he a possessive jealous alpha? Yes, but there's just something about him that doesn't leave a weird taste in your mouth if he was real. I just feel like he was a gentleman with some jealous tendencies for his heroine which is completely valid. He was just such an interesting Hero that I haven't read in a while, he was just the perfect man and I can see why Dahlia was intrigued with him. Although we don't get to see his growth on paper, we can see that from the incident to now that Julian isn't the same person and has improved himself. I love that he's able to admit that and still acknowledge that he still has work to do which makes me love him more since he doesn't see his vulnerability as something weak.Dahlia, she was just baby girl and after everything she went through with you know who, I just wanted to give her a big hug. The way her character was written, I just felt like she was a friend that was telling us the chisme about her life and that of Lake Wisteria. There were so many great moments that we get with her and I just loved seeing how the story went through her eyes since it was definitely different from Julian. She has honestly been my favorite character of the year and I just hope that we get to see more of her in the future books.Overall, I genuinely can't recommend this book enough since there's just nothing that you won't like from this book. The characters, the plot, and the setting just leaves you craving more from this world and the characters. I just love this book so much and I genuinely think it's one of the best books of 2023.Trigger Warnings:-Mentions of Infertility Issues-Mentions of Death of Parents-Panic/Anxiety Attacks",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CHELSEA OCONNOR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRDQ2UCAF6NMLG565GDMHROOZSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6WX1T0JA2RL8?ASIN=1728292131",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "4.0 out of 5 stars Love this book and ready for more with this series!!",
                "reviewText": "I would recommend this book to anyone. It was an easy read. It had some of the best tropes; billionaire, small town, childhood rivals, and one of my favorites-second chance. We meet Julian and Dahlia, who have known each other since they were kids as their families are close, which forced them to grow up together, but they were always pranking each other, competing against one another, and just bantering back and forth. Julian is a billionaire app developer and Dahlia is a well known interior designer that has a show renovating house with her fiancé who comes back to her hometown after a devastating breakup with her ex fiancé, who was also Julian's college roommate! (Yea, I'll let you read about how that all took place).Anyway, Julian's mother really wants Julian to team up with Dahlia on a home project to pull her out of the sadness she's been feeling since her broken engagement. Julian is hesitant to do it, but basically breaks to his mothers request.With the time that Julian and Dahlia are forced to spend together it starts to bring back old feelings that maybe weren't all to do with hating each other or being rivals afterall. They are forced to acknowledge those feelings that they have both tried to deny for years.This story was just so swoon... that praise the Julian give Dahlia that really starts to bring back her confidence that she was lacking is precious. His ways of remembering things about her that she never knew he paid attention to was just the sweetest.I love a good second chance romance. It forces the characters to evaluate their feelings while also trying to communicate about what hurt them in the past and testing them on how they can move past it if they want to see a future together.I loved how Julian wasn't going to give her up this time, no matter what it took. He was in it to convince her that his love for her was here to stay.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2024",
                "reviewTitle": "Great",
                "reviewText": "Really good book…I’m in loveeeee",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 28, 2023",
                "reviewTitle": "He fell first she fell harder",
                "reviewText": "All you need to know us that this is an enemies to lovers and he never hated her in fact he loved her from the beginning 💗💗💗💗 and that there's an awesome plot and a surprise....",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nimet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on January 30, 2024",
                "reviewTitle": "Lauren Asher strikes again <3",
                "reviewText": "Every time Lauren Asher brings out a new book, I have a new favorite book boyfriend. Honestly, no one writes men the way Lauren Asher does. Her characters will always be some of my favorites. Julian Lopez is everything. It's not just her men that are absolutely amazing; all of her fmc are so likable as well. I will never get enough of her books, like ever. This book's got a billionaire boyfriend x childhood rivals (sort of) x slow burn x small-town romance. Recipe for perfection. We are back in Lake Wisteria, and Cal and Lana even make a surprise appearance; my other babies (from the Dreamland Billionaires series). Dahlia comes back to Lake Wisteria after breaking up with her fiancé. Julian and Dahlia are both in construction; Dahlia has her own show, and Julian's got his billion-dollar Lopez Luxury empire. When she's back, Julian and Dahlia take on a project together (thanks to his match-making mother). They're renovating this house together, but could it turn into more? Honestly, I don't know how to write a review for this one because I loved it so much and could talk about it for hours. The chemistry between them? AMAZING. The slow burn? Had me TREMBLING. I am so in love with Julian Lopez; you have no idea. He is the perfect example of 'If he wanted to, he would.' I've got nothing but love for them. Also, the character growth?? Amazing. They both had their own flaws and insecurities and wanted to be better for each other; but also for themselves. I loved both families so much, and I cannot wait for book 2. Istg if the Dirty Air boys (or at least one of them) isn't gonna make an appearance, I'm gonna be so disappointed. If you love romance, DON'T sleep on Lauren Asher because she's my queen. 💜",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jeansy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 21, 2023",
                "reviewTitle": "WOW THIS WAS SO GOODDD",
                "reviewText": "Lauren Asher ate once again. THIS BOOK FELT LIKE A WARM HUG—i love all these characters already, Julian and dahlia have my HEART. the way Julian was literally ready to give up everything for her was 😭😭😭 he’s the standard. i can’t wait for this series to continue <3",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 11, 2023",
                "reviewTitle": "Lauren Asher men >>",
                "reviewText": "Another couple I fell in love with. Loved the Spanish as a Spanish girl myself, can’t wait for the next book in the series",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}