{
    "remaining_requests": 2252,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Thousand-Boy-Kisses-Tillie-Cole/dp/1728297087",
    "body": {
        "name": "A Thousand Boy Kisses",
        "price": "$8.51",
        "originalPrice": "",
        "rawPrice": 8.51,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Thousand-Boy-Kisses-Tillie-Cole/dp/1728297087",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81A-4OP0+oL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Tillie Cole",
            "link": "https://www.amazon.com/Tillie-Cole/e/B00COA8WSQ/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 43657,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (August 29, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1728297087"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728297088"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 16+ years, from customers"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 9 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.8 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#334 in Books (See Top 100 in Books) #1 in Teen & Young Adult Fiction about Emotions & Feelings #6 in Teen & Young Adult Contemporary Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 43,657 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0ab7ce89-0dd8-4bda-ac34-6fe73ad238cd.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/daf4cae4-2bad-4b34-91c4-1a3ef0d4f67a.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f340323e-db0c-400a-9c3b-af82d5a1aacb.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Angelina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUJ36CLRICJE7QDU4CMTZAFYE2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M0CI6V8G2T6A?ASIN=1728297087",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Worth all the tears!!!!!",
                "reviewText": "5⭐️⭐️⭐️⭐️⭐️10/10😭😭😭😭😭OMG, why I waited so long to read it!?!?!?It was AMAZING!!!Poppy and Rune - Their story is so beautiful. They were so young, so in love with each other, so determined in filling the jar with “thousands kisses” and each one was so special. Just like them.💋💕 “You’ll give me all my kisses? Enough to fill this whole jar?” I asked. Rune gave me another small smile. “All of them. We’ll fill up the whole jar, and more. We’ll collect way more than a thousand.”💕💋I really LOVE, LOVE the story but I don’t know if I’ll pick this book again. It broke my heart so many times. I cried waterfalls since chapter 4 or 6.Ps. Even rereading my highlights, I was ready to cry. 😭 Yes, I did say “I don’t like it” when I was reading the book during a day rather than at night….it just hits different.😅😅",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jojo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH55B45OXYNUPWARBSMN4KMMVWGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFJGARFACCFVX?ASIN=1728297087",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars I have never cried so hard and so much because of a book",
                "reviewText": "I had heard about this book through TikTok and heard nothing but good things about it. So I decided to read it and I am absolutely speechless! I've never cried as much as as often as I did reading this book. Rune and Poppy are perfect for each other and no one can tell me other wise. They had such a compelling love story that shook the ground I walk on. He was so devoted to her in all that he did. And so was she. Cherry blossoms will be different for me, kisses will be different, home will be different, photographs wjll mean more, NY will forever be a place of dreams, the cello will sound more beautiful, and floating lanterns will be a permanent message to send to heaven. I want to write a novel sized review for this book, but I am literally speechless. If you are wondering if you should read this book, I'd say, put any other book you are reading down, grab a few boxes of tissues, and read this book. Because I read A Thousand Boy Kisses... and my heart almost burst🤍",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rowe.Reads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUSIBGBX3SS7PDOC2PDOJ42F2FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17TWQII58267R?ASIN=1728297087",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "4.0 out of 5 stars Moonbeam Hearts and Sunshine Smiles",
                "reviewText": "𝙼𝙾𝙾𝙽𝙱𝙴𝙰𝙼 𝙷𝙴𝙰𝚁𝚃𝚂 𝙰𝙽𝙳 𝚂𝚄𝙽𝚂𝙷𝙸𝙽𝙴 𝚂𝙼𝙸𝙻𝙴𝚂 \"𝐇𝐞 𝐤𝐢𝐬𝐬𝐞𝐝 𝐦𝐞 𝐮𝐧𝐭𝐢𝐥 𝐭𝐡𝐞𝐫𝐞 𝐰𝐚𝐬 𝐧𝐨 𝐩𝐚𝐫𝐭 𝐨𝐟 𝐦𝐞 𝐭𝐡𝐚𝐭 𝐝𝐢𝐝𝐧'𝐭 𝐤𝐧𝐨𝐰 𝐰𝐡𝐨 𝐢𝐭 𝐛𝐞𝐥𝐨𝐧𝐠𝐞𝐝 𝐭𝐨. 𝐇𝐞 𝐤𝐢𝐬𝐬𝐞𝐝 𝐦𝐞 𝐮𝐧𝐭𝐢𝐥 𝐦𝐲 𝐡𝐞𝐚𝐫𝐭 𝐚𝐠𝐚𝐢𝐧 𝐟𝐮𝐬𝐞𝐝 𝐰𝐢𝐭𝐡 𝐡𝐢𝐬―𝐭𝐰𝐨 𝐡𝐚𝐥𝐯𝐞𝐬 𝐨𝐟 𝐨𝐧𝐞 𝐰𝐡𝐨𝐥𝐞.\" r e v i e w I wanted to be sure I crossed one book that I've been wanting to read on my physical tbr off this month and so glad I chose to read A Thousand Boy Kisses. Poppy & Rune found each other when they were just kids, and they became inseparable , best friends to lovers. Until one day they became separated, leaving Rune confused and full of questions. When they finally are able to reunite, Rune finds out some devastating new about the person he thought he would be with forever. You guys this book is so sad! At first, I got the major ick at the young love and overload of sweet words. But honestly, this book was really good and so heartbreaking but just don't expect a HEA, and grab the tissues. The epilogue is the only part I would have changed— I didn't need for the story to end that way. I listened along with the incredible narration of P. J. Ochlan, Katie Schorr. What a performance! I highly recommend the audiobook too. I have so many highlighted annotations from this book, literally beautiful writing and I can't wait for Savannah's story! 4/5 stars ⭐️⭐️⭐️⭐️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samantha N",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2ZYJXJDCIF3ZPODAB6SNMBKWAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A9T4KZQB603D?ASIN=1728297087",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars I cried the entire time",
                "reviewText": "This book isn't my usual genre. I'm not a big fan of young adult stories. It was picked for a book club and I went into it blind. I. Was. Not. Prepared. This book wrecked me!! It was so beautiful and such a sweet love story but so freaking sad.When I say I cried. I freaking bawled the entire book. After I finished I had to go cry on my husband's shoulder and I probably did for at least 5 minutes while I told him the entire plotline of the book. I don't know if I have it in me to read Savs story but I know it will be beautiful. This book is a good reminder to hold those we love close and to always make sure they know how much we love them.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashli Volk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVYWGGD5QCDTUWGULCHFNTNSVOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTMVM2S6SPPPI?ASIN=1728297087",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Oh my gosh my heart. Best love story I have ever read",
                "reviewText": "This book was emotionally incredible. I could not stop crying at about 65% in through til the end. They get you just in the first few chapters and then again a few chapters later and then it just continues to sink into you. This book will live in my brain as a standard of love forever. I will make sure my daughter reads this as well. I cannot believe the depth and admiration these two had for each other and the pain and adventure and heart bursts were captivating and excruciating. The emotions reverberated from the pages into me and left me completely speechless. This is an absolute must read in your lifetime ♥️",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mariel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 29, 2023",
                "reviewTitle": "me hizo llorar",
                "reviewText": "es hermosoEs una historia que no es parecida a ningunaHermosaTodos deberíamos leerla y amar asíGracias :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Madhur Mehta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 10, 2024",
                "reviewTitle": "Soul touching",
                "reviewText": "I laughed, i cried and I fell in love. Just an epic story through and through. The tenderness with which things are handled in the story is marvelous.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lindsey S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 4, 2024",
                "reviewTitle": "Heart Warming, Emotional, Heart Breaking",
                "reviewText": "Breath-taking, Emotional Heart-BreakingGenres: Young Adult Fiction/Contemporary Fiction/Romantic FictionA Thousand Boy Kisses by Tillie Cole ♾Life is short.....Forgive Quickly.....Kiss Slowly......Since that first meeting, in what seemed a very large area to two five year olds, combining their two gardens, Rune had been besotted with the girl who confidentally strode over to him, introduced herself, shook his hand (because that was what her Mamaw had taught her to do when she met new people), and announced that they were to be best friends for infinity! Rune, having just moved with his parents to Georgia, USA from Oslo, had not been happy about relocating, but somehow, this girl made it all better.He'd spent every day with her for the last decade.....how then, could he conceive of such a vast amount of time without her. The Girl next door....his girl....and her jar of hearts. 💟I'd made the decision to read some, if not all of Tillie Cole's books, sometime last year, but for some reason got distracted, and being that she isn't an Author that I regularly see on Social Media (don't you just love an algorithm!), I must admit, it slipped my mind. However, when I was debating what to read after I finished my last book, I suddenly remembered this Author. I realise, that I am appallingly late to the party in terms of reading this novel, but then I only started my page last year and 'A Thousand Boy Kisses' was written sometime before that. That's my excuse anyway. 📖Another Author had read this book within the last year and had given it a good review, so I thought it was a good place to start, plus....it's pink! 🌸 From the opening paragraph, I knew that I had hit the absolute jackpot in terms of finding a read that I was going to love. In the first few chapters, as the Author describes the adoration between her two main protagonists through their eyes, I did wonder if this was going to be just another schmaltzy, nauseating read about a couple together from a young age who proceed to have a perfect life. This is the type of Romantic Fiction that I more often than not, get bored with. I hadn't read the synopsis, so hadn't a clue what lay ahead.As the reader, because Rune and Poppy are introduced at a very young age, you do feel that you are on a journey with them and get to know them deeply. This made it difficult to comprehend the differences that were presented to me when Rune returns from Oslo. I also felt a slight irritation with the way that Poppy handled it, although, I understood why, and the fact that she seemed to take so long to catch on to who and what had prompted that drastic change. That was baffling to me. How could she not realise that her treatment of the boy who loved her with all of his heart, and never wanted to be parted from her in the first place, would not cause a seismic shift in his outlook on the world? The power and the profoundness in this cataclysmic sudden transformation, of the bond between the soul mates, was communicated so well within the writing, so much so, that I could genuinely feel their pain and confusion. The image I had of Rune changed at this point from James Van Der Beek (Dawson's Creek 🪟.....any one who has seen it and reads this book, will appreciate the reference. I rarely picture characters as they're described), to almost a mythical monster, so extreme was the depth of his torture. The image did change again, but wasn't quite the same. The intensity of the anger that Rune felt towards his Father was understandable and I felt every bit of it, but at the same time, how was his Pappa to know what had been happening with the Litchfields during their absence, and the consequences that were to follow? Rune's relationship with his baby brother was so touching, and the way in Poppy is able to guide 'her Rune' back to being something of the boy he once was, without him really realising it, is both heart-warming and heart-breaking. The Chinese lamps were inspired, that's all I'm saying.I must have cried half a dozen times throughout this story, parts of it are truly heart wrenching. The narrative is so absorbing and the characters so tangible. I finished this book with one question, which thankfully was answered in a video that Tillie made in 2020, that I viewed this morning. There is apparently a sequel, but it is not due out until July this year. I honestly cannot wait and have noted it in my calendar.📅 I have also ordered the paperback of 'A Thousand Boy Kisses'. Tillie is a spectacularly emotive writer, and I will be looking to see what else she has written that will float my boat. Quite a lot I imagine. This book made 'my heart burst'. 💔",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joestar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 24, 2024",
                "reviewTitle": "My new favourite book",
                "reviewText": "It feels like if I hadn't read this book, I would have missed something huge in my life. I read this book in two days and I cried whole the time. It made me so happy yet so sad and it took my heart away. I wish to read this book for the first time again. If you like soft romance and tight bonds between loved ones, this definitely is something for you. I love love love this book and it will always be my favourite book. It is so sweet and oh god, just read it and I recommend this 1000000%",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ella",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on January 22, 2024",
                "reviewTitle": "Toppen",
                "reviewText": "Lite liten text",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}