{
    "remaining_requests": 2307,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/It-Ends-with-Us-Colleen-Hoover-audiobook/dp/B01GGU0XWC",
    "body": {
        "name": "It Ends with Us",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/It-Ends-with-Us-Colleen-Hoover-audiobook/dp/B01GGU0XWC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61UpPy25j3L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Colleen Hoover",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Colleen+Hoover"
        },
        "brand": "Colleen Hoover",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 310914,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In this “brave and heartbreaking novel that digs its claws into you and doesn’t let go, long after you’ve finished it” (Anna Todd, New York Times bestselling author) from the #1 New York Times bestselling author of All Your Perfects, a workaholic with a too-good-to-be-true romance can’t stop thinking about her first love.Lily hasn’t always had it easy, but that’s never stopped her from working hard for the life she wants. She’s come a long way from the small town where she grew up—she graduated from college, moved to Boston, and started her own business. And when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily’s life seems too good to be true.Ryle is assertive, stubborn, maybe even a little arrogant. He’s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn’t hurt. Lily can’t get him out of her head. But Ryle’s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his “no dating” rule, she can’t help but wonder what made him that way in the first place.As questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan—her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.An honest, evocative, and tender novel, It Ends with Us is “a glorious and touching read, a forever keeper. The kind of book that gets handed down” (USA TODAY). Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Women's Fiction",
                "link": "https://www.amazon.com/Womens-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=542654"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "11 hours and 11 minutes"
            },
            {
                "name": "Author",
                "value": "Colleen Hoover"
            },
            {
                "name": "Narrator",
                "value": "Olivia Song"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 02, 2016"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B01GGU0XWC"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#84 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3 in Women's Fiction (Audible Books & Originals) #30 in Women's Literature & Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6J7323SYEWVEOA7N2T3472QRUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P6WI23J6P3YV?ASIN=B01GGU0XWC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2016",
                "reviewTitle": "5.0 out of 5 stars Everyone Needs to Read This Now!",
                "reviewText": "“In the future . . . if by some miracle you ever find yourself in the position to fall in love again . . . fall in love with me.”I'm going to start this review off with this statement: I didn't cry while I was reading this book, but I did cry several days later when I was looking back on Lily's story. That shows how emotionally charged this story is, along with the true power behind Colleen's writing. I'm not going to give away any spoilers because you need to go into the book blind. If you want to know what happens, there are definitely some reviews out there that tell you the big twists and turns. But take my advice and don't spoil this book for yourself. It will lose a lot if you go in knowing exactly what to expect. So seriously, don't do it to yourself. Just let the beauty of Colleen's writing sweep over you and sink in.“All humans make mistakes. What determines a person's character aren't the mistakes we make. It's how we take those mistakes and turn them into lessons rather than excuses.”This is honestly not only one of the best reads of 2016, but also one of the most (if not the most) empowering. I want to give this book to every man, woman, and even teenager (it's definitely a NA/adult read) and tell them... READ THIS NOW! Do you want to know why? Because this book carries with it a very strong message, one that shows strength and courage that many people might not have at the time, but after reading will understand and gain. I honestly don't know if there has ever been a time when I was prouder to be reading the heroine's story due to her choices. Ultimately though, Colleen Hoover wrote a book that everyone can take something away from. Colleen always writes such unique stories, and this one is certainly no exception. But the one thing I will say is that this is truly her best book yet.“Just because someone hurts you doesn't mean you can simply stop loving them. It's not a person's actions that hurt the most. It's the love. If there was no love attached to the action, the pain would be a little easier to bear.”Lily's story is one that I never wanted to stop reading. If I know that I'm going to need to read a book in multiple sittings (which was the case with this book), I usually try to find a good place to stop. One in which, nothing major is happening and nobody is facing some drastic/perilous moment. Well you see the problem with this book is the fact that there is literally NO. GOOD. STOPPING. POINT! None! There was never a part where I felt safe in letting this book sit overnight because I knew that the story and the what if's would play endlessly in my mind. So I stayed up and read it all in one sitting because I simply couldn't stop. Lily was someone that I connected to right from the get go. I knew as soon as the book started that I would like her, and that never once stopped while I was reading. However, I didn't realize how much her character would affect me while I was reading. As I said before, after I was finished reading, I couldn't have been prouder of her decisions. The strength she had throughout the story to go through what she did, but also her resolve and conviction just made me constantly cheer her on. Lily is truly one of the most admirable characters that I have ever had the pleasure of reading about, and that admiration goes extraordinarily deep.“Life is a funny thing. We only get so many years to live it, so we have to do everything we can to make sure those years are as full as they can be. We shouldn't waste time on things that might happen someday, or maybe even never.”I mentioned it briefly above, but this book has a very powerful message, and this message is actually carefully woven into the story from page 1. You obviously don't realize it when you start reading the novel, but it's there when you look back after finishing. And this is also why I'm going to reiterate the importance of going into the story blind, because just as unexpected and emotional it is for the reader to read and witness what Lily goes through, it is even more unexpected and emotional for Lily. This is where this book truly shines, because you as a reader feel like part of the story. There's a very slow burn while reading, one in which we get to know characters and see the develop in the ways that we as humans get to know each other...but then Colleen rips that metaphorical rug out from under all of us, and shocks us with one revelation after another. But you know what? That's exactly how life is sometimes...sometimes you never see things coming in a million years and you have to figure out how to deal with these radical changes you never thought would happen.“It stops here. With me and you. It ends with us.”Where this book really got me though was the meaning of the title. Throughout the entire time I was reading, I kept wondering what the title meant. Because come on...this is Colleen Hoover and literally EVERYTHING has some significance (no matter how small). And when I got to the part of the story where the title finally made sense, guys let me tell you...this had an impact on me like no other. I just sat there with my book in my hands staring at the page for a solid 5 minutes. It is the perfect title for the perfect book.“Fifteen seconds. That’s all it takes to completely change everything about a person. Fifteen seconds that we'll never get back.”I connected with this book in my own way, and for that I am extraordinarily thankful to Colleen Hoover for even writing this book. The author's note at the end was just as powerful and amazing as the rest of the story, but it shows just how personal this story was for her to write. I applaud Colleen for writing this book and not \"making things easy\" for the main character or glossing over the \"bad parts.\" This is an incredibly realistic book that makes you realize many things and leaves an imprint on your soul. It's important to remember that everyone must make extraordinarily difficult decisions in their life, and not everyone will agree with them. If this book even empowers one woman to take steps in making an important decision, the Colleen Hoover did her job. And I count myself lucky to have had the honor of reading this story because I am a changed person because of it!Happy reading :)",
                "reviewVotes": "926 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDMJXOIXNWC7VNHZWOOQPL6DJWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25EF51KPHZC3V?ASIN=B01GGU0XWC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfection",
                "reviewText": "Lily hasn’t always had it easy, but that’s never stopped her from working hard for the life she wants. She’s come a long way from the small town in Maine where she grew up — she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily’s life suddenly seems almost too good to be true.Ryle is assertive, stubborn, maybe even a little arrogant. He’s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn’t hurt. Lily can’t get him out of her head. But Ryle’s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his “no dating” rule, she can’t help but wonder what made him that way in the first place.As questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan — her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.I wasn't ready for Lily's story, but I started it and I could not put it down. On so many personal levels I related to Lily. Her strength, her compassion, and her ability to remain strong throughout the story kept me invested. If you have not read a book by Colleen Hoover, then I encourage you to start with this one. I give it 5/5 stars",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JARET FERRATUSCOJARET FERRATUSCO",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGG7HIE3W54RO53TT7IPYTQCJGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V6POUCHJVIA5?ASIN=B01GGU0XWC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Unfamiliar with romance fiction? It's almost like an unfinished script from the Twilight Zone.",
                "reviewText": "\"He knows someone in common with every person he’s met so far, and after about half an hour of following him around, I’m convinced he’s made it a personal game to find someone in common with everyone here.\"This line is neither beneficial nor detrimental to the story, but Colleen Hoover has a chiseled way of describing the actions of her characters, and I found it so pleasing and beautiful that I was sometimes compelled to write sentences down. The story itself, as well as the actions of these characters, are confusing to me in that I just can't see a human conversation happening this way, which I'll attribute to my inexperience with the romance genre. But after hearing of Colleen Hoover's takeover of the indie publishing scene (and a personal recommendation on this title as a good beginner's look into Hoover), I just had to check it out. Coming into this without having read any previous reviews or even the synopsis, I thoroughly enjoyed the story. Even as a non-romance aficionado. Each chapter feels like it's trying to seduce you into changing your way of thinking about something, like when people tell stories at AA and you're new to the program. So I found it challenging to stay on the path and understand where these people are coming from and where I felt the author might want me to end up standing on it. If, like me, you're a voracious reader who has never dipped into the romance genre either, this may be intriguing to you, too. And there's a sequel to it now, which I'm also sold on picking up.Cheers to Lily & Atlas. May your poker nights explore new territory in Part 2.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/810RX5UBPaL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2024",
                "reviewTitle": "Theire is no sutch thing as bad people. We are all just people who do bad things",
                "reviewText": "Hands down the best novel i have ever read.. im not a big reader but got this book dec 30th finished it on dec 27th javent read for a week and have two kids and managed to read the hole book pretty fast could not put this book down ♡ thank you Collen Hoover ♡ It starts with us is arriving home tomorow cant wait to start reading it 💋",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ju5uA-3tL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Flaviane Ferreira Fraga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 1, 2023",
                "reviewTitle": "Forte.",
                "reviewText": "Livro com história forte. Não é um romance clichê e quem se deixa enganar pela capa rosinha, é porque não viu a simbologia da flor despedaçada.Uma escrita gostosa, fluída. Gostei bastante, mas amei mesmo foi quando li a continuação e vi que todos tiveram as consequências e destino que mereciam.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rocío ZepedaRocío Zepeda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 1, 2023",
                "reviewTitle": "En cuestión de días me lo acabé.",
                "reviewText": "Tiendo a no procurar mucho tiempo a mi lectura pero por fortuna este libro llegó para decirme que necesitaba dar más y valió 100% la pena. Es una novela muy humana que me ha permitido sensibilizarme a situaciones a que por fortuna en algunas me siento ajena pero hay otras en las que siento que son algo por lo que muches atravesamos. Es fácil de leer, entretenido, muy buena construcción de personajes. Lectura ampliamente recomendada. Sin errores de edición graves; en 400 y un poco más de páginas solo 2 palabras que sin mucha atención son imperceptibles. Lectura de calidad, hermoso!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711pRMX61OL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "antonio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 15, 2024",
                "reviewTitle": "Bellissimo",
                "reviewText": "Veramente bello!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Margaret Hansda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 29, 2024",
                "reviewTitle": "A good novel",
                "reviewText": "Received in good condition, packaging was also good. Now about the book, let me say it's too good. While I was reading I had a notion but it changed the meaning at the end, like the story Line and the title of the book. It literally shook me. A must read novel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}