{
    "remaining_requests": 2011,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lunar-New-Year-Love-Story/dp/1250908264",
    "body": {
        "name": "Lunar New Year Love Story",
        "price": "$13.48",
        "originalPrice": "",
        "rawPrice": 13.48,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lunar-New-Year-Love-Story/dp/1250908264",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91cGJYyT3WL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gene Luen Yang",
            "link": "https://www.amazon.com/Gene-Luen-Yang/e/B001JP26JI/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 68,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Lunar New Year Love Story, gorgeously rendered in graphic novel form by Gene Luen Yang and LeUyen Pham, deftly grafts the symbolism of these two holidays to create a rich tapestry of complimentary worldviews.\" ―NPR\"Yang’s storytelling is a multigenerational, multilayered, multicultural masterpiece of searching for lasting, empathic connection.\" – Booklist, starred review\"Valentina’s quest is full of swoony moments that will satisfy romance readers, while her fearless journey of personal growth will win over everyone else.\" – Kirkus, starred review\"A positive and beautiful work of art that will make an impression on readers.\" – SLJ, starred review\"Yang and Pham do a wonderful job of weaving fractured families and romantic yearning with fantasy elements that show emotional states and growth, with plenty of humor throughout.\" – Horn Book, starred review\"Poignant moments amplified by evocatively colored digitally rendered panels address deep issues of parental abandonment and grief, while interjections of comic relief and a riveting subplot surrounding lion dancing result in a well-paced, well-balanced dual effort.\" ―Publisher's Weekly, starred review\"Lunar New Year Love Story is a buoying tale about being open to the pain of love.\" ― Shelf Awareness, starred review\"Graphic novel lovers who find themselves immersed in richly illustrated, culturally resonant intergenerational stories...will be unable to resist the intricate dance between love, grief, and learning staged in this fiercely empathetic instant classic.\" ―BCCB, starred review\"Lunar New Year Love Story will appeal to a broad audience, including younger teens. Though it is a love story, it embraces all kinds of love: romantic, yes, but also familial, intergenerational, spiritual and the special love between trusted friends.\" ―Bookpage, starred review\"A beautiful comic that shows that love takes many forms and goes hand-in-hand with laughter, tears, heartbreak, and forgiveness.\" ―Screen Rant About the Author Gene Luen Yang writes, and sometimes draws, comic books and graphic novels. He was named a National Ambassador for Young People’s Literature by the Library of Congress in 2016, and advocates for the importance of reading, especially reading diversely. His graphic novel American Born Chinese, a National Book Award finalist and Printz Award winner, has been adapted into an original series on Disney+. His two-volume graphic novel Boxers & Saints won the LA Times Book Prize and was a National Book Award Finalist. His nonfiction graphic novel, Dragon Hoops, received an Eisner award and a Printz honor. His other comics work includes Secret Coders (with Mike Holmes), The Shadow Hero (with Sonny Liew), and Superman Smashes the Klan and the Avatar: The Last Airbender series (both with Gurihiru). In 2016, he was named a MacArthur Foundation Fellow.LeUyen Pham has illustrated more than one hundred books for children, including the Caldecott Honor book Bear Came Along by Richard T. Morris and the bestselling Princess in Black series by Shannon and Dean Hale. She is the co-creator, along with Shannon Hale, of the bestselling graphic memoirs Real Friends, Best Friends, and Friends Forever. Her own books include The Bear Who Wasn't There and Big Sister, Little Sister. A graduate of the ArtCenter College of Design in Pasadena, LeUyen lives in Los Angeles with her husband and two sons."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 2 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Wednesday, February 21. Order within 17 hrs 2 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Graphic novel superstars Gene Luen Yang and LeUyen Pham join forces in this heartwarming rom-com about fate, family, and falling in love.She was destined for heartbreak. Then fate handed her love.Val is ready to give up on love. It's led to nothing but secrets and heartbreak, and she's pretty sure she's cursed―no one in her family, for generations, has ever had any luck with love.But then a chance encounter with a pair of cute lion dancers sparks something in Val. Is it real love? Could this be her chance to break the family curse? Or is she destined to live with a broken heart forever? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ First Second (January 9, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250908264"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250908261"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 14+ years, from customers"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 10 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.1 x 1.1 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,096 in Books (See Top 100 in Books) #7 in Young Adult Romance Comics & Graphic Novels"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 68 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d1ee8e83-0d9c-4bcc-bab1-e97557898b53.__CR0,15,1192,369_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce1b15ee-d762-4d40-9196-16cf355837f3.__CR0,12,982,304_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b579b99-9714-4eb3-b38b-02af359fd58e.__CR0,8,1086,336_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "L. J. Rinaldi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK5LZPMTFNQYW6RM3R3VSIW2EUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZNHKQR176FVN?ASIN=1250908264",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars great story",
                "reviewText": "If you have ever been to the Lunar New Year Festivals, you have probably seen the lion dancers. What I didn’t know, until reading this graphic novel was that each country has its own interpretation of how the lion dances, and even what it looks like.Valentina decides she wants to learn lion dancing. Valentina is trying to decide if she should give up on love. Valentina has been told by her grandmother that generations of her family have been unlucky in love, and she should just face the facts.Valentina’s best friend loves falling in love. She just hates it when love is not so fresh anymore, and you have to work at the relationship part. To her, it is a party all the time, and she encourages Valentina to just fall in love anyway, and then move on.And it doesn’t help that the spirit of St. Valentine is haunting her and encouraging to just give up on love, and not to bother with having feelings at all.There were so many good personalities and moments in this book. I love how blunt the grandmother is. I love how the dragon dancers are drawn, along with the sounds of the drums. I love how Bernice just accepts whatever it is that is going on with her best friend. And I love the quiet moments, such as when Val is looking at the stars Jae.It is probably best to go into this story without knowing too much, as there is so much going on, and being revealed, throughout the story.Suffice it to say, I am a little biased because I love everything Gene Luen Yang writes. He has just such a great way of telling his stories, whether they are contemporary, or tales of Superman, or historical fiction in the time of the Boxer Rebellion.I highly recommend you go out and get your hands on this. Although it is a romance, it isn’t really one of those typical YA ones.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jei",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3YGBNXTUY7P543ZB56ZYJNPNWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KYEMYEIGYA4X?ASIN=1250908264",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Beautiful artwork, a great exploration of teen girlhood and love",
                "reviewText": "I loved that LUNAR NEW YEAR LOVE STORY came out close to Valentine's Day and Lunar New Year. We don't get a lot of Asian American stories that center around this holiday. LUNAR NEW YEAR LOVE STORY is the new graphic novel that is a coming-of-age story centered on a Vietnamese American teenager Valentina Tran who since childhood is obsessed with Valentine's Day. But when she finds out the true story behind her father and mother, she's ready to give up on love and she's confident when it comes to love, her family is cursed. But things seem to change when she gets involved in lion dancing for the Lunar New Year celebration.LUNAR NEW YEAR LOVE STORY explores teen girlhood and love, both romantic and familiar but also weaves in teen angst and all the complexities that come with it. But it does a good job with also not demonizing anyone because relationship and love is hard! And while it does go into some dark places, the author and illustrators choose hope at the end. LeUyen Pham's illustrations and tones of the visuals were absolutely gorgeous, especially the imagery of the lion dances! Overall, it's super sweet an easy read.The big con though - While I always appreciate the inclusion of Vietnamese language and diacritics, it was very clear the book's team didn't have a Vietnamese language proofreader. When Vietnamese dialogue was used, often it was unnatural and rigid. There were also several spelling/diacritical mark errors in the Vietnamese (both in the dialogue and art) - For instance, \"Tết\" (Vietnamese name for the Lunar New Year) was frequently spelled \"Têt\" whenever it was used. How the grandma's \"broken\" English was written was also a bit jarring and cringey and didn't feel like what a Vietnamese grandmother (whose second language was English) would speak.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYCDJRVYVUDD7OWYQTRCN54AYKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QCQF4E6K7427?ASIN=1250908264",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Great love story",
                "reviewText": "Gene Luen Yang and LeUyen Pham’s beautiful YA graphic novel Lunar New Year Love Story chronicles the intergenerational love story of Valentina Tran. When Valentina learns the truth about of her mother, she’s convinced her family is cursed to have bad luck in love. She makes a deal with the ghost of St. Valentine: she has one year to prove to him she can find true love, or she’ll give him her heart. But then, during the Têt Festival, she meets two boys from the Liu’s Kung Fu Lion Dance Studio, Les and Jae. Could this be the way to break her family curse, or is she doomed to have her heart broken, too? This book is a love story for the pan-Asian celebration of the Lunar New Year (Têt for the Vietnamese) and the common threads that unite Vietnamese, Chinese, and Korean communities in the US.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MyLSDMyLSD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBGRO34BA6FXJABRJ2OSOGTCH5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI7DH2OKLT39Y?ASIN=1250908264",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Culturally relevant",
                "reviewText": "My heart was so happy when I saw this new graphic novel pop up. My teen daughter loves graphic novels, but I mostly loved that this was a story tied around a holiday that our family celebrates every year. I also loved that she could read an Asian American author. She ended up loving the book and storyline itself. She said it was soo good. And I'm planning to read it myself next just because I love lunar new year and I'm a sucker for a good love story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71uNPzSS3TL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "SL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKXUSPWOFHLG2J4CS6HN3XK47IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IK04497WP3O7?ASIN=1250908264",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful artwork and story line!",
                "reviewText": "Review provided by my 13 year old daughter:This book is an amazing graphic novel, the artwork is absolutely gorgeous! The plot just drew me in and I couldn't stop reading this novel. I love all of the character designs and their personalities. The portrayal of the lion dancing, music, and training was accurate and the artwork brought it to life. The love story was intriguing and kept me turning pages.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}