{
    "remaining_requests": 2311,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Reminders-Him-Novel-Colleen-Hoover/dp/1542025605",
    "body": {
        "name": "Reminders of Him: A Novel",
        "price": "$9.12$9.12",
        "originalPrice": "",
        "rawPrice": 9.12,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Reminders-Him-Novel-Colleen-Hoover/dp/1542025605",
        "soldBy": {
            "sellerID": "A2D0XUFQTHPTMU",
            "name": "Goodwill of Orange County",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2D0XUFQTHPTMU"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71ICm779FxL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Colleen Hoover",
            "link": "https://www.amazon.com/Colleen-Hoover/e/B006SKAK42/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Goodwill of Orange County",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 260118,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 33 mins",
            "$3.99 delivery Thursday, February 29.",
            "Or fastest delivery February 22 - 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Montlake (January 18, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 335 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1542025605"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1542025607"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 15 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#156 in Books (See Top 100 in Books) #13 in Contemporary Women Fiction #50 in New Adult & College Romance (Books) #193 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 260,118 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sandy Farmer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUL3ZAGSJQGPKLDCMO3NQKR6TEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28BX61ZJSNPB2?ASIN=1542025605",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2022",
                "reviewTitle": "5.0 out of 5 stars 5 Stars - Best CoHo in Several Releases",
                "reviewText": "Some personal background first. In 2010 my cousin, who was 21, was involved in a car accident. I don't remember all the intricate details, but he got into a verbal altercation with another person in a parking lot that moved to the road. The two drivers (one being my cousin) we're racing where the other vehicle was driving in the oncoming lane and ended up clipping my cousin's vehicle. The other vehicle wrecked and three occupants died. My cousin left the scene, drove back by, didn't stop and also didn't call 911. He was sentenced to 99 years for three counts of murder and 10 years for leaving the scene of an accident with injuries to be served consecutively after his 99 year sentence. The judge assumed that he had no remorse due to his stoic appearance in court. He is still serving his first sentence in a state prison. He had a three year old daughter and a wife when he was sentenced. He is now divorced, and his ex-wife and daughter have moved to Virginia. I don't know when the last time he's seen his daughter. I have only met her once.I started reading Colleen Hoover in 2012 when Slammed was available for review on NetGalley. I loved it. And she became an auto-buy author for me. After 20+ books, I feel like I know her writing style to the point where she surprises me less and less even with her books such as Verity and Layla. As a matter of fact, her most recently published books have been my least favorite she's written... until Reminders of Him. This book reminded me of old Colleen Hoover.Kenna was involved in a car accident with her boyfriend. She was driving. She was under the influence. She thought he was dead. She couldn't find a cell phone, and so she left the scene of the accident. I won't get into more than that with the details because that's part of the story. But she was barely pregnant and subsequently gave birth while incarcerated. Her daughter was taken from her care and placed in the custody of her boyfriend's parents. She has now, 4 years later, been released and hopes to reestablish her connection with her daughter.Ledger was Scottie, Kenna's boyfriend's, best friend. He wasn't around much when Kenna and Scottie started dating so he'd never met the girl who murdered his best friend. Ledger has spent the last 5 years creating a version of Kenna in his head. Only when he finally meets her in person, not knowing who she is, he slowly comes to find out that she isn't anything he imagined her to be.The pain in this book was palpable. Every single character is deeply filled with pain. Kenna lost the love of her life and her daughter in and because of one terrible moment and decision. Scottie's parents are so filled with grief that they can't see past their own pain to anyone else's. Ledger is hurting too. He misses his friend, he loves Scottie's parents like his own, he wants to protect Diem (Scottie and Kenna's daughter), and he's falling for the one person he never could have imagined.Favorite quotes:-She's quiet, but she's said just enough to make me want the rest of her words.-It's incredible how two people who have never met can have so many of the same mannerisms.-It proves that time, distance, and devastation allow people enough opportunity to craft villains out of people they don't even know.I only had two complaints that I can remember right now. Roman is a side character who happens to have a crush on a married woman. He isn't actively pursuing her. Like he's not asking her out or anything. But he does regularly show up at her bakery to buy cupcakes from her. He's wishing for her marriage to fail. I think this sucks. Obviously these people exist. Not all people, married and unmarried, respect the commitment two people make to each other. But sheesh, I think enough marriages fail on their own without outsiders wishing, hoping, and waiting for their opportunity to swoop in and snatch one party up. I just wish this wasn't included even though it was such a small part of the overall story.My second complaint is, yet again, Colleen Hoover uses letters as a major plot component. At first I wondered if she was doing this out of like a writing shortcut. You know how a villain will spell out all of their evil plans to the hero of a movie in one big speech. Well, in several of her books I've felt like she uses letters as big information drops. And she does that again in Reminders of Him. I can't say CoHo is reading my reviews of her books, but I honestly felt like she was almost using the letters in Reminders of Him to spite me. That's very conceited of me, I realize. So what I think is the more likely option is that she's doing it on purpose. Maybe this is becoming a calling card of hers or something. Like she's seeking out opportunities to include letters in her books rather than using them as a crutch to dump information. I would still like to see her write a book that doesn't include a letter like these, but we'll see.Reminders of Him was my favorite Colleen Hoover release in the last several years. This blows Verity and Layla and especially Regretting You out of the water. I used to feel a little apathetic towards her books due to repetition and the big reveal being more important than the journey, but Reminders of Him renewed my Colleen Hoover enthusiasm. The similarities and differences to my own cousin's life and accident made this all the more relatable to me. Reminders of Him gets 5 Stars. Have you read Reminders of Him? What did you think? Let me know!",
                "reviewVotes": "288 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZRHMEU5OSSFMUZXLR5IVL7NAGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H9ECBWHWKMMB?ASIN=1542025605",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Whoa!",
                "reviewText": "This is the second book I've read/listened to by Colleen Hoover. Whoa! I definitely liked this one better. I listened into the early morning hours because I didn't want to pause it. I experienced all the feels. Sadness, disappointment, despair, heartbreak, resignation, hope, and joy, I laughed and cried. I cried ugly tears. I absolutely loved this audiobook. It would get way more stars if I could give them. A new favorite book, most definitely.Brittany Pressley and Ryan West are AMAZING narrators. Those two brought this book to life with such emotional performances that it rolled like a movie in my head!! And their voices are so smooth and easy to listen to for long periods of time. They were perfect for the characters. Honestly, it may have been their performances that captivated me so much for this story.This was perfection.*I listened to this audiobook through the Kindle Unlimited program and then decided to buy the book and audiobook!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heather G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJ6SJRL3CSPLFZXFQ3SX2VI3OMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WTZYWJAKJVOV?ASIN=1542025605",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars Couldn’t put this down…",
                "reviewText": "I have to admit I was hesitant to read this after I read Verity and hated it. It was too evil for me. Reminders of Him was completely different. I have to say the sex scenes were a bit too graphic for me and just seemed a little too much. Otherwise I really enjoyed the story line and couldn’t wait to see how it ended. This was chosen for our book club book and what an easy read and entertaining.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Dalton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDCZLQSGUYIAKEUUF4G74SJY7XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16I00AH3XE672?ASIN=1542025605",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Heartbreaking but Lovely",
                "reviewText": "This is my first 5 star of the year. The story was so well written. Watching how each of the characters grew and learned that things aren’t always as they seem. Getting all of the characters points a view gave the story a very real feeling. I had read in another review that they felt Kenna wasn’t really trying to get her daughter back. I disagree. I feel she was saying as much as I want her I will sacrifice my wants so that she has the best life. I did enjoy the happy ending. It was sweet with good understanding on how they all got to this new place without being overly simplified.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAXZUQESNVKEA3U3O5Q4BCY57YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AU4173XW5WY1?ASIN=1542025605",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars I LOVE this book!",
                "reviewText": "This is truly a heartfelt, heartbreaking, real emotional book! Simply written, but a real good “feel good” book! This is one of those books where you can put yourself in the characters shoes and feel the same way they are feeling, and more than likely see their reasonings behind decisions made. I absolutely loved this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tonya Waddell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQACKNFKWZXGYGCNLA3LT3TXV4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ZCC3HN05EJB?ASIN=1542025605",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Colleen Hoover never fails…",
                "reviewText": "This book is exactly what I’d expected it to be. Heart wrenching in a great way! Colleen Hoover never fails to take controversial matters and bring them to the forefront of her books and include them in a way that both makes us laugh and grieve at the same time. This book was a good read for me as I’ve been to prison and felt as Kenna the heroine felt. We will always be the criminal in some peoples eyes and not good enough. But she was still brave enough to fight through feelings of inadequacy to try and meet her daughter. In the end finding the love and family she needed. Great book couldn’t put it down!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurynn East",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIDEXGIK4H3CZWU2Y564UWX4I7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14P7OUZFBR7D?ASIN=1542025605",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars my first Colleen book",
                "reviewText": "SPOILERS AHEADI’m not lying when I say there wasn’t a single thing I didn’t like about this book. Maybe the fact that drunk driving makes me angry. But the way this book made me feel and how many emotions it gave me was more than I’ve ever felt in any other book I’ve read.I was so unsuspecting of Ledger falling for his dead best friends girlfriend, that caused the accident that killed him.But I’m so glad that Scotty’s parents accepted her in the end. It made my heart happy to find out that they accepted her after they read the letter she wrote to him.This book had me hooked immediately, and I highly recommend it to anyone wanting to read their first Hoover book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marie-Claude PaquetteMarie-Claude Paquette",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 27, 2023",
                "reviewTitle": "The power of forgiveness",
                "reviewText": "This story is very deep with ambivalence of emotions. It also demonstrates the power of forgiveness. Is it possible to forgive someone who killed your son or your best friend while driving drunk? Maybe. But to forgive someone who decided to run away because she feels guilty about causing his death when he died 6 hours later and could have called an ambulance to have a chance to be saved? I don't really believe that in the real world. This is extremely difficult to forgive that. We know that forgiveness is a liberation in itself and that it does not mean \"Now that I have forgiven you, you can come back into my life.\" No, not everyone will forgive these acts. Kenna was young and felt really guilty for causing the death of her ex-boyfriend and it's normal that they were all angry with her. She served 5 years in prison for that. I consider that forgiveness is a choice and that if Ledger and the family are ready to forgive this act to live in peace and because Kenna is sincere, it is ok. Until you reach the end of the book you will know the truth and it is heartbreaking. Life can be unfair. I am glad there is a happy ending. I forgive Kenna Rowan, she deserves to live a happy and peaceful life.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81HVXMl+tTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 25, 2023",
                "reviewTitle": "Um dos livros mais emocionantes que há li",
                "reviewText": "Gosto muita da escrita e das histórias da CoHo; adoro como ela sempre se aprofunda em temas além do romance e gosto muito dos agradecimentos dela, das notas finais, isso sempre me emociona também.No fim, você entende que esse livro é sobre luto, sobre perdoar a si mesmo e perdoar o outro; sobre seguir em frente.Não existe certo ou errado nessa história, você entende no final que todo mundo independente de ter errado ou não, tomou cada decisão baseada no luto e na dor. Todo mundo estava sofrendo e cada um sofria da sua forma.De fato, é uma história sobre reencontro de mãe e filha, mas muito mais sobre lidar com o luto e o perdão.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Jose Rodriguez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 28, 2023",
                "reviewTitle": "I loved this book",
                "reviewText": "Great since the beginning, the story feels so different but at the same time truthful, I have loved the three books I’ve read from this author. They are all so different but sharing a great human truth",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "c wood",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 14, 2024",
                "reviewTitle": "an agonising but beautiful read",
                "reviewText": "I wasn’t sure if I could get into this book, but, as always with Colleen Hoovers writing when I was in it, I couldn’t put it down. I went through every emotion I possibly could; from angry, to sad, to guilty, to happy, to sad again, I felt every single emotion Kenna and Ledger went through. Incredible read, I read this after just finishing Ugly love and November 9 and I can officially say I’m absolutely in love with the way Colleen Hoover writes!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pooja Nair",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 1, 2024",
                "reviewTitle": "a must read",
                "reviewText": "Just love love it. Kept me engaged till last.i am still thinking of kenna and ledger what a storylineLove it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.66",
                "sellerName": "ZBK Books",
                "sellerRating": "4.5"
            },
            {
                "price": "$8.93",
                "sellerName": "The BAP Goods",
                "sellerRating": "5"
            },
            {
                "price": "$9.12",
                "sellerName": "family library",
                "sellerRating": "4"
            }
        ]
    }
}