{
    "remaining_requests": 2060,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Flawless-Chestnut-Springs-Elsie-Silver/dp/1728297001",
    "body": {
        "name": "Flawless (Chestnut Springs, 1)",
        "price": "$11.26",
        "originalPrice": "",
        "rawPrice": 11.26,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Flawless-Chestnut-Springs-Elsie-Silver/dp/1728297001",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91YxjgbN0tL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Elsie Silver",
            "link": "https://www.amazon.com/Elsie-Silver/e/B0913FH5MX/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 46777,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 17 hrs 6 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b?ie=UTF8&node=23"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/Contemporary-Romance-Books/b?ie=UTF8&node=13354"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (August 29, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1728297001"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728297002"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.5 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 1 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,376 in Books (See Top 100 in Books) #52 in Western & Frontier Romance #340 in New Adult & College Romance (Books) #1,000 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 46,777 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CHELSEA OCONNOR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRDQ2UCAF6NMLG565GDMHROOZSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW41S06I9WGSV?ASIN=1728297001",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Rhett + Summer",
                "reviewText": "I LOVE a good small town romance!! Throw in a good ol cowboy and I'm gone! This entire series is one I will always recommend when asked about small town romance. This is about Rhett, a 32 yr old pro bull rider and Summer Hamilton 25 yr old law school grad. Rhett has a PR situation paired with a cocky bad boy reputation and has to have basically a \"babysitter\" to keep him out of trouble with the media for awhile. Rhett's agent just happens to assign his own daughter, Summer to keep Rhett in line.Problem is, the moment Rhett sees Summer he wants her, but knows he shouldn't have her. It doesn't take long for Summer to see that Rhett is actually so much more than the media portrays him to be. As they start working together it becomes clear that they are growing on each other, but Summer feels it isn't for the best. They dance around this attraction for awhile before ever crossing that line. This is very character driven, you get to see the softer side of Rhett and always see the side of Summer that cares so much about what others think of her.I loved the attraction that was there between these two! It has some of my favorite tropes; Small town, close proximity, one bed, opposites attract.Also love a series that includes other characters from the family and gives you good development on wanting more of their stories too!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Megan Green",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHCVTRT6IRIVNCFSZO4DKRVSCYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FX9BGG6CKGNS?ASIN=1728297001",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2022",
                "reviewTitle": "4.0 out of 5 stars 4 “yeehaw” stars for this small town chic romance!",
                "reviewText": "A bull rider and his agent—how did I not see this coming?Summer (h) is the “other child” of the family, conceived from a quick romp with a maid, and feels like she has something to prove, be it loyally following her father or nurturing those around her because “I’m an empath” (and no, not in the actual way, more like the Tumblr way).Rhett (H) is the youngest cowboy in his family (save his little nephew) and has built an unsupported career off the adrenaline rush of bull riding at the risk of worsening his injuries and running his mouth.When Rhett’s jokes and less-than-graceful handling of nosy journalists nearly tank his career, Summer is sent out as his glorified babysitter.And that’s how our small town, enemies to lovers story kicks off.I found the term “enemy” was a very, er, <em>inaccurate</em> way of describing our H and h. They are both victims of circumstance who don’t get along and have their little scuffles, but that doesn’t make them “enemies”. I’d say this is more of a <em>strangers to lovers</em> phenomenon than enemies.Enemies to lovers for me needs to be all about the mockery, the hurt, and one attempt of legitimately murdering the other (be it in body or in mind).I enjoyed this book subverted several tropes in such a <em><strong>natural</strong></em> way. For example, Summer may be unapologetically city girl, but she can ride horses, she’s not embittered at her father’s infidelity, she’s better at endurance training than the guys <em>without</em> monologuing about it, and she understands when she is hurt.I was very worried when Rhett got hurt that Summer would make up with him then. But when Rhett went all, well, <em>Rhett</em>, I was pleased she walked away and rightfully ignored him.I also very much liked she was unapologetically city girl and very brilliant without monologuing or exacerbating her differences between her and the country folk.I had a bit of an issue with all the “nibbling on her lips” and “I’m an empath—a nurture”. The verb <em>nibbling</em> requires both lips and picturing it (because, as some of us do, we create an entire feature film as we read) made me gloss over any of her “anxious tells”.I also liked how this was a subverted babysitter trope to a degree. I get annoyed at the whole agent/PR x athlete trope because the agent comes off as snarky and childish as they <em>literally</em> treat the athlete like a child who knows nothing or a “dumb jock” and refuse to apologize for it.The antagonism between these two were realistic, and I’m happy Summer knew better than to embarrass anyone while on the job and also took Rhett’s own emotions into account.I <em><strong>did</strong></em> like Rhett more towards the end than at the beginning. I especially loved when his father shut down Rhett’s “possessive Alpha” act with advice almost every MMC needs: stop focusing on the person eyeing your lover and focus on who your lover is eyeing.When people gawked at two of my previous partners, I felt pride because that means others were besotted with their charm as I was. And I felt so lucky someone so well-sought after was with me and I got to know them under all the vanity.Possessiveness and jealousy are actually darkly thrilling to read <em><strong>within the context of the story and/or character</strong></em>. Some authors make cinnamon roll MCs aggressively jealous as a way to “show a whole new side” but it feels shoehorned in.Rhett’s jealousy actually felt like one small part of his personality, and his father’s quick word of advice was perfect. No soapboxing. No shoehorning. No signing. Two sentences and we’re done with that ish.What prevents me from 5⭐️s is the use of family and the best friend. I’m sorry. I <em>hate</em> the “I have one sole bestie in this world” trope. Willa was nice, sure, but I didn’t vibe with her.Family as an external conflict away from the couple’s own issues is fine with me. The naming (Summer and Winter) was a little too much. And also, Kip might’ve been great in <em>some</em> aspects, but if his wife and daughter are causing so much distress to his much more beloved daughter, it begs the question why he never sought divorce.I do like, however, that Winter stayed cold until the end. Honestly, I’d like to see her with Caleb. I love the grumpy/grumpier trope which is a <em><strong>rare</strong></em> breed of story. But it’d be fascinating to see how even a grumpy Caleb manages to thaw Winter out of her ice queen persona and also help provide much more of a natural insight to Luke’s mum.Unfortunately, I have a feeling it’s Willa x Caleb and Winter x Beau.<em>Le sigh</em>.Anywho: good read. References to OW with a fake out and some good OM drama too. I’m not sure how the steam was. Little miscommunication outside a singular stupid moment. The main strife came from words spoken shots fired.4.25 ⭐️s.💜",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTLHVPOR55IWQRLNRLF5PXQS25A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U1LS4DXF0VE?ASIN=1728297001",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Spicy and sweet",
                "reviewText": "What a ride! This book is solid all the way around. I know it's been fairly popular for a while, but i'm just now getting it checked off my tbr. The characters are great, the story is fun, the spice is spicing. I needed a little breather after this one. The tension and banter are great throughout. Banter is one of my favorite parts of a romance book and this one had tons of it. I love when characters have relatable issues and development points throughout, and Flawless had internal struggles for both main characters. It was emotional without getting sappy, spicy without feeling redundant, funny without feeling cliche. All in all, it was a fabulous read!overall 5 starsspice 3 stars",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley Faris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBPUE4SK266WTGUW4L6YDIQZCMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLGCLROHHQXDO?ASIN=1728297001",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "4.0 out of 5 stars Love this book!",
                "reviewText": "I really enjoyed this book and completely understand the hype. The first book sets the tone for an entire series and I am so excited to keep diving into this world Elsie Silver has created in Chestnut Springs Series. The book flowed to easily and I just wanted to keeping reading. Every character introduced had a purpose and no one felt forced or like a filler. I got more excited as I kept reading about the books to come.The connection between Rhett and Summer was undeniable with the perfect balance of push and pull to keep you hooked. I really related to Summer and her struggles of pleasing everyone around her. Rhett was the perfect compliant to Summer bringing out the best side of her she was afraid to show too many people. There was so many twists and turns that kept shocking me which I really enjoyed. I highly recommend this book and can’t wait to dive deeper into this world!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SCJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZABIG2J4WCY5KD25TITTW27PCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQAFT0TS9WTXE?ASIN=1728297001",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Rhett and Summer",
                "reviewText": "First read from Elsie and she did not disappoint.Rhett, a bull rider, it’s getting up in age to continue competing but he’s been doing this his whole life and don’t know what else to do or who he is without it. He loves the thrill and doesn’t take crap from anyone. With that, he tends to carry a bad reputation but no one really knows him.Summer, the daughter of Rhett’s PR firm, is yet again in a meeting hearing about what the bad boy did. Only this time, it goes a step further as a sponsor has pulled out. The team agrees that someone needs to watch Rhett until Summer finds out it is her. Oh, did she mention that her childhood crush was Rhett? This shouldn’t be complicated at all.Beautiful story of two people who never feel like they are enough until each other. I loved Rhett and wanted to hug him throughout the book. Summer tended to get on my nerves as she cared too much what others thought. But Rhett and Summer were so good together and I love seeing their HEA.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 17, 2024",
                "reviewTitle": "First in the series and I am hooked!",
                "reviewText": "Overall ⭐️⭐️⭐️⭐️⭐️ [5/5]Spice 🌶️🌶️🌶️🌶️ ½ [4.5/5]📌You’ll dig this if you like» Enemies to lovers» Cowboys» Grumpy x sunshine» Cinnamon rolls» Forced proximity📌What stood out» Rhett would raze the world to protect Summer if he needed to.» Rhett’s father loves Summer immediately, and his brothers heed her. Even Cade, who admits he likes that she doesn’t take any of their 💩» Summer doesn’t suffer fools gladly and more than holds her own with Rhett and his brothers.Rhett Eaton is a professional bull rider nearing the end of his career when he makes statements which are unknowingly recorded and he decks a paparazzi who tells him he owes his fans an apology.Rhett’s agent is Summer Hamilton’s father, and he tasks her with ‘babysitting’ Rhett to keep him out of trouble for the rest of the season. He has one rule: stay out of his daughter’s pants. The problem is that Rhett’s Wrangler ads were the wallpaper of her teenage bedroom, and she struggles to maintain professional boundaries.Now Rhett and Summer are living and traveling together, and the more time they spend with each other, the more difficult it is to deny their feelings.Flawless was a solid read and I struggled to put it down. I’m glad I saved it for a holiday read because I devoured it in two afternoons. Their chemistry was explosive and so satisfying.📌Moments/Quotes» When Summer learns the cowboy hat rule and doubles down.» Cade lays down some hard truth to Rhett and shows unexpected softness for someone who’s so grumpy.» When Rhett makes Summer take her ex’s call. 🥵🌶️» The moment Rhett outs Summer’s secret about her ex. I literally gasped and threw my hand up to my chest because the result was so unexpected. 🤯🚫 Contains discussions of infidelity (not between MCs), medical malpractice/unprofessionalism, toxic family dynamics, chronic illness rep, sustained injuries.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allie War",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 19, 2023",
                "reviewTitle": "Me encanta",
                "reviewText": "La historia es simple pero bien desarrollada. Esta bien escrita y fluye con naturalidad. Es entretenida y los personajes caen bien.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 5, 2023",
                "reviewTitle": "Must Read.",
                "reviewText": "Uma leitura para se desconectar das complexidades da vida e se deixar levar com um romance intenso (ainda que cheio de estereótipos eróticos).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ArchiArchi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 21, 2024",
                "reviewTitle": "Book condition and review - 5⭐️",
                "reviewText": "”I legit judged this series by its cover and I’m glad i did”.Okyy firstly every-time when summer asked “If this was my last moment alive, how would I want it to be?\" it hit hard but when Rhett asked,it made me smile so wide, i couldn’t hid.🫣Rhett who has that rugged, untamable attitude of “I'm damned if I do give a damn what people say.”Summer the one who’s flawlessly cute and sunshine personified ;There was depth, excitement, action (both on and off the bulls), love and spice.Lastly if I don’t recommend this book, umm no not just this book but this whole series it’d be legit unwise.✨ Choosing each other. Finding each other. Showing up for each other.And everything about the moment is 𝙵𝙻𝙰𝚆𝙻𝙴𝚂𝚂 . ✨",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715+nh6VYnL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kyriaki Triantafyllopoulou",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 5, 2024",
                "reviewTitle": "Great spicy romance",
                "reviewText": "This is the story of Rhett and Summer, a grumpy bull rider cowboy and an optimistic city girl that have to work together for 2 months.I was trying to think what I didn’t like particularly in this book and the truth is I couldn’t find something. I enjoyed the plot, their interactions, their characters, their chemistry, the writing and the messages at the beginning of every chapter.I will definitely read the next one in the series.-Dual 1st person POV-Spice: 🌶️🌶️🌶️Overall: 4.5/5 ⭐️ for me.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}