{
    "remaining_requests": 2242,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Outdrawn-Sapphic-Rivals-Lovers-Romance/dp/B0CPFPJZ36",
    "body": {
        "name": "Outdrawn: A Sapphic Rivals to Lovers Romance",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Outdrawn-Sapphic-Rivals-Lovers-Romance/dp/B0CPFPJZ36",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41PMq4OELdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/511G13RdWKL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Deanna Grey",
            "link": "https://www.amazon.com/Deanna-Grey/e/B08KWJV443/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 752,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            ""
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "It isn’t always lonely at the top.Noah Blue’s finally got her foot in the door. After clawing her way to the top of the charts with her webcomic, she’s garnered enough attention to earn a full-time position at a comic company re-launching their cult classic comic: Queen Leisah.Queen Leisah is predicted to be an instant bestseller with movie deals already in the making. Things are falling into place. There’s nowhere to go but up…as soon as she gets one person out of her way.Sage Montgomery has always been the best artist in every building she’s stepped foot in. Raw talent’s gotten her webcomic to the top of the charts every month for the past eight years. She’s been the best for as long as she can remember. Sure, her career has plateaued but that can be fixed with a big, mainstream comic.She was promised full creative control over Leisah. Instead, she got a shared credit with the one artist who’s been breathing down her neck since college. The one artist who has a fighting chance of being better than her. Sage and Noah have to work as a team — or, at least appear to work as a team. They thought the hardest part of the relaunch would be drawing together. But that’s easy in comparison to resisting their feelings for each other. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CPFPJZ36"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Deanna Grey (December 3, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 403 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8987895542"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 1.01 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,832 in Books (See Top 100 in Books) #260 in Black & African American Romance Fiction #377 in LGBTQ+ Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 752 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "theladysparks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXGVJ7G445BZSH7DV6PLK6L5L4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R307SZ3AACDXIW?ASIN=B0CPFPJZ36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars likely my favorite read of this entire year",
                "reviewText": "Noah Blue has finally made it to the big leagues with her webcomic's success, as she lands a full-time job at the company responsible for the relaunch of the cult classic Queen Leisah. The comic is expected to be a smash hit, with movie deals already in the works. Noah's career is taking off, but there's one obstacle standing in her way.Sage Montgomery's natural talent has brought her to the top of the charts for eight consecutive years. Although her career has hit a plateau, she believes that working on a high-profile, mainstream comic will help her breakthrough. She expected complete creative control over the Queen Leisah relaunch, but instead, she must share credit with an artist who has been her rival since college. This artist has a real chance of surpassing her in skill.Sage and Noah must put their rivalry aside and cooperate, or at least make it appear that way. They thought the biggest challenge would be working together, but the real challenge turned out to be falling in love.Touching her was like diving into a warm pool, the heat soothing yet close to being unbearable. I wanted more, but I wasn’t confident I'd be able to handle more. That I was worthy of more.This book was probably one of the cutest books I have ever read and I'm so glad that I picked it up so early in my 2024 reading year because now I get to spend the rest of 2024 shoving it at everyone I know because this is a book I need every person to read. If you look at my entire January wrap-up and decide to only take one of my recommendations, let it be this one. It will leave you feeling all of the things and I don’t know if there is a cuter couple than Noah and Sage.I'll start my talking points with Noah, a fellow people-pleaser who worries a lot internally about whether or not she belongs at her new job with people she sees as the best of the best. I related to her for the people-pleasing aspects and it broke my heart to hear how her family talked about her art career. I absolutely loved her personality and if I could have a fictional character go shopping with me and help me pick out outfits because her style and overall vibes were immaculate. I loved the realness of her struggle to the top and the reality of what pushing yourself like that can be like.And then there is Sage, the oldest daughter who is literally taking on the entirety of taking care of her family on her own shoulders and feeling like she needs to be in control of everything all of the time, also super relatable for me personally. Sage’s growth throughout this book was probably one of my favorite points. The healing journey that she goes on throughout was inspiring and really beautiful which had me emotional at times. I loved the realness of how burnout was spoken about throughout this book. And I especially loved the way that her bisexuality was talked about in the book and how it can feel like people expect you to just pick a side.This book really delivered the rivals-to-lovers aspect of things and I really appreciated the term rivals being used as opposed to enemies because it just fit them so much better. The way that they started in direct competition with one another only to realize it shouldn’t have been one to begin with and the two of them just rooting for each other even at the expense of their own losses was just absolutely beautiful. Their chemistry as a couple was off the chart and from start to finish I was rooting so hard for them. I appreciated how open and direct they were with their communication and how their friend group grew closer and helped along the way.Outdrawn was seriously so cute and I know I’ve already said it but I can’t help but use that word when describing this book. I definitely recommend it to literally everyone and cannot wait to read more of Deanna Grey’s books! - rivals to lovers- sapphic romance- bisexual rep- lesbian rep- Black romance- comic book artists main characters- workplace romance- banter for days- slow burn- lots of pining- opposites attract- grumpy/sunshine",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Calixte",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENUIVIVF626J6477BPVUT3TZ2FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NU8R22S7WD7U?ASIN=B0CPFPJZ36",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars A refreshing romance read after a recent stent of mediocre reads",
                "reviewText": "Well to be quite frank, over the last month or two, I've downloaded a ton of free romance books, got to love Kindle Day, with that being said I kinda can hit a snag as far as reading a ton of books that are meh as in the author delivering something short and sweet and free. And this book, I felt like the author took time to invest us in the back story to make an enemies to friends Trope really, really work and feel flushed out and .... Hmm not as dimensionaless as I've been enduring.Of course this book isn't free unless you have Kindle unlimited, which I do so maybe that's why I'm kind of lumping it into some of my Kindle day reads because I didn't pay anything for it. Even though of course I did with the subscription. It just felt refreshing. Now does it mean that the story didn't have flaws... it did.That comes in the form of the sex. If we were to give like a chili peppers rating on how steamy it was. I will give this about a notch over Pg13 as far as how substantial and how much the author was able to kind of, I don't know, give us the eemf. I love the consensual stuff. It was great but it... I don't know, something just felt like it was missing. like how in the photo booth scene in this story describes a kiss. It could have been better.But overall, I enjoyed the story",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Crispy pages ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH2WO2R6SYREITCGT3TN5NFUBAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZE1JKHJH6JCX?ASIN=B0CPFPJZ36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars 4.5 SO CUTE",
                "reviewText": "Sapphic rivals to lovers?? Family angst???I often wonder why I even pick up contemporary romance or dark romance stories because they almost always disappoint. Either it’s too much hetero nonsense or boring plotting but this book makes me think make it’s not the genre, it’s the books I’m picking up.I am so in love with the main characters, I loved the witty banter and jabs between these too and also how they sweetened over time. The dialogue was too cheesy for the most part ( more on that later ) and reluctant working together in forced proximity was *chefs kiss*The family angst was in perfect balance with the romance and felt so relatable, I loved to see the development of both characters learning to stand up to their parents. AND ( spoilers ) THAT ONE SCENE WHERE SAGE TELLS NOAHS FMAILY TO GIVE HER RESPECT AND LET HER FINISH HER SENTENCES BEFORE BUTTING IN??? Weak in the knees.Weak in the knees.The smut was perfect( SO MUCH EXPLICIT CONSENT !!! ) , but I think for most people they will want more than we got, especially when the last 10% of the book was a little.. drawn out? ( pun absolutely intended ) in fact the ending being a little slow and out of balance with conflict was one of the only reasons I didn’t give this a full five stars. My other nitpick was that a small portion of the dialogue and the carnival date was a little cheesy. My expectations got higher as the book went along, but once they started dating the clever dialogue got a little too cheddar for me.Overall I would 100% recommend this book and I could see myself re-reading this one or picking up other books by this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Neighbour Becci",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2024",
                "reviewTitle": "rivals to lovers!",
                "reviewText": "College rivals, to workplace rivals, to LOVERSSSSSSSS.This was a slow burn, but the writing was good so I didn’t care as much as I normally would.Comics! Competitions! Fair rides and food! Family issues!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manuela Núñez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 16, 2024",
                "reviewTitle": "Buen libro para pasar el rato.",
                "reviewText": "Sinceramente este libro me enganchó bastante rápido, es simple y no requiere estar pensando demasiado, el a nivel de inglés es fácil de leer sin palabras demasiado complicadas.La historia es buena aunque en ocasiones se apresuran demasiado en ciertas tramas, me gustó la representación en cuanto a la puesta de límites y los dramas familiares, los personajes también tienden a hablar de sus problemas en vez de exagerar en un drama innecesario lo cual lo hace bastante maduro. Dentro de todo una lectura recomendada para destapar un bloqueo lector.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TMD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "I love these characters and their love!",
                "reviewText": "This book focuses on the main characters and they are well developed and so real. This is such a sweet story with a little bit of spices. I loved it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}