{
    "remaining_requests": 2147,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Diamond-Fire-Hidden-Legacy-Novella-ebook/dp/B07BK3M7V7",
    "body": {
        "name": "Diamond Fire: A Hidden Legacy Novella",
        "price": "$4.99",
        "originalPrice": "",
        "rawPrice": 4.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Diamond-Fire-Hidden-Legacy-Novella-ebook/dp/B07BK3M7V7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81RFNSuZE7L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ilona Andrews",
            "link": "https://www.amazon.com/Ilona-Andrews/e/B001RXSCKY/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 7490,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07BK3M7V7"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Avon Impulse (November 6, 2018)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 6, 2018"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1123 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 104 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#79,677 in Kindle Store (See Top 100 in Kindle Store) #1,192 in Paranormal Vampire Romance #1,527 in Vampire Romances #2,517 in Paranormal Werewolves & Shifters Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 7,490 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sheila M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEKDE4QV6FQYX4JVAPAQQCV2D6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I953ZIK1KOG8?ASIN=B07BK3M7V7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Novella Transition between Nevada and Catalina",
                "reviewText": "FINAL DECISION: Definitely not as intense or as compelling as the books in this series, this novella really introduces Catalina as her own person in the series and provides a foundation for her own books. The novella is funny and makes me smile.THE STORY: Catalina Baylor is looking forward to her sister Nevada's wedding. Then her sister's future mother-in-law unexpectedly asks Catalina to meet with her. Catalina is told that the family's traditional tiara is missing and Catalina is asked to find it without letting Nevada know. Catalina agrees to search which is complicated by Rogan's family who are prime suspects. At the same time, there is also a bride to pacify, and it also seems that someone is out to commit murder.OPINION: Like the other books in the Hidden Legacy, this novella has a combination of humor and action. This novella doesn't have a romance (except for Rogan and Nevada's wedding). Instead, it is an introduction to Catalina's voice. It is really a prequel to Catalina's trilogy and closure to Nevada's trilogy.The plot was good for a novella (lacking the depth and complexity of the novels), but what I really loved about this story was learning more about Catalina, her magical talent, and what problems she faces. Catalina is still a teenager in this story, and by the end, her trajectory toward her adult life seems clearer.WORTH MENTIONING: Nevada doesn't make an appearance here except through others' observations of her.CONNECTED BOOKS: DIAMOND FIRE is book 3.5 of the Hidden Legacy series. The novella operates as a transition between Nevada's trilogy and Catalina's trilogy. While it is better to read the series in order, this book can operate as an entry point for new readers who want to continue with Catalina's story.STAR RATING: I give this book 4.5 stars.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEN5L5NWSI2IPLPSEUPOVT7Q55PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZSL1PUKLUQBD?ASIN=B07BK3M7V7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2018",
                "reviewTitle": "5.0 out of 5 stars another fantastic addition to this wonderful series",
                "reviewText": "Diamond Fire by Ilona Andrews is a novella in their Hidden Legacy series. I am a big fan of our Ilona Andrews writing duo (Ilona and Gordon Andrews), and have loved every single book/series that they have written. Everything they write is absolutely amazing. I loved loved the Hidden Legacy series, and loved Nevada and Mad Rogan; praying that Andrews would be able to continue with this world and the wonderful characters we fell in love with. Needless to say, I am thrilled this series will continue, and soon we will start a trilogy focusing on Nevada’s younger sister, Catalina.In Diamond Fire, we get to spend more time with Catalina, as the story will be centered on her in the new trilogy. Nevada and Connor are getting married, and because Nevada keeps firing her wedding planners, Catalina and Arrabelle now have the burden of planning this wedding. While all this is going on, Conner’s mother has invited all their relatives to stay prior to the wedding. Shortly after their arrival, a precious family heirloom (diamond tiara), which Nevada is expected to wear (all past Rogan brides have worn the tiara), has been stolen, and Catalina is asked by Mrs. Rogan to find the Tiara and the culprit.I loved watching Catalina learn to use more of her powers, as well as controlling them. She is a prime, with siren like powers, making everyone love her, and now she is able to change things, and make them forget. It is a great way to learn the truths and secrets. Catalina is turning into a wonderful heroine, different but strong like Nevada. I can’t wait for her trilogy.What follows is finding the secrets hidden by the Rogan relatives, and Catalina with help from her family discovers many. When Catalina has to reveal the betrayals and secrets, everyone will be present. There is a slight cute surprise for part of the revelations, and Catalina was so good in revealing her findings.I loved Mrs. Rogan, who has her own powerful and dangerous powers, and I really look forward to her playing a bigger role with Catalina in the future books. Diamond Fire was a quick and fun read, and wonderful to spend time with all the characters we have come to love. Diamond Fire was a perfect way to bring Catalina to the forefront, and to give us all a wonderful glimpse at Nevada and Connor getting married. Hidden Legacy is a fantastic series, wonderful characters, and this novella gives us a taste at what we can look forward to in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shannon Scollard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 17, 2020",
                "reviewTitle": "Who doesn't like a wedding?",
                "reviewText": "I love how Ilona Andrews follows through with this story line!Many times a story arch will end with the engagement of the MCs. They face terrible hardships, fall in love, someone proposes and Boom they live happily ever after - the end!Not this series! We get to see Nevada and Connor get married! Squeeeee!But not so fast... there is treachery and secrets lurking in the grooms family! Who is there to follow through while the bride is busy? Her sister! Catalina shines in this book. She grows and we get to see her as a developing character.Love this world and this book is no exception. Well written as is to be expected from the author team!Can't wait to read the next one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 27, 2020",
                "reviewTitle": "Great series",
                "reviewText": "Hidden Legacy is one of the best series in the urban fantasy genre that I've ever had the pleasure of reading. I just love the couple Nevada and Rogan. Thank you Ilona Andrews!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tatiana santillan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 11, 2019",
                "reviewTitle": "Amazing as always",
                "reviewText": "I love this author, everything i hope and more, always love it, and always will, cant wait for next work",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on December 4, 2018",
                "reviewTitle": "Excellent",
                "reviewText": "Sooooo good. The right amount of detective stuff, intrigue, mistery and cute with enough twists and exposing the perfect amount of powers to give you an idea of what the future holds, read through the night because I couldn't let it go. Awesome",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "La veneziana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 30, 2018",
                "reviewTitle": "Primi passi della \"Sirena\"",
                "reviewText": "Dopo aver completato la trilogia dedicata a Nevada Baylor e Connor Rogan, gli autori hanno deciso di regalare agli affezionati lettori ancora un po' di tempo assieme ai personaggi della serie Hidden Legacy e con questa breve storia accendono i riflettori sul membro più defilato della numerosa e simpatica famiglia di Nevada: sua sorella Catalina.Nei tre romanzi precedenti (da leggere assolutamente prima se si vuole apprezzare questo racconto), le vicende hanno portato ad alcune rivelazioni inaspettate e al fidanzamento dei due protagonisti.Questo racconto prende il via dall'organizzazione del matrimonio di Connor e Nevada, con l'inserimento delle due sorelle di lei quali eroiche wedding planners. Solo che, essendo il matrimonio fra due potenti Case di Huston, il lavoro per l'organizzazione non è solo un percorso ad ostacoli fra i desiderata degli sposi e le possibilità offerta dalla location, ma è anche e soprattutto una gara a dribblare rischi e pericoli ben più gravi in cui sono coinvolti, a vario titolo, molti membri della famiglia di Mad Rogan.In questo scenario, la quieta, ma potente Catalina si arrabatta per sopravvivere alle esigenze organizzative e si ritrova a sondare l'estensione e le nuances dei suoi poteri.E' ovvio che nei prossimi libri a lei dedicati vedremo lo sviluppo della personalità di questa giovane Sirena; nel frattempo gli autori introducono personaggi molto vivaci che finiscono per rubare la scena: la mamma di Connor Rogan è una di questi.Il resto sono beghe fra parenti in cui emerge con forza la fragilità delle persone con poco potere magico all'interno di una Casa ed i modi in cui esse cercano maldestramente di compensare. Al riguardo, la soluzione del piccolo mistero legato al furto del diadema, ha il sapore di un riscatto poetico.Adesso mi tocca aspettare il 2019 per saperne di più su Catalina & Company!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}