{
    "remaining_requests": 2051,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ralph-Dukedoms-Secrets-Book-1-ebook/dp/B0C97B3V2T",
    "body": {
        "name": "Ralph: Historical Regency Romance Novel (The Dukedom's Secrets Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ralph-Dukedoms-Secrets-Book-1-ebook/dp/B0C97B3V2T",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71K7wpojveL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Edith Byrd",
            "link": "https://www.amazon.com/Edith-Byrd/e/B08L657H8D/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 43,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A Duke torn between duty and love. A servant mother with a dangerous secret. A daring plan to protect them all.After a great tragedy, Ralph is facing the difficult task of taking over the dukedom, turning into the New Duke of Lancaster. However, a dark secret and a notorious enemy are threatening to ruin him and his dukedom... A servant girl carrying a secret royal baby in her belly.A trusted advisor having his own hidden agenda.A title, Ralph was never meant to inherit.A promise to his late brother he can hardly keep.Navigating the delicate balance between his obligations and his feelings gets harder and harder, as Ralph is torn between his sense of duty and his heart.Until a Lady appears... Miriam, a young woman with a secret of her own, hired to be his new housekeeper.She is the one who can buy him time... by forcing him to marry her! But is she really an ally? Or just another dangerous siren eager to destroy him?Ralph must act quickly or everything will be lost.f you are a fan of Bridgerton and Julia Quinn, you won't be able to put this book down.Scroll up. Grab your copy. Begin your adventure today!Praise for Ralph***** Well written, full of intrigue, mystery, emotions, love, drama, twists and secrets. So much going on from the start of this book that keeps you turning the pages to get to the end.Can't wait for William's story. I recommend it to others.***** An amazing story where everyone is out to deceive. So many twists and turns, how will it ever turn out well. Yes, it does, with a sequel to follow. Enjoy figuring out all the possible twists.***** I lost my sleep! There were so many twists and turns in this story--deception--mistrust--lies--. One man turning everyone against each other all for his own good. Of course it all turns out good in the end but getting there made a wonderful story.***** his is a delightful book! You can see how the characters all develop and interact with each other. Another book by Abby that you don't want to miss out on.\"***** What a thrilling read. I enjoyed it immensely. Well written and a jewel of conflict, love and longing. A really good read. A story of redemption.***** I am in love! Ralph isn't like other Dukes. He has a heart. Teresa is in a situation, but Ralph and Miriam are there to help.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C97B3V2T"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 16, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1995 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 308 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#40,819 in Kindle Store (See Top 100 in Kindle Store) #208 in American Historical Romance (Kindle Store) #234 in American Historical Romance (Books) #671 in Victorian Historical Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 43 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Meet the Duke, Ralph Oakley A dark secret and a notorious enemy are threatening to ruin him and his dukedom... She is the one who can buy him time... and make his heart of stone beat faster again... But is she really an ally? Or just another dangerous siren eager to destroy him?",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/acb284cc-cd4f-4f46-bd72-7626f8fcc727.__CR0,0,1024,1024_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Meet Lady Miriam Kendall Once upon a time she was a Lady... Now she is a servant. A housekeeper in a manor full of secrets. But for him she can do anything... Even marry him out of convenience... But what if she longs for more...?",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/fd105006-89dd-4340-8f4e-2b423f7d5fc2.__CR0,0,1024,1024_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Meet the Rest Meet Teresa Baker The secret baby in her belly, can change the whole Dukedom's fate! But all she wants is to protect her unborn child... Meet Connor Edge His duty is to protect the Dukedom. His true desire is to gain power! And this rebellious Duke is just another obstacle in his way!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/1d7d70a7-4ccf-4a15-8535-bd1d3288ab97.__CR0,0,1024,1024_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/e925acf0-134e-4b1f-94a8-9d98928d7534.__CR0,0,1024,1024_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Ralph William Can be Read as Standalone ✓ ✓ Marriage of Convenience ✓ ✓ Secret Baby ✓ - Scandal ✓ ✓ Concealed Identity - ✓ Love Triangle ✓ ✓ Pretend Courtship ✓ - Revenge ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/fc7ed8c2-d6ba-4298-8421-0efd0638836f.__CR0,0,600,180_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/acb284cc-cd4f-4f46-bd72-7626f8fcc727.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/fd105006-89dd-4340-8f4e-2b423f7d5fc2.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/1d7d70a7-4ccf-4a15-8535-bd1d3288ab97.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/e925acf0-134e-4b1f-94a8-9d98928d7534.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/806580be-0755-49b7-b408-0344e7cf7551.__CR0,0,800,1600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/814b516d-de4b-4d9e-a790-2e5eea014a9c.__CR0,0,800,1600_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marie CampbellMarie Campbell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUALAECN37CZNZVW6L7GQOT5YUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYRS8CAN61DC2?ASIN=B0C97B3V2T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Give Me More!",
                "reviewText": "This book had all kinds of emotions happening. Sadness, grief, fear, surprise, happiness, excited, love…you name it. This was a new genre for me and I absolutely loved it! I’ll be looking forward to reading more from Edith Byrd.The Duke of Lancaster does not survive the war to come back home to Burnley Abbey. His secret love, a servant, is left behind to deal with her pregnancy alone. Ralph, the Duke’s brother, now has duties to fulfill, but still needs to grieve his brother’s passing before he takes the roll of Duke of Lancaster. Teresa, the late Duke’s servant love, is pushed out of Burnley Abbey to as not cause scandal. Insert Miriam of Podmore Grange who runs into Teresa on her way out. Ralph runs away to Briar Heights and calls on Teresa to stay there so he can take care of her. Miriam’s family isn’t doing too well so she is forced to get a job which so happens to be at Briar Heights. Miriam and Teresa meet again which makes Miriam happy so she can help her through this pregnancy. The secret of the baby’s father is let out of the bag and now the three come up with a plan to keep the late Duke’s lineage live on in safety. As Ralph is away from Burnley Abbey, Connor the land agent is left in charge. Conniving and manipulative, he finds the new Duke and weasels his way in between them all causing chaos, mistrust and madness. Can they look through Connor’s lies? Does the Duke and Miriam stay together? Can they keep this baby a secret? Is Teresa left to fend for herself?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71KPtWXJWCL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JustJeri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHBLAHCHQSSHGMWMM23QNR7XAKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BC7B1G19GL2M?ASIN=B0C97B3V2T",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Ralph and Miriam",
                "reviewText": "This sweet, but turbulent romance involves two main characters who are each dealing with their own personal adversities, and find that fate brings them together. The story primarily occurs in a secluded estate where three people’s lives unexpectedly meld together. A strong bond forms, but when a nefarious character has his own agenda, separations occur as each looses the necessary trust they had each established. This is a great story, and had an interesting amount of strife that each character brought to the story. Though I found the Duke compassionate and kind, I also thought he lacked courage and grit to fight the necessary battles to find solutions and happiness for all characters. I really liked how the author created the heroine, with her strong temperament, intelligence and selfless acts of kindness. There was plenty of drama, intrigue and secrets that kept the story flowing smoothly. Never let it be said, such a strong villain will ever disappear. The author did an outstanding job in deliberately creating this character in such a way, that it is easy for the reader to despise, and dread every scene he was in. A must read.First major error, typo on book cover in where the title misspells “dukedom”. Also editing issues of missing words, incorrect names for characters, and missing punctuation. Also, it would have been helpful if there was a bigger space break between paragraphs when moving to a new scene. With no space between paragraphs when changing scenes was confusing. I received a complimentary ARC, but I am voluntarily offering my personal opinion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ginger271",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4U2KV7YX3B6NHYGS2WXCO3MXXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R78CMVGLH5VOU?ASIN=B0C97B3V2T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars STRANGE TWIST OF FATE",
                "reviewText": "Ralph’s brother, Duke of Lancaster is killed in military fighting in Corsica. Ralph given his brother’s personal effects when he took the body for burial at their estate in England including his brother’s diary. That is a twist of fate presented in the book Ralph: The Diary prequel to this story, so the spare became the heir. At estate Ralph approached by Conner Edge, the steward of the estate and also a man Ralph’s brother did not trust, although they were all reared on same estate. Trust needs to be earned.Miriam’s father is baron on nearby estate that became financially destitute. Miriam is an altruistic woman that would not let reduced circumstance put her into self-pity, nor stop her efforts to help her family. She applied for employment as a maid unaware it was where Ralph took up residence. Love begins to develop, but Conner, corrupted by bitter envying and blackened heart wants of cause as much difficulty as possible using division and conflict. Conner approaches Miriam and the other maid, who also had a secret, at this cottage intimidates them generating fear in order to succeed at his final goal. Ralph needs to step-up into his title and responsibilities, but his mourning for his brother is major obstruction. Tie in characters from this author’s book Henry helps the flow of the story. Extra chapter leads into next story in series. The Dukedom’s Secrets is a captivating subtitle for this series.Received ARC copy of story and voluntarily posting a review. Thank you Edith Byrd",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda Liggins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQ34QP4LTKX7B4WR3B2KB7ED74A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G6YJ3SUNM3EI?ASIN=B0C97B3V2T",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "3.0 out of 5 stars Thank goodness for the dowager!",
                "reviewText": "It's nice to read about strong women in historical novels ! Poor Ralph was a sorry excuse for a Duke and unfortunately I had a hard time sympathizing with him. I get he was mourning his brother and had no desire to be the duke but running away wasn't the answer.I'm a visual person and I hate it when the author tells you nothing about the characters looks. One of the reason this book grabbed my attention was because of the pictures of the beautiful pictures of the characters. When I have to use my imagination, I lose interest and the story becomes hohum to me.I gave it a 3 even though there were type's but not too bad but it was an easy read but I've read so much better!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 1, 2024",
                "reviewTitle": "Secrets and intrigue",
                "reviewText": "I loved the fact that Ralph had a great desire to help and protect his brother's unborn child and it's mother while also struggling with the death of his brother and suddenly becoming duke. Dark shadows are lurking in the corners seeking to reveal the scandal of a maid and the unborn son of the new Duke's brother.I can't wait for the next book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luna Robins",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 27, 2024",
                "reviewTitle": "a different kind of story",
                "reviewText": "I enjoyed that this book, is different to the usual historical romance. Unfortunately, I found the hero was not very hero like. He was a weak man couldn’t make decisions and questioned everything. He had had no backbone, but the heroine was really good.She made up for the fact that he was hopeless. There is a lot of repetition, repeating the storyline quite often which was annoying .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}