{
    "remaining_requests": 2046,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Happy-Place-Emily-Henry-ebook/dp/B0B7L29TB7",
    "body": {
        "name": "Happy Place",
        "price": "$11.99",
        "originalPrice": "",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Happy-Place-Emily-Henry-ebook/dp/B0B7L29TB7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Le3ro5dSL.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/A1-sJhhQMjL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Emily Henry",
            "link": "https://www.amazon.com/Emily-Henry/e/B01BW7AX4W/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 67854,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B7L29TB7"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (April 25, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 25, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2067 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 395 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ B0C411XRPL"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,258 in Kindle Store (See Top 100 in Kindle Store) #84 in Women's Romance Fiction #130 in Romantic Comedy (Kindle Store) #144 in Romantic Comedy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 67,854 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a783e40a-e542-4c3f-86c0-d2182a9aa4b0.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0152cf09-c05a-4b1f-ae72-c1fbd45c9f41.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c433003a-f608-41b6-8b8f-62184b49e118.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/baba9fd6-6936-4db2-9c1b-cd7acabf9176.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stacey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOTCCU4TYB3XDGBCAUSCD6GHPUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M7YQ1F6FAJZG?ASIN=B0B7L29TB7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars Emotional Roller Coaster",
                "reviewText": "I don’t normally read romances with no spice, but I went into this one blind. I’m glad I did because if not, I would have missed out on this emotional and heartwarming story.A group of friends who all met in college have stayed close for years post graduation despite them all living all over the country. They make it a point to get together in Maine once a year. This year is different for Harriet. Her and Wyn had been together for 8 years and engaged for the last several. However, 5 months before their yearly trip, Wyn ends their engagement in a four minute phone call. Harriet can’t bring herself to tell even her closest friends, but decides she will tell them when they’re all together in Maine. She shows up to only to find Wyn is there too, and two of their other friends announce they’re engaged and getting married at the end of the week. Harriet and Wyn decide they can’t ruin their friends’ wedding by telling everyone they broke up, so they agree to pretend they’re still together.It feels wrong to call the other characters in this book side characters because they were an integral part of this story. All of the characters were well developed, and the interaction amongst them was beautifully written.This book runs the whole gamut of Harriet and Wyn’s relationship. It takes you on an emotional roller coaster switching between past and present tense where you watch them fall in love and then watch it all fall apart.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg Barlin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI2W7BQ6OCK26MJFZPU6FNYJG5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9A34YNSSGHSR?ASIN=B0B7L29TB7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Henry's most mature and complete novel to-date; it might also be her best",
                "reviewText": "I approached Happy Place with some caution; where previous Emily Henry books shot straight to 5-star ratings, I had a couple of reader friends suggest this one was a notch below previous efforts. And so perhaps it was my tempered expectations going in, but Happy Place turned out to be a very happy surprise for me.The novel opens with our narrator, Harriet Kilpatrick, en route to her annual week-long excursion to fictional Knott's Harbor, Maine for their Lobster Fest. Since her first day of freshman year at Mattingly College, when fate put her in a room with Sabrina Armas and Cleo James, they have been her best friends and surrogate family. Sabrina's father owns a lake house in Knott's Harbor, and the trio has been spending the week of Lobster Fest there ever since graduation. It's a chance to reconnect and relive old times, even while life continues to move forward and threaten to drive a wedge into their friendship.And, of course, over time they have added significant others. Eight years post-graduation, their group of 3 has swelled to 5, to include Sabrina's beau Parth and Cleo's longtime girlfriend Kimmy. Noticeably absent this year is Harriet's fiancé, Wyn, for one very good reason: he is no longer her fiancé, and hasn't been for the last five months. There's one problem, though -- neither Harriet nor Wyn have told their friends. And when Harriet arrives, there's another problem: Wyn is there.What follows is a tension-filled week where Harriet and Wyn present a \"nothing is wrong\" front to their friends so as not to ruin the week, while remembering all of the things they love about each other and beginning to drift back together. Henry does a really nice job of bouncing between the present week in Maine and flashbacks that let us see the evolution (and dissolution) of Harriet and Wyn's relationship. We get to see them fall in love, and we get to relive their rapid why-would-they-do-that breakup. And we get to see them try to reconnect, while also trying to balance what their heart says with the pressures of careers, the expectations of friends and family, the challenge of a long-distance relationship, and the need for happiness outside of what a partner can give you.Like with all of Henry's novels, Happy Place has the trademark witty banter and humor I've come to expect (and, it turns out, I can start to predict -- I was completing punchlines for characters while listening to the audio book). I appreciated that this was more nuanced and serious than just a \"let's watch them get back together and swoon while they do\" rom-com. At one point Sabrina says, \"God, I've been crying a lot this week.\" to which Harriet replies, \"Me too.\" There are lots of tears, and with good reason. Happy Place is less predictable and a bit darker than Henry's previous novels, and I think it's better for it.After being late to the Emily Henry party and stumbling upon Book Lovers last year (my #9 book of 2022), I went back to the start earlier this year and read Beach Read, Henry's first novel. In my review, I noted that it lacked some of the polish of Book Lovers, but that was fun to be able to go back and see where she started, so that you can appreciate her progression and growth as a novelist. I think Happy Place continues that progression, and for me it might be her most complete book yet and one that demonstrates her continued evolution and maturity as an author.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFR6TDDCPWDVT4FXE3SQRPHIR46Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G60E07M3COCR?ASIN=B0B7L29TB7",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 24, 2023",
                "reviewTitle": "3.0 out of 5 stars 2.5 stars",
                "reviewText": "I thought this book was a big let down—especially after all the raving reviews. There will be spoilers in this so please don’t read ahead if you don’t want to know.As I started getting into this, I thought this was going to be a book about a guy who was trying to get his girl back and soliciting his friends to help him. I was all for that because I wanted a good grovel for the heartless way he broke up with her after eight years. But that’s not what this was about at all.They decide to act like they’re still together so they don’t ruin their last friends trip. I got the sense that Wyn was miserable and was formulating a plan to get her back— but no, turns out he’s totally fine. He even tells her that he’s finally happy. She’s still utterly devastated though. He gives her tons of mixed signals. But it takes forever for everything to finally come out. SHE’S the one who has to go to him!!! Even after pouring her heart out to him, he tells her he’ll always love her but they can’t be together because she needs to finish her residency in San Francisco (he was miserable there) and he wants to stay in Montana with his family. I get that —that’s ok. But why couldn’t they do long distance for a couple years and she could come to him a be a surgeon in Montana??? (I felt the past chapters did a great job showing how deeply these two loved each other—and honestly I kind of hated him for walking away from her so easily.)So he just keeps on breaking her heart over and over during this friends trip. And at the very end of the book she gives up EVERYTHING to be with him In Montana. I’m totally ok with her going to Montana, but she gives up being a doctor to do pottery??? She actually says she’s just going to pay back her hundreds of thousands of dollars in medical school loans by doing pottery!! That was so ridiculous and unbelievable. Why wouldn’t she just do something in the medical field????Anyway, this book just bothered me so much because he was totally fine walking away from from her. He never groveled or even regretted his decision— and then she was the one who gave up everything to be with him. He gave up nothing. Even at the very end, I felt he would have been fine if they never got back together.",
                "reviewVotes": "86 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "hanaa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 9, 2024",
                "reviewTitle": "Good",
                "reviewText": "Good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CarocientaCarocienta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 11, 2023",
                "reviewTitle": "Este libro es una joya.",
                "reviewText": "Creo que este libro se acaba de convertir en mi favorito de la autora.La trama principal se centra en la relación de Harriet y Wyn intercalando el pasado y el presente. Podemos ver cómo se conocen, la atracción inicial, la devoción, el afecto, la ruptura repentina y devastadora y el presente mientras intentan fingir ante sus amigos que todo sigue bien, mientras cada uno sufre la perdida a su manera.También vemos cómo Harriet conoce a Sabrina y Cleo, luego a Wyn y, como se vuelven los mejores amigos y cómo pasan una década juntos volviéndose como una familia.Harriet me ha encantado, es una mujer fuerte e inteligente pero también alguien sensible con el corazón roto mientras intenta mantener a flote su vida como residente en un hospital y cumplir con las expectativas de su padres. Me gusta que este libro además del romance trata de cómo ella crece como persona y encuentra lo que le hace feliz pero también lo que no la hace feliz y aprende a soltarlo.Sin duda Wyn es el que ha robado mi corazón, el tipo es lindo dese el primer momento con su encanto juvenil y su coqueteo constante pero a medida que la historia avanza también descubrimos sus miedos e inseguridades. Me encanta que sea tan genuino y abierto al momento de expresar sus sentimientos y sobre todo que él también encontrara paz consigo mismo, su carrera y su vida en general.La relación de Wyn y Harriet me atrapo desde el inicio con su química natural, viendo cómo su relación va creciendo, me partieron el corazón con su ruptura pero también lo sanaron, demostrándonos que con el paso de los años cambiamos, nuestras prioridades y sueños también cambian pero la comunicación asertiva es la clave en toda relación. Mientras leía no podía dejar de pensar que quería que tuvieran su final feliz porque lo merecían muchísimo.Siento que este libro golpea una fibra sensible también con las amistades longevas, la gente cambia con el tiempo y no se puede seguir viviendo cómo 10 años atrás pero cuando las personas son importantes para ti siempre se encontrara la manera de conservarlos en tu vida. Este libro también trata sobre ese cambio de adulto joven al inicio de los veintes con un montón de planes y sueños a adulto de los 30s donde tu vida ya esta más plateada y las cosas son mas calmadas.Me ha gustado que este libro trata relaciones tanto entre amigos como de pareja (tanto hetero como una lesbica) todas diferentes pero todas sanas, con sus altibajos pero bien planteadas.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81lQoiIhYLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 3, 2024",
                "reviewTitle": "No one writes like Emily Henry",
                "reviewText": "She's done it again! A beautifully crafted romance but because it's Emily it's never just that. You deserve to read this book. It's a walm hug.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rituparna Ghosh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 15, 2023",
                "reviewTitle": "this brought me to tears",
                "reviewText": "Love love love the book, how it seamlessly moves between real place and happy place, past and present merged into one yet distinct to make a beautiful picture. I finished it in a day, so engrossed I was in Harriet’s world",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grace ✨",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 26, 2023",
                "reviewTitle": "just a perfect book.",
                "reviewText": "I was waiting to read Emily Henry’s last book because I already knew I would have loved it too much and felt sad to finish too quickly.A great and modern love story ❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}