{
    "remaining_requests": 2295,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Girl-on-Train-Paula-Hawkins-audiobook/dp/B00QXTYDNC",
    "body": {
        "name": "The Girl on the Train: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Girl-on-Train-Paula-Hawkins-audiobook/dp/B00QXTYDNC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51sKhh VEML.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Paula Hawkins",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Paula+Hawkins"
        },
        "brand": "Paula Hawkins",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 492672,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The number one New York Times best seller, USA Today Book of the Year, now a major motion picture.The debut psychological thriller that will forever change the way you look at other people's lives.Every day the same.Rachel takes the same commuter train every morning and night. Every day she rattles down the track, flashes past a stretch of cozy suburban homes, and stops at the signal that allows her to daily watch the same couple breakfasting on their deck. She’s even started to feel like she knows them. Jess and Jason, she calls them. Their life - as she sees it - is perfect. Not unlike the life she recently lost.Until today.And then she sees something shocking. It’s only a minute until the train moves on, but it’s enough. Now everything’s changed. Unable to keep it to herself, Rachel goes to the police. But is she really as unreliable as they say? Soon she is deeply entangled not only in the investigation but in the lives of everyone involved. Has she done more harm than good? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            },
            {
                "name": "Psychological Thrillers",
                "link": "https://www.amazon.com/Psychological-Suspense-Thrillers-Mystery-Books/b?ie=UTF8&node=10491"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 58 minutes"
            },
            {
                "name": "Author",
                "value": "Paula Hawkins"
            },
            {
                "name": "Narrator",
                "value": "Clare Corbett, Louise Brealey, India Fisher"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 13, 2015"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00QXTYDNC"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,585 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #153 in Psychological Thrillers (Audible Books & Originals) #214 in Women's Fiction (Audible Books & Originals) #402 in Suspense (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "D. D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJNA23PMABHMWD5A6EJ4KBPNUBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z5NKHEEKTEBO?ASIN=B00QXTYDNC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2015",
                "reviewTitle": "5.0 out of 5 stars She keeps reaching into the missing spaces in her memories for those lost hours in hopes of discovering just what happened to th",
                "reviewText": "Paula Hawkins melancholy tell of what happens to the survivor’s of murder victims as they go on living in the aftermath of loss, with their own pathologies and pathos, shines as a hypnotic and nimble new comer in a genre burdened down with rigid rehashing of the procedural tropes in many mystery thrillers.The story starts with Rachel piecing her life back together after being fired from her job. She is living with her flat mate Cathy, pretending to still be employed by riding the train into town each day, and generally snooping in the lives of her neighbors, imagining their specifics and superimposing her wishes on couples in her local park.She’s a lonely, self-loathing alcoholic, approaching the hill’s bend who may or may not have murdered a familiar woman in a blackout fit of rage. She keeps reaching into the missing spaces in her memories for those lost hours in hopes of discovering just what happened to the pretty blonde reported by the local press as missing.Along the way Rachel makes more than her fair share of missteps like attracting police attention toward her as a potential suspect when she really meant to aid the investigation, to identifying the wrong man as the murderer, causing his life undue pain, and even becoming friends with the victim’s husband, which blows up in her face when he confronts her about her lies.The characterizations are spot on. Thirty-somethings, self-involved and reflecting on their experiences to find meaning in their identities and daily lives. Enter Rachel the character with the story’s biggest narrative perspective, filled with angst and despairing after being fired for an alcohol fueled emotional breakdown at work. She looks for meaning in the lives of others and hopes to find someone to love her chubby body and crows feet ridden face.Meagan, the hot blond that everyman wants and every woman wants to be, is in similar shape. Her beauty is better, but her loneliness and longing are equally as strong as Rachel’s. The beautiful thing about Hawkins writing is she portrays these ladies desperate situations with striking visceral-ness. Their thoughts, feelings and perspective lunge from the page and right into your mind as the pieces of a real experience, though virtually distributed through the medium of the novel. In short these ladies breathe and live on and off the page.I would find myself feeling like, “Poor pretty Meagan—so sad.” not knowing that I’d feel less connection to her after I learned what she’d done to motivate her potential murderer.The roles were reversed for Rachel the books protagonist. I thought her quite unappealing at first when I thought she was a depressed and aging alcoholic. But when I discovered that she had several psychological pathologies, I loved her the way I love traffic pile-ups across the median.Memories and how they fade over time is the biggest thematic concept discussed in the pages of The Girl On The Train. From Rachel’s pure blackout, to Meagan’s more nuanced memories of darker days locked within the vault of her lonely feelings we get a cobbled together view of the past life events that motivate the characters’ current actions.Rachel’s cognition issues come from her drunken blackouts that leave holes in her memories. Meagan and Scott, her husband are both driven by faulty memories, either romanticized through distance from the events that inspired them, or due to constant rehearsal that glosses over the truest features from the past, respectively.Loss and how we as people deal with it plays huge in the themes category as well. Rachel as the barren mother turned alcoholic tries to fill the void in her life by helping Scott find his missing piece—just who murdered his wife. But she had in turn lost her dream of being a mother when it was discovered her womb was barren. Scott lost his wife Meagan to the hands of an illusive murderer. Meagan, before dying had lost her way in life due to the deaths of two key people from her past and her resulting disillusionment that sees her seeking to fill that void by cheating on her husband to prove to herself that she is desirable/lovable to men.Rachel’s pathological lying and constant meddling are attributes I loath to see in people I know, but on a character as nuanced and just plain crazy as Rachel, they are the life and breath of this narrative, which plays in the—what-about-the-people-who-knew-the-victim, realm.And that is the fresh air that Hawkins brings to the genre. Every detective mystery I’ve read or even watched in movie theaters shows the detective’s perspective, or the victims—you know through flash backs. This one discusses what happens to those waiting to hear that the police have captured the slayer of their wife, neighbor, or the girl the protagonist obsessed over as they road the train to town.Rachel, as an OCD nightmare stalker/private investigator sizzles as an unexpected suspense novel star who is an unreliable narrator and gets as close as law enforcement would to solving the murder when using their tactics.The author mingles a bit of the lead character’s own paranoia and pathological nosiness into her sincere attempts at exposing the murderer—thereby exonerating herself from the memory gap she has of the night in question. How emotive, cerebral and delicate this thriller truly is.From wondering if Rachel is the blackout killer, to the red herring of Dr. Adbic as the wanted murder, and then back to wondering if Rachel has actually killed Meagan again, I totally bought the slight of hand that author, Hawkins does right before my very eyes.A novelist as skilled at misdirection as she, would definitely make a great up-close street magician. And that’s what the first half of this novel plays out as. A card trick of a tome that kept me wondering who-done-it, while all road lead to the sketchy protagonist in the genre specific trope of the detective did it, but doesn’t remember—this time the detective is a blackout drunk with self esteem issues and a histrionics complex to boot.Read this dazzling New York Times Best Seller and recommend it to all your friends.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAGUARVNEHRBC7NP4JNPL2NZYWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R3QUHW3HIRQZ?ASIN=B00QXTYDNC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2015",
                "reviewTitle": "4.0 out of 5 stars Aren't typecast characters bad? Not in this case",
                "reviewText": "Girl on the Train for writers: a study in suspense and stereotype(I reveal a few plot details but no major spoilers)The book became a bestseller days after publication. It forces fingers to keep turning pages and swiping screens. It has an early Dreamworks option. How did Hawkins do it?As you'd expect, part of the novel's success is simply the expert use of a few well chosen literary devices: an immediate hook that withholds key details, an unreliable narrator, well-timed alternating points of view. What you wouldn't expect is that the character set, as generally one dimensional as it is, could contribute to the mystery as much as it does.Aren't typecast characters bad? Not in this case. To understand why, we have to start with Hawkins' excellent hook.\"She's buried beneath a silver birch tree, down towards the old train tracks, her grave marked with a cairn. Not more than a little pile of stones, really. I didn't want to draw attention to her resting place, but I couldn't leave her without remembrance. She'll sleep peacefully there, no one to disturb her, no sounds but birdsong and the rumble of passing trains....One for sorrow, two for joy, three for a girl...Three for a girl. I'm stuck on three. I just can't get any further. My head is thick with sounds, my mouth thick with blood. Three for a girl. I can hear the magpies--they're laughing, mocking me, a raucous cackling. A tiding. Bad tidings. I can see them now, black against the sun. Not the birds, something else. Someone's coming. Someone is speaking to me. Now look. Now look what you made me do.\"The first paragraph is from the p.o.v. of the murderer, the second from the p.o.v of the victim. Many authors would be tempted to wax eloquent in the opening scene, but it's what you don't know that hooks you. You don't know if the murderer is a man or a woman, you don't even know the victim's gender for sure. You want to find out who was murdered, why, and by whom, but you need to know because of these nine words: \"Now look. Now look what you made me do.\"How self-centered, how childish, how chilling. What kind of a person would say that to someone they'd just killed? Consider a few lines Hawkins could have used instead to less stunning effect.\"You got what you deserved, b&^%#\" Meh. Just another revenge story.\"How could you do that to me, Megan?\" or \"I'm so sorry.\"Slightly better, as several suspects could have said this, but not hair-raising, still clichéd, and reveals the victim when doing so isn't imperative to addicting readers.\"Oops.\" Uhhh....I kept coming back to that line \"Now look what you made me do\" for clues to test my theory of the murder, and though I ended up being right, I was never absolutely sure because the novel makes you guess at which of the characters is the most heartless, and here's where the stereotypes start to do some of Hawkins' work for her. Out of a set of stereotypes, which of them do we judge to be the worst and least deserving of empathy?Here's the set, three men and three women:1. Rachel the narrator, ultimately weak, has lost everything via alcoholism, including her looks and her self-respect.2. Anna the usurper, stole Rachel's man and had his baby. Win! She believes she's a sex goddess and priestess in the cult of domesticity at the same time.3. Tom the alpha male, Rachel's ex and Anna's husband, left the broken fading woman for the sexy conquistadora.4. Megan, the wild and wounded, feels she should be happy with a loving husband and a secure life, but cannot live up to expectations of monogamy and motherhood. Our victim.5. Scott, Megan's husband, loving but jealous, is prone to violence in his insecurity.6. Kamal, Megan's honey-voiced counselor, the quintessential comforter and defender of women.Come back to \"Now look what you made me do.\" Did Megan's husband say it because he was controlling? Did Megan's lover say it, because she was pregnant? Who exactly, by the way, is the Megan's lover, and is he from the past or the present? Did Anna say it, because she's a soulless succubus? For Hawkins, stereotyping, and especially gender stereotyping, was key to keeping all of these motives viable and the reader invested.Do we think that in mystery novels, jilted husbands are destined to kill their slutty wives? Do we think that protective saviors are bound to take advantage of the women they save? Do we think that alcoholics are ultimately responsible for all of the misery they inflict on themselves and others, especially if they're women?The answer to every question is yes, getting us into trouble as we try to solve the mystery, and working to Hawkins' advantage. Many writers employ this misdirection, but Hawkins' does it convincingly by consistently developing the worst archetypal traits in each of her characters, keeping their motives in tact and their alibis shadowy. In the case of The Girl on the Train, I should have had more faith in Rachel. I happen to be a woman and an alcoholic. It was painful to read myself in this book, which incidentally does a good job of portraying the psychology of alcoholism. And I never questioned Rachel's self-applied guilt, the fact that she obviously did all the embarrassing things people told her she did. That's as close as I'll get to a spoiler.The lesson for writers?It's hard to combine suspense and literary fiction, simply because the more intimately you get to know the characters as you do in literary fiction, the easier it is to predict them, which ruins a good mystery.At the same time, you have to rise above cliché to write an outstanding suspense novel. In Hawkins' case, she both uses it to her advantage and rises above it. To use cliché, she chooses characters that represent moral choice more than they represent people, so that readers can insert whole lifetimes of personal backstory into their judgements of the characters.And how does Hawkins rise above it? This is where the unreliable narrator can be a fantastic strategy when executed well. You can know an unreliable narrator well, but only as well as she knows herself. Hello mystery. Beware, as things get more confusing for the unreliable narrator, other details must become clear, every chapter, to encourage the reader and prevent fatigue. (Read whydunits to study how to mete out just the right amount of detail, while keeping readers intrigued. In Cold Blood (Vintage International) is my favorite, The Silent Wife: A Novel is a recent example.)Other further reading:For an unreliable narrator whose problem is how honest she is with herself, check out After Life (Nancy Pearl's Book Lust Rediscoveries) by Rhian Ellis, with its killer first line \"First, I had to get his body into the boat.\"For another unreliable narrator for whom memory is the problem, check out Elizabeth Is Missing, about an elderly woman with dementia.For a \"blame the woman\" example of using preconceived notions in the service of mystery, check out Ingrid Bergman in the movie Gaslight (1944).For voyeurs of murder, check out the Hitchcock classic Rear Window",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emanuelle Bergeron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 27, 2023",
                "reviewTitle": "Plot twists that will blow your mind",
                "reviewText": "I have recommended this book to friends several times. The way we get different points of view is genius. I did not see the plot twists coming in the slightest. Couldn't put it down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yannick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 2, 2023",
                "reviewTitle": "Tres bon livre à lire.",
                "reviewText": "Le plaisir de lire.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carmen ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 22, 2023",
                "reviewTitle": "Buen libro.",
                "reviewText": "Buena lectura para verano.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "paola gamez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 5, 2018",
                "reviewTitle": "Could not put it down",
                "reviewText": "This is the first book I finished in less than 4 days. It is addictive and you just can't stop reading. I hesitated a bit to buy it, because I read that the amount of characters was confusing, and it is not true at all. Quite an easy and enjoyable reading. I would definitely recommend it to anyone who wants to enjoy an intriguing story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonas Cavalcanti",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 12, 2018",
                "reviewTitle": "Incrível!",
                "reviewText": "Incrível! Uma trama fora do comum, com um final perspicaz, daqueles que prende a sua atenção o tempo todo, que não te deixa esquecer nenhum fato da história e, mesmo assim, consegue não ser óbvio! Com certeza essa seria uma história contada por Ágatha Christie! Finalizo o livro maravilhado, e super recomendo pra quem eh fã de um romance policial nada convencional!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}