{
    "remaining_requests": 2018,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Duchess-Takes-Husband-Gilded-Heiresses-ebook/dp/B0B6B53F1S",
    "body": {
        "name": "The Duchess Takes a Husband (The Gilded Age Heiresses Book 4)",
        "price": "$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Duchess-Takes-Husband-Gilded-Heiresses-ebook/dp/B0B6B53F1S",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81ehcFUkntL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Harper St. George",
            "link": "https://www.amazon.com/Harper-St-George/e/B00IERONHM/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 365,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A scandalous arrangement between a London rogue and an American duchess leads to lavish stakes—perfect for fans of Bridgerton!Despite her illustrious title, Camille, Duchess of Hereford, remains what she has always been—a pariah. Though her title means she’s technically accepted by London Society, the rebellious widow with her burgeoning interest in the suffrage movement and her American ways isn’t exactly high on every hostess’s guest list. But Camille starts to wonder if being an outcast is not without its perks when the tantalizing answer to her secret fear appears in the shape of Jacob Thorne, the illegitimate son of an earl and co-owner of London’s infamous Montague Club. Jacob is used to making deals with his club members—he’s just not accustomed to them being beautiful women. Nor have the terms ever been so sweetly seductive as Camille’s shocking proposition. To finally buy his own club and gain the crucial backing of investors, Camille offers Jacob the respectability of a fake engagement with a duchess. In return, the tempting widow has one condition: she wants Jacob to show her if it’s possible for her to experience pleasure in bed. The lure of such a bargain proves too delicious to resist, drawing the enterprising rogue and the wallflower duchess into a scandalous game and an even more dangerous gamble of the heart. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B6B53F1S"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (May 23, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 23, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3402 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 335 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0593440986"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#91,310 in Kindle Store (See Top 100 in Kindle Store) #39 in Gilded Age Historical Romance eBooks #50 in Gilded Age Historical Romance #1,584 in Victorian Historical Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 365 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LitShit Podcast",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA4ULAX2OCPIAD37ADWIG5EJDRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JLAA7E02N7K6?ASIN=B0B6B53F1S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Really enjoyable historical romance!",
                "reviewText": "4.5 stars for this great book! Thank you the publisher, author and NetGalley for the ARC of this book. We have been wanting a Camille and Jacob story since book one and were so excited to read their happy ending!Camille is a widow, enjoying her single life and trying to forget her terrible, controlling, manipulative former husband. She decides she wants to chase after passion, so she and Jacob make a deal: she will pretend to be his fiancé so he can close a business deal and he will teach her about passion in the bedroom.We love that this book talks about abuse in all its forms though not super descriptive for those who have a trigger, including Camille having to come to the realization that was her former husband did was in fact abuse. Once she does, she turns that into strength to advocate for herself and for women’s marital rights. We loved Jacob and OMG that mirror scene was just beyond anything she’s ever written. Soo well done, sexy, lot’s of communication, just yes to it all! Jacob is so patient, understanding and open minded. We loved that she called her parents out and opened up to her mother.The one small drawback of this book was that because they each had separate goals to accomplish they didn’t spend as much time together. If we had more of them together it would have moved the plot along a little more smoothly.Overall great conclusion and can’t wait for her next series which we were slightly introduced to at the end of this one.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMSA4VYYMQ2QTA5FTWFNWUXZRIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35323Y6R7O1M1?ASIN=B0B6B53F1S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Love the series!",
                "reviewText": "I am not the biggest fan of romance but I do love this series! The characters are all well thought out and nuanced. And the story flows so that you never want to put the books down.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZZYTLKHAF4HOXW6BPSI37DPBOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LMSK5ZLWL60O?ASIN=B0B6B53F1S",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "3.0 out of 5 stars Very similar to Bridgerton",
                "reviewText": "@ReaddrinkandBeMaryI found this regency romance v easy to read, I raced through the pages in less than 24 hours 😂 . The allure of a Casanova with ties to an infamous club brings spice 🌶️, reminiscent of the beloved BRIDGERTON series. However, the familiarity with BRIDGERTON made it feel almost too similar. As the 4th in a series, it stands alone but delves into characters that I think you might have a better understanding of if you read the others first.Read this if you love a story with a dash of danger, scandal, & naturally, romance, making it a worthwhile read for those enamored with charismatic protagonists in historical settings ⚜️𝗥𝗲𝗮𝗱 𝗶𝗳 𝘆𝗼𝘂 𝗹𝗶𝗸𝗲:◽️ BRIDGERTON◽️ instant connection◽️ women’s rights & suffrage◽️ friends to lovers",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Perry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHS5W4OXSTSFOHTBQKQTGUZULELQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A7X795UUNCME?ASIN=B0B6B53F1S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Loved!",
                "reviewText": "I LOVED this pairing. I can't speak to the trauma of domestic abuse that Camille has survived, but I think her insecurity, fear, and vulnerability in love and sex is extremely recognizable. It's written with such care that I just lost it, especially because Jacob is the perfect kind of partner to help. Everyone deserves someone like him, someone who can meet anxiety, self-loathing, and sadness with concern, patience, and the willingness to relinquish control so that it can be shared instead of monopolized. It's so romantic.To this point in the series, there has been one set of really terrible parents (that of the three prior MCs). They were almost too villainous in the first two books and I didn't feel like they fully made things right with their kids in the third. So, I was really happy to see that same scenario presented and resolved very differently between Camille and her mom.If you're looking for an emotional and super spicy historical romance that *might* keep you up until 3AM, then this is it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKTHYQT6UKGJGVSX3QQEBVXYXBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HYRX07CHF4JZ?ASIN=B0B6B53F1S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 3, 2023",
                "reviewTitle": "4.0 out of 5 stars The Healing Power of the Bedroom Arts",
                "reviewText": "After being forced into a marriage to the Duke of Hereford, Camille suffered in silence right up until the day he died. Now, she is a free woman and taking full advantage of that. Even with the title her marriage affords her, she still finds herself on the outside of London Society, something her late husband made sure of. But it’s this outsider status that leads her to make a deal with Jacob, the illegitimate son of the late Earl of Leigh. In order for Jacob to soothe the nerves of a potential investor for his new club, Camille agrees to a fake engagement - on one condition. Jacob must show her that it is possible for her to experience something she never has before…pleasure in bed.After witnessing Camille on the sidelines of the Crenshaw siblings’ stories, it was a true joy to see her headline her own story. Through the three prior books, we see Camille as a bit of a wallflower, shrinking herself to fit into the very tiny box her husband created for her. Delving into this story felt like a releasing a breath I didn’t know I was holding on Camille’s behalf, especially when she takes matters into her own hands and propositions Jacob. The growth that she goes through from the start of the story to the end is admirable and the friends that stand by her side to guide her warms the heart.The on page discussion about how abuse can take place is difficult but important. Camille, like many women, has a notion that abuse is only physical, feeling as though what occurred within her marriage did not fall into that category. As she opens herself up to Jacob and becomes a part of the London Suffrage Society, she starts to unravel her complicated feelings about it and recognize it for what it was. Harper weaves this storyline in effortlessly and provides a space for other women who have suffered as Camille did to have a starting point for healing.While Camille’s propositioning of Jacob occurs early in the book, the relationship takes on a very slow burn approach to developing. Normally, I am not a fan of slow burn, but the reason for which everything moved slowly actually made me glad for it. Jacob’s care and patience exposes him for more than the rogue that he is perceived as by others in London Society and it deepens the reader’s emotional connection to him.This story could have very easily been a hot and heavy whirlwind of steamy scenes leading to an eventual happily ever after, but Harper took time to craft something that is not only incredibly steamy, but soft and loving. The natural development of Camille and Jacob’s relationship is a reminder that, even when there is undeniable attraction and chemistry, a relationship needs to have a strong foundation set in mutual respect, care, and especially consent.Disclaimer: I received an advanced copy of this book from the publisher for free and have voluntarily written this review.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 27, 2023",
                "reviewTitle": "Wow! A great ending to a great series!",
                "reviewText": "So many important moments to discuss about this book. Great emotions and fantastic moments to live with this group of friends. Very touching and not as light due to such a delicate subject. Very well written. Delighted for Jacob and Camille! Well done!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}