{
    "remaining_requests": 2303,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Romantic-Comedy-Novel-Curtis-Sittenfeld-ebook/dp/B0BFKLV3R1",
    "body": {
        "name": "Romantic Comedy: A Novel",
        "price": "$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Romantic-Comedy-Novel-Curtis-Sittenfeld-ebook/dp/B0BFKLV3R1",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91S5JwlOORL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Curtis Sittenfeld",
            "link": "https://www.amazon.com/Curtis-Sittenfeld/e/B00OABYAGU/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 11529,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER • REESE’S BOOK CLUB PICK • A comedy writer thinks she’s sworn off love, until a dreamy pop star flips the script on all her assumptions—a “smart, sophisticated, and fun” (Oprah Daily) novel from the author of Eligible, Rodham, and Prep. “Full of dazzling banter and sizzling chemistry.”—People “If you ever wanted a backstage pass to Saturday Night Live, this is the book for you.”—Zibby Owens, Good Morning AmericaA BEST BOOK OF THE YEAR: The Washington Post, NPR, USA Today, BuzzFeed, PopSugar, Harper’s Bazaar, Real Simple, She Reads, New York PostSally Milz is a sketch writer for The Night Owls, a late-night live comedy show that airs every Saturday. With a couple of heartbreaks under her belt, she’s long abandoned the search for love, settling instead for the occasional hook-up, career success, and a close relationship with her stepfather to round out a satisfying life.But when Sally’s friend and fellow writer Danny Horst begins dating Annabel, a glamorous actress who guest-hosted the show, he joins the not-so-exclusive group of talented but average-looking and even dorky men at the show—and in society at large—who’ve gotten romantically involved with incredibly beautiful and accomplished women. Sally channels her annoyance into a sketch called The Danny Horst Rule, poking fun at this phenomenon while underscoring how unlikely it is that the reverse would ever happen for a woman.Enter Noah Brewster, a pop music sensation with a reputation for dating models, who signed on as both host and musical guest for this week’s show. Dazzled by his charms, Sally hits it off with Noah instantly, and as they collaborate on one sketch after another, she begins to wonder if there might actually be sparks flying. But this isn’t a romantic comedy—it’s real life. And in real life, someone like him would never date someone like her . . . right?With her keen observations and trademark ability to bring complex women to life on the page, Curtis Sittenfeld explores the neurosis-inducing and heart-fluttering wonder of love, while slyly dissecting the social rituals of romance and gender relations in the modern age. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BFKLV3R1"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Random House (April 4, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 4, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2957 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 300 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ B0C1JZK8LD"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,830 in Kindle Store (See Top 100 in Kindle Store) #27 in Contemporary Literary Fiction #34 in Women's Literary Fiction #60 in Women's Friendship Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 11,529 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e892700c-774d-47ca-af01-1bb081475c37.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f447bf7-8f86-4412-8a36-827106ac1ac6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c820dfcd-5376-40ee-b14e-17b3d00bb050.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4532662-c109-4280-824c-0fd560ec9412.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jessica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3OKAFNMAN4IPMFX7CBABEDLOVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S7MLECM00KGQ?ASIN=B0BFKLV3R1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars SNL Behind the Scenes",
                "reviewText": "Loved it! Such a cute novel! Takes place partially in Covid times. Really enjoyed reading this book! You should too!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bill B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVM3QQFRVMGV246GYR443GXHPYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IDIZUIJZDVQN?ASIN=B0BFKLV3R1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Cute story",
                "reviewText": "This story is about a writer for a show like Saturday Night Live falling in love with a musical guest after both kept their feelings quiet for two years, then hooking up during Covid. I thought the story jumped a bit in the first half and all in all I enjoyed the book but think it was a short story made into a long story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDDN7JPCPTLCR23T2VMNXP33QGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT8SQL0QPW062?ASIN=B0BFKLV3R1",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "3.0 out of 5 stars Fun romance",
                "reviewText": "I've seen some mixed reviews on this one, and I can definitely see where every side comes from. I personally enjoyed this one for the most part, but definitely wouldn't call it anything super ground breaking by any means. It was fun to experience and get a behind the scenes feel of what real life shows like SNL are like. However, I do feel like there was maybe a little too much background and detail given, which maybe the author should have focused a little more on building up a more realistic connection and development of the relationship between the two main characters. I mostly enjoyed Sally as the female lead - but while she was a strong character in some scenarios, there were other times where she was just way too unconfident and self sabotage-y, which became irritating at times. I'm not the biggest fan of the narrative when the lead is their own biggest obstacle 🙄 But I did like that the author seemed to make her a \"real\" character. She was very relatable in that aspect. And her uh, anxieties, when it came to how one relieves themselves when in a new relationship was a very humorous bit 😆The other bit of criticism I have is that the author was very forward with where her stance is on a lot of real life topics, and this book mentions a LOT about Covid. That kind of thing doesn't always bother me, but to have a good chunk of the book to be taking place during Covid and lock downs kind of ruined the magic of disappearing into a fictional story for me, and it was just too much for me. Having to deal with that in real life was good enough for me, I'd rather not read about it when I'm trying to escape reality, thanks. And it just wasn't necessary, there could have been other scenarios used as a catalyst to get the same story across. For that reason, I can understand where a lot of people did not enjoy this one.All in all, was an enjoyable read, but not one I'd recommend to everyone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shelley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAVFO4R33LNRI2FXYIFQ4DJGOCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CNZ466LZSIN7?ASIN=B0BFKLV3R1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Omg! lol funny read it in one day!",
                "reviewText": "This book was so good I read it in a single day… So funny, I was laughing out loud! Definitely recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Haylee Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXKW4PQZZTLS7JULIWYSF7KHI7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JWYOPBZFQJQA?ASIN=B0BFKLV3R1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars A good read!",
                "reviewText": "I really liked this and bought into the storyline! I could tell Sittenfeld did a lot of research for this! It was very reminiscent of SNL, and very accurate depiction of Kansas City!The characters were well-written, although, Noah was probably a little too good to be true.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gangrene Jean",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX4WGZGYUJLUQHVZQX6MEHOCRAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FD09RN50BLEB?ASIN=B0BFKLV3R1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars A book I never knew I wanted?",
                "reviewText": "I usually read more traditional rom com books, but much like the plot of this book, once I started it I really fell for it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Afreen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHHEBPK6ZVDC7B55UAX73D6D3AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PU4E9OM0ASQ8?ASIN=B0BFKLV3R1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "4.0 out of 5 stars quick read",
                "reviewText": "I have read couple of books this year that have been set during COVID. I’ve always liked reading historical fiction where the author ties in the fictional storyline with events that actually took place, like WWII and how it affected different countries and the influx of Cubans that had to come to American because of the turmoil in their country with dictators. It is entirely different to read a book set during a catastrophic time that you actually lived through, like COVID. This book is on the lighter end, of course, being a romantic comedy. I liked all the pop culture references that were relatable and the main characters being older and established in their lives. It is a quick read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "robinohara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZSTJG7LDVRMTFOIYN7DUA6TPGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C3ZUFWAFTH6H?ASIN=B0BFKLV3R1",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "3.0 out of 5 stars Some good, some not-so-good",
                "reviewText": "The good: I have always loved Saturday Night Live, and when the novel began with descriptions of sketch-writing, meetings and other preparations for a live, SNL-type show in the week before it airs, I was riveted. Even better, the story was told in first-person by Sally, one of the show’s comedy writers. I loved the behind-the-scenes details and I could tell that the author did some major research. The story felt genuine. And it was funny.The not-so-good: As the book progresses, the author pivots to romance, which is not one of my favorite genres. OK, yes, I did read the title, “Romantic Comedy,” but I thought it would be mostly about the writing and production of a RomCom, with maybe a little romance between characters as a sub-plot. Instead, the plot became mostly romance and much less about what it takes to be a writer for that type of show. I’m sure it’s a great romance novel for those who appreciate that type of story, but I did not enjoy it.One last beef: I really grew to dislike the main character, Sally, who is overly needy, and who tries to blow up every good thing that happens to her in the relationship department. I honestly don’t know how anyone could be with her, because she’s so willing to walk out or have a meltdown when the going gets tough. Sally is insecure, annoying, and drama-filled. She needs reassurance, time after time. I realize that the author was taking us on Sally’s journey, but it was just painful to endure so many character flaws.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Canadian shopper",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 30, 2023",
                "reviewTitle": "Couldn’t put it down!!",
                "reviewText": "Words cannot express how much I loved this book. I literally couldn’t put it down. I read it while eating dinner with my family. Lol. I loved the behind the scenes SNL-type inside scoop. I LOVED the character dialogue and the relationships that Sally had with her friends and family. And I loved the love story. I think Sally’s insecurities are something many of us can relate to. I laughed out loud several times, Noah made me swoon several times, and I just thoroughly enjoyed this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Helen Banks",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 15, 2023",
                "reviewTitle": "Devoured this book!",
                "reviewText": "I LOVED this book- couldn't stop reading...but also didn't want it to end. The first half has the thrill of peeking behind the scenes at an avatar for SNL. The second half takes place in the Pandemic, not the headlines of it, but the daily anxiety of living through it.Well written- highly recomended if you want a rom- com that references both Thoreau and shopping at Target.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DSS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 5, 2023",
                "reviewTitle": "A modern romance",
                "reviewText": "Novel is promising and original in parts. Then descends into cliche towards the end. Pretty good vocabulary and relatively strong heroine are the big selling points.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Booklover130",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 13, 2023",
                "reviewTitle": "Well-written and enjoyable non-cliche romance",
                "reviewText": "4.5 stars. A rare (for me) book that I found hard to put down till I'd read right through to the satisfying ending. The characters are believable and realistic. The behind-the-scenes look at the frenetic world of TV sketch comedy (a la Saturday Night Live) was to me quite fascinating. The romance was a bit of a slow burn, but it felt totally believable.I liked that Noah was not the cliche of celeb/pop star hero that so often feels shallow and not realistic when depicted in books. In this case, both he and Sally were drawn convincingly. Both were likeable, but somehow neither had ever met a person they could have a long-term real and satisfying relationship with. They were attracted from the start, but it did take a while for things to develop between them. I fully enjoyed the journey, and I was completely sucked in to their lives and their story. For me, a very enjoyable read.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Kelso",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 16, 2023",
                "reviewTitle": "Slow Start but Super Sweet Love Story",
                "reviewText": "I had a hard time with the first half but once the emails started I was hooked!! I love Sally and Noah together ❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}