{
    "remaining_requests": 2298,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Deal-Off-Campus-Elle-Kennedy/dp/1775293939",
    "body": {
        "name": "The Deal (Off-Campus, 1)",
        "price": "$8.89 $7.04",
        "originalPrice": "$16.99",
        "rawPrice": 8.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Deal-Off-Campus-Elle-Kennedy/dp/1775293939",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51wzzG06VSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31LHKwbhScL.jpg",
            "https://m.media-amazon.com/images/I/51ucPGRbCpL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Elle Kennedy",
            "link": "https://www.amazon.com/Elle-Kennedy/e/B002WHBZOO/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by -OnTimeBooks-.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 79715,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 17 hrs 32 mins",
            "FREE delivery February 27 - March 1.",
            "Or fastest delivery Friday, February 23."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/Contemporary-Romance-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13354"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloom Books (February 24, 2015)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1775293939"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1775293934"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,184 in Books (See Top 100 in Books) #225 in Sports Romance (Books) #487 in New Adult & College Romance (Books) #1,445 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 79,715 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Deal The Chase Misfit READ MORE FROM ELLE KENNEDY Start the BookTok sensation OFF-CAMPUS series with THE DEAL, where Hannah Wells enters a fake dating relationship with bad boy hockey captain, Garrett Graham. Ready for more hockey romance? Delve into the BRIAR U series with a forced proximity, brother’s best friend romance between Summer and Fitzy! Welcome to Sandover Prep, home to swoon-worthy delinquent bad boys. In MISFIT, antisocial hacker, RJ, falls for Sloane Tresscott, the headmaster’s ice-princess daughter.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9c08dd1-ba6a-4cbd-b385-365a08a8bada.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/637832b4-5246-4c4c-9bfc-65cfb240b4da.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e82aa999-bf84-41b3-afca-20ff940763b1.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Katlyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2GF765B4FAU4FZ6YPESXYNLTCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OYSV6JHNKARP?ASIN=1775293939",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2022",
                "reviewTitle": "5.0 out of 5 stars Making my love for hockey (and the players) stronger",
                "reviewText": "She manages to create such realistic characters that readers can’t help fall in love with. The Deal is no. exception to that. This book is actually our first introduction to her amazing world of obscenely attractive and crazy talented hockey players at Briar University. Wasting no time, we get straight to the wonderful and hot captain, Garrett Graham.Garrett is a history major in his third year at Briar. Here is where Ms. Kennedy does something different, in shows, movies, and books we often see teachers and professors cutting slack for athletes especially ones that are currently in season. Yeah no, that’s not the case at Briar. Enter: Hannah Wells. If I am being technical, we start of in her perspective however I’m in love with Garrett, so we ignore that. The two of them are taking some sort of philosophical ethics course and when the story kicks off, they are getting their midterms back. You ever have that teacher that literally has either way two high of standards, can’t teach or both? I don’t know what the case is in this situation, but the majority of the class bombs that midterm, except for Hannah (and a few other students). Garrett is among those who failed however he is majorly screwed because if he doesn’t ace this makeup, he is no longer academically eligible for sports. After literally bumping into Hannah on his way out of the lecture hall, he sees her grade and decides that this girl will be his tutor and he won’t take no for an answer. He is relentless in his pursuit of her tutoring him that he goes so far as showing up at her work to beg. Finally, he finds the one thing he can offer to make her say yes: a fake date to catch another guy’s attention. Yeah, that fun cliché. She agrees to tutor him only through the retake because she is too focused on her winter showcase for the music department to tutor him all semester. Predictably speaking, that whole fake dating thing, yeah that backfires. I wonder sometimes if it ever works in any way other than making one of the two people realize they have feelings for each other.Believe it or not though my favorite part of the book wasn’t the romance aspects of it. Yes, I thoroughly enjoyed that don’t get me wrong. It was the way that Hannah and Garrett actually became friends and spent time together as friends outside of studying and trying to get her crush’s attention. They binged Breaking bad, watched stupid documentaries and she hung out with the rest of the team celebrating one of their birthdays. This is something that in my opinion gets missed a lot in romance is that if two people are friends and fake dating, we want to see them actually being friends and not just a couple.Her characters are also so real. Like yes there’s no way this many perfect men exist for her to write 9 books about the hockey players that come through Briar. But that’s not what I mean, I mean her characters have substance to them, they have this wonderful thing that we all as real people have: past traumas. That being said, if you are a person that gets triggered by characters having been abused or sexually assaulted in the past, please consider this your trigger warning. This did all happen prior to the books first page so what we see is the aftermath of the traumas and not the actual events taking place if that makes any difference. If that is you, I would urge you to reconsider reading the story and the rest of this review because I do intend on discussing a little bit of what happens with those situations and how Garrett and Hannah chose to respond to them. Consider this also your spoiler alert as well.When Hannah was 15, she went to a party with friends. At this party she was drugged and raped. Now, roughly 6 years later, we see how this has affected her. She refuses to drink if she is not alone and has some problems with intimacy. The cool thing though is that she uses her friendship with Garrett to help her slowly work through these problems. Once he relatively knows what her hang ups are Garrett never once pressures her or belittles her for them only helping her to slowly move past them in any way he can even if it means he plays the “bodyguard” for a night out with their friends so she can drink and not feel scared. And of course, because this is a romance novel and those two are clearly meant to be he also helps her work through her problems with sex in such a slow and patient way that, in combination with everything else we’ve seen from him, makes all the sense in the world why he is loved not only by her (though she is too dumb to admit it till later) and by all of us as readers. Garrett’s past is not all sunshine and roses either. Son of a former NHL superstar, he had to watch his mother slowly die of cancer and watch as his father’s anger was directed in the form of physical violence at his mother, and later at him. Garrett was routinely abused by his father for years until he learned to hit back, no one saw any warning signs or stepped in ever. All they saw was a retired famous athlete and his equally athletically gifted son. Hannah is the first person he ever felt comfortable opening up to about this and is there for him as a place of support when he is essentially forced to spend thanksgiving with his father and his new girlfriend. She does whatever she can to support him and to remind him that no matter who your parents are, it doesn’t determine who you will be when you are older. This is such an important message that honestly everyone needs to hear as do many of the other men in this series just for different reasons than Garrett.This book is honestly in my opinion perfect, and I don’t think I’ve stopped recommending it to people since the first time I finished it.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alyssa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ3KPXLI2D4PXAL7R7EGB62FVIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AXIXBGN2F019?ASIN=1775293939",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2016",
                "reviewTitle": "4.0 out of 5 stars Review for The Deal by Elle Kennedy",
                "reviewText": "***Review posted on The Eater of Books! blog***The Deal by Elle KennedyBook One of the Off-Campus seriesPublication Date: February 24, 2015Rating: 4 starsSource: Kindle copy bought from Amazon***Warning: this is an adult book, and for the eyes of mature readers***Summary (from Goodreads):She’s about to make a deal with the college bad boy...Hannah Wells has finally found someone who turns her on. But while she might be confident in every other area of her life, she’s carting around a full set of baggage when it comes to sex and seduction. If she wants to get her crush’s attention, she’ll have to step out of her comfort zone and make him take notice…even if it means tutoring the annoying, childish, cocky captain of the hockey team in exchange for a pretend date....and it’s going to be oh so good.All Garrett Graham has ever wanted is to play professional hockey after graduation, but his plummeting GPA is threatening everything he’s worked so hard for. If helping a sarcastic brunette make another guy jealous will help him secure his position on the team, he’s all for it. But when one unexpected kiss leads to the wildest sex of both their lives, it doesn’t take long for Garrett to realize that pretend isn’t going to cut it. Now he just has to convince Hannah that the man she wants looks a lot like him.What I Liked:I love Elle Kennedy's romance novels - her series published by Entangled Brazen is so good! As much I love Elle Kennedy, I'm not a New Adult contemporary romance person. I've struggled with the genre, after reading so many back in 2013, when it first exploded. But I'm very happy that this book was only $0.99 (on sale), because I could not miss the sale. And I'm glad I didn't because I LOVED this book!Hannah has been attracted to a grand total of two boys - one being her ex boyfriend, the second being a hunky football player who doesn't know she exists. When Garrett Graham, captain of the hockey team and all-around player and ladies' man, offers to take her on a date to get Justin's attention, in exchange for tutoring, Hannah puts common sense aside and agrees. Garrett can't fail this class, because doing poorly would mean getting benched and missing games - which isn't going to happy. What also shouldn't happen is the simmering chemistry between him and his smart tutor. But will Garrett win Hannah over?I'm not into New Adult contemporary romance (hits waaaaay too close to home for me, as well as the books are usually very repetitive ripoffs of a select few big hits), but this book was very different, and for a lot of reasons. One of the biggest differences is that while there IS a Big and Terrible Thing of Hannah's Past, it is NOT the focus and end-all-be-all of this book. It's not a dark weight hanging over the book. And while Garrett also has kind of a Not So Good Past, it's again NOT a black cloud over the story. Nothing about the \"tough issues\" in this book is overwhelming, all-encompassing, and totally cliche. Which was refreshing!What this book WAS made of was lots of humor and slightly awkward situations, sarcasm and adorable banter. Garrett and Hannah have never spoken two words before, but everyone knows who Garrett is. Garrett is floored by the fact that Hannah isn't jumping at the chance to tutor him. Or let him take her on a date, to catch another boy's eye and get her on his radar (trust me, this actually makes a lot of sense, especially from a college student's point-of-view). Garrett really has to work to get Hannah to agree to tutor him, and this beginning really amused me. Watching Hannah shoot him down every time was hilarious!I connected so well with Hannah! Smart, dedicated, hard-working, living in the library... I get her. I'm also an idiot who tutored an athlete for long hours of a semester (my story wasn't a cute as hers though). I also really identify with her some of her personal and financial struggles, and how she is so different from Garrett as a person. Hannah is such a great protagonist! I wasn't swamped in sympathy for her - it's clear that she didn't need a man to help her get past issues (which is usually what is typical in New Adult contemporary romance novels).GARRETT! He is so great as well. Swoony and sexy and shameless and sweet and silly and adorable and stubborn (ALL the \"S\" adjectives), this boy had me from the start. I have a soft spot for athletes - particularly soccer and hockey players. Especially particularly the captains. Garrett may seem like an arrogant prick from a distance, and he may really have earned his player reputation among the ladies, but he's also a good guy. And so much more than his good looks and yummy bod.I love the romance! About two fifths of this book features a purely platonic relationship between Garrett and Hannah. I love how this is set up, because it's kind of a friends-first-lust-second relationship, of which I am a huge fan. Garrett and Hannah can be in the same wrong and discuss classes and shows and personal things, like FRIENDS. Things changed when they kissed, and I do like how much chemistry develops. Their physical relationship is very slow ad exploratory, in a slow-burn way. They learn to trust each other as much as they learn what the other likes.The climax of this book (which, in typical New Adult contemporary romance novels, usually features a ton of drama) wasn't as bad as I was expecting, from a New Adult novel. Sure, it's kind of typical in a blanketed sense, but it's also way less on the drama and more focused on the tender, sweet ending. I loved the ending!Overall, I really liked this book. I'm glad it was on sale, because I have been intrigued but on the fence with this book since it appeared on my radar about a year ago. I regret not reading this sooner!What I Did Not Like:There is one thing that bothered me about this book, but I see it is something that is addressed in the next book, featuring Logan and whoever he falls for. So I won't say anything specific, but... it bothered me. Still is. I might not read The Mistake.Would I Recommend It:I highly recommend this book! This could be one of my favorite New Adult contemporary romance novels - which you never hear me saying. Yaaassss to a hot hockey player! Even bigger yaaaaaassssss to a smart, tough girl who doesn't take the hockey player's crap! Low on the drama, high on the swoon and giggles: good balance!Rating:4.5 stars -> rounded down to 4 stars (you will also never see me rate a New Adult contemporary romance novel higher than 4 stars, so this book is quite exceptional). I don't know if I'll convince myself to read The Mistake, and I see I've missed its $1.99 sale. But I want to continue with this series, especially for Tuck's book!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Itsbayleysworld",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 22, 2023",
                "reviewTitle": "MY HEART🫶🏻🫶🏻",
                "reviewText": "Absolutely adored this book!!!!!! Can’t wait to read the rest of the series!!I loved how well developed all the characters were, and even the growth, the two main POV’s had over the course of the book. I felt the author did an incredible job, representing many mental health themes, and topics. This book made me laugh, made me feel like my heart was about to rip out of my chest, and also was a happy place over the past couple days!it is a bit (a lot) smutty, but I highly recommend it!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kirsty Newmarch",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "Can not recommend enough",
                "reviewText": "Absolutely fantastic seriesThis one is my favourite ( hannah & garret) but logan & grace, dean & allie, tucker & Sabrina stories were all just as good. Then the 5th book is in 4 parts each couple gets a part each 4 years after college. And if thats not enough then theres the graham effect book which is garret & Hannah daughters book. Which is outstanding.!But back to this book.He falls first, she's scared after a traumatic past. Both more similar than they think.Its fast its funny its frisky its fabulous !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shelsey bekaert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on January 23, 2024",
                "reviewTitle": "Very good",
                "reviewText": "This book is a perfect teenage read i read it in 4 days and i loved every second of it 🥰",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "💕",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 5, 2023",
                "reviewTitle": "omg",
                "reviewText": "GAAAARREEEEETTTTTR GRAHAM THE LOML OMG.I loved this book so much it was so cute and funny and good omg omg love this series !!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amit K.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 5, 2024",
                "reviewTitle": "Romantic",
                "reviewText": "- [ ] I have always liked watching movies and reading books based on college romance. So in search of the same, I started reading The Deal Book after seeing it highly rated on Kindle.- [ ] This book is simple, sweet, sexy and emotional. I did not find much newness in the story, yet I enjoy reading the story. This book written in dual POV, which i really enjoyed, this book is about two people, Hannah and Garrett who apparently are very different from each other, but as the story progresses they both find each other similar in many ways.- [ ] Hannah who is a simple and not popular girl in school but she has some good friends and a supportive family, her past has not been good due to which while she gets good grades in school but when it comes to relationship and sex if so, she gets scared.- [ ] Garrett is the captain of the hockey team. Who is very popular among girls because of his good looks, good player and being the son of world’s legend hockey player. Its past also was not very good.- [ ] When Garrett gets an F grade in his course, he needs a tutor to help him improve his grades, otherwise he will be kicked off the hockey team. After much persuasion, Hannah agrees to provide tuition in exchange for Garrett helping her meet her crush. But how a kiss makes both of them fall in love with each other, you will find out by reading this book.- [ ] While the story of the book is predictable, I still enjoyed reading the book. If you like books written on college romance, then you will definitely like the book. The book also focuses on issues like rape and child abuse, which I liked.- [ ] I don't like Garrett's character very much. Garrett's over-smartness about himself seems very strange. The way he comments about girls also doesn't make me feel good. Garrett's thought process throughout the book:I want to check out her ass again, because it’s a damn sexy ass, and now that I’ve seen it I wouldn’t mind another look.Because…again…I’m a guy.- [ ] Why you should read. - Want to read feel good book - For love chemistry - For good Storyline - For good college romance",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}