{
    "remaining_requests": 14558,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shirt-Stay-Tactical-Police-Military/dp/B0CP4BN2XB",
    "body": {
        "name": "Shirt Stay Plus-Tactical Belt for Men Police and Military-100% Nylon 1.5 Inch Webbing Gun Belt-Heavy Duty Tactical Gear",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shirt-Stay-Plus-Tactical-Military-100-Belt-Heavy/dp/B0CSF54QQK",
        "soldBy": {
            "sellerID": "A13VYANK7ULAZ0",
            "name": "SSP Brands",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A13VYANK7ULAZ0&asin=B0CP4BN2XB&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CSF54QQK"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CP4CN6W7",
                "variationName": "Color",
                "variationValue": "Black Metal",
                "price": "$16.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ll94wZTHL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CP1H5THR",
                "variationName": "Color",
                "variationValue": "Black Plastic",
                "price": "$14.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41+Goo+OVbL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CP4BN2XB",
                "variationName": "Color",
                "variationValue": "Green Metal",
                "price": "$14.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51tSjjoqLwL._SX38_SY50_CR,0,0,38,50_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51tSjjoqLwL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41W0LWzG-bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kyrc4RqjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NfV5WAyqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fGzrxwz0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tD8V4Dr L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81vVxtuOXhL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/022867b0-3185-4252-9b49-862e1200633b/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Shirt Stay Plus Store",
            "link": "https://www.amazon.com/stores/ShirtStayPlus/page/84DE5280-8FA3-40E1-962F-2482CA970A07?ref_=ast_bln"
        },
        "brand": "ShirtStayPlus",
        "merchantInfo": "SSP Brands",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 20,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 3 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fabric type 100% Nylon",
            "Care instructions Hand Wash Only",
            "Origin Made in the USA or Imported",
            "Country of Origin USA",
            "SHIRT STAY PLUS TACTICAL BELT: Engineered with durability in mind, our tactical belt is crafted from robust materials, ensuring it can handle the demands of any mission for law enforcement, military, special forces, security, and everyday use",
            "MODULAR VERSATILITY: The Shirt Stay Plus Tactical Belt is more than a fashion statement; it is a tactical powerhouse. With a modular design, it allows you to customize your gear setup effortlessly. Attach pouches, holsters, or any essential accessories for quick and convenient access",
            "STEALTHY BLACK DESIGN: Command attention with a sleek black design that complements any tactical or casual ensemble. Whether you are on duty or hitting the streets, this belt is your statement of strength and style",
            "ADJUSTABLE COMFORT: The belt is fully adjustable, catering to sizes from 28 inches to 48 inches. Experience a secure and comfortable fit, ensuring that your gear stays in place, no matter the intensity of the mission",
            "CONCEALED CARRY READY: For those who prioritize concealed carry, this tactical belt is designed to accommodate holsters securely. Feel confident in your ability to carry concealed while maintaining quick and discreet access to your firearm"
        ],
        "description": "For over a decade, Shirt Stay Plus has been a trusted provider of essential gear for law enforcement and military professionals. Our commitment is unwavering - to deliver the best possible products to those who courageously safeguard our freedom both domestically and abroad. Introducing the latest addition to our police gear line: the Shirt Stay Plus Tactical Belts. Key Features: Robust Construction: The black 1.5-inch tactical belt is meticulously crafted from heavy-duty nylon webbing and features a durable metal adjustable buckle. We've spared no expense in selecting the most robust materials to ensure unmatched comfort and longevity. Versatile Utility: Designed with versatility in mind, the Shirt Stay Plus Tactical Belt serves multiple purposes. It can function as an \"inner belt\" to support your Class A or Class B uniforms, holding up your duty belt securely. It's also ideal for use with tactical belts, providing a reliable platform for your essential gear, including guns, handcuffs, and other tactical equipment. Everyday Wear and Tactical Performance: Beyond duty, our tactical belt seamlessly transitions to civilian clothing, offering comfortable support for concealed carry. Whether on duty or off, this belt is designed to meet the diverse needs of the modern professional. Unparalleled Comfort: Experience a level of comfort you've never thought possible in a tactical belt. The Shirt Stay Plus Tactical Belt ensures you can focus on your mission without the distraction of discomfort. Supporting Those Who Serve: Every purchase supports our mission to provide the best gear for those who risk their lives in service. With the Shirt Stay Plus Tactical Belt, you are not just buying a product; you're contributing to a cause dedicated.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Sport Specific Clothing",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23575629011"
            },
            {
                "name": "Golf",
                "link": "https://www.amazon.com/Golf-Clothing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2371053011"
            },
            {
                "name": "Men",
                "link": "https://www.amazon.com/Mens-Golf-Clothing/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2419334011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/Mens-Golf-Clothing-Accessories/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9590728011"
            },
            {
                "name": "Belts",
                "link": "https://www.amazon.com/Mens-Golf-Belts/b/ref=dp_bc_aui_C_6?ie=UTF8&node=9590729011"
            }
        ],
        "productInformation": [
            {
                "name": "Department ‏",
                "value": "‎ unisex-adult"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ January 15, 2024"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CSF54QQK"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#79,794 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #19 in Men's Golf Belts #367 in Men's Belts #651 in Women's Belts"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 20 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Shirt Stay Plus",
                "media_link": []
            },
            {
                "media_text": "Designed by a Veteran Police Officer Introducing The Shirt Stay Plus Tactical Belts Absolutely, having reliable and high-quality tactical gear, especially for law enforcement and military personnel, is paramount. Tactical belts play a crucial role in providing the necessary support and functionality for professionals in these fields. The reliability of gear, such as tactical belts, directly impacts an individual's ability to focus on their mission without any concerns about equipment failure. It's not just about convenience; it's a matter of safety and efficiency.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e59e4fd2-0bd3-4028-aa66-e4e3e4b76104.__CR0,0,800,600_PT0_SX800_V1___.jpeg"
                ]
            },
            {
                "media_text": "Why The Shirt Stay Plus Tactical Belts Are Considered Among The Best Strong Aluminum Alloy Buckle or Thick Plastic Buckle:100% Heavy Duty Nylon Strap Sewn to Perfection:Extremely Durable:Tested By Military And Law Enforcement Officials:You WILL Definitely Get Your Money’s Worth:",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ce17efd-a321-4419-a238-49fc047b6c8d.__CR0,0,800,600_PT0_SX800_V1___.jpeg"
                ]
            },
            {
                "media_text": "Tactical Belt Comparison YES ALUMINUM BUCKLE YES NO PLASTIC BUCKLE NO YES FITS 27\"-4 6\" WAIST YES YES ADJUSTABLE YES YES 100% NYLON YES YES ALUMINUM BUCKLE NO NO PLASTIC BUCKLE YES YES FITS 27\"-4 6\" WAIST YES YES ADJUSTABLE YES YES 100% NYLON YEs",
                "media_link": []
            },
            {
                "media_text": "Designed For Police and Military",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/246510b2-d90a-4759-9d7a-b54c3ada9cf3.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "Extremely Versatile & Durable A versatile tactical belt that can be used for various purposes, including: Carrying firearmsPolice equipmentMagazine PouchHunting Knives Worn Under Duty Belt",
                "media_link": []
            },
            {
                "media_text": "Durable and Versatile",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/85967e98-b096-4af3-8fc8-19cebeeeab5b.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e59e4fd2-0bd3-4028-aa66-e4e3e4b76104.__CR0,0,800,600_PT0_SX800_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ce17efd-a321-4419-a238-49fc047b6c8d.__CR0,0,800,600_PT0_SX800_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8c5e4900-eebb-4b01-9b88-5b7ec54dafd1.__CR0,0,488,700_PT0_SX488_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/63aee0d1-da22-4e6c-bb22-6c4045d3627b.__CR0,0,488,700_PT0_SX488_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/246510b2-d90a-4759-9d7a-b54c3ada9cf3.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/85967e98-b096-4af3-8fc8-19cebeeeab5b.__CR0,0,1464,600_PT0_SX1464_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Honest Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXWCTMBBK54VZHPQXWBEJVDHBDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWHPB0VZJJ2NB?ASIN=B0CP4BN2XB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Secure and Reliable Tactical Belt for Anyone, Even Law Enforcement",
                "reviewText": "The Shirt Stay Plus-Tactical Belt for Men is a formidable accessory designed specifically for police and military professionals, offering a blend of durability, functionality, and comfort. As a critical component of a law enforcement officer's gear, this 100% Nylon 1.5 Inch Webbing Gun Belt delivers on its promise of reliability.One of the standout features of this tactical belt is its robust construction. Crafted from high-quality nylon, the belt exhibits exceptional strength and resilience, making it suitable for rigorous field use. The 1.5-inch width provides ample support without sacrificing flexibility, ensuring it comfortably conforms to the wearer's body while maintaining a secure fit.The inclusion of Shirt Stay Plus technology is a game-changer for those who prioritize a polished appearance. The belt effectively keeps shirts tucked in, maintaining a professional and tidy look even during dynamic movements. This feature is especially appreciated in the demanding environments of law enforcement and military operations.The buckle system is another highlight of this tactical belt. Engineered for quick and easy fastening, the buckle securely locks in place and can be swiftly released when needed. The simplicity of the design adds to the overall reliability of the belt, and the adjustable sizing allows for a customized fit for individuals of various body types.Comfort is not overlooked in the Shirt Stay Plus-Tactical Belt. The nylon material provides a comfortable feel against the skin, and the absence of unnecessary bulk ensures that it remains inconspicuous under uniform attire. The breathable nature of the fabric helps to prevent discomfort during prolonged wear, making it suitable for extended duty hours.In conclusion, the Shirt Stay Plus-Tactical Belt for Men is a commendable choice for law enforcement and military professionals. Its durability, functionality, and attention to detail make it a reliable companion in the field. Whether you're in pursuit of a secure gun belt or an accessory that enhances your professional appearance, this product delivers on all fronts.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan T KellyRyan T Kelly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZIVGBAYSPMVTXLBFJHHHQBT4SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R119C32LJKMEOX?ASIN=B0CP4BN2XB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent tactical belt!",
                "reviewText": "I finally found the right tactical belt for me. This is an excellent belt. It is super strong material, the buckle is a solid metal, and it holds in place firmly. I really appreciate the elastic band on it as well to hold the extra length of belt in place. I have used it multiple times now and it holds in place no matter what I've been doing. The other thing I really like is that it fits through my belt loops easily. I have tried other belts in the past and they are a pain to get through the loops (too wide or have a wide buckle). I'm very happy with this belt and recommend it to anyone looking for a good one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81doq9cJP8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81v07AMC2aL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Suarez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGST7VYVX3MQIXOQRIOH2Z4N3X6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GTMOTPJLLTM0?ASIN=B0CP4BN2XB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "4.0 out of 5 stars ## From Duty to Dressy: A Review of the Shirt Stay Plus Tactical Belt",
                "reviewText": "Combining the functionality of a tactical belt with the neatness of a shirt-tucker, the Shirt Stay Plus Tactical Belt promises to be a versatile companion for both duty and everyday wear. But can it truly deliver on both fronts? Let's buckle up and dive into this review, fellow tactical enthusiasts and fashion-conscious individuals!**First Impressions:**Made with durable 100% nylon webbing, this belt exudes a sense of sturdiness. The low-profile buckle is made of metal for added strength, while remaining snag-free and airport-friendly. The unique shirt-staying mechanism intrigued me – could it really keep my shirt tucked in throughout the day?**Tactical Prowess:**The belt holds its own in terms of functionality. It securely supports holsters, pouches, and other gear without sagging, making it ideal for police, military, and security personnel. The adjustable design allows for a customized fit, and the D-rings offer attachment points for additional equipment.**From Duty to Dinner:**But this belt isn't just for duty days. The sleek design and neutral color options make it suitable for everyday wear as well. The shirt-staying mechanism worked surprisingly well, keeping my shirt tucked in neatly throughout an entire day of errands and meetings. No more embarrassing untucking moments!**A Few Snags in the Webbing:**While the belt impressed overall, there were a couple of minor drawbacks. The nylon webbing, while durable, might feel a bit stiff compared to softer leather belts. Additionally, the shirt-staying mechanism might not be suitable for all types of shirts or body shapes.**The Verdict:**If you're looking for a versatile belt that offers both tactical functionality and a neat appearance, the Shirt Stay Plus Tactical Belt is a solid option. It's durable, adjustable, and surprisingly effective at keeping your shirt tucked in. However, if you prioritize ultimate comfort or a wider variety of color options, you might want to consider other belts. Remember, the perfect belt depends on your individual needs and preferences. Choose wisely, and may your shirt always stay put!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ANoyola",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESQUIKYEF5SLVMJS42VR4JYEDAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25BAEMD4283HS?ASIN=B0CP4BN2XB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Quality Tactical Belt",
                "reviewText": "This belt was a great replacement for my old tactical belt for work. The fabric is thick and durable and the metal components are solid and not flimsy.I found that the belt has a low profile and is comfortable around the waist, even when doing strenuous activity.Given the $15 price range, I think that this belt is fairly priced and a great value. I highly recommend this belt.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pros and Cons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHO5HG6UMZLDZZE6N7PFDTTUQ2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TH8IFP8TMK10?ASIN=B0CP4BN2XB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Feels great and comfortable",
                "reviewText": "I've always wanted to get a belt like this since it allows me to not have to deal with holes. This is so comfy to wear and its easy to set up. I'd definitely recommend for people that are just tired of having to set the belt to a hole.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}