{
    "remaining_requests": 9718,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/MP-MALL-Compatible-Samsung-Galaxy-S20/dp/B08HZ83Y9N",
    "body": {
        "name": "[4 Pack] MP-MALL 2 Pack Tempered Glass Screen Protector + 2 Pack Camera Lens Protector for Samsung Galaxy S20 FE 5G / Galaxy S20 Fan Edition (6.5-inch), 9H Hardness Scratch-Resistant",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/MP-MALL-Compatible-Samsung-Galaxy-S20/dp/B08HZ83Y9N",
        "soldBy": {
            "sellerID": "A1T0ESXEOYJ2XP",
            "name": "Maxfend",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1T0ESXEOYJ2XP&asin=B08HZ83Y9N&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BSGWNZVB"
        ],
        "asinVariationValues": [
            {
                "asin": "B07Q1GZJZT",
                "variationName": "Size",
                "variationValue": "Galaxy S10e 5.8-inch",
                "price": "$9.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08HZ83Y9N",
                "variationName": "Size",
                "variationValue": "Galaxy S20 FE 6.5-inch",
                "price": "$9.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51MG3Q OSNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51b--2eOAQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DxhyjQhFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51l5UgkHS1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JawLN8cVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31kXnbtYzIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81a1n 8W4nL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/825cc7bc-7836-4a52-8be8-ade3fd95f10a/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the MP-MALL Store",
            "link": "https://www.amazon.com/stores/MP-MALL/page/7AA75039-A667-4456-AB5F-51BFEF4F2DA5?ref_=ast_bln"
        },
        "brand": "MP-MALL",
        "merchantInfo": "Maxfend",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 26931,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 53 mins",
            "FREE pickup Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 15 hrs 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Designed for】2 pack tempered glass screen protector and 2 pack camera lens protector for Samsung Galaxy S20 FE 5G / Galaxy S20 Fan Edition (6.5-inch). Not fits for Samsung Galaxy S20 6.2-inch and any other device.",
            "【Dual protection the phone】Provide maximum protection from drops, scratches, scrapes. High quality premium tempered glass with polished.",
            "【Lightweight material】Made of ultra-thin tempered glass to provide lens protection without affecting photos.",
            "【High-definition】Ultra-high-definition tempered glass maintain the original quality of photos make the images clearer.",
            "【Easy Installation】Easy installation and simply press the screen protector onto the camera lenses on the back of the phone. No fingerprint, No bubbles and leaves no residue when removed."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2407755011"
            },
            {
                "name": "Maintenance, Upkeep & Repairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=21209105011"
            },
            {
                "name": "Screen Protectors",
                "link": "https://www.amazon.com/screen-protectors/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2407781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "15.99\"L x 8.99\"W"
            },
            {
                "name": "Item Weight",
                "value": "0.023 ounces"
            },
            {
                "name": "ASIN",
                "value": "B08HZ83Y9N"
            },
            {
                "name": "Item model number",
                "value": "Samsung Galaxy S20 FE 5G"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 26,931 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,954 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #381 in Cell Phone Screen Protectors"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "Yes"
            },
            {
                "name": "Special features",
                "value": "Scratch Resistant"
            },
            {
                "name": "Color",
                "value": "Clear"
            },
            {
                "name": "Manufacturer",
                "value": "MP-MALL"
            },
            {
                "name": "Date First Available",
                "value": "September 14, 2020"
            },
            {
                "name": "Brand",
                "value": "MP-MALL"
            },
            {
                "name": "Compatible Devices",
                "value": "Cellphone"
            },
            {
                "name": "Material",
                "value": "Tempered Glass"
            },
            {
                "name": "Item Hardness",
                "value": "9H"
            },
            {
                "name": "Compatible Phone Models",
                "value": "Samsung Galaxy S20"
            },
            {
                "name": "Special Feature",
                "value": "Scratch Resistant"
            },
            {
                "name": "Finish Type",
                "value": "Polished"
            },
            {
                "name": "Unit Count",
                "value": "2 Count"
            },
            {
                "name": "Screen Size",
                "value": "6.5 Inches"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/1bcccd70-5676-4031-b1e0-5416e9b02aa9.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9874a1f7-1cf9-4511-b42b-f439f097dcea.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/61ab1357-3d6e-4b48-a17d-8ef49c41835d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/fca3ffdf-81e4-4f73-937b-3601659e3ddc.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/74c0cf04-6fc9-47a0-a3d5-cbb2723a5169.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TomC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGPNVTWJOORVZGZIDM3DSZ2L7TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22G6PJRDTRR9N?ASIN=B08HZ83Y9N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 14, 2021",
                "reviewTitle": "5.0 out of 5 stars Terrific screen protector",
                "reviewText": "My title for this review is “terrific screen protector” for three reasons. First, it fits perfectly on my S10e, second, it works perfectly and doesn’t interfere with control of apps and screens, and third, and perhaps most important, it went on easier and better than any screen protector I’ve ever installed before (and I’ve installed many).The frame provided worked to control precisely where the screen protector should go so there was no danger it would be put on at an angle or in the wrong place and have to be moved. The frame came off easily after the screen protector was in place and I was in business. In fact where many screen protectors require you to work diligently to squeeze out bubbles left after installation, this almost installed itself. I literally watched the screen protector settle down and the large bubble gradually disappear. Using the included stiff plastic “squeegee” to finish the job was a nice touch if almost not necessary.Having raved about this screen protector I’ll offer a few small suggestions for improvement or warnings to a screen protector “newbie”. I didn’t need the dust absorber so I didn’t use it. You may or may not need one. The alcohol pad is necessary, to completely clean the screen and remove any fingerprints or finger oils, so use that thoroughly and then use the wipe afterward to make sure the screen is completely clean and dry before applying the screen protector. Be very careful you don’t touch the screen after cleaning.Put the frame on the phone over the screen before you try to install the screen protector, and make sure that you orient the screen protector with the very small hole to go over the camera lens opening on the upper right of the screen. Lastly, pull the protective film only about half way off the sticky side of the screen protector and while you’re holding that back to expose the sticky back side of the screen protector, carefully place it into position over the phone and within the frame you placed over the phone earlier. When you have it properly aligned you can then carefully press the screen protector down onto the phone while pulling the protective film the rest of the way off.At that point you’ve likely got a perfect installation and using the included stiff plastic squeegee will finish the job. You might also want to use your fingers around the edges just to make sure, but I expect you’ll be very pleased with the results. BTW, a phone case is a nice addition to protect the edges of the screen protector from getting caught and lifted from the screen. They are inexpensive and provide a lot of additional protection.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Mahaffy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW5RBH4NBQ6WKR3Z3N5IXBQIHDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31SZTJS2F9C2V?ASIN=B08HZ83Y9N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2022",
                "reviewTitle": "5.0 out of 5 stars Good screen protection and company that stands behind their product",
                "reviewText": "I ordered and installed this screen protector just under a year ago. It's a 2 pack, so I figured having a spare would be good. It's a sturdy, thick protector, but touch sensitivity is still good, at least when you adjust it in settings for having a screen protector.The installation process went pretty smoothly--their online video instructions helped, though I found that I had fewer bubbles beneath the screen (basically none) if instead of just dropping the protector on the phone that I put the top on first and then lowered the rest at a slight angle, pressing down with the cardboard applicator as I went. I had a couple bubbles on the first protector that I couldn't get out because I didn't do that procedure for the entire application, but on the second protector, I had no bubbles doing it that way.Fast forward 11 months and my protector had a couple dings from the phone getting dropped on gravel, but no big deal. I was starting to think about swapping it out for the second protector, but then one day I discovered a crack clear across the protector. I pulled out the box to get the second protector, and noticed the lifetime guarantee on the box, so I e-mailed about the crack and they promptly sent me another protector. Kudos to a company that's responsive and stands behind their products. When I get my next phone, I know where I'm going to get the screen protector!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Awesome possum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWLHWJBZCYEO5KOIQWYO6O3NZ5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GXW05JOFYYN1?ASIN=B08HZ83Y9N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2019",
                "reviewTitle": "4.0 out of 5 stars Pretty Darn Good! Also actually PROTECTS.",
                "reviewText": "UPDATE APRIL 2020: Finally dropped my Galaxy S10e phone.Damn. 5ft drop straight down face first on uneven stone tile in my doorway. So dumb, I was video calling during our present quarantine and walking around with my phone in a stand/holder and holding the stand but not the phone. So dumb. Anyway, picked it up and the screen was cracked...but no, wait....the screen PROTECTOR was cracked my actual screen was fine (sorry no picture, I only have one phone/camera)! Replaced the protector with the 2nd of 3 that this comes with and I'm back to brand new looking. Still got one left. It saved me. So some good news coming out of this Pandemic. Y'all can relax, my phone is fine. Now 5 stars instead of 4 cuz it actually works as advertised. Thanks MP-Mall!Original Review: All in all I'm happy with the product. I had an IQ Shield I tried before this and was furious with the compete disaster the product and application process was. I wasn't too hopeful about this one unfortunately, but this one (being Tp'd Glass vs film) has got my approval. I have 4 stars instead of 5 because of ONE TINY BUBBLE on the top right of phone. A spec of something got in (it's 10min since I installed it so it might go away tomorrow and if it does I'll update the review) but you can't see it with the white led backlight on. Does show up with black background or with screen off. I can deal.I do however, see why some people were upset about the 'coverage' from side to side. It JUST BARELY, LIKE BY A HAIR, doesn't go over on each side as many would like. Again, I notice it, but, looking at YouTube or any app head on it is not noticable. If you want to obsess about it go right ahead and keep looking. For my part I'm done looking for a mfr that's \"perfect\". NO such thing. But MP-Mall comes damn near close. Easy AF application and was super easy to press down sides for complete seal all way around (except as I side my little spec bubble). Squeegee is durable and the guide is accurate. They made it slightly narrow I believe to allow edge functionality on s10e and for cases.But DEFINITELY watch the installation video... a couple times, it's worth it. And I have 2 more screens left if I want to replace at some point or if it gets cracked.MP-Mall is the best you'll find I believe so go for it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pratima Tanwar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 24, 2021",
                "reviewTitle": "Highly recommended. Amazing value for the quality.",
                "reviewText": "What an amazing screen! Super easy to install, zero bubbles, and very very clear. It doesn't look like an added screen, just blends in perfectly with the phone. The package comes with 2 screen protectors for front and 2 for the camera at the back, wipes, a cloth, dust lifting strips, and screen protector alignment tool <-- a lot of stuff for this price and definitely top notch quality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GE",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2021",
                "reviewTitle": "Great Screen Protector",
                "reviewText": "This is my first ever purchase of a screen protector, and installing it was straightforward. I just followed their linked tutorial video.The screen looks and feels extremely good. As this is my first screen protector, I am not sure what the touch sensitivity should be like, but it is very slightly less responsive than the bare screen.It seems very durable. I applied lots of pressure when I was trying to remove air bubbles and that did not cause any visible damage to the screen.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blake Cross",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 7, 2020",
                "reviewTitle": "$40 for this garbage?",
                "reviewText": "Yes, the video makes it look simple. Did everything step by step. Looked okay for 5 minutes. Curved areas started to rise from the screen. Smoothed back down. Again. Again. Again. Didn't work. Garbage product that isn't even worth $5.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg Muir",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 28, 2022",
                "reviewTitle": "That It Works As Required",
                "reviewText": "Excellent for the price. Through using the installation link that came with the screen protectors saves me having to go to a store and paying someone else to do an easy job. The item was dispatched very quickly and was of excellent quality. Would recommend the seller and the product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lady",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 22, 2021",
                "reviewTitle": "Great quality and affordability!",
                "reviewText": "Reviews were hit and miss so I took a chance myself. Install is easy. Watch the video once through and then while you work to ensure you get it right! The frame was incredibly helpful and they provide all the tools to make it work - alcohol swab, microfiber cloth, and dust collector.It took me minimal effort to apply mine, and I'm awful at putting on screen protectors. I'm prone to dust and hair getting collected underneath but the application was flawless. A few hard workovers with the cardboard to get rid of sparse bubbles and it was all good!I feel SOOOO much better having this on my phone now.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.99",
                "sellerName": "Maxfend",
                "sellerRating": "5"
            }
        ]
    }
}