{
    "remaining_requests": 9676,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tech-Armor-Protector-Case-Friendly-Resistant/dp/B07GZZXC78",
    "body": {
        "name": "Tech Armor HD Clear Film Screen Protector Designed for Apple iPhone 11 and iPhone Xr 6.1 Inch 4 Pack 2019",
        "price": "$7.95$7.95",
        "originalPrice": "",
        "rawPrice": 7.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tech-Armor-Protector-Case-Friendly-Resistant/dp/B07GZZXC78",
        "soldBy": {
            "sellerID": "A389UX2GHRBG9",
            "name": "Tech Armor",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A389UX2GHRBG9&asin=B07GZZXC78&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 20% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ChosY2v6L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Ww3LWBs0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TjLan5quL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51E4zk-m9dL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NcuXcjCeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41T96IjreAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81SyWFRB9yL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/565f07d8-18c1-44ef-a7d3-8284470a6750/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Tech Armor Store",
            "link": "https://www.amazon.com/stores/TechArmor/page/040247D2-8125-4EF9-A084-5F29CF243B0D?ref_=ast_bln"
        },
        "brand": "TechArmor",
        "merchantInfo": "Tech Armor",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 3367,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 17. Order within 9 hrs 3 mins",
            "FREE pickup Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 17. Order within 15 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "ULTIMATE SCREEN PROTECTION - Keep your iPhone 11 and XR 6.1-inch display protected from scratches, fingerprints, and smudges with Tech Armor's HD Clear Film Screen Protector.",
            "CLEAR VISIBILITY - Enjoy crystal clear visibility with this ultra-clear screen protector that won't hinder your phone's display quality.",
            "SENSITIVE TOUCH - This screen protector allows for full touchscreen sensitivity, so you can use your phone as you normally would.",
            "GREAT VALUE - This pack includes four screen protectors, so you'll always have a spare on hand. Share with family and friends or keep extras for yourself.",
            "EASY TO REMOVE - When it's time to replace your screen protector, simply peel it off - no sticky residue left behind!",
            "LIMITED LIFETIME WARRANTY - Trust in our device protection expertise with our limited lifetime warranty. We ensure that you are covered in the unlikely event that your product fails."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2407755011"
            },
            {
                "name": "Maintenance, Upkeep & Repairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=21209105011"
            },
            {
                "name": "Screen Protectors",
                "link": "https://www.amazon.com/screen-protectors/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2407781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7.76\"L x 7.76\"W"
            },
            {
                "name": "Item Weight",
                "value": "1.37 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07GZZXC78"
            },
            {
                "name": "Item model number",
                "value": "5647413654"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 3,367 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,689 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #1,257 in Cell Phone Screen Protectors"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Special features",
                "value": "Oil Resistant, Touch sensitive, Tear Resistant, Scratch Resistant, Smudge Resistant"
            },
            {
                "name": "Whats in the box",
                "value": "4 Screen Protectors, Microfiber Cloth, Dust Removal Tape"
            },
            {
                "name": "Manufacturer",
                "value": "Tech Armor"
            },
            {
                "name": "Date First Available",
                "value": "August 31, 2018"
            },
            {
                "name": "Brand",
                "value": "Tech Armor"
            },
            {
                "name": "Compatible Devices",
                "value": "Apple iPhone XR, Apple iPhone 11"
            },
            {
                "name": "Material",
                "value": "Polyethylene Terephthalate"
            },
            {
                "name": "Item Hardness",
                "value": "3H"
            },
            {
                "name": "Compatible Phone Models",
                "value": "Apple iPhone XR, Apple iPhone 11"
            },
            {
                "name": "Special Feature",
                "value": "Oil Resistant, Touch sensitive, Tear Resistant, Scratch Resistant, Smudge Resistant"
            },
            {
                "name": "Finish Type",
                "value": "Smooth"
            },
            {
                "name": "Water Resistance Level",
                "value": "Water Resistant"
            },
            {
                "name": "Unit Count",
                "value": "4 Count"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Specifically Designed for the iPhone 11 / Xr Play With Peace of Mind As a proud and excited iPhone 11 6.1 owner, you want ultimate protection for your larger HD display screen without compromising your user experience. Basically, you want to enjoy your device to the max, safe in the knowledge that if you drop or scratch your phone, you're totally protected. Tech Armor HD Clear iPhone 11 Screen Protectors are made with 5 layers of the highest grade Polyurethane (PET) Film and advanced silicone adhesive to deliver better protection and an unrivaled user experience. That means you can enjoy your iPhone 11 the way Apple intended, without any worries. CURVED SCREEN DESIGN Since the iPhone 11 6.1 screen was designed with curved edges on all four sides, this flat screen protector was crafted to fit the flattest portion of the screen. This reduces the risk of bubbles, provides a more seamless installation and prevents the accumulation of dust / debris under the screen protector (which can cause lifting). As a proud and excited iPhone 11 owner, you want ultimate protection for your larger HD display screen without compromising your user experience. Basically, you want to enjoy your device to the max, safe in the knowledge that if you drop or scratch your phone, you're totally protected.Anti scratch, anti shatter and anti fingerprint layersPrecision laser-cut tempered glass, polished with round edges99.99% HD clarity and touch accuracyBubble free installation",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/cb8f6946-b0be-4d44-b450-ca1a955d621b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Tech Armor Ballistic Glass Screen Protector for Apple iPhone 11, iPhone Xr Tech Armor HD Clear Film Screen Protector for Apple iPhone 11, iPhone Xr Tech Armor 4Way 360 Degree Privacy Film Screen Protector for Apple iPhone 11, Xr Tech Armor Anti-Glare Film Screen Protector for Apple iPhone 11, iPhone Xr Tech Armor Privacy Glass Screen Protector for Apple iPhone 11, iPhone Xr Screen Type HD Clear Ballistic Glass HD Clear Film Privacy Film Anti-Glare / Matte Film Privacy Ballistic Glass HD Clarity 99% 99% 95% 95% 95% Impact Protection ✓ ✓ ✓ ✓ ✓ Touch Sensitivity ✓ ✓ ✓ ✓ ✓ Anti-Smudge / Anti-Fingerprint ✓ ✓ ✓ ✓ ✓ Scratch Resistance ✓ ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/352da54c-982e-4580-af3c-3432c8228ebf.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/fe403835-3558-4443-a8d4-6bcd84acf2b1.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/bd8f732d-2f13-4163-b341-3297d0d23464.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9607a3f3-0952-422d-8d13-c824e9c216da.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/cb8f6946-b0be-4d44-b450-ca1a955d621b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1b9a2e0d-569a-4efc-a200-1f8c33508d89.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4b70474-f8fd-414b-af6c-a39d873b4e11.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e353900-e86f-40cf-924e-3d2b770c106f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/f889e13c-c9c6-4a6b-8b59-0b07aa2d8670.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9d661081-4e13-4ef5-8a38-1f932a3cfc19.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Barbara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5373WCCVEE6RGVT2R7CI2VWMQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19K94JBE8O9I8?ASIN=B07GZZXC78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Protect’s glass good on cell phone",
                "reviewText": "Good price easy to install stays on good Protect’s the glass",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEELZCV6CWKUTNSF3Q43LLBKFRXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XAGKQBT36EMU?ASIN=B07GZZXC78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2019",
                "reviewTitle": "5.0 out of 5 stars GREAT PRODUCT - but requires a good eye and steady hands and patience to apply slowly",
                "reviewText": "I've been buying this exact line of screen (Tech Armor HD Clear Plastic Film) for 3 generations of iPhones in my family now.When my wife and I bought new XRs, there was no doubt in my mind I'd go with them again.Let me start with the drawbacks.1 - You have to be extremely clean to not end up with dust trapped underneath. When I'm installing, I ask the kids to stay away to stop airborne dust movement. I choose a clean table to work at. I have a strong source of light, so that when I look at the reflection of the light on the screen, I can see any dust particles. Wipe those off with microfiber or use the sticker (both included).2 - You have to have a very steady hand and a sharp eye. This was always true of these, but with the XR it's 10x as important. Why? Because the XR screen is curved near the edges. There is obviously no way to make a film that would follow and stick to that curve, so Tech Armor made the film only as large as the flat portion of the screen. It does not truly go edge to edge! In my opinion that is not a big deal, you have 98% of your screen protected. But it does make lining up the film much tougher since you can't use an edge as a guideline as was possible with older iPhones.The way I handled it was this. After peeling the film backing (labeled #1), I held the film by placing my two thumbs along one long edge and my two pointer fingers along the other long edge. Pinching the film slightly, so that it would bow outwards (towards the phone). If you're right handed, I would place the phone in front of you with the notch end (top of iphone) facing right, and the bottom facing left (in landscape orientation). Now, start at the top end of the phone by the screen notch. That notch will help you center the film. Slowly bring the film down towards the screen while you keep it slightly pinched. The center of the film should make contact first, and have it centered around the notch, such that the end of the film meets the end of the flat portion of the glass (not the curved part).Now, before you lower it further, check the bottom edge just to see that it appears to be hovering centered. Slowly start bringing the center of the film down the middle of the phone's screen until you reach the bottom. At this point, only a thin section of film should be touching the screen, from top to bottom, down the very middle. Eyeball the placement, checking that it's centered, from a top-down view. If you're not happy, lift it and start over, this is the only chance you'll get really. If happy, then lower it into place. Use the included squeegee wrapped in the microfiber to push the bubbles out.If you find one or two specks of dust, I do not recommend that you try to lift the film to remove them, as long as they're small specks. There is more risk in damaging the film than reward in getting those dust particles out. I have also found that the dust specks appear large at first, but eventually the film wraps around them and the tiny air bubble diminishes in size. I had two dust specks when I first installed mine, and with patience and gently rubbing the film, I was able to have them completely disappear and don't even know where they are anymore.After you peel off protective film #2, it's still OK to rub the film to work out any remaining bubbles, just be sure you use something gentle like the microfiber that is included, and work slowly.If you've read this far, you're probably wondering why anyone would go through the trouble of a difficult install to use this film?First, it adds essentially 0 thickness to the phone. I truly forget it's there. Even the thinnest glass protectors are noticeable to my eyes and ruin the sleek look of the phone. This one disappears.Second, there's no risk of shattering the film. My wife isn't particularly careful with her phone, tosses it in her purse, etc. The film has never peeled off and never ripped. It has protected against keys and coins.Third, it has good \"feel\" to it. Touch action is perfect, there is just a little bit of friction as you glide, and smudges wipe off easily.Finally, you get a pack of 3 for the price. If you still have the phone 2 years later and there's scratches in the film or haze, you have a new one waiting for you. I find it economical.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yao He",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNO7KPZ5BH7NNXQ36PGMAJDVSYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3J515VI5TCG0O?ASIN=B07GZZXC78",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Affordable, quality screen protector",
                "reviewText": "This item is easy to install. The sticker is handy to takeout dust.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KittyGirlTiffy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGQZL5ELTPDEBM5SCFFHDNUUTLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16Y2XN0LV0EX?ASIN=B07GZZXC78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars I will never use glass screen protectors again",
                "reviewText": "I’ve had multiple phones, and every single time I put a glass screen protector. It ends up shattering and breaking my phone screen. I am not saying that these will keep your phone screen from getting a crack, but I am saying that when you do get a crack, these will keep your phone screen intact and your fingers safe from getting glass in them. I drop my phone a lot. I do have several cracks in my screen as we speak, but they are not affecting anything and they are staying sealed because of the film screen protector. No screen protector will keep your screen from cracking but this one will keep your screen from murdering your fingers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CecilBCecilB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3GTXN5DA6T7CXK7LTTLZSAOJ3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KYB08V5R0S8?ASIN=B07GZZXC78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2022",
                "reviewTitle": "5.0 out of 5 stars Does the job",
                "reviewText": "Purchased in 2019. I just changed it out from the first one I installed. The value is awesome as this is a 4-pk. This photo is of the first one after I removed it. You can see the scratches that it has saved my phone from. I think the little bubble looking spots might be from water that has possibly collected over the last 2 weeks when I was at the river a couple of times. I kind of dropped it in a damp spot, not directly in the water, but close!As with any film cover, it’s a bit tricky to install without getting any bubbles or dust at all, but the company does its best to help you by including a soft micro-fiber cleaning cloth, dust removal tape, & a bubble removing squeegee that’s small enough to use with a phone sized screen. I’d suggest using a table or desk for stability & having nice bright light so that you can see any dust particles or fingerprints before you put the film on. I love that this has a little tab labeled 1 & 2 so you know which protective film to remove first & that also makes it easy to remove during installation.I love these so much more than the tempered glass protectors. The glass ones shatter when dropped. These never look bad, even with scratches you can still see your screen just fine!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81WfQFsCenL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHA4D74M2D6DCUJ7OO2E33SXMZOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR396ANSEUFRQ?ASIN=B07GZZXC78",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2019",
                "reviewTitle": "3.0 out of 5 stars Kinda disappointed",
                "reviewText": "Seems like a decent screen protector but even after watching the video and doing everything I could I still could not get the bubbles out of the first two screens. Finally on the third screen protector I was able to get the bubbles out. Having to throw away the first two screen protectors doesn’t make this a very good value.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4ADLN5PIZUU7Z7Y7EIZHMTRA2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UWYS7ZUR6CLB?ASIN=B07GZZXC78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 22, 2019",
                "reviewTitle": "5.0 out of 5 stars Great Product So Far. Extra Tips on Better Installation.",
                "reviewText": "I got this PAT film screen protector after cracking more than a half dozen of the “tempered glass” protectors. Hopefully these ones last longer.The Tech Armor install instructions basically have you eyeball the alignment and ‘use your fingertips to guide the screen protector into place for a “precision fit” ‘. Unless you have some super steady hands, I don’t know how most regular people would be able to do this. So instead, I used three stickers to test fit my alignment. Two stickers acted as a hinge, and the third sticker was used to open and close the hinge without having to touch the adhesive side with my fingers.After fitting alignment, I used the cloth and sticker to remove as much remaining dust and dirt from the screen as possible, then I took off #1 film and stuck the pre-aligned protector on the screen.To prevent from scratching the film, I used the squeegee to remove bubbles while the #2 film was still attached. Then I removed the guide stickers and #2 film to complete the installation. I used the #2 film + squeegee to remove any remaining major air bubbles.There were a few small bubbles left, but I don’t live in a dust-free room, so nothing unreasonable. After turning on the screen, the minor bubbles left were unnoticeable, so overall a great product so far. Plus they include four screen protectors, so it’s a good value for the price too, so I hope they last longer than the glass protectors. I’ll update if anything changes.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71G1Pc6UTiL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71fIig2spbL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71rvPK8KNHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Larry K. Rowin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO26QXRMTR3VTHM7YGTEWY2D3VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NA7A3MKSQC0X?ASIN=B07GZZXC78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "5.0 out of 5 stars No cracked screens",
                "reviewText": "I have had a couple of what I thought were cracked screens. The protection worked the screen protector took the hit.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "truenorth",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 13, 2021",
                "reviewTitle": "Great product!",
                "reviewText": "The screen protectors arrived promptly which made me happy so I didn't have to use my new phone for too long without a screen. I have bought this brand before and have always been happy. This time installation seemed even easier. Very happy with the smooth, clear, bubble-free display.It did mention a tray to use when installing but that wasn't included. Not a problem as it went on easily and was not hard to line up.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Croftie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 4, 2021",
                "reviewTitle": "Easy to apply",
                "reviewText": "Easy to apply does the job",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Analía M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 22, 2020",
                "reviewTitle": "Perfectas!",
                "reviewText": "Las mejores micas! No puedo vivir sin ellas!!!No me gustan las de cristal porque se estrellan y aunque tú teléfono esté intacto, traes una pantalla estrellada.Agradezco infinitamente a Tech Armor por seguir fabricando este producto.No son eternas, eventualmente se empiezan a despegar pero lo bueno es que en los paquetes siempre vienen varias piezas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeffrey van Aalst",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 22, 2019",
                "reviewTitle": "Great",
                "reviewText": "Great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "celine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 16, 2023",
                "reviewTitle": "Brest value, easy to use durable",
                "reviewText": "I have been buying this brand for four years and I am always satisfied",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.95",
                "sellerName": "Tech Armor",
                "sellerRating": "5"
            }
        ]
    }
}