{
    "remaining_requests": 9584,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Purity-Screen-Protector-Apple-iPhone/dp/B07QP1CB24",
    "body": {
        "name": "Screen Protector for Apple iPhone 11 and iPhone XR - 3 Pack (w/Installation Frame) Tempered Glass Screen Protector Compatible iPhone 11 / iPhone XR (3 Pack) [Anti-Scratch] [Fit with Most Cases]",
        "price": "$7.99",
        "originalPrice": "$9.99",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Purity-Screen-Protector-Apple-iPhone/dp/B07QP1CB24",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41EmfT8ZMwL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/412c4KWuxHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RABXQRAjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DMQ-c8Q3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51C509pp30L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rgBfQ8SuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A14tIlgQYnL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/68a02c84-569f-5ce3-86b1-cd41f1f8fe11/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3ea06a5c-c6cb-4aa0-9c39-43522e351e72/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91m+f+xC4mL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91m+f+xC4mL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Purity Store",
            "link": "https://www.amazon.com/stores/Purity/page/A6452009-EC2E-4038-9771-B12FEB0C8B1C?ref_=ast_bln"
        },
        "brand": "Purity",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 22313,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 17. Order within 6 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Designed For iPhone - The Purity Screen Protector for iPhone 11 and iPhone XR (6.1\" Screen).",
            "Transparent - Featuring an ultra-clear, hydrophobic, and oleophobic screen coating, protecting against fingertips, sweat and oil residue. Keep your screen clear at all times!",
            "Scratch Resistant - Provides everyday protection for your iPhone against scratches, bumps and minor drops.",
            "Easy Installation - Installation is easier than ever! Includes an installation kit with an installation frame, wet/dry wipes, user manual, and dust removal/guide stickers.",
            "Ultra-thin - Tempered glass screen protector designed to provide ultimate protection for your iPhone's screen."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2407755011"
            },
            {
                "name": "Maintenance, Upkeep & Repairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=21209105011"
            },
            {
                "name": "Screen Protectors",
                "link": "https://www.amazon.com/screen-protectors/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2407781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5.84\"L x 2.88\"W"
            },
            {
                "name": "Item Weight",
                "value": "2.39 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07QP1CB24"
            },
            {
                "name": "Item model number",
                "value": "UU000070"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 22,313 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,038 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #1,516 in Cell Phone Screen Protectors"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Special features",
                "value": "Oil Resistant, Rounded Edge, 9 H Surface Hardness, Scratch Resistant"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Clear"
            },
            {
                "name": "Whats in the box",
                "value": "Dry Wipe, Installation Frame, User Manual, 3x Screen Protector, Wet Wipe"
            },
            {
                "name": "Manufacturer",
                "value": "Purity"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "April 11, 2019"
            },
            {
                "name": "Brand",
                "value": "Purity"
            },
            {
                "name": "Compatible Devices",
                "value": "Cellphone"
            },
            {
                "name": "Material",
                "value": "Tempered Glass"
            },
            {
                "name": "Item Hardness",
                "value": "9H"
            },
            {
                "name": "Compatible Phone Models",
                "value": "iPhone 11, iPhone XR, IPhone6/7/8"
            },
            {
                "name": "Special Feature",
                "value": "Oil Resistant, Rounded Edge, 9 H Surface Hardness, Scratch Resistant"
            },
            {
                "name": "Finish Type",
                "value": "Glossy"
            },
            {
                "name": "Water Resistance Level",
                "value": "Not Water Resistant"
            },
            {
                "name": "Unit Count",
                "value": "3.0 Count"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "HAPTIC TOUCH COMPATIBLE With Apple design guidelines in mind, this screen protector is fully compatible with Haptic Touch technology for iPhone. ULTRA HD CLARITY Ultra clear screen gives you a more rewarding and personal experience. APPLY WITH CASE ON Open space around the tempered glass ensures installation with slim cases. (Case not included).",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/ANK8P1OMW3VD1/9394f600-782b-4ca8-8423-43668e342da8._CR0,0,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/ANK8P1OMW3VD1/39ed9824-3994-4cd2-b4d7-8197b75732d7._CR0,0,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/ANK8P1OMW3VD1/fb31a117-766b-4063-be09-d1dc24a3898b._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Designed to work with iPhone 11 and iPhone XR (6.1\", 2018 2019)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/ANK8P1OMW3VD1/18d6403d-8119-4181-9299-42ce193e8899._CR0,0,970,600_PT0_SX970__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/9697e226-df0f-4d6e-b711-70a6e6748f8b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/ANK8P1OMW3VD1/9394f600-782b-4ca8-8423-43668e342da8._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/ANK8P1OMW3VD1/39ed9824-3994-4cd2-b4d7-8197b75732d7._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/ANK8P1OMW3VD1/fb31a117-766b-4063-be09-d1dc24a3898b._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/ANK8P1OMW3VD1/18d6403d-8119-4181-9299-42ce193e8899._CR0,0,970,600_PT0_SX970__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Shell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTDNJPC4WQKEEF5CIUN27KN5ZDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBS8Y7E77U47U?ASIN=B07QP1CB24",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2020",
                "reviewTitle": "5.0 out of 5 stars Best glass screen protector I’ve ever bought!",
                "reviewText": "This screen protector (3 pack) is truly wonderful! It’s a fantastic price and really a quality product. I was nervous to buy something “so affordable” for quality sake as it’s protecting a major $ investment for me📱. It arrived on time in new great packaging. The instructions are very clear and precise. My favorite thing about this set is that it comes with so many cleaners and guides so it would be very hard to mess up the install unlike most others.I applied the glass protector without a case on (because there is a screen guide you should put over your phone so the glass protector will align perfectly on your screen). I used the wet cleaner wipe to clean my phone screen, then the dry one to dry it off with no/minimal lint. Then I placed the screen guide on top of my phone and it lightly snaps on to the top/sides (won’t move but isn’t hard to take back off at all). Then I used the sticker to dab the screen to pick up any remaining lint/etc. I inspected it by tilting the phone in all directions under light to make sure I got all the lint. Then I peeled off the plastic backing to the glass protector (making sure to only lightly be touching the sides of the protector) and placed the protector inside the guide starting with the top of the screen and letting it slowly fall down into place. The protector fits perfectly inside the guide and cannot be aligned incorrectly (unless you don’t use the guide). My FAVORITE part... instructions say “tap the center of the protector/screen twice fast” and it’s like MAGIC! I should have taken a video with a different phone! It’s sooo cool! Once tapped, it starts to adhere itself to the phone and starts to force out all the air from the center outward. I didn’t have any bubbles on the first phone and on the second, there weren’t “bubbles” but like a tiny bit of air or not adhered area right on the very very edge like 1mm size really small so I just pushed on it with my finger from inside toward exiting the edge of the protector and it was then 100% perfect!!!I still do get fingerprints a Little Bit, but Nowhere near as much as I did with other ones Including Zagg. For me it is noticeably better in all areas. I haven’t got a scratch yet, but I am super careful with my phone. If it does get one, I know I can replace it with the final glass screen in the box I didn’t use or I can buy another pack if need be as they are so affordable.I will be switching to this protector exclusively from now on as I’ve known no other one with such an easy (and fun) application. I used to always DREAD applying them for fear of the dreaded air bubbles and improper alignment. This was truly a breeze.Even with me being OCD about application, it only took about 5 minutes or less if you’re not a perfectionist like me. 😬I will also be making sure all my friends and family know about these for their future needs as well!Oh and the glass has no affect on the screen’s color, brightness, clarity, camera, Face ID... nothing.💜💜💜💜💜 Would give 10 ⭐️ if I could!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J Ferguson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLC5R6TCRTXXO5W6B7OGXKS62HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UHTGE7ZPRSIV?ASIN=B07QP1CB24",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Cheap and works!",
                "reviewText": "Cheap and works great. This is the second one I’ve gotten of these. They are so much cheeper than most others. They fit perfectly and do a great job of protecting my iPhone.I’ve dropped it a couple of times and my phone is never been damaged. The first one lasted until my puppy got it off, so they might not hold up to puppy teeth but they are great for what I got them for lol",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MMR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVJ4MXJHBJWULM5LPFQG2HSXN5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14IO10WEBB0Q8?ASIN=B07QP1CB24",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great-easy to apply",
                "reviewText": "Used this screen protector on my iPhone 11 to replace my old screen protector which cracked. Well made, crystal clear & easy application.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeffrey L. Foster",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2C3N2FBFUMNRUHUE6NRWXPMPWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VSDDYVCW17HR?ASIN=B07QP1CB24",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2020",
                "reviewTitle": "4.0 out of 5 stars Very nice all in one kit that makes it easy to install correctly but not complete coverage",
                "reviewText": "UPDATE: Well I guess my original review might have been too hasty. Barely 6 weeks after installing this tempered glass screen shield on my iPhone 11, and then putting that into a pretty nice leather and TPU foldover case for additional protection, it only took one unfortunately positioned drop of the cased phone onto concrete to badly crack the bottom half of my screen. It hit concrete right where the glass screen runs up to and around the front edge of the phone, where the screen shield leaves about 2-3mm of the edge of the phone screen unprotected, while only causing a tiny chip to the very edge of this tempered glass shield itself (no cracks in the cheap shield but several in the very expensive iphone screen itself). So this shield did not really provide much protection for the edges of the iphone screen. Oh well, guess I need to get a more protective case and not expect so much from this screen shield. So I dropped the rating from 5 stars to 4 for this issue of less than adequate coverage/protection.Original comments:I bought the three-pack for my new phone because last time I put a similar one on my previous iphone I broke it during installation, then broke a second one after installation when the sides of my protective case squeezed the edges too tight. So that time I needed a third one just to get it right eventually.This kit is a self-contained all-in one kit with an installation guide-frame, three sets of glass cleansing and drying pads, and three tempered glass plates ready for installation. It is so simple even I can get it right the first time. Tear open the cleansing pad package (like opening a sugar packet in a restaurant) and wiping down the screen surface, the tearing open the drying pad and wiping off any remaining liquid from the cleansing pad. Put the guide-frame over the from of the phone, peel off the plastic sheet covering the sticky back of the tempered glass shield, set the shield inside the frame starting at the top end and it pretty much installs itself after that adhesive starts grabbing your phone's screen. All you have to do is press it down from top to bottom then squeeze out any remaining bubbles. The guide makes sure it is perfectly centered. And the nicest part of the whole process is that the tempered glass shield is a couple millimeters smaller than the front surface of my phone so once installed it leaves about 2 mm of the screen uncovered all around the edges -- so no chance for any case pinching the shield's side and/or top edges and fracturing it after successful installation. Voila'.I gave the second shield to my wife and she installed hers in about 5 minutes with no problem. And now we have a spare for when (god forbid) one of us drops our phone on its face on some gravel and shatters the shield. But not the phone's screen.The tempered glass shield has slightly rounded edges so it is really smooth to the touch when you run our fingers around the screen edges. Clear as a bell, maintains touch screen functions, installs easy, and protects the screen of the phone, all for about 2 bucks per phone, and enough to do three phones.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG52UI7DXEN5FAFWN7F7SQGQUNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SRR09IZM0I4L?ASIN=B07QP1CB24",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Buy it!",
                "reviewText": "Fits amazing on my iphone 11 and hasnt once cracked (i drop my phone A LOT)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cierra ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFULBV4OI6MCKZWOALOHFXPWUDXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLMBW00VNAEE9?ASIN=B07QP1CB24",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2020",
                "reviewTitle": "5.0 out of 5 stars Best ever Amazon purchase",
                "reviewText": "Omg. Easiest screen protector to install in the world. Doesn’t affect the integrity of the keyboard. Comes with a snap on guide so this thing is basically fool proof. And three come in the box. No sure what the stickers are there for. The snap on guide makes the job impossible to screw up so stickers are unnecessary IF that’s what they’re for lol. Idk. Best Amazon purchase ever seriously!Update: I’ve had the screen protector on for a little under a month and somehow the first screen protector I used had taken some trauma and shattered... this is for reasons unknown to me...I went into work And left my phone in the car, came out after work to use it and noticed a tiny fracture on the edge the screen, branching out from a teeny tiny shatter in the screen protector. I took my otter box off, used a credit card to lift the screen protector, and applied a new one. I still have one left. And this thing did it’s job! My screen is intact. I am just so confused as to how it happened to begin with, as I was on it before going into my job and did not Notice any damage, and there were no bumps or drops.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roxanne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 23, 2021",
                "reviewTitle": "Merci",
                "reviewText": "Bon qualité prix",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DARSHIL PATEL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 6, 2020",
                "reviewTitle": "Fits Perfect",
                "reviewText": "Easy to put on screen and fits perfectly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marie-France",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 12, 2020",
                "reviewTitle": "Très bon",
                "reviewText": "Ce colle facilement",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dylan haskett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2020",
                "reviewTitle": "Over all happy with product",
                "reviewText": "Great for price slow to get to my house",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dominic Demers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 10, 2020",
                "reviewTitle": "Bon mais long avant réception",
                "reviewText": "Bon mais long avant réception",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.99",
                "sellerName": "unicshop",
                "sellerRating": "5"
            }
        ]
    }
}