{
    "remaining_requests": 9799,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/UNBREAKcable-Protector-Bubble-Free-Installation-Case-Friendly/dp/B07QZWHF6V",
    "body": {
        "name": "UNBREAKcable Shatterproof Tempered Glass Screen Protector for iPhone 11/ iPhone XR [3-Pack] [Easy Installation Frame] [9H Hardness] [99.99% HD Clear][Bubble Free] for Apple 6.1''",
        "price": "$16.99",
        "originalPrice": "$20.99",
        "rawPrice": 16.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/UNBREAKcable-Protector-Bubble-Free-Installation-Case-Friendly/dp/B07QZWHF6V",
        "soldBy": {
            "sellerID": "A3RP6IN8VFM6HR",
            "name": "UNBREAKcable Brand Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3RP6IN8VFM6HR&asin=B07QZWHF6V&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09YLNLFKQ"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41l3ymZHrSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51zy47wqcML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5164 QKD3OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nubNGr4cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513nDHz68 L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZS0G7M4oL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tl18nuVSL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63249090-3b57-43e6-a49c-110c3ba4f105/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0255bf0-c86d-4192-8dce-2475e63976f9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f63d1afc-9864-4d9a-8dc8-108f07b841f3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b1521a87-5ce6-4a92-a982-6e3082ce02b8/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/28dd822a-a25e-4584-b98c-8e8687aeaf0e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/09738bc3-e3bd-4f9a-904c-e01488a9ed60/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the UNBREAKcable Store",
            "link": "https://www.amazon.com/stores/UNBREAKcable/page/8BDF1162-AF6F-4033-9649-5D1617F59103?ref_=ast_bln"
        },
        "brand": "UNBREAKcable",
        "merchantInfo": "UNBREAKcable Brand Store",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 20888,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🥇【Perfect fit for iPhone 11/XR】3 Packs 9H tempered glass screen protector exclusively designed for Apple iPhone 11/ XR 6.1“. 💗Please noted💗 [Our shatterproof screen protector is designed to be slightly smaller than the actual display screen, It has an open-edge design] so this tempered glass screen protector won’t interfere with Face ID or with the front camera function, which makes it case friendly and prevents bubbling and peeling around the edges.",
            "💎【Double Shatterproof Protection】Made from superior 9H tempered glass is highly durable and scratch-resistant, reinforced ​to be twice as strong as other ordinary tempered films on the market, your screen would survive a drop from a height of 6 feet (1.8 meters) to a hard surface, while its edges will not break easily. This iPhone 11/XR glass screen protector is exceptionally safe to use.",
            "👍【10s Super-easy Installation】The screen protector for iphone 11/XR includes all accessories necessary for a successful installation - 1 Installation frame, 3 alcohol wipes, 3 electrostatic dust removal stickers, 2 dust removal stickers, 1 microfiber cloth & detailed installation guide. The installation frame enables perfect alignment of the best iPhone 11/XR glass screen protectors. You can successfully install this screen protector in 10 seconds, even with no previous experience.",
            "👍【100% Bare Screen Experience & Ultra HD】This iPhone 11/XR glass screen protector is rigid but ultra-thin. The thickness of only 0.01inch makes you hardly feel its presence on the iPhone screen. 99.9% high-density glass material brings 100% clarity improvement, highly restore the best visual feast brought by the iPhone screen. Silky smooth touch feeling also give you a sensitive respond. You can wake up iPhone within 0.01s.Bring you the most natural iPhone viewing and 3D sensitive touch.",
            "👍【Bubble free & Anti-fingerprint】Thanks to its auto-adsorption technology, the UNBREAKable iPhone 11/XR tempered glass screen protector iPhone 11/XR tempered glass screen protector can self-expel any air bubbles. The surface of the protective film is treated with a plasma oleophobic coating, which is very smooth, effectively prevent fingerprints from sweat and grease, making the screen very easy to clean. The perfect crystal spotless experience makes you unwilling to stop.",
            "💗【Exclusive Lifetime Warranty Service】Our philosophy is to serve every customer. Whatever the issue you meet, feel free to contact us to find a satisfying solution. We provide 36 Months warranty and lifetime support."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2407755011"
            },
            {
                "name": "Maintenance, Upkeep & Repairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=21209105011"
            },
            {
                "name": "Screen Protectors",
                "link": "https://www.amazon.com/screen-protectors/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2407781011"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "3.52 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07QZWHF6V"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 20,888 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#866 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #122 in Cell Phone Screen Protectors"
            },
            {
                "name": "Special features",
                "value": "【99% HD Crystal Clear】【Easy to Install】【Durable 9H Hardness】【Crack Proof】【Scratch Resistant】【Touch Sensitive】【Case Friendly】【Face ID compatible】【Anti-Fingerprint】【Powfull Adsorption】【Bubble Free】"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "iPhone XR / iPhone 11"
            },
            {
                "name": "Whats in the box",
                "value": "3xiPhone 11/XR tempered glass screen protector; 1x Assembly instructions; 3x wet wipes; 1x lint-free cloth; 3x dust absorber; 2x dust stickers; 1x instruction manual"
            },
            {
                "name": "Manufacturer",
                "value": "UNBREAKcable"
            },
            {
                "name": "Date First Available",
                "value": "April 23, 2019"
            },
            {
                "name": "Brand",
                "value": "UNBREAKcable"
            },
            {
                "name": "Compatible Devices",
                "value": "iPhone 11/ iPhone XR 6.1\""
            },
            {
                "name": "Material",
                "value": "Tempered Glass"
            },
            {
                "name": "Item Hardness",
                "value": "9H"
            },
            {
                "name": "Product Dimensions",
                "value": "0.2\"L x 0.2\"W"
            },
            {
                "name": "Compatible Phone Models",
                "value": "Apple iPhone XR"
            },
            {
                "name": "Special Feature",
                "value": "【99% HD Crystal Clear】【Easy to Install】【Durable 9H Hardness】【Crack Proof】【Scratch Resistant】【Touch Sensitive】【Case Friendly】【Face ID compatible】【Anti-Fingerprint】【Powfull Adsorption】【Bubble Free】 See more"
            },
            {
                "name": "Finish Type",
                "value": "Glossy"
            },
            {
                "name": "Water Resistance Level",
                "value": "Water Repellent"
            },
            {
                "name": "Unit Count",
                "value": "3.0 Count"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "If you meet any problems below when you are using UNBREAKcable iPhone 11/ iPhone XR Screen Protector, UNBREAKcable will send you a New One: Broken/CrackAir bubblesDoesn't fit your phoneMissing Acessories",
                "media_link": []
            },
            {
                "media_text": "UNBREAKcable Tempered Glass Screen Protector for iPhone XR / iPhone 11 Q: Why choose UNBREAKcable Premium Tempered Screen Protector for your iPhone XR/ iPhone 11 OLED display? A: Even though Apple describes the OLED glass as its strongest ever on an iPhone, it's still vulnerable to cracks. Unbreakcable 9H Hardness iPhone 11/ iPhone XR Glass Screen Protector enhances shatterproof and extremely scratch-resistant for your phone screen. Q. Is the iPhone 11/ iPhone XR Screen Protector easy to install? A: Yes, UNBREAKcable iPhone 11/ iPhone XR tempered glass protector comes with all accessories needed for a succeddful installation - 1 installation frame, 3 wet cloth, 1 lint-free cloth, 3 dust absorber, 2 dust stickers and detailed installation guide.It is easy to install this bubble-free screen protector. Q: How do I ensure a successful installation with less bubbles and dust? A: Please clean the installation frame with the wet cloth before you align it on the screen. For best results, install the iPhone 11/ iPhone XR screen protector in a clean, dust-free environment. We highly recommend you read the detailed installation guide before you apply it. Q: How do I eliminate bubbles under the screen protector? A: Please following the instructionin the user manual to clean the screen before installing the iPhone 11/ iPhone XR glass screen protector. If there are still any bubbles between the screen protector and the phone screen, use the cloth provided to gently smooth them toward the closest edge of the glass protector.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/853f66d7-4554-4159-a8a9-a6f431d20d89.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Q: Does the screen protector show fingerprints? A: Because of the oleophobic coating on our screen protectors, your fingerprints won't readily smudge your screen and if there are any fingerprint smudges, they can be easily wiped away. We recommend using a microfiber cloth for quick and easy cleaning. Please kindly note that: The iPhone XR / iPhone 11 6.1 inch screen is a Curved Edge Screen, so the screen protector has to be smaller than the actual phone screen.This design ensures that this type of screen protector is compatible with most phone cases. Package Contains: 3-Pack UNBREAKcable tempered glass screen protector for iPhone XR(2018)/ iPhone 11(2019)1 Installation frame3 Wet Cloth1 Lint-free cloth3 dust absorber2 dust stickers1 User manual",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/6bb92514-916d-43a4-b2b6-8b7fe6e1283f.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/d99309ce-df05-4e9a-9e8b-3884e4e8fcd9.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/853f66d7-4554-4159-a8a9-a6f431d20d89.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Josette Verno",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGH7ONM76YQYEDUCUCPK7J3J7ZNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32QDN4LYEM7VO?ASIN=B07QZWHF6V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2020",
                "reviewTitle": "5.0 out of 5 stars Easy to install - watch the YOUTUBE video BEFORE you start!",
                "reviewText": "Wow, this was really easy to install. Please, do yourself a favor and watch the YOUTUBE video a couple of times BEFORE you start!I purchased iPhone 11's for my brother and nephew, who are notorious for breaking screens and phones. To save the headache, I bought (2) cases (it was UAG I believe) and (2) sets of these UNBREAKcable Screen Protector. Each set comes with (3) screen protectors, and believe me, I needed the extra one.I watched the video, but I thought using the sticker after I wiped down the NEW phones was a waste of time and skipped the step. DOH! DON'T DO THAT - use the sticker and re-trace your steps. Dust is tiny, tiny, and monstrous. It snuck on the first phone install, as did bubbles under the glass. Well, because I didn't watch the video close enough - DOH!I tried again, used the stickers, FOLLOWED THE INSTRUCTIONS, and voila! Perfect... looked pristine, clear glass, no bubbles, no worries. The COOLEST thing is that you get it lined up with a guidance thingie, and then you simply TOUCH THE CENTER of the protector, and it attaches like magic. This helps seal out the bubbles, but if you mess up, they have some info on how you can take it off and try again. Just READ AND FOLLOW THE INSTRUCTIONS, unlike I did at first... lol.After I removed the guidance thingie they provided, I smoothed out the edges by using the cloth provided, just to make sure it was connected entirely to the phone. Beautiful... smooth... showroom quality.After both were installed, I put them in their phone cases. If you have to switch out a SIM card, you can hold off on the last part until you've done that step.The rep at the T-Mobile store (went there with them to make sure they were set up, I'm not their phone tech... lol) commented that the screen protectors were perfect. He asked (and maybe you will too) why I bought an extra set.My nephew drops his phone ALL THE TIME. I fully expect him to crack the screen protector at some point. If they have the new ones, they can look online, take off the broken protector, and re-install another one.ANY PROTECTOR CAN BREAK. If it breaks, that means that it has probably protected the actual screen from breaking. I'd rather replace the protectors several times in the life of the phone than replace the phone. He broke his phone so bad last time that it wouldn't ring anymore. That's not very safe... and he didn't want to use a case.Buy a case and use it. Buy these protectors and use them... buy extra! Be sure to get the right size for your phone, and try this particular brand. It's fantastic, and the cost is very reasonable.If this has helped you at all, please give me a HELPFUL vote, and feel free to ask me any questions. Have a great year!",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brookelyn Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTAIHMC4SBDMOHG4LHOTWINUNLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z9OXJW00NI6H?ASIN=B07QZWHF6V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Quality",
                "reviewText": "When I got my new phone from the store, they tried to sell me a screen protector, but I only buy these screen protectors because they are amazing to install by yourself without help from a tech person. They last a long time even with me always dropping my phone everywhere. The screen protector is very durable. So, I suggest that if you are looking for screen protectors for your phone, I would buy these for sure. You get three in the package.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECFMOYMYNI55XEN2Y2MXFDEKU4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OA40GG8KHU8C?ASIN=B07QZWHF6V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars With the instructions, this was not difficult to install.",
                "reviewText": "I installed this several days ago and must remember. I believe I had some trouble at first. Yes, I enjoy skipping the instructions but decided those were needed. With the instructions, I had little trouble placing the glass screen protector on the phone. Even though you have a 3-pack, be careful. Glass is not forgiving if not applied well or with fingerprints on the bottom side of the glass. I had a little air that I worked out so the glass piece lays flat.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jdmbuddyclub",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWLBIDVQQCEJPMANBA7DFN7TVJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PX472SJAMC4V?ASIN=B07QZWHF6V",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "4.0 out of 5 stars Good protection",
                "reviewText": "Nice screen protector, fits perfectly and dose it’s job well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy Duggan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXQ5VGBGKARJSKS5EVO5ILSNZGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJETOTI0M9DTJ?ASIN=B07QZWHF6V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great! Easy Installation",
                "reviewText": "Very easy to install with no bubbles. Happy with screen protectors.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pukucopukuco",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJ5DVMVIE5QRRM6PYSS3NDSV2DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXXFN0Q2BZXA9?ASIN=B07QZWHF6V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Really holds up, even to middle schooler use",
                "reviewText": "I’m attaching a photo of one of my middle school age kid’s screen protector that I changed out today after it being on for 7 months. I feel like it was still protecting the screen, even with cracks, but my early teen kids handle their phones like they’ve been greased or something and are constantly dropping them. These are really easy to apply using the guide, or if you’ve put on as many screen protectors on iPhones as I have, they’re easy without the guide. I had no trouble pulling it off to put the new one on and it left no residue or stickiness. The size is perfect for the model indicated and the clarity and touch functionality are also very good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/6154jFRY+7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JSKJSK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF33LD45N3DGWM7ZKKDLMWSXJKBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ONUTFDQ4FPGK?ASIN=B07QZWHF6V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Updated - See written review below. This UNBREAKcable screen protector already broke.",
                "reviewText": "I dropped my phone and it spider webbed the screen protector. (Photo attached). I just bought it Oct 9th. Easy to install yes, adhesion good, instructions ok.UPDATED - Vendor sent me a replacement, thank you! No problems with the new one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71hxKzpAd1L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "chelsea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGT7ZRZYZVCDUMNA4VFQUBFDTBOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LHP5M49DFGA4?ASIN=B07QZWHF6V",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "3.0 out of 5 stars easily breakable",
                "reviewText": "Dropped my phone once about a week after putting the screen protectors on and there are now 4 cracks",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "axel malaise",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 21, 2024",
                "reviewTitle": "Solide",
                "reviewText": "Très bon rapport qualité prix. L’écran est ultra résistant. Je viens de changer le miens après 4 ans et l’écran de mon téléphone est intact.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MR K PALLETT",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 21, 2023",
                "reviewTitle": "Great value",
                "reviewText": "I have used these for some years, very strong and easy to fit",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sebastian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 24, 2023",
                "reviewTitle": "Eine hochwertige Schutzfolie für das iPhone 11 und XR",
                "reviewText": "Ich habe vor kurzem das UNBREAKcable Schutzfolien-Set für mein iPhone 11 erworben und bin von der Qualität und Leistung absolut begeistert. Das Paket enthält drei Schutzfolien, was ein großartiges Preis-Leistungs-Verhältnis bietet.Die Installation der Schutzfolie war denkbar einfach. Das Paket enthält eine detaillierte Anleitung sowie alle notwendigen Werkzeuge, um eine blasenfreie Installation zu ermöglichen. Ich war angenehm überrascht, wie einfach und schnell ich die Folie anbringen konnte, ohne dabei lästige Luftblasen oder Staub einzuschließen. Die präzise Passform der Folie für das iPhone 11 und XR ist wirklich beeindruckend.Ein weiterer bemerkenswerter Aspekt der UNBREAKcable Schutzfolie ist ihre Haltbarkeit. Die Folie besteht aus hochwertigem 9H gehärtetem Glas, das einen ausgezeichneten Schutz vor Kratzern, Stößen und Stürzen bietet. Ich habe mein iPhone mehrmals fallen gelassen, und die Schutzfolie hat es erfolgreich vor Beschädigungen bewahrt. Ich bin wirklich beeindruckt von der Widerstandsfähigkeit dieser Folie.Die Schutzfolie beeinträchtigt in keiner Weise die Berührungsempfindlichkeit des Bildschirms. Ich kann mein iPhone weiterhin problemlos bedienen und die Touch-Interaktion ist genauso reibungslos wie zuvor. Darüber hinaus ist die Oberfläche der Folie oleophob beschichtet, was bedeutet, dass Fingerabdrücke und Schmierflecken leicht abgewischt werden können.Was mir besonders gefällt, ist die Klarheit und Transparenz der UNBREAKcable Schutzfolie. Sie beeinträchtigt die Anzeigequalität meines iPhone-Bildschirms nicht und sorgt für eine gestochen scharfe Darstellung. Es gibt auch keine Verzerrungen oder Regenbogeneffekte, die bei minderwertigen Schutzfolien manchmal auftreten können.Zusammenfassend kann ich das UNBREAKcable Schutzfolien-Set für das iPhone 11 und XR nur wärmstens empfehlen. Es bietet eine einfache Installation, hervorragende Haltbarkeit, hervorragenden Schutz und verbesserte Sichtbarkeit.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 15, 2021",
                "reviewTitle": "Okay but you can buy better",
                "reviewText": "Good screen protector, a bit expensive.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 1, 2020",
                "reviewTitle": "Por fín calidad",
                "reviewText": "Buenas solo probada en uso diario, aun no se lo resistente que pueda ser.Se monta de vicio, se quitan las burbujas de vicio, y el tacto es el mejor que he probado.Es el mejor protector que he montado nunca en mis móviles.se limpia perfecto y de los que he tenido el que menos distorsiona la pantalla.Vamos, muy recomendable.Importante verte un video que te recomiendan en el interior del paquete. Te dará confianza para eliminar las burbujas, pero con el marco de guiado que viene no tendrás ningún problema al montarlo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}