{
    "remaining_requests": 9785,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/amFilm-Protector-Dispersion-Fingerprint-Application/dp/B09RKFDJZ8",
    "body": {
        "name": "amFilm Glass Screen Protector for Samsung Galaxy S22 Ultra, 3D Curved with Liquid Dispersion Tech, Designed for Fingerprint Reader, Upgraded Easier Application Tray, Tempered Glass, 3 Pack",
        "price": "$33.99",
        "originalPrice": "",
        "rawPrice": 33.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/amFilm-Protector-Dispersion-Fingerprint-Application/dp/B09RKFDJZ8",
        "soldBy": {
            "sellerID": "AG8AYSVS7E5IO",
            "name": "TechMatte",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AG8AYSVS7E5IO&asin=B09RKFDJZ8&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51AKBl-BN0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51nds-vcPyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gqLRJbMXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NpRMSPdVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41t3HGN8Z-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fCH3SETYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bsFGQrdlL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ca2d0185-7a5a-480f-91e1-1a16f1e4ab49/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/93e5dac2-f3e9-4175-a947-01306a470a79/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/586eba53-3ffa-4999-bb7f-0a2a7b0c057b/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the amFilm Store",
            "link": "https://www.amazon.com/stores/amFilm/page/9685BAE8-F9DE-4B7C-91FA-92EB2EAA7830?ref_=ast_bln"
        },
        "brand": "amFilm",
        "merchantInfo": "TechMatte",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 808,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Fully Compatible with UltraSonic Fingerprint Scanner】 Unlike any alternative on the market, this Samsung Galaxy S22 Ultra glass protector will work fully with the Ultrasonic Fingerprint Scanner. Simply re-scan your fingerprint AFTER application. (Please be advised - the four dots around the scanner ARE supposed to be there. They are part of the solution to allow the fingerprint scanner to work)",
            "【Upgraded Installation Tray】Compared with other Installation trays, we made absorbent pads and bubble levels on the Installation tray, simplifying the installation steps and making the installation easier. DO please test the UV light before installation.",
            "【3D Curved Glass & Full Compatibility Touch Sensitivity】This protector covers the rounded edges of the S22 Ultra with fine finished oleophobic coating to reduce fingerprints and provides your S22 Ultra scratch resistance, 99.9% ultra-clear high definition transparency, drop protection and full compatibility with touchscreen sensitivity.",
            "【Installation video and Manual】 This package comes with all components needed to get a perfect installation, including a detailed application manual (with pictures) and a demonstration video. Please watch our installation Video at least once before installation (available on this webpage and manual).",
            "【Shop with Confidence】 We offer round-the-clock customer support. If you encountered any issues during or after the application, just send us an email and we'll be more than happy to assist you."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b?ie=UTF8&node=2407755011"
            },
            {
                "name": "Maintenance, Upkeep & Repairs",
                "link": "https://www.amazon.com/b?ie=UTF8&node=21209105011"
            },
            {
                "name": "Screen Protectors",
                "link": "https://www.amazon.com/screen-protectors/b?ie=UTF8&node=2407781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5.91\"L x 3.94\"W"
            },
            {
                "name": "Item Weight",
                "value": "8.8 ounces"
            },
            {
                "name": "ASIN",
                "value": "B09RKFDJZ8"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 808 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,429 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #1,330 in Cell Phone Screen Protectors"
            },
            {
                "name": "Special features",
                "value": "Anti-Fingerprint, Scratch Resistant"
            },
            {
                "name": "Manufacturer",
                "value": "Techmatte"
            },
            {
                "name": "Date First Available",
                "value": "January 19, 2022"
            },
            {
                "name": "Brand",
                "value": "amFilm"
            },
            {
                "name": "Compatible Devices",
                "value": "Samsung Galaxy S22 Ultra"
            },
            {
                "name": "Material",
                "value": "Tempered Glass"
            },
            {
                "name": "Item Hardness",
                "value": "9H"
            },
            {
                "name": "Compatible Phone Models",
                "value": "Samsung Galaxy S22 Ultra"
            },
            {
                "name": "Special Feature",
                "value": "Anti-Fingerprint, Scratch Resistant"
            },
            {
                "name": "Finish Type",
                "value": "Glossy"
            },
            {
                "name": "Water Resistance Level",
                "value": "Water Resistant"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c61144d8-454f-4f60-afb7-62fbcc48698e.__CR0,0,1666,500_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/465e49ee-6e62-4340-8db6-99318ff56653.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a02d246-ad6e-4884-b181-2fa23caf5831.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/426ff527-d64e-4839-93a9-bc096efb3d52.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/246bb0f0-00ca-4354-9970-e89d6da307f4.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ac1cd869-215b-42ff-ad19-643222b90054.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4525a3d1-a378-4ca7-9c9d-82e4362c4eee.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Thomas Allen Gerdau",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXMKD3YJAL3ZHPPCNJRUKO3Z5VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REGQCF1SC2Y4Q?ASIN=B09RKFDJZ8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Best screen protector I've found so far.",
                "reviewText": "Okay, usually I only write reviews to let people know not to buy something that sucks. This is not the case here.First, I've gone through a couple other Doreen protectors for this phone. The fingerprint sensor location for the S21 and S22 is pretty annoying, but what's even more annoying is that every screen protector I tried before this has a visible circle over the fingerprint sensor that is absolutley obnoxious. Want to watch a video on your phone, I hope you like a black dot where the front facing camera is and a big separately transparent circle like a dirty reflection spot on your screen distracting you from whatever it is you're watching or looking at. This screen protector covers the whole screen without said annoying circle.I worried that because it lacked the annoying circle, the fingerprint would be as impossible to read as it was with the others. Did I mention that the circle didn't provide easier scanning at all and made it next to impossible to use? I had to turn off fingerprint scanning altogether to get into locked apps and prevent being locked out of my phone. This one works just fine. It feels like I have to press down a little harder than without a screen protector, but that's worth it to avoid paying another $450 for a new display. (The glass isn't the olny thing that breaks when you drop these phones. Its happened to me twice now.)The last thing I worried about was the installation. I always have dust, my own fingerprint on the adhesive side while placing it on the screen, and air bubbles that just won't come out with other protectors. The device that you use to install this one keeps all of that from happening. You still have to be careful to get all of the dust and little fibers off. One downside is the foam surrounding the phone in the tray can leave fibers on the screen as you finish wiping the edges. Get all of those off and you're golden. The adhesive is easy to apply, spreads evenly across the screen as the tray drops the screen protector on evenly the way you can't with your own shaky hands if you're not a surgeon like I assume most of you aren't.Bonus is that this comes with 2 additional screen protectors, adhesive tubes, and cleaning accessories. Hopefully I don't have to find out how tough this protector is, but if I do, it'll be easy to replace it with the spares and reusable tray and UV light.I gave the installation difficulty 4 stars because it doesn't just slap on. You do have to follow the directions closely and carefully. But this is the first time I've installed one with zero issues, and my screen looks brand new without even noticing there's a screen protector on it.Worth. Every. Penny.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tracy I.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXBWQG2ORKQH77LBZHEXPBSNWWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PG5BA24R5JI5?ASIN=B09RKFDJZ8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Absolutely Perfect - GREAT PRODUCT",
                "reviewText": "The instructions are super easy to follow and the installation went perfectly.The adhesive slowly spreads to all corners with no bubbles anywhere.Absolutely the best screen protector I have used on any of my Galaxy Ultras so far.The fingerprint reading works. Best part is you are rough on screens you have 2 more to use.Highly recomend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ender Wiggin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWVH3W3RZNDKELJ6P4QQPS7ZCWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PWMDJYHV61UC?ASIN=B09RKFDJZ8",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2022",
                "reviewTitle": "1.0 out of 5 stars Price keeps increasing, but quality steadily declines",
                "reviewText": "I *was* an avid user and promoter of this brand until recently. I've had their protectors on almost anything with a screen. Much like when Zagg traded their glass protectors for that hybrid nonsense, it's time to find a new brand.The adhesive bubbles up coming out of the tube, which leaves bubbles that require a surgeon's precision to remove with ruining the process. This is assuming you have already waited over a minute for the glue to settle and come to realize that the claims it will clear them on its own are not always true. The tray doesn't line them up well, so expect a gap at the top on the first one and possibly the next if it's been more than a couple days and you forget the tray isn't accurate. Pay attention to wipe out the speaker after the glue settles. Unlike past versions, nothing is provided to keep glue out of it. Double sided tape also works to carefully remove the glue after the initial pass of the UV light.Make sure to remove the sticker for the fingerprint immediately after lining up the metal cylinder. The instructions say otherwise, but also don't show the imprinted text that you will see once natural light hits the screen. Also make sure there are no significant hairs or anything else on the screen after the initial pass. Much like sunscreen on a sleeping man at the beach, it will leave an outline.All of this can be compensated for with a single good install. Unfortunately, the curved edges only fit in one specific place and a pile of liquid is spreading across the screen that makes it hard to see where the protector is sitting. It looks fine until it's too late because the tray leaves more than enough room for the protector to slide just enough. It's only after curing and taking the phone outside that you realize it is just a hair too far to one side. The problem is that even the slightest bit of a lifted edge is a ticking time bomb. It's easy to overlook all the tiny bubbles, but it's only a matter of time before a loose edge leads to the protector failing.Rest assured that you are given a lifetime warranty. What they fail to mention is that the warranty only covers a single protector, the inserts to capture excess glue, the glue, and the cloths. You would think by saving money on the installation materials and charging nearly twice the cost of most cases, you would get two. After all, the most expensive part of the kit is the light. I am sure the adhesive costs a little more than slapping it on during production, but it is over three times more expensive than the protectors alone.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joseph RiggioJoseph Riggio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSYAQZVSVX4EXRLVZ246CXGLXHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCIMXFGVWD82H?ASIN=B09RKFDJZ8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "4.0 out of 5 stars improved but not perfect",
                "reviewText": "looks good and its \"easier\" to install with the new frame.not perfect and you can still easily mess up.this is the third time maybe fourth installing one of these UV resin protectors and I managed to trap a bubble. Better then regular adhesive but good luck getting it right the first time.that said I like that the new design that covers the front camera because its one less place to mess up the alignment and there's no loss to camera quality (so long as you don't trap a bubble right on top of it).I purchased from amFilm before and contacted customer support after trapping a big air bubble since they promised to replace the protector if you trap a bubble. That turned into a long email exchange that I eventually gave up on.I would not consider buying this if you are worried about getting replacements. I would just buy the 3 pack and accept failure as an option for the first try.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61kMPUoKC2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Ar55TZlML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de AmazonCliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 13, 2023",
                "reviewTitle": "Excelente calidad",
                "reviewText": "Tenia mis dudas por los comentarios de otros compradores, pero en mi propia experiencia, fue sencillo de instalar siguiendo las instrucciones, mi pantalla tenia algunos rayones por caídas, y al ponerle el protector por el liquido quedo como nueva la pantalla. Después volví a capturar mis huellas y todo funciono correctamente. Queda espacio para ponerle un protector. Recomendado ampliamente.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51KiP5KxROL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 26, 2023",
                "reviewTitle": "Fingerprint Scanner Compromised, Otherwise Fantastic!",
                "reviewText": "Purely as protection and for every other feature than Fingerprint Scanning this really does feel like a 5-Star product. If you can risk not having use of that feature, I would definitely recommend this product.The only issue was the expectation that the Fingerprint Scanner would work and even with increasing the sensitivity/rescanning it is heavily compromised! it is clear seeing similar products which utilise sticker/weight combinations for this part of the screen that there does not seem to be a similar solution here. I will be looking at a similar product offered (the 2-pack version) for my partner/redundancy as it seems to be more Fingerprint Scanning compatible.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HTM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on June 19, 2022",
                "reviewTitle": "Works extremely well with the Galaxy S22 Ultra (with UAG PATHFINDER case)",
                "reviewText": "I am pleased with the product, instructions were clear and they fit my Galaxy S22 Ultra perfectly. Success on first-attempt.I live in a tropical climate and the screen protector has been on my phone for at least 4 months now, there is no sign of separation or penetration of foreign liquids. Still looks good as new.Fingerprint scanner still works with the screen protector.I use a UAG PATHFINDER case for the phone (removed and reinserted the case multiple times) and it does not affect the placement of the screen protector. I give credit to the amFilm tray! solid engineering!TIP: After you do the initial cleaning to prep your phone screen, please turn the screen on (white display) to check for any black / dark debris. They may not be noticeable when the screen is off.Many thanks to the youtube reviews and customer reviews in giving me confidence to buy this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CARLOSCARLOS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 10, 2023",
                "reviewTitle": "Buenísimo producto",
                "reviewText": "Al comprarlo tenia mis dudas por los comentarios negativos pero cuando lo instale quede encantado. La intalacion es algo tardada a comparación a las micas que ya tienen el pegamento. Las instrucciones son claras el cual hace la intalacion super facil! Me gusto que el protector cubre toda la pantalla incluyendo la cámara frontal, tiene un margen muy pequeño alrededor pero no no es parte del siplay, ese si lo cubre por completo. Lo recomiendo 100%!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71h7k4A-YxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61gEwAXUrOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61w7ZLBYmTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Damien Sidhanand",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on June 6, 2022",
                "reviewTitle": "Very disappointing.",
                "reviewText": "Took the 3-pack to a mobile phone accessory store to have a professional apply them and there was debris in 2 of the glue tubes & little bubbles in all 3 applications. 3 tries to get one protector on, 2 completely wasted pieces of glass and there's bubbles under this one.I should mention this is after I tried to install an initial 3-pack by myself with bubbles after every application after closely following the instructional video.Burned a lot of cash. 1 star because the fingerprint sensor does work well...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}