{
    "remaining_requests": 9551,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TWIST-Liquid-Screen-Protector-Devices/dp/B0C9BPLPNC",
    "body": {
        "name": "TWIST PEN Liquid Glass Screen Protector for up to 10 Devices - Brush On Scratch and Crack Resistant Nano Protection for All Phones Tablets Smart Watches Universal",
        "price": "$9.99$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TWIST-Liquid-Screen-Protector-Devices/dp/B0C9BPLPNC",
        "soldBy": {
            "sellerID": "A1YCN99H7TYRNH",
            "name": "Luvvitt",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1YCN99H7TYRNH&asin=B0C9BPLPNC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41wjEDhSTBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41HxEewqzDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/619akds8W4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XHwRiauYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lC2t3rimL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51114Y f5dL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: ProofTech",
            "link": "https://www.amazon.com/ProofTech/b/ref=bl_dp_s_web_21490200011?ie=UTF8&node=21490200011&field-lbr_brands_browse-bin=ProofTech"
        },
        "brand": "ProofTech",
        "merchantInfo": "Luvvitt",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 70,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 17. Order within 4 hrs 59 mins",
            "FREE pickup Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 17. Order within 14 hrs 29 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Revolutionary Protection: The TWIST PEN Liquid Screen Protector leverages advanced SiO2 technology and a unique proprietary component, providing a robust shield that significantly enhances the strength and scratch resistance of your device's screen. Compatible with all mobile devices including foldable phones and curved screens.",
            "Innovative Design: Patent-pending TWIST PEN design redefines the application process, making it as simple as twist, glide, and protect. TWIST PEN ensures a smooth, perfectly even application, resulting in a microscopic, nearly invisible shield that adheres seamlessly to your screen.",
            "Universal: Compatible with all mobile devices, phones, tablets and smart watches, cameras, touch screens. 100% Compatible with fingerprint readers or sensors.",
            "Multi-device Coverage: One TWIST PEN Liquid Screen Protector offers coverage for up to 10 devices, making it a cost-effective solution for tech enthusiasts and multi-device households.",
            "Complete Protection Kit: Each TWIST PEN comes bundled with a high-quality screen cleaner spray, and a large, real microfiber cloth ensuring optimal adherence of the advanced protective solution on a pristine, perfectly prepared screen."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2407755011"
            },
            {
                "name": "Maintenance, Upkeep & Repairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=21209105011"
            },
            {
                "name": "Screen Protectors",
                "link": "https://www.amazon.com/screen-protectors/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2407781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5.71\"L x 3.03\"W"
            },
            {
                "name": "Item Weight",
                "value": "2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0C9BPLPNC"
            },
            {
                "name": "Item model number",
                "value": "PTTWISTPENLG"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 70 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,147 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #1,033 in Cell Phone Screen Protectors"
            },
            {
                "name": "Special features",
                "value": "Scratch Resistant"
            },
            {
                "name": "Color",
                "value": "Clear"
            },
            {
                "name": "Manufacturer",
                "value": "ProofTech"
            },
            {
                "name": "Date First Available",
                "value": "July 15, 2023"
            },
            {
                "name": "Brand",
                "value": "ProofTech"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop, Desktop, Tablet, Cellphone, Smartwatch"
            },
            {
                "name": "Material",
                "value": "Glass"
            },
            {
                "name": "Item Hardness",
                "value": "9H"
            },
            {
                "name": "Compatible Phone Models",
                "value": "iPhone 14, Universal, Galaxy S23+, Galaxy S23 Ultra, Samsung Galaxy S23"
            },
            {
                "name": "Special Feature",
                "value": "Scratch Resistant"
            },
            {
                "name": "Finish Type",
                "value": "Glossy"
            },
            {
                "name": "Water Resistance Level",
                "value": "Waterproof"
            },
            {
                "name": "Screen Size",
                "value": "55 Millimeters"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Screen Defence, Now With a Twist! - Meet Our Innovative Liquid Glass Protector Pen!\" Twist, Glide, Protect: Unleash the Power of the Liquid Screen Protector Pen! Introducing the new, patent-pending TWIST PEN Liquid Screen Protector, an innovative breakthrough in the realm of device safety. At the heart of this new revolutionary protector lies a pioneering fusion of advanced SiO2 technology and a unique, proprietary component. This powerful combination, like a secret formula, transcends conventional standards, unlocking an unparalleled level of strength, durability, scratch and crack resistance, providing a protective shield like no other. This innovative TWIST PEN design simplifies the application process to just twist, glide, and protect. The efficient design ensures a flawlessly smooth, bubble-free application, culminating in an almost imperceptible, microscopic shield that embraces every inch of your screen. The protective solution, supercharged with silicon dioxide nanoparticles and our exclusive additional component, seamlessly bonds to your screen, forming a fortress against scratches, cracks, and the strains of everyday use. Adding to the TWIST PEN Liquid Glass Screen Protector's advantages is its impressive coverage capacity. With the ability to protect up to 10 devices, it stands as a cost-effective solution for tech aficionados or multi-device households. To further enhance the protection process, each TWIST PEN comes bundled with a high-quality screen cleaner spray. This aids in preparing your device for the optimal adherence of the advanced protective solution, ensuring a pristine and flawless application. Unlike traditional tempered glass protectors, our TWIST PEN design eliminates the struggle with alignment, bubbles, and dust particles. It simplifies the application process to just twist, glide, and protect, ensuring a flawlessly smooth, bubble-free application. This efficient design forms a microscopic, almost imperceptible shield that extends across every inch of your screen, offering comprehensive coverage and superior protection. Step into the new era of screen protection with the TWIST PEN Liquid Glass Screen Protector. More than just a product, it's a revolutionary shift in device safety, offering unparalleled protection and extraordinary ease of use. Welcome to a new dawn in screen protection, where advanced technology and convenience converge to create the ultimate protective shield for your device. .",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e6f9c3cd-7f5e-4d6e-8f9b-044237393342.__CR88,55,1764,1091_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Nanotech Mastery: How TWIST PEN Reinforces Your Screen on a Microscopic Scale TWIST PEN Liquid Screen Protector: Harnessing Microscopic Science for Unparalleled Screen Defense Even under a microscope, the surface of a device's glass screen reveals an array of subtle ridges and valleys. These microscopic inconsistencies are inherent to glass production, and they can become points of vulnerability when your device encounters the strains of daily use. This is where the magic of the TWIST PEN Liquid Screen Protector comes into play. The TWIST PEN's protective solution, imbued with a potent fusion of advanced SiO2 technology and a unique proprietary component, is designed to work in harmony with these natural contours of your screen. Upon application, this remarkable compound enhances the existing glass surface, boosting its inherent durability by weaving itself into the screen's existing architecture.The result is a screen surface that's not just protected, but fortified. The TWIST PEN Liquid Screen Protector effectively mitigates the inherent weak points in the glass, strengthening its resistance to everyday wear and tear. With this added resilience, your screen becomes tougher and more robust, its enhanced hardness offering superior protection against scratches and damage from everyday use. .",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ca10af3-0d12-4f00-911c-d3ed3e93b596.__CR88,55,1764,1091_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Effortless APPLICATION – Twist, Glide, Protect CLEAN Thoroughly clean all glass surfaces using the provided cleaning spray and microfiber cloth, ensuring that the screen is free of any dust, smudges, or debris. APPLY Open the Twist Pen's cap. Holding the Twist Pen on top of the screen, twist the back end multiple times until liquid is dispensed onto the brush tip. Then, apply the solution gently onto the screen using smooth strokes, ensuring coverage across the entire screen. It does NOT have to be spread perfectly even. DRY Allow the glass surface to cure for at least 30 minutes (While 30 minutes is enough, leaving the coating on overnight to allow it to bond and cure may yield better results. BUFF Use the supplied microfiber cloth to buff the glass surface in a circular motion to remove any residues.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96b94cd8-087d-498a-918b-a06b0eeeb170.__CR102,53,479,479_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a27647b-7cd5-4cfc-b87d-d32b3d3425e6.__CR90,81,446,446_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efbebbe1-0990-4a8d-abea-fa4b2ad255d7.__CR69,0,483,483_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eeb775ff-0adc-4742-89e1-b2141b5c4be8.__CR90,18,440,440_PT0_SX220_V1___.png"
                ]
            },
            {
                "media_text": "FEATURES Why TWIST PEN? Innovative and Effortless application: TWIST-PEN revolutionizes device protection with its new and innovative twist application process. Simply Twist, Glide, and Voila - your screen is safeguarded effortlessly.New, Unrivaled strength: Experience the exceptional power of SPRAY-ON's advanced proprietary formula, delivering unmatched strength and resilience for liquid screen protection.Multi-device coverage: With a single SPRAY-ON application, protect up to 10 devices, offering cost-effective protection for tech enthusiasts and multi-device households.Fingerprint sensor compatibility: TWIST-PEN does not affect or interfere with the functionality of fingerprint sensors, ensuring seamless and reliable performance.Invisible, ultra-thin layer: Add an additional layer of glass that's thinner than a hair and invisible to the naked eye, enhancing the protection of your device without compromising its sleek appearance.Versatile application: TWIST-PEN can be applied over the camera and front speaker on the glass, providing comprehensive protection for every aspect of your screen.Compatible with tempered glass: TWIST-PEN can be applied under or on top of a tempered glass protector, offering flexibility for different device setups.Easy cleaning: TWIST-PEN makes the screen easy to clean by adding a layer that repels smudges and fingerprints, ensuring a clean and pristine display.Complete protection package: Each TWIST-PEN Liquid Screen Protector comes with its own screen cleaning spray and a large, high-quality microfiber cloth, providing a comprehensive solution for screen protection and maintenance.Backed by industry leader ProofTech: Opting for TWIST PEN means you're placing trust in ProofTech's long-standing reputation for quality and innovation. ProofTech's history of excellence lends credibility to TWIST PEN, giving you peace of mind knowing you're choosing a product crafted to the highest standards. With ProofTech's extensive experience, you can be confident in the superior protection your device receives.Universal compatibility: TWIST-PEN is compatible with all mobile devices, phones, smartwatches, tablets, and foldable phones like Z-Fold, Z-Flip, and Pixel Fold, ensuring versatile screen protection for various devices.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3cc64b66-4cb1-4822-bb05-392497d06687.__CR88,55,1764,1091_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "TWIST-PEN Liquid Screen Protector SPRAY-ON Liquid Screen Protector DROP-ON Liquid Screen Protector LIQUID GLASS Screen Protector OLEOPEL Oleophobic Coating Scratch Removal Kit Format Pen Spray Dropper Bottle Vial Wipe Kit Purpose Screen Protection Screen Protection Screen Protection Screen Protection Oleophobic Coating Scratch Removal",
                "media_link": []
            },
            {
                "media_text": "Step into ProofTech's Worldwide Circle of Satisfaction - Shielding Millions of Devices Globally",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ae51916-7a39-4dbe-82c9-52d94a545ed7.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e6f9c3cd-7f5e-4d6e-8f9b-044237393342.__CR88,55,1764,1091_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ca10af3-0d12-4f00-911c-d3ed3e93b596.__CR88,55,1764,1091_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96b94cd8-087d-498a-918b-a06b0eeeb170.__CR102,53,479,479_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a27647b-7cd5-4cfc-b87d-d32b3d3425e6.__CR90,81,446,446_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efbebbe1-0990-4a8d-abea-fa4b2ad255d7.__CR69,0,483,483_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eeb775ff-0adc-4742-89e1-b2141b5c4be8.__CR90,18,440,440_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3cc64b66-4cb1-4822-bb05-392497d06687.__CR88,55,1764,1091_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9150ed07-8309-4f0a-a22f-960703267647.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9b1c331c-9444-4027-a231-1aa772fc9eb3.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/12948008-bdf7-4cb0-8559-edfaa168dbe2.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4158d6f-1cb2-41de-9ac7-a67bada56f04.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb86d7b5-f56e-4798-95c6-6454140f9302.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8acc1cf9-3eba-4750-8d77-b51d713dec07.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ae51916-7a39-4dbe-82c9-52d94a545ed7.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jason W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMXKITZUZUPJZ6LTS5APV7GJL7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1185TLY9X74T5?ASIN=B0C9BPLPNC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "Works great and easy to apply, just wait as long as you can before wiping it off.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SherGill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEOJGV2WA42OUWMEEJU4EQXIMWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RMMXZAVZAAQ3?ASIN=B0C9BPLPNC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2023",
                "reviewTitle": "5.0 out of 5 stars ⭐️⭐️⭐️⭐️⭐️ (5 out of 5 stars)",
                "reviewText": "ProofTech has undoubtedly raised the bar with its TWIST PEN Liquid Glass Screen Protector. It's a game-changer in the realm of device protection! The brush-on application process is seamless, ensuring even coverage for any device, be it phones, tablets, or smartwatches. Since applying, I've noticed my devices resist scratches and cracks far better than with traditional protectors. The nano protection technology not only sounds futuristic but genuinely delivers on its promises. A universal solution that's both efficient and effective - a must-have for tech enthusiasts! Highly recommended.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Oberkrieser",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGQQTQCG6K7MVICIAISGH4VIBZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LNOPN64KFYC?ASIN=B0C9BPLPNC",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "1.0 out of 5 stars I'm not impressed",
                "reviewText": "I bought this product to use on an older iPad that my child uses, wanting to have a little extra protection for the screen in addition to a screen protector. I followed the instructions, though they are vague where it comes to the application. Do I twist the cap clockwise or counter-clockwise? Clockwise just clicked. Counter-clockwise seemed to hit resistance. I'm assuming the idea is like operating a tube of chapstick or glue, that when you rotate the cap it puts pressure on the liquid to come out of the brush. Well that never really happened for me. It did a few large drops of liquid, but really the brush was almost dry the whole time. I attempted the application anyway, but like the other reviewed mentioned, it just left a lot of streaks on the iPad, and after an hour I cleaned the streaks away and want to move on without this product. The internal mechanism that the twist top engages with broke, so that might be part of the problem, so if that's the case, I think the manufacturer has some quality control work to do with this product. I did not reach out to the manufacturer to ask for a replacement because even with the little bit of application I attempted, I am not convinced this product performs as advertised. I did reach out to Amazon for a refund because the product broke, so I have initiated the return process. Feedback for manufacturer: better instructions, application videos so we know what the application process should look like... are we dry-brushing this product on, or is it supposed to be coated in liquid?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melina Lockhart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRSFGC3NS3XZPCRD7ZE3KJANLRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UE3E0BKWZRTV?ASIN=B0C9BPLPNC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Goes on easy , nice and clear",
                "reviewText": "Ease of application , scratch protection",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "brghtii",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHASAS6HIOSVKAXEEUQYUZ2Z6OBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DBGSN6ILK5LO?ASIN=B0C9BPLPNC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Easy to use!!!!",
                "reviewText": "I have used it on 4 phones, a watch and an iPad. I don't know how well it works because I just used it. Super easy to use!! It has a patent pending . I have cuticle oil in these same twist pens. A cool concept to use these pens.4stars because I don't know how durable it is. I hope it is very durable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebecca",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEVWKZZ3WKSZB5EEIQSEJMW7YPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UEIH10O2XJB7?ASIN=B0C9BPLPNC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "3.0 out of 5 stars It's ok",
                "reviewText": "I'm not sure I like this stuff I see after a few weeks of using it my phone has little bubbles in it like the stuff just came off. I have not dropped my phone yet so that shouldn't be why there's bubbles in it. It also said i can use it on 5 phones the fiest one i bought i barely got one phone out of it..I would buy another product",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter D Loveland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHN4SY5HG3FXIN6H5P6CYY7INVXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16L711B3O9NML?ASIN=B0C9BPLPNC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Great project",
                "reviewText": "On time good price",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF753J4IFYK3XOUMJRQNJRIRNKZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CTROZJCT5HIW?ASIN=B0C9BPLPNC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars It’s okay",
                "reviewText": "Just get finger smudges on it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}