{
    "remaining_requests": 9776,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/amFilm-Compatible-UltraSonic-Fingerprint-Application/dp/B09Q8RBZBS",
    "body": {
        "name": "amFilm 3D Curved for S22 Ultra Screen ProtectorSamsung Galaxy 5g,Samsung Galaxy S22 Ultra, Fully Compatible with UltraSonic Fingerprint Scanner and S Pen, UV Gel Application, Tempered Glass, 2 Pack",
        "price": "$33.99",
        "originalPrice": "$39.99",
        "rawPrice": 33.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/amFilm-Compatible-UltraSonic-Fingerprint-Application/dp/B09Q8RBZBS",
        "soldBy": {
            "sellerID": "AG8AYSVS7E5IO",
            "name": "TechMatte",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AG8AYSVS7E5IO&asin=B09Q8RBZBS&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51KC59gN0ZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Hk-vb-v9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fCH3SETYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bYsea2iqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uVfZN0SkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41h1Xbs6xTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81GJzUuZZzL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1421c692-ab93-4e95-a4e4-c16057b3e65e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/93e5dac2-f3e9-4175-a947-01306a470a79/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/586eba53-3ffa-4999-bb7f-0a2a7b0c057b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fca71c4d-4eb2-412d-85d3-b3e9111331c6/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the amFilm Store",
            "link": "https://www.amazon.com/stores/amFilm/page/9685BAE8-F9DE-4B7C-91FA-92EB2EAA7830?ref_=ast_bln"
        },
        "brand": "amFilm",
        "merchantInfo": "TechMatte",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 2549,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[Fully Compatible with UltraSonic Fingerprint Scanner] Unlike any alternative on the market, this Samsung Galaxy S22 Ultra glass protector will work fully with the Ultrasonic Fingerprint Scanner. Simply re-scan your fingerprint AFTER application. (Please be advised - the four dots around the scanner ARE supposed to be there. They are part of the solution to allow the fingerprint scanner to work)",
            "[Upgraded Installation] Compared with other, we made absorbent pads and bubble levels on the Installation tray, simplifying the installation steps and making the installation easier. TWO gel drips to help with a quick/equal spread of UV Gel, and a full coverage UV light for less curing time. This new design is much more forgiving on user-errors! Stress less! DO please test the UV light before installation.",
            "[3D Curved Glass & Full Compatibility Touch Sensitivity]This protector covers the rounded edges of the S22 Ultra with fine finished oleophobic coating to reduce fingerprints and provides your S22 Ultra scratch resistance, 99.9% ultra-clear high definition transparency, drop protection and full compatibility with touchscreen sensitivity.",
            "[Installation video and Manual] This package comes with all components needed to get a perfect installation, including a detailed application manual (with pictures) and a demonstration video. Please watch our installation Video at least once before installation (available on this webpage and manual).",
            "[Shop with Confidence] We offer round-the-clock customer support. If you encountered any issues during or after the application, just send us an email and we'll be more than happy to assist you."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2407755011"
            },
            {
                "name": "Maintenance, Upkeep & Repairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=21209105011"
            },
            {
                "name": "Screen Protectors",
                "link": "https://www.amazon.com/screen-protectors/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2407781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7.87\"L x 4.53\"W"
            },
            {
                "name": "Item Weight",
                "value": "8.1 ounces"
            },
            {
                "name": "ASIN",
                "value": "B09Q8RBZBS"
            },
            {
                "name": "Item model number",
                "value": "S22U-UV"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 2,549 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,430 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #1,043 in Cell Phone Screen Protectors"
            },
            {
                "name": "OS",
                "value": "Android"
            },
            {
                "name": "Special features",
                "value": "Anti-Fingerprint, Scratch Resistant"
            },
            {
                "name": "Manufacturer",
                "value": "TechMatte"
            },
            {
                "name": "Date First Available",
                "value": "February 9, 2022"
            },
            {
                "name": "Brand",
                "value": "amFilm"
            },
            {
                "name": "Compatible Devices",
                "value": "Cellphone"
            },
            {
                "name": "Material",
                "value": "Glass"
            },
            {
                "name": "Item Hardness",
                "value": "9H"
            },
            {
                "name": "Compatible Phone Models",
                "value": "Samsung Galaxy S22 Ultra 2022"
            },
            {
                "name": "Special Feature",
                "value": "Anti-Fingerprint, Scratch Resistant"
            },
            {
                "name": "Finish Type",
                "value": "Glossy"
            },
            {
                "name": "Water Resistance Level",
                "value": "Waterproof"
            },
            {
                "name": "Unit Count",
                "value": "2 Count"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "amFilm S22 Ultra 6.8\" Screen Protector amFilm S22 Ultra 6.8\" Screen Protector iPhone 14 6.1'' iPhone 14 Pro 6.1'' iPhone 14 Plus 6.7'' iPhone 14 Pro Max 6.7'' Quantity in Pack 2 2 2 2 2 Thickness 0.33mm 0.33mm 0.33mm 0.33mm 0.33mm Hardness 9H 9H 9H 9H 9H Transparency 99.99% 99.99% 99.99% 99.99% 99.99%",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3136bc02-13be-4892-bb0f-8565377a48b2.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e0db3db0-f7fc-4cfa-8fb8-1ccee072125d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/93895481-85fc-4e2e-8376-f75ab0b2aadf.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/246bb0f0-00ca-4354-9970-e89d6da307f4.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4b87341-fa18-4130-a113-71be7da55267.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/816b90a2-7e3c-4eee-b976-37103ad80c78.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8bd37da7-62d1-4218-a59d-2926f774c387.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ecd82ea6-e67b-40ce-9f73-b5bdfddf2110.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f36ca81f-88cd-45e9-b7c0-db9b6f817d5c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/644752ae-75ab-4755-9db0-4dad842a021f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7147269b-6d6c-47b3-839c-254c99191f18.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55ddac73-fe4a-472a-bafe-b7dd9873dbcf.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mission Specialist",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGC2UR2ZHIZQFQVZDGB6OIVWCMHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R391PHJJIH3U6R?ASIN=B09Q8RBZBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2023",
                "reviewTitle": "5.0 out of 5 stars What others don't tell you",
                "reviewText": "First, I have used several brands of screen protectors.There are basically two kinds. Ones like this that bond completely to the screen, there are only a few of this type or ones that use adhesive on the edges. Most of them are the second type.The quality of that second type vary greatly. Their customer service policies also vary greatly. Most of them are very hard and difficult to scratch with metal objects like keys, a few use cheaper glass that scratch easily. They vary in thickness, so some crack more easily than others. Some are cut accurately and fit well, while others can interfere with the camera or haveclios that catch on clothing or even skin.But there is one thing they all have in common, they leak moisture. Some will get moisture under the glass just from facial sweat. Some will get moisture if you drop it in a full sink or a swimming pool. ALL of them will flood of you go into the water with them.I fish and go rafting. Every screen protector I have had has leaked if submerged for more than a few seconds. This screen protector, which is bonded to the screen, does not leak, even if I take underwater photos with it.But there are more advantages with this type. If the screen is adhered only on the edges, there is a tiny airgap between the protector and the screen. This makes the screen less sensitive. This may not be a huge issue if you are just tapping, and even swiping will usually work, but if you have a pen, stylus, or finger print reader, it gets worse. Most people eventually do recalibration and adapt themselves to the loss of sent sensitivity.HOWEVER, that tiny gap also creates an impact with the screen and some types of drops will still break the screen. Without exception, I have broken the screen on every phone I have owned over the last 10 years. Some look asted a month, a few lasted a year, but because of my active lifestyle, I have never traded in a smartphone without damage... Until now!The bonding agent on this screen protector remains slightly flexible. I have dropped my Samsung S22 Ultra countless times. The phone is still perfect. The screen protector itself lasted over a year and a half. Eventually it cracked. But bits of the protector remained on the screen and continued to protect it until I was able to replace it.Removing the old glass was simple and I think I may have spent 20 seconds removing all of it. The bonding agent remained on the protector and the phone was spotless. I put a new protector on using the cleaning pads in the kit and no further effort was necessary.Nothing has ever worked as well as this. I can't speak for the Whetstone brand, Wich uses a similar technology as I have never used that one, but thisisthe best I have ever used.The curve is perfect to my phone. The cutouts are also perfect. There is a a fraction of a millimeter margin between the protector and the phone frame. It is very tiny and allows you to attach a case.to your phone. In spite of some comments I have read, you will not notice it when you use the phone and it does nothing to compromise the protection. I would say the gap is about the the thickness of a business card. Once you are using your phone you will not notice it and not a single person who has handled my phone has noticed it. In fact one person after seeing the scratches on my phone case asked why I was not using a screen protector and I had to show them the margin which the had not noticed.Of course everything has a downside and this product is not an exception. That down side is the installation is not as easy or as fast as the other type and one must be careful to follow the instructions carefully.When I received my first kit, which includes two protectors, it was defective. There was not much adhesive is one of the tubes and no matter how long I waited or how I tipped the phone, I could not get coverage. I would estimate that the second tube had only about a third of the adhesive as the first one. On my second attempt, the tray would not release the sliders and when it let go it made a big mess and the bubbles could not be removed. So I had to contact the company.No problem. Perfect customer service and they immediately sent replacement glass and the supplies to install it. I had trepidation but it was unwarranted as the install was a snap. I threw away the old guides as the new ones were smooth and easy to use.Pros:Excellent customer serviceNearly impossible to see once installed.Does not affect screen sensitivity. (I did not turn screen sensitivity on nor recalibrate).Will not flood.Superior protectionDoes not shed glass splinters if brokenCons:Installation required carefully following instructionsWritten directions could be written better (Definitely watch the video).Installation takes 5 to 10 minutes (Vs others which take 60 seconds)Not the least expensive solution available.So what will my next protector be? Without any doubt, this one again. In my estimation it is worth the few extra minutes and the extra cost.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brayden Peachey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3VIFUK3DCOJQG76EUYMR2VTWKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B9NJKJI4XF6A?ASIN=B09Q8RBZBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars The Best Tempered Glass Screen Protector!!",
                "reviewText": "I am not the person who usually writes reviews, but this product deserves one.Finally a tempered glass screen protector for the S22 ultra without the annoying thumbprint hole. I have been searching all of the internet to find one without the hole.The first screen protector went on perfectly. The installation process can be a little confusing, but if you watch the installation video like I did you will be perfectly fine. Even after putting the weight over the thumbprint for curing, there is no hole where liquid is missing, it's a nice even coating. My fingerprint works perfectly, I did put mine in before with no protector at allon the phone, and after I put the glass on I put my fingerprint in again. I have no issues with it reading my print.If your looking for tempered glass without the thumb hole this the one for you. I am so happy with this product. I will see how it holds up durability wise as I have just installed. Even if it only lasts a month or two, the no thumb hole is totally worth it for me!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GeekTech",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENRJNF4V3ZTMQZXAM4P5DT37SFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VI4E0NK9PQ5F?ASIN=B09Q8RBZBS",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2023",
                "reviewTitle": "1.0 out of 5 stars Not an easy install as advertised!!!",
                "reviewText": "The video shows them installing the screen protector very easily, however, if you are like me and very anal about perfection when it comes to your electronics then you are going to take as much care as possible to install anything onto your electronic device (whatever it may be, in this case it's my Samsung S22 ultra Flagship phone). So for it to still come out incorrect is quite disheartening. When I purchased the screen protector it stated that if I showed proof of purchase then they would send me another screen for free if the install had any bubbles left on the screen. Well the very first one that I installed did exactly that, on the top portion of my screen there was a bubble and even though watchig videos and taking the companies suggestion of giving it 24 hours and the bubbles would work themselves out, it did not. So I was stuck with a awful looking bubble on my phones screen, now for some that may not be a bother, however, for me who loves his electronics and wants perfection out of his devices, whether it may be aesthetically or not, that is far from what came out. I told myself that this may have been my fault that it came out the way I did it so I did not write a review as I am now, instead I just followed the companies suggestion of registering the product and stating what had happened and that they would send out an extra glass replacement. Well I did that and I NEVER received the extra glass. Well months went by up until last week when due to me dropping my phone I had to change out the glass. I was excited because I had told myself that this time I would be able to make it perfect (Note: The first install wouldn't allow the fingerprint sensor to work, and I placed the weight on there as the company video showed). Videos I watched showed that the screen removal was very very easy, like eating a piece of cake. Well, what the videos don't show you is a screen protector that needs to be replaced due to breaks in the glass. God forbid if that is the reason why you have to replace the screen for, because let me tell you, it was a complete nightmare. It literally took 4 different 2 hour sessions, 100% alcohol, gloves (to keep from little broken glass pieces going underneath your nails) and a lot of patience to remove the original screen which hadn't even been smashed into pieces. Simply the top right corner had cracked a bit. So now for install 2, I watch the video again, I even went as far as doing this after a hot shower so that there wouldn't be any LINT, DUST OR ANY OTHER DEBRIS in the air. I followed the instructions EXACTLY! I was excited to place the new screen onto there, I saw visions of a smooth and beautiful screen WITH a finger print sensor that would work this time around! So I began my task at hand, *Warning* Graphic Content Warning, proceed at your own risk. I went as far as not wearing any clothes just to make sure Dust or lint would not come off of me onto the screen, then I began the lengthy process of applying the glass screen protector onto my S22 Ultra (The process probably takes a lot less time to install if you're not a perfectionist like me) I followed the instructions exactly as they do it. I watched the video simultaneously and was pausing the video as I needed during each step. So once again I get to the portion where I need to remove the tabs from the top and bottom slowly to allow for the glass to sit onto the screen, well just like the time before I removed the tabs slowly and as the screen sits onto the main S22 Ultras screen and you see the glue begin to spread and the glass sucks onto the main glass, suddenly at the middle of the phone and another off to the right, one below that one and to the left 3 total bubbles form. Now keep in mind that these bubbles are NOT at the same place the last one was. So all in all I have to say this product does not apply easily as they state and it surely does not remove easily (however, I'm not sure if they made that statement or not. The removal is my personal opinion.). Also, when I applied the second screen the phone dropped from a height of about one and a half feet ( I was sitting down, leaned forward on a lazy-boy playing a game and I dropped the phone, No more then a 2 foot drop, and the second time it cracked at the top right corner. Oh and I have a Speck case that is drop tested). I hope this review will get the attention amfm and they will make this right with me, as I never received the initial screen that I sent in for. I followed there instructions as well, yet nothing. I will update the comment when and If they reach out to me. Would I recommend this product to friends or anyone for that matter, at the moment NO! Am I happy with the product I spent 40 dollars on, NO! It's all in their hands from here on out. Thank you",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "-Mg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 4, 2022",
                "reviewTitle": "Great product, looks good on phone, easy to install",
                "reviewText": "Very easy to install, just make sure to watch a few youtube videos if you are installing it for the first time, and keep 15-20 minutes for the process. But once installed, it sticks very well to the phone and there is no noticeable difference in screen quality. In fact, it feels like there is no screen protector at all. I use it with Spigen case and it works perfectly. Also, it works with S-pen flawlessly. Did not test it with a fingerprint scanner, but I assume it will work just fine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Antonio Pedroza Hernández",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 4, 2022",
                "reviewTitle": "Excelente producto",
                "reviewText": "Es fácil de instalar, solo debes tener pasiciencia. Se ve excelente ya instalado y sirve la huella dactilar para los que duden de su función una vez colocada la mica.Vale la pena el gasto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Neo Yew Chuan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on April 29, 2022",
                "reviewTitle": "The only curved tempered glass you need for s22 ultra",
                "reviewText": "I've pasted Whitestone dome glass on my wife and my s22 ultra the first day when we got the device, and is having fingerprint unlock issue since then. But because of the premium price we've paid for the glass, we thought to turn on face unlock instead and let the glass stays on the phone for at least 5-6 months before we changed to another one.However, the fingerprint unlock issue had been such an annoyance that I changed to a local brand, which many reviewed that the fingerprint unlock works, but it doesn't worked for me. I bought two pieces, one for my wife and one for myself, end up I used up both pieces, they are not any better than the Whitestone dome glass.I saw amFilm while searching in YouTube on reviewed for tempered glass installation for s22 ultra, and decided to give it a try. Amfilm didn't disappoint me, it is definitely the best ultrasonic fingerprint unlock compatible tempered glass you can find for s22 ultra! I found that the unlocking speed is no different from naked screen, I'm so happy that I bought amFilm! 😄",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeremy Gecelovsky",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 28, 2022",
                "reviewTitle": "Buyer Beware! This screen protector may ruin your phone!",
                "reviewText": "When I first installed this screen protector I was so happy with it - the screen response was great, fingerprint reader works flawlessly, installation was pretty easy and it looks great and is compatible with my case. Unfortunately a couple of hours later I answered a call and realized that I could barely hear the person on the other end of the line... The UV adhesive had got into my top speaker hole and damaged the speaker. The kit provides you with absorption pads for the sides of your phone, so clearly they know there is a possibility that the adhesive might overflow... Why on earth wouldn't they provide absorption pads for the top and bottom of the phone, where the important parts are! Customer support was of no help unfortunately. My recommendation, if you do go get this screen protector, is to tape the top and bottom of your phone so none of the adhesive leaks and ruins your phone!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrés Tapia Herrera",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 28, 2022",
                "reviewTitle": "Muy bueno, hay que saberlo instalar...",
                "reviewText": "Es excelente el producto, bien puesto pareciera que no trae nada el celular. IMPORTANTE! Poner dos botecitos de pegamento a cada cristal, de lo contrario se despegará al poco tiempo. Recomiendo ver la guía de instalación de YouTube de DOMEGLASS y no la de este producto, porque van a quedar burbujas, no presionen la zona de la huella con nada porque marcará error, ni siquiera con la pesa de metal que viene en el kit, mejor dejen que se seque bien unas 8 horas antes de presionar el sensor, ya con eso no tendrán problema alguno.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}