{
    "remaining_requests": 9568,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LK-Ultrasonic-Fingerprint-Anti-Scratch-Replacement/dp/B07Q2B84ZK",
    "body": {
        "name": "[2+2 Pack] LK designed for Samsung Galaxy S10 6.1inch, 2 Pack Flexible TPU Screen Protector and 2 Pack Camera Lens Protector [Ultrasonic Fingerprint Support] HD Clear Easy Installation",
        "price": "$12.99$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LK-Ultrasonic-Fingerprint-Anti-Scratch-Replacement/dp/B07Q2B84ZK",
        "soldBy": {
            "sellerID": "A2P10F7CRJF1U3",
            "name": "DGTLE",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2P10F7CRJF1U3&asin=B07Q2B84ZK&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "200",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51UL-VkenIL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41UfEOe9QeS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51re Pzy8JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XPpGh-VtS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ryVG-BToS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PHx90GR8S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Qax7ygkwL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/710bcb7d-f750-42c1-a7a1-5d91399e3658/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: LK",
            "link": "https://www.amazon.com/s/ref=bl_sl_s_ap_web_7141123011?ie=UTF8&node=7141123011&field-brandtextbin=LK"
        },
        "brand": "LK",
        "merchantInfo": "DGTLE",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 20657,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 17. Order within 7 hrs 1 min",
            "FREE pickup Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 17. Order within 7 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Compatible Model】Include 2pcs Screen Protector and 2pcs Camera Lens protector designed for Samsung Galaxy S10.（Not fit for Samsung Galaxy S10 Plus / Samsung Galaxy S10e）",
            "【Exclusive Solution for Ultrasonic Fingerprint】 High touch sensitivity gives \"True Touch\" feel, ultrasonic screen fingerprint, which allows for high phone responsiveness.",
            "【Ultra Clear】 99% HD Clear screen protector with High definition transparency film and maximum resolution which keeps the bright and colorful image quality",
            "【Maximum Coverage】Flexible TPU screen protector will fit your screen perfectly. It designed to offer the maximum amount of coverage for your phone's screen",
            "【Case-Friendly Design】LK screen protector is designed to be compatible for most cases. Extra space is left around the borders for your case to wrap around the edges of your mobile without interfering with the film."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2407755011"
            },
            {
                "name": "Maintenance, Upkeep & Repairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=21209105011"
            },
            {
                "name": "Screen Protectors",
                "link": "https://www.amazon.com/screen-protectors/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2407781011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ Yes"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 15.99 x 8.99 x 1 inches; 0.02 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ LK-S10 TPU-3 PACK"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ March 25, 2019"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ LK"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07Q2B84ZK"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,858 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #1,471 in Cell Phone Screen Protectors"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 20,657 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/857ce925-5499-49ea-b50f-3697dba385f1.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e26d1848-dd1a-49f9-90ed-e079062bd843.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f03c5126-648f-477c-9c49-f726959a0b2b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b969204b-aec6-426b-a158-bdbe04f76a11.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a889c549-82a3-4983-aa45-1154bcdce30b.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c10e8159-f650-4882-837e-2714743325dc.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "D. Sperber",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUC2AZDUSGS7N3ISMASVPFNFIDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34H6PVML2PRAN?ASIN=B07Q2B84ZK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2019",
                "reviewTitle": "5.0 out of 5 stars WOW! Perfect install! Better than original Samsung screen protector",
                "reviewText": "So I accidentally dropped my new S10 into the sink, and ended up with two semi-punctures to the factory Samsung screen protector film. There already was another self-induced blemish elsewhere on the film so it was clear a new protector of some type was required. Reading comments and reviews I ended up buying two film-sheet type products (one of which was this LK, and the other of which was from Olixar) and two glass-type products (one of which was from Semriver and the other of which was the expensive Dome one from Whitestone). I decided to try the highly rated LK first.And BOY... IS IT GOOD! In my opinion it's superior to the factory Samsung film.A few plays of the install video made it quite clear how it was to be applied, so I was confident. But the first attempt was less than perfect. Thankfully there are three sheets included in the box because the first attempt left some small bubbles in the middle of the screen which were simply impossible to \"push out\". Obviously I was a bit too casual with the step that places the multi-tab sheet over the glass with alignment required before pressing down and applying the squeegee. I thought I was careful but clearly not.So I peeled off the first sheet and started all again with a second one, this time being much more careful about aligning, pressing down, and then squeegeeing being sure that there were zero bubbles visible through the paper before performing the final application steps of removing the paper from the film and applying final squeegee steps.In the end, it was 99% perfect and bubble-free. There were just a few minor small bubbles near the edges which were easy to push out with my thumbs so that it was now 100% perfect. The hole for the camera is perfectly sized and aligned, and the film is perfectly sized to cover the entire glass below. I was concerned about possible compatibility with my Otterbox Defender case, but my concerns were groundless. The Defender case applied perfectly with zero puckering of the edges of the LK sheet (unlike with my experience applying the Defender with the factory Samsung sheet, because I didn't pay attention and do the Defender install properly).Furthermore I was concerned about how the S10 fingerprint reader would work through this LK film, and I'm thrilled to report IT SEEMS SUPERIOR TO HOW IT WORKED WITH THE FACTORY SAMSUNG SHEET! I had lots of trouble registering my two fingerprints when I got the S10 (lots of \"press harder\" requests) but now that I've replace the screen film with this LK product I was amazed at how easy and totally problem-free the re-registration process went this time.I also was concerned about how clear and transparent the LK sheet would be, and to me it could actually be clearer than the factory Samung sheet. Regardless, it is certainly smooth and shiny and blemish-free and perfect. I couldn't be happier with how it looks.For sure it seems that finger scrolling and tapping is much more accurate and responsive than it was with the factory Samsung sheet. I'm amazed. The sheet+glass certainly seems much more responsive to my finger tip actions. This was totally unexpected. I didn't know if the friction-feel of the sheet would be smooth or rubbery or matte or what, but it turns out to be just perfect. Invisible to the touch. It's like I'm moving my finger across glass.So I still have one more LK sheet now in reserve, if/when I ever need to replace the one I just applied sometime in the future. And I have the other products I also bought (and will keep rather than return), in case I decide to try one of them sometime in the future when the need arises.But for now I really can't overstate how happy I am with this LK sheet. Fingerprint reader and camera (through a perfectly aligned hole in the LK film) all work 100% perfectly. And application is really easy.One more plus: looking at the screen while wearing polarized sunglasses while in my car no longer is a problem. The phone screen is now visible bright and colorful through the LK sheet, unlike how it was with the Samsung factory film. Obviously there must be a molecular structure difference in the material used in the LK film which causes light passing through from the phone screen to \"align\" better when viewed through the polarized sunglasses, allowing light to be more easily visible through the LK film.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Skidooman93",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEO2OTBVHSC4W2YE3U2JJI7RIHZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R1UWOWABJYS3?ASIN=B07Q2B84ZK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2020",
                "reviewTitle": "5.0 out of 5 stars Best Film Screen Protector",
                "reviewText": "This is by far and away the best film screen protector I have ever used.I am not a fan of film based screen protectors. I dont like the way they feel, there is a drag when you slide your finger on the screen that you can feel with all of them. Until I found this one. The screen feels just like a glass screen the only way I can feel a difference is if I drag a fingernail firmly against it. Film screen protectors usually start yellowing, even if they say they dont, fairly quickly as well. I have only had this one on for a about 2 weeks but I can say, it is not peeling or changing colors.Instillation was simple, if you read the directions. I watched the video too, that does help because it shows what should happen if you do it right. Most of the negative reviews are from people im sure didn't read the directions or follow them. You know, the people that have to be told to take the wrapper off the frozen pizza before putting it in the oven. But they still dont read the directions and end up with a shrink wrapped burnt plastic pizza.As far as impact resistance. I really dont know how it will do. It is film, so no matter what it cant be better than a hard piece of glass. But after trying many glass screen protectors on galaxy phones with curved screens I gave up. They dont stay on very long, they are pushed off by cases, the ultraviolet types work better, but are expensive and make the inscreen fingerprint reader very very slow and difficult to use, and they are more difficult to install. With the screen protector the inscreen finger print reader is very fast, works instantly. I really couldn't be happier at this point. It will protect the screen from scratches and hopefully small bumps. I am a very happy customer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adria H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7OPUJYLJ24OQAYDWI77Z4LJ6ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9PNTF5PZX10M?ASIN=B07Q2B84ZK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2023",
                "reviewTitle": "4.0 out of 5 stars Okay if you're not picky",
                "reviewText": "This product is okay if you're not picky about your phone covers. It was a good price and it was easy to install, it even came with tools to help you put it on properly. Although this is nice to have on my phone screen as an extra layer of protection, it is a little hard to deal with sometimes. If you have a case on your phone (which I do) sometimes it comes up at the edges and you have to seal it back around the corners to get it to lay flat. It also acts up when you get hot weather, the adhesive starts to fade a bit so it doesn't stick as well as I would like. Overall, if you're willing to put up with pushing down the edges and the corners every now and then, then it's a good protector. I've dropped my phone a dozen or so times and the screen hasn't shattered or even cracked, so it works for me.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joseph Fuller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFHHDKIDHWVQAJSW3CSZV6COHWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VGCNCORGMMET?ASIN=B07Q2B84ZK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy to install with no air bubbles!",
                "reviewText": "I was using the original protector on my S10 for 4 years but it finally peeled up too much near the power button. I bought the LK protectors nearly 2 years ago but put off applying one because all the protectors I'd used in the past for other phones were so hard to put on straight and without bubbles that I just ended up never using them (though those were usually tempered glass), so I kept the original as long as possible. But the LK protector was extremely easy to apply since it's flexible. The locator device made the positioning super easy, and the squeeze card makes getting air bubbles out without scraping the surface a cinch. I had a few tiny ones near the edges that I had to use my thumbs to push out but no big deal. It would be nice if the protector could cover the camera lens as well, but that may simply not be possible without affecting the quality and focus. I like the softer protector rather than tempered glass as it can endure some scratching that either heals or just isn't noticeable, and an impact won't shatter the whole thing. The package and instructions also don't mention that there are two protective covers for the rear camera block which is nice, and those do actually protect the lenses, since they're a bit more easily damaged. Those protectors are a hard plastic, not flexible, and don't seem to affect the camera quality with a quick check, but they could easily get scratched up and need to come off.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TMTM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 6, 2023",
                "reviewTitle": "Great product, easy to install",
                "reviewText": "Very easy to install. No bubbles and excellent clarity after install. Follow the instructions.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714nNaG76VL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JUDITH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 21, 2021",
                "reviewTitle": "Buen producto",
                "reviewText": "Trae todo lo necesario para colocar la mica en el celular. Poco confusas las instrucciones.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "teddy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 28, 2023",
                "reviewTitle": "Easy to install fits like a glove",
                "reviewText": "Tryed severall ones that one is the easiest to install so far. It's not tempered glass but for me those where a pain so prefer from far this one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 4, 2021",
                "reviewTitle": "No me gusto esta súper sencillo y se despego solo",
                "reviewText": "Se despegó al segundo día y con mucha burbuja muy mala calidad y como si fuera un plástico encima de la pantalla orible",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amacha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 9, 2023",
                "reviewTitle": "Decent If youre looking for tempered glass alternative",
                "reviewText": "The website it tells you to visit for video instructions dosnt work anymore (November 2023)Written instructions are included but are not exactly easy to follow.Messed up the first screen cover while installing.Almost messed up the second one too but ended up just ignoring the instructions half way thru and figuring it out myself. Maybe you will have better luck?Anyways seems like a decent protector. Feels good on the fingertips.The protector that came on the phone (galaxy s10) a few years ago was ready for replacement.Few bubbles but I managed to get rid of most of them.Guess it's a good buy if you're looking for a tempered glass alternative and want to keep a stock feel/look",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}