{
    "remaining_requests": 9751,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Supershieldz-Samsung-Tempered-Protector-Coverage/dp/B07VVDXTS1",
    "body": {
        "name": "Supershieldz (2 Pack) Designed for Samsung (Galaxy A10E) Tempered Glass Screen Protector, (Full Screen Coverage) Anti Scratch, Bubble Free (Black)",
        "price": "$7.99",
        "originalPrice": "$9.99",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Supershieldz-Samsung-Tempered-Protector-Coverage/dp/B07VVDXTS1",
        "soldBy": {
            "sellerID": "A279LIVC2BRR8I",
            "name": "Supershieldz",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A279LIVC2BRR8I&asin=B07VVDXTS1&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51prbWwjPtL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/412r9-c3TUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41r1a0j sHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rd0os5mTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81nFJcPDIAL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/25da4b2b-8c9c-406b-a75a-a7a7e1cacb5b/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Supershieldz Store",
            "link": "https://www.amazon.com/stores/Supershieldz/page/6879B3A0-989B-4F5A-8620-A88FE36AB21A?ref_=ast_bln"
        },
        "brand": "Supershieldz",
        "merchantInfo": "Supershieldz",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 12718,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Made from the high quality tempered-glass with 100% bubble-free adhesives for easy installation and maximum scratch protection",
            "2.5D rounded edge glass for comfort on the fingers and hand",
            "99.99% HD clarity, and maintains the original touch experience",
            "Hydrophobic and oleo-phobic coating to reduce sweat and reduce fingerprints",
            "Include 2 pcs tempered glass screen protectors"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2407755011"
            },
            {
                "name": "Maintenance, Upkeep & Repairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=21209105011"
            },
            {
                "name": "Screen Protectors",
                "link": "https://www.amazon.com/screen-protectors/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2407781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "15.99\"L x 8.99\"W"
            },
            {
                "name": "Item Weight",
                "value": "0.023 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07VVDXTS1"
            },
            {
                "name": "Item model number",
                "value": "SS-TG-S-Galaxy A10e-2P (BK)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 12,718 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,540 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #1,053 in Cell Phone Screen Protectors"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Special features",
                "value": "Rounded Edge, Scratch Resistant"
            },
            {
                "name": "Manufacturer",
                "value": "Supershieldz"
            },
            {
                "name": "Date First Available",
                "value": "December 18, 2016"
            },
            {
                "name": "Brand",
                "value": "Supershieldz"
            },
            {
                "name": "Compatible Devices",
                "value": "Cellphone"
            },
            {
                "name": "Material",
                "value": "Tempered Glass"
            },
            {
                "name": "Item Hardness",
                "value": "9H"
            },
            {
                "name": "Compatible Phone Models",
                "value": "Samsung Galaxy A10e"
            },
            {
                "name": "Special Feature",
                "value": "Rounded Edge, Scratch Resistant"
            },
            {
                "name": "Finish Type",
                "value": "Matte"
            },
            {
                "name": "Unit Count",
                "value": "2 Count"
            },
            {
                "name": "Screen Size",
                "value": "5.8 Inches"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/36f27930-3092-4892-b864-b58acbb5f626.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/827d590c-85ed-4563-97fb-630fd3c1d221.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/d1c977fc-b521-4d5e-a2e4-eaea908acf94.__CR0,0,600,180_PT0_SX600_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CandaceH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6YXDBY7RPOCEC5FW5MPSZSH5WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ESGMB7SG0BQU?ASIN=B07VVDXTS1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Great fit",
                "reviewText": "These go on easy and work like there supposed to. Great pick ty",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUKRO7DR7LUTL7QIV3TWN7SQP7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VWI2NT8UGW15?ASIN=B07VVDXTS1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars No wrinkles",
                "reviewText": "Super easy to attach and no wrinkles",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ5FAVD4SDCOMOG3VFRJDYREV7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13OP96CC3WQC8?ASIN=B07VVDXTS1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 28, 2020",
                "reviewTitle": "5.0 out of 5 stars Dramatic drop, still saves phone screen!",
                "reviewText": "I'm super clumsy installing screen protectors (normally having to go through at least 2 to get it on properly without bubbles), but this one went on like butter on bread! Touch screen is perfect, cases fit nicely, cutout for camera doesn't block the view. Like I said before, I'm super clumsy and my first screen protector lasted about 5 months of my dropping it several times a week with a crappy (but super cute!) case until I was startled and basically threw my phone onto the street face first. The protector ended up with a few cracks and scratches and fell off immediately. I honestly expected spiderweb cracks and scratches on my screen, but nope! My phone was fine! I applied another protector in seconds and am ready to go be spastic with my phone again!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "0^0",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL72CP3HT7L37QK2VNMCHQ6AFYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RENC3RHZD19B7?ASIN=B07VVDXTS1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 6, 2020",
                "reviewTitle": "4.0 out of 5 stars Was planning on returning while in-transit after reading reviews. BUT.....",
                "reviewText": "Last and FINAL update:I tried the competitor's full screen \"adhesive\" and by far SuperShieldz is the best out of them all as far as application for the Galaxy or any screen with a smooth bezeled/Chamfered screen. However you still need to make sure that you really try to make it adhere to your screen. First, none of these screen savers are perfect. They all have their flaws. None of them are permanent either. The \"full screen adhesive\" versions are not adhesive at all. If they were they would not have the clarity and the fine details will be lessened with adhesive. They are actually a gel that has a tactfulness to them where as Supershield's is an true adhesive - albeit not all around, only underneath the black bordered portion. A huge problem with the \"full screen adhesive\" type is that they bubble up like mad. I found out that the it isn't actual bubbles. I looked closely and the gel near the edges have defects in them and make it seem like there's a bubble when it actually is a curved or indented edge of the gel layer that WILL NOT adhere properly. I tried all of the one of the highest rated \"full screen adhesive\" and wasted two hours trying to get them perfect. Each time the edges were flawed after meticulous cleaning and application on my part. My thumbs are so sore and I'm a pretty strong guy. This shows how arduous of a process it was for the attempt. I was pressing so hard to remove the bubbles (the actual bubbles did push out) it was the edges that were just flawed and impossible I found after close inspection of the gel layer under light. I would like to believe that you almost have to get lucky and get a full adhesive shield with a perfect application of the gel layer to completely void yourself of the issue with the edges. As I'm typing this I see the T___L 3 pack protector being advertised on my amazon page. On a scale of one to ten with ten being the hardest to remove the bubbles it was a 10. I would never recommend a girl to try to apply that the full screen unless again, it was a perfect screen from a good batch. This last update was more of an update of the \"full screen adhesive\" screen saver, but Supershieldz wins in every category except the possible pop off after a drop, but in my case it was due to the case pushing on the edge of the screen saver. The one that I took off due to a bit of dust that was underneath had very good adhesive all the while. Read my full review to get the idea of where this is all coming from. Supershieldz wins for me and again screen savers are a continuously replaced item over time unless you don't care about small particles of dus, scratches or air gaps regardless of which brand you go with. Good luck and I hope this helps!Second update:If you are a pocket carrier of your mobile you may run into particles that sneak into the screen through un-adhered locations of the screen protector. That could just be a product of poor design or the tackiness of the adhesive drying overtime. In my case I have dry skin sometimes and skin flakes(I know gross) which I am presuming entered into my pocket and eventually underneath the screen. Also still durable, only one small knick from my keys with no cracks. So when I have the time I'll have to replace it with the other screen saver that was kindly replaced by customer service. Yes, get the warranty and they do respond!Update: The screen protector may pop off with the right amount of impact. The adhesive is really tacky, but again, it's only on the edges. My phone fell off a counter top and landed face down. The Supershieldz protector did come off and there was no damage to either screens. I have to add the screen glass is super strong as I had bent it to a \"U\" and it still would not crack. I ended up using the other one due to getting dust on the adhesive. Had I been extremely careful cleaning the undersurface of the screen I have no doubt that I would've been able to reapply the same screen no problem. One last thing, make sure that whatever manufacturer's phone case you are using is not pushing against the edges of the screen protector as this will help it pop off easier. The added pressure over time on the edges of the screen will loosen the adhesion. If you have a really good fitting phone case like my Incipio you need to make sure that the very little space between the edge of glass and case is still there on all four sides. I recommend after cleaning the screen AND case thoroughly of dust, you apply the screen centered WITH your case on during the process. This will avoid the case pushing on the edges of the glass when when you put your phone back in the case.Some of these people are just whiny. I read the reviews thought I needed to return once it arrived so I went and ordered a different maker's. While waiting I needed a screen protector as I can be destructive so I threw caution to the wind and applied this one with surprise. Installation was not hard nor easy, you need to make sure that you're in a dust free area. Best to do it in a bathroom with the hot water running for a while no fans, this makes dust fall. Use very good lighting, this will make or break centering the protector. You have to be slow and patient. Watch the video, there's plenty. I watched a third parties' where you can see him using the cloth from center-out to force any bubbles. Which brings me to the next question you guys are wondering about. It is not a full-screen adhesive, yet I was surprised after being hesitant to keep it after reading all the internet reviews. It's alright, the only little caveat and only if you even notice it is the acoustics/sounds of the tap. You can slightly hear the space between the tempered glass and your screen on the finger tap. This is only going to be noticeable if you have super anal mutant hearing abilities. You probably wouldn't even notice if I didn't tell you. For me it was enough to be a \"thing\". Not a deal breaker though as I needed a screen protector. Use the dust stickers and alcohol wipes on your phone screen before application. Even afterwards be very slow and gentle without quick moves. No one lives in a dust free vacuum and even I ended up with a three dust particles. One that I can see with during night viewing. I still can remove this one and apply the other one it came with when this one breaks or scratches. Yes, even thought it isn't full screen adhesive it still can trap dust particles. Although not being full screen adhesive, visually you won't be able to tell unless you totally botch the job up somehow. I really don't know how you can do that though. I had no bubbles and used the technique I saw in the video and it sufficed. Fitment is probably the best I've seen - on the internet reviews and videos, I give it a 10 there. The edges are 2.5D rounded smooth. The camera isn't covered and it has an odd little notch on the right upper corner which I think is for removal maybe, it's very unnoticeable once you get using it. The protector fit almost perfectly with my INCIDIO phone case with very little space between the edge and case. So I am going to say that it is case friendly. Like all screen protectors, they utilize adhesive and you may get a tiny amount of dust particles attached to the edge. Using the alcohol wipes may help once the screen has settled on for a hour or two. I got creative an used the dust sticker. Either way I think this problem will go away after any very small amounts of exposed adhesive dries after time. It does have a dot matrix that is not visible unless you were told. It does NOT create Newton rings/Rainbow affect like older dot matrix screens of yesteryear. My understanding is that all non-full adhesive screens have this. Or maybe all of them full or not do due to the adhesive. Again, not even noticeable in use and after you see them for the first time. Sensitivity is still there very much so. I wan't to say that with my mutant abilities sensitivity went down .5 out of 0-10 scale. My A10e is brand new so without any cover I can literally hover my finger over the screen and it will pick up the tap. So you won't lose any touch response. The screen does pickup finger prints. It's not the same level of glass as your permanent screen - in no way. So don't expect too much in that respect regardless of what manufacturer says about their product. Supershieldz's I would say picks up finger prints 25-30% easier than on your Samsung Galaxy A10e screen. There's no way around it unless the protector was fifteen or twenty dollars a piece glass, which I wouldn't hesitate if it had all the qualities as Supershieidz's does. I can't think of anything else remarkable to let you know. All in all I would recommend this protector with the information I provided. I was going to return it and now am pretty fine with it. Fit is perfect, adhesive has nothing bad about it, no bubbles of any sort. I can't wait till it scratches or cracks so I can get a new one on without that dust particle, which was my fault. This is a pretty good screen surprisingly. If you are super clumsy and feel like you are going to have some severe high drops then go with a full adhesive model. For every day usage and some normal drops this is perfect. Good luck!",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY4R5OJMQDISHYJPTJXJ55EESPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GX481JT2Q2U0?ASIN=B07VVDXTS1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars works fine",
                "reviewText": "fits great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCKOFG64BTJDDCHC34B2LXT6RWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RED78164RNS0L?ASIN=B07VVDXTS1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars It's excellent product.",
                "reviewText": "Adheres easy and is great product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beachy Girl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBPSXXAP46DT74MJDVIMMI5LWSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GX30KDD0KCFC?ASIN=B07VVDXTS1",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2023",
                "reviewTitle": "3.0 out of 5 stars Not invincible",
                "reviewText": "Bought this product in mid August. I followed directions, but the screen did not adhere well and fell off. I used the second one that came in pack and phone fell on floor and the protection screen cracked. I didn't sign up for lifetime warranty so I had to buy the product again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "yoeyyutch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZFB64PVKNCJ34POI73S6GTIVVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R8YCK4B1VG1K?ASIN=B07VVDXTS1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2021",
                "reviewTitle": "5.0 out of 5 stars So easy to use",
                "reviewText": "Thank God. I've never been able to apply these things without tiny particles of debris or air bubbles getting in there. The first time I used it it went on perfectly and it took less than a minute from the time I opened the package. I'm hard on stuff and I dropped my phone enough that I broke the first one. It just had a single crack across the screen so I used it for several weeks as I hoped I would be able to located the second screen protector that I bought. I didn't find it so I bought another 2-pack. The installation wasn't as miraculously easy the second time, probably partly due to my phone not being brand new. I had a little dust interference this time but it wasn't much of a problem. I just took the protector off. Wiped everything down with the included alcohol pad and reapplied it. It's working great. Great packaging too for keeping the spare. And I found my original spare finally!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathy Ritchie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 9, 2021",
                "reviewTitle": "Easy to use",
                "reviewText": "Easy to apply",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BCapples",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 13, 2020",
                "reviewTitle": "Excellent produit",
                "reviewText": "Fait parfaitement bien sur mon nouveau téléphone Samsung!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2020",
                "reviewTitle": "Saving us lots of money.... thank you!!!",
                "reviewText": "Helps save the hubby’s screen so we aren’t buying a new phone every two months lol",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deseray",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 23, 2021",
                "reviewTitle": "Not a full stick",
                "reviewText": "It fell off 2 months later",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Guapa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 13, 2020",
                "reviewTitle": "Hard to install.",
                "reviewText": "Hard to install.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.99",
                "sellerName": "Supershieldz",
                "sellerRating": "5"
            }
        ]
    }
}