{
    "remaining_requests": 9820,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Luvvitt-Protector-Tablets-Watches-Protection/dp/B07XCYVBSC",
    "body": {
        "name": "Luvvitt Liquid Glass Screen Protector Scratch and Shatter Resistant Wipe On Nano Protection for All Phones Tablets Smart Watches - Universal",
        "price": "$21.99",
        "originalPrice": "$29.99",
        "rawPrice": 21.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Luvvitt-Protector-Tablets-Watches-Protection/dp/B07XCYVBSC",
        "soldBy": {
            "sellerID": "A1YCN99H7TYRNH",
            "name": "Luvvitt",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1YCN99H7TYRNH&asin=B07XCYVBSC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41SgIjrIaqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ruMHcn3WL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lwQ2znpUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uIALmiVsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511t2wriLhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519vCI1Xh8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A16GgYQGjjL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/be351187-cbf7-4380-baf9-5ade83fb6dfd/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79c02bcf-51c9-4698-bfdf-2d81fb9dd911/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: LUVVITT",
            "link": "https://www.amazon.com/LUVVITT/b/ref=bl_dp_s_web_2529821011?ie=UTF8&node=2529821011&field-lbr_brands_browse-bin=LUVVITT"
        },
        "brand": "LUVVITT",
        "merchantInfo": "Luvvitt",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 8286,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 6 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Luvvitt Liquid Glass is a cutting-edge super durable, completely transparent liquid screen glass protector that bonds to the glass of your device offering greatly enhanced scratch, moisture, and impact resistance. Made in Germany. Creates an invisible protective coating that increases the devices screen to 9H hardness",
            "Made of silica dioxide (Si02) which is essentially microscopic particles of glass suspended in a liquid solution. Fills in the imperfections of the screen and adds an additional layer of glass (should not be used to repair broken screens. Does not fix existing scratches or damages).",
            "Easy, bubble free application with a universal fit; ideal for curved screens and tablets. Simple, wipe-on DIY.",
            "Completely harmless and invisible once applied.",
            "Universal: Compatible with all mobile devices, phones, foldable phones, tablets and smart watches such as Galaxy S22, S22 Ultra, S22+ Plus, Apple iPhone 13, 13 Pro, 13 Pro Max, 13 Mini, Google Pixel 6, Galaxy Note 20 Ultra, Galaxy Z Flip 3, Galaxy Z Fold 3, Galaxy Note 10 Plus, Galaxy S10+, iPhone XR, Galaxy S20FE, all iPad Versions, all Apple and Samsung devices. Excellent with curved screens and foldable screens. Does not affect fingerprint sensors."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b?ie=UTF8&node=2407755011"
            },
            {
                "name": "Maintenance, Upkeep & Repairs",
                "link": "https://www.amazon.com/b?ie=UTF8&node=21209105011"
            },
            {
                "name": "Screen Protectors",
                "link": "https://www.amazon.com/screen-protectors/b?ie=UTF8&node=2407781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5.71\"L x 3.03\"W"
            },
            {
                "name": "Item Weight",
                "value": "0.64 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07XCYVBSC"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 8,286 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,521 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #449 in Cell Phone Screen Protectors"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "Yes"
            },
            {
                "name": "Special features",
                "value": "9H Surface Hardness, Scratch Resistant"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Clear"
            },
            {
                "name": "Manufacturer",
                "value": "LUVVITT"
            },
            {
                "name": "Date First Available",
                "value": "September 10, 2019"
            },
            {
                "name": "Brand",
                "value": "LUVVITT"
            },
            {
                "name": "Compatible Devices",
                "value": "Watch, Cellphone"
            },
            {
                "name": "Material",
                "value": "Glass"
            },
            {
                "name": "Item Hardness",
                "value": "9H"
            },
            {
                "name": "Compatible Phone Models",
                "value": "iPhone 14, iPhone 15, Universal, Galaxy S23, Galaxy Z Flip 5, iPhone 14 Pro Max, Galaxy S23+, Galaxy Z Fold 5, iPhone 15 Ultra, Galaxy A14, iPhone 15 Pro, Google Pixel 7 Pro, Galaxy A34, Galaxy A54, Samsung Galaxy S23 Ultra, iPhone 14 Pro, Galaxy Note 23 Ultra, iPhone 14 Mini See more"
            },
            {
                "name": "Special Feature",
                "value": "9H Surface Hardness, Scratch Resistant"
            },
            {
                "name": "Finish Type",
                "value": "Glossy"
            },
            {
                "name": "Unit Count",
                "value": "1 Count"
            },
            {
                "name": "Screen Size",
                "value": "6.5 Inches"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "YOU ARE COVERED Luvvitt's Liquid Glass UNIVERSAL screen protection is compatible with all mobile devices including phones, tablets, smart watches and other gadgets with glass screens. Screen protection is INCLUDED with 250, 350, 500 and 750 USD coverage levels based on your choice. Or you can select the No Coverage option (white packaging) that still offers the same cutting-edge protection without the coverage. Choose what fits your needs for a peace of mind.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30085cf8-e0bb-4b17-a329-0d594fa4371b.__CR0,0,2499,1546_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "WHAT IS LIQUIDGLASS? HOW DOES IT WORK? In Simple Terms: The glass that we use in our every day life, is mainly made of silicon dioxide (SiO2). Luvvitt's LIQUIDGLASS is also mainly made of SiO2 that is in liquid form. It covers the screen with an additional layer of glass similar to a tempered glass. The difference: Luvvitt LIQUIDGLASS is not a tempered glass or a film. It is a cutting-edge, super durable, completely transparent liquid wipe-on screen protector that bonds to the glass of your device offering greatly enhanced scratch, moisture, and impact resistance. The German formula creates an invisible protective coating that increases the devices screen to 9H hardness. More in-depth: At microscopic level, a glass is not as smooth as it seems. It's imperfect with gaps and pores. This porous surface creates points of weakness when exposed to sharp objects or impacts. Luvvitt LIQUIDGLASS fills in the microscopic pores and coats the surface with an additional layer, resulting in stronger and more scratch resistant surface.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/ddee2907-608a-4050-8971-745175ac9c18.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "APPLICATION CLEAN Clean all glass surfaces thoroughly with the cleaning wipe supplied in Sachet 1. Remove all traces of the cleaner and any lint by thoroughly buffing the glass with the microfiber cloth supplied. APPLY Apply the LIQUIDGLASS coating wipe, supplied in Sachet 2 to the glass surface in a circular motion. Ensure the screen is completely coated including the edges. DRY Allow the glass surface to cure for at least 10 minutes. The longer you let it cure without touching the better. For this reason, it's recommended to apply it at night. The screen can be touched after 10 minutes however, glass surface will continue curing for the next 24 hours. BUFF Use the microfiber towel supplied in a circular motion to buff out and remove any excess residue from the glass surface.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/ccc5b643-2fea-489d-8c28-55d055243a5a.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/91349424-9586-4f71-8c8a-7f45356d449b.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/e0a2a07b-c370-41eb-9b90-ab119a742e5a.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/64eb0d5a-26ca-48ec-ba8f-7ffcb42010ab.__CR0,0,2000,2000_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "WHAT IS THE DIFFERENCE? (WHY SHOULD YOU CHOOSE LUVVITT'S LIQUIDGLASS) ✓ Screen protection coverage is already INCLUDED (coverage amount depends on purchased product - see options below). ✓ Luvvitt LIQUIDGLASS screen protector liquid can cover up to 6 devices (only one device can be registered for screen protection coverage)✓ Luvvitt LIQUIDGLASS does not interfere with fingerprint sensors ✓ Luvvitt LIQUIDGLASS screen protection coverage does not require cumbersome app download and registration method. It's done through a simple online platform with an easy and simple process to register and claim. ✓ Premium grade only. NOT old technology that were designed to be used for ceramic coatings and windshield coatings, Luvvitt's LIQUIDGLASS is specifically formulated for mobile device screens and produced with cutting-edge technology. ✓ Luvvitt LIQUIDGLASS is UNIVERSAL and compatible with all mobile devices, phones, smart watches and tablets. ✓ Luvvitt is a USA, New York and California based brand offering premium products since a decade. DOES IT INTERFERE WITH FINGERPRINT READER? Not at all. Luvvitt LIQUIDGLASS is 100% compatible fingerprint readers. CAN A TEMPERED GLASS BE USED ON TOP OF LIQUIDGLASS? Yes. Once the Luvvitt LIQUIDGLASS is applied, dried and buffed it's safe to apply a tempered glass on top. CAN LIQUIDGLASS CAUSE ANY DAMAGE TO MY DEVICE? No. It has been tested vigorously and proven not to cause any damages to the device.",
                "media_link": []
            },
            {
                "media_text": "COMPATIBLE WITH OLEOPEL LIQUID GLASS Screen Protector already features oleophobic (anti-fingerprint) properties however if you would like to take your screen to the next level of lipophobicity and make it easy to clean, much more resistant to fingerprints, oil marks and smudges, OLEOPEL by ProofTech offers a wipe-on coating that restores and improves the oleophobic properties of the screen. OLEOPEL can also be be used together with any screen protector. (sold separately - link below) .",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/d32f218e-2b54-49d5-83fc-7457e78dbf8e.__CR0,0,2499,1546_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "COMPATIBLE WITH ProofTech SCREEN CLEANER KIT Keeping your screen clean is as important as protecting it. ProofTech's cleaning spray does not contain any harsh elements and can be used on all electronic devices with or without liquid screen protectors. The kit Includes 2 Spray Bottles 3.4oz and 0.3.oz + 3 Large Premium Microfiber Cleaning Cloths of 8\"x8\" size. Top notch spray mechanism ensures more coverage with less sprays. Keep your screen clean and protected with this exclusive bundle (sold separately- link below)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/20f24715-02a9-4865-ae0c-c1e7729f848a.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Liquid Glass Only Liquid Glass with USD 250 Coverage Liquid Glass with USD 350 Coverage Liquid Glass with USD 500 Coverage OLEOPEL Oleophobic Coating ProofTech Screen Cleaner Kit Protection Coverage 0 USD 250 (one device) USD 350 (one device) USD 500 (one device) 0 0 Liquid Coverage up to 6 devices up to 6 devices up to 6 devices up to 6 devices up to 6 devices way too many Form wipe wipe wipe wipe wipe spray",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30085cf8-e0bb-4b17-a329-0d594fa4371b.__CR0,0,2499,1546_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/ddee2907-608a-4050-8971-745175ac9c18.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/ccc5b643-2fea-489d-8c28-55d055243a5a.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/91349424-9586-4f71-8c8a-7f45356d449b.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/e0a2a07b-c370-41eb-9b90-ab119a742e5a.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/64eb0d5a-26ca-48ec-ba8f-7ffcb42010ab.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/d32f218e-2b54-49d5-83fc-7457e78dbf8e.__CR0,0,2499,1546_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/20f24715-02a9-4865-ae0c-c1e7729f848a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/5d16131c-ee8c-4e23-8fbf-a35cff815a46.__CR0,0,1772,3543_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8261984f-449e-4105-b88a-0d3d81946151.__CR0,0,1772,3543_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c498692c-60b2-449e-b020-0a1237fcc9fc.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/98a694dd-6f3b-41e0-a3a9-b43baba57dcd.__CR0,0,1772,3543_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/489073cf-6d07-4bbc-b700-88db2ff4a0ff.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/975f0d32-39e3-487a-990b-4297350b0138.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Blake",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOATLJDVH5JRS3WVJVO3ZPB4PBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33TZ1ZUQDZXJ9?ASIN=B07XCYVBSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing screen protection without the ability to see a second layer on my screen",
                "reviewText": "I recently tried the Luvvitt Liquid Glass, and it has truly exceeded my expectations as a screen protector. This cutting-edge solution offers remarkable durability and transparency, providing enhanced scratch, moisture, and impact resistance for my device.What sets this liquid screen protector apart is its composition. Made in Germany, it consists of silica dioxide (Si02), essentially microscopic glass particles suspended in a liquid solution. Upon application, it creates an invisible protective coating that elevates the screen's hardness to 9H. It's like adding an extra layer of glass, filling in imperfections, and significantly improving the overall resilience of the device screen.The application process is a breeze, ensuring a bubble-free experience with a universal fit that's perfect for curved screens and tablets. The wipe-on do-it-yourself method simplifies the process, making it accessible for all users.A notable feature is the product's complete harmlessness and invisibility once applied. It seamlessly integrates with the device, providing protection without compromising the aesthetic appeal. It's reassuring to know that it's compatible with all mobile devices, phones, foldable phones, tablets, and smartwatches, including the latest models like Galaxy S22, iPhone 13, Google Pixel 6, and more. The versatility extends to curved and foldable screens, and it doesn't interfere with fingerprint sensors.It's essential to note that while the Liquid Glass enhances protection, it should not be used to repair broken screens or address existing scratches or damages. However, as a preventive measure, it's proven to be highly effective.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "zmonkey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUCIPA2TPULIFH6273ZKDCWPMLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19VP49V016SSJ?ASIN=B07XCYVBSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2021",
                "reviewTitle": "5.0 out of 5 stars Amazing product!",
                "reviewText": "This product is incredible! I used it on my Active 2 smartwatch and it created a perfect coating of glass that will help protect my watch from the bumps and scrapes it gets at work. If your device already has scratches, I recommend a mild (low content) diamond paste being used first to buff out all the scratches, as it will make this product apply evenly to the entire surface. My watch now looks like it did when it was first bought, and has a far better scratch-resistant surface. The instructions are crystal clear, as well, so follow them to the letter. I would recommend this for any smart device that gets a lot of wear and tear. I would have applied it to my smartphone, as well, but it currently has no blemishes and I'm very careful with it. In hindsight, though, I'd have been better off being overcautious, as this coating is likely stronger than the material my smartphone glass is made of. Still, at the price they charge, there's no downside to purchasing a separate kit for each device you need to protect. There is no reason to hesitate. If you want an incredible, affordable scratch protector, there is no easier solution than this.",
                "reviewVotes": "209 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathryn Pojer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLR2YQ6IXAONWHY3GPEIBYZRODQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAU726CS5QZK3?ASIN=B07XCYVBSC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Easy to use and great results",
                "reviewText": "I hate regular screen protectors and never install them right. I had a small scratch on my iPhone 15 pro and I spent a a lot of money on the phone. I bought it outright. Anyway I was looking for something to protect the screen and came across this! What a fabulous little product. It was easy to use and install. My phone looks great the screen is bright no difference with it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nonsha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMEIAATGCJJRJCURPWNJ5GM6DCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE2ZWJCGZJ0E0?ASIN=B07XCYVBSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Thumbs Up",
                "reviewText": "Love this stuff.... Been using it (or similar products called liquid glass) since 2018. I've never had an issue with scratches or cracks on my phone or other electronic screens. Heck I just put this batch on the screen in my new car. Works GREAT!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "zach barnewolt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQC27NUKE3Y64Y4XSS5B5CW2QJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XVI6W8KZQJLF?ASIN=B07XCYVBSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2022",
                "reviewTitle": "5.0 out of 5 stars Great product once it's applied to your phone, but takes a while to do it properly.",
                "reviewText": "I would say this is a great product. If you follow the directions and apply the product properly to the phone you shouldn't have any issues. The instructions does say to apply the coating and wait for it to set overnight which is a small hassle but not a big issue. This is the second phone that I've used a scratch resistant screen coating on and so far this one is better than the previous brand. I've had my phone with the coating for about two months now and have seen no issues.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bucky the Buckaroo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEQ5KORMXMC6S5JZQYN7VSCJL7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CLLC392XITXV?ASIN=B07XCYVBSC",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2021",
                "reviewTitle": "1.0 out of 5 stars It's snake oil.",
                "reviewText": "It's easy to put on. Wipe it on let it dry and wipe it off.However it does nothing. 9H hardness is meaningless it's not the mohs hardness scale it's the pencil hardness scale not a joke do a bit of research it's marking misdirection to fool people . No glass or wipe on coating is going to be a 9 on the mohs scale. The hardest glass reaches around a 7 while normal glass is around 6.5 . Also the coating this stuff leaves is so miniscule it's worthless.From a actually use my screen scratched in two days from the little bit of sand that got into my pocket. I also tested it with a hardness test pick and it scratched just the same as the glass without the protector.Do some research before buying any liquid screen protector none work it's just physics. I didn't do the research and I wasted money. Get a real screen protector and remember 9H hardness is meaningless no screen protector is going to be harder or more scratch resistant than your phones screen they are just there to be a sacrifical layer so your actual screen doesn't get damaged. Do you really think these small time companies making phone accessories are going to have more advanced tech than the world's most advanced glass manufacturing company.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adele L Cox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBUJTN2VYHM4DSW4EFU4WGEVWFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O01UJ1795LQK?ASIN=B07XCYVBSC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "3.0 out of 5 stars Great product",
                "reviewText": "Great product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOUBHOYZP4JKRNEBU64BVAN3TCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HTSUL4MELYPE?ASIN=B07XCYVBSC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "5.0 out of 5 stars so far so good",
                "reviewText": "really easy to install, make sure to let fully dry. forget about the old way, welcome to the new!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Omar AlvarezOmar Alvarez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 26, 2023",
                "reviewTitle": "No tiren su dinero",
                "reviewText": "No tiren su dinero, mi smartwatch se rayo y quebro al primer tallón leve",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81ntlzWgKBL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emily",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 16, 2021",
                "reviewTitle": "Cracks",
                "reviewText": "Bought this, as I had a liquid glass screen protector on my old phone and loved it. About a week after applying, my phone fell (just from my pocket to the floor—and I am only 5’4”, and my screen shattered. Have to get the screen replaced. It is not nearly the same thickness/quality as other liquid glasses I have used, & now I am out a phone screen.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}