{
    "remaining_requests": 37953,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/EIUE-Collection-Size%EF%BC%8CPillows-Alternative-Microfiber/dp/B097CZCDQG",
    "body": {
        "name": "EIUE Hotel Collection Bed Pillows for Sleeping 2 Pack Queen Size，Pillows for Side and Back Sleepers,Super Soft Down Alternative Microfiber Filled Pillows,20 x 30 Inches",
        "price": "$18.99",
        "originalPrice": "",
        "rawPrice": 18.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/EIUE-Collection-Size%EF%BC%8CPillows-Alternative-Microfiber/dp/B097CZCDQG",
        "soldBy": {
            "sellerID": "A1BRTRUKBW9243",
            "name": "WUUU",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1BRTRUKBW9243&asin=B097CZCDQG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CMZRSHG1"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C15J1NP1",
                "variationName": "Color",
                "variationValue": "Light Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31kflfmKZXL._SS36_.jpg"
            },
            {
                "asin": "B0C15JR4LF",
                "variationName": "Color",
                "variationValue": "Light White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41dYLFfiYLL._SS36_.jpg"
            },
            {
                "asin": "B097CZCDQG",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31f-+lzkYXL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "999",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31tiQHWEjnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Lz- wXTlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418AJLHSXCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BFH22lteL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31-Sxa2eK5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31eYTiFSYQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415gyRK2lPL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the EIUE Store",
            "link": "https://www.amazon.com/stores/EIUE/page/23BB45D5-B3A2-459E-A212-DCACB5F97296?ref_=ast_bln"
        },
        "brand": "EIUE",
        "merchantInfo": "WUUU",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 19722,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 14. Order within 7 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Breathable Material: EIUE bed pillow for sleeping goes with a breathable cotton cover and breathable down alternative microfiber, which is friendly to skin and ensures you a comfortable night's sleep.",
            "Balanced Comfort: The filling of the pillow consists of 50% Hollow Fiber and 50% Gel fiber, which provides a great balance of supple softness and plump firmness. The bed pillow is supportive enough and excellent for a back, side or stomach sleeper.",
            "Perfect Size: The dimension of the Queen Pillow is 20 x 30inches(48cm x 74cm)(approx). 1kg(2.2lb) down alternative microfiber filling with breathable cover. Our 2 pack pillows come vacuum-sealed for shipping, once opened it will start to fluff up. Please leave 24 hours for the pillow to get to full thickness before using it.",
            "Careful Maintenance: These bed pillows are machine washable with tumble dry low, and will always feel and look like new! All product materials are carefully selected, strictly inspected and well constructed to make the pillows durable to daily usage.",
            "What You Get: 2 pack of Hotel Collection Bed Pillows .Contact us if you meet any quality issues and we will response within 24 hours."
        ],
        "description": "Features:Unit weight: About 2.2lb/1kg Unit size: 20 x 30in(48 x 74cm)Filler material: 100% polyester fiberPacking: Vacuum packingWashing instructions:1 Gentle cycle machine wash2.Do not bleach,iron and dry-cleanWe provide replacement and refund if you meet any quality issues,Please contact us.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/bedding/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063252"
            },
            {
                "name": "Bed Pillows & Positioners",
                "link": "https://www.amazon.com/bed-pillows-positioners/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1199122"
            },
            {
                "name": "Bed Pillows",
                "link": "https://www.amazon.com/bed-pillows/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10671043011"
            }
        ],
        "productInformation": [
            {
                "name": "Pillow Type",
                "value": "Bed Pillow"
            },
            {
                "name": "Special Feature",
                "value": "Washable, Breathable"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Bed pillow"
            },
            {
                "name": "Item Firmness Description",
                "value": "Extra Soft"
            },
            {
                "name": "Fill Material",
                "value": "Polyester"
            },
            {
                "name": "Cover Material",
                "value": "Microfiber"
            },
            {
                "name": "Product Care Instructions",
                "value": "Dry Clean Only, Do Not Bleach, Tumble Dry"
            },
            {
                "name": "Thread Count",
                "value": "250"
            },
            {
                "name": "Material Feature",
                "value": "Durable"
            },
            {
                "name": "Fabric Type",
                "value": "Microfiber,cotton"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Shape",
                "value": "Oblong"
            },
            {
                "name": "Pattern",
                "value": "Striped"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 19,722 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#61 in Home & Kitchen (See Top 100 in Home & Kitchen) #2 in Bed Pillows"
            },
            {
                "name": "Brand",
                "value": "EIUE"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Number of Items",
                "value": "2"
            },
            {
                "name": "Size",
                "value": "Queen (Pack of 2)"
            },
            {
                "name": "Product Dimensions",
                "value": "30\"L x 20\"W"
            },
            {
                "name": "Item Weight",
                "value": "4.55 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "2.0 Count"
            },
            {
                "name": "Item Thickness",
                "value": "30 Inches"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "forrest",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKXPNXYAPTB76OQMPZPBILS25VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYSGNQ6SNZJ7I?ASIN=B097CZCDQG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars They perform best in a pillow protector!",
                "reviewText": "I was hoping for a satisfactory pillow as the ones I was using before these were awful and flat and just looked sad. After reading reviews of these pillows I was thinking “eh ok they’re probably nothing special”. And when I first took them out of the package, they were nothing special. No firmness, lumpy, too soft. So I put them in the dryer for an hour to fluff them as some of the reviews said and that worked some magic. They came out very fluffy, but still very little support and no substantial firmness. It wasn’t until I put them into their zip-up pillow protectors that I really saw them shine. A pillow protector on these pillows makes them everything you could ever want in a pillow! They’re perfectly firm and fluffy and provide good support, and they look good too. So buy them, and buy a pack of zip up pillow protectors. You’re welcome!",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "statsanalyst",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZDG2MNZ2NXZJJLQ3B6GXMNZLRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O5EYS90E9F0F?ASIN=B097CZCDQG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Worth It",
                "reviewText": "If your looking for a reasonably economical pillow set, look no further.Build Quality: The pillows arrive vacuum packed. I ordered 4 sets. Two of those (remember, there are 2 pillows per set) were compressed evenly to a thickness of ~1.5 in. The remaining 2 sets were less compressed and resembled footballs.Don’t let the size of the compressed pillows fool you. They have some heft to them. Each 2 pillow set weighs in at around 5 lbs (~2.3 kilos). Pillow covering is nice, but thinner than expected. I couldn’t determine the filling type. Judging from the amount of shipped compression I suspect it’s some type of memory foam. They’re also slightly larger than a standard queen pillow, though I had no problems slipping the pillowcase on.Use: A few caveats first. The directions for decompression are on the package label. Read them and heed them. Also be careful opening the package. Compression puts the thick plastic wrapping in direct contact with the pillow cover. A slip of the scissors will result in tearing the pillow’s cover. Now that they’re open, shake them a bit and toss them in the dryer on low heat for 15-20 minutes. Magic happens and they’ll expand substantially.Now that they’re uncompressed, slip a pillowcase on them and give them a try. I found them to be medium firm and comfortable. Most important to me was the absence of flattening after use.Final Thoughts: I normally get new pillows once a year and rated these highly based on one night’s use. It’s also the first time buying from a source other than a big box store so durability is still an open question.",
                "reviewVotes": "78 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emily",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYBZKICCEQHCHOOBYPKH5SJU3EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SEVJSEJQY1R9?ASIN=B097CZCDQG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Good value- not the best of the best but good for the price",
                "reviewText": "So these pillows aren’t as firm as I’d like. They feel so fluffy but when you go to lay on them they flatten out quite a bit. More fluffy than firm feeling.BUT that being said I still think especially with it being a two pack it’s worth the money and is still a good value. Sleeping on both of them together makes the firmness a lot better. And the material itself doesn’t feel bad, they feel like they’ll hold up decently. All in all- for a decent deal for two decent but not perfect pillows- these will do.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TMac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPPD6TNU77KF4COW44FJPG7WOSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQFR5UF1GTNTW?ASIN=B097CZCDQG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Very nice!",
                "reviewText": "I actually got these because I ordered a pillowcase set and they were for king queen size pillows so I needed some new pillow cases anyway so I figured why not? Put in the dryer for about 10 minutes and they came out nice and fluffy! Not too firm, not too soft! This Goldilocks found these perfect. Nice cover on them too it's very soft! A good size, and I would recommend!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelly Webb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4DREMBSJ5JMSIUK2465C3KUGXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXA8VRWOVV0TY?ASIN=B097CZCDQG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars They are like a cloud",
                "reviewText": "I was disappointed when I first opened the package because they are vacuum sealed and flat as a pancake. I didn't have confidence that they were going to fluff up enough. I threw them in the dryer with a couple of tennis balls for a out 30-40 min, occasionally shaki.g the pillows and hand fluffing them. These pillows are like clouds! They are super soft and fluffy. You don't realize how pillows change your sleep until you have decent pillows. I'm ordering 4 more for my bed and my guests bedroom.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob CBob C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGEMRYZDEGYOX7IMWD6KJ3J62RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TQO5R9LW6CYR?ASIN=B097CZCDQG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 1, 2022",
                "reviewTitle": "5.0 out of 5 stars Pretty good pillows, especially for the price",
                "reviewText": "It has been years since I bought any pillows. Understandably, the filling in my pillows had lost integrity and the pillows had become sacks of loose flab. I also did not realize what pillows cost these days. Well, I needed sheets, pillows and a bath mat, so I drove to the store with the initials BB&B, figuring that was the place to buy bedroom and bathroom stuff. Wasn't very happy with the selection. Was shocked by the prices. They had some really fancy pillows at $150 a pop, some pretty nice pillows at $50 a pop and some decent pillows at $25 a pop, but the choices were pretty limited. In all honesty, I could not detect $125 worth of difference between their best pillows and their worst pillows. I decided to look on Amazon before buying anything. I found these pillows at $18 a pair. I was skeptical of the quality, because I believe that you get what you pay for. I was skeptical of the degree of support the pillows would offer, because the pillows are shipped flattened out like a pancake in a vacuum bag. I figured that they would compress again when you used them. But I figured at that price, I could use the pillows as fill material in shipping boxes if they were ill suited for bedroom use. I ordered two pair. I have to say I am pleasantly surprised. When you take the pillows out of their bag, they fluff up to five or six times their volume in the bag, and they retain that volume pretty well. After fluffing my pillows manually, I put them in my dryer (set on low) to heat and fluff them further. My old pillows were in really sad shape, so maybe I am not the best judge of quality. But these pillows are a great improvement over the ones I had been using. They definitely are worth $9 apiece. I can't claim they are as good as the $50 pillows I liked, because I can't make a side-by-side comparison. But from what I can remember of how those pillows felt, these pillows are just as good. I am sure glad I did not pay $200 to replace my old pillows.Update 9 months later:I am still quite happy with these pillows. I even raised my rating from 4 stars to 5. I have added a photo that shows how they have retained their \"fluff\" after 9 months of use. I am no great connoisseur of pillows - or of wine. Maybe there are indicators of quality that I simply cannot perceive, but I would not pay $150 for a pillow, any more than I would pay $150 for a bottle of wine. In my estimation, these pillows are a great value at $9.50 apiece. I honestly don't know why anybody would pay $50 or $100 more for a pillow.",
                "reviewVotes": "102 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Wq++X8+VL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deborah S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETICQRO2S2VQBA4NELQPR44RBNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18QS3E4FMS18N?ASIN=B097CZCDQG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars Not right description",
                "reviewText": "These set of pillows aren't what was advertised. They don't have a firm side as an option. They're extremely soft .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marce A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 9, 2024",
                "reviewTitle": "Comodidad",
                "reviewText": "Súper cómoda, estoy encantada con el producto muy recomendable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noreen Stack",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 21, 2023",
                "reviewTitle": "The best pillows!",
                "reviewText": "We have really enjoyed our new pillows.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LolLol",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 20, 2022",
                "reviewTitle": "Read this before buying",
                "reviewText": "These were advertised (and i bought ) as 30x20. I have shown them in the photographs as actual size 24x 17",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/614tIdV9mRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61AoOTOLfyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51K82IdM2yL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Devano",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on January 24, 2024",
                "reviewTitle": "Nice and fluffy",
                "reviewText": "Good quality pillows. 👌🏾",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arcadio Gaona",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 27, 2024",
                "reviewTitle": "Lo que buscaba",
                "reviewText": "Son muy grandes están perfectas",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$20.99",
                "sellerName": "fastwoo",
                "sellerRating": "4.5"
            }
        ]
    }
}