{
    "remaining_requests": 37914,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sidney-Sleep-Sleeper-Pillow-Shoulder/dp/B0993G154N",
    "body": {
        "name": "Sidney Sleep Pillow for Side and Back Sleepers - Comfort for Neck and Shoulder Pain - Adjustable and Customizable Shredded Memory Foam Filling - Queen Size - Includes Additional Foam Fill (White)",
        "price": "$38.99",
        "originalPrice": "$64.99",
        "rawPrice": 38.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sidney-Sleep-Sleeper-Pillow-Shoulder/dp/B0993G154N",
        "soldBy": {
            "sellerID": "A13MH3TK5EWN3V",
            "name": "Sidney Sleep",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A13MH3TK5EWN3V&asin=B0993G154N&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0993H1XJC"
        ],
        "asinVariationValues": [
            {
                "asin": "B0993G154N",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41+P5yf1xeL._SS36_.jpg"
            },
            {
                "asin": "B0B6WN5PDS",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51D97VaRFfL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/410TiNgO7sL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41-0H gedoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41smGUGKveL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zzj0VAz9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UcdnB5rhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NDOMGvxAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-IC5pwRSL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Sidney Sleep Store",
            "link": "https://www.amazon.com/stores/SidneySleep/page/B40FFDF9-CC69-44A6-9C24-9B5588A637C2?ref_=ast_bln"
        },
        "brand": "SidneySleep",
        "merchantInfo": "Sidney Sleep",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 6779,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 40 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "OEKO-TEX STANDARD 100 requires textiles-based products to be tested against a list of 1,000+ chemicals, to limit those which may be harmful to human health. Certification focus: #ProductSafety and #ChemicalsUsed."
        },
        "features": [
            "MASTER YOUR COMFORT: Are you a side or back sleeper? Our adjustable shredded memory foam bed pillow gives you the power to shape your sleep. Simply add or remove filling to adjust the pillow's firmness and height.",
            "ADJUSTABLE HEIGHT: Too firm, too high, too soft, too low? Customize it your way! Our curved cervical neck pillow with extra filling included, makes it easy for you to adjust the loft to your liking. Sidney Sleep, one pillow, multiple comfort possibilities.",
            "PERSONALIZE YOUR SLEEP: Unlike traditional down pillows, our pillow is designed especially for side and back sleepers to achieve the best sleep possible. Fully customizable to find the perfect blend of support and comfort that suits your unique sleeping preferences.",
            "SLEEP IN LUXURY: The soft breathable inner and outer pillow cases ensure an unmatched sleep experience. Wake up feeling rejuvenated and ready to take on the day",
            "EFFORTLESS UPKEEP: The plush outer pillow case is removable, machine-washable, and dries quickly. Queen Size pillows are 19” x 29”"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/bedding/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063252"
            },
            {
                "name": "Bed Pillows & Positioners",
                "link": "https://www.amazon.com/bed-pillows-positioners/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1199122"
            },
            {
                "name": "Bed Pillows",
                "link": "https://www.amazon.com/bed-pillows/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10671043011"
            }
        ],
        "productInformation": [
            {
                "name": "Pillow Type",
                "value": "Bed Pillow"
            },
            {
                "name": "Special Feature",
                "value": "Firm out of the Box with Adjustable Easy to Adjust FIlling, Additional Memory Foam FIlling Included, Contoured Hugging Curve, Removable Plush Pillow Cover, Machine Washable"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Sleeping"
            },
            {
                "name": "Item Firmness Description",
                "value": "Medium Firm out of the Box (Adjustable Filling)"
            },
            {
                "name": "Fill Material",
                "value": "Shredded Memory Foam Blend"
            },
            {
                "name": "Product Care Instructions",
                "value": "We recommended placing your pillow in the dryer on low heat once every two weeks to help distribute the memory foam filling evenly., Fluff daily for maximum performance and comfort"
            },
            {
                "name": "Thread Count",
                "value": "100"
            },
            {
                "name": "Fabric Type",
                "value": "Polyester, Viscose Rayon"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Shape",
                "value": "Semicircular"
            },
            {
                "name": "Pattern",
                "value": "Geometric"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Seasons",
                "value": "All-Season"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 6,779 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#994 in Home & Kitchen (See Top 100 in Home & Kitchen) #14 in Bed Pillows"
            },
            {
                "name": "Brand",
                "value": "Sidney Sleep"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Size",
                "value": "Queen (Pack of 1)"
            },
            {
                "name": "Product Dimensions",
                "value": "29\"L x 19\"W"
            },
            {
                "name": "Item Weight",
                "value": "5.24 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Sidney Sleep Curved Bed Pillows are filled with our premium blended memory foam. They are snuggly, soft and wrapped in a plush machine washable outer cover. Take control of how you sleep by being able to adjust your pillows loft to suit you personal sleep style. Better Sleep Starts Today",
                "media_link": []
            },
            {
                "media_text": "Premium Adjustable Filling Choose your pillow Loft - control how you sleep Curved for Comfort Contours to your shoulders natural curves Shoulder and Neck Support Helping you get comfortable, faster Support that Lasts Giving you individual control over how you sleep",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/147d7133-cf51-4132-8abb-8545fd2cd4a9.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d086acd8-e67c-4c4e-8b29-da50e3df207b.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8a6a942e-0647-411d-8fd2-c6aa8d16d25c.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/685d3f66-397b-498b-b5d9-5db633945dc5.__CR0,0,600,450_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "EASY CARE INSTRUCTIONS FOR YOUR NEW PILLOW",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a1a2048-33aa-4b32-8bb8-4f89931188de.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "COMPLETE THE LOOK Fitted Curved Pillowcase Traditional Bed Pillows Set of 2 Queen Pillows Ultra Comfy Fitted Pillowcases Breathable soft brushed microfiber for a cooler nights sleep Adjustable Memory Foam Pillow Adjustable memory foam bed pillow Set of 2 Queen Curved Pillows Set of 2 Adjustable Bed Pillows Zipper Closure Comfortable fit, machine washable tailored curve pillowcases Side Back and Stomach Sleepers Adjustable memory foam fill for control over how you sleep Adjustable Comfort Couples Set of 2 Queen Size Pillow Bundle. Better Sleep Starts Now",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aefb4f92-f96a-460b-8c55-effefb09d624.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/559d428f-78c8-49a4-83cb-c1c54c05ad4c.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3d6d58b-b7d1-464e-a05f-06e11e71eccd.__CR0,0,600,450_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97ffa99c-9067-4113-a128-f8f92c0224ee.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/147d7133-cf51-4132-8abb-8545fd2cd4a9.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d086acd8-e67c-4c4e-8b29-da50e3df207b.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8a6a942e-0647-411d-8fd2-c6aa8d16d25c.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/685d3f66-397b-498b-b5d9-5db633945dc5.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a1a2048-33aa-4b32-8bb8-4f89931188de.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f2516cbb-d66d-482c-8d39-bd7bfcc62466.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aefb4f92-f96a-460b-8c55-effefb09d624.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/559d428f-78c8-49a4-83cb-c1c54c05ad4c.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3d6d58b-b7d1-464e-a05f-06e11e71eccd.__CR0,0,600,450_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jacks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHHFQUME6FVGGJHG4OARLVWDB4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SEDQVY8WEVFP?ASIN=B0993G154N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2022",
                "reviewTitle": "5.0 out of 5 stars Great for side sleepers and neck pain!",
                "reviewText": "*This is a HONEST review from a real buyer! I read reviews about everything before purchasing and I often feel mislead.. I hope that my review can help someone else who may be having the same issues or sleep in the same strange position as I do*After suffering a neck and shoulder injury in early January I've spent the whole year and a ton of money searching for and testing anything and everything to provide even the slightest bit of relief. Finally my search has ended thanks to this pillow!I am an avid side sleeper and although medium to hard pillows are recommended, my whole life I have gotten away with the big soft fluffy pillows with no problems at all, that is until my injury. On my 2022 pillow hunt journey I've tried pillows made of all different things, shapes and sizes and each one seemed to be worse than the last and almost all of them (although the claim to be medium) are so hard I swear you can knock someone out with it.The Sidney pillow was one of the first to go in my cart but I kept putting it off due to some of bad reviews I read (particularly the chemical burn ones) and ended up going for more expensive pillows.HUGE MISTAKE!Finally I was in such extreme pain, sleep deprived, desperate and seen this pillow could arrive that night so ordered it and ordered 2 other kinds of pillows as well just incase.. Sidney pillow showed up around 4 am I immediately took it out of the package threw my own pillow case over it and tried laying on it right away before it fully expanded. There was a slight smell but I didn't care I had no patience and I just wanted sleep. After a few minutes I decided to add more stuffing (because it had not yet expanded fully) and layed back down and FINALLY got some sleep. When I woke up I did remove some of the stuffing and put it back in the bag and left the pillow to lay out with both the cover it comes with and my own off for the remainder of the day and occasionally fluffing it. By bedtime the smell was gone and it took just a little fluffing to get it how I wanted it and then I drifted off to the land of nod.The sidney pillow is what I would consider a \"medium\" pillow. Not so hard you feel like your laying on a rock but not so soft you have no neck support and falling into it. The slight curve in the pillow may not look as though it would make that big of a difference. I personally underestimated the curve lol. Now I can't imagine using a pillow without that curve. Ive tried many contour pillows but they are always so hard and they dont properly support the curve of my neck as they are to high and seem to be more for back sleepers. I never sleep with my pillow laying horizontally.. I like to sleep on my right side with my right arm upwards and underneath my pillow and kinda hug it. Normally this makes me need two pillows one to hug and another to lay my head on but that needs constant adjustment as I move or there are L or J shapped pillows but those do not provide enough pillow to hug on the longer leg side of it plus they take up a lot of space in bed. So if you sleep like me, the curve with the Sidney Pillow allows you to perfectly form around it and the pointed corner ends wraps under your neck and head and around your shoulder giving the extra support normal rectangular pillows do not.After the first time sleeping on it I already felt less neck pain when waking up. After 3 days zero neck pain or shoulder pain upon waking up. Of course as the day goes on depending what I'm doing the pain starts to creep back up on me but with the help of this pillow I'm easily and comfortably able to get to sleep each night. No more tossing and turning all night, no smell after airing the pillow out and allowing it to expand properly and no chemical burn which was my biggest fear cause I have super sensitive skin. I do not feel the cubes of stuffing as others said through the pillow case when I lay on it or even by running my hand over it. The cubes are very tiny and in no way jabbing at your face lol. It does take a little fluffing at first but I have not needed to constantly fluff it or had issues with it losing its shape. In fact the longer I've used it the better it has gotten as it has molded perfectly to me and my bodies natural curves and where I need the support.I know going off others reviews is difficult when it comes to pillows because everyone is different and sleeps differently but I truly think this pillow could be the one for just about anyone as it's easily adjustable to your liking of firmness and it molds to you and your body and sleeping position rather than the permanent pre cut and shaped you see with other pillows.I definitely recommend this pillow just be sure to remove the pillow case it comes with and allow it to air out and occasionally fluffing it during this process to release the fumes and help it expand properly. You may want to play around with the amount of stuffing you want in it to find what is best for you but don't lose patience if the first night it's not perfect because the more you sleep on it the more it will form to you and your curves. It truly becomes a pillow that seems as if it was molded just for you. I also don't recommend using it as a pillow you lean against in bed when sitting up reading or watching tv because that will change the form it has built for your individual neck, head, and shoulders.",
                "reviewVotes": "891 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JWells",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2A33B4M2FFDJNWI4YUFJHZSBTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QHSNGHX0MR3M?ASIN=B0993G154N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars I FINALLY FOUND THE PERFECT PILLOW!!!!!!!!",
                "reviewText": "I have been on a quest to find the perfect pillow for YEARS!!! Pillows were either too soft, too firm, too thick, or too thin. THIS ONE IS PERFECT!!!!!! FINALLY!!!!!!! I sleep in all positions, so that’s another huge reason I haven’t been able to find a great pillow for myself. I sleep on my back, both sides, and my stomach. And this pillow has been AMAZING in EVERY POSITION!! I love the shape of it, the softness, the just right firmness, the way it doesn’t lose shape, the way you can fluff it wherever you need a little more fluffing, and the way you can reduce or increase the stuffing! I still have not added or taken out any stuffing, but I love knowing that I can any time I need to. When I first opened it, I fluffed it in the dryer on low heat for 15 minutes (per instructions), and it came out so marshmallowy perfect!Please excuse all of f my exclamation points in this review, but I have been searching for the perfect pillow for so long, I am ECSTATIC to have FINALLY found it!!!!!!! NO MORE SORE NECK & FINALLY GREAT SLEEP!!!!!",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura Callaway",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJXPUMFTJ32Q5DIGDSU33HGGFJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11OIB5L2VJLDB?ASIN=B0993G154N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 17, 2023",
                "reviewTitle": "4.0 out of 5 stars Big improvement!",
                "reviewText": "I’m a stomach/side sleeper and had purchased a new set of pillows after moving which turned out to be way too bouncy and “resilient”. Even after six months, they wouldn’t flatten out in the least - I was tossing and turning every night, getting a pain in my neck and tension headaches from the odd angles these unyielding pillows put me through. This pillow is a godsend! Although it comes with a pouch of extra filling, I don’t need it, as it’s just enough the way it is - which is nearly flat. Although it’s quite flat, the memory foam inside is strong enough that I still feel cushioned. The shape makes it easy to get a little support on your face as well as neck when you’re sleeping in your back or side. The dark grey color is perfect and the quilting is nice. Only downsides are that I can see little tufts of stuffing already coming out from the stitching and also it’s pretty impossible to find a cover that fits. Having said that, if you turn it around, it resembles the silhouette of a cat head, bonus!",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pro gamer123",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY2ZOUZF6FETA46WNABKQ5K73FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QV9O7ZEGQ36E?ASIN=B0993G154N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Super pillow!",
                "reviewText": "The pillow comes with an extra package of stuffing material to allow for customization. I have slept on both back and side and was very comfortable and well rested. The curved design accommodates shoulder and allows for proper alignment. I wish I could give it 10 stars!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristina Joyce",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTA6SCVGFWCXUANLRYP46A66M7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRV2HRX0C9K6Q?ASIN=B0993G154N",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "3.0 out of 5 stars Very Comfortable but Terrible Smell",
                "reviewText": "I have nerve entrapment in the shoulders, elbows and wrists. I am a side Sleeper, and this pillow has really helped. However, it has been a week and it still has this terrible smell. It smells less than it did, but still very noticeable. I'm going to keep using it because it's very comfortable, and hopefully the smell goes away.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOYLY6AZCDKBVHQBGQWKNMFMRWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38ROXKH7FZ9C5?ASIN=B0993G154N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing pillow",
                "reviewText": "I have searched for years for the perfect pillow.Tossing and turning and morning neck pain were the normal daily routine. Say this pillow and thought why not try again.I was amazed at the comfort level the first night and now I sleep all night and no morning neck pain .I recommend this pillow for those who have spent years searching like me.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Georgia Peach",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG4XTOMFJQDYTJAWJKVDNVDWEDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R332CTWLJH76E5?ASIN=B0993G154N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Comfortable pillow",
                "reviewText": "I have neck issues and I no longer get numb fingers and hands with this pillow. It is adjustable, it comes with extra filling to add more if needed. It also has a cloth bag to take out too much filling. Only you know how firm or soft of a pillow that you need. I love the curved design because it cradles your head and neck. It is made in China and is Certi-Pur, US certified that it has no harmful chemicals.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 26, 2023",
                "reviewTitle": "La mejor compra",
                "reviewText": "Excelente. Sobre todo si duermes de lado, es genial. No despiertas con dolores de cuello.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica L'Herault",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 15, 2023",
                "reviewTitle": "Love this pillow!",
                "reviewText": "This pillow is wonderful! I love that I can customize the amount of filling in it, and the shape of it is just right for side sleeping. I have tried like 5 pillows before this and they all sucked compared to this one! Also stays cool all night! LOVE it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MAC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 15, 2022",
                "reviewTitle": "A comfortable pillow and soft pillow",
                "reviewText": "a comfortable pillow and the shape helps my neck and back. good quality fabric too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "linda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 6, 2023",
                "reviewTitle": "A big treat",
                "reviewText": "It was a big treat to invest in a pillow I was a bit doubtful it would help me sleep but it's worth investing in from my perspectiveIt takes a little while to have the right volum of memory foam for you personally but once you find the right amount it's great. It's slightly strange having a pillow this shape and it's easy not to put your head properly on it so resting the crown rather than whole side of head but you'll know because your just nit as comfy as you should be so pull it down securely under your head and although you know your heads on something but alchmy happens as once your resting on it youve not much time to think because your fast asleep which for insomniac me is great.You don't need to search for the right shape pillow case as I did but use a regular pillowcase it doesn't detract from the pillowYou get a nice back with lots of extra memory foam so you'll be able to use as much or as little as suits you bestI found using a bit more than I expected to need was best for meI would recommend this pillow",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandy Lau",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on August 15, 2023",
                "reviewTitle": "good",
                "reviewText": "I sleep well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}