{
    "remaining_requests": 37740,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cooling-Pillows-Sleeping-Shredded-Memory/dp/B0CN8CZZJR",
    "body": {
        "name": "Cooling Bed Pillows for Sleeping 2 Pack, Shredded Memory Foam Pillows Queen Size Set of 2 - Adjustable Bamboo Pillows for Side Back Sleepers with Cooling Washable Cover, Medium Firm Support Pillows",
        "price": "$39.99",
        "originalPrice": "",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cooling-Pillows-Sleeping-Shredded-Memory/dp/B0CN8CZZJR",
        "soldBy": {
            "sellerID": "A1U6YKW23ED8B3",
            "name": "SofGlowly",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1U6YKW23ED8B3&asin=B0CN8CZZJR&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CRV8M8T3"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CN8N2MHB",
                "variationName": "Size",
                "variationValue": "Queen (Pack of 1)",
                "price": "$32.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CN8CZZJR",
                "variationName": "Size",
                "variationValue": "Queen Size (Pack of 2)",
                "price": "$39.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "9",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 20% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41UFl-TQfEL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41kgKxkVgwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418dFbifQcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51l9MbJXzKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41V1ii0Fh0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41f2rm0ZN1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BlVx249qL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: SofGlowly",
            "link": "https://www.amazon.com/SofGlowly/b/ref=bl_dp_s_web_120708697011?ie=UTF8&node=120708697011&field-lbr_brands_browse-bin=SofGlowly"
        },
        "brand": "SofGlowly",
        "merchantInfo": "SofGlowly",
        "customerReview": "5.0 out of 5 stars",
        "customerReviewCount": 10,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "OEKO-TEX STANDARD 100 requires textiles-based products to be tested against a list of 1,000+ chemicals, to limit those which may be harmful to human health. Certification focus: #ProductSafety and #ChemicalsUsed."
        },
        "features": [
            "🌟 Fully Customizable Comfort: SofGlowly breathable cooling memory foam pillow is made with an innovative blend of high-end cross cut shredded memory foam and microfiber, designed to mold to the contours of your neck, and keep your neck and back properly aligned. Wake up feeling refreshed and energized every morning.",
            "🛌 Adjustable Loft and Firmness: Say goodbye to pillows that are too hard, too firm, or too soft. Our adjustable pillow provides hotel-quality softness and offers firm support. The zippered inner and outer covers allow you to add or remove foam filling to customize the loft and firmness, ensuring the perfect comfort level for your sleep position.",
            "❄️ Luxury Cooling Bamboo Pillow: Made from premium bamboo material, our cooling pillows for sleeping is ultra-soft and luxurious, providing a cloud-like sleeping experience. The bamboo cover of memory foam pillows 2 pack is removable and machine washable for easy care. Bed pillows queen size set of 2 :20\" x 30\"",
            "🌬️ Innovative Cooling Technology: Tired of waking up sweaty? The cooling pillow uses premium shredded foam allows the hotel pillow to let air through every area,allowing for excellent airflow to keep you cool and comfortable throughout the night.Our pillow features a double-sided cover for cooling and a soft touch. A real inside-out Breathable Cool Pillow.",
            "🔁 Never Go Flat: The memory foam pillows are designed with a slow-rebound feature to ensure full support with comfort and softness. The innovative memory foam technology adds durability, so you'll never have to worry about rearranging or flipping your pillow in the middle of the night.We are convinced the queen pillows 2 pack will exceed your expectations! The most comfortable and cold pillow!",
            "✅ [New Foam Filling] Unlike other down bed pillows, we freshly manufacture our foam instead of using repurposed materials.No worries if it has a slight odor, it's normal with new foam. Allow it to air out for about 1 or 2 days. Our pillows for side sleepers is sure to become your new favorite way to stay comfortable while sleeping!",
            "✅[Idea for All Sleep Positions] back sleeper in need of medium loft remove about 1/4 of the fill. side sleeper required firm pillow try as is. stomach sleeper prefered thin, soft pillow remove about 1/3 of the fill.Certified with CertiPUR-US, SofGlowly queen pillows set of 2 are SAFE FOR YOU AND YOUR LOVED ONES.",
            "Quality Certification:All the fluffy bed pillows are made in an OEKO-TEX Standard Certified factory that ensures textiles meet high safety and environmental standards. All fill material is made of clean and new cross-cut memory foam and microfiber blend, You can buy all the SofGlowy shredded memory foam pillows with confidence.",
            "❤[ Best Gift for Family and Friends (Home Must Haves) ] This pillows for bed -home decor accessory would be a sign of care and attention to family member, friend, driver, student, teacher or anybody with sleep problems. Cooling gel pillow is a perfect gift idea as Christmas gift, birthday gift, Mother's Day gift, Valentine's Day Father's Day gift."
        ],
        "description": "Ergonomic Adjustable Pillow NEVER FLAT Head/Neck Full Support When our sleeping, We usually Keep the sleeping position for at least a few hours. The doctor recommended that we should choose the pillows that can provide a long supportive . We focus on designing pillows that meet this feature SofGlowly Shredded Memory Foam Pillow.Our pillow is filled by shredded memory foam. The amount of inner core memory foam is twice than of ordinary memory foam pillows. It can provide longer-lasting support than ordinary sponge.Head/Neck Full Support Pillow Size: Queen Size 2 Pack pillows Pillow Filling: 100% cooling Shredded memory foam Out Cover: Soft bamboo side & Cooling fabric side Inner Cover: Smooth Washable fabric liner side /back/stomach Sleeper Pillow Fully adjustable",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/bedding/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063252"
            },
            {
                "name": "Bed Pillows & Positioners",
                "link": "https://www.amazon.com/bed-pillows-positioners/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1199122"
            },
            {
                "name": "Bed Pillows",
                "link": "https://www.amazon.com/bed-pillows/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10671043011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "SofGlowly"
            },
            {
                "name": "Special Feature",
                "value": "Cooling, memory foam pillows, side sleeper pillows for adults, Adjustable, bamboo pillows for side sleepers Queen size 2 pack See more"
            },
            {
                "name": "Color",
                "value": "Luxury White"
            },
            {
                "name": "Size",
                "value": "Queen Size (Pack of 2)"
            },
            {
                "name": "Fill Material",
                "value": "Memory Foam"
            },
            {
                "name": "Shape",
                "value": "Square"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "extra firm memory foam pillow, Sleeping, Traveling, Studying, Resting"
            },
            {
                "name": "Use for",
                "value": "Head, Back, Body, Arm, Leg"
            },
            {
                "name": "Material",
                "value": "Memory Foam"
            },
            {
                "name": "Item Firmness Description",
                "value": "Medium Firm"
            },
            {
                "name": "Product Care Instructions",
                "value": "The bamboo cover is Machine Washable, The inner core can not wash"
            },
            {
                "name": "Number of Pieces",
                "value": "2"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Material Feature",
                "value": "Soft, Breathable"
            },
            {
                "name": "Material Type Free",
                "value": "PVC Free"
            },
            {
                "name": "Fabric Type",
                "value": "The Inner Core: Made of New Shredded Memory Foam Pillow, Out Cover- Cooling Side is Made of Cooling Ice Silky Fabric., Out Cover- the Soft Side is Made of 40% Viscose from Bamboo 60% Polyester, Inner Cover: Breathable and Smooth Fabric"
            },
            {
                "name": "Model Name",
                "value": "cooling pillows queen size set of 2"
            },
            {
                "name": "Specific Uses For Product",
                "value": "cool pillows for sleeping that stay cold, bamboo memory foam pillow, cooling gel memory foam pillow, bed pillows queen size set of 2, side sleeper pillow for neck and shoulder pain"
            },
            {
                "name": "Product Dimensions",
                "value": "30\"L x 20\"W"
            },
            {
                "name": "Item Weight",
                "value": "8.81 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "SofGlowly"
            },
            {
                "name": "ASIN",
                "value": "B0CN8CZZJR"
            },
            {
                "name": "Item model number",
                "value": "bamboo bed pillow 1 pack"
            },
            {
                "name": "Customer Reviews",
                "value": "5.0 5.0 out of 5 stars 10 ratings 5.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#128,491 in Home & Kitchen (See Top 100 in Home & Kitchen) #440 in Bed Pillows"
            },
            {
                "name": "Date First Available",
                "value": "November 14, 2023"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Queen Size Bamboo Pillows for Sleeping Cooling Bed Pillows for Sleeping Set of 2, Adjustable Shredded Memory Foam Pillows Bamboo Pillows for Side Back Sleepers One third of human life is spent in sleep, and the quality of sleep affects the quality of your life.The fast-paced modern life now calls for a better sleep experience, Are you having a hard time getting to sleep? Are you a hot sleeper? Have you tried down pillows, feather pillows,or other pillow, but no avail? Now it's time to try this 2-pack cooling shredded memory foam pillow! The premium shredded foam is infused temperature regulating cooling particles into the foam to alleviate excessive heat build-up, so no heat is captured during the night. The high air flow also keeps moisture out for a healthier sleeping atmosphere. Also these adjustable pillows to your comfort sleeping loft,no matter you're a side,back,or stomach sleeper. Too soft, you don’t feel supported; Too firm and it’s hard to get comfortable. Look, this adjustable bed pillows offer the ideal balance of formable, comfortable support,to help you sleep like a carefree baby freely.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9de8670a-b4e0-4153-a2ac-c8517d808b6c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "A Unique Pillow That Belongs To You Only Only what suits you is the best. You can adjust the height by adding or reducing the filling inner core of the Shredded memory foam pillows. High or low, more or less. Until make it become the most comfortable height you want. At the same time, it supports a variety of different sleeping positions in a perfectly balanced manner.No matter side sleeper or back sleeper,even though the stomach sleeper. You will always find a height that it's the most comfortable for you.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1eb6542d-630e-4a47-855c-5e84cb0f5f6b.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "TWIN SIDE DESIGN Inside-out Breathable SofGlowly Cooling Pillow-Double Sided Design SofGlowly cooling pillows for sleeping is designed with double-sided cover for cooling&soft touch. 1.The bamboo side is built to keep your pillow in place, while the cooling side is ice cold and silky soft to the touch, reducing the heat your body produces during the night. 2.The brand new cross-cut memory foam makes SofGlowly cooling pillow softer and more breathable than solid memory foam. It allows warm air to escape while being replaced with fresh, cool air. Even when you twist and turn positions throughout the night, this sleeping pillow gives consistent support to your cervical spine and shoulders.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/db798345-c56a-4f8a-9609-9edd9f2e244b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "User Guide Take it out ,slight hit and squeeze, then leave it about 6-8 hours let it fully expand ADD or REMOVE foam filling to find the perfect comfort level and enjoy a personalized sleep experience. Ergonomic Adjustable Pillow NEVER FLAT Head/Neck Full Support When our sleeping, We usually Keep the sleeping position for at least a few hours. The doctor recommended that we should choose the pillows that can provide a long supportive . We focus on designing pillows that meet this feature SofGlowly Shredded Memory Foam Pillow.Our pillow is filled by shredded memory foam. The amount of inner core memory foam is twice than of ordinary memory foam pillows. It can provide longer-lasting support than ordinary sponge.Head/Neck Full Support Pillow Size: Queen Size 2 Pack pillows Pillow Filling: 100% cooling Shredded memory foam Out Cover: Soft bamboo side & Cooling fabric side Inner Cover: Smooth Washable fabric liner side /back/stomach Sleeper Pillow Fully adjustable",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8942258b-7a5f-42ea-941a-092a3ac69bef.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de894ded-21a7-4ec4-9862-d4e8d412b71f.__CR0,0,2290,1145_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "cooling pillows for sleeping make a comfty summer night. I am sure you will fall in love with this cool feeling. Cooling Bamboo Pillow Hapiclody bed pillows is designed with double-sided cover for cooling&soft touch. The cooling side is made of cooling ice silky fabric, and the soft side is made of bamboo from rayon. So the bamboo side is built to keep your pillow in place, while the cooling side is ice cold and silky soft to the touch, reducing the heat your body produces during the night. CROSS-CUT Shredded Memory Foam Shredded memory foam allows air to circulate smoothly within the sleeping pillow, and the cooling pillow cover provides breathability and softness, so this pillow can maximize air circulation while you sleep. You can finally wake up refreshed. Machine Washable Remove the outer cover and machine wash or hand wash it, hang it dry, do not machine the pillow directly, do not use bleach. Place the filling inside in a ventilated place for drying.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/52f387b0-e166-4b24-8ff7-7030fbd0f3cb.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c87ba658-bf17-4cb5-aedc-3337e392a3ed.__CR0,0,709,709_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0738a818-909a-4cc6-a721-b4d87a0ac330.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "YOU DESERVE THE BEST Memory foam pillows queen size IMPORTANT INSTRUCTIONS: SofGlowly memory foam pillows require different care than regular pillows. Follow these few tips to ensure you get the most out of your pillow. Prep Your Pillow: 1.Remove your pillow from the packaging, open the vacuum sealed bag and wait for it to take shape. The pillow may look small and compact at first. 2.After removing the pillow from the packaging, remember to pat and squeeze the pillow. 3. Allow the pillow to air out for 24 hours. Then put it into your dryer on low for 5-10 minutes. This will get your shredded memory foam pillow to its best shape and normal fluffy. How to Care for Your Pillow: 1.Remove the outer cover and machine wash or hand wash it, hang it dry. Do not bleach. 2. You may want to put your pillow in the dryer every 3-4weeks for 5-10 minutes, This will help the pillow retain its desired shape and texture. 3.The shredded memory foam can't be washed. Do not machine wash the pillow directly. Please only wash the pillowcase. 4. Place the filling inside in a ventilated place for drying.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/91b318b4-4aea-4df8-b5cd-6d2c12705d55.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9de8670a-b4e0-4153-a2ac-c8517d808b6c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1eb6542d-630e-4a47-855c-5e84cb0f5f6b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/db798345-c56a-4f8a-9609-9edd9f2e244b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8942258b-7a5f-42ea-941a-092a3ac69bef.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de894ded-21a7-4ec4-9862-d4e8d412b71f.__CR0,0,2290,1145_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/52f387b0-e166-4b24-8ff7-7030fbd0f3cb.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c87ba658-bf17-4cb5-aedc-3337e392a3ed.__CR0,0,709,709_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0738a818-909a-4cc6-a721-b4d87a0ac330.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/91b318b4-4aea-4df8-b5cd-6d2c12705d55.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "seatless",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGS3LGM7JJ32Y52NYVVHB74E62FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UHVA4HM9FUMR?ASIN=B0CN8CZZJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars They work",
                "reviewText": "At 80 I have been through a lot of pillows. Been using 5----yes 5 not a typo. Now down to 2 great sleeping pillows. Hope they last.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris Esq.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2GCYIS4W5Y3OBT3VRAIHEUNL7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1045FBF0B2T5?ASIN=B0CN8CZZJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars My favorite pillow ever!",
                "reviewText": "This is my favorite pillow out of the hundreds I've used over 46 years. Frankly, I was a bit skeptical because a famous, cable news advertising version of this kind of pillow gets universally lambasted. I wasn't sure about the shredded memory foam construction, but I now see the brilliance of the design. Unlike the memory foam pillows I've used in the past (which I liked), this one caresses my head better. I think it's due to all the individual pieces better conforming to my head and neck than the typical single-piece pillows.It's absolutely freezing at the time I'm writing this review, so I can't comment on how cooling it is, but I wouldn't be surprised if the cooling works as advertised. I'm not quite sure how to explain it, but it doesn't have that dense, trapping the heat from my head feeling of most pillows. It feels light and airy rather than dense and warm.The most important criterion for how well a pillow performs is how well I sleep with it, and so far so good with this one! I feel like I'm sleeping sounder and waking less. I also feel like I'm getting better sleep.If you've never tried a torn memory foam pillow, and you're struggling to find a pillow that works for you, I recommend this one.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adeezl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTYWG3M4MU6EAN737VGV56JKYRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DFZ5I5ALWIZ9?ASIN=B0CN8CZZJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Great pillow for the price paid - Well made, good amount of removable stuffing",
                "reviewText": "This is a really cool and well made pillow, which you can easily adjust to your liking. You can remove the padding to your hearts desire to get the perfect fit for your sleeping needs. I'm very impressed with the memory foam cooling effects you get from prolonged usage over time. It's stuffed rather well, so you get to take out what you don't need. I'm not sure where you put the extra foam, perhaps in a large storage bag?Overall, it's a very well made pillow with a ton of uses and effects. You get to choose how soft/firm you would like it to be, and it seems to be really well made. The stitching itself is excellent, and everything seems to work well. I'm impressed, well made and well done guys. Thanks!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Betsy Bargain",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIV5XZIKTF3JAG2JK3UYST4RCYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M9Y4X42VM5LF?ASIN=B0CN8CZZJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Customizable Support",
                "reviewText": "I got this pillow for my husband. The first night he tried the pillow, he thought it was not quite firm enough. Adding the extra shredded memory foam (included), helped. The pillow is firmer and more supportive now, and he says it gave him a comfortable night's sleep. The cover is very breathable, and does seem to have a cooling effect. The inner cover can easily be unzipped to add more foam, and the outer cover can easily be unzipped for washing. I think this pillow is a good value, and would recommend it if you are looking for a comfortable pillow which can be customized to your preference.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana Z",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEN6LIQ724AM7LSDGS2HIK3CACFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ABOMDO06B48D?ASIN=B0CN8CZZJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Pillow fill can be adjusted to your specific requirements for ultimate comfort",
                "reviewText": "This quality pillow has several different features. The out cover is made from a soft and cool bamboo fabric. You don't have to use an additional pillow protector because you can take the bamboo cover off for washing. Inside the cover is a zippered cloth pillow filled with finely cut memory foam. You can take out foam or put more in depending on the firmness and height you require. I like a softer pillow so I removed about 1/3 of the foam. Then I shook the pillow to distribute the foam evenly inside the cover. What a wonderful pillow this is. My head sinks down on the pillow and my neck is still supported. It is so comfortable. It uses high quality foam and it really makes a difference. I will definitely be ordering some more.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicholas R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFX5LNDYVPTDUY42PV6LGJ2Z37Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6G3UGYH51B23?ASIN=B0CN8CZZJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars I am very impressed",
                "reviewText": "So this is now my main pillow now and forever. I am a stomach sleeper and all these pillows are filled to no end with stuffing. This one is no different but you can remove the fill!!! I took out half of the fill and it is my favorite pillow ever. I can't explain how perfect this is. It's cool, its comfortable, its perfect. 10/10 will buy more",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Belinda PoplinBelinda Poplin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4GVC7JJSXFJOVN34UJJPXPHVVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AF5F3E9MPG8R?ASIN=B0CN8CZZJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Best pillow I've had in a long time",
                "reviewText": "Wow! I didn't think I would like a pillow made out of a bunch of cut up memory foam, but I was so wrong about that. This is truly the most comfortable pillow I've had, maybe ever. It's nice that it's customizable, with extra filler if you like a fuller pillow. Honestly, it comes with plenty! If you don't like it so full then take some out. It comes in a zippered cover, then that cover has a zippered cover. It came vacuum sealed, and I just put in the dryer a couple minutes and * Viola *, likely the most comfy pillow your head has been on in awhile! Highly recommend 👌",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81DPGZ2biQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81mCP9J7WcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "That guy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVTZUUVMLWCTBDHRMANZ3ZNLVKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K70LN4FNM4H0?ASIN=B0CN8CZZJR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Comfortable",
                "reviewText": "I know comfort is subjective but here is my experience. I currently sleep with about 5 different pillows because I like to stay in a somewhat included position. This pillow is heavy, if you are one who likes to flip a pillow and move it all around this isn’t for you. If you like a nice firm pillow that won’t go flat in a few days this is for you. I have used this pillow for a week now and really enjoy it. I would recommend it to anyone who doesn’t mind the heaviness of the pillow.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}