{
    "remaining_requests": 37691,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Little-Ones-Pillow-Handcrafted-Supportive/dp/B00PWKC32G",
    "body": {
        "name": "Little One's Pillow - Toddler Pillow, Delicate Organic Cotton Shell, Handcrafted in USA - Soft Yet Supportive Pillows for Kids, Machine Washable 13 X 18",
        "price": "$23.95$23.95",
        "originalPrice": "$29.99",
        "rawPrice": 23.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Little-Ones-Pillow-Handcrafted-Supportive/dp/B00PWKC32G",
        "soldBy": {
            "sellerID": "AQMSOB54PZSH3",
            "name": "Little One's Pad",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AQMSOB54PZSH3&asin=B00PWKC32G&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41PoqJONcNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/519EtstNHUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HpxMg3PbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yvq7QfnHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XJVA9qZpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LwTDz9-4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QW68ya2EL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1FhL-LOPVL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1FhL-LOPVL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Little One's Pillow Store",
            "link": "https://www.amazon.com/stores/Little+One%27s+Pillow/page/DDE07BBB-9EDB-4A2A-9B4F-E8B88821ACCA?ref_=ast_bln"
        },
        "brand": "Little One's Pillow",
        "merchantInfo": "Little One's Pad",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 4015,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 15 hrs 11 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 5 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "OEKO-TEX STANDARD 100 requires textiles-based products to be tested against a list of 1,000+ chemicals, to limit those which may be harmful to human health. Certification focus: #ProductSafety and #ChemicalsUsed."
        },
        "features": [
            "Lovingly hand-crafted in the USA by our family owned company.",
            "Super soft 100% certified organic cotton shell - proprietary cluster fiber filling that is squishy, supportive and ensures the pillow washes extremely well.",
            "Designed with top chiropractors and pediatricians - we put so much effort, love and care into making each little pillow, and you can instantly tell that by our product's exquisite craftsmanship and it's unparalleled level of comfort.",
            "Meticulously tested and individually inspected for quality - our toddler pillows are perfectly balanced between thin and fluffy and provide the best neck support for your little one.",
            "Tailor made for your little one - if the pillow is not a perfect fit for your toddler, we stand by to customize the amount of filling, all free of charge! We treat every customer like family."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Nursery",
                "link": "https://www.amazon.com/baby-nursery-bedding-cribs-furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=695338011"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/baby-bedding-cribs-bassinet-blankets/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166742011"
            },
            {
                "name": "Toddler Bedding",
                "link": "https://www.amazon.com/toddler-bedding-sheets-sets/b/ref=dp_bc_aui_C_4?ie=UTF8&node=302884011"
            },
            {
                "name": "Pillows",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17874226011"
            }
        ],
        "productInformation": [
            {
                "name": "Fill Material",
                "value": "Unique Cluster Fiber"
            },
            {
                "name": "Pillow Type",
                "value": "Throw Pillow"
            },
            {
                "name": "Color",
                "value": "Natural"
            },
            {
                "name": "Size",
                "value": "1 Count (Pack of 1)"
            },
            {
                "name": "Brand",
                "value": "Little One's Pillow"
            },
            {
                "name": "Shape",
                "value": "‎Rectangular"
            },
            {
                "name": "Special Feature",
                "value": "‎Washable"
            },
            {
                "name": "Cover Material",
                "value": "‎Certified Organic Cotton"
            },
            {
                "name": "Pattern",
                "value": "‎Solid"
            },
            {
                "name": "Age Range (Description)",
                "value": "‎Toddler"
            },
            {
                "name": "Number of Items",
                "value": "‎1"
            },
            {
                "name": "Product Dimensions",
                "value": "‎18\"L x 13\"W"
            },
            {
                "name": "Product Care Instructions",
                "value": "‎Machine wash on gentle setting using cold/warm water. Do not use hot water. Tumble dry using low or no heat. Do not use high heat."
            },
            {
                "name": "Style",
                "value": "‎Modern"
            },
            {
                "name": "Item Firmness Description",
                "value": "‎Medium"
            },
            {
                "name": "Theme",
                "value": "‎Love"
            },
            {
                "name": "Thread Count",
                "value": "‎300"
            },
            {
                "name": "Item Weight",
                "value": "‎8 ounces"
            },
            {
                "name": "Model Name",
                "value": "‎Little One's Pillow-01"
            },
            {
                "name": "Unit Count",
                "value": "‎1 Count"
            },
            {
                "name": "Fabric Type",
                "value": "‎Certified Organic Cotton Shell, Unique Cluster Fiber Filling"
            },
            {
                "name": "Item Thickness",
                "value": "‎18 Inches"
            },
            {
                "name": "Country of Origin",
                "value": "‎USA"
            },
            {
                "name": "Item model number",
                "value": "‎Little One's Pillow-01"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B00PWKC32G"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 4,015 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,420 in Baby (See Top 100 in Baby) #20 in Toddler Pillows #63 in Nursery Pillows"
            },
            {
                "name": "Date First Available",
                "value": "November 20, 2014"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The coziness, warmth and comfort of this pillow will make your little one feel safe, relaxed, and right at home. They will want to take it everywhere with them and will look forward to having a restful sleep or nap. We spent hundreds of hours testing pillows with real kids (different sizes, different materials, various filling amounts). And we talked extensively with parents, grandparents, pediatricians, chiropractors and with the kids themselves. The result of our hard work is a pillow that is just right. A pillow that adjusts to your child’s sleeping habits and complements them perfectly. Little One’s Pillow.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/3c8967d7-f7a0-4b39-a81e-2da7f2e5f545.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Little One's Pillow - Look No Further A great pillow makes a world of difference in a toddler's sleep quality, general well-being and healthy development. Over the years our pillow has greatly improved the sleep and bedtime routines of tens of thousands of toddlers around the world. It is time for your little one to experience the ultimate comfort that comes only from a product tailor made for them, well-researched and hand-crafted with great love. Measuring 13 inches X 18 inches the pillow may seem tiny at first. But it's just in a toddler's size, perfect to keep their little head, neck and shoulders in a correct, healthy and comfortable position while sleeping. This small size offers a much more relaxed and personalized sleeping experience compared to larger pillows. The filling amount is just as important as the pillow size. No matter if your little one is a tummy, back or side sleeper, our pillow will adjust to their individual sleeping style. The filling is soft and designed to easily compress according to use. We also use little filling. As parents we thought that a full and really fluffy pillow is best, but after a lot of tests and working closely with specialists and with the kids themselves, we found that a pillow on the flatter side is the way to go. A flatter pillow is the most comfortable for toddlers, and it also helps them sleep in a healthy posture and makes the transition to a regular pillow an easy, safe and fun experience.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/AQMSOB54PZSH3/B00PWKC32G/sWbMHfeBTDKN._UX300_TTW__.jpg"
                ]
            },
            {
                "media_text": "Highest Quality Materials & Unmatched Craftsmanship When we first started developing this little pillow we wanted to create a product that is soft but supportive, breathable and machine washable. And at the same time we wanted the pillow to be safe and as organic as possible. It was not easy, but we are very proud that we managed to achieve exactly that. The pillow's cover is made 100% out of premium organic cotton. To make the cover resistant and keep any impurities out, we use a high thread-count and a special tight weave. This also makes the cover soft to the touch and eliminates the need for a pillowcase. Light and soft, the filling is a proprietary cluster fiber. The filling is not 100% organic because it is man-made, but it is unlike anything on the market. We go to great lengths to develop our poly cluster fiber 'in-house'. This means the filling is made entirely in the USA and more importantly, it gives us great control over every part of the manufacturing process. We develop our fiber very differently than the rest of the industry -both in terms of design and in terms of materials used in manufacturing it. We do not treat the fiber with anything. Our fiber is Latex free, Phthalate free, Formaldehyde free, BPA free and Lead free. And we don’t use any flame retardants either. But why didn't we choose something 100% organic for the filling? Well, we did a lot of tests with various organic and non-organic filling materials. We tested kapok, wool, cotton, hemp, buckwheat, down, foam and many others. Those filling materials were not comfortable, not good for a child's healthy development (neck and spine) due to the firmness and shape or they became useless after a few uses (lost shape, became lumpy, could not be machine washed -or cleaned in any way for some of them). Our one of a kind cluster fiber filling, makes this pillow soft but long-lasting, with an average lifetime of 3 to 5 years. It will keep it's shape and it will not get lumpy, even after hundreds of wash/dry cycles! With our Little One's Pillow we managed to create a product of unmatched craftsmanship. The supportive, premium polyester fiber, is covered in the finest organic cotton around, all handcrafted together with great attention to detail. Washing Instructions: wash on cold, gentle cycle, and dry thoroughly on low.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/9be60929-9a1d-41a0-9fc2-929ad0e280de.__UX300_V1___.jpg"
                ]
            },
            {
                "media_text": "The Perfect Fit For Your Little One The pillow is ergonomically designed. Your little one will be able to sleep comfortably in almost any position. This being said, every toddler is unique. If your little one doesn't like the pillow for any reason, we are here to help. We can provide tips & tricks on all the stages a toddler goes through when adjusting to a pillow and if needed, we can even customize the amount of filling. We will do our best to ensure our pillow is a perfect fit for your little one.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/f4a6c7ff-4572-4235-9017-c1e38c74bd25.__CR98,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "And So Much More... A Low Loft Plushy Pillow As adults, we may perceive the pillow as flat, but for a toddler this amount of filling is perfect. A pillow is a big step for any toddler and one that is too fluffy can cause all sorts of problems like neck kinks, restlessness or even unhealthy spine development. With the help of chiropractors and pediatricians we found just the right amount of filling needed for a toddler. Our pillow is on the flatter side, but it strikes a balance between flat and fluffy. Your little one will be so comfortable! Our Filling is Different Unlike most pillows, our cluster fiber filling is designed not to get lumpy. Instead of a continuous fiber filament, we use thousands of tiny fiber balls that rearrange constantly depending on the use of the pillow. This being said, because we use little filling to help toddlers sleep in a healthy posture, in some rare cases, the filling has a tendency to bunch up or shift from side to side. Usually giving the pillow a good shake or a wash will fix the problem. And if that doesn't work, we stand by our pillow even a full year after your purchase with a regular replacement or a custom fill replacement, no questions asked. The Finest Organic Cotton The pillow's shell is made 100% out of the finest organic cotton. Pure and natural, our organic cotton is completely different from regular cotton. There are over 35 harmful substances applied repeatedly to regular cotton (from the seeding stages to the final production stages). For the organic cotton, we use none of them. Not a single one. Made With Love and Care We strive to be very transparent when it comes to the manufacturing process and all the materials used in our pillows. Proudly made in USA, we support other local small businesses by sourcing our raw materials from them. We are putting an incredible amount of love, care, dedication and personalized attention to detail into each and every pillow and this is easily reflected in our product's superior comfort and in how we treat all of our customers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/8efcb3df-5cda-4d5b-af61-1e3988349186.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/c7340c07-4d8c-4ac2-8c05-1faf705d345c.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/bf8f9c66-2af5-4733-ad55-9c8931016e0b.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/19dfdb8f-e482-405c-8678-39b6837fb435.__CR0,0,300,300_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/52f10aa4-b430-40e7-b28c-9374d78afda3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/3c8967d7-f7a0-4b39-a81e-2da7f2e5f545.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/38986de8-9f93-433a-bdc3-c77f8cd44e35.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/AQMSOB54PZSH3/B00PWKC32G/sWbMHfeBTDKN._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9be60929-9a1d-41a0-9fc2-929ad0e280de.__UX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/f4a6c7ff-4572-4235-9017-c1e38c74bd25.__CR98,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/8efcb3df-5cda-4d5b-af61-1e3988349186.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/c7340c07-4d8c-4ac2-8c05-1faf705d345c.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/bf8f9c66-2af5-4733-ad55-9c8931016e0b.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/19dfdb8f-e482-405c-8678-39b6837fb435.__CR0,0,300,300_PT0_SX220_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stefany",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYBUHE2POCDJSIFAG4YTODASCXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R303PR3X6IPF09?ASIN=B00PWKC32G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2014",
                "reviewTitle": "5.0 out of 5 stars Give this little pillow a try, you won't regret it!",
                "reviewText": "After a lot of looking around, I decided to give this toddler pillow a try and buy it, even though I had second thoughts because of the low review count. I'm so glad I did that! To say I am impressed with this pillow and company would be a huge understatement.The pillow is a little smaller than I thought it would be, but it is just right for my little boy (3 and a half years old) and he takes it everywhere with him (we even had to take it grocery shopping believe it or not). We also bought a second pillow for our 15 month old daughter...it seems a little high/fluffy for her right now, but she will definitely love it in a few months.And come to think of it, before I bought this pillow we had trouble putting our son to sleep...now he actually looks forward to taking his daily naps and I notice he yawns less and has more energy, which makes me think he has sleeps better since this pillow.The price is a real bargain for what you get, very soft to the touch cotton, breathable fabric, strong stitching and no fill lumps. And made in USA! I want the very best for my kids and this is it!The customer service is OUTSTANDING! They go the extra mile every time and they made me feel like a real valued customer. I usually don't write reviews, but I took the time to write this one because it feels so refreshing to find such a fantastic product backed by stellar customer service.Oh, and a little tip for everyone, since this pillow comes without a pillowcase, you can use a standard sized pillowcase and tuck it into itself. It's what we do and works great every time!",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "neBenoist",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI6O23Y3WKR67BL3P2T364ZVTVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RBJPTDLBGTWS?ASIN=B00PWKC32G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2015",
                "reviewTitle": "5.0 out of 5 stars THIS is an AWESOME little pillow!",
                "reviewText": "The fabric is pretty soft, perfect for letting your head or arms sink right in. I've come across other organic shells that have felt stiff or a little scratchy. This one is very inviting; no need for a cover if you don't want one.The pillow isn't densely packed, which is perfect for my uses, but it's super lofty and cushy. I purchased for my 2-yr old, but am now considering getting one for myself to hug when sleeping on my side. (I would hug my husband, but a pillow doesn't move or snore). My 2-yr old wasn't impressed upon introduction, but he's been sleeping without any pillow so far, and usually bunches up a small blanket underneath his chest and tummy. And then sleeps with his rear in the air. So I'm not sure yet how he'll end up using it. He did put his head on it a couple times, but then tossed it on the floor. I also asked my 5-yr old to try it. He said it was too small for him, especially since he's been using standard pillows for a couple of years (I never found a good toddler pillow for him when he was younger). I WISH that I had found this pillow back then, as I really do love this little pillow. If after a couple of months my toddler doesn't start using the pillow, he'll never see it again, because it will be mine. Ha ha ha! (...she grins with an evil laugh)Good customer service, especially in making sure that you wash properly (gentle, warm or cold, and low/med dry setting), and how to use a standard pillow case to cover it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lieva",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTC37R6CB7FXMGA5ZIMWYGN64PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQIDQPAOENXYH?ASIN=B00PWKC32G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2015",
                "reviewTitle": "5.0 out of 5 stars Toddler-approved huggable pillow",
                "reviewText": "LIKES:Organic cotton cover—very softFilling is not lumpy after washingHigh quality stitching and materialsGreat company with high customer satisfactionDISLIKES:Pillow is too soft for a toddlerSmall sizeNo pillowcase---The cover on this pillow is very soft and comfortable to lie on, so much so that I haven’t gotten a pillowcase for it. I will eventually get one as my 2-year-old tends to sweat in her sleep, and I would rather not wash the entire pillow too often in order to prolong its life.The first pillow we received was a little too soft for my daughter, who was used to a standard-sized firm pillow. While she liked the fact that it was her size, it took some getting used to the smaller size and fluffiness of the pillow.The owner of the company sent personal follow-up emails, one of which was to ensure my satisfaction with their product. The owner was more than happy to send a customized pillow—a firmer one—for my daughter. When the second pillow arrived, the firmness was perfect, but it was a little too high. It is starting to compress a little, and my daughter IS now using the pillow every day, though she does roll off of it every single night. She does find the pillow and plop back on it, so I don’t think it really bothers her. She also moves a lot in her sleep, and I noticed that she sleeps well on the pillow in any sleeping position (when she stays on)—back, side, stomach. Sometimes, she’ll just hug the pillow instead of lying on it.For the excellent customer care from the company, the high quality of the pillow, and the price point, I am very glad I bought this pillow out of all the organic toddler pillow options out there!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 12, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "My almost 3 year old absolutely loves this pillow.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randy PaulinoRandy Paulino",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on September 22, 2020",
                "reviewTitle": "Happy baby, happy mommy",
                "reviewText": "Didn't expect that the pilow is small but good enough for my toddler. She used it last night and I noticed that her sleep was not interrupted a lot unlike using other pillow. Delivery was fast too",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pdA8KJDzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnnAnn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 14, 2018",
                "reviewTitle": "One Star",
                "reviewText": "I do not recommend this product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71LeZM+EvkL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}