{
    "remaining_requests": 37737,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pillows-Feather-Pillow-DesignDesign-Pilliow/dp/B0CJCBNT3M",
    "body": {
        "name": "Pillows King Size Set of 2, Feather Down Pillow with Soft Fabric, Goose Down Pillows, Blue Edge Piping DesignDesign Bed Pilliow (Blue Piping, King)",
        "price": "$54.99",
        "originalPrice": "",
        "rawPrice": 54.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pillows-Feather-Pillow-DesignDesign-Pilliow/dp/B0CJCBNT3M",
        "soldBy": {
            "sellerID": "A2EZZ7MV8FWH26",
            "name": "Bafode",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2EZZ7MV8FWH26&asin=B0CJCBNT3M&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTC91WP9"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CJCBNT3M",
                "variationName": "Color",
                "variationValue": "Blue Piping",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31Hlyp42+IL._SS36_.jpg"
            },
            {
                "asin": "B0CJR1FSY7",
                "variationName": "Color",
                "variationValue": "Brown Piping",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/318R-L5rBgL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 15% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Hlyp42 IL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41llAIAfN0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zhv cd8mL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EiyWNAJ2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41v27B2QPRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51x zBTygYL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bafode Store",
            "link": "https://www.amazon.com/stores/Bafode/page/82E021E0-8B71-4A00-B501-958EB75120FF?ref_=ast_bln"
        },
        "brand": "Bafode",
        "merchantInfo": "Bafode",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 50,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Feather and Down Pillow: This bed pillows are composed of 95% goose feathers and 5% goose down, delivering you a layer of maximum comfort and softness for a blissful night’s sleep.",
            "Blue Edge Piping: Manufactured with a fabrication process that includes a double-layer fabric method and blue dyed cloth piping, these pillows are paired with the beautiful diamond lattice quilted finish.",
            "Quality Guarantee: feather down pillows are ethically sourced materials and has passed STANDARD 100 by OEKO-TEX Certified, making it an eco-friendly and sustainable choice.The down pillow is designed to provide a hotel-quality sleep, making it a great addition to any bedroom.",
            "Care Insturction: Machine washable separately on a gentle cycle in cold water. Tumble dry the down goose feather pillows on low until thoroughly dry. Use a pillowcase, or a breathable cover to ensure the integrity of the material quality of the nice feather pillow.",
            "Bed Pillows for Sleeping 2 Pack: Queen size: 20\"x 30 in. Fill weight is 39oz.Standard Size: 20\" x 26\". Fill weight is 32oz. King Size:20\" x 36\".Fill weight is 47oz"
        ],
        "description": "Pillows Queen Size Set of 2, Feather Down Pillow with Soft Fabric, Goose Down Pillows, Blue Edge Piping Design Bed Pilliow",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/bedding/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063252"
            },
            {
                "name": "Bed Pillows & Positioners",
                "link": "https://www.amazon.com/bed-pillows-positioners/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1199122"
            },
            {
                "name": "Bed Pillows",
                "link": "https://www.amazon.com/bed-pillows/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10671043011"
            }
        ],
        "productInformation": [
            {
                "name": "Fill Material",
                "value": "Goose Down"
            },
            {
                "name": "Pillow Type",
                "value": "Bed Pillow"
            },
            {
                "name": "Color",
                "value": "Blue Piping"
            },
            {
                "name": "Size",
                "value": "King"
            },
            {
                "name": "Brand",
                "value": "Bafode"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Special Feature",
                "value": "Washable"
            },
            {
                "name": "Cover Material",
                "value": "Polyester"
            },
            {
                "name": "Pattern",
                "value": "Plain"
            },
            {
                "name": "Number of Items",
                "value": "2"
            },
            {
                "name": "Product Dimensions",
                "value": "36\"L x 20\"W"
            },
            {
                "name": "Product Care Instructions",
                "value": "Machine Wash"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Item Firmness Description",
                "value": "Plush"
            },
            {
                "name": "Model Name",
                "value": "Bed Pillow Piping"
            },
            {
                "name": "Unit Count",
                "value": "2.0 Count"
            },
            {
                "name": "Fabric Type",
                "value": "Polyester"
            },
            {
                "name": "Item Weight",
                "value": "8.2 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Bafode"
            },
            {
                "name": "ASIN",
                "value": "B0CJCBNT3M"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "DP81053"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 50 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#184,092 in Home & Kitchen (See Top 100 in Home & Kitchen) #549 in Bed Pillows"
            },
            {
                "name": "Date First Available",
                "value": "September 19, 2023"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Suzanne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY5K6G2TYJSRVE5E6NVUFDFYFZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RAJ0ZCE3CDGC?ASIN=B0CJCBNT3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Plump, fluffy goose down pillows are extremely comfortable.",
                "reviewText": "I ordered this set of two Pillows Queen Size Set of 2 Goose Down Pillows from Bafode because it was time to replace some of my more elderly down pillows.I have major spine issues—I’ve broken my neck twice, I have degenerative disc disease and spinal stenosis and have several fusions. I know what I need to get comfortable enough to sleep at night. It’s a complex pile of pillows that allow me to recline into them at the correct angle, supported by other, smaller pillows for my hips, knees, and the small of my back. (It sounds complicated—and is—but I want to sleep next to my husband, not sitting in the recliner.)My husband and I joke about our “bunk bed”— we sleep in a regular queen size, but I’m way up on my pillow stack and he’s flat on the mattress with a single memory foam pillow.I’ve tried memory foam. I’ve tried so many kinds of pillows, and for me, a good down pillow just does the trick. I have a heavier support pillow at the back of the stack, but the best are down. And I love these Bafode goose down pillows.When the box came, I was surprised. It seemed too small for two queen sized down pillows. They were rolled up tightly and wrapped in plastic. After I unwrapped them, I fluffed them up. I thought about fluffing them in the dryer, but just gave them a second good fluff, and they plumped up beautifully.The pillows are a soft white fabric with a great, smooth hand feel. I don’t know if they are cotton or bamboo, but they have that high thread count feeling. The white pillows have blue piping around the edges. They measure 20\"x 30”.These pillows remind me of the high-end pillows in a really great luxury hotel room. They are firm enough to give excellent support, but the down inside is soft and fluffy. As part of my pillow stack, they are extremely comfortable for sleeping.These pillows seem to have the exact right balance between fluffiness you can sort of mold and the support you need. They really are incredibly well made. I’ve lost track of how many different types of pillows I’ve tried through the years, but definitely enough for me to know that these pillows stand out from the crowd. When I settled back against them, there was a moment like… oh, yeah. That’s better.Plump, fluffy goose down pillows bring high-end hotel comfort to your bedroom.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Craig Raper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFE66ALSJD5BRXF763RBZASPRAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CV6MTT0UEI6I?ASIN=B0CJCBNT3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars very comfy",
                "reviewText": "I have never been a fan of down pillows. The ones I have used usually ended up flat with all the down ending up around my head and providing no support. A lot of folks would fold them over to address that issue.When I gave these pillows time to air out and fill out a bit, I was very surprised. They were packed well enough so that they actually maintained their thickness. There is no way to open these up, short of ripping out some sewing, but I am not aware of any filler inside the pillow. It was a snug fit to get these inside the queen size pillow cases. I've been using one now for a few nights and am very pleased.If I lay on my back, then my head ends up around the middle of the pillow. I get comfortable support there. When I lay on my side, I also get comfortable support, but that is a bit different. I use a cpap face mask and if it rests on the pillow, the pressure from that will usually push it just a bit out of position. That means I have to keep the face mask off the pillow. This being a down pillow, I can push the corner of the pillow in (and it will stay like that) so I get good support for my head, and the mask does not rest on the pillow.I'm a new fan of down pillows. These are very comfortable and work well for me. The label says the contents are 95% grey goose feathers and 5% grey goose down. I do not feel any feathers poking at me at all. Pick yourself up a couple of these.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angeleyeslinda ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLJ7Z54CJUZ65J3WU422PR72J3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AP14WECPLT6M?ASIN=B0CJCBNT3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Feathery Soft Down Pillows",
                "reviewText": "As someone who values a good night's sleep, I'm quite picky when it comes to pillows. I decided to give these goose down pillows a try to provide some extra fluff and support. I'm thrilled to report they have taken my sleep comfort to a whole new level!As soon as I rested my head on these pillows, I sunk into feather-soft coziness. The 95% goose feather and 5% goose down filling creates just the right amount of cushiony loft to cradle your head without being too high.Not only do they excel in comfort, but these down pillows seem very well-made. The double layer fabric and hidden zipper closure keep the fill securely inside. I appreciate that the materials used are OEKO-TEX certified, which I appreciate.Since getting these pillows, I find myself eagerly crawling into bed, excited for a night of sublime rest. The support hits just the right spot, and waking up each morning feels more refreshing.If you want to give your bed an elevated level of comfort, I can't recommend these feather down pillows enough. The fluffy feel is perfect for dreamy, blissful nights! My search for the ideal pillow is finally over.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Go Gators!",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIZP5EMILWTU64PJCC7HUWVFZKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30M81Y4Q82ZI9?ASIN=B0CJCBNT3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Fluffy Comfy Pillows",
                "reviewText": "Super Comfy Fluffy Pillows! My lower back had been hurting pretty badly and I was thinking it was time to get a new bed even though we just got one less than a couple of years ago. When I starting using these pillows my lower back pain significantly decreased. The Pillows are fluffy but not too hard. Your head sinks in a bit but it is still plump. This isn't too soft and is almost on the firm side even but not stiff. I would recommend giving this pillow a try is you also are experiencing lower back pain and see if it helps before replacing your bed. Who knew a pillow could help so much.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. YoungM. Young",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD2544OVQ34KRX366R7JBJBNOMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39P4IZATJZLE9?ASIN=B0CJCBNT3M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "4.0 out of 5 stars Give it time to fluff, good support",
                "reviewText": "I got 2 queen pillows. They arrived rolled and sealed in plastic. After removing the package, I let the pillows air out and fluff up for a couple of days. I've used these for a week now and really like them. They provide good support sleeping either on my back or on my side. There is enough fill that they do not go completely flat. The feathers also don't poke out of the quilted cover to stab you. The quilted material is soft. The \"height\" of the pillows are just right...not too high or too low/flat. I've used these for a week now and I would recommend them for anyone looking for a feathered pillow and doesn't want alot of \"height\".",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717GCHCf4vL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Odg63vz8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Glen & Christy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH57FCKQMS5K3VP3WY6PZR5RTYGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TDJ7ZMD19TCK?ASIN=B0CJCBNT3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars I missed the type of pillow.",
                "reviewText": "when i was a kid my got my first pillow that had down in it. after fluffing and putting a case on it i put my head on it in bed and went right to sleep. well i had the same thing happen with this one. I am so glad i got this pillow and know i will have and have had many nights of great sleep.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}