{
    "remaining_requests": 37942,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pillows-Sleeping-Adjustable-Shredded-Hypoallergenic/dp/B07TMKXZQT",
    "body": {
        "name": "Cooling Bed Pillows for Sleeping 2 Pack Shredded Memory Foam Adjustable Cool BAMBOO Pillow for Side Back Stomach Sleepers -Luxury Gel Queen Size Set of 2 with Washable Removable Cover",
        "price": "$39.99",
        "originalPrice": "$58.99",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pillows-Sleeping-Adjustable-Shredded-Hypoallergenic/dp/B07TMKXZQT",
        "soldBy": {
            "sellerID": "A11H763TGARJQ1",
            "name": "Super Modern",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A11H763TGARJQ1&asin=B07TMKXZQT&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B8SK8FB7"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BW8WNY7Y",
                "variationName": "Size",
                "variationValue": "Standard (1 Count)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B56S5PYC",
                "variationName": "Size",
                "variationValue": "Standard Size (Pack of 2)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07QKH9ZCP",
                "variationName": "Size",
                "variationValue": "Queen (1 Count)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07TMKXZQT",
                "variationName": "Size",
                "variationValue": "Queen (2 Count)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B46D66T3",
                "variationName": "Size",
                "variationValue": "Queen（Pack of 2 )-No Cooling",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B56QPWRJ",
                "variationName": "Size",
                "variationValue": "King Size (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09VPNF8QJ",
                "variationName": "Size",
                "variationValue": "King (2 Count)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B091HZK59T",
                "variationName": "Size",
                "variationValue": "Toddler(1 Count)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0C5R86SWD",
                "variationName": "Size",
                "variationValue": "Travel (1 Count)",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41XfpiLjKgS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51nCIOKi kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AGjfDp03L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NDTBu5MuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CfYIKOi5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XLeTquR3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/918X65 MuIL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SUPA MODERN Store",
            "link": "https://www.amazon.com/stores/SUPAMODERN/page/B99F8538-C05F-4D67-AF2D-5137D4188F75?ref_=ast_bln"
        },
        "brand": "SUPAMODERN",
        "merchantInfo": "Super Modern",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 13309,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 14 hrs 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "OEKO-TEX STANDARD 100 requires textiles-based products to be tested against a list of 1,000+ chemicals, to limit those which may be harmful to human health. Certification focus: #ProductSafety and #ChemicalsUsed."
        },
        "features": [
            "[ FLUFFY ADJUSTABLE HEIGHT FOR YOUR COMFORT ] SUPA MODERN is a fast growing US brand who is engaged in designing & producing best bed pillows for sleeping. We have 3 core shredded memory foam pillow design patents. This gel pillow can be adjusted freely by yourself, providing personalized support to your head, neck and shoulders, relieving pain and enhancing your sleep. There is a zipper on the side of bed pillow. You can open it and remove fillings through it.",
            "[ LUXURY COOLING BAMBOO PILLOW ] The premium bamboo material enables your queen sleeping pillow to be ultra soft. Sleeping on this cooling bed pillow, just like sleeping on the cloud. So soft, so comfortable. Natural bamboo white. The bamboo cover is removable and machine washable in cold water. Easy to use, Easy to care. SAFE FOR YOU AND YOUR LOVED ONES.",
            "[ BEST GEL BED PILLOW FOR SLEEPING--RELIEVING PAIN ] Gel infused memory foam pillow. A wonderful balance between firm and soft. Supportive as well as comfortable sleeping bed pillow. Best queen size sleeping pillow for you to relieve your pain of head, neck ,shoulder and body. NEVER BE FLAT!",
            "[ 3D BREATHFUL DESIGN--ENHANCING YOUR SLEEPING QUALITY ] There are hundreds of 3D small parts on the bamboo pillow case, which can smartly divide the force from your head and neck to many different directions and to hundred parts. So the sleeping pillows can fit your body curve perfectly and providing you with the most comfortable support. Your head, neck and body will be in a right line. Then, Your breath will be more smooth and your sleeping quality will be 19.8% to 59.54% improved.",
            "[ PERFECT GIFTS TO FRIENDS AND FAMILIES ] PERFECT Christmas gift, birthday gift, Mother's Day gift, Father's Day gift to friends and families. Improving sleeping quality, you should choose professional adjustable pillow. We will help you to gain better sleep and best service. BEST ADJUSTABLE BAMBOO SHREDDED MEMORY FOAM PILLOWS FOR YOU AND YOUR FAMILIES!",
            "[ GREAT FOR ALL SLEEPING STYLES ] Our cooling gel pillows, no odor. You can enjoy the luxury experience of a five-star hotel at home every night, whether you're a side sleeper, or back sleeper, and even stomach sleeper. The bed pillow queen size has an adjustable loft, and you can add or remove filled foam according to your sleep style. The bamboo pillows for sleeping will give you a great support to eliminate your neck and shoulder pain. The most comfortable and cooling pillow!",
            "[ NEVER GO FLAT ] Our adjustable pillows for neck pain are compressed packaged, and when you open the package, please pat them fully to restore shape and wait 24 hours before using bamboo pillows for sleeping. High-quality shredded memory foam filling with good resilience, our cooling memory foam pillows will never go flat. You can also put them fluffy in the dryer over time.",
            "[ LIFETIME REPLACEMENT POLICY ]Your satisfaction is our main goal! SUPA MODERN offers quality products and services! If you are not 100% satisfied with your purchase, please do not hesitate to let us know immediately. We will provide you with the best solution!",
            "[Tips and knowledge of cooling pillows] [Tips and knowledge of cooling pillows] As we all know that there is no fiber of which soft or firm cooling pillows can stay cool feeling forever. Why? Because All fabric will be affected by the temperature of its surroundings. However, we can make the cooling feeling longer by correct methods. We can use the cooling Pillow With the Air Conditioner Or an Fan for a Better Sleep Experience"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/bedding/b?ie=UTF8&node=1063252"
            },
            {
                "name": "Bed Pillows & Positioners",
                "link": "https://www.amazon.com/bed-pillows-positioners/b?ie=UTF8&node=1199122"
            },
            {
                "name": "Bed Pillows",
                "link": "https://www.amazon.com/bed-pillows/b?ie=UTF8&node=10671043011"
            }
        ],
        "productInformation": [
            {
                "name": "Pillow Type",
                "value": "Bed Pillow"
            },
            {
                "name": "Special Feature",
                "value": "Machine Washable Cover, Cooling, Removable Cover,Neck Support"
            },
            {
                "name": "Closure Type",
                "value": "Zipper"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Indoor"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Memory foam"
            },
            {
                "name": "Item Firmness Description",
                "value": "Plush"
            },
            {
                "name": "Water Resistance Level",
                "value": "Not Water Resistant"
            },
            {
                "name": "Size",
                "value": "Queen (2 Count)"
            },
            {
                "name": "Product Dimensions",
                "value": "30\"L x 20\"W"
            },
            {
                "name": "Unit Count",
                "value": "2 Count"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Pattern",
                "value": "Geometric"
            },
            {
                "name": "Style",
                "value": "Queen Size (Pack of 2)"
            },
            {
                "name": "Theme",
                "value": "Modern"
            },
            {
                "name": "Occasion",
                "value": "Christmas, Mother's, Father's Day, Birthday"
            },
            {
                "name": "Seasons",
                "value": "All-Season"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 13,309 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#365 in Home & Kitchen (See Top 100 in Home & Kitchen) #5 in Bed Pillows"
            },
            {
                "name": "Brand",
                "value": "SUPA MODERN"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult,Teen"
            },
            {
                "name": "Number of Items",
                "value": "2"
            },
            {
                "name": "Fill Material",
                "value": "Memory Foam"
            },
            {
                "name": "Cover Material",
                "value": "Bamboo"
            },
            {
                "name": "Product Care Instructions",
                "value": "The Inner Gel Memory Foam is not washable, Bamboo Machine Wash Pillow Cover"
            },
            {
                "name": "Fabric Type",
                "value": "Pillow Cover: 3d Cooling Fiber & Bamboo (One Side Cooling, One Side Bamboo), Inner Filling:premium Gel Shredded Memory Foam & Fiber, 🥇2023 Can't Miss Christmas Gifts! Best Quality Pillows!, 🥇 2023 Most Popular Gifts Choice!, 🥇 2023 Best Fathers Day Gift on Amazon"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "OUR MEMORY FOAM PILLOWS CAN IMPOROVE YOUR SLEEP QUALITY AND HELP YOU HAVE A NICE SLEEP COOLING , ULTRAL SOFT, SUPPORTIVE, BRATHABLE MEMORY FOAM PILLOW WITH PREMIUM INNER FILLING 90% premium polyurethane - Foam \"with memory\" ,Reduce the pressure points to conform and adjust to the shape of your body when you move during the night, so they give good support to your neck.10% Premium feather ----It is one of the most comfortable fillings because it provides a good balance between firmness and softness and adapts well to the contour of the bodyHigh-tech Gel infused-----It is the firmer type of filler. As it adapts well to the contour of the body, it provides good support to the neck and back.Before your first use, remember to pat and squeeze the pillow to expand to its shape and put the pillow in dryer for 5 to 10 minutes to speed up the fluff process right out of package. This will get your shredded memory foam pillow to its best shape and normal fluffy.005",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08a82eae-081d-4f04-ad49-3f32ef1ad96f.__CR0,1,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "ADJUSTABLE HEIGHT PILLOW- UP TO YOU You can add or remove the inside filler to find the most comfortable level for you Get away from too high or too low. You can make a pillow which if perfect for you. SCIENTIFIC DESIGN-RELIEF DISCOMFORT,REDUCE PRESSURE Design based on human body engineering Well fit your neck curve and support your head, neck and shoulder Reduce neck, cervical discomfort Help you to have a nice deep sleep",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/390fa0b4-2e54-4ce2-9b93-17a18d73d624.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "ONE SIDE is CLOUDY COMFORTABLE BAMBOO SURFACE & the OTHER SIDE is COOLING SURFACE UNIQUE COOLING SURFACE SIDE DESIGN will GIVE YOU COOLING FEELING ALL NIGHT. You can touch the cooling as soon as you sleeping on it. Perfect cooling bed pillows for sleeping, expecially for hot sleepers. WONDERFUL GIFTS FOR PARENTS, OURSELVES, FRIENDS, PREGNANCY WOMEN, TRAVEL enthusiast. TIPS:We suggest that you use our cooling pillow with an air conditioner or a fan to ensure the best effect of lasting cooling.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3e5bf78c-51d9-4ff1-b48e-655db095ee6c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "ADJUSTABLE INNER GEL MEMORY FOAM FILLING Our shredded memory foam filling has been injected into a cooling gel, which is designed to keep you cool all night.There are 2 smooth zipper on the outside memory foam pillow cover. So you can open the zipper and add or remove the filling as you need. So convenient. Don't need to worry about your 2 pack queen pillows are too high or too low anymore. Because You can make a pillow unique perfectly fit for yourself. NEVER BE FLAT BED PILLOWS Please give it a period of time for bounce back the first time you receive it. You can tap and squeeze the pillow to help the pillows back to shape.It is thick and firm, and won’t flatten as you shift throughout the night.The 2 pack queen memory foam pillows for sleepers will never be flat. After several months use. Please kindlly Pat or place in the dryer for three minutes to return to shape MACHINE WASHABLE OUTSIDE PILLOW COVER There are zippers on the cover, you can take off it easily. Very easy care.The outside bed pillows cover is machine washable (machine wash cold and liquid detergents if needed; DO NOT use bleach). The inner pillow cover and inner filling are not washable.We sincerely advice you to purchase 4 pack. Many customers gain 4-6 pack for exchange. And many send them to friends and families as gifts.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee93edb1-cc8c-411c-8b02-775decea7f8f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b17cfbb3-fc26-44ce-a028-f53af82fe9b4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cd5b9d4b-dd77-4a08-8303-2af2c15359f9.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "PERFECT SLEEPING PILLOWS FOR ALL SLEEPERS PREMIUM BAMBOO COVER- ULTRA-SOFT, SO COMFORTABLE3D technology bamboo fiber breathable pillow case provides you with a SOFT COMFORATBLE sleeping environment.The bamboo cover will help you to feel cooling when you sleep.bamboo cover machine washable-easy to carePERFECT ADJUSTABLE MEMORY FOAM BAMBOO PILLOW FOR SIDE, BACK, STOMACH SLEEPERS. Please kindly note that all bamboo products have bamboo odour which is not harmful to human body. It's easy to solve this problem. 1. Separate outer pillowcase from the inner pillow and use machine wash cold and liquid detergents if needed; DO NOT use bleach. 2. Resting the inner case/pillow under open areas to release the smell. 3. And/or Open your window and lean that pillow against the window screen, changing sides periodicall",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/80bc321a-9292-4956-bc45-5a12dcd55efb.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Memory Foam Filling for Pillows &Sofa & Pet Beg Side Sleeper Pillow For Sleeping Premium Bamboo Pillows 2 Pack Premium Bamboo Pillows 1 Pack Cooling Body PIllow For Comfort Sleeping Perfect for All kinds of bean bag chairs, bed pillows, pet bed Back, side, stomach sleepers Back, side, stomach sleepers Back, side, stomach sleepers Back, side, stomach sleepers Cooling Cover ✓ ✓ ✓ Adjustable Pillow ✓ ✓ Fill Type Shredded Memory Foam Shredded Memory Foam Shredded Memory Foam Shredded Memory Foam Shredded Memory Foam Cover Machine Washable ✓ ✓ ✓ ✓ ✓ Certifications OEKO-TEX STANDARD 100 OEKO-TEX STANDARD 100 OEKO-TEX STANDARD 100 OEKO-TEX STANDARD 100 OEKO-TEX STANDARD 100",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08a82eae-081d-4f04-ad49-3f32ef1ad96f.__CR0,1,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/390fa0b4-2e54-4ce2-9b93-17a18d73d624.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3e5bf78c-51d9-4ff1-b48e-655db095ee6c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee93edb1-cc8c-411c-8b02-775decea7f8f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b17cfbb3-fc26-44ce-a028-f53af82fe9b4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cd5b9d4b-dd77-4a08-8303-2af2c15359f9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/80bc321a-9292-4956-bc45-5a12dcd55efb.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07f639fc-376b-43c2-8a54-cb4cf79322f4.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1cac4df6-9cf2-4b6f-83b2-60c8a7e4b001.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/20865c30-84c9-4a4c-b866-d19e158c0448.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/feaf20f3-bd4e-4b4b-b323-9cba39f5ca10.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/451672d2-309b-49ca-afe2-00715b1eb516.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d756271e-af3c-4686-bf91-d4b62214262a.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dreamer9x",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGDA27U6DC3O42SAMOODLRKILAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU1V54K2R7J6M?ASIN=B07TMKXZQT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Transformative Comfort and Cooling for a Restful Night’s Sleep",
                "reviewText": "Finding the perfect pillow is akin to discovering a sleep sanctuary; with the Cooling Bed Pillows for Sleeping, I believe my quest has come to a luxurious end. These pillows, boasting shredded memory foam, adjustable filling, and innovative cooling technology, promised a solution to my sleep challenges. Here's my comprehensive assessment after several weeks of use:Comfort and Support:The shredded memory foam offers a plush yet supportive feel that adapts to the contours of your head and neck, providing optimal support regardless of your sleeping position. The adjustability of the filling is a game-changer, allowing me to customize the pillow’s loft to my preferred comfort level – a boon for a side sleeper like me.Cooling Technology:The bamboo cover, combined with the gel-infused memory foam, works effectively to dissipate heat, maintaining a cool and comfortable sleeping surface throughout the night. This technology has significantly improved my sleep quality, reducing night sweats and discomfort.Material Quality and Durability:The quality of materials used in these pillows is evident from the moment you touch them. The bamboo cover is not only soft and breathable but also hypoallergenic, making it suitable for sensitive skin. After weeks of use and a couple of washes, the pillows have retained their shape and firmness, attesting to their durability and the quality of the memory foam used.Ease of Maintenance:The washable and removable bamboo cover makes maintaining these pillows a breeze. Being able to clean the cover regularly helps in keeping the pillows fresh and hygienic, a must-have feature for anyone prioritizing cleanliness in their sleep environment.Pros:Customizable support with adjustable shredded memory foam filling.Effective cooling technology for a comfortable sleep, even in warm climates.High-quality, durable materials that retain shape and support over time.Hypoallergenic bamboo cover, ideal for sensitive skin, with easy maintenance.Cons:Adjusting the filling to find the perfect loft may require some trial and error.Final Thoughts:The Cooling Bed Pillows for Sleeping are a remarkable blend of comfort, support, and innovative cooling technology. Their adjustability and quality construction address a wide range of sleep preferences and needs, making them a versatile choice for side, back, and stomach sleepers alike.Recommendation:For those in search of a cooling, supportive, and customizable sleeping experience, these pillows are an excellent investment. Whether you're dealing with night sweats, seeking neck support, or simply in pursuit of a luxurious night’s sleep, this set of two king-size pillows offers a transformative impact on sleep quality.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPDMCXQF7QSKPZIIM333FFBQW3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QNIRHQP7SX?ASIN=B07TMKXZQT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Bet Pillow Ever",
                "reviewText": "I have tried every type of pillow, these pillows top them all. They are the most comfortable pillow ever. They put Mr. Pillow pillows to shame! They plump up, they are exactly what is advertised, cooling & supportive! They price is amazing. I recommend these pillows if your looking for quality, comfort, support & good sleeping!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Braydon D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXLBWHEHZ2GHRXKPMNDIQIEK5IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQUJ2JXFZU9VK?ASIN=B07TMKXZQT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Pretty nice and fluffy",
                "reviewText": "Bought these to replace my old pillows as they became extremely flat.As others have said, there is a smell to them. Per the instructions, I put them in the dryer for a little while after I first got them. That seemed to help a little and the smell went away after a couple days.They come extremely full of the foam material inside. I had to remove about half of the stuffing for them to be comfortable, but I like that they include all the extra and removing/adding the material is very easy.They are very fluffy and comfortable. They get nice and cool very quickly.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heather Shaw",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGS2GJVZ5LYIUIF44KDBZ6EA5BPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EXXWMPK87CF9?ASIN=B07TMKXZQT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Worth Every Penny - Great Pillows for Hot Sleepers",
                "reviewText": "Hey there, pillow seekers! So, I recently stumbled upon these magical wonders called Cooling Bed Pillows, and let me just say, they've been a game-changer for my sleep game.First things first, they're like a little slice of heaven for your noggin. You know that feeling when you flip your pillow to the cold side? Well, imagine that, but on a whole new level. These bad boys are surprisingly very cool to the touch, and it's like they've got some built-in air conditioning just for your head. No more sweaty nights or wrestling with the sheets – just pure, cool bliss.But that's not even the best part. Brace yourself for the ultimate pillow power move – you can adjust the firmness! Yeah, you heard me right. It's like a choose-your-own-adventure for your head and neck. Soft, firm, somewhere in between – you're the boss of your own comfort. I personally love sinking into a fluffy cloud after a long day, but if you're into a firmer support, these pillows have got your back, literally.The material they're made from feels like a hug from a cloud, and I swear I've been sleeping better than ever. It's like upgrading from economy class to first class for your nightly adventures in dreamland.Now, I don't know about you, but I'm pretty picky when it comes to my pillows. I mean, they're practically a VIP guest in your bed, right? These Cooling Bed Pillows have earned their spot in my exclusive pillow hall of fame. If you're on the fence about investing in a couple, do yourself a favor and take the plunge. Your head will thank you, and you'll wonder how you ever slept without them. Cheers to cool dreams and even cooler pillows!",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOTVCFFXZNXOONH5F4PIFXWAS5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15L8SLK0HEDDB?ASIN=B07TMKXZQT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing Quality",
                "reviewText": "We have had a couple down pillows that I really like but they are getting old and new ones are crazy expensive. We also have the cheap foam ones that I hate and you are lucky if you get 3 months out of them. I ordered a set of these during prime after going through all the different pillows available. These pillows are awesome. We have had them for about a month and they are just as good as the day we got them. You can adjust the amount of filling but we liked them how they came. The cover for them is great. It's thick and has a soft side and a cool side. And the cool side actually stays cool. We just ordered another set for our daughter for Christmas. I would absolutely recommend these pillows.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SuperPlasmaman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIYZBBLIAZHZKTHELY7JD5M5QUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FHKUK309FZ7M?ASIN=B07TMKXZQT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Great pillows",
                "reviewText": "Great pillows , very comfy, and cool to sleep on. Great bargain for the money too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rey719",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG734ECMFLEHKRSW6JLF6G2DYACA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23YC7JM3KBKOU?ASIN=B07TMKXZQT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Very impressed",
                "reviewText": "I’m normally not a fan of buying pillow online since I like to feel them in person or at the store. The pillow is made of shredded memory foam. This pillow is soft but will still hold its shape and won’t go flat on you. One side has a cooling pad and the other is just regular material. My previous pillow was a down feather stuffing and I had it for years and was hesitant to replace it. After getting this new pillow that old was was out the window.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tony Mckenna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2024",
                "reviewTitle": "Very comfortable",
                "reviewText": "Easily adjustable and no strong or irritating odor. Has a bamboo material on one side and a cooling material on the other side for your choice.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandra Estrada",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 25, 2020",
                "reviewTitle": "No recupero su forma",
                "reviewText": "Llevo solo unos días usándola y ya se ve apachurrada. Mala compra",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aria Rasti",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 5, 2022",
                "reviewTitle": "looks good but doesnt feel good enough after a while",
                "reviewText": "My main problem is that those covers get warm very fast as soon as your face touches them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nai",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 28, 2021",
                "reviewTitle": "The best pillow I've had... So I ordered more for a present",
                "reviewText": "Having researched a fair bit for the perfect pillow, I'm glad I did because this has given me the best nights sleep in a fair few years. I suffer with Crohn's and been in flare for a long time. I can't remember the last nights undisturbed sleep I had but since getting this pillow the health of my sleep is vast improving and an added benefit is my neck pains are easing a lot.I love that you can reduce the firmness and fullness of the pillow by taking some memory foam out, to get the perfect ratio for you. The added feature of the cool and warm side is perfect for when I have them night sweats and tropical moments from meds. It is a feature I never knew I needed.It is the kind of pillow you would take everywhere with you for them weekends away. So go so that I bought another a few days later for a present. A VERY GOOD INVESTMENT",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philippe J.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 20, 2024",
                "reviewTitle": "Firm pillow lovers only",
                "reviewText": "This pillow is well made and the cooling technology really does work. When you first unwrap it, the pillow looks as flat as a pizza box. After 24 hours, it expands to full size. It is well-stuffed and quite high. Unfortunately, it is simply too firm for me. Even if you take out some of the stuffing, it doesn’t change how firm the memory foam is overall. The spot where your head rests does soften a little, but if you turn your head to the side, it is like bringing your head out of a hole and onto a rock.If you love a firm pillow, this might be for you. If you sleep in one position and never move your head, this might be for you. Too firm for me.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}