{
    "remaining_requests": 37909,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BLISSBURY-Stomach-Sleeping-Washable-Accessories/dp/B07VP5HFTN",
    "body": {
        "name": "BLISSBURY 2.6 Inch Ultra Thin Pillow for Sleeping | Premium Memory Foam Flat Pillow for Stomach Sleeper | for Back & Stomach Sleeper | Certified Foam for Neck and Back Support | Removable Bamboo Case",
        "price": "$39.99",
        "originalPrice": "",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BLISSBURY-Stomach-Sleeping-Washable-Accessories/dp/B07VP5HFTN",
        "soldBy": {
            "sellerID": "A4SKCNSVF1UPP",
            "name": "Northern Rivers",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A4SKCNSVF1UPP&asin=B07VP5HFTN&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09HR8FLXC"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CG2N4723",
                "variationName": "Color",
                "variationValue": "Cooling",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41UsE40s2uL._SS36_.jpg"
            },
            {
                "asin": "B07VP5HFTN",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41F1LTYwCuL._SS36_.jpg"
            },
            {
                "asin": "B07VQ896NC",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31AH-fu3JBL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41nsom3YsAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41xYUWNs9fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UZUlqZXIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zVh7Jp3IL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZXP6FxbxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JnrGvtiBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HyTVDfnpL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BLISSBURY Store",
            "link": "https://www.amazon.com/stores/Blissbury/page/12C0E646-F397-42D8-9A40-F3E131976EB3?ref_=ast_bln"
        },
        "brand": "Blissbury",
        "merchantInfo": "Northern Rivers",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 6049,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "OEKO-TEX STANDARD 100 requires textiles-based products to be tested against a list of 1,000+ chemicals, to limit those which may be harmful to human health. Certification focus: #ProductSafety and #ChemicalsUsed."
        },
        "features": [
            "Certipur-us Memory Foam",
            "SUPPORT FOR LOWER BACK AND NECK: The BLISSBURY Stomach Sleeping Memory Foam Pillow is specially designed for stomach and back sleepers. It reduces strain on your back and neck for new levels of comfort.",
            "COMFORTABLE AND RESTFUL SLEEP: Sleep safe and sound with BLISSBURY! Our pillow is made out of premium CertiPUR-US memory foam, which is free from dangerous chemicals and harmful flame retardants.",
            "SOFT, COOLING FOAM: Our memory foam is gel-infused and uses ventilation holes. It helps keep you cool and comfortable. Our flat pillow also stabilizes your head gently, which can help with snoring.",
            "SOFTLY-TEXTURED PILLOWCASE: It comes with a double weave pillowcase that “wicks away” moisture. Made from Rayon naturally derived from bamboo (65%) and polyester (35%). It’s available in white or gray so it can easily match any set of bed sheets in your home.",
            "WITH SPECIAL COVER AND CARRY BAG: It also comes with a handy carry case so you can roll it up and keep it clean. You can also easily take it with you when staying at a hotel or traveling!"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/bedding/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063252"
            },
            {
                "name": "Bed Pillows & Positioners",
                "link": "https://www.amazon.com/bed-pillows-positioners/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1199122"
            },
            {
                "name": "Bed Pillows",
                "link": "https://www.amazon.com/bed-pillows/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10671043011"
            }
        ],
        "productInformation": [
            {
                "name": "Pillow Type",
                "value": "Bed Pillow"
            },
            {
                "name": "Special Feature",
                "value": "Cooling, Low Profile, Ventilated, Slim, Thin"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Sleeping"
            },
            {
                "name": "Item Firmness Description",
                "value": "Medium"
            },
            {
                "name": "Fill Material",
                "value": "Gel Memory Foam"
            },
            {
                "name": "Cover Material",
                "value": "Polyester, Bamboo"
            },
            {
                "name": "Care instructions",
                "value": "If using a washing machine use a protective mesh laundry bag., Wash cover only (not foam) in cold water with like colors. Hang to dry."
            },
            {
                "name": "Material Feature",
                "value": "Breathable"
            },
            {
                "name": "Fabric Type",
                "value": "Certipur-us Memory Foam"
            },
            {
                "name": "Color",
                "value": "Gray"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 6,049 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,560 in Home & Kitchen (See Top 100 in Home & Kitchen) #93 in Bed Pillows"
            },
            {
                "name": "Brand",
                "value": "BLISSBURY"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Model Name",
                "value": "Stomach Sleeping Pillow - Grey"
            },
            {
                "name": "Size",
                "value": "2.6\"H (Standard)"
            },
            {
                "name": "Product Dimensions",
                "value": "26\"L x 16\"W"
            },
            {
                "name": "Item Weight",
                "value": "1.7 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Thickness",
                "value": "2.6 Inches"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "King Size (Stomach Sleeper) Ear Hole Pillows (Side Sleeper) Contour Pillow (Side Sleeper) Water Pillow (Adjustable Filling) Height 2.6 Inch 4 or 5 inch 3.2 to 5 inch Fully Adjustable Material Memory Foam Memory Foam Memory Foam Fiber Fill CertiPUR-US Certified Foam ✓ ✓ ✓ N/A Ideal Sleep Position Stomach or Back Side or Back Side or Back Side or Back",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/04b15173-5e21-4cc5-901b-922818a0ff63.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7973bba7-5c8b-43ef-b4c3-86fd8e4620ea.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0b3f0e60-bcb2-4bac-9706-19689073ca49.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4dd42a18-eec4-4cc3-b735-21dea55b4432.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1f6fcd38-4e1b-431d-a3ff-d5b7bdb4fa1e.__CR0,0,971,601_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/79c868d2-d74d-405b-98b7-6eeb7fea70f7.__CR1000,0,1000,2000_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/819c1bcb-f07a-445a-8e98-e9feddb078bd.__CR232,0,1500,3000_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5bb0b650-0c1c-4ea8-93c9-f24f374ce7db.__CR120,0,1200,2400_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5d179331-79fe-46fb-9ed0-b9a0f01bfe83.__CR863,0,675,1350_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Donna J. Campbell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGBJBUVI56W3YTPIQYCXLQZDJRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NS9D88FW9NDE?ASIN=B07VP5HFTN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Love this pillow",
                "reviewText": "This pillow is awesome! I’ve spent hundreds of dollars on pillows over the years and ended up throwing them out. This pillow is thin like I’ve been looking for. I sleep on my stomach with my arm up so it’s kind of a smaller body pillow, which is perfect. It doesn’t bunch up and is nice and cool. It came “shrink wrapped” so I just laid it out for 24 hours and it filled out to a perfect king size. The pillow cover is washable and super high quality.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF5LZTFDJNCCWOMCWT4TMG2W5MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NG04YBV03JJ2?ASIN=B07VP5HFTN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Back pain brought me here and problem solved",
                "reviewText": "Back and neck pain isn't anything new for me, I've experienced it for years and it has been getting worse. I bought the most expensive Sealys memory foam pillow for $200 and figured that had to help right? The quality was amazing but the height is 6.5 inches high so the placement of my neck from the bed while sleeping on my back gave me incredible neck pain that I had to go to the ER for. Once I figured out my mistake it brought me here.On the first night I was still in bad pain in my neck and overall my entire back from the last year of using that pillow, but laying down it immediately felt incredible. It was almost like a release of tension in my back and neck due to the height but the memory foam comfort is amazing. You might think thin would be a really slim piece of foam but it is very quality that doesn't run hot, as I'm someone who sweats a lot. After a week of use my back felt incredible, I have lower back pain daily for over 10 years and haven't felt it since. It might seem like it's hyperbole but after I did some research and asking doctors you would be surprised how much a bad mattress and/or pillow can mess up your alignment and back.The pillow case I absolutely love because it's bamboo and very light, it says it wicks moisture(different than waterproof for the heavy sweaters), but most importantly it's soft and comfortable. The issue I think I'll have right away is I didn't notice that they sell extra pillow cases, and one isn't going to be enough for me, or anyone who sweats. The pillowcase starts to lightly stain up if you have anything in your hair like grease or sweat, and it seems you have to wash it a lot sooner than usual. And since you have to air dry this and not rush the drying process I definitely need a second.All in all, I had another slim pillow in my cart that was cheaper, but decided my body was too important to go the cheap route. I'm glad I spent the money on this. I can't speak for everyone but if you're suffering from any sort of consistent back pain and you've been using a pillow either too tall or with no structure I would highly recommend this.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stacey C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHEXWW2LFXFL2R7Y7X43BEBEEXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IZR28N9BGVKW?ASIN=B07VP5HFTN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Can I Trust this Pillow to Replace My Admittedly Old, Gross but Comfy One? Well, Yes, Yes I Can!",
                "reviewText": "I am a creature of habit, and when I really love something, it’s hard for me to part with it even if it’s in tatters… Welcome to my pillow nightmares! I’ve known for a while that my pillow needed to be replaced as it’s been horribly pilling, the fabric is almost worn down and washing it for the zillionth time was going to be its last straw, but, oh, how perfect it felt! It really dawned on me that a replacement was a must when we spent a few days at our friend’s home and they had an assortment of pillows in their guesthouse to choose from - I THOUGHT I loved the Purple Pillow the best, so I ordered four of those for our home while we were there, but alas, those threw my spine all out of whack… I pawned them all off to my husband and son to use, and it luckily turns out that they actually work for them - I’ve come to the conclusion that I’m much smaller than they are, so the Purple was too high for me even at its lowest height and since I’m also a side sleeper, my head was raised too high - it was hard to fall asleep and when I awoke, my neck and back hurt. Anyway, I tried a few other highly regarded brands, and NOTHING fit the bill. See, my pillow is so flat and precisely molded to how I sleep, that I was convinced that nothing out of the package was going to mimic what took years and many washes to recreate… Then I saw an ad on Instagram for flat pillows, which I had no idea existed. I have that one on order, but in the meantime, I thought I’d jump on Amazon to see what their selection of flat pillows was like so I can get one earlier, maybe even love it, but at least be able to compare (we have an obscene collection of pillows at this point, so why not add more?!) it to the one that is on order. Long story longer, I purchased this pillow and another one off of Amazon called, EliteRest, and that one feels like a little thicker and harder version of my Lululemon yoga mat, so that’s a big nope, so I tried this Blissbury last night… I have to admit I had little hope in it when I first unfurled it from its bag as one of the sides was crushed, kinda like my heart at that point, but I worked it out with my hands and let it lay on a flat surface for 24 hours - I did, however, listen to advice in these reviews to NOT fluff it in the dryer like they suggest, which I’m SO glad I did! Come bedtime, I had it all ready to go, but my old pillow was on standby, as it’s been with every pillow trial, but this time, I did not grab it to switch it out overnight (if I feel an ounce of pain, I stop using pillows right away now, instead of torturing myself to “try to get used to it” for a few nights.) Anyway, I’m actually okay with the Blissbury because it’s the perfect height (dare I say better than my old one?!) and just soft enough, but better yet, it does conform a bit to your head and arm (if like me, you slide your arm underneath your pillow to cradle your head) which I did not think was a possibility until many, many uses and washes. It is heavier than my old pillow, but that’s really more of something that I won’t even notice, soon, but other than that, it actually exceeds my trusty, well-serving pillow, and I’m happy to say that I LOVE it! I’m going to purchase a few more, and leave one to solely pack for our many trips as hotel pillows are my very own personal hell - at least I now won’t have to worry if they will have a flatter one or have to suffer the ones that make me feel like I’m suffocating. If you are wondering if I’ll hold onto my old, faithful pillow, the answer is yes, but I doubt I’ll have to use it again… Bottom line is, especially if you are petite, a side sleeper and/or just prefer a flat pillow, this is the one - after probably over a thousand dollars later, and many night of lost sleep, I found this inexpensive one that checks all the boxes wonderfully. A good night’s sleep is priceless, so the journey was worth every cent, but let me help you to not have to go through all of that by just advising you to purchase this one! I’ve done all the work for ya! Enjoy, and have a good night again with the aid of a Blissbury!",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kalli",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB6PKWQHG6G5OT3V3V4L2JEWOPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3POPWXRV8T6E8?ASIN=B07VP5HFTN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "4.0 out of 5 stars the pillow is very well made but I sent it back",
                "reviewText": "it is a great product if your looking for a thin pillow i thought i was looking for a thin pillow turns out I was not the pillow I was using was thin and old so I thought i needed a thin new pillow i had horrible neck pain after using and i needed a thicker pillow so i sent it back but it is a very nice pillow and very well made if you know you want a thin pillow try it",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 31, 2024",
                "reviewTitle": "Great customer service",
                "reviewText": "I had an issue with my original order and Blissbury customer service helped out and rectified my issue. They were nothing but pleasant to deal with and I can not express my gratitude. My pillow is fantastic and has helped with my lower back pain (I am a belly sleeper). I would highly recommend this company to anyone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Guillermina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 19, 2023",
                "reviewTitle": "Excelente Almohada",
                "reviewText": "Me gustó mucho, es delgada y muy suave, descanso mucho mejor desde que la uso. Estoy muy contenta, yo que toda la vida he dormido boca abajo, está almohada es de lo mejor.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erika Garavito",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 7, 2022",
                "reviewTitle": "Perfecta",
                "reviewText": "Una almohada fresca y súper cómoda. Muy delgadaPerfecta para dormir",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VaniMo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 23, 2022",
                "reviewTitle": "Finally the pillow that works",
                "reviewText": "I went through a number of pillows that didn't work, I sleep funny on my side with my arm under my head so needed something thin but supportive for my neck. The pillow is comfy and does the trick.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Browne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 7, 2023",
                "reviewTitle": "Great for stomach sleepers, good for back sleepers",
                "reviewText": "Quite slim and flat. Excellent for stomach sleepers due to it's low profile. Pretty large footprint. Comfy cover. Would love it if it were 10$ cheaper.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}