{
    "remaining_requests": 37670,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LAYR-Adjustable-Firmness-Loft-Pillow/dp/B09R5352NS",
    "body": {
        "name": "LUXOME LAYR Adjustable Firmness & Loft Pillow (2 Pack) - Completely Customizable - Memory Foam - Cooling Cover - King",
        "price": "$245.00",
        "originalPrice": "",
        "rawPrice": 245.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LAYR-Adjustable-Firmness-Loft-Pillow/dp/B09R5352NS",
        "soldBy": {
            "sellerID": "A1MC5U5WKDV7WZ",
            "name": "LUXOME",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1MC5U5WKDV7WZ&asin=B09R5352NS&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08F6GPQGK"
        ],
        "asinVariationValues": [
            {
                "asin": "B09885MHC8",
                "variationName": "Size",
                "variationValue": "Standard (Pack of 2)",
                "price": "$200.00",
                "variationImageURL": ""
            },
            {
                "asin": "B08F697NCT",
                "variationName": "Size",
                "variationValue": "Queen (Pack of 1)",
                "price": "$140.00",
                "variationImageURL": ""
            },
            {
                "asin": "B09R51R6J6",
                "variationName": "Size",
                "variationValue": "King (Pack of 1)",
                "price": "$170.00",
                "variationImageURL": ""
            },
            {
                "asin": "B09R5352NS",
                "variationName": "Size",
                "variationValue": "King (Pack of 2)",
                "price": "$245.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51TXW eSRIL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51XH9Q4pDmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518OMrAoXML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SH6w1oblL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410Ktcav9ZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UYfGosc9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91Uu85oitgL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the LUXOME Store",
            "link": "https://www.amazon.com/stores/LUXOME/page/B5125CAA-4AC9-491E-99DC-A7E1FECEA6AE?ref_=ast_bln"
        },
        "brand": "LUXOME",
        "merchantInfo": "LUXOME",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 232,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "OEKO-TEX STANDARD 100 requires textiles-based products to be tested against a list of 1,000+ chemicals, to limit those which may be harmful to human health. Certification focus: #ProductSafety and #ChemicalsUsed."
        },
        "features": [
            "ADJUSTABLE INSERTS (2-PACK): The 2-pack comes with one FIRM insert (one 1\" piece and one 2\" piece) of solid gel-infused memory foam for sharing, two MEDIUM inserts with a mix of gel-infused shredded memory foam and down alternative, and two SOFT inserts with 100% ultra-plush down alternative.",
            "COMPLETELY CUSTOMIZABLE: Our patent-pending LAYR pillow is the world’s first FULLY customizable pillow. Customize both the firmness & loft of your pillow to your exact specifications using our unique, adjustable inserts. Find your ideal configuration, then adjust each insert independently by adding or removing fill to fine-tune and find YOUR perfect pillow.",
            "CertiPUR-US MEMORY FOAM: All of our memory foam is CertiPUR-US, which is the highest standard of memory foam in the US and is certified to be low VOC and free of many harmful substances. We don’t use low quality shredded memory foam scraps like other pillows, only purpose-built CertiPUR-US memory foam. We also air out our memory foam and rotate it daily for five days prior to packaging to reduce any initial odor.",
            "COOLING TECHNOLOGY: We built LAYR to be cool from the ground up. The cover is made from a cooling viscose from bamboo blend that was heat-tested vs. several other fabrics. The gel-infused memory foam helps cycle heat quicker which then passes through our 100% cotton insert covers and out through the cooling cover. No need to flip your pillow!",
            "USA COMPANY & SATISFACTION GUARANTEE: We are a midwestern company that LOVES our customers and prides itself on values, quality, and service. Designed & tested in the USA, imported."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/bedding/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063252"
            },
            {
                "name": "Bed Pillows & Positioners",
                "link": "https://www.amazon.com/bed-pillows-positioners/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1199122"
            },
            {
                "name": "Bed Pillows",
                "link": "https://www.amazon.com/bed-pillows/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10671043011"
            }
        ],
        "productInformation": [
            {
                "name": "Pillow Type",
                "value": "Bed Pillow"
            },
            {
                "name": "Special Feature",
                "value": "Cooling"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Cooling"
            },
            {
                "name": "Item Firmness Description",
                "value": "Medium, Firm, and/or Soft"
            },
            {
                "name": "Fill Material",
                "value": "Down Alternative, Memory Foam"
            },
            {
                "name": "Cover Material",
                "value": "bamboo viscose"
            },
            {
                "name": "Product Care Instructions",
                "value": "Machine Wash"
            },
            {
                "name": "Fabric Type",
                "value": "Solid Memory Foam, Shredded Memory Foam, Down Alternative"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Theme",
                "value": "Love"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 232 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#74,187 in Home & Kitchen (See Top 100 in Home & Kitchen) #317 in Bed Pillows"
            },
            {
                "name": "Brand",
                "value": "LUXOME"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Number of Items",
                "value": "2"
            },
            {
                "name": "Size",
                "value": "King (Pack of 2)"
            },
            {
                "name": "Product Dimensions",
                "value": "34\"L x 17\"W"
            },
            {
                "name": "Item Weight",
                "value": "24 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "2 Count"
            },
            {
                "name": "Item Thickness",
                "value": "11 Inches"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36ccb47c-6d6b-413f-bd47-cd602926c398.__CR0,0,2020,1249_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fc2f6ec7-5db7-41e6-a548-eab61f3cf19e.__CR0,0,2020,1249_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/25f4a22c-57df-40da-8066-600207507a86.__CR0,0,2020,1249_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64bf6ca9-9f14-4e0a-9c64-c5f3a454e753.__CR0,0,2020,1249_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/affd0b4c-2ce1-432a-a5f1-fb196b41a3d1.__CR0,0,2020,1249_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d06d4c17-52ad-4689-8e77-7475762aae1f.__CR0,0,2020,1249_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Demesa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCFLM75UM5A5V76AEE6EW5DZVSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMSFSUGNWFDOY?ASIN=B09R5352NS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars A wonderful customizable pillow",
                "reviewText": "I’ve been on the search for the perfect pillow to replace the elusive & famous Coconut Bliss pillow sold by mattress firm many years ago. ( I know they sell one now but read it’s nowhere near the original). It’s THE perfect pillow for side sleepers and 6-8 years in, it’s still in great shape & continues to be my nightly go-to. I have the perfect pillow so why am I searching for a new one? The answer is purely out of fear of something happening to it. (and a little curiosity of current options)I’m so picky when it comes to bedding (pillows, sheets, blankets, mattress protectors, pads) I don’t want to find myself in a mad rush looking for an alternative.Suffice to say, bedding is VERY important to me. I’ve put in more hours than I’m willing to admit finding the perfect sleep space.I’m 5’8”, mainly side sleeper, who runs very hot. I appreciate good quality, good build, and transparency. (many times you do not know what a product is made of until you get it in your hands and read the little tag that everyone is so scared to rip off :)Although Amazon’s return policy best in its class, one is still required to repackage, & drive to a UPS or equivalent, and wait in lines. If Amazon could find a way to do all those steps for me, I’d never shop anywhere else. (I’m only half joking)What I like abt this pillow is the amt of customizations available. And those customizations are out of the box, as I understand it, if you reach out to them they will send more of whatever inserts you need to make the perfect pillow, which is commendable and differentiates them from many other competitors.I think this is the future of pillow manufacturing and they are a step ahead of the rest for this feature alone.Every body is different. Height, weight, neck to shoulder measurements, all play a factor. Sleep positions vary, body temps run vastly different, and mattress types matter when you’re looking for a pillow. There can never be a one size fits all pillow.This LUXOME LAYR pillow comes about as close as you can to a one-size-fits-all pillow without paying the exorbitant prices for the “Noble Pillow” which START at $350.If my budget allowed for it, I’d have kept this pillow. I still may buy it in the future because even though it wasn’t my “perfect” pillow, all of the inserts they offer could be used in other pillows to make yourself the perfect pillow.Each piece is high-quality. It has a cooling cover, a memory foam insert, A soft insert with a down alternative filling, a gel infused shredded memory foam insert, and two different inserts made of gel infused memory foam. You can tell they did not take any shortcuts & they take their pillows seriously. You can customize it to the firmness and height you need.And what I like the best is that they proudly show that dreaded little paper label on their Amazon listing. Of all the pillows I’ve looked at I don’t think I’ve seen a single other one do this. Talk about transparency! When I saw that, I knew this was going to be an incredible pillow.It’s also packaged very nicely and would make a wonderful gift.So while I didn’t end up keeping this pillow I still think about it and I am almost positive that I’m going to buy it in the future. All of those pillow inserts it came with could help bring life back to other pillows you have.One thing I’m not thrilled about is that it’s $40 more expensive than it was at the time of purchase but that could have been because of Black Friday sales. It’s every bit worth the money.Job well done LUXOME!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T Blackwell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUG4KFCHBDUMKQ4NV6EVDQLSNUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZUIQVS7J8A7H?ASIN=B09R5352NS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Costly up front, but it pays for itself on the back end",
                "reviewText": "THESE PILLOWS ARE ABSOLUTELY AMAZING!The customization & comfort are top notch in all aspects.My partner made fun of me for spending almost $200 on two pillows, but quickly changed his tune once they arrived.As we prefer different types of pillows (theirs soft & mine more firm), the ability to switch the inserts between them to make our individually perfect pillows was worth the price.We've had them almost two months now & the sleep quality has drastically increased since then.This was one of the best purchases made in 2023 for me, I'd easily buy it again for the spare room in our home.This would also make an excellent housewarming present!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKUSRX6VQXCGP2V2HHVL563BG6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMYPPXNXKO4MW?ASIN=B09R5352NS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 1, 2022",
                "reviewTitle": "5.0 out of 5 stars If you’ve been reading a lot of pillow reviews…read this one",
                "reviewText": "I went on a quest to find new pillows for our bed and I really did my research. He’s a stomach sleeper, I’m a side sleeper and there was a lot to take in as far as the different “best” pillows topping the various lists out there based on your sleep preferences. I really couldn’t nail the firmness/softness/loft questions without ordering the pillows because of course, I couldn’t feel them or try them. So I ordered several of the top pillows from those lists- Coop, Tempurpedic Cloud, Purple, Saybrook, etc… And then I also ordered these, which I actually didn’t see on any of the lists, and I ALMOST didn’t order them because of that. But I figured if I was going to be a lunatic and order this many pillows, wth, let’s just see what it’s about. They looked really nice and while having a smaller number of reviews, the reviews were mostly positive so I went for it. Well let’s just say I could have saved myself a whole lot of hassle with returns if I had just tried these first. They are AMAZING and the design is so smart. You get the best of all of the pillows I mentioned wrapped up in 1 single pillow. They are fully adjustable in every way. You receive an amazingly soft exterior pillow cover that is also a cooling material and then every kind of insert you could ever need. You actually receive 4 inserts, because you receive 2 gel memory foam inserts in 2 different thicknesses that can be combined into 1 cover if you want to - so you have a lot of flexibility on how firm you want the pillow. And then you receive 2 more inserts - 1 is the “soft” insert of thinner down alternative and the other is the “medium” insert of a gel/down alternative combo with medium thickness. So you have all of these thicknesses to play with to achieve the loft/height you need and also everything you need to achieve the perfect softness or firmness based on which inserts you choose AND what order you stack them in. PLUS, each insert unzips so you can take out any filling if you need to. It’s a brilliant design. My husband and I who sleep nothing alike could both find perfection in this pillow, but something I hadn’t even considered was how easy it was for each of us to perfect the layering, by simply flipping the pillow over and trying out a slightly firmer side or softer side and comparing without having to have all of these different pillows to try. Like I said, I really could have saved myself some trouble. So if you are on a pillow quest I would HIGHLY suggest starting with these pillows and if for some unknown reason you can’t find happiness in these pillows, then go on and try the others. The only thing I think these pillows lack is natural down, so if thats your preference then I could see where this pillow could fall short, but otherwise it’s a no brainer. All of the pillows I ordered had nice things about them, and I personally could have also been happy with the Saybrook as a side sleeper (I actually kept it for a guest room) but NONE of the pillows had it all going on like this one did. And you very well may end up with extra inserts that you can use to enhance other pillows for other members of your household or guests.",
                "reviewVotes": "63 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alyssa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCZEY5AYL7LNHWKPTK6UUZECCAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16WBRQD13DENZ?ASIN=B09R5352NS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Expensive but very comfortable for a side/back sleeper with back pain",
                "reviewText": "I have broad shoulders and mostly sleep on my side but also have the unfortunate privilige of turning on my back at some point in the night. To find a comfortable pillow that can accommodate both sleep positions has been nearly impossible. You need more height for side sleeping and less height for back sleeping or your neck/back will be a mess either way. This pillow is the closest I've come to something great but it's still pricey for layers of memory foam which is not a new concept but this pillow stays lofty unlike my favorite pillow feel of microfiber filled which flatted and lump up after some months of use.Time will tell how this pillow performs over a longer duration of usage and if it holds up but for now it's off to a very good start.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}