{
    "remaining_requests": 37759,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Little-Sleepy-Head-Toddler-Pillow/dp/B00KDKKD1I",
    "body": {
        "name": "Toddler Pillow 13\" x 18\" Soft Hypoallergenic - Best Pillow for Kids! Better Neck Support and Sleeping! Better Naps in Bed, a Crib, or at School! Makes Travel Comfier! (Toddler (1-Pack))",
        "price": "$19.95",
        "originalPrice": "$29.99",
        "rawPrice": 19.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Little-Sleepy-Head-Toddler-Pillow/dp/B00KDKKD1I",
        "soldBy": {
            "sellerID": "A1XQAY39M2KOL0",
            "name": "Little Sleepy Head",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1XQAY39M2KOL0&asin=B00KDKKD1I&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CDJZ6GR9"
        ],
        "asinVariationValues": [
            {
                "asin": "B00KDKKD1I",
                "variationName": "Size",
                "variationValue": "Toddler (1-Pack)",
                "price": "$19.95",
                "variationImageURL": ""
            },
            {
                "asin": "B0C63C5YJH",
                "variationName": "Size",
                "variationValue": "Toddler (2-Pack)",
                "price": "$34.95",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/416kETzReNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51BrV 6zYiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pqboSmWWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uvrF1 FyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ucmfwIEiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515bUbDQ0WL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KlJambNPL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Little Sleepy Head Store",
            "link": "https://www.amazon.com/stores/LittleSleepyHead/page/01A5949F-C6B3-42CB-B384-BDCC7ACCC654?ref_=ast_bln"
        },
        "brand": "LittleSleepyHead",
        "merchantInfo": "Little Sleepy Head",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 12015,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 20 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "OEKO-TEX STANDARD 100 requires textiles-based products to be tested against a list of 1,000+ chemicals, to limit those which may be harmful to human health. Certification focus: #ProductSafety and #ChemicalsUsed."
        },
        "features": [
            "This snugly, take-it-everywhere he or she goes pillow is THE perfect size and softness for your baby toddler! Our childrens pillows are just right for toddler beds too!",
            "100% Hypoallergenic - your toddler may not have allergies, but why take chances?",
            "Not too fluffy, not too flat! This pillow for kids holds it's shape over time and, of course, it is washable!",
            "Backed by our \"Love the Fluff\" or we will replace it Guarantee! Pillowcases sold separately!"
        ],
        "description": "Look no further for the best toddler pillow, this is the ONE! Our pillow is 13” X 18” and is recommended for children ages 2+. When you purchase from us today, you will see: Your Toddler Will Love Their Pillow! This amazing pillow is just the right size for your little one. It is so comfortable that they are going to want to sleep with it and take it with them everywhere they go! Just like their favorite blanket or stuffed “friend”, this snuggly pillow will become their new “must have.\" A Perfect fit! This pillow is just the right fill for their little necks, even though many toddlers sleep in all kinds of positions. Whether they sleep on it, next to it, holding it, over it, or some other way, the one thing we know is they are going to love it! Hypoallergenic and Washable! This pillow is 100% hypoallergenic, which means it won’t contribute to or cause allergies! Yes, this pillow is washable! Please wash on cold, gentle cycle, and dry on low. Fluff, if needed, and love again. Made in the USA It is pretty hard to find products made in the good ol’ USA these days. But ours is. Our pillows are made by people who live locally, and who care about each and every pillow they make. Quality You Can Trust The premium polyester cluster fiber fill is covered with a soft 100% cotton, 200 thread count fabric, and it is filled just enough to provide snuggly support for your sleepy head’s neck. Pillows conform with use so the more your toddler uses their pillow, the more it will be unique to their needs. Our Guarantee We are so sure that you and your little one are going to love their “Little Sleepy Head Pillow” that we are offering a 90-day, no questions asked, money back guarantee. We also offer a \"love the fluff\" guarantee!",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Nursery",
                "link": "https://www.amazon.com/baby-nursery-bedding-cribs-furniture/b?ie=UTF8&node=695338011"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/baby-bedding-cribs-bassinet-blankets/b?ie=UTF8&node=166742011"
            },
            {
                "name": "Toddler Bedding",
                "link": "https://www.amazon.com/toddler-bedding-sheets-sets/b?ie=UTF8&node=302884011"
            },
            {
                "name": "Pillows",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17874226011"
            }
        ],
        "productInformation": [
            {
                "name": "Pillow Type",
                "value": "Bed Pillow"
            },
            {
                "name": "Special Feature",
                "value": "Hypoallergenic,Washable"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Indoor"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Travelling"
            },
            {
                "name": "Item Firmness Description",
                "value": "Plush"
            },
            {
                "name": "Water Resistance Level",
                "value": "Not Water Resistant"
            },
            {
                "name": "Fill Material",
                "value": "Polyester"
            },
            {
                "name": "Cover Material",
                "value": "Cotton"
            },
            {
                "name": "Product Care Instructions",
                "value": "Machine Wash"
            },
            {
                "name": "Thread Count",
                "value": "200"
            },
            {
                "name": "Fabric Type",
                "value": "Hypoallergenic Cotton"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Pattern",
                "value": "White"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Theme",
                "value": "Love"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 12,015 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,025 in Baby (See Top 100 in Baby) #4 in Toddler Pillows"
            },
            {
                "name": "Brand",
                "value": "Little Sleepy Head"
            },
            {
                "name": "Age Range (Description)",
                "value": "2 to 4 years"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Size",
                "value": "Toddler (1-Pack)"
            },
            {
                "name": "Product Dimensions",
                "value": "18\"L x 13\"W"
            },
            {
                "name": "Item Weight",
                "value": "6 Ounces"
            },
            {
                "name": "Unit Count",
                "value": "1 Count"
            },
            {
                "name": "Item Thickness",
                "value": "4 Inches"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "YOUR TODDLER WILL LOVE THEIR PILLOW! Look no further for the best toddler pillow, this is the ONE! This amazing pillow is just the right size for your little one. It is so cozy that they will want to sleep with it and take it with them everywhere! Like their favorite blanket or stuffed “friend,” this snugly pillow will be their new “must have.”",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/3cbd2ae2-d128-423f-beb7-fd64addbe390._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "QUALITY YOU CAN TRUST The premium polyester cluster fiber fill is covered with a soft 100% cotton, 200 thread count fabric, and it is filled just enough to provide snugly support for your sleepy head's neck. Pillows conform with use so the more your toddler uses their pillow, the more it will be unique to their needs. Even though many toddlers sleep in all kind of positions - whether they sleep on it, next to it, holding it, over it, or some other way, the one thing we know is they are going to love it!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/e54e07e8-2d82-49f5-add5-32070f8b0b3c._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "OUR FAMILY COMPANY Our company is still small and family run. We take great pride in our products and our unsurpassed customer service. We know that our wonderful customers are the reason we are in business! It is hard to find products made in the USA these days. But ours is. Our pillows are made by people who live locally, and who care about each and every pillow they make.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/f1236c54-2e29-44ec-b83b-a13ade01e548._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "HYPOALLERGENIC AND WASHABLE! This pillow is 100% hypoallergenic, which means it won't contribute to or cause allergies! Yes, this pillow is washable! Wash on cold, gentle cycle, and dry on low. Fluff and love again. If you travel a lot to grandma's house, or have non-toddler children, you just might want to buy two right now. We aren't kidding when we say that your kids are going to love their \"Little Sleepy Head Pillow!\" And we are now selling pillowcases too!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/fa6840c7-8467-400e-a7ef-567e94ab4e5c._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/3cbd2ae2-d128-423f-beb7-fd64addbe390._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/e54e07e8-2d82-49f5-add5-32070f8b0b3c._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/f1236c54-2e29-44ec-b83b-a13ade01e548._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/fa6840c7-8467-400e-a7ef-567e94ab4e5c._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMEZXYPM5PQR2FOGOMKV566R4JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMVPHJXY7CM0G?ASIN=B00KDKKD1I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Great pilloe",
                "reviewText": "These are great pillows for adults as well as toddlers. I use them myself in many ways and they are comfortable and non toxic and long lasting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JoanOfArt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDYLLQAYPAR2IZ2WQYYIO46MU6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PRPBSA3MBSJK?ASIN=B00KDKKD1I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2015",
                "reviewTitle": "5.0 out of 5 stars Hands-Down THE BEST Pillow On the Market Today!!!",
                "reviewText": "This is absolutely the best pillow, and the best COMPANY I have ever had the pleasure to do business with. In this day and age of computers, internet, and auto-responses, what a wonderful surprise it was to be able to contact the company and - not only get a timely response - but get a person within the company who could help me with all my needs SWIFTLY and courteously. I bought this pillow because I have a degenerative connective tissue disorder and I have to support my neck at all times - even when I'm sitting or lying down. But when I received it, although it was an awesome (hypoallergenic, soft, wonderful) pillow, it was just a little bit too fluffy for my needs. I contacted the company and asked about a special order, because I'd read where other customers had truly phenomenal experiences when contacting the company and asking for help. I sent a message here on Amazon and offered to buy a second pillow, but asked that it please be made to order with less fill.Instead of receiving an invoice or instructions on how to repurchase, I was sent another pillow, FREE OF CHARGE, made special-order to my specifications, with emails updating me throughout the entire process, and with a \"thank you\" note, personally signed and authored by Chris, at the Little Sleepy Head company headquarters, telling me he appreciated my business. Wow. You just don't get that ANYWHERE anymore. I have recently been fighting with my cable company, spending months and hours on the phone trying to get them to come out and fix their equipment, with NO relief, and I pay them $160 a month!!! You can't even get good customer service for something that runs 25% of your monthly mortgage each month, and yet - for a purchase that was relatively small with this pillow here - I received the best customer service I've ever had in my entire life.I am in the process of placing another order for my daughter - and will do so again for all of my pillow needs for the rest of my life. Please be advised, if you purchase this item, you will get the best, most personalized customer service available in the world market today. Hands-down, the BEST!!!As far as the product goes, both the original pillow and the special order pillow are so awesome. They are AS COMFORTABLE and AS SOFT and yet SUPPORTIVE as my 100% Down Pillow (which cost three times as much). This pillow is awesome for adults (as well as children), providing just the right amount of support and cushion. You can absolutely tell that it's hypoallergenic, and that it hasn't been doused with heavy chemicals. It is the ONLY pillow you'd need for travel, for sleep, for chillin' on the couch. Extremely portable (you can shove it into a large purse if you're traveling with it), and perfect for daily use, I could not rate this pillow any higher as the best toddler/child/adult pillow on the market today.The cover is breathable and soft, and it is truly a joy to use. You can't go wrong!AAA+++",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "addyb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7UAK3LQ27IE6CRKYL2NFF376KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32XYY5DQD9MTG?ASIN=B00KDKKD1I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect size",
                "reviewText": "Great pillow for my three year old grandson on his Christmas visit. He loved it!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "April BeaulieuApril Beaulieu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5JI62JLG3VX47VCABN3DHGPRCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XEW3J7P5I74X?ASIN=B00KDKKD1I",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Perfect Size",
                "reviewText": "This pillow is getting 4 stars because it’s definitely a little bulkier than I expected for a 2 year old. But it’s very soft and is a good size for my son. He tends to fall off of it when he’s sleeping (I think it’s because of the bulkiness). But ultimately it’s a good pillow and my son sleeps well with it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81bZaqktrgL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUVAGWPFG7HAPVTTPIRNDVZ5WRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WECYKBV0NADS?ASIN=B00KDKKD1I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Tiny pillow",
                "reviewText": "This is not a normal sized pillow. It is smaller sized for children. My daughter loves it. It's a good first pillow.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGE3ZAODYWQWFYNNAEM6RDOVVB3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DOUL386HAH6W?ASIN=B00KDKKD1I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars So cute!",
                "reviewText": "I bought this for my 2-year-old daughter. She loves it, it is a great size for her crib. I wish it was just a bit wider but it gets the job done. It's super soft and squishy. She now looks forward to nap/bedtime to have her pillow. I will be purchasing another one for her couch downstairs. I recommend getting the corresponding pillowcase.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWO5CVEWGRHW25MGPP67GC2T3BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIHA21KO5YG2R?ASIN=B00KDKKD1I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice little pillow.",
                "reviewText": "My granddaughter loves her pillow. Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lindsey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUJDA5NW4KL4CYDJJWFENAXH6LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDR7R9QFDRZ8K?ASIN=B00KDKKD1I",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "3.0 out of 5 stars Very small",
                "reviewText": "Pillows are better for toddlers (kids 3 or younger). They are comfy but very small, a little too small for my 4 & 7 yo",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bruno Rodriguez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 13, 2021",
                "reviewTitle": "Muy suave y cara",
                "reviewText": "Para empezar, es muy pequeña, eso no está tan mal puesto que es para niño. Pero es demasiado suave, da la impresión de no tener nada. Mi niño de 4 años la usó pero no le gustó. Por el precio hubiera comprado una de memory foam (que actualmente usa). Esta almohada puede ser útil para bebés.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PickyPickyPicky",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 11, 2019",
                "reviewTitle": "Excellent Little Pillow",
                "reviewText": "This is what it must be like to float on a cloud. Very well made and incredibly lofty, soft and light. I use mine to put under my neck when lying down or sitting in a high-backed chair for my neck and shoulders and it squishes into place beautifully. This version is 4” high. There is another version that is 3” high. Corresponded with owners to double-check heights and they couldn't have been more helpful and gracious. They also have cute little 100% cotton pillowcases.(Needless to say from the review that it is an adult using this product and not a toddler.)",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deborah Lane",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 9, 2018",
                "reviewTitle": "Lovely, comfy pillow.",
                "reviewText": "Really lovely pillow, so comfy! Nice size.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 13, 2019",
                "reviewTitle": "Happy Toddler and amazing customer service",
                "reviewText": "First off I have to say what amazing customer service. at first I found the pillow was a little bit too high for my two year old stomach sleeper so I emailed the company and they got back to me right away and send me a new pillow with less fell along with a handwritten note and a follow-up email hoping that I was happy and I most certainly was the new pillow is fantastic. the only thing that I found was that the pillow case could be a little bit softer but I have yet to wash it so that could change with several washes overall very happy with the pillow and my two-year-old seems to love it.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma Blee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 23, 2018",
                "reviewTitle": "Five Stars",
                "reviewText": "Highly recommended",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}