{
    "remaining_requests": 37808,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Patented-Ergonomic-Sleepers-Orthopedic-Cervical/dp/B099QTDNTW",
    "body": {
        "name": "Cushion Lab Deep Sleep Pillow, Patented Ergonomic Contour Design for Side & Back Sleepers, Orthopedic Cervical Shape Gently Cradles Head & Provides Neck Support & Shoulder Pain Relief - Calm Grey",
        "price": "$98.00",
        "originalPrice": "",
        "rawPrice": 98.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Patented-Ergonomic-Sleepers-Orthopedic-Cervical/dp/B099QTDNTW",
        "soldBy": {
            "sellerID": "A30RQF8MI21BQH",
            "name": "Cushion Lab",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A30RQF8MI21BQH&asin=B099QTDNTW&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21t53rdzfkL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/414ZI-HArkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31K7u77VeOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xdWSXICbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ucv99GF L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31tNcompOQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41l0KPCOJQL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the C CUSHION LAB Store",
            "link": "https://www.amazon.com/stores/CUSHIONLAB/page/B3FACEE3-2BFD-4295-8C5B-1974DC65F1CE?ref_=ast_bln"
        },
        "brand": "CUSHIONLAB",
        "merchantInfo": "Cushion Lab",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 2551,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "OEKO-TEX MADE IN GREEN products are tested for harmful substances and made in safer workplaces with reduced environmental impacts. OEKO-TEX STANDARD 100 requires textiles-based products to be tested against a list of 1,000+ chemicals, to limit those which may be harmful to human health. Certification focus: #ProductSafety and #ChemicalsUsed."
        },
        "features": [
            "✔ THE MOST COMFORTABLE PILLOW: Your pillow search ends here. The Deep Sleep Pillow is the only pillow made to keep up with you even when switching sleep positions throughout the night. Enjoy perfect support & zero interruption for the deepest sleep of your life.",
            "✔ PATENTED DESIGN FOR BACK & SIDE SLEEPERS: Shaped by in-house Ergonomists, the sculpted side bolsters provide optimal side sleeping support, while the sweeping shoulder line and center contour let you snug closer for a seamless fit and relaxing back sleep.",
            "✔ ZERO PRESSURE CLOUDSUPPORT CUSHIONING: Our special blend of dual-density memory foam features a soft, cloud-like top layer with an adaptive support foundation – It sleeps unlike anything you've experienced.",
            "✔ ANTI-AGING FRESHFACE PILLOWCASE: Anti-wrinkle & hair frizz. The cool & ultra smooth washable cover has zero drag to prevent skin crease and helps fight aging. It's a cinch to change & will have you glow in the morning with great skin & hair.",
            "✔ SLEEP DEEPER, WAKE UP REJUVENATED: The best sleeps are uninterrupted. The Deep Sleep Pillow sleeps cool & provides tension-releasing cushioning with neck relief support so you can sleep deeper and wake up rejuvenated."
        ],
        "description": "Quite Possibly the most comfortable pillow in the world. Introducing The Deep Sleep Pillow – A culmination of 2+ years of development to offer you the ultimate in sleeping experience. Our patented design provides a satisfying balance of soft, zero-pressure cushioning and perfect contouring support, regardless of sleep position. It gently cradles your head and neck to melt away your stress and tension for a deep, sound sleep that will have you feeling rejuvenated in the morning. Sculpted Side Sleeping Bolsters Cradle your neck softy for optimal support and alignment while providing instant shoulder relief–tossing and turning will be a thing of the past. Sweeping Shoulder Line Lets you snug closer for full cushioning support and a seamless fit. Anti-aging and Bed Hair Freshface™ pillowcase helps you prevent skin crease and hair frizz, so you wake up looking radiant. Dimensions: 24 W x 16 L x 5.5/5 H inches Pair with TruFiber™ Bamboo Sheetsfor the ultimate in sleeping luxury. In stock& ready to ship at our CA warehouse, arrives in 3~5 business days.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/bedding/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063252"
            },
            {
                "name": "Bed Pillows & Positioners",
                "link": "https://www.amazon.com/bed-pillows-positioners/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1199122"
            },
            {
                "name": "Neck & Cervical Pillows",
                "link": "https://www.amazon.com/neck-cervical-pillows/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3732111"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "C CUSHION LAB"
            },
            {
                "name": "Special Feature",
                "value": "Washable"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Size",
                "value": "1 Count (Pack of 1)"
            },
            {
                "name": "Fill Material",
                "value": "Memory Foam"
            },
            {
                "name": "Shape",
                "value": "Wedge"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Anti Aging Foam"
            },
            {
                "name": "Use for",
                "value": "Neck"
            },
            {
                "name": "Material",
                "value": "Memory Foam"
            },
            {
                "name": "Item Firmness Description",
                "value": "Soft"
            },
            {
                "name": "Product Care Instructions",
                "value": "Outer cover is machine washable"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Item Weight",
                "value": "4 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "15.8\"L x 7.1\"W"
            },
            {
                "name": "Manufacturer",
                "value": "Cushion Lab"
            },
            {
                "name": "ASIN",
                "value": "B099QTDNTW"
            },
            {
                "name": "Item model number",
                "value": "J6-862L-CE3Z"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 2,551 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,802 in Home & Kitchen (See Top 100 in Home & Kitchen) #16 in Neck & Cervical Pillows"
            },
            {
                "name": "Refill",
                "value": "Memory Foam"
            },
            {
                "name": "Batteries required",
                "value": "No"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ram",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4LIITQMKCKG4XGOOOFB3ZJ4CZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OI997YATD6YX?ASIN=B099QTDNTW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 26, 2023",
                "reviewTitle": "5.0 out of 5 stars most amazing pillow for back and side sleeper!!!! buy it now!!!",
                "reviewText": "For many years I have had back and neck pain issues and was searching for a new pillow to help alleviate. Another issue is I tend to sleep hot. What I decided to do was buy four or five different pillows here on amazon and return the pillows that didn't meet my needs. During this trial I bought a down pillow, a foam pillow, a down alternative pillow, and this cushion lab pillow.After a few nights with each pillow, I removed and returned them one by one. The down pillows were downright hot and tended to go flat at night. The memory foam pillow was supportive but also ran a bit hot. The down alternative pillow was just not to my liking at all as it felt cheap.I was getting desperate as this pillow was the final one to demo, and if it didn't work out, it was back to my old pillow. Fortunately, upon unboxing of this pillow, I immediately realized that this pillow was different! The cover is fantastically soft like silk. It was also cool to the touch (almost a bit cold feeling)! The feel was like a gel memory foam but even more resilient like the feel from a latex bed. I went to sleep that night and slept so well! The pillow somehow managed to cool (not cold) through the night. It has the perfect support and cushion-feeling for back sleeping where it slightly cradles your head.Most of the time I start on my back and tend to roll onto my side later at night. When rolling to the side, I'm not sure how it works, but the support transitions to perfect side sleeping support! Needless to write, this pillow is a game changer for me. I have been sleeping so much better and my neck pain is gone!!! I'm so happy with this product that I'm buying a second one to reward this company with my loyalty and so both pillows with be the same.I'd like to say thank you to this company for making such a unique and well tested product! If you are a back or side sleeper, give it a try! There's a high probability it will work for you!",
                "reviewVotes": "165 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Professional Scientist",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGC7HUIU6GJ2KVZGDHC2B2Q2PZFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B2EEV2XUL0ZZ?ASIN=B099QTDNTW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2023",
                "reviewTitle": "5.0 out of 5 stars This is the best pillow I've ever used - and I've tried too many to count",
                "reviewText": "I am a back sleeper. I need a soft pillow because with firm memory foam pillows or pillows with inadequate support means that I wake up with a migraine. This is perfectly soft. It's not too firm, like some memory foam or cervical pillows. There is no pressure. It's really just what I was looking for. For the first time in YEARS I slept the entire night through without tossing and turning and without fluffing my pillow (I usually go for 100% goose down because I need both softness and support). The curves in the pillow perfectly cradle your head. Really the perfect pillow.There is an odor, but I have never seen a memory foam that doesn't have an odor. Just air it out and it wears off. I put a pillow case over it and I slept fine. The odor isn't that strong and I am very sensitive to odors.I did not notice any heat retention.To compare: I think Purple pillows are too firm and I do not like the feel of the grid. Tempur-pedic material is too firm and I wake up with a headache when I used their pillows. Also, the height is not right. They do not provide adequate support. Goose down is great, but I find myself waking up in the middle of the night and re-fluffing my pillow or putting my arm under to provide additional support. Plus, those poor geese. :( The cervical memory foam pillows are too firm, causing me to turn side to side and leaning up against those weird wings (that don't look that attractive on the bed or in a standard pillowcase). The gel fiber pillows are half-way decent (better than the old poly batten material), but are similar to goose down in that they need. to be fluffed and do not provide adequate support. The shredded memory foam pillows are too firm and they claim to be \"adjustable\" but when you take out the memory foam, it just feels like you are also taking out support and have half a pillow that also needs to be constantly fluffed.",
                "reviewVotes": "154 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "He’s So Vine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGE4QOGZK6WGAMYRZMFGB5EJ3TNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TB5T3Q9BSWAH?ASIN=B099QTDNTW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Not good for my neck, but my teenage daughter loves it! 😃",
                "reviewText": "Pillows are like mattresses. They are difficult to do reviews on, because everyone is a little different on shape, weight and preferences.I tried this pillow and it was just a little to high for my neck. Or my head was too lightweight,…It put a slight bend in my neck and prevented sound sleep. So,.. I did like any good dad, and gave it to my teenage daughter. 😅Unlike me, it fit her neck like a glove and was super comfy for her. Probably more than I would typically spend on a child’s pillow,.. but she likes it and she’s not a kid anymore, so I figure it’s a good investment if she’s getting good quality sleep each night.As far as the pillow itself. It had a light smell of memory foam. Nothing too crazy or chemically.The firmness is cushy but firm. I’d say it tilts toward firm. It says it is for back, tummy or side sleeping,.. but I couldn’t see using it for side sleeping,.. with it’s high peaks in the corners it always seemed to smash my cheek and cut off air supply to that side’s nostril.But of you’re a back sleeper, it cradles the head nicely.Sorry to be a mixed bag about the review,.. but I have to be honest. I struggled to get any sleep on it for several days before gifting it to my daughter, who absolutely loves it. In addition to this, there are many glowing reviews here on Amazon.My advice would be to try it, and utilize the Amazon return process if you end up not liking it. Not because it isn’t an excellent pillow,. But because it’s very expensive if it doesn’t work for you.But if like my daughter, you end up loving it,.. and if it saves you one coffee or energy drink a day,… it’s well worth the cost to get a solid night’s sleep.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruby Ridge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2023",
                "reviewTitle": "A Tale of Two Pillows",
                "reviewText": "I ordered this pillow and it came rolled up in the box. No problem. It plumped up within a few hours. Once it was full size, I could see that it looked just like the photo. It’s actually quite heavy and dense but when you put your head on it, it feels like a cloud. So smooth and cushy. I absolutely loved it. No neck pain. So I ordered another one, the exact same pillow a few weeks later. For some reason, this one did not plump up. It just sort of sat there, looking at me. After 36 hours, even though the memory foam had risen somewhat, it just did not look like the original pillow. It felt compact under my head, and had no give to it. The first pillow did some off-gassing and after a day, I didn’t notice it much. But the second pillow, oof. So smelly. I didn’t want to return it, but I had no choice. I would have given it 5 stars, except for the disappointing 2nd purchase.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}