{
    "remaining_requests": 42563,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ASUS-ROG-II-Motherboard-Heatsink/dp/B09GP7V2W5",
    "body": {
        "name": "ASUS ROG Strix X570-E Gaming WiFi II AMD AM4 X570S ATX Gaming Motherboard (PCIe 4.0, Passive PCH Heatsink, 12+4 Power Stages, WiFi 6E, 2.5 Gb LAN,USB 3.2 Gen 2 Type C and Aura Sync RGB",
        "price": "$484.90",
        "originalPrice": "$599.00",
        "rawPrice": 484.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ASUS-ROG-II-Motherboard-Heatsink/dp/B09GP7V2W5",
        "soldBy": {
            "sellerID": "A2CGUAEB88MBQY",
            "name": "Sab Computer",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2CGUAEB88MBQY&asin=B09GP7V2W5&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09Y2QBG2C"
        ],
        "asinVariationValues": [
            {
                "asin": "B07SW8DQVL",
                "variationName": "Style",
                "variationValue": "ROG Strix X570-E Gaming",
                "price": "$474.99",
                "variationImageURL": ""
            },
            {
                "asin": "B09GP7V2W5",
                "variationName": "Style",
                "variationValue": "ROG Strix X570-E Gaming WiFi II",
                "price": "$484.90",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41HZxd12v2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51gSFiO7K8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NwQPvaF4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ATbJJM9ML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VaHotgbsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wYg0cP8mL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417XuBZIcKL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the ASUS Store",
            "link": "https://www.amazon.com/stores/ASUS/page/02389710-881F-4F25-89E8-F92DEEA14D5A?ref_=ast_bln"
        },
        "brand": "ASUS",
        "merchantInfo": "Sab Computer",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 3228,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$10.41 delivery Wednesday, February 21.",
            "Or fastest delivery Thursday, February 15. Order within 17 hrs 18 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "AMD AM4 socket: Ready for AMD Ryzen 5000 Series, 5000 G-Series, 4000 G-Series, 3000 Series, 3000 G-Series, 2000 Series and 2000 G-Series desktop processors; supports up to two M.2 drives and features USB 3.2 Gen 2 and AMD StoreMI to maximize connectivity and speed.Bluetooth v5.2",
            "Optimal Power Solution: 12+4 power stages with ProCool II power connector, alloy chokes and durable capacitors to support multi-core processors",
            "Comprehensive Cooling: Passive chipset heatsink, VRM heatsink with 8 mm heatpipe, dual on-board M.2 heatsinks and a water pump header",
            "High-Performance Networking: 2.5 Gbps LAN and Intel Gigabit Ethernet with ASUS LANGuard, WiFi 6E (802.11ax) with MU-MIMO and gateway teaming via GameFirst V",
            "Best Gaming Connectivity: Supports PCIe 4.0, HDMI 2.0, and DisplayPort 1.2, and features dual M.2, USB 3.2 Type-A and USB 3.2 Gen 2 Type-C connectors"
        ],
        "description": "ASUS ROG STRIX X570-E GAMING WIFI II is equipped with 12+4 power stages and stacks comprehensive set of cooling solutions including integrated up to 2 M.2 heatsinks, passive chipset cooling, and VRM heatsinks in order to tame AMD’s latest CPU. Moreover, ROG STRIX X570-E GAMING WIFI II delivers with a wealth of ultrafast connectivity options, including up to 2 M.2 slots, USB3.2 Gen2 ports, and front panel USB 3.2 Type-C.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17923671011"
            },
            {
                "name": "Motherboards",
                "link": "https://www.amazon.com/Motherboards-Computer-Add-Ons-Computers/b?ie=UTF8&node=1048424"
            }
        ],
        "productInformation": [
            {
                "name": "RAM",
                "value": "‎DDR4"
            },
            {
                "name": "Memory Speed",
                "value": "‎4600 MHz"
            },
            {
                "name": "Wireless Type",
                "value": "‎802.11a/b/g/n/ac, 802.11ax"
            },
            {
                "name": "Number of USB 2.0 Ports",
                "value": "‎4"
            },
            {
                "name": "Brand",
                "value": "ASUS"
            },
            {
                "name": "Series",
                "value": "‎ROG STRIX X570-E GAMING WIFI II"
            },
            {
                "name": "Item model number",
                "value": "‎ROG STRIX X570-E GAMING WIFI II"
            },
            {
                "name": "Item Weight",
                "value": "‎1.27 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎12 x 9.6 x 2.2 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎12 x 9.6 x 2.2 inches"
            },
            {
                "name": "Voltage",
                "value": "‎12 Volts"
            },
            {
                "name": "Manufacturer",
                "value": "‎ASUS"
            },
            {
                "name": "ASIN",
                "value": "‎B09GP7V2W5"
            },
            {
                "name": "Date First Available",
                "value": "‎September 23, 2021"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 3,228 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#466 in Computer Motherboards"
            },
            {
                "name": "CPU Socket",
                "value": "Socket AM4"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer"
            },
            {
                "name": "RAM Memory Technology",
                "value": "DDR4"
            },
            {
                "name": "Compatible Processors",
                "value": "amd athlon"
            },
            {
                "name": "Memory Clock Speed",
                "value": "4600 MHz"
            },
            {
                "name": "Platform",
                "value": "Windows 10"
            },
            {
                "name": "Model Name",
                "value": "ROG STRIX X570-E GAMING WIFI II"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "64 GB"
            },
            {
                "name": "RAM Memory Maximum Size",
                "value": "128 GB"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MokonaMokona",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR7GRUW3ZIE5IJWCNKEUQVOUBKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CD7D0OJ0C1YV?ASIN=B09GP7V2W5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2021",
                "reviewTitle": "5.0 out of 5 stars Great feature filled board with decent overclocking options.",
                "reviewText": "After using the board for the past 8 months, I feel confident in saying that it is one of the best AM4 boards when it comes to featurset and value. While it is fairly expensive (nearly $300 at the time or purchase), the money is going to more of the utilitarian parts that impact performance and usability. Since all of the PCIe slots have PCIe switches on them, the board is very flexibility in how the various ports can be used without running into issues such as some ports being unusable when others are populated.As the board is laid out and connected, the first PCIe X16 slot is connected directly to the CPU, and has a switcher to send 8 lanes to the second PCIe X16 slot (this slot is wired only for X8) if a device is installed in that slot.The first m.2 slot is wired directly to the CPU as well (has 4 PCIe 4.0 lanes that is not shared with anything else).The remaining slots make use of the PCIe 4.0 lanes from the chipset, and best of all, all of them can be used at the same time, including the 2nd m.2 slot. The only catch here is if the 2nd PCIe X1 slot is populated, then the 3rd full length slot that is wired for X4, will run at X2 speeds instead.The board comes with a built in Intel AX200 WiFi adapter. The WiFi adapter and the Bluetooth feature can be enabled or disabled individually, thus if you do not need WiFi, you can disable it at the bios level, while keeping the Bluetooth part of the AX200 enabled.For Ethernet, the motherboard uses the Realtek RTL 8125 which performs as expedited for a 2.5GbE connection. When connected to a multi-gig switch. A throughput test using TCP between 2 2.5GbE clients, gets a sustained speed of 2380.952Mbps after the TCP overhead, thus it is effectively providing the full throughput of the standard.The Intel AX200 performs as expected, and identically to that of laptops equipped with it. When connected to an 802.11ax AP in a urban environment with some congestion on the 5GHz band; at 160MHz channel width, the AX200 provides a real world throughput hovering around 1.8 to 2Gbps.The VRMs remain relatively cool during heavy operation when used with a Ryzen 7 5800x. At full load, the CPU pulls 147 watts which is being powered via a 16 phase 12+4 config that uses 60 amp power stages for each phase (International Rectifier IR3555). Every 2 phases share a signal from the controller, thus in practice, it behaves more like a 6+2 phase, but with twice the current handling capability.Aside from the standard 24 pin ATX power connector, the EPS 12V connector near the CPU area uses an 8+4 pin connector. a single 8 pin EPS 12V cable will run the board just fine, but if you use multiple PCIe slots at once, especially with SLI, then the 4 pin is also needed.Aside from the above mentioned aspects, everything else performs similarly to any other X570 board, since everything else performance related is tightly controlled by AMD.The board also has a number of RGB LEDs along with 4 RGB headers for addressable RGB strips, but thankfully, all of the RGB can be turned off.--------------------Pros:Great VRM design with good transient response.Good set of bios options.First PCIe X16 slot is spaced low enough to allow ample room for an NH-D15 cooler.Good use of PCIe switchers, allows for all PCIe slots (including the m.2 ones) to be used at the same time, along with every SATA port with nothing being disabled.Intel AX200 WiFi module can be disabled in bios while keeping its Bluetooth 5.2 module enabled.------------------Cons:It has many RGB LEDs that are enabled by default, thus adding an extra setup step to disable them.The 2 coax cables for the WiFi/ Bluetooth antenna are longer than I would like. Ideally it is best to keep any cable carrying RF to be as short as possible for where you would like to place the antenna, as RF is gradually attenuated as it travels to more and more length of cable. While the range is still great for WiFi and Bluetooth, in terms of Bluetooth, the range is a little shorter than on my laptop which uses the same WiFi adapter.The 2 screws holding on the cover for the chipset heatsink needs to be removed before you can remove the 2 m.2 slot heatsinks.---------As a final overall rating, I am still giving it 5 stars as the cons that personally effected me are not major, and the RGB one can be easily solved (for those of us who do not like having RGB lighting on our builds. Beyond that, since my use cases are more utilitarian, it meets those needs without issue.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81BY+z3eqlL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81xAixh-V0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91fMpm4iXiL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91gU6rJqwRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91nXhlTnwEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91wMO1dhuPL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "W McBride",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXLQL7HOYVOWPO3RBZAJWXNRGOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPNMCD4GZS0W3?ASIN=B09GP7V2W5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Great choice if you want an integrated GPU. ASUS is my preferred brand for performance and stability",
                "reviewText": "I'm not a gamer, so I can't comment on the performance of the integrated GPU. If you plan to use a standalone GPU, the Dark Hero is likely a better choice with 8 USB 3.2 gen 2 USB ports. The 570 chipset is a significant upgrade over 470 or prior, and there should be good headroom for overclocking. BIOS is always excellent on ASUS motherboards with ASUS is very good with updates to improve performance, stability, etc. AM$ products are mature and offer excellent performance and value. I recomment Ryzen 5900 CPU and the best air cooler you can afford from bequiet or Noctua.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rick S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWHMOVQTUFLBDYN4E6JBSVKLH2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R169B4QY8DX4A2?ASIN=B09GP7V2W5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2022",
                "reviewTitle": "5.0 out of 5 stars Easily the best X570 board I have owned, everything just works and great features for the price!",
                "reviewText": "I originally wanted to get the Dark Hero, but I saw this and felt it had everything I wanted/needed and looked like a good value.Everything just works on this, the BIOS is nice and the software has not let me down (which is the usual issue, the hardware is great but the software is atrocious!).I originally got the X570 Gigabyte Aorus Master, and though that board has never been that bad, I ended up messing up the pins on it removing the cooler. I had used Kyronaut paste and did not know how cement-like it gets when it dries. When I went to change cases, I removed my AIO pump and the CPU came with it (bending the pins on my 5800x CPU and the Aorus Master board)! Very expensive mistake and lesson! Never attempt to take off the cooler, water block, or AIO pump without breaking the seal by twisting it gently.So I got the MSI Meg Ace Max X570S with a 5900x, and though that is a good board, I have had issues with Nahamic constantly installing itself (dropping FPS by 30-40 FPS on a 6900XT video card at 4K), the board software not wanting to update, and it always seemed to have little bugs.This Asus Rog Strix X570 Gaming WIFI II has simply worked. I hooked everything up one time, booted into the BIOS, turned on XMP, and was installing Windows 11 right after. My PC specs:This boardRyzen 9 5900x32 GB CORSAIR Vengeance RGB RT 32GB 3600 MHzXFX Speedster Merc 319 6900XT2 TB Sabrent Rocket Q NVME drive (OS)12 TB Seagate Ironwolf NAS Drive (Data)Corsair iCUE H150i Elite Capellix CPU coolerLian Li O11 Dynamic EVO caseI have always preferred Asus and should have went with Asus from the beginning. Great looking board with a ton of features and software that actually works properly. I would not hesitate to recommend this board to anyone.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kyo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYDRN6UE6NQJDMZCWX3CXNBMUIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28KXP6TI1P5DP?ASIN=B09GP7V2W5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Its just soo WOW",
                "reviewText": "I love its RGB lighting, the color sync, ryzen, and supports it includes in the motherboard. It has everything i needed as a beginner pc builder. It has a wifi attachment which is super great because i dont have a ethernet cable to reach it. It has decent enough usb at the back for me to plug my accessories too. My only downside to this motherboard is that it will randomly refuse to work even though its on. I turn it on but it will not load screen and the whole motherboard just load in rainbow colors and i have to restart it again and it will work normally. I highly recommend this product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 26, 2023",
                "reviewTitle": "A la altura.",
                "reviewText": "Componentes de avanzada. Vale lo que pagué. 10 de 10.La estoy comprando en 2021, seguramente habrá mejor en 2 años.Asus, productos de calidad. Llevo 10 años comprando la marca y no he experimentado ninguna falla.Productos que he comprado:MonitoresMotherboardTarjetas de video (para videojuegos)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerardo Aaron Medina Padilla",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 7, 2023",
                "reviewTitle": "PERFECTA",
                "reviewText": "descarguen lo drivers en la pagina de Asus, yo tuve conflicto con los driver que me daba Windows para el bluetooth y el Wifi.(no necesite actualizar la BIOS, le puse un Ryzen 9 5700x)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brad kBrad k",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 22, 2022",
                "reviewTitle": "It's a ROG !",
                "reviewText": "An amazing board, came with the second latest bios and didn't have a single issue installing the Ryzen 5800x. Everything just works from the very first power up and has all the features and overclocking settings that anybody could ask for.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71qgwLFZQzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jean-François Rioux",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 20, 2022",
                "reviewTitle": "Good motherboard",
                "reviewText": "Bought this for my new gaming rig 5 months ago. Works very well. Easy enough to install and get working.Very satisfied with the purchase.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rohan JadhavRohan Jadhav",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 21, 2023",
                "reviewTitle": "Great product.... genuine🥰",
                "reviewText": "",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61fNVrvQQWL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}