{
    "remaining_requests": 42714,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ASUS-ROG-Z690-I-motherboard-Thunderbolt/dp/B09JRW7FFK",
    "body": {
        "name": "ASUS ROG Strix Z690-I Gaming mini-ITX Motherboard - WiFi 6E, PCIe 5.0, DDR5, Thunderbolt 4, M.2",
        "price": "$225.67",
        "originalPrice": "$259.99",
        "rawPrice": 225.67,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ASUS-ROG-Z690-I-motherboard-Thunderbolt/dp/B09JRW7FFK",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41IdNhRtvsL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51zjw FoyCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415RxfwiceL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 tqlShIEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wHnsO1 NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51apAvOhAnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Mj6VCkvjL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1E0hfezCoL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1E0hfezCoL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the ASUS Store",
            "link": "https://www.amazon.com/stores/ASUS/page/02389710-881F-4F25-89E8-F92DEEA14D5A?ref_=ast_bln"
        },
        "brand": "ASUS",
        "merchantInfo": "Ships from and sold by InfinityProduct.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 166,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Wednesday, February 14. Order within 2 hrs 47 mins",
            "FREE delivery February 16 - 22.",
            "Or fastest delivery February 15 - 21."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Intel LGA 1700 socket: Ready for 12th Gen Intel Core processors, support PCIe 5.0,DDR5 and out of box Windows 11 ready",
            "AI Motherboard : AI Overclocking, AI cooling, AI networking(GameFirst VI) and AI noise cancellation",
            "Robust Power Solution: 10plus1 power stages with ProCool II power connector, high-quality alloy chokes and durable capacitors to support multi-core processors",
            "Optimized Thermal Design: VRM heatsink, triple decker M.2 heatsink, hybrid fan headers and Fan Xpert 4 utility",
            "High-performance Gaming Networking: On-board WiFi 6E and Intel 2.5 Gb Ethernet with ASUS LANGuard",
            "Best Gaming Connectivity: Supports HDMI 2.0 and DisplayPort 1.4 output,and featuring 2xM.2 and USB 3.2 Gen 2x2 Type-C, Front panel USB 3.2 Gen 2x2 Type-C connectors and ITX expansion card(features 4 SATA ports, Front Panel headers, Front Speaker header and one ARGB port)",
            "PC DIY Friendly: SafeDIMM, PCIe 5.0 Safeslot, Q-LED, M.2 Q-Latch, CPU socket lever protector, Pre-mount I/O shield, BIOS FlashBack, Clr CMOS button and FlexKey (Reset, Aura on/off, Direct key)",
            "Industry-leading Gaming Audio: High fidelity audio with ALC4080 with Savitech SV3H712 amplifier, along with DTS Sound Unbound and Sonic Studio III",
            "New ROG Strix Aesthetics: New ID design,ASUS-exclusive Aura Sync RGB lighting, including RGB headers and Gen 2 addressable headers"
        ],
        "description": "ASUS ROG Strix Z690-I Gaming WiFi 6E is the perfect backbone for gamers who pursue ultimate performance out of Intel 12th Gen CPU mini-ITX PC build. With boosted power delivery and innovative cooling utilizing a skived-fin design, ROG Strix Z690-I Gaming WiFi 6E is the perfect compact platform for your next gaming battle station.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Motherboards",
                "link": "https://www.amazon.com/Motherboards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=1048424"
            }
        ],
        "productInformation": [
            {
                "name": "Processor",
                "value": "‎pentium_m"
            },
            {
                "name": "RAM",
                "value": "‎DDR5"
            },
            {
                "name": "Memory Speed",
                "value": "‎2133"
            },
            {
                "name": "Brand",
                "value": "ASUS"
            },
            {
                "name": "Series",
                "value": "‎ROG STRIX Z690-I GAMING WIFI"
            },
            {
                "name": "Item model number",
                "value": "‎ROG STRIX Z690-I GAMING WIFI"
            },
            {
                "name": "Item Weight",
                "value": "‎3.1 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎8.89 x 7.28 x 3.7 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎8.89 x 7.28 x 3.7 inches"
            },
            {
                "name": "Manufacturer",
                "value": "‎ASUS"
            },
            {
                "name": "ASIN",
                "value": "‎B09JRW7FFK"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎October 27, 2021"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 166 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#156 in Computer Motherboards"
            },
            {
                "name": "CPU Socket",
                "value": "LGA 1700"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer"
            },
            {
                "name": "RAM Memory Technology",
                "value": "DDR5"
            },
            {
                "name": "Compatible Processors",
                "value": "intel celeron"
            },
            {
                "name": "Chipset Type",
                "value": "Intel Z690"
            },
            {
                "name": "Memory Clock Speed",
                "value": "2133"
            },
            {
                "name": "Platform",
                "value": "Windows"
            },
            {
                "name": "Model Name",
                "value": "ROG STRIX Z690-I GAMING WIFI"
            },
            {
                "name": "CPU Model",
                "value": "Intel Pentium M"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLBMKY36RKQLM4BV3JTN3VQIOZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AHGR4HC8CRH?ASIN=B09JRW7FFK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Great itx solution",
                "reviewText": "This board is fantastic, incredible build quality, bios is very easy to navigate through and the sale price isn’t through the roof expensive compared to other itx boards in this class. HOWEVER there are two things that may make this a tough sell for others looking to make this purchase.1. The stacked NVMe is a bit cumbersome and very tall. This makes it incredibly difficult, if not impossible to source large air cooling solutions that are compatible with this configuration. The Noctua u9s fits but just barely.2. My board did not include the supporting pads to prevent the NVMe pcb from bending after the heatsink is installed. Thankfully I had an old Asus board that had a couple left over but it’s important to note that you may or may not receive pads with this board.Other than that, this board is fantastic and HIGHLY recommended. Buy with confidence my friends.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "George Lupercio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDAWVIJAA64V2LFBERCQ4P5QXMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GKRQ0G5ZM4OX?ASIN=B09JRW7FFK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Save Money Buying Premium!",
                "reviewText": "I bought this motherboard thinking there would be something wrong with it for being from Amazon warehouse. I was pleasantly surprised when it appeared to be almost brand new, except for being in a different box. Just buy it! It works well for Itx and has all the plugs you’ll ever need. The only downside is the weird mini card you need for some of the connectors but it comes with it. Also odd is how large the tower is for the SSD but it satisfies my need for 2 SSD.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "will",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZR652IE7WOMVLFPQWOVP42F27Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NNW4O7HTRNLI?ASIN=B09JRW7FFK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2022",
                "reviewTitle": "4.0 out of 5 stars Easy build for itx",
                "reviewText": "\"for itx\" is definitely the key there, i wanted small but future proofing incase I wanted to expand so knew what was getting into. But over-all not bad, a few really amateur engineering choices on pin locations such as power & case audio that could and should have easily been put elsewhere BUT just adds a few annoying seconds to the build and never worried about again.There is 1 real major thing that takes this down 1 star. There's a CD for the driver - what embarrassing crap is this for 400 bucks? it's been 10 years since anyone has built a CD drive into a computer, why is there not a flash drive in the box with drivers?... seriously this is just embarrassing. Like at least it's glaring and obvious and you know \"okay, better get up on other computer and start downloading to a thumb drive\" but how, how can anyone think that's okay in in the 2020s? Honestly just for the level of pure ignorance involved I want to 1 star it, this is literally like buying an electric car but it coming with a gas tank where the charging plug should be, but i'll be fair cause there is a work around lol.one other small factor to losing a star is the pci slot locking mechanism needs to be reengineered. first the nvme hood has to come off to reach it to release a card, and even then you are still required to have to use some kind of tool (used tweezers) to reach down to push as the drivers still block all but a tiny tiny area and it just doesnt feel safe, naturally, trying to shine light down there and push and hope it doesnt go sliding off and damage motherboard. other plugs that you are just gonna press in the once and never again are find with their annoyance, but swapping out a video card is gonna be a lot more common. That plastic tab needs to be made wider/longer in some fashion that it is accessible without needing to macguyver something to reach it.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "N. Joseph",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7UN4CNHZVJ7WDWFQ7PZRWTZDJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNH9988C27640?ASIN=B09JRW7FFK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Issues resolved.",
                "reviewText": "I've been building PC since the days of dial up internet and had my fair share of quirky boards and peripherals, but this board left me nothing but disdain for ASUS. I truly believe that I'll be avoiding their brand across the board, from motherboards, graphics cards etc.I purchased this board and I noticed the the circular seal on the box was doubled. The thought entered my head that it was previously open and resealed, but honestly, if it worked I won't care, as long as I had a working product with a warranty I'd be golden.After the components were installed and the board powered up, it took a solid 15 to 25 seconds to post and show the bios. This is not the exception, this is norm throughout all my efforts. I first flashed the bios to the latest version and tried installing windows. The PC would give me the BSOD with a few seconds. I tried running a memtest86 and everytime the PC got between 70% - 80% the PC would restart itself and take me back to the bios. I tried one stick of ram at a time and in different slots ... same results. I bought another fresh pair of ram from a different manufacture .... same results.I decided to call Asus and escalate my concerns. After some rudimentary exercises like power off/on, reset cmos etc I was told to RMA the board on my dime and they'll ship it back to me on their dime. I was hesitant at first but when the rep told me it will be about three weeks before I get the board back, I had to push back and refuse to RMA it. I simply returned it to the merchant and bought another one thinking that I just got a dud.The second board came and the first one was returned. Oddly enough, the second board was also double sealed as though it was open before and then resealed. I proceeded to install it and went through the same issues as the first board. I spend about 10 days off and on playing in the bios, changing ram and using only the bare minimum components I needed to get the PC going but nothing worked. I'll have to return this once again and get something totally different.All my components shows up well in the bios. CPU temps are between 39~45 Celsius. CPU is an i7 13th gen unlocked. I'm using a class B power supply with 150% of the head room I need power wise. Nvidia 4070 card w/ (2) 16gb sticks of ddr5 ram, all compatible with the board. especially after installing the latest bios. I honestly gave this a fair shake.As an update: Turns out my brand new i7 CPU was the culprit. After swapping graphics card, swapping hard drives, swapping ram, swapping motherboards .... I finally swapped processors. Intel, you had one job!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aleks malyhin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 12, 2023",
                "reviewTitle": "is a very good but a bit to much",
                "reviewText": "this motherboard is packing some punch but its very crammed. my cpu cooler is barely fitting in it the motherboard but at least its there and cooling. but the thing is that there is to much stuff going on this board, the small little board with the sata cables is a nice addition but if i would design this board i would keep things simple and kept one or two sata connector and the front panel connector and that its. this is manly for asus to read this is that from a standard user point of view that when i go for itx size i am expecting to lose some features because i am going for size and not overpacked of features. but i saw a lot of bad reviews for the board and there were in principle compatibility problem and size the first thing to do is update the bios for the latest and update intel ME with all the over motherboard drivers and i didn't get any problem for now. i will come back if encounter some for of problem in about 3 months or sooner if something happens but i hope nothing happen and everything to work well. the cooler i used was the NH-U9S. it fits well but you will lack cooling power if you don't go with water cooling. so my suggestion will be to not go super high end as a cpu and keep it around the midrange and avoid the K version of cpu's or you will need to underclock it to make some what cool. if you have some question i will be happy to answer them.Update: the motherboard is working perfectly fine but you really need to do the bios updates cuz it has few bugs at the 2305 bios like when I shut it down and start it back up it stuck on boot and vga but I just hold the power button and my pc shuts down and start back up and everything is fine. For now I didn't have any other problems. The only other thing is not very critical is that when I turn of turbo the core voltage drops down in a very scary zone of 1.06 volts but the pc works fine and never had a single crash except of one time because of the gpu drivers having a bug but after updating everything was fine.update; with the light on the motherboard it just was the adapter cable from hdmi to dvi now i have display port and everything is good",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FRANCISCO ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 15, 2023",
                "reviewTitle": "no la recomiendo solo es una pieza de arte defetuosa",
                "reviewText": "no les recomiendo comprar esta tarjeta madre o no la usen en procesadores arriba de core i3,compre otro modelo este es defetuosa solo trabajo 5 meses se instalo con productos certificados ,esto incluye carcasa certificada para este tipo de placas,psw certificada golden plus,se probo con productos totalmente compatibles de muy buena calidad desde la gpu hasta los modulos mas avanzados m.2 con un systema de enfriamiento liquido el mas a deacuado que puedan imaginar solo se uso para trabajar con un a tableta digitalizadora para crear contenido,sin hacer renderizados o para gaming ,las temperaturas de la tarjeta fueron siempre 40 temperatura asi como el procesador core i9 12900 los maximo que alcanzao en sus nucleos fue 48 grados centigrados,la gpu rtx 3070, en mi opinion por le diseño de esta tarjeta se dedicaron hacer una bella maciza pieza de arte,y no para soportar componentes o productos de muy buena calidad certificados, las temperaturas del procesador fueron de menor de 48 grados,la gpu menor de 40 grados y la mobo, modulos de memorias en 40 grados centigrados,ssd m.2,y aun asi dejo de funcionar, le dio como un paro cardiaco fulminante a los 5 meses ...el error presentado ni siquiera viene identificado entre las anomalias del soporte de asus,lamentablemnete no puedo hacer valida mi garantia por que ya paso un año, una por la escases por la pandemia de otros componente y por esperar por los mejores y mas adecuados componentes para esta mobo , yo tengo usando modelos asus para rizen y todavia funciona manejando esta temperaturas 40 grados en teoria esta tarjeta soportan has 70 grados,pero su diseño fue malo se procuparon mas por implementar micro tajetas montables una sobre de otra y yo ya habia experimentado esta mala calidad de diseño en productos vaio hace años,practimente la selecione como mejor opcion pensando en el procesador core i9 ......pero siempre es mejor el basico diseño. la mobo solo llega la energia a los modulos de almacenamiento m2. y a los leds de la placa, el fallo que presentara este modelo sera en los capcitores o mofets sin excepcion por su mal diseño creo que por eso la placa no fallecio completamente , repito no se hizo overclock ni renderizados se uso normal para trabajar con un tableta digital y dos monitores ps, asi que si tengo tarjetas asus que usan el minimo de 65 watts este procesador usandolo para cosas que no requieren mucha trabjo debio con la solucion de enfrimento liquida trabajar minimo sin problemas por 3 años,pero no fue asi solo duro 5 meses,en mi opinion todo parece ser que este modelo o product lo sacaron precipitadamente sin pasar por todas pruebas de calidad en procesadore core i7-i9, si yo selecione este modelo fue por que otras tarjetas asus se queman rapidamente,pero aun asi el procesador y los coponentes de alto rendimiento le pasaron factura a este diseño,ahorita estoy checkando con un nuevo modelo rog strix y presenta sobre calentamiento en los modulos ram, practicamenta la linea de esta placas esat muy mal integrada tiene puntos de calor con un uso basico a nomal , nunc ahabia visto que por abrir una aplicacion mas un poquina de mas requerimientos presentara punto de calor de 40 a 70 los modulos ram es decir se requiere enfriamamiento liquido para los modulos ram?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cephas Cheong",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on September 29, 2023",
                "reviewTitle": "great buy",
                "reviewText": "featured as expected. recommended with 12th gen i-core.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Qiang",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 3, 2023",
                "reviewTitle": "Good ITX board than reviewer says",
                "reviewText": "Clearly OC is way better than a Msi Z790i, reviewers are not telling truth about this board.Slightly over designed.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "StarkStark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on September 11, 2023",
                "reviewTitle": "Great MB with minor issues.",
                "reviewText": "Issue 1: will bend SSD.Issue 2: not compatible with some AIOs. I have to literally cut a tiny part of my pump to put it in…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Rm0XDzlUL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$225.67",
                "sellerName": "Critical Commodity",
                "sellerRating": "5"
            },
            {
                "price": "$225.67",
                "sellerName": "BeachAudio",
                "sellerRating": "4"
            },
            {
                "price": "$238.92",
                "sellerName": "Triplenet Pricing INC",
                "sellerRating": "4"
            }
        ]
    }
}