{
    "remaining_requests": 42811,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ASUS-Prime-II-Motherboard-Flashback/dp/B08KH12V25",
    "body": {
        "name": "ASUS Prime B450M-A II AMD AM4 (Ryzen 5000, 3rd/2nd/1st Gen Ryzen Micro ATX Motherboard (128GB DDR4, 4400 O.C.), NVMe, HDMI 2.0b/DVI/D-Sub, USB 3.2 2, BIOS Flashback, and Aura Sync)",
        "price": "$79.99$65.56",
        "originalPrice": "$79.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ASUS-Prime-II-Motherboard-Flashback/dp/B08KH12V25",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08PQYYJPF"
        ],
        "asinVariationValues": [
            {
                "asin": "B07FKV5HWJ",
                "variationName": "Style",
                "variationValue": "B450M-A",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08KH12V25",
                "variationName": "Style",
                "variationValue": "B450M-A II",
                "price": "$79.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ZTf40aSuL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51cfj1zGtUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519sMuWEb2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FpcSs375L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-5Abf8TBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uH05Z7B4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 9MyihD1L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1i-sh17t0L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1i-sh17t0L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the ASUS Store",
            "link": "https://www.amazon.com/stores/ASUS/page/02389710-881F-4F25-89E8-F92DEEA14D5A?ref_=ast_bln"
        },
        "brand": "ASUS",
        "merchantInfo": "Ships from and sold by InfinityProduct.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5590,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Friday, February 16. Order within 2 hrs 9 mins",
            "FREE delivery February 16 - 22.",
            "Or fastest delivery February 15 - 21."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "AMD AM4 Socket : Compatible to Ryzen 5000, 3rd/2nd/1st Gen AMD Ryzen CPUs.Operating System : Windows 10 64-bit. Windows 7 64-bit",
            "Designed for Productivity: USB 3.2 Gen 2 with 10Gbps ultra-fast transfer speed, onboard M.2 support, 4xDIMMs support up to 128GB DDR4 with 4400 (O.C.) performance, HDMI 2.0b/DVI/D-Sub",
            "Optimized Cooling: VRM and PCH heatsink with extensive surface, thermal pads help transfer heat from the inductor and phase array to the heatsink. Flexible fan controls for ultimate cooling and quietness with ASUS exclusive Fan Xpert 2 plus",
            "Built to Last: all-round protection with LANGuard, DRAM overcurrent protection, overvoltage protection, SafeSlot Core safeguards and stainless-steel back I/O, 1000 plus compatible devices, 8000 plus Validation Hours",
            "PC DIY Friendly: With BIOS Flashback and ASUS exclusive UEFI BIOS",
            "Outstanding Gaming Audio: Dedicated audio PCB layers, premium Japanese audio capacitors, and audio shielding ensures precision analog/digital separation and greatly reduced multi-lateral interference.",
            "Aura Sync RGB and Armoury Crate Utility: with ASUS Armoury Crate synchronizing LED effects across a wide range of compatible PC gear, plus RGB LED and RGB header for greater customization",
            "Please ensure your BIOS is up to date if installing a compatible Ryzen 5000 series CPU. Visit ASUS site search by motherboard model name, click on “Support” tab, Drivers and Tools, then BIOS and Firmware to download the latest BIOS."
        ],
        "description": "Powered by Ryzen 5000, 3rd Gen AMD® Ryzen™ processors, the ASUS Prime B450M-A II provides the solid foundation needed for your first build, plus flexibility to grow with your ambitions with a robust power design, automated system tuning, comprehensive cooling controls, and immersive onboard audio.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Motherboards",
                "link": "https://www.amazon.com/Motherboards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=1048424"
            }
        ],
        "productInformation": [
            {
                "name": "RAM",
                "value": "‎DDR4"
            },
            {
                "name": "Memory Speed",
                "value": "‎2400 MHz"
            },
            {
                "name": "Wireless Type",
                "value": "‎801.11ac"
            },
            {
                "name": "Brand",
                "value": "ASUS"
            },
            {
                "name": "Item model number",
                "value": "‎Prime B450M-A II"
            },
            {
                "name": "Item Weight",
                "value": "‎2.05 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎9.6 x 9.5 x 2 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎9.6 x 9.5 x 2 inches"
            },
            {
                "name": "Manufacturer",
                "value": "‎ASUS"
            },
            {
                "name": "ASIN",
                "value": "‎B08KH12V25"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎October 1, 2020"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 5,590 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2 in Computer Motherboards"
            },
            {
                "name": "CPU Socket",
                "value": "Socket AM4"
            },
            {
                "name": "Compatible Devices",
                "value": "Gaming Console, Personal Computer"
            },
            {
                "name": "RAM Memory Technology",
                "value": "DDR4"
            },
            {
                "name": "Compatible Processors",
                "value": "AMD 1st Gerenration Ryzen"
            },
            {
                "name": "Chipset Type",
                "value": "AMD B450"
            },
            {
                "name": "Memory Clock Speed",
                "value": "2400 MHz"
            },
            {
                "name": "Platform",
                "value": "Windows 10"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "128 GB"
            },
            {
                "name": "RAM Memory Maximum Size",
                "value": "128 GB"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "ASUS is one of Fortune magazine’s World’s Most Admired Companies and is one of the top motherboard and gaming brands as well as a top-three consumer notebook vendor. ASUS is driven by passion and innovation and dedicated to creating quality products for a future smart life, designing and manufacturing products that perfectly meet the needs of today's digital home, office and person. Our wide portfolio includes MG248Q, Chromebox and a range of devices and components, along with AR and VR. PRIME B450M-A II AMD B450 (Ryzen AM4) micro ATX motherboard with M.2 support, HDMI/DVI-D/D-Sub, SATA 6 Gbps, 1 Gb Ethernet, USB 3.2 Gen 2 Type-A, BIOS FlashBack, and Aura Sync RGB lighting support Comprehensive cooling: VRM heatsink, PCH heatsink, and Fan Xpert 2+ Ultrafast connectivity: M.2 support, 1 Gb Ethernet, and USB 3.2 Gen 2 Type-A 5X Protection III: Multiple hardware safeguards for all-around system protection Aura Sync RGB Lighting: Onboard connector for RGB LED strips, easily synced with an ever-growing portfolio of Aura Sync-capable hardware",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/baf493e7-aaf1-4a52-88f1-8ccb8344545a.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d05e5f5e-0d65-4dcb-8544-a417ee9adb43.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "VRM Heatsink and Thermal Pads A VRM heatsink with an underneath thermal pad improves heat transfer from the MOSFETs for better cooling performance. Cooler by Design Prime B450M-A II is engineered with an array of hybrid fan headers and features comprehensive cooling controls that are configurable via Fan Xpert 2+ software or via the UEFI BIOS, ensuring your rig stays cool and stable under intense workloads. PCIe 3.0 M.2 (up to 32 Gbps) Achieve speed with onboard M.2. M.2 Slot supports up to 22110 and data-transfer speed up to 32Gbps via x4 PCI Express 3.0 bandwidth. It‘s the perfect choice for an operating system or application drive, providing fast access to data.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bede7e38-14fa-4de3-9227-c068fb88bd03.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/13111cba-b411-46bd-a014-4f8a58c8a5aa.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/686dc32d-48ac-4665-a2d3-f6badfdb337b.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "USB 3.2 Gen 2 Type-A Numerous USB ports support high-end rigs loaded with peripherals, including two rear-panel USB Type-A connectors with fast USB 3.2 Gen 2 connectivity for compatible cases. BIOS FLASHBACK BIOS FlashBack is the simplest and safest (UEFI) BIOS update method. Simply drop the (UEFI) BIOS file onto a FAT32 formatted USB stick, plug it into the USB BIOS FlashBack port and press the button. Updates can even be performed without having memory or a CPU installed. SafeSlot Core A fortified PCIe slot prevents damage. SafeSlot Core is the ASUS-exclusive PCIe slot. Featuring a fortified design that's anchored to the motherboard by a special hook, SafeSlot Core provides 1.6x stronger retention and 1.3x greater shearing resistance than standard expansion slots.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3a5ef727-550e-42bd-a153-4aa07d23c449.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7f6dfe73-748c-476f-aebf-28fbf429e0e8.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/42781620-692d-430e-b885-d7ac26d275be.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d831a688-2783-458a-8cc2-aa9bb151da72.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/baf493e7-aaf1-4a52-88f1-8ccb8344545a.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d05e5f5e-0d65-4dcb-8544-a417ee9adb43.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bede7e38-14fa-4de3-9227-c068fb88bd03.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/13111cba-b411-46bd-a014-4f8a58c8a5aa.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/686dc32d-48ac-4665-a2d3-f6badfdb337b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3a5ef727-550e-42bd-a153-4aa07d23c449.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7f6dfe73-748c-476f-aebf-28fbf429e0e8.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/42781620-692d-430e-b885-d7ac26d275be.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d087ac17-09c6-41bf-ac6c-79fbf0caaf4a.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Michelle & David Whetzel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMRDOUWR22MOI55ZFA2JU7BGZZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIDCT272XQAKJ?ASIN=B08KH12V25",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2019",
                "reviewTitle": "5.0 out of 5 stars Review specifically for Linux OS users using the Prime B450M-A and a Ryzen 3/5 3200G/3400G chip",
                "reviewText": "First ever review for me, but felt others (Linux users) might want to know.This board provides good value and it does come (as another reviewer noted) with BIOS 1201. 1201 will let you boot up a Ryzen 3 or 5 3200G/3400G (know that these chips are actually based on last year's 11nm & thus not true 3000 cpu releases). But what non-users of ASUS motherboards might not be aware of or not know is that the BIOS EZ Flash 3 Utility provided by ASUS (inside the BIOS0 does not require an OS to update the BIOS. You ca actually update the motherboard without any hard drive/SSD/etc installed).Upon receiving this Prime B450M-A I immediately put it into a spare case I had lying around, put in a Ryzen 3 3400G I had picked up on Amazon sold for $88, used the provided AMD cooler it came with and it's pre-applied paste (unless you game 24-7, don't listen to the Net chatter about needing brand name, expensive thermal paste), then installed this ram - Crucial Ballistix Sport LT 3000 MHz DDR4 DRAM Desktop Gaming Memory Kit 16GB (8GBx2) CL15 BLS2K8G4D30AESCK (White) along with an totally empty non-formatted new Crucial120GB SSD I had lying around. This was all powered by a Corsair 400W PSU.Before doing anything OS-wise, I started the system up and hit \"delete\" to get into the BIOS. Using the ASUS EZ Flash Utility in the BIOS, which gives you the option of either using your own fat16/32 thumb drive (don't use any other format) or you can use the ethernet Internet connection the board already detects, I immediately updated the BIOS to ASUS' latest BIOS, 1820 (just yesterday I did it again & updated 1823). I then waited as the BIOS restarted itself, then stuck in an Ubuntu 18.04.3 ISO on a DVD (just choose your CD/DVD burner in the BIOS front page as your first boot choice) and hit delete again to get back into the BIOS. I chose my CD/DVD drive as my first boot choice on the first page of ASUS' excellent BIOS, and then it started up. Within several minutes, Ubuntu was completely installed on the SSD (this chip/memory/board is fast), the system rebooted, and I was staring at Ubuntu 18.04.3 where it made my 20\" PC screen the \"primary\" while my 42\" plasma TV was also picked up as the \"secondary\" screen. This is/was great, no messing with that, correct 1920x1080 resolutions too.Since the above (about 9-10 days), I have not had one crash or problem with the board running any version of Ubuntu from 18.04.3 & above. This computer system is in the living room where it gets heavy use by the family and kids for everything, from Netflix streaming, to multi-purpose PC uses, etc (I won't talk of this Ryzen 3 3200G's gaming performance, as it is already well-covered on the Net--at this price, for gaming, it simply rocks and, unbelievably to me, the included cooler handles things quite well--again, as long as the kids don't game 24-7, if that stats happening, which might as they see how fast this system is and what it can handle, I will get a bigger and better cooler to be safe).Also, here's what I found (over the past few days of testing) in terms of what will successfully boot Linux-wise on this Prime B450M-A motherboard using the latest AMD Ryzen 3 3200G chip mentioned above: (you'll notice as I list the successes and failures, the Linux OSes that come with Kernel 5 or above, they all boot up great; the others do not and you will have to perform some tricks and kernel installs to get things going if you use a Linux OS that doesn't come with kernel 5 or above):Successes:Ubuntu 18.04.3 LTS and all 19s 9I tried 19.10 too, worked great)Fedora 31 (Fedora actually seemed to be the fastest out of these 2 successes, but I stuck to Ubuntu for gaming reasons)Failed to boots:Debian 10.1Linux Mint 19 (and version)MX-Linux 19Opensuse LEAP & Tumbleweedetc, etc...(tried about 6 others, all failed because they don't have come with kernel 5 or above).Last thing I want to note is the latest BIOS updates come where ASUS (upon instructions) have disabled PCIe4. This \"disabling of PCIe4\" not ASUS's fault, this is AMD's. AMD is still not enabling PCIe4 on 300/400 series motherboards, and are instructing motherboard manufactuers (if they had enabled PCIe4) to disable PCIe4. AMD, if you know about the Pinnacle Ridge cpu clusterf#ck last year that they are still trying to be clear up completely, this board with the recently released Ryzen 3/5 3000 cpu(s) is a welcome change. ASUS did nothing wrong here. AMD is still saying they are not going to be releasing Linux-specific Ryzen drivers, which is kind of interesting since it was us Linux people who kept AMD afloat back in the dark days when it was thought Intel would crush them & drive them into insolvency. Sure hopes AMD rethinks things, and gets their act together over these next 4-9 months Linux-wise as the truly new 3000 cpus come out next summer.In sum, the ASUS Prime B450M-A board I tested here with a Ryzen 3 3200G cpu and 3000 MHZ DDR4 was a fun, hassle-free build. I also know this board will easily handle and provide a future upgrade path for AMD cpu(s) going forward over the next few years.Hope this review helps any other Linux users out there.",
                "reviewVotes": "129 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRGUOUDESZNJIOMIRVTKUVL62CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OFS178XEHHNW?ASIN=B08KH12V25",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars A good gaming motherboard",
                "reviewText": "This is the low cost gaming motherboard you are looking for for your AM4 processor.Do some planning though (unlike me). I did not take into account how my grossly oversized graphics card (a 3090) was going to hog all the space at the bottom of the board and not leave me any room for my wireless card.I did not remove any stars for that, because it was my own poor planning.For the price point, this was an exceptionally good value. The shipping was fast and I had no issues during installation that wasn't my own damned fault.Fear not, though, my story has a happy ending, because I had several spare USB wireless adapters. Thus, saving me from my own stupidity.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH73JLPARC5TDSSNJ2HSUAMMGBHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H6HW1JXQS8G6?ASIN=B08KH12V25",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Motherboard.",
                "reviewText": "I ordered this motherboard to install a Ryzen 3500x. I was worried that I would have to update the bios but it came already updated for my processor. That saved me time. Happy with the price as well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexandre Soares da SilvaAlexandre Soares da Silva",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG52UZVUVHHCFKCJ5S3LJT3EORCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4OY8OPWFG447?ASIN=B08KH12V25",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2018",
                "reviewTitle": "4.0 out of 5 stars Mobo works great",
                "reviewText": "update: Oct 1, 2018The motherboard works fine, plenty of USB 3.0 ports (I use the pc to run an oculus rift, so I use a lot of the USB ports). I'm running a 2600x on it, with 16gb ddr4 3000 (c15) from corsair, pny 480gb nvme, 1tb ssd (evo 850), a bunch of old hard disk drives, and a Zotac 1070 ti mini. The 2600x seems to be using its full precision boost 2 frequency. Feels (obviously) really fast.I wished this board was available with with a heatsink over the VRM, wifi/bluetooth, and two m.2 slots. It'd be my ideal micro atx board, as I don't want to have an ATX tower (or even a small but wide ATX one). I plan to use an 2700 in it, and I wanted to overclock but not very sure about how stable it'll perform with the weak VRM/no heat sink (and without holes to attach one over the circuitry).At first, I gave this motherboard a vengeful 1 star review, as its manual lacked a diagram about the power/reset button connections. This wasn't my first build, but I was just really annoyed to search for the mapping for power connections without finding it. Nevertheless, the comments about the polarity of the power button were right - it doesn't matter.Now, I'm not totally clueless about electricity and power. I'm used to reading datasheets for projects in college (I'm a computer engineering major), and I still think the lack of proper instructions for the connections - something that generally doesn't happen with sensors and other electronics parts - was frustrating, especially because I was finishing this build in a rush (it was in the middle of the night), so partly my bad. I didn't connect the fact that the power button in a computer was just a push button toggle switch and the reset, just a push button.However, I think it's elitism to think that only people who know these things should be allowed to build a pc without trouble and without professional help. It's the manual's job to help with this, as connections on the motherboard are pretty simple with the other hardware. Gosh, even applying thermal paste is something anyone can do with some care. So no: building a pc should not require professional assembly at all.To give a recent example, I built last year a pc that used the B350 version of this motherboard. That mobo's manual had a simple nice diagram for power connections, so I didn't have to think at all about what they meant when connecting everything and powering up the system.In sum, I'm not an expert, but I'm not a beginner either. So, if I wanted a simple, nice diagram for that, I imagine others would benefit from a diagram printed on the manual, as well. Just like the previous version of this mobo had.And that's my only criticism about this B450 motherboard, because the price is right. Although for those shopping for a ryzen mATX mobo right now, it seems the MSI Mortar has the best VRMs among AM4's mATX (with a heat sink over them, of course). It's likely a better choice for the 2700x and for overclocking the APUs.original review:Incredibly enough, the manual doesn’t state how to connect the power button jumper, and the “diagram” on the motherboard is not very helpful either. Frustating. This process should never be a trial and error thing.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71b7GNVcPoL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71bEhMBib3L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda D. Cano",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEE5ONX6TWB2V7FE4KJX56FNSTHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U6862JBL2BKZ?ASIN=B08KH12V25",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect",
                "reviewText": "Easy to install and works great!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OldDude",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEY6VKWTHK7M4T4FNYTJDPBNX24A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GVXD217IHZUO?ASIN=B08KH12V25",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice Barganio Board!",
                "reviewText": "Easy to install. Fast throughput and the on board video controller is actually usable for gaming. NOT GREAT but serviceable without a GPU.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Walter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAVLHPWRVCDPDHN7T45I7FXZEAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NE8Y4RVM4VUI?ASIN=B08KH12V25",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Good Motherboard",
                "reviewText": "This is a good motherboard to purchase. I am using it with an AMD Ryzen 3 processor chip and 32Gb of RAM memory. Works good. Just remember to update the BIOS after you get the system up and running to take advantage of any updates and glitch fixes that Asus has done since the manufacture of the motherboard.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "It’s okay. the stability needs work 👍",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEA3FTF4CYLJA5IU64SXW27H3HCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R249YT2KFEHODJ?ASIN=B08KH12V25",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Build",
                "reviewText": "It works packaged was delivered safely and good packaging install was easy and it feels like a good borad",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricardo da Motta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 7, 2024",
                "reviewTitle": "Placa mãe",
                "reviewText": "Muito boa essa placa",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 28, 2022",
                "reviewTitle": "Muy buena pero...",
                "reviewText": "Lo único que hecho en falta es la posibilidad de tener mayor velocidad para las memorias ram ya que la más alta sin hacer overclock es de 2666 compre antes desconociendo este dato unas de 3200 ni modo. Igual funciona muy bien y si tienes un presupuesto ajustado como fue el mío conviene para empezar. No recomiendo hacer overclock aunque tu procesador resista la velocidad de la ram más allá de los 2666 da errores. Tampoco pude probar aumentar la vram para graficos integrados pero mejor dejar las cosas lo más de base posible tampoco se le puede exigir tanto por el precio igual vale la pena como algo de entrada.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 12, 2023",
                "reviewTitle": "Using with AMD Ryzen 5 5600G",
                "reviewText": "Very good Motherboard - fits AMD Ryzen 5 5600G perfectly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 14, 2020",
                "reviewTitle": "Great Motherboard",
                "reviewText": "I got this motherboard and a Ryzen 2600. Most of the low star reviews didn’t do their research. First, you should do is go to the Asus site and see if the CPU you want to install is compatible. Also, make sure you know what you’re doing. Go on YouTube watch some videos to understand what you’ll be doing when you get your pc parts. Yes, it only have 2 fan slots and a CPU fan slot. Just get adapters to plug into your power supply and use those to power the other fans in the pc. Make sure you update bios. Don’t know how to do that? SEARCH IT UP. This motherboard is probably the best for its price. If you don’t care much about those crazy RGB lights then get this. Great product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kpopfan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 8, 2020",
                "reviewTitle": "Great",
                "reviewText": "Its good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$79.99",
                "sellerName": "ASUS Store",
                "sellerRating": "4.5"
            }
        ]
    }
}