{
    "remaining_requests": 22295,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Renpure-Coconut-Whipped-Leave-Conditioner/dp/B00JJQ7342",
    "body": {
        "name": "RENPURE Coconut Whipped Creme Leave-In Conditioner, Basic, Fragrance, 16 Fl Oz",
        "price": "$9.15",
        "originalPrice": "",
        "rawPrice": 9.15,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Renpure-Coconut-Whipped-Leave-Conditioner/dp/B00JJQ7342",
        "soldBy": {
            "sellerID": "A4D5Y8E4EMA7J",
            "name": "GKG Wholesale Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A4D5Y8E4EMA7J&asin=B00JJQ7342&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09JZT7RB6"
        ],
        "asinVariationValues": [
            {
                "asin": "B00JJQ7342",
                "variationName": "Size",
                "variationValue": "16 Fl Oz (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "16 Fl Oz (Pack of 2)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "16 Fl Oz (Pack of 3)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00JJQ7342",
                "variationName": "UnitCount",
                "variationValue": "16",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "UnitCount",
                "variationValue": "32",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "UnitCount",
                "variationValue": "48",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 dP8RRAnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41LTwdz9b-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xgYfKbxOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PhA0oSnIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417fu2J9mFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NLtn6m7gL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the RENPURE Store",
            "link": "https://www.amazon.com/stores/RENPURE/page/CC916259-9BC9-4CDD-BF27-9CD627867A5F?ref_=ast_bln"
        },
        "brand": "RENPURE",
        "merchantInfo": "GKG Wholesale Direct",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 18898,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LEAVE-IN CONDITIONER: Coconut water's natural oils absorb instantly into the hair fiber delivering conditioning oils & vitamins to the inner cuticle while moisturizing & smoothing the outer cuticle.",
            "VITAL MOISTURIZING: Coconut oil delivers vital moisture & nutrients to dry, damaged hair. It conditions while sealing in moisture, smoothing the cuticle & creating smooth, silky, frizz-free hair.",
            "THE RENPURE COLLECTION: Try our full collection of responsibly sourced & ethically produced products for gentle cleansing from head to toe, from nourishing conditioners to dry shampoos to body washes.",
            "GENTLE & NOURISHING: We use gentle, plant-based cleansers with carefully chosen ingredients like tea tree oil, argan oil, shea butter & coconut to create nourishing, safe formulas for our products.",
            "PLANT BASED BEAUTY: We’ve been making plant-based beauty products since day one. Our hair & body care products are free from sulfates, parabens, dyes, gluten, phthalates, propylene glycol & bad vibes."
        ],
        "description": "Coconut water's natural oils absorb instantly into the hair fiber delivering conditioning oils and vitamins to the inner cuticle area while also moisturizing and smoothing the outer cuticle, leaving a smooth, shiny, and frizz-free surface. Coconut oil has a unique microstructure that penetrates the cuticle layer delivering vital moisture and nutrients to dry damaged hair. Coconut oil conditions while sealing in moisture, smoothing the cuticle and creating smooth, silky, shiny hair.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Hair Care",
                "link": "https://www.amazon.com/Hair-Care-Products-Beauty/b?ie=UTF8&node=11057241"
            },
            {
                "name": "Shampoo & Conditioner",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17911764011"
            },
            {
                "name": "Conditioners",
                "link": "https://www.amazon.com/Hair-Conditioner-Products/b?ie=UTF8&node=11057251"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.75 x 2.75 x 7.63 inches; 1 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ SG_B00JJQ7342_US"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 885897951358 810333020374 787734626385"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Renpure"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00JJQ7342"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,446 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #230 in Hair Conditioner"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 18,898 ratings"
            },
            {
                "name": "Brand",
                "value": "RENPURE"
            },
            {
                "name": "Item Form",
                "value": "Liquid"
            },
            {
                "name": "Material Feature",
                "value": "Natural, Plant Based"
            },
            {
                "name": "Hair Type",
                "value": "Damaged"
            },
            {
                "name": "Product Benefits",
                "value": "Frizz Control, Conditioning, Heat Protection"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Professional Collection Coconut Oil is a rich source of essential vitamins, saturated fats and minerals. We’ve taken this amazing ingredient and added it to our Professionals Line. This Coconut line is specially developed for hair that needs a little extra love and moisture. Designed to help restore strength and hydration, leaving hair softer with a beautiful natural shine.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3f6c0200-9c04-4ae3-acd3-cc588ca7a35d.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "About Renpure We believe that whatever a chemical can do, a plant can do better. Renpure delivers gently-sourced ingredients that never promises performance. Naturally inspired products does not mean sacrificing performance. Replacing harmful ingredients with equally effective clean alternatives is what inspires us. Safe, affordable and effective products for the family that stays within budget.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/35d433c0-f077-4768-8d51-06332525c854.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/14718158-0928-488b-9662-370d8f1c5075.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3f6c0200-9c04-4ae3-acd3-cc588ca7a35d.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/174173a1-7835-43a4-bfcf-6089ba57e04f.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f70d3b50-751e-40cf-9811-67682b8c9833.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/35d433c0-f077-4768-8d51-06332525c854.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Aisha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHCZONIQXSJPUHVMP4JZHUFTS2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20GV13258XSG8?ASIN=B00JJQ7342",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2016",
                "reviewTitle": "5.0 out of 5 stars Great for my 4a hair - Wash and Go with virtually no shrinkage",
                "reviewText": "This stuff is awesome for my 4a, thick, natural, never chemically altered hair. I have never really been able to achieve a curly wash-and-go style without experiencing at least 70% shrinkage by the time my hair is done air drying, and many products designed to help eliminate shrinkage for wash-and-go wearers have the down-side of make it take up to 3x as long for your hair to air dry. I used this leave-in together with theRenpure Coconut Creme Curling Jelly Styling and get a beautiful. elongated, bouncy, curly wash-and-go with only about 10 - 20% shrinkage. Plus, it doesn't lengthen the time it takes for my hair to air dry - in fact it seems to dry more quickly. Using both products does make my hair a bit \"crunchy\", but applying a bit of olive oil after it's dry (and on 2nd and 3rd day hair) not only eliminates the crunch, but gives me springing, bouncy hair. I haven't yet attempted a wash-and-go with the leave-in alone. This is how I've used this product: wash and condition my hair in the shower (I put my hair into about 8 braids for washing), then towel dry minimally. Divide my hair into about 8 - 10 sections and apply a quarter sized amount of this leave-in to each section (I have thick, butt-length when stretched hair, so this is the amount of product that I need to use). I apply it in a downward motion from root-to-tip; only moving in that one direction. Then, I comb through each section with a regular-tooth comb to make sure there aren't any tangles. At this point with just the leavein my hair will feel very soft and looks shiny. I follow with the Renpure Coconut Creme Curling Jelly Styling before moving on to another section, again applying the same amount, in a downward, tugging-like motion - only moving in the downward direction. That's it. For me, it takes a bit of time before my hair will clump out into bigger spiral curls and it doesn't look like much after I first apply. I just leave it alone and allow it to air dry, and it begins to form beautiful, stretched curl clumps as it dries. Ultimately, the shrinkage factor is drastically reduced. When I press my hair straight it is butt-length, when I do a wash-and-go with this method it dries to just above waist length. In contrast, every other wash-and-go method I've used leaves me with shoulder-length at best - so I've always had to do twist sets to get a more elongated look. The 2 drawbacks of this method and product are: (1) The coconut fragrance is very noticeable. Not unpleasant, but definitely noticeable and it doesn't wear off as readily as most fragrances in hair products will. I personally like the fragrance, but I do wish it wore off a bit faster. (2) Following with the Renpure Coconut Creme Curling Jelly Styling will leave your hair feeling \"crunchy\" when it dries. I haven't ever attempted to style my hair with the leavein alone, but the consistency on wet hair makes me think that it would remain soft. It isn't an extreme crunch like mousse, but it does feel hard. I apply olive oil once my hair it completely dry and the crunch goes away, leaving me with soft, bouncy curls. At night I put my hair in a bun, and then take down the bun and finger comb with olive oil for day 2 and day 3 if I want the wash and go to last that long. I really love this product.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emile Mccay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFL6BRFEE7V3S3SL3VNQTKTUUXTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M01RHPJWBSH7?ASIN=B00JJQ7342",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2020",
                "reviewTitle": "5.0 out of 5 stars Absolutely love—4D hair, very delicate hard to care for",
                "reviewText": "I love it. I’ve got sensitive skin and the coarsest, coiliest hair variety out there (4D) meaning super super tight curls and proneness to tangling. The rare difficulties of my hair being both super coarse and super fragile, combined with my sensitive reactive skin and particularness about substances that get on my hands, have sent me on a lifelong journey of trying to find something—anything—that began to deliver service to me, the seemingly forgotten specimen. I hate getting thick or unpleasant-scented products on my hands throughout my day. I’m very active and I don’t want to be weighed down. I don’t want to feel like my pores are clogged or like I need a wash after touching my hair, which seems inevitable in ordinary day to day life, mainly due to the inevitable scratch. I HATE going for a short simple scratch and getting heavy product on my hands, then I touch my phone and it gets oily or I touch my eye or something terrible like that. I got to a point where I just didn’t put anything in my hair because all the products I’ve tried were either too heavy, or if they were light, they would seem to get drained by my unquenchable hair or just get wiped off.This product is a game changer for me. I’ve spent so much of my life hating touching my hair because it is so tangled and delicate, and I hated the touch and smell of almost everything. But this product is light, it smells heavenly, it’s got more naturally-minded ingredients, and it works wonders for my mystery hair. After shampooing and conditioning, I towel squeeze dry in vertical sections similar to how you would part your hair for a cornrow (maybe 8 or 10 rows across). Then, when my hair is still wet but not dripping, I smooth little pumps of this product on the hair on either side of the part. This helps ensure thorough distribution through the thickness of my hair. My oh my, the product stays in the whole week, but is not heavy, and when I touch my hair here and there in ordinary life, *nothing comes off onto my fingers,* which is a massive landmark in my personal hygiene history. Because my hair is so delicate, it is not ideal for me to twist it at night before I go to bed (this would be constant twisting and untwisting of fragile hair—plus I’ve always hated sitting down to put so much time into hairdos every day. I’m active and I love simplicity, and really it seems like too much work that I’m not personally interested in, so really I don’t think I would ever want to sit down and do my hair like that every single day. Not for me) Because of the high compressibility of my hair, it gets matted down at night. It has been a nightmare through most of college waking up with a compressed afro, and having the typical ordinary morning drudgery, and not wanting to touch my hair because it has some unsavory substance in it, or because I HATE putting water on it in the morning to help soften it so I can inflate it (it is a feeling akin to how cats feel about getting sprinkled with water). The only alternative for me has been to have a poorly inflated afro, because it was just too dry to get it rounded and elongated nicely. THIS PRODUCT, after I have worked it in from my hair wash, just gets delightfully activated when I put a little hot water in it with my fingers, and finger part the same way I mentioned above, cornrow style. It comes to life and I can feel that it has deeply and flatteringly lubricated the deep wiry network deep within the flattened afro, and it is SO much easier to get that elongation in quickly and efficiently in the morning, without adding a single other product throughout the whole week. I just dampen the hair, part and fluff it out, and then maybe round it off with my pick. It has made hair preparation so easy, so light and refreshing and delightful for me, and that’s a huge deal for someone who has spent 21 years hating dealing with their hair. The light, hydrating, fragrant nature of this product really lifts me up and makes working with these coils a charming breeze. It is so simple, feels so clean, doesn’t suffocate or irritate my scalp, and smells so good I would be happy for people near me to get a strong whiff of my hair. Not just happy—I would be PROUD. This product is a game changer. For anyone out there with delicate, challenging-to-grow super coarse hair, try this you may find your hair care answers here.",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBWU4N3VDPRLFB7HMCE5QUUMSLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31MON0ITSEIZM?ASIN=B00JJQ7342",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Smells great, and is very moisturizing",
                "reviewText": "Great leave in conditioner. Great value for the money. I love the smell",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kitty Lynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3GR5ANNZN34PAHJETRXFM6JP6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UQRP9687SXJ1?ASIN=B00JJQ7342",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "4.0 out of 5 stars Great Product, But Not Right For My Hair Currently.",
                "reviewText": "I used a similar leave in conditioner years ago, when my hair was bleached and toned to platinum blonde, and it truly saved it. Fast forward to now; I'm no longer bleaching my hair, but I do color it, so my hair can be a bit dry and frizzy at times (age is a factor in this too). I've always preferred leave ins, and after reading about it, thought I'd give it a try.This conditioner would probably be perfect for me if I was still bleaching my hair, and even though my hair can be a bit dry sometimes, it's clearly not as dry as I thought. Even if I only use the smallest amount, this product weighs my hair down, and makes it very greasy (a problem that I haven't had with my hair naturally since I was a teenager).Despite it not being right for me, I still felt the need to rate it highly. If you have very dry hair, or depending on your hair type, this leave in would be perfect for you. Also, it smells great too.Bottom line...be very sure about just how dry your hair is before purchasing!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. J.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEORSJFBNHDSRWUZUNVO4EEEJLWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD8RZY98R5HOX?ASIN=B00JJQ7342",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Works even on my very fine, short hair",
                "reviewText": "I bought this with quite a bit of skepticism. I was afraid that using a leave-in conditioner would make my hair look oily and flat, especially since my hair is very short and fine. I am happy to say that using the conditioner has left my hair soft, shiny, and it even gave my hair more body. Even my hair dresser noticed how soft my hair was; and, at 67+ years old, my hair definitely looks and feels healthier than before. Of course, I still have to be careful not to use too much; and I have to wash my hair a little more often, but I don't mind because of the positive results I am seeing.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stacey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 11, 2023",
                "reviewTitle": "Amazing product",
                "reviewText": "Not only that it smells so good, it works amazingly well! I love how it works in my hair!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lulu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 15, 2020",
                "reviewTitle": "excelente producto!!",
                "reviewText": "Producto con aceites que realmente nutren el cabello. Bravo Renpure!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wang Yuyan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on August 24, 2021",
                "reviewTitle": "It works!",
                "reviewText": "It's by far the best leave-in conditioner that worked for my hair!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 2, 2017",
                "reviewTitle": "must try",
                "reviewText": "leaves hair soft and touchable not crunchy like most products meant for curly hair, would definitely recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "martine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 14, 2022",
                "reviewTitle": "Awesome for curly hair!",
                "reviewText": "I’m always looking for product to help with my curls and this one definitely does! I scrunch it in to the bottom, not roots, let it dry a little then diffuse. Crazy curls!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.14",
                "sellerName": "Wisermerchant",
                "sellerRating": "4"
            },
            {
                "price": "$9.16",
                "sellerName": "MCP Supplies",
                "sellerRating": "5"
            },
            {
                "price": "$19.96",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}