{
    "remaining_requests": 22497,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hydrating-Argan-Conditioner-Arvazallia-Damaged/dp/B00I32AN4K",
    "body": {
        "name": "Arvazallia Hydrating Argan Oil Hair Mask and Deep Conditioner for Dry or Damaged Hair - 8.45 Oz",
        "price": "$12.30$12.30 ($12.30$12.30 / Count) $11.66$11.66 ($11.66$11.66 / Count)",
        "originalPrice": "$16.99",
        "rawPrice": 12.3,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hydrating-Argan-Conditioner-Arvazallia-Damaged/dp/B00I32AN4K",
        "soldBy": {
            "sellerID": "A1FHA8K6WN6TYP",
            "name": "Lyfe and Style Goods",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1FHA8K6WN6TYP&asin=B00I32AN4K&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51KpmxinYYL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51l4W0SfgHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sDpsLHBcL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B18cOcnm2oS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B18cOcnm2oS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Arvazallia Store",
            "link": "https://www.amazon.com/stores/Arvazallia/page/FC2B6F1A-51B3-467E-B64A-9292A19ECFCD?ref_=ast_bln"
        },
        "brand": "Arvazallia",
        "merchantInfo": "Lyfe and Style Goods",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 56304,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 55 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 55 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Friday, February 16. Order within 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Deeply hydrates and moisturizes dry, damaged hair leaving it soft, silky, and easier to manage",
            "Repairs and restores weak, overprocessed hair improving texture, elasticity and shine",
            "Infused with argan oil to nourish hair with essential vitamins and nutrients",
            "Sulfate-free and paraben-free, suitable for all hair types including permed, natural and curly"
        ],
        "description": "You're About To Fall In Love With Your Hair Again! You'll Love How Soft, Silky, And Easily Manageable Your Hair Is. Whether you have hair that is dry and damaged or just in need of moisturizing and deep conditioning, Arvazallia Hydrating Argan Oil Hair Mask will Reinvigorate & Revitalize your hair leaving it Soft, Silky, Shiny, and Easier to Manage. This Premium 5 Minute Hydration and Restoration treatment will make you Love the way your hair Looks, Feels, and Smells. Salon stylists and customers Love Our Hair Mask because it Deeply Conditions, Hydrates, and Moisturizes Hair Giving it a Soft and Silky Texture. It Repairs, Restores, and Strengthens weak, damaged, and overprocessed hair. It also Revives Dull and Dry Hair Improving its Manageability and Elasticity and gives it a Beautiful Shine. Further it Nourishes Your Hair with the Highest Quality Cosmetic Grade Argan Oil Rich in Essential Vitamins and Nutrients. It also Protects and Shields Hair from Damage Caused by Heat Styling. After you begin using Arvazallia Hydrating Argan Oil Hair Mask, You'll Absolutely Love how your hair Looks, Feels, and Smells. Our professional series premium quality formulation is considered the best Argan oil hair mask treatment by salon stylists and customers around the world so We Know You'll Love it Too! This treatment is packaged with a self-sealing cap. New units of this product will have a secured cap and will be sealed with shrink-wrap however will not contain a lid or additional seal below the cap.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Hair Care",
                "link": "https://www.amazon.com/Hair-Care-Products-Beauty/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11057241"
            },
            {
                "name": "Hair Masks",
                "link": "https://www.amazon.com/Hair-Treatment-Masks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10666437011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3.94 x 3.94 x 3.15 inches; 8.4 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ MAHM"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 757901880568"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Arvazallia"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00I32AN4K"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#135 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #2 in Hair Treatment Masks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 56,304 ratings"
            },
            {
                "name": "Brand",
                "value": "Arvazallia"
            },
            {
                "name": "Item Form",
                "value": "Cream"
            },
            {
                "name": "Material Feature",
                "value": "Natural"
            },
            {
                "name": "Hair Type",
                "value": "Dry"
            },
            {
                "name": "Product Benefits",
                "value": "Sulfate Free, Paraben Free"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Megan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAET3YQ2M47RSB22HUTKPYIJPKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RVDGPQZOTZIL?ASIN=B00I32AN4K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Good!",
                "reviewText": "This product has truly transformed my hair and I cannot recommend it enough.Before discovering this incredible hair mask, my hair was dry, brittle, and damaged from years of heat styling and chemical treatments. I had tried countless products claiming to repair and hydrate my hair, but none of them seemed to make a noticeable difference. That is until I stumbled upon Arvazallia's Hydrating Argan Oil Hair Mask.From the very first use, I could feel a significant improvement in the texture and appearance of my hair. The mask is incredibly nourishing and deeply hydrating, leaving my hair feeling soft, silky, and rejuvenated. The argan oil in the formula works wonders in restoring moisture and repairing damaged strands.What I love most about this product is its versatility. Whether I leave it on for just a few minutes or indulge in a longer treatment, the results are always impressive. It effortlessly detangles my hair, making it easier to manage and style. I also appreciate that it doesn't weigh my hair down or leave any greasy residue behind.Another standout feature of the Arvazallia Hydrating Argan Oil Hair Mask is its pleasant scent. It has a subtle, luxurious fragrance that lingers in my hair, making me feel like I just stepped out of a high-end salon. It truly adds a touch of indulgence to my hair care routine.I have been using this hair mask for several months now, and I can confidently say that it has transformed my hair. My once dry and damaged locks now appear healthier, shinier, and more vibrant than ever before. I receive compliments on my hair regularly, and I owe it all to Arvazallia's Hydrating Argan Oil Hair Mask.In conclusion, if you are struggling with dry or damaged hair, I highly recommend giving the Arvazallia Hydrating Argan Oil Hair Mask and Deep Conditioner a try. It is a game-changer that will restore and revitalize your hair, leaving you with stunning, salon-worthy results. Trust me, you won't be disappointed.",
                "reviewVotes": "112 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MomoMomo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4T36S4DIBUMIVMZQ7AGZSBEJ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1508NI0D32FPC?ASIN=B00I32AN4K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent hydration and adds so much softness!",
                "reviewText": "This hair mask has been excellent for my hair in just a few weeks. It arrived in very good condition, with no leakage or mess and the results are impressive.My hair is prone to brittleness, especially during the Wintertime, but has been feeling so much better since I started using this hair mask. The mask has reduced breakage, making my hair stronger and more resilient. The hydration is exceptional, which has been bringing back softness to my hair. What's truly amazing is the newfound shine – my hair looks healthier and more vibrant than ever. The scent is subtle but pleasant, without being overpowering.Incorporating this mask into my routine has been extremely helpful. If you want a quick and noticeable hair transformation, this product is worth the investment.It says on the product to use it around 2 times per week, but I only use it once a week, and look at the shine! The pictures of my hair that I took are after using the product 3 times. I hope it helps you like it helped me :)",
                "reviewVotes": "52 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/716oSnuEK3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71IYX-yM45L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71l4BKNwfQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pR4oG7dwL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HeatherErin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG33WVDBPK6UQFQYFP6PA5FQNPCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37PCL60RCHKKG?ASIN=B00I32AN4K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Smells good, works well!",
                "reviewText": "I recommend trying this mask, and I’m delighted to explain why!First, it smells nice. The description I’m about to give may seem off-putting, but trust me when I say that is all me and my skill in description, not the product. The scent is, for lack of a better description, “sophisticated bubblegum.” There is a top note that is sweet and smells a bit like lotus, hence the bubblegum, but then there’s warmth to it, with something slightly woody and herbal, and a gentle but not powdery musk base. It smells good, like sniff-your-hair good, but it’s not overpowering.Then, the slip! Yes, there are -cones in this product, hence only using it once or twice a week. I know as a curly person I’m supposed to rear back in horror, bare my teeth, and hiss if a product that has -cones comes near me, but y’all, I’m color-treated and porous. I want some sealage! Furthermore, I’m thinking that if you’re trying to comb out a situation—and I’m talking matting, I’m talking gum, I’m talking creepy-crawlies, I’m betting the slip in this would stand up and take a bow after just sliding all your troubles away.Finally, the results. As y’all know, sometimes you need protein, sometimes you need moisture, and sometimes you need to stay away from both—protein making you brittle, or humectants like glycerin that’ll either suck the moisture back out of your hair shaft or suck so much in from humid air that you’re either electrifying the world with static or turning into a swamp poodle. Yes, I have been to those places and it is lonely and frizzy. This, however, is not a protein mask or a moisturizing mask, it’s a sealing mask. Yes, you can use protein or moisture before you use this, but this is just going to lock that underneath it and to your hair. If you’re looking for a good mask to layer on your ends, for example, here you go!Buy and enjoy!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl RiceCheryl Rice",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOPIGZEH6E7GMW55TZOKPNQH5JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11IYRVJOMCL4F?ASIN=B00I32AN4K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "4.0 out of 5 stars Smooths and softens so hair is more manageable",
                "reviewText": "I have thick 3B hair while it's wet, then it goes to 4K or something undefined. This was my second time using this conditioner. After the first use I combined it with some other oils and presses and really couldn't tell what it did for my hair. This time I used it after shampooing with Pantene. I left it on a couple of minutes and rinsed. I liked that it smoothed my hair cuticles. After slightly towel drying my hair felt soft and there was no frizz. The pictures show one side after blow drying on high heat. I have thick hair as I stated and it takes more heat to dry it prior to styling. I was pleased with the results! It only took 6 minutes to dry both sides. My blow dryer has the comb attachment which helped dry the roots. I didn't give 5 stars because the jar was 3/4 full and it was hard to remove the plastic covering after taking off the lid. Overall a good conditioner. I would buy it again and recommend it to family and friends.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71HyAVUai-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71JHxjSh3XL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71TeNsa0EgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Y76DJ8p8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Silviafit",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 21, 2023",
                "reviewTitle": "Funcionalidad",
                "reviewText": "Me dejó el cabello muy sedoso, manejable . Si vale la pena comprar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Inese",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 9, 2024",
                "reviewTitle": "Love it.",
                "reviewText": "My hair love it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 23, 2023",
                "reviewTitle": "Seal pack tamper proof",
                "reviewText": "Fresh with long expiry date.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hanzade",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 6, 2023",
                "reviewTitle": "Very soft hair",
                "reviewText": "This one of the best hair mask I used recently.Untangle the hair easily, leaves it very soft and shiny.Avoid roots to not get grease quickly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 31, 2022",
                "reviewTitle": "Top Produkt",
                "reviewText": "Kann man nur empfehlen, das Produkt ist von guter Qualität und riecht auch gut.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$12.95",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}