{
    "remaining_requests": 434,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Smart-Garage-Opener-Chamberlain-myQ-G0401/dp/B08GD3D9YJ",
    "body": {
        "name": "CHAMBERLAIN Smart Garage Control - Wireless Garage Hub and Sensor with Wifi & Bluetooth - Smartphone Controlled, myQ-G0401-ES, White",
        "price": "$24.98",
        "originalPrice": "$29.98",
        "rawPrice": 24.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Smart-Garage-Opener-Chamberlain-myQ-G0401/dp/B08GD3D9YJ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CV15P95T"
        ],
        "asinVariationValues": [
            {
                "asin": "B08GD33GQR",
                "variationName": "Style",
                "variationValue": "Garage Door Sensors",
                "price": "$20.06",
                "variationImageURL": ""
            },
            {
                "asin": "B093Z8FPG6",
                "variationName": "Style",
                "variationValue": "Smart Camera",
                "price": "$39.00",
                "variationImageURL": ""
            },
            {
                "asin": "B08GD3D9YJ",
                "variationName": "Style",
                "variationValue": "Smart Garage Control (New Version)",
                "price": "$24.98",
                "variationImageURL": ""
            },
            {
                "asin": "B075H7Z5L8",
                "variationName": "Style",
                "variationValue": "Smart Garage Control (Old Version)",
                "price": "$42.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41M1thWlqPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51kcw-5Vc0S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51USVz0n5-S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bqwi2SAMS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yZeJrPYNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51z7JlH8hTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81SqWD8a VL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a9b449b-303a-4218-9fb2-d6d9d05a8337/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b0d6bd4c-8250-486d-80c7-d8f4e0fa7557/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8510092f-19d8-4294-b039-4306caa92b00/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e36e7dec-00c4-4ab5-95f1-cc63b76be13b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf8f28f6-5225-4d8b-95ab-162526e04635/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a02c097-7ec9-46f5-8bfa-b3d480b0de7a/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1BlLqdvlYL.pdf",
            "userManualLink": "javascript:void(0)"
        },
        "byLineInfo": {
            "name": "Visit the CHAMBERLAIN Store",
            "link": "https://www.amazon.com/stores/Chamberlain/page/30C32495-5FC7-4D90-98E4-D6F8C923DA1B?ref_=ast_bln"
        },
        "brand": "Chamberlain",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 97410,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 20 hrs 55 mins",
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 20 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "“Did I shut the garage” No more worrying.",
            "Open or close your garage from anywhere. Simply download the free myQ app for iPhone or Android and get connected with your very own Smart Garage",
            "Works with Amazon Key In-Garage Delivery—an exclusive Prime member benefit that protects your Amazon packages.",
            "Give access to family or friends while on the go",
            "Never worry if the garage is closed at night by setting a close schedule",
            "1. Works with most brands of garage door openers manufactured after 1993 that use photoelectric sensors that do not shut off. It is not intended for use with openers in which the photoelectric sensors located near the bottom of the garage door change power mode (e.g., lights on the sensors turn off after the door is closed), or any Chamberlain Group opener with a yellow learn button manufactured between 2010 and 2021, or any Linear opener.",
            "System Requirements: a router with 2.4 gigahertz Wi-Fi frequency, router with 802.11 B/G/N, a router within 50 feet of the Smart Garage Control (more details in PDF user manual). Must have a sectional garage door. Product certified for use in US only. Bluetooth makes setup easier than ever.",
            "Control a second door with additional sensor (sold separately on this page)."
        ],
        "description": "The Simple Way to a Smarter Garage. Make your existing garage door opener smart in minutes with Smart Garage Control. The Smart Garage Control is simple to install and allows you to link your existing garage door opener to the myQ App so you can control, secure and monitor the garage from your smartphone. Featuring a compact modern design, Smart Garage Control is compatible with all major brands of garage door openers manufactured after 1993 that have standard safety sensors. It’s sleek white finish blends in with ceilings, walls and garage doors, making it an aesthetic complement to any garage environment.Once paired with the myQ App, it offers more than the ability to simply open and close a garage door.Homeowners with Smart Garage Control benefit from on-the-go management of daily activities, like never having to wonder if the garage door was left open, receiving real-time alerts when children arrive home from school, remotely letting in the dog walker or service person and now in-garage delivery to keep packages safe and secure.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b?ie=UTF8&node=502394"
            },
            {
                "name": "Video Surveillance",
                "link": "https://www.amazon.com/Video-Surveillance/b?ie=UTF8&node=7161091011"
            },
            {
                "name": "Surveillance Cameras",
                "link": "https://www.amazon.com/Surveillance-Cameras/b?ie=UTF8&node=898400"
            },
            {
                "name": "Bullet Cameras",
                "link": "https://www.amazon.com/Bullet-Cameras/b?ie=UTF8&node=14241331"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "0.8 x 2.6 x 2.6 inches"
            },
            {
                "name": "Item Weight",
                "value": "13.1 ounces"
            },
            {
                "name": "ASIN",
                "value": "B08GD3D9YJ"
            },
            {
                "name": "Item model number",
                "value": "MYQ-G0401-ES"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Metal batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 97,410 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6 in Bullet Surveillance Cameras"
            },
            {
                "name": "Date First Available",
                "value": "August 20, 2020"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Chamberlain"
            },
            {
                "name": "Country of Origin",
                "value": "India"
            },
            {
                "name": "Brand",
                "value": "Chamberlain"
            },
            {
                "name": "Special Feature",
                "value": "Universal"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Max Number of Supported Devices",
                "value": "1"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Turn your Garage into a Smart Garage Never wonder if you left your garage door open again.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/de295c63-4c44-4670-ac59-96b405f7387d.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "Popular Features Amazon Key In-Garage Delivery Packages and groceries delivered conveniently and securely inside your garage. Real-time notifications Get alerted anytime your garage door opens, closes or is left open. Control from anywhere Open and close your garage from your smartphone. Access sharing Securely invite up to three people to control your devices with myQ Guest.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/97fbff0f-71ac-4140-a15d-00843a783404.__CR0,18,1492,1119_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/a02a39f3-4bfb-404e-b3f8-1c9f3d1fd95a.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/d051b033-4738-487c-8a1e-e298cfa7de0b.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/90c33d12-05d1-403d-bfa1-a5fcdd4a66b7.__CR0,0,300,225_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Amazon Key In-Garage Delivery",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/de295c63-4c44-4670-ac59-96b405f7387d.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/97fbff0f-71ac-4140-a15d-00843a783404.__CR0,18,1492,1119_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/a02a39f3-4bfb-404e-b3f8-1c9f3d1fd95a.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/d051b033-4738-487c-8a1e-e298cfa7de0b.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/90c33d12-05d1-403d-bfa1-a5fcdd4a66b7.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dad7545f-b797-4c96-aceb-60c35af4b81c.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ronald EpsteinRonald Epstein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLBDKWRQHZVKVWRF5TOJJAI4WJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMR02ZBMTAVEE?ASIN=B08GD3D9YJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 25, 2019",
                "reviewTitle": "5.0 out of 5 stars Works well but here's a way to make it work better...",
                "reviewText": "Let me start by saying I was on the fence for months as to whether I should actually buy this Garage Door opener from MyQ. The reviews on Amazon were very mixed and I wasn't too pleased that once I bought into this product, I would probably have to spend more. I will talk about that in a moment.I actually decided to make a purchase during Prime Day when the cost of this item sold for about $20 less than it regularly does. It seemed like an absolute bargain at that point.The installation was very simple. The mounting was a bit of a nightmare only because MyQ didn't fully explain that process in their directions.The installation process is a breeze, thanks to the mobile app which does an excellent job of walking you through the process, complete with videos that make a novice like me an expert. You basically use the app to pair the base unit and the sensor. The sensor comes with two-sided tape and gets placed on the inside of your garage door.The problem I ran into was the screws. MyQ provides you with 2 different sized sets of screws. They don't tell you that if you use the anchors, you must use the shorter screws. I used the longer ones. Now, I am sure most of you who are more handymen than I am probably could have figured that out on your own, but for someone not as mechanically inclined, it would have been nice for MyQ to give a better explanation of screw usage in their instruction manual. Once I undid the initial mistake, I was able to successfully mount the MyQ to my garage ceiling beam.One other note to make here: The mounting bracket is also a bit of a problem. You have to go through two sets of holes to drill in your screw. It's a little cumbersome. I wish the bracket was designed a little better to make it easier. I am guessing this was the best MyQ could do. All in all, I am not taking any stars away in this review for the clunky install and bracket. I am guessing most of you who are more handymen orientated won't have an issue.So, once installed, the garage opened and closed as expected using the remote. No issues there.The real nice surprise here was that, for the moment, MyQ is no longer charging people $10 a year to integrate MyQ with Google (and I think) Alexa. Previously, there was a subscription charge. That caused a huge amount of backlash from customers. I even swore I would not buy this product if a subscription was mandated. Well, for now, that subscription has been put on hold. You can get free integration for your smart device. Be aware that for the moment MyQ is saying this could be only temporary.Voice integration with Google Home Hub is not as fluent as you would hope. You can't just say, \"Hey Google, is my Garage Door open?\" of \"Hey Google, close my garage door.\" You have to say, \"Hey Google, ask MyQ if my Garage Door is Open.\" I am not exactly happy about that extra step.Also, do realize that there are extra security measures put in place that prevent homeowners from giving smart devices opening commands. You can't say, \"Hey Google (or Alexa) open my Garage Door.\" The reason behind this is so burglars can't yell that command from outside your home in hopes of your smart device picking it up.HOWEVER....HOWEVER...HOWEVER...There is a new, free software workaround that allows you to open and close your garage door through Alexa (and probably Google) commands. You don't need to buy the $15 kit. If you want more information you can reply to me in the comments.One other thing I need to mention here. If you want iOS/Homekit support you need to buy the additional $90 MyQ bridge. I found that aspect to be unfortunate as that add-on is severely overpriced. I will end up purchasing it just so that I can open and close my garage door using the new iOS 13 Carplay functionality which puts Homekit on your navigation screen. It would be great, as I arrive home to say, \"Hey Siri, open my garage door.\"So, bottom line: The MyQ garage door opener works great out of the box. Some of its smart home command functionality is limited, but there are workarounds.",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/716ED1w8sBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71dDrCsj1aL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HighSierra49er",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUS67WQT7KMUJKXUSLFJSR5JJGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20WPE5UL5WA31?ASIN=B08GD3D9YJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy installation and an inexpensive way to upgrade a garage door opener to operate with MyQ.",
                "reviewText": "Good instructions along with watching a You Tube video of the installation process made the work go quickly. I was initially having a wi-fi problem getting the equipment to link up with the MyQ app. so decided to bring the hub into the computer room, plug it in, and finish up the linking with my phone app and then took the hub and sensor to the garage for the installation and all went very well. It became almost as simple as plug & play. Works great. I installed this Smart Garage Control along with a new Liftmaster wall unit for openers with the older purple learning button. Enjoy having the automatic timer to shut the garage door and also having e-mail alerts every time the garage door opens or closes, courtesy of this Smart Control. The door sensor is battery powered and we get an alert when the battery is low, so another nice feature. The inexpensive quarter-size 3 volt battery (CR2450) should last a year or more and takes all of about two minutes to replace. Never thought I could get a 2009 model Liftmaster with a purple learning button to have all of the features of the newest wi-fi model Liftmaster. I do have a newer Liftmaster opener near this 2009 model and both now work identically. Great value for what is offered. Much less expensive and a lot less work than purchasing a new door opener with the MyQ features.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDBGGACOCIUWRQXPF22RP46ELVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UKM0B9O71I3N?ASIN=B08GD3D9YJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Simple, fast, great product!",
                "reviewText": "I bought this product about 9 months ago. I have an older Chamberlain garage door, this was the perfect pairing. I can open my Garage Door from my phone. I can add multiple users, so I can see who opened the door and if they closed it. I can set times to access for my cleaning service. I was very happy.Today, I am even happier. After owning the product for a while, it just stopped working. I attempted to reinstall, reset and the like, nothing worked. I called their support line, I was disappointed when I realized I was connect with an off shore support department. I have not had good luck of late with support basede off shore.My technician Roger was incredibly knowledgable, polite and patient. He walked me through multiple iterations to troubleshoot my issue. Roger advised that I had the hub mounted too close to the garage door opener and suggested I go across to another outlet to attempt connecting the sensor to the lifting unit. It worked right away! Roger said that sometimes large metal objects can interfere and that moving the hub usually fixes it.This isn't someone reading from a script, this is a true professional, an experienced professional available at 10 AM on a Saturday to help you with a product.Kudos to MyQ and Chamberlain, you have a great product and equally great support. Mark me a happy customer.Buy this!",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pooya F.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2024",
                "reviewTitle": "Low cost automation",
                "reviewText": "This is an awesome device. Easy to install, extremely effective, good app. It takes the worry out of knowing whether the garage door was left open, it provides security if the door is opened unexpectedly and provides a history of access. It's good when you're not home and want to give a family member access or when your garage door opener has run out of battery or you're on foot. Love it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pacorro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 22, 2023",
                "reviewTitle": "todo es un excelente producto por que lo puedes abrir donde sea que te encuentres",
                "reviewText": "me gusto todo facil de manejar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CristobalCristobal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 31, 2023",
                "reviewTitle": "piden membresia forzosa para ver cuando se abre el porton o se cierra.",
                "reviewText": "es un fraude, jamas volvere a comprar esa marca , quieren cobrar una membresia por el envio de la foto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/617gDXL2GiL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raman Gupta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 23, 2023",
                "reviewTitle": "Fast response time",
                "reviewText": "Very easy to install. Pairing with a compatible opener was very fast and simple. Response time from pressing the open and close buttons in the MyQ or other compatible app is immediate -- which is great since I've read other similar units have a significant delay. My only relatively minor complains are that a) the unit can only be paired with one application, so for example we can't pair it with both they MyQ app and our Smarthome/security system app -- only one or the other, and b) if trying to send a close or open commands to two doors at the same time it does not work. There has to be at least a few seconds of delay between the two commands. But these are manageable problems.Note that it does *not* support z-wave, so if your home uses z-wave extensively you may wish to consider another unit. The unit connects via Wifi so you must have good Wifi coverage in your garage.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David SBDavid SB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 19, 2023",
                "reviewTitle": "Funciona correctamente.",
                "reviewText": "The media could not be loaded. Accesorio bastante útil para dar acceso al conductor de Amazon o ML cuando no hay quien reciba las entregas personalmente.A diferencia del modelo de color blanco, este dispositivo es compatible con los motores que traen botón de aprendizaje color amarillo. La instalación fue sencilla y no me llevó mas de 30 minutos. El instructivo dice que el modulo se instale alejado de cosas metálicas, sin embargo lo instalé en la misma estructura que sostiene al motor y funcionó sin problemas. Por otro lado, el sensor de posición lo atornille en el panel superior del portón y la instalación fue sencilla.Una vez que el usuario principal configura su perfil en la aplicación, se pueden agregar accesos adicionales en forma de copropietarios (pareja, hijos) o usuarios temporales.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61T7tN5l30L.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/E1RwaSiyh5L.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}