{
    "remaining_requests": 46834,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Stick-security-camera-two-way/dp/B0C5QRYBJB",
    "body": {
        "name": "Ring Stick Up Cam Plug-In | Weather-Resistant Outdoor Camera, Live View, Color Night Vision, Two-way Talk, Motion alerts, Works with Alexa | White",
        "price": "$69.99",
        "originalPrice": "$99.99",
        "rawPrice": 69.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Stick-security-camera-two-way/dp/B0C5QRYBJB",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B093W16MYC"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C5QTSF5J",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01JrhBSD9vL._SS36_.jpg"
            },
            {
                "asin": "B0C5QRYBJB",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/0178+pOzqyS._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Hvh6we9-L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31Qm1lS3DoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419SSzxLwFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411pPZFDoRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xqerfQ3DL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41m44RahAYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51l6kPe53aL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e745fa4-d252-43c1-855e-e76f5b0fd82b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/86ed45af-7787-44b5-aac8-fc9de66a091a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/18b35c8b-b535-49a4-a532-03d6343891ec/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/62b29bdd-8a77-48ee-adff-e284b0699ecb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7dd301db-5f0c-4223-a496-db6b438d080a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8cc469c8-a5c7-49dc-ba32-eb7e731cb372/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 11070,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 22 mins",
            "FREE delivery Friday, February 16. Order within 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "See, hear and speak to people from your phone, tablet or select Echo device with Stick Up Cam Plug-In, a wired camera that can be mounted indoor or out. Includes privacy features, such as customizable privacy zones and audio privacy, to focus only on what's relevant to you.",
            "With Live View, you can check in on your home any time through the Ring app.",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.",
            "Place on a flat surface or mount to a wall with the versatile mounting bracket. Add-on the Mount for Stick Up Cam (sold separately) for ceiling mount.",
            "Watch over your entire home by connecting one or multiple Stick Up Cams to the Ring app.",
            "Easily setup your Stick Up Cam Plug-In by plugging into a standard outlet and connecting to Wi-Fi.",
            "For added peace of mind, pair with Alexa to help you keep an eye on your home."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Average Install Time",
                "value": "5-10 minutes"
            },
            {
                "name": "Video",
                "value": "1080p HD, Live View, Color Night Vision"
            },
            {
                "name": "Field of view",
                "value": "130° diagonal, 110° horizontal, 57° vertical"
            },
            {
                "name": "Audio",
                "value": "Two-way talk with noise cancellation"
            },
            {
                "name": "Motion Detection",
                "value": "Advanced Motion Detection with customizable motion zones"
            },
            {
                "name": "Power source",
                "value": "Plug into standard power outlet"
            },
            {
                "name": "Internet requirements",
                "value": "Requires a minimum upload speed of 2 Mbps for optimal performance"
            },
            {
                "name": "Connectivity",
                "value": "802.11 b/g/n Wi-Fi connection @ 2.4 GHz"
            },
            {
                "name": "Operating conditions",
                "value": "-4°F to 122°F (-20°C to 50°C), Weather Resistant"
            },
            {
                "name": "Available colors",
                "value": "White, Black"
            },
            {
                "name": "Mounting base",
                "value": "Integrated mounting base/stand with adjustable angle. Can sit freestanding or mount to a wall."
            },
            {
                "name": "Dimensions",
                "value": "2.36 in. x 2.36 in. x 3.82 in. (60mm x 60mm x 97mm)"
            },
            {
                "name": "Box includes",
                "value": "Stick Up Cam Indoor/Outdoor Power Adapter (Indoor 8.0ft / Outdoor 22.5 ft) User Manual Security Sticker Screws Wall Anchors"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty and service included. Use of Security Cameras is subject to the terms found here. License information can be found here."
            },
            {
                "name": "Support",
                "value": "Click here to view more information on the Security Cameras support page. Click here to learn more information about Linked Devices."
            },
            {
                "name": "Generation",
                "value": "Ring Stick Up Cam Plug-In – 3rd Generation (2019 release)"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Ring device, visit Software Security Updates in Ring Control Center for information specific to your device."
            },
            {
                "name": "Disclaimers",
                "value": "1Ring Alarm and all Ring Alarm accessories require a subscription for in-app features and digital notifications, including but not limited to: digital arming / disarming and integration with other Ring, Echo, Alexa, and third party products. Subscription sold separately. View Ring Protect Plans for pricing and details. Customer reviews may reference features that require a subscription."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6AE6GVPGCBL7UOA4OL6JPOAI5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D1147U4EQBDL?ASIN=B0C5QRYBJB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Great. Easy setup.",
                "reviewText": "Had another security camera system. It was awful. Their customer service blamed the poor performance on our wifi. We returned that system and got a Ring system. The Ring system is AWESOME and works great on our wifi. Very fast, very good video quality, and no more clips of nothing. I can connect to the Ring camera live view in less than 2 seconds. The setup was easy, no sync modules, just put the camera up and connect it. The Ring app is great. I purchased the Ring plug in cameras. They have long and even really long cords included. The camera mounts are nice too. So glad we went with Ring. AWESOME. I highly recommend this product.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWOKZMUZI5IQBW4AROVZYWRDCTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUV3P7E75HYBD?ASIN=B0C5QRYBJB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2020",
                "reviewTitle": "5.0 out of 5 stars After some difficulty, works fine",
                "reviewText": "4/8/20 Update:This is the final update. The firmware upgrade resolved my issues. It is working fine. So I upgraded my review to 5 stars. Here is the bulleted summary. The original review, and the previous update, appear below unedited.* Excellent support. They reached out to me to help me when they saw my original review. Had that not happened, I would have just sent this back.* You cannot flip the video if you mount this upside down (like hanging it below a roof overhang, for example). It must be mounted right side up. I don’t know why, as the indoor cameras can be mounted either way.* The integration with other ring cameras in the app is excellent. The upgrades to the app that occurred recently allow one to set “modes” and enable or disarm various cameras in various situations. Handy.* Unlike the indoor cameras, this outdoor camera has limited control over motion detection zones. You can activate three different set zones, but you cannot draw a region like you can with the indoor camera. The motion detection works fine, but I’d rather be able to activate a particular area as opposed to picking from set regions.* The firmware upgrade was problematic, and was the source of the issues I had. I don’t know why, but with the support help I got, it updated fine and resolved my issues. If you get one of these, and when you install it tells you it needs a firmware upgrade, make sure that happens. You can ensure it does by seeing the blue light on the front flash on and off after you set it up (and the update starts). Despite repeated attempts on my end, that did not happen until I was on the phone with support. The update does take a while, so be patient. But if the blue light is not flashing, try power cycling the camera until it does.Bottom line: recommended.4/6/20 Update: This is an update to my previous review. This is still a work in progress, but progress has been made. I increased my rating to 3 stars, but will revise it again after I am done testing. After posting my original review (below, unchanged), a Ring support person saw it and emailed me. Which I did not expect. We arranged a call, and he helped me get the software update applied (which, for some reason, was never properly applied). This appeared to clear the issues. I had moved the camera indoors (to eliminate any network issues on my end) and tested it all weekend, and had nothing but problems. I convinced myself through that testing that the camera was defective and figured I would return it for a replacement. However, now that the software update was applied, it seems to be working fine. I moved it back to its outdoor location (which weakens the wifi signal) and am testing it now. Hopefully this solved the problem. However, kudos to the Ring support to help with this. They reached out to me and the person I spoke with was quite knowledgeable. Very helpful. I am confident at this point that, if this camera does turn out to be defective, that a replacement will work fine. Hopefully this problem is solved for good, though. I will update this further after more testing.The original review appears below, unedited.---This camera (the stick up outdoor camera, powered by plug in) was completely useless. I have three other indoor ring cameras which all work fine. This one was flaky from setup. Like my other cameras, it setup easily with the app. I connected it and set it up indoors initially (the installation was to be outside). Once connected, it immediately wanted to do an update. Fine. I wait. No flashing lights, nothing. I wait and wait. After a lengthy period of time, I decided it was done. I continued through the setup and did a live view. It was very sluggish, but it worked. I figured, cool, it’s ready. So I unplugged it and went outside with an extension cord, plugged it back in, and started fooling around with location while using live view. Was working fine (however, it was here where I discovered there is no video inversion for this particular model if you want to hang it upside down - this is not true for the indoor stickup cameras, so beware of that). I leave it plugged in and sitting out side, and I return indoors to get something (I actually went inside to confirm via the internet that, yes, this camera really cannot be mounted upside down). I go back outside and try to reconnect to live view and it refuses. Claims poor connection. Complains about my phone, complains about the camera. Nothing changed. Not even the location. I had just spent several minutes up and down a ladder and screwing around with placement, all with live view. No problem. I finally decide to just remove the device and re-install it. So I do (this time depressing the button inside to put the camera in setup mode). I eventually get the same message, in the same place in the installation process, about needing an update. So I do the same thing again. This time I am doing all of this outside, because that’s where everything is now. Eventually, after (I think) the update is complete (it’s not like it tells you) I try live view. Doesn’t work. Well, it sort of worked. It worked initially, then when I tried to go back to it, it would not reconnect again complaining about a poor connection. I finally decide to try this one more time. I delete it again, move it all inside to sit right next to the wifi access point. I redo the install again (delete the device, put the camera in setup mode, re-install as before). I again get the need to update message. This time I just let it sit there for a good 20 minutes so to make sure it installed the update (or thought it did). So here I am typing this, with the camera sitting on my desk. It is in live view but constantly stops, complains about a poor connection, and so on. When I pop in and out of live view, it takes quite a while to reconnect. All of my other cameras are nearly instant. But not this one. All on the same network. The upshot? I have no idea if I just happen to have a lemon here or what, but this thing is useless. It won’t even work 4 ft from the wifi access hotspot. I can literally see it from where I am sitting. Every other device I have works fine, including other devices connected and sitting outside (an older security camera, a weather station, .... - all connected to the same network, the same wifi access hotspot). I am returning this today. Very disappointed since the other indoor ring cameras work so well.",
                "reviewVotes": "72 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorie Laux",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJSZNNL6FSMERZBTWCA77NU4AXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IGZGQ5EP1AZI?ASIN=B0C5QRYBJB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars PERFECT Addition!",
                "reviewText": "This was the best addition to our ring system! indoor/outdoor. I needed one on our back patio because we had a bobcat. Easy to add device! all I had to do was plug it in. The picture both day/night is perfectly clear.ALSO, I can unplug it and put in in any room inside the house and plug it in and it will re-load back up in less than 90 SECONDS! I definitely refer this to anyone.Very Happy customerThank you!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan L Maurer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3XFWEWSR7DIZ7TFALWY6ITER4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36OCXYHF6T8R3?ASIN=B0C5QRYBJB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice video",
                "reviewText": "I purchased the ring outdoor camera to compare it to another camera that I had been using. The set up was easy, the picture quality is great and I have had no issues with my camera. I liked it so much I purchased 3 more for my home.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Douglas Bishop",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOALISM7IZLCZPGMLVIQOYL55OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQRM2BRFGM803?ASIN=B0C5QRYBJB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "4.0 out of 5 stars Overall decent",
                "reviewText": "Good camera quality, relatively easy installation. My only complaint is the built-in siren is a bit pathetic.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr TV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRKVVWKQ65JTYXS7JE3CF56MZEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LCKP35UZUG5F?ASIN=B0C5QRYBJB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Expensive but better than most cameras out there IMO",
                "reviewText": "I have 5 stick up cameras and the door bell camera. All have held up well under the Texas heat and now the Texas cold. The online storage is good, a bit pricey, but good. I use the app on my phone almost always because it’s the easiest to get quick views. As far as using on my laptop it’s a pain in the butt. I have to signin all the time. The picture quality on the laptop is great though. I do recommend the Ring cameras because they are easy to install ( more work installing outside with power) and the pan tilt option is pretty good also. Like the rest of the Ring stuff - a bit pricy.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MM1217",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCT5QTNQLUQP5ACUNSWCEQRZJNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10NFVWEVVOZ9O?ASIN=B0C5QRYBJB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Exactly what I needed",
                "reviewText": "I tried another brand well-known for its excellent video, but it failed at detecting motion and the night vision was poor. I sent it back and got a ring, and it perfect. Great performance, less lag than the other, and captures motion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}