{
    "remaining_requests": 46760,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Blink-Sync-Module-2/dp/B084RQ6MHJ",
    "body": {
        "name": "Blink Add-On Sync Module 2",
        "price": "$34.99",
        "originalPrice": "",
        "rawPrice": 34.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Blink-Sync-Module-2/dp/B084RQ6MHJ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31jEg7XYKbL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51UWzMrMNBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410ZdIvLj7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kUzlsSJcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cp7qimC4L.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Blink Store",
            "link": "https://www.amazon.com/stores/Blink/page/C5DECBBE-4F56-4C36-B933-E62144578691?ref_=ast_bln"
        },
        "brand": "Blink",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 36901,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 1 hr 10 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Conveniently control all of your Blink devices right from the Blink Home Monitor app with the Blink Sync Module 2. The Sync Module 2 connects up to 10 of any Blink Indoor, Blink Outdoor, XT2, XT, Video Doorbell and Blink Mini devices (not required for Mini).",
            "Supports local video storage for up to 10 Outdoor, Indoor, Video Doorbell and Mini devices. Record and store motion clips when you insert a USB flash drive (up to 256 GB – sold separately) into the Blink Sync Module 2. Does not support live view recording.",
            "View, share, and download locally stored motion alerts from Outdoor, Indoor, Video Doorbell and Mini devices through the Blink app anytime or watch the footage on your computer by plugging in the USB flash drive (sold separately).",
            "No monthly fees are required to use local video storage functionality. Local video storage functionality is not compatible with Blink XT2, XT, and 1st generation Indoor cameras."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JV Blanco, MArch I, MHsPv, BArch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMZLTM3KCPGJSURW5UB3DAXHGTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMS6KZ4AXHRML?ASIN=B084RQ6MHJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Integral item as part of security system that works properly and reliably",
                "reviewText": "This is a necessary item to use with this brand name of camera. It works as the hub of the system and attaches to your WiFi router. It rarely goes offline and if it needs to to update or something, it will warn you through the app. The app is easy to use, setup was also easily attained. Instructions were walk through tutorials observed on the phone online. Appealing looking, looks modern, simple. Easy to use, durable.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. McCaslin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUDGJGDCBQPQQ7OHHYZHOUDHFNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R156VSWCOD5V1H?ASIN=B084RQ6MHJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Be sure to be using the latest firmware!",
                "reviewText": "The Blink doorbell had all the right features, but it never worked reliably for me. I tried replacing the sync module, my USB stick, and the camera, to no avail. Then, after a firmware upgrade, it started working perfectly. I am now running version 28.0, build 2401292311. This upgrade was pushed transparently to me; there was no notification of upgrade, nor any request for permission to upgrade. If you are having trouble, be sure you are using the latest firmware. I now find the USB option to be working great--no need for the cloud option.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dawn Marie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIL55JD5GPXOGNSIXDLPVMTDF6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZO0O5DT0QHLL?ASIN=B084RQ6MHJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Must have to use cameras",
                "reviewText": "I received a blink 4 outdoor camera for my birthday. I was all excited and realized very quickly that I needed a sync module for it to work. I'm not really all that tech savvy. So for me to get it up and going is saying a lot. It's fairly simple to do. The night vision itself is fantastic. Black and white but that's all good. It doesn't go off with bugs but does pick up the neighborhood cats. I've had no issues with the sync module itself which is what I'm doing the review on. I plug it in and that's all I've done. I have two blink 4 cameras for my front yard and back yard and both are connected to the one sync module. The only negative I can say is that you cannot see both live views at the same time. It's one or the other. I can bring the blink app on my phone and see both cameras but only one can be viewed at a time. There's also a bit of a lag. Maybe 5 to 10 seconds on each camera. I'm sure a psychotic serial killer cannot possibly hack me up in tiny pieces in that time frame so I feel relatively safe. I do like if there's a person or movement it can decipher the difference. The phone will alert me if there's movement and at any time I can see live views. The plans were a bit confusing to me. You do get a trial for each camera which is nice. But after that you have to figure out which plan you want. Otherwise if you don't pay for it you only get very limited servicethat for me isn't going to work or give me the peace of mind I need which is why I wanted a system in the first place. Overall, I think it's worth it. It's great for what you get and not too expensive. I don't need a professional to install it and don't need to put a bunch of wires and holes in my house. It's easy to use as long as you have wifi. No real issues with it. Definitely recommend.",
                "reviewVotes": "64 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJNXP7XYQTKZR2XXLNBKYBFDLTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21IWBS0I4IBHM?ASIN=B084RQ6MHJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "4.0 out of 5 stars Doing the job",
                "reviewText": "The module does an ok job. Occasionally it will stop recording motion from a connected camera, but remotely disarming/rearming the module gets everything working properly again. The usb memory functionality works very well and will store many weeks (months) of data depending on how many motion activations happen. It only takes a minute to remove the usb memory and clear it so it can be reused.The system was pretty easy to set up and without a call to tech support.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GigiGigi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7TI36CBUWWS3KFNMPSNIXUADWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R380D47HCMFHNV?ASIN=B084RQ6MHJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2022",
                "reviewTitle": "5.0 out of 5 stars 2 out of 3 worked - Good Device - Good Eco System",
                "reviewText": "This is a general review of Blink camera system and Sync module itself.After researching the available products, ring, wyze, etc. I selected Blink system for setting up my video perimeter. It had all the right features at a very affordable overall price.When you purchase their cameras they give a month of cloud service so you can try things out. Their cloud pricing is also very affordable and competitive.At the same time, Blink offers this thing called a Sync module in case you don't want to pay for cloud subscription. Initially I couldn't find documentation of how / what this thing does so what I'm writing here is based on experimentation.At a high level, Sync module offers a subset of feature of the cloud and is basically designed to do one thing: Record and store videos when a camera detects motion. Other features such as periodic taking pictures and storing is not not supported.Here's how things work with Blink app. It organizes the various cameras (outdoor, mini, doorbell, etc.) into what they call a \"System\". A \"System\" is pretty much a way to group things together. A group of cameras have the same on/off schedule, can be armed/disarmed at the same time, show up on the app on the same page, etc. Most importantly, a group of cameras share a single Sync module.For example, let's say you want to use blink to monitor two separate physical locations. If you are using the cloud, you can create a single group and add all the cameras to it even though they are located apart. But, if you don't want to use the cloud and instead use a sync module, you'll need to create two \"Systems\", each with its own Sync Module.Once you decide how to group your cameras, adding them to the account / app is easy. First, you add the Sync Module, then each individual camera. The process is very quick. I've done it a dozen times already and it's gone without a problem every time.Once created, you can arm the group for motion detection and recording. Every time motion is detected, the camera saves the video footage to the Sync Module. Once saved, you can look at saved video clips from the app, just like you'd if you had the cloud subscription.I've been very happy with the functionality of the Syn Module. I've recommended it to a bunch of other people and can say that so far, I know about 5 households that bought the Sync Module + a bunch of cameras and been using them with success.I've attached a few pictures of the app to show what you'll see if you setup a group and some of the adjustments available for an individual camera.-------------------------------------------------------The only problem i've had so far is one of the Sync Modules I purchased had a really strange issue. Everything worked except that it wouldn't actually record video to the USB. Camera would detect motion, send a notification, but no recorded video would show up. I did all the troubleshooting steps, called their support a few times, and unfortunately it wasn't solved. Also, there are no troubleshooting indicators available to figure out what was going on. Things either work or don't. I wish they provided some logs or other indicators to the user.At the end, I returned the thing, bought a new one, and it worked. So my conclusion is that specific Sync Module had an issue (hardware / software / who knows).",
                "reviewVotes": "391 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51pRhMVdp-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51vWb3WFtuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61NR0n5Ri0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ShBmkLfeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 26, 2024",
                "reviewTitle": "Great Gadget",
                "reviewText": "A bit finicky to connect to wifi, but once done the product runs great.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel Birch",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 24, 2024",
                "reviewTitle": "second one purchsed",
                "reviewText": "had to buy this replacement as the first one i bought malfuntioned after a year and outside of warranty. malfunctioned through no fault of our own.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DW",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 23, 2024",
                "reviewTitle": "Simple install....",
                "reviewText": "BUT.... I hoped the viewing delay would go away after the free cloud subscription ended bust sadly it didn't with the module....it is for security and you kind of need to see instantly who is at the door wether home or not! There is a delay in notifications and then a LONG delay to be able to view the new notification. It was a fair price but with this and the doorbell camera however.....disappointing none the less.Picture quality no complaint.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raul Jr Floreta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2024",
                "reviewTitle": "Excellent!",
                "reviewText": "Easy to install and it works really well! Thank you!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luke",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2024",
                "reviewTitle": "Good for the money",
                "reviewText": "Works great and as advertised.NOTE: If you want to deploy multiple automatic schedules for different camera zones multiple blink sync modules. One for each zone.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}