{
    "remaining_requests": 46740,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Oculview-Cellular-Security-Cameras-Wireless/dp/B0CP1PSQX5",
    "body": {
        "name": "Oculview 4G LTE Cellular Security Camera, No WiFi Needed Security Solar Cameras with SIM Card Wireless Outdoor, 2K HD Video, 360° View, Color Night Vision, PIR Motion",
        "price": "$139.99",
        "originalPrice": "",
        "rawPrice": 139.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Oculview-Cellular-Security-Cameras-Wireless/dp/B0CP1PSQX5",
        "soldBy": {
            "sellerID": "A3FK8ZYYPR6GNZ",
            "name": "Yuye Tech",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3FK8ZYYPR6GNZ&asin=B0CP1PSQX5&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CQ24FVFP"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $10 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31jq1luNqML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51SUlLKHh1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LR7tEtuBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511JhEYknDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41m81DUSdHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417w8Z0sllL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Oculview Store",
            "link": "https://www.amazon.com/stores/Oculview/page/1AC20177-E85C-4102-AE6C-BF3EECEFB112?ref_=ast_bln"
        },
        "brand": "Oculview",
        "merchantInfo": "Yuye Tech",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 23,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 1 hr 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【No WiFi & No Electrical Wire Needed】The cellular security camera is designed specifically for use in places without a network or even wires, making it ideal for barns, farms, ranches, construction sites, vacation homes, warehouses, and RVs. （ Wi-Fi connection is not supported）",
            "【SIM Card Included】The built-in SIM card supports Verizon, T-Mobile, and AT&T, it is specifically designed for this 4G LTE cellular security camera to ensure compatibility and stability and adapts to different carrier signal environments (Note only the SIM card that comes with the camera can be used and is not detachable). The SIM card comes with 300M data to first use, you could be renewed with $14.90/3G per month on the app after it runs out",
            "【Non-Stop Solar Powered】The no wifi solar-powered security camera features a built-in 10400mAh high-capacity rechargeable battery. Through a 6W solar panel, it guarantees a constant power supply, eliminating the hassle of frequent takedowns and charging. No need to charge for 365 days. With an IP65 waterproof rating, they are designed to withstand diverse environments, ensuring their long-lasting performance. Provide an ideal solution for outdoor use",
            "【2K Color Night Vision & 360° Viewing】The cameras without wifi needed provide you with 2K resolution to ensure that the video is clear and sharp, while the color night vision allows for accurate color representation even in the dark (Spotlight needs to be manually set on in the APP). Additionally, a wide-angle lens with 355° horizontal rotation and 100° vertical rotation provides a wider and more flexible view angle",
            "【PIR Motion Sensor & Two-way Talk】 This LTE security camera features a sensitive PIR motion sensor that allows the camera to detect motion based on heat signatures. It means the camera can send alerts to your phone when it detects motion. (You can set the sensitivity of this function in the APP). Meanwhile, the camera is equipped with a two-way talk function, you can communicate through the camera from any location and at any time"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Video Surveillance",
                "link": "https://www.amazon.com/Video-Surveillance/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7161091011"
            },
            {
                "name": "Surveillance Cameras",
                "link": "https://www.amazon.com/Surveillance-Cameras/b/ref=dp_bc_aui_C_4?ie=UTF8&node=898400"
            },
            {
                "name": "Bullet Cameras",
                "link": "https://www.amazon.com/Bullet-Cameras/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14241331"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7.68 x 6.54 x 5.39 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.53 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CP1PSQX5"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 23 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#304 in Bullet Surveillance Cameras"
            },
            {
                "name": "Date First Available",
                "value": "November 27, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "Oculview"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Outdoor Security"
            },
            {
                "name": "Brand",
                "value": "Oculview"
            },
            {
                "name": "Connectivity Technology",
                "value": "4G LTE"
            },
            {
                "name": "Special Feature",
                "value": "Waterproof"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page With 4X Digital Zoom 2K high resolution with 4X digital zoom to ensure that the video is clear and sharp. Infrared & Color at Night Even at night, the built-in spotlight of the camera can supplement the light to achieve color images Suitable for Most Weather It can be used normally on rainy, snowy days, etc. Sharing the Good Times Support for multiple people to simultaneously watch and play back surveillance images. Next page 1 2K HD Video 2 Color Night Vision 3 IP65 Weatherproof 4 Multi-user Usage",
                "media_link": []
            },
            {
                "media_text": "Previous page 355° Pan & 100° Tilt 355° horizontal rotation and 100° vertical rotation provides a wider and more flexible view angle. Next page 1 360° Viewing 2 PIR Motion Sensor 3 Two-Way Audio",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/73cc57cd-848f-4a48-b81a-791c2666b0f4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/afafe234-e4bb-4965-8b85-5233046d9f08.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3fb4fb40-0f2f-4625-ab6d-f86e00b3dd1f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b32a3f3-5f9b-4437-bdf4-276b30907d9f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fb77604c-033c-4761-b95a-469303ff0838.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/31f8f2df-7702-49af-b938-0158e8d1209c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8313683b-75c2-4490-8237-1a8e3d414769.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4d999fa-f812-4cb9-b3f0-ec86ce7ea324.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/85253b8d-a66f-41e2-9c6a-6ebcb8475c29.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Randall Skyway",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWS7BCEKLT6YN2OZRMYD4RD2JWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33TMQTKPMZTE4?ASIN=B0CP1PSQX5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent - It's like an instant security camera that shows you everything",
                "reviewText": "I literally had this up and running in just a few minutes. You just screw it into a light socket, and follow the easy instructions in the mobile app. It was a snap!One little tip: the only thing you really need to be aware of is the length of the bulb. If you are using a covered fixture, be sure to check the length. If the cover is open at the bottom, you shouldn't have any problem, unless the bottom of the cover obscures the camera lens (mine did not). However - even in that case, no problem - because for just a few dollars, you can buy a simple light socket extender pretty much anywhere. That just screws in first, and your device will then screw into that. Easy.Now, as for the device itself: I love it! You can pan left and right or tilt up and down. (You pinch the screen to zoom.) This allows you virtually full coverage of wherever it is installed.This also has motion detection and can alert you (if you choose).It's entirely optional, but in the app, you can subscribe through your phone's regular app store to get video storage. It's pretty inexpensive, but again, not required. You can buy this and never pay anything more and still get full use of it.As one or two have pointed out, it is possible for someone to unscrew this. Highly unlikely! Most people won't notice it, especially at night, and they would also realize that they have ALREADY been seen by the camera and possibly recorded (if you opt for that). So that should be of minimal concern, really.In short, this is a great device that works flawlessly, is super easy to use, and will give you extra peace of mind. Highly recommended.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZSEF7VWBSABP635VSEG7NWH6FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E8UQHXWTV9XV?ASIN=B0CP1PSQX5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars Easy to set up",
                "reviewText": "Super easy to set up, it's mostly in the app.It's slow where I live.I wish it could be set to take a snapshot when activity accures.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Littleman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4Y3YNW2DVVA6VEEF3SMRSU7GRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RSF8PNUYF3N5?ASIN=B0CP1PSQX5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Robust security camera w/motion detection, mic, speaker, alarm Hopefully nobody unscrews it!",
                "reviewText": "Setup is easy. Screw camera into a light socket, download the app, make an account, connect it to the wifi network (2.4G only), and you are in business.Out of the box, this feels solid and well made. There are instructions that guide the process for setting it up. The CloudEdge app is robust and intuitive to navigate settings and features. This is useable for indoor or outdoor use. I tried finding operating condition specifications on the box, instructions, and online (manufacturer and seller websites aren't clearly established) so I queried the seller through the Amazon messaging and they replied quickly stating that it can be used in -20C to -50C (-4F to 122F).There are 2 ways to save videos - an online storage solution through the app, and through a micro SD card (sadly not included). The online storage has options for 3-day or 7-day overwrite looping for either alarm-triggered video or full-time video on monthly, quarterly, or annual subscriptions. As cheap as micro SD cards are, adding one to the package would easily get people started, but perhaps they think that would cut into subscriptions.Quality of video and sound are good. In the app, you can choose video quality, video orientation (for upright- or downward-facing light sockets), manually move the camera up/down and back/forth, sound an alarm, speak through the camera, set trigger parameters, and many other options. Response in the app was crisp and moving through it made sense. Multiple devices can be added and controlled through the app for coverage around the home or even at multiple homes.Using this at the front door would be nice, but the only deterrent to this would be the ease with which someone could simply take the camera by unscrewing it. Perhaps placing a clear glass dome around it will be possible with a little homework.Overall, I am impressed with this brand with which I am unfamiliar. Despite a lacking online presence and scant literature information that comes in the box, if you can't figure something out, it seems like the retailer is quick to provide help through the Amazon messaging. I will keep playing with this and if anything interesting pops up, I will update this review.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MarieMarie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWD6Z4QUVFDJ7UIMC6I3EFYBXGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W9A5RN99GBL7?ASIN=B0CP1PSQX5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Seamless Setup and Reliable Security Camera!",
                "reviewText": "Setting up the Oculview 2K Light Bulb Security Camera has been a breeze, and it's a fantastic camera option with no subscription required! The installation is straightforward – simply screw the camera into a light socket, download the app, create an account, connect to your wifi, and you're ready to roll. Whether for indoor or outdoor use, this camera adapts seamlessly.One notable feature is the convenient video storage options. You can choose between online storage through the app or a micro SD card (sold separately). While it would have been nice for a micro SD card to be included, they are easily accessible for purchase. The online storage offers flexible subscription plans for alarm-triggered or full-time videos, ranging from 3-day to 7-day overwrite looping, available on monthly, quarterly, or annual terms. Overall, a hassle-free and effective security solution.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+IQ4l1ezL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tee DubTee Dub",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM73QUTHHSI2GZEKGY3ATOLGOYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R172LFWNDF2QCB?ASIN=B0CP1PSQX5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Nice image quality, good motion detection, easy app control",
                "reviewText": "This security camera from Oculview provides good image quality in a very simple to use app. It takes just a few minutes to install the app, create an account and be up and running. The camera is fully controllable from the app, you can set the motion detection, and record manually, as well as take snapshots and activate the intercom. I like that it simply screws into a regular light socket/fixture, requiring no additional wiring or plugs to deal with. The option to add a micro SD card is also a nice feature.The motion detection is quite effective, providing a snapshot whenever it is triggered. I have tested this in my home and intend to install it in my barn/workshop near the door for extra peace of mind. I get a lot of deliveries and would like to know when someone is in my driveway or approaching my property.Overall I am very pleased with the performance of this security camera, and I look forward to further testing and seeing just how effective the night vision is. I think it is a reasonable value for the price, and the peace of mind.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610lwCugi3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/611GSCOVblL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61CTtZel25L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Fi5lC3U9L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Sac+U3D-L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}