{
    "remaining_requests": 46836,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Battery-security-privacy-controls/dp/B0C5QRZ47P",
    "body": {
        "name": "Ring Stick Up Cam Battery | Weather-Resistant Outdoor Camera, Live View, Color Night Vision, Two-way Talk, Motion alerts, Works with Alexa | White",
        "price": "$69.99",
        "originalPrice": "$99.99",
        "rawPrice": 69.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Battery-security-privacy-controls/dp/B0C5QRZ47P",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08QSB7SR3"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C5QSN9YB",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01JrhBSD9vL._SS36_.jpg"
            },
            {
                "asin": "B0C5QRZ47P",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/0178+pOzqyS._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/419BrDcflML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/315F7FuF3tL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41F-BA4-stL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sHoo42kVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qmAJ20pFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PrN0fVGEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51l6kPe53aL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cdabd390-a20b-452b-8765-7aaadbbc7bb1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46aaa5c8-b741-43e6-822c-82b0c191cc92/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6bcbdc7c-6f40-4acd-a74a-50cbc88c52e9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d9cda944-c0a6-4ffd-ae26-54447bb1c06e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dbc2cc72-0c9f-451a-a982-6070c8762a88/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/19b725a4-2f25-45b1-b7e0-94bdeb0ff83b/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 63171,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 1 hr 22 mins",
            "FREE delivery February 20 - 22",
            "Or fastest delivery February 18 - 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "See, hear and speak to people from your phone, tablet or select Echo device with Stick Up Cam Battery, a battery-powered camera that can be mounted indoor or out.",
            "With Live View, you can check in on your home any time through the Ring app.",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.",
            "Place on a flat surface or mount to a wall with the versatile mounting bracket. Add-on the Mount for Stick Up Cam (sold separately) for ceiling mount.",
            "Watch over your entire home by connecting one or multiple Stick Up Cams to the Ring app.",
            "Easily setup Stick Up Cam Battery by inserting the battery pack and connecting to Wi-Fi.",
            "For added peace of mind, pair with Alexa to help you keep an eye on your home."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Scott George",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYSN35AQIIW5ZLXQYCLSOSIYI7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IUMW6XQY73Z6?ASIN=B0C5QRZ47P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Great cheap addition to family of Ring products.",
                "reviewText": "I bought this camera as a refurb at a greatly discounted price. The first purchase worked out well enough for me to purchase a 2nd during a Black Friday deal. The Ring Stick Up Cam has proven to be a reliable and versatile addition to my home security setup. Its sleek design and easy installation process make it a user-friendly choice for both indoor and outdoor surveillance. The camera's high-definition video quality ensures crisp and clear footage, providing a sense of confidence in monitoring my property. The motion detection feature, coupled with customizable alerts, adds an extra layer of security, alerting me to any potential activity. What sets the Ring Stick Up Cam apart is its seamless integration with the Ring app, allowing remote access and real-time monitoring from my smartphone. Whether I'm at home or away, the Ring Stick Up Cam provides peace of mind and a valuable tool for keeping an eye on my surroundings.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Taylor701",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW6J2TE3KSFO2HHWT4EJE7ZZXEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NZZ2RYT16W1V?ASIN=B0C5QRZ47P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy to set up and use",
                "reviewText": "This camera was by far the easiest to set up. Just pop the battery in, open the app and it'll guide you through the connect. The picture is excellent. We've had this camera outside since it arrived and it still functions perfectly. We o ly had to charge it twice. Battery lasts a long time.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFORZKQQJD6VJKRFXSGUETIKW46A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12A0VERAMHHJA?ASIN=B0C5QRZ47P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2019",
                "reviewTitle": "5.0 out of 5 stars Zero Integration with Ring Alarm",
                "reviewText": "I have a much better security camera system for my home's exterior but thought I might try one of these cams indoors since I have the Ring alarm system and a Ring Doorbell already. I made the silly mistake, I guess, of assuming there would be some kind of integration with other Ring products - there isn't. None. Not a single thing.It seems like common sense to me that they'd integrate in a couple of ways. I assumed that I'd be able to tell these cameras to only sense motion if the alarm was armed. Nope.I figured I could at least set it to detect motion when I wasn't in the house. Nope. There isn't even any kind of proximity setting for it to even know if you're home or not. They are not location aware in any way. The Ring alarm system isn't either, so I suppose I should have known better already.I also assumed that if my Ring alarm went off the cameras would automatically come on and start recording. Nope!The only motion option at all is to not alert you to motion during specific hours. Note, this doesn't stop motion detection during these hours, it only stops the alerts.Motion detection/recording is only an on or off thing... absolutely no options whatsoever.Annoyed by the lack of integration I still mounted the camera in my great room. I figured I try it for a few days and see how long the battery would actually last with motion recording on. This is a high traffic area so I wasn't holding my breath... and sure enough, after not even 1 full day the battery is down to 80%. This is with all the 'battery saving options' on. This was only a test as I don't actually want recording of any kind going on in my house while I'm home unless the alarm is armed or going off.With absolutely no options, no integration with Ring alarm and no settings to limit it's recording this thing is really only good for one thing; on demand video with no automatic recording. So, the thing is turned off now, doing nothing. I can still activate it from my phone to occasionally check my house isn't burning down.Hopefully someday Ring will update the software and provide some common sense integration with it's other devices.This is all a shame as the build of the camera is quite good considering the low price as is the video quality. The audio isn't great but it never is on cameras of any kind.***UPDATE***Ring support reached out to me directly almost immediately after I posted my review (Good on them) and told me how to link the Alarm, somewhat, to the camera. You have to go into your Base Station settings, then linked devices, then you can set the cameras to record when the alarm goes off - but only then. Make sure you have the updated app that just came out to do this. I didn't. Again, the setting is in your base station, not in the cameras.This solved probably the biggest issue I had with the camera. The rest of my review is still accurate though per Ring support. Hopefully they'll add the other much needed features in the near future.***ANOTHER UPDATE***From Ring Support: \"The Modes feature will be released in November and will allow you to have the option to record motion only if the Ring Alarm System is set to Away Mode\". This will be a great update and should have been available on launch. I wonder if they are only just now thinking of it from all the negative feedback and reviews, but glad it's 'coming soon' either way.***ONE MORE UPDATE***Ring provided me early access to the 'Modes Feature' and I've been using it for the past few days. It resolves all the issues I had with the alarm integration. With modes you can set your cameras to only record when your alarm is set. They can all be set independently and act differently depending on if you have your alarm set to off, home, or away. For instance, you can set your exterior cameras to record when your alarm is set to home mode, but have your interior cameras are turned off. You can set your interior cameras to only record while in away mode, etc. etc. Or any combination. The cameras can now be set the same way motion and door sensors can. This is a great improvement. They haven't told me exactly when this feature will be made public but have said it will be released 'by the end of the year'.I've increased the rating from 3 stars to 5. This software update really has resolved every issue I had with the cameras. I've now ordered and installed an additional 6 for my home.***LAST UPDATE***Having the modes features and my cameras set to only pop on and record during an alarm event (which is rare) and be off at all other times, I've had 2 months to evaluate battery life, almost exactly 60 days now. All my cameras were down to below 10% battery level when I checked them last night. Given the rate of battery drain I had expected them to last 3 months - though 2+ still isn't bad. I have two external cameras on my entry gates outside with the solar panel add-on, they stay fully charged at all times even though it's pretty much been non-stop dark and cloudy days here since installation. They are set to record all motion and since they point at a street they record events dozens of times per day... so if you're thinking of getting the solar panels for outdoor use, I highly recommend them.",
                "reviewVotes": "5,390 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GuitarRebel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEUDHBLYN2JUGFVM2OSJKWYP6CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GMQZI9154M74?ASIN=B0C5QRZ47P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2019",
                "reviewTitle": "5.0 out of 5 stars Read this if you're having connection or audio/video/notification difficulties ***UPDATED at end***",
                "reviewText": "Before I start my revised review, let me state that there's been a lot of news lately about people hacking into Ring cameras, but this only happens when someone installs a new camera and doesn't update the default username and password (or has an extremely weak password which is easy for a hacker to guess). This is like leaving your front door open while on vacation. Your camera is sending and receiving signals over a wireless network. Anyone within range of the signal can potentially be a threat if you don't have good encryption (username and good password) set up on your camera. There's no logical reason for a Ring owner to not do this. Ring even stresses changing the default settings during the initial setup process. Bottom line, don't blame the car manufacturer if you leave the keys in your car and it gets stolen.----------------------------------------------------------------------------------------------------------------------------------------Recently, I wrote a rather scathing 1 star review about the problems I was having with my new Ring Stick Up Wireless Battery Cam. I'm no stranger to wireless cams, having 10 hooked up and running seamlessly on another network as I write this, but I was totally frustrated with the connection reliability, not only with my two upper end cellphones, but also on my Galaxy Tab and Amazon Show. More times than not, the software wouldn't connect with the camera but when it did, the video was choppy. Notifications were also hit and miss. I have a great wireless mesh router system throughout the house, so after doing all the troubleshooting I could think of, I assumed it was due to faulty hardware or software. I gave up and started the return process through Amazon. It was a new product after all and new products sometimes are really buggy. Plus, I read other negative reviews which seemed to justify my thoughts and actions.Then I got an email from a gentleman from Ring saying he read my review and asked if I'd be willing to let him help troubleshoot my issues with me. Although I had already started the return process, I was willing. It was refreshing to know Ring Customer Service was genuinely interested in troubleshooting possible defects in their newest product.Together, we isolated the issue within about 20 minutes. It turned out it wasn't the camera or software after all.Anyone having connection issues should do what he advised me to do. Open up the Ring app and click on the 3 little dots to the upper right of the camera screenshot, then select settings. From there go to Device Health and check the signal strength. Although I had a good mesh hub (inside) within 10 feet of my camera (mounted outside), my signal strength was RSSI -64. He stated that the signal was so weak it was on the cusp of what is needed for the camera to even minimally operate. This prompted me to reboot my wireless mesh system and reset/reconnect the camera. When it came back online, my signal strength went to -39, a vast improvement.A quick check of all of my devices showed the camera and software working flawlessly. Hat's off to Ring.Anyone who may be having connection or audio/video/notification difficulties, check your signal strength to the camera via the Ring software, even if your router is close by. You just might be surprised.***UPDATE***Camera (and software) is still working flawlessly on all devices.Ring has now updated their Windows 10 desktop app (which previously didn't work with the new wireless battery cams) and it works flawlessly as well.Observations.Notifications on my phone, Tab and Amazon devices (Show, Echo, Dot) are almost instantaneous. Alexa says \"Someone is at your front door.\" Very cool.I bought an extra battery, but it looks like it'll be at least a few months before I need to swap it out, even with the intensive testing I've done on the Stick Up Cam. Battery life seems excellent.I have one zone blocked out and that seems to work fine as well. I also have it mounted a couple of feet above and to the left of my front door, tilting downward at an angle. Even though residential traffic is visible in the field of view, I've not gotten one trigger due to street activity. The motion sensor is triggered by anything coming into the bottom half of it's field of view. From the time someone triggers the motion sensor until the time I'm aware of it is 1-2 seconds. That's about as close to real time as you can get. It's not given me a false alarm even once.Telling my Amazon Show to \"(Alexa), show front door cam\" takes about 5 seconds to complete.I can also watch triggered video clips and get a live feed while away from home without any extra setup to my network. It's totally automatic.Because of the customer service I received from Ring and the fact the product is much better than I originally thought, I will be expanding my Ring family soon.",
                "reviewVotes": "1,855 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2FX3ZEKZKDSHTE4GHJO2EFJSUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R95V8OOHB7UHI?ASIN=B0C5QRZ47P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Works well",
                "reviewText": "Works well, sometimes detects cars as people. Also sometimes doesn't detect people. If it's too far away from the wifi the battery drains extremely fast and it doesn't work as well.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alfredo L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 4, 2024",
                "reviewTitle": "Best cam",
                "reviewText": "Excellent quality 👌🏼 battery life awesome 👍🏼",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brandon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 7, 2024",
                "reviewTitle": "Bloody awesome",
                "reviewText": "Protects our home from all the bloody Druggos",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}