{
    "remaining_requests": 46753,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GoPro-HERO3-Silver-Edition-Renewed/dp/B00XIXNSH8",
    "body": {
        "name": "GoPro HERO3+ Silver Edition (Renewed)",
        "price": "$189.00",
        "originalPrice": "$255.95",
        "rawPrice": 189.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GoPro-HERO3-Silver-Edition-Renewed/dp/B00XIXNSH8",
        "soldBy": {
            "sellerID": "A1PCTH1LH7KT2F",
            "name": "GreenBox26",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1PCTH1LH7KT2F&asin=B00XIXNSH8&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00Q75GF2E"
        ],
        "asinVariationValues": [
            {
                "asin": "B00XUP5MNC",
                "variationName": "Style",
                "variationValue": "Battery Bundle",
                "price": "$269.99",
                "variationImageURL": ""
            },
            {
                "asin": "B00F3F0EIU",
                "variationName": "Style",
                "variationValue": "Camera Only",
                "price": "$255.95",
                "variationImageURL": ""
            },
            {
                "asin": "B00XIXNSH8",
                "variationName": "Style",
                "variationValue": "Certified Refurbished",
                "price": "$189.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "18",
        "stockDetail": "Only 18 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418mvl8c0XL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ZkaFfLm9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31DsGUbnwgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31P8amrThOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31tDI5lpUML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bDbacnVOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31yuS1pEWvL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "GreenBox26",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2239,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 9 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "Full HD 1920 x 1080p Recording at 60 fps, HD 1280 x 720p Recording at 120 fps",
            "Capture up to 10MP Photos at 10 fps, Ultra Wide Angle Glass Lens",
            "Built-In Wi-Fi & GoPro App Ready, Compatible with Optional Wi-Fi Remote",
            "Provides Enhanced Low-Light Performance, HERO3+ Is 15% Smaller Than HERO3, Battery Lasts 30% Longer Than HERO3"
        ],
        "description": "The GoPro HERO3+ Silver Edition Camera is 15% smaller and lighter than its predecessor, the HERO3. It also features faster built-in Wi-Fi than the HERO3. The HERO3+ is designed for recording a variety of adventure sports and it comes with a rugged housing that is waterproof down to a depth of 131' (40m). The camera captures Full HD 1920 x 1080p video at 60 fps, as well as 1280 x 720p at 120 fps. It supports both NTSC and PAL video systems as well. For still images, the HERO3+ supports up to 10MP photos with a burst rate of up to 10 fps. The HERO3+ is compatible with the optional Wi-Fi Remote, LCD Touch BacPac and Battery BacPac (all sold separately). It comes with two mounts to get you started, but it's also compatible with a variety of mounting accessories for most outdoor adventure and action sports. The HERO3+ camera features an ultra wide angle glass lens, a low-light image sensor and a microSD card slot. There's a built-in mono microphone and a port for optional accessories including the 3.5mm Stereo Mic Adapter and Composite A/V Adapter, which are both sold separately. To ensure you get the best shot possible, the HERO3+ is equipped with advanced capture settings including Looping Video, Continuous Photo and White Balance. Plus, it supports time-lapse recording. The HERO3+ also works with the improved GoPro Studio 2.0 software, which allows you to easily create professional-quality videos with your GoPro content. The camera's other features include enhanced low-light performance and a rechargeable lithium-ion battery, which lasts 30% longer than the HERO3 battery.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Video",
                "link": "https://www.amazon.com/Video-Equipment/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7161073011"
            },
            {
                "name": "Sports & Action Video Cameras",
                "link": "https://www.amazon.com/Sports-Action-Video-Cameras/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7161074011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5 x 4 x 7 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.01 ounces"
            },
            {
                "name": "ASIN",
                "value": "B00XIXNSH8"
            },
            {
                "name": "Item model number",
                "value": "GOP-CHDHN302"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,239 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,003 in Amazon Renewed (See Top 100 in Amazon Renewed) #681 in Sports & Action Video Cameras #856 in Renewed Camera & Photo"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "May 12, 2015"
            },
            {
                "name": "Manufacturer",
                "value": "GOPRO Action Cams"
            },
            {
                "name": "Brand",
                "value": "GoPro"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Flash Memory Type",
                "value": "Micro SD"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Special Feature",
                "value": "Waterproof"
            },
            {
                "name": "Screen Size",
                "value": "2 Inches"
            },
            {
                "name": "Optical Zoom",
                "value": "0.01 x"
            },
            {
                "name": "Model Name",
                "value": "HERO3"
            },
            {
                "name": "Included Components",
                "value": "Battery"
            },
            {
                "name": "Video Capture Resolution",
                "value": "1080p, 720p"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF37JZJON3UFYUQCMCXLAAHAL4JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NRMPM3S1Q76K?ASIN=B00XIXNSH8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2013",
                "reviewTitle": "5.0 out of 5 stars Great camera for active lifestyle",
                "reviewText": "Got Hero 3+ Silver to replace a previous underwater camera that offed itself after one too many deeper snorkel dives. Personally, I think the Silver version provides 85% of the benefit most people will need from their Go Pro, but if you are super serious about this stuff maybe go for Black for advanced settings and higher res settings. Everyone else, save the cash - this thing rocks.First, upgrading firmware, software is pretty easy if you have basic computer skills - dont be nervous - follow website/Amazon review instructions and it will be easy, as will be wireless setup. Go Pro App is sweet - can control camera, preview, review footage all immediately on phone through wireless. Be aware though - wireless range is pretty limited - not sure but Go Pro wireless remote might have longer range - seems to based on advertising. We used this for trip to Dominican Republic, primarily for snorkeling, but also general photos and vids. Default 960p/60 fps (think its 60 fps) vid (can go to 1080p too) is awesome and the camera does pretty well in low light - adjusts quick - I placed the camera several times under a coral outcrop (get the clear Go Pole - must have accessory) and in seconds it adjusted and captured great footage. Def does better closer to object than far away in regards to detail, but as long as you dont expect super zoom type of detail, it will meet your needs. As others have noted, lens does impart somewhat of a fish eye type of effect, but nothing that made me terribly upset. 10mp pics came out nice - once again, closer to subject better. Time lapse and burst are awesome for catching the perfect shot in a dynamic situation. Housing is well made and camera and housing are durable. No problem down to 25 feet snorkeling and rated to like 90+. Antifog inserts a must for underwater or humid conditions. Battery life was excellent - I found myself able to have the camera on and filming on and off for at least an hour and then be able to review footage on phone through wireless for at least 30 min before battery gave out - get Wasabi backups and charger - seems to work just fine with Go Pro battery - charging through USB is a pain to me. Would also be nice to be able to effectively transfer stuff to PC through wireless, but at size of vids and pics easier to just remove from housing and do through USB.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matt K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRQAG7DBJ3BESMCIS4YQEDYN6FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF2IHJTUBKQ1L?ASIN=B00XIXNSH8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 2, 2017",
                "reviewTitle": "5.0 out of 5 stars My Vacation Hero",
                "reviewText": "I have been debating buying a GoPro for a long time. I couple years ago I decided to take the cheap alternative for my honey moon and buy a knock off GoPro which had great reviews and was only 1/3 of the price. Easily one of the worst purchases I've made on Amazon. The waterproof case broke the first time I used it making it completely worthless for what I intended to use it for (places where I could not use my phone). Naturally when I got back from my honeymoon the company had gone under making it impossible to buy a new case and making the camera worthless.This GoPro is the complete opposite of that camera. This GoPro is at a great price point for those who want to grab good video footage but don't want to break the bank on a newer/higher end model. I recently went down to Cancun for a wedding in which we sailed and went snorkeling. The GoPro did not disappoint. I took multiple hours of video and the GoPro handled it without missing a frame (get it ahahaha)(sorry bad joke). The videos came out sharp although they did need some color tune up post upload. I had zero problems with the water proof casing. I opened/closed it several times and I can confidently say that it is very well made unlike my previous purchase. Just make sure to buy some extra batteries, SD cards, and purchase the accessory pack.PROS-Very well made-Great video-Small and compact for easy carry-Easy to upload-Good battery lifeCONS-It's not cheaper-No LCD screen",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JIM C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJ3FH6IGVDC6SQ2Z6U3D5SNLRSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RARBAO1DRZB9S?ASIN=B00XIXNSH8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2014",
                "reviewTitle": "4.0 out of 5 stars LUV the camera, hate the tiny LCD screen",
                "reviewText": "Bought this cool GoPro Hero 3+ a few days ago, and really like the size and included backs, mounts etc. I do have big problems actually seeing the LCD screen & settings icons, I guess due to being a retired senior and have to get a magnifying glass to see LCD screen when changing settings. So far the vids I have taken have been very good, after I exchanged watertight back for the included skeleton back which allowed much better audio. The MicroSD card has to be manipulated (pushed) many times to release or to load.. Hope this isn't a camera flaw? I do want to take some upside down videos, and will go thru the settings to rotate properly, but also am looking for best, easiest way to simply rotate video once it is shot upside down? I am sure I can find best S/W or method without straining to see icons in screen to rotate? I use a iMAC 27\".I did try to follow instruction manual to set-up Wi-Fi on my iPhone, but failed completely so far. Just can't seem to get this completed and now I am sure Wi-Fi is super screwed up on camera.. But if I decide at some point later, I might purchase the remote and maybe that will set-up easier. I would give 5 stars, but for the tiny text and icons I am having trouble seeing, due to old age I guess? :-)By the way, the head strap mount works great! The quick mount for a ball cap seems too loose for any of my ball caps, so best of luck with this mount.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lee Mackinnon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOCJ5WUDF2T7DG2M3H3BN2E7UCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R264SDXWWDKA0R?ASIN=B00XIXNSH8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2013",
                "reviewTitle": "5.0 out of 5 stars Awesome camera and even better service from GoPro",
                "reviewText": "First of all, the gorpo itself is amazing. The silver package gives you good quality video and camera as well as all the accessories you need to get started!!The first time i tried to set up the go pro app (in order to control the camera remotely, preview shots, view videos on the SD, etc) it failed!! (i think it might have been my fault) either way, I tried all the different methods online then contacted their support team.Remember the entire time the go pro camera functions worked fine, just the built in wifi was causing issues. Finally, go pro told me to return the faulty camera so they could replace it - very nice! But I was going on vacation and needed the camera, so the helpful woman at go pro managed to get my replacement expedited the same day, before they even received the faulty one.Now all is well. The go pro is awesome and it has the app's features to make it even better!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ontario guy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2017",
                "reviewTitle": "One of my better investments. I have found more uses for this ...",
                "reviewText": "One of my better investments. I have found more uses for this camera then I ever thought I would. From fishing, to hunting, to capturing vacations. It is a great camera and with a few little accessories the possibilities are endless. I have had it in the waters of Cayman Islands to the bush mounted on my ATV. The picture and audio are great. I have zero negative to say about this camera other than I should have bought a GoPro years ago.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 16, 2015",
                "reviewTitle": "el paquete llego en excelentes condiciones. agradezco el servicio.",
                "reviewText": "a pesar de que he encontrado el producto mas abarato den otros lugares despues de haber comprado este. no puedo culpar al vendedor por ello. agradezco mucho la atención y el tiempo de entrega. fue un excelente servicio y el producto de encontraba muy bien.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lewis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on May 20, 2015",
                "reviewTitle": "Toujours une très très bonne caméra !",
                "reviewText": "Alors que GoPro a déjà sorti la nouvelle génération de GoPro il y a quelques temps, les Hero3+ restent une valeur sûre, pour le prix et la qualité.La version silver dont il est question ici est un très bon choix pour avoir une bonne qualité pour un budget assez modeste.On peut filmer en 1080p à 50 image par seconde (mon choix préféré).Je recommande GoPro par rapport aux autres actioncam (Drift, Sony, etc) car ces caméras sont maintenant très abouties sur de nombreux points, vraiment un bon choix sans hésitation, foncez !",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bluebu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 22, 2014",
                "reviewTitle": "Klasse Gerät",
                "reviewText": "Die GoPro Hero 3+ Silver, war meine erste Action Cam. Ich hab lange überlegt mir wegen der vielen Negativkommentare die Black Edition zu kaufen.Ich kann keinen vergleich machen, aber ich bin voll und ganz zufrieden. Sie funktioniert einwandfrei, die Bedienung ist super einfach. Die Videos sind klasse. Hab bisher in 720p mit 60fps und 120fps gefilmt und konnte keine Mängel feststellen. Hab ein paar Kurzvideos gemacht und war von der Bildqualität begeistert.Im Moment warte ich nur noch auf die Lieferung der Helm und Brusthalterung. Werd die Kamera dann mal während eines Kendotraining testen.Als Einstiegsmodell passt einfach alles. Es kommt sicher darauf an, was man mit der Kamera filmen möchte, aber für einfach Actionvideos und kleinere Aufnahmen vollkommen ausreichend. Um richtige \"Filme\" damit zu drehen bezweifle ich doch sehr stark, dafür ist das Gerät aber auch nicht ausgelegt.Sobald ich alle Funktionen getestet hab und ein paar Videos gefilmt und geschnitten hab, werd ich die Rezesion noch erweitern.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Biff0r",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 18, 2014",
                "reviewTitle": "Airsoft use brilliant",
                "reviewText": "First of all you were bored to death by friends and families slide shows, photos of their holidays now you can be embalmed with their exciting videos at a wonder 1080 or 720 resolution. 1080p is great res but still find a little choppy even with a class 10 SD card in it, will try a more expensive card over next few weeks. 720 is more useful to me, using for airsoft capture. I have used the iphone/ipad app with it and great, but does use a lot of batteries, used it to set up and get angle of camera correct. Once done I have turned of wifi. Timer says 2 hours 50 minutes on supplied battery, in reality it is around 2 hours 15.I also bought the official head strap and also NVG mount for my fast helmet, I was using a cheap £50 china camera before and the quality is amazing, so glad I spent the extra cash now.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}