{
    "remaining_requests": 46885,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Blink-Outdoor-4th-Gen-3-Camera/dp/B0B1N5FK48",
    "body": {
        "name": "All-new Blink Outdoor 4 (4th Gen) – Wire-free smart security camera, two-year battery life, two-way audio, HD live view, enhanced motion detection, Works with Alexa – 3 camera system",
        "price": "$149.99",
        "originalPrice": "$259.99",
        "rawPrice": 149.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Blink-Outdoor-4th-Gen-3-Camera/dp/B0B1N5FK48",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C32KN8DC"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B1N5HW22",
                "variationName": "Configuration",
                "variationValue": "1 Camera System",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B1N6B8QT",
                "variationName": "Configuration",
                "variationValue": "2 Camera System",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B1N5FK48",
                "variationName": "Configuration",
                "variationValue": "3 Camera System",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BWFDK7Y4",
                "variationName": "Configuration",
                "variationValue": "4 Camera System",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B1N4LM4J",
                "variationName": "Configuration",
                "variationValue": "5 Camera System",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BWFGNHHV",
                "variationName": "Configuration",
                "variationValue": "6 Camera System",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BWFGNNDQ",
                "variationName": "Configuration",
                "variationValue": "8 Camera System",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B1N7LJD3",
                "variationName": "Configuration",
                "variationValue": "Add-On Camera",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BWFDV3B4",
                "variationName": "Style",
                "variationValue": "+ Blink Mini Cam (Black)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BWFCFJDH",
                "variationName": "Style",
                "variationValue": "+ Blink Mini Cam (White)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B1N5FK48",
                "variationName": "Style",
                "variationValue": "Outdoor 4",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/516rCxpsAiL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/3193DLGGfCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51prbd0n9xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51R4cdJZLfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VLtXj9FBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51N0FlBwjLL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Blink Store",
            "link": "https://www.amazon.com/stores/Blink/page/C5DECBBE-4F56-4C36-B933-E62144578691?ref_=ast_bln"
        },
        "brand": "Blink",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 9338,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 1 hr 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Outdoor 4 is our fourth generation wire-free smart security camera that helps you protect your home inside and out right from your smartphone.",
            "See and speak from the Blink app — Experience 1080p HD live view, infrared night vision, and crisp two-way audio.",
            "Two-year battery life — Set up yourself in minutes and get up to two years of power with the included AA lithium batteries.",
            "Enhanced motion detection — Be alerted to motion faster from your smartphone with dual-zone, enhanced motion detection.",
            "Person detection — Get alerts when a person is detected with embedded computer vision (CV) as part of an optional Blink Subscription Plan (sold separately).",
            "Save and share clips — Choose to store events in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with the Sync Module 2 (included) plus a USB drive (sold separately).",
            "Works with Alexa — Connect to an Alexa-enabled device to engage live view, arm and disarm your system, and more using your voice.",
            "Includes three Outdoor 4 cameras, one Sync Module 2, six AA lithium metal batteries, three mounting kits, one USB cable, and one power adapter."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Field of view",
                "value": "143° diagonal"
            },
            {
                "name": "Camera resolution",
                "value": "1080p HD video"
            },
            {
                "name": "Photo resolution",
                "value": "View captured images in 640 x 360"
            },
            {
                "name": "Camera frame rate",
                "value": "Up to 30 fps"
            },
            {
                "name": "Size",
                "value": "2.8 x 2.8 x 1.6 inches (70 x 70 x 41 mm)"
            },
            {
                "name": "Unit weight",
                "value": "5.0 oz (141 g)"
            },
            {
                "name": "Power",
                "value": "Outdoor 4 battery: 2 AA 1.5V lithium metal batteries (non-rechargeable) Sync Module 2 power: 100-220V AC to 5V DC converter included. Battery life of up to two years, based on default settings. Battery life will vary based on device settings, use, and environmental factors."
            },
            {
                "name": "Wifi connectivity",
                "value": "High-speed internet connection (such as broadband, fiber, or DSL). Wi-Fi network: 2.4 GHz 802.11b/g/n."
            },
            {
                "name": "Sync module compatibility",
                "value": "Camera compatible with all Blink Sync Modules."
            },
            {
                "name": "Available colors",
                "value": "Black"
            },
            {
                "name": "Minimum smartphone requirements",
                "value": "iOS 14.0, Android 6.0, or Fire OS 7.0"
            },
            {
                "name": "Blink app",
                "value": "Blink Home Monitor"
            },
            {
                "name": "Included in the box",
                "value": "Includes three Outdoor 4 cameras, one Sync Module 2, six AA lithium metal batteries, three mounting kits, one USB cable, and one power adapter."
            },
            {
                "name": "Audio",
                "value": "2-way audio"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty. Purchase and use of Blink cameras is subject to the terms found here."
            },
            {
                "name": "Support",
                "value": "Visit the Blink Support page for more information."
            },
            {
                "name": "Generation",
                "value": "4th generation – 2023 release"
            },
            {
                "name": "Operating temperature",
                "value": "-4 to 113° F"
            },
            {
                "name": "Software security updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites."
            },
            {
                "name": "Cloud video storage",
                "value": "To keep videos beyond your trial, subscribe to a Blink Subscription Plan which allows videos to be stored in the cloud for up to 60 days. See Blink Subscription Plans for more information about your plan’s retention period. To keep important videos beyond this period, download them to your mobile device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "S. Catalin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3N3YUDNZY434R6LU2CLEIZYTTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B6N3G0HIMO3K?ASIN=B0B1N5FK48",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Does its job",
                "reviewText": "After about 3 weeks of use: almost perfect camera system. Does what it says and is very dependable. Does not disconnect. Image quality is really high. Night mode provides a very detailed image (albeit black and white). I am still in the trial period for the cloud storage so I cannot comment on how it handles the USB-stick operation and limitations.Some small cons:- The auto night mode does not activate when it actually should, especially if your video frame includes some brightly lit windows or doors. It thinks that there is enough light to remain inactive but it is confused by the window light and the majority of protected area is very dark. It can be switched on manually but who remembers to switch it back and forth. Some solutions if Blink developers read this: add option to enable night mode based on geolocation and night/day times, or do not decide based on a sensor but by analyzing a video frame and checking if the dark area exceeds a certain percentage. Etc.- Sometimes even smoke or steam from a gas boiler is detected as \"movement\".- When you activate Live View on a camera, you get a \"Continue ?\" prompt about every 30 seconds. I understand the rationale since the video feeds probably go through Blink's infrastructure, but it's annoying nonetheless. But to be honest, I rarely need to watch more than 30 seconds. One minute would be nicer though.All in all, I am not really complaining. The system is very well integrated, easy to install and does its job properly.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William Morgan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRTVNBLNKSVDABOYSBOB5VAYKEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W42UV1CCOWYQ?ASIN=B0B1N5FK48",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Unbeatable bang for buck",
                "reviewText": "ALL of the Blink stuff I have ordered is getting this same review. After doing an insane amount of research for a home security camera system I settled on Blink for ease of set up and cost. In both of those areas there really isn't a close second. As far as reliability, I'll check in again in a year or two--but other reviews indicate reliability is good. So, good news: easy set-up, great prices, video quality is as good as any, motion sensors and other software adjustable stuff is easy to understand and do.Bad news: The system is crazy slow. I knew that going in, so it might be a bigger deal to you. I'm willing to live with it mostly--down the road I plan to put in a much faster, wired, real time system with only one or two cameras, and Blink has a new \"Sync Module\" that is supposed to have greater range--and maybe speed things up a bit. The slow is annoying...but not a deal breaker.It has notified me of low batteries a few times--so now I just let it go and they seem to recover on their own. I've also had one or two go offline and I had to reinstall them. I think there are two factors causing this, and again for the price I am willing to live with it. For one thing I have the wireless range maxed out even with an extender for my WiFi network. The other factor is it is currently the dead of Winter and cold beyond all reason. 9 degrees last night, high is 31 today. Lots of snow and wind, too. I'm harder to get along with in this weather myself, so I'll put up with some additional problems with electronics that live outside.Bottom line? After three months I'm happy with it and I recommend any and all of the parts of the system I've bought. It works as advertised and it's way cheap--including the annual subscription if you want cloud storage. I will be buying a couple more pieces soon. It is fully functional as long as you don't need a lot of speed. I'm talking about minutes when I’m antsy and want seconds.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gottaluvlabs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEB6QGVOPUCZG7PS77RKZDHZNYQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KQ7CPZL257YV?ASIN=B0B1N5FK48",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "4.0 out of 5 stars (SO FAR, JUST OK) - BUT BETTER NOW!",
                "reviewText": "Bought this because our son has it and likes it. He helped us get it set up and we added network extenders to ensure our internet reached further out from our house. First day one camera kept saying \"live view failed\". Then another camera went totally offline although our internet was fine and the other cameras worked. It was offline overnight then came back the next day after we didn't do anything. Now the cameras all alert us to movement, but don't always take a video. Live view occasionally fails. The picture is clear and good, the area covered is wide and plenty adequate. They keep misbehaving so the jury's out - we have a couple weeks before our return window closes so we'll see. Would be great if they worked all the time. UPDATE: hasn't misbehaved after a rough couple days. Sometimes it alerts but doesn't record but we can live with that - rarely happens. Hasn't had the live view failure lately, either. Doing much better and we'll keep it! Love the clear picture and the fact we can view when away.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}