{
    "remaining_requests": 46705,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SEHMUA-Cellular-Security-Spotlight-Detection/dp/B0CRTPNDFS",
    "body": {
        "name": "SEHMUA 4G LTE Cellular Security Camera Outdoor with SIM Card, Pan Tilt 360° View 2K No WiFi Solar Powered Security Camera, Spotlight Color Night Vision, 2 Way Talk, PIR Motion Detection",
        "price": "$139.99",
        "originalPrice": "$199.99",
        "rawPrice": 139.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SEHMUA-Cellular-Security-Spotlight-Detection/dp/B0CRTPNDFS",
        "soldBy": {
            "sellerID": "A30K97TMYAZXRJ",
            "name": "BOXI X",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A30K97TMYAZXRJ&asin=B0CRTPNDFS&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CT34JY5B"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $20 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41r0y9hOUUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51eW2oS2SJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wD2HJIOiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51e2Lq-ixtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41IejcR-idL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5109LmxcpuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rIN-NYubL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SEHMUA Store",
            "link": "https://www.amazon.com/stores/SEHMUA/page/9C6824EE-5F2A-4379-82EB-D8865F0FF308?ref_=ast_bln"
        },
        "brand": "SEHMUA",
        "merchantInfo": "BOXI X",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 21,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 1 hr 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Includes Prepaid SIM Card and Local Storage】This no wifi security camera comes with a prepaid 4G LTE SIM card that provides 300MB of free data for testing. Once trial data is used up, additional cellular data plans need to be purchased in the app each month. You can choose to save all video clips in a local SD card up to 128GB (Not included) or backup to the cloud (7 days free trial). Supports AT&T and T-Mobile, Verizon can only be used by EIOTCLUB SIM card.",
            "【No Wi-Fi Needed & Solar Powered】The combination of the solar power panel and 4G connection on this cellular camera saves you from the troubles of finding sockets or networks outdoors. Perfect for places without power, such as the countryside, gardens, campgrounds, backyards, barns, farms and ranches, and even on-site construction sites and fields. The solar powered security camera can get non-stop solar power from the included 6W large-capacity solar panel.",
            "【Pan Tilt & Wide Angle】The 4G LTE security cameras outdoor wireless can turn its head 355° horizontally and 120° vertically and 4X digital Zoom (No optical zoom), which provide you a much broader and flexible view nearly complete coverage without blind spots. You can remotely control the pan-tilt feature via the UBox APP.",
            "【2K Full HD Video and Spotlight Color Night Vision】The wireless cellular security cameras provides 2K full high resolution video for day and night, the spotlight of the 4g camera will work at night to let you see more clearer details in the dark up to 32ft around your home.",
            "【PIR Detection & 2-Way Talk】With the advanced PIR motion sensor technology, this camera with no wifi needed can quickly and accurately detect any movement of people, animals or objects, then send you a notification through mobile phone immediately (You can set the sensitivity of this function in APP). Features that two-way talk function equipped with the cellular camera allows you to have a real-time communicate through the app anytime, anywhere."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Video Surveillance",
                "link": "https://www.amazon.com/Video-Surveillance/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7161091011"
            },
            {
                "name": "Surveillance Cameras",
                "link": "https://www.amazon.com/Surveillance-Cameras/b/ref=dp_bc_aui_C_4?ie=UTF8&node=898400"
            },
            {
                "name": "Bullet Cameras",
                "link": "https://www.amazon.com/Bullet-Cameras/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14241331"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5.94 x 7.05 x 10.39 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.19 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CRTPNDFS"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 21 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#393 in Bullet Surveillance Cameras"
            },
            {
                "name": "Date First Available",
                "value": "December 1, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "SEHMUA"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Outdoor Security"
            },
            {
                "name": "Brand",
                "value": "SEHMUA"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wire-Free"
            },
            {
                "name": "Special Feature",
                "value": "Easy to Install"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Outdoor"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page 355° Pan & 120° Tilt You can view a wider range of perspectives on your phone remotely Provide Alert Information Automatically detects person and sends notification to your phone via the Ubox App Equipped With Spotlight Spotlight can be set to automatically turn on at night Suitable For Outdoor Waterproof performance without worrying about any bad weather Next page 1 360° View 2 Motion Detection Alert 3 Color Night Vision 4 IP65 Waterproof",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page 1 Storage Methods 2 SIM Card Size",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f84654f-5bf1-489f-8af8-faf8b02fcf27.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f809bfc1-a346-4c1b-a96a-ae20cbf1ce8c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e696baba-a2b4-4734-bd9b-a4aa36e933d7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bb46210f-9a21-4e17-9a2e-f6ce3639eabf.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bfe7a8b5-3a04-4fdb-bbe2-a985495b60f3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/16f2e059-2bb2-4ca6-b310-639a921c3fcd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb52fc41-224a-472e-aab2-765cf08176c1.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1ec9c6b4-1724-4743-81fb-d26de8ccaa1c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jonathan Rodriguez (TechVidPlay)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRL5NSG3JFX74NZPV5GVF74ULAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8KE13KZ0A87E?ASIN=B0CRTPNDFS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Great security camera",
                "reviewText": "I have been using this security camera for a couple of months now, and it works really well. It comes with a solar panel, but you can also use a USB-C cable to charge it. The video quality is great; you can pivot in any direction you want to look at via the camera's phone app. The camera itself lets you insert a microSD card for video recordings, or you can subscribe if you prefer to do cloud storage.Overall, this is a must-buy if you would like to keep an eye on home or business while you are away.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CynHue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMGA4GDUREGVBRP2HABX3ZPVURA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RED4SUF8KK9Q?ASIN=B0CRTPNDFS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars nice camera",
                "reviewText": "This is a nice security camera. I've had it outside of my house for about a year now and it's worked very well for us. It has a clear picture. It notifies me and records a video any time a car drives by, someone walks out of the house or there's any activity outside. I've been very happy with this camera. This solar function works well also. I've never had an issue with the battery failing to charge.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J-Zilla",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2RQDIFECAI2OD2NQCAQBESE4SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R186XIY0KDG2FT?ASIN=B0CRTPNDFS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2022",
                "reviewTitle": "4.0 out of 5 stars Easy to install/setup, looks to be working fine so far.",
                "reviewText": "The camera itself is pretty easy to setup, it’s solar powered so there is not much to do besides mounting the camera and solar panel. Both the camera and solar panel come with their own screws and a drill template to know where to drill the screws. I do recommend using a level when mounting the camera so the image won’t look crooked.The app is also pretty easy to setup and use but I’m not a huge fan of its overall design quality. The app works but it definitely looks like a generic app with broken English, I have seen other cameras use the same app so it definitely wasn’t made specifically for this camera. The app requires an email to create an account and it also requires several permissions needed for it to work.The pairing process is explained step by step in the app and it’s pretty easy to do. The app has several features such as two way audio, pan/tilt, motion detection and a video playback if you install a micro sd for local storage. You have the option to get a cloud account but I would go with an sd for simplicity.My favorite feature in the app is the spotlight/ night vision option. The camera has both a strong LED light and infrared lights, the app lets you choose which one to use at night. Infrared works like regular night vision where the light is not visible but you can still see at night, the image will be in black and white. The LED option turns on a bright light which lets you see in color at night, the LED will light up your yard.The video quality looks pretty good but it’s definitely not as good as a wired version. The camera being wireless makes the image have compression issues. Everything up close looks very good but anything about 20ft back looks very compressed which means that you won’t be able to catch license plates or other images that may require zooming in. The video quality would be comparable to a smart doorbell or similar wireless device.The audio is also pretty good, the only issue it has is that you can’t adjust the speaker volume and it’s set very loud by default. The mic is also pretty good on the camera, it picks up sounds just fine. The mic seems to go into a quiet mode after a while and wakes up after a loud sound. It basically lowers quiet sounds like wind or crickets until a loud sound happens such as a voice or car passing by which raises the volume again.Motion detection is especially nice with this camera, I’m not getting false alarms from it. I’ve been getting notifications only when a person is in front of it so far. I haven’t gotten any notifications of animals or cars passing by which is perfect for me, I did set the sensitivity to very low so I’m sure you would get those notifications on high sensitivity.The battery seems to be quite good because I installed the camera during bad weather and it still going despite the small amount of sun it’s been getting. There is a battery indicator on the app that can be set to show a percentage but I doubt it’s accurate since it hasn’t moved out of 100% since installing, I do like that the battery indicator turns green when the solar panel is charging.The one thing I didn’t like about the camera is that it doesn’t have the option to turn off night vision completely. My yard is pretty well lit so I don’t really need night vision to be on but you can’t turn it off, you either have infrared or spot light during the night. I don’t think this is a camera downside, it’s more of an app downside.Overall the camera does seem to work pretty well, it has a good enough video quality and the app is pretty easy to use despite having a generic looking interface. I’m not really sure if the picture quality is actually 2k because it looks very similar to my 1080 doorbell. Either way a high resolution on a wireless camera doesn’t make much of a difference because they are still supper compressed unlike a wired version.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dale Nolan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6PZDY4EWATROZXDCA3KEIY3ENA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F4GL6DV482Z0?ASIN=B0CRTPNDFS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Never Plug in with Solar Panel!",
                "reviewText": "I got the 2K Solar Security Cameras Wireless Outdoor because we live on a hill and the deck in our backyard blocks the view from the main floor. We aren’t able to see our kids playing outside very well to keep an eye on them. This camera is the perfect solution. I do have a few complaints but would still consider getting another one for the front yard as well.VIDEO QUALITYThe camera has both SD and HD settings. We aren’t recording so don’t have to worry about how much storage HD would use so we keep it on HD at all times. The video feed quality looks really good. The picture is very clear. Even the night vision has a very clear image and works great.MICROPHONE/SPEAKERThe microphone is great, allowing us to hear the kids even if they are on the opposite side of the yard. There is also as a speaker so if you need to talk to them to call them that is easy to do as well. We often use this feature to call kids in for meals or to ask them to stop doing something.SOLAR PANELOne of my favorite features is the solar panel that is included. We have had this set up for months and have never had to plug it in as the solar panel keeps it charged. We could have easily set the camera up on our fence or another area of the yard, that doesn't have a power source, and not have to worry about the camera losing battery with the solar panel attached. The solar panel has a cord and that connects to the camera. So you could put the solar panel in a area that receives sunlight then run the cord to the camera where you want it located.APPI do have some complaints about the app. I think all my complaints for this camera comes down to the app. First off the controls for moving the camera aren't always responsive. Though the function of being able to move the camera from an app is really great! The second thing is I can't switch the camera off while not using it. It is always on. The only way to turn it off is to pull out my ladder and switch it off with a physical switch. This is a pain because the switch isn't easy to reach on the camera body. I really wish I could turn off the stream from the app for slightly more privacy reasons.Pros:- Great Battery Life (even without solar panel attached)- Solar Panel- Motion Detection- Voice- Wifi or 4G options- Great Night Vision- Clear VideoCons:- App control to move camera angle is a little fidgety- No on/off switch from within the app. You have to reach behind the top of the camera.- Notification sound is the default iPhone ringtone. Sounds like you’re getting a call.- Subscription service not clear what you get or how much you pay without starting a trial first",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}