{
    "remaining_requests": 46726,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Nikon-24-120mm-4G-Lens-Refurbished/dp/B00VIQOZJ2",
    "body": {
        "name": "Nikon 24-120mm f/4G ED VR AF-S NIKKOR Lens for Nikon Digital SLR (Renewed)",
        "price": "$400.00",
        "originalPrice": "$1,099.95",
        "rawPrice": 400.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Nikon-24-120mm-4G-Lens-Refurbished/dp/B00VIQOZJ2",
        "soldBy": {
            "sellerID": "A762DAYKU2MSF",
            "name": "Digital Village",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A762DAYKU2MSF&asin=B00VIQOZJ2&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00WUIMVI4"
        ],
        "asinVariationValues": [
            {
                "asin": "B003ZSHNEK",
                "variationName": "Style",
                "variationValue": "Base",
                "price": "$1,099.95",
                "variationImageURL": ""
            },
            {
                "asin": "B00VIQOZJ2",
                "variationName": "Style",
                "variationValue": "Certified Refurbished",
                "price": "$400.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "Only 8 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/518RnCwn9lL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51ZYRHGk4SL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41U6Se5dDzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51woiN60LIL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Digital Village",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 676,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 16 - 20.",
            "Or fastest delivery Wednesday, February 14. Order within 13 hrs 4 mins."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "Includes all original accessories plus a 90 day warranty",
            "Compact and versatile 5x standard zoom lens with f/4 maximum aperture",
            "Extended range on Nikon DX-format D-SLR cameras",
            "Nikon VR II (Vibration Reduction) Image Stabilization, Nano Crystal Coat, 2 Extra-low Dispersion (ED) Elements; 3 Aspherical Lens Elements"
        ],
        "description": "Compact and versatile 5X standard zoom lens with f/4 maximum aperturePerfect for landscapes, portraits, weddings and distant subjects offering a constant maximum aperture to maintain exposure settings throughout the entirezoom range.Extended range on Nikon DX-format D-SLR camerasAngle of view is equivalent to a focal length of 36-180mm in FX/35mm format.Nikon VR II (Vibration Reduction) Image StabilizationVibration Reduction, engineered specifically for each VR NIKKOR lens, enables handheld shooting at up to 4 shutter speeds slower than would otherwise bepossible, assuring dramatically sharper still images and video capture.Nano Crystal CoatFurther reduces ghosting and interior flare across a widerange of wavelengths for even greater image clarity.2 Extra-low Dispersion (ED) ElementsOffers superior sharpness and color correction by effectively minimizing chromatic aberration, even at the widest aperture setting.3 Aspherical Lens ElementsAspherical lens elements virtually eliminate coma and other types of aberration, even when shooting at the widest available aperture.M/A Focus Mode SwitchEnables quick changes between manual and autofocus operation.Internal Focus (IF)Provides fast and quiet autofocus without changing the length of the lens, retaining working distance throughout the focus range.Exclusive Nikon Silent Wave Motor (SWM)Enables fast, accurate and quiet autofocus.Nikon Super Integrated Coating (SIC)Enhances light transmission efficiency and offers superior color con...",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Lenses",
                "link": "https://www.amazon.com/Lenses/b/ref=dp_bc_aui_C_3?ie=UTF8&node=499248"
            },
            {
                "name": "Camera Lenses",
                "link": "https://www.amazon.com/Camera-Lenses/b/ref=dp_bc_aui_C_4?ie=UTF8&node=562261011"
            },
            {
                "name": "SLR Camera Lenses",
                "link": "https://www.amazon.com/Digital-Camera-Lenses/b/ref=dp_bc_aui_C_5?ie=UTF8&node=173565"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4.09 x 3.31 x 3.31 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.4 pounds"
            },
            {
                "name": "ASIN",
                "value": "B00VIQOZJ2"
            },
            {
                "name": "Item model number",
                "value": "2193 - 24-120mm f/4G Lens"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 676 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,361 in Amazon Renewed (See Top 100 in Amazon Renewed) #186 in SLR Camera Lenses #286 in Renewed Camera & Photo"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "May 19, 2015"
            },
            {
                "name": "Manufacturer",
                "value": "Nikon"
            },
            {
                "name": "Brand",
                "value": "Nikon"
            },
            {
                "name": "Focal Length Description",
                "value": "24-120"
            },
            {
                "name": "Lens Type",
                "value": "Standard"
            },
            {
                "name": "Compatible Mountings",
                "value": "Nikon DX"
            },
            {
                "name": "Camera Lens Description",
                "value": "120 month"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "S. Gable",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHQYDPIOXEIKGUMB6LZQ4RQYDCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8RI7RI3FM9VM?ASIN=B00VIQOZJ2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2013",
                "reviewTitle": "5.0 out of 5 stars One of My Favorite Lens with My D600",
                "reviewText": "I’ve been looking for a decent wide/zoom lens to photograph weddings and senior portraits. I own the kit lens that came with the Nikon D600, but felt the lens had limited zoom range. I did some research on the Internet as well as visit my local camera shop. While at the camera shop, I mentioned my lens needs for range and weight and of course, price. The sales rep recommended the Nikkor 24-120mm f/4 suggesting I would get decent results without spending a lot of money (as in the 28-70mm f/2.8 lens that I was eyeing).I took advantage of the Nikon rebate event earlier this year and purchased the Nikkor 24-120mm f/4 lens. I initially had buyer’s remorse and wondered if I made the right decision with this lens. I spent several weeks testing the lens out and concluded I made the right purchase.It wasn’t until I booked a wedding that I realized the potential of this lens. It’s a wonderful lens that produced beautiful results. The zoom range at 120mm was perfect for me in capturing those special moments. I no longer had to move/walk closer (as with my 24-85mm kit lens) to my subjects. I really like the idea of zooming all the way out and using f/4. I’m happy with the bokeh this lens produces. I enjoy the results I’m also getting from a portrait perspective.This is a fast lens! Focusing is fast.Initially, I had to get used to the heavier weight in my hands. There is a nice balance between this lens and my Nikon D600. Once I got used to this combination, it feels like the two were made for each other. Now, I don’t notice the weight at all. I attribute that to also using the Crumpler’s Industry Disgrace strap with the camera.This is now my go-to lens and permanently resides on my D600 for about 85% of the time. Other times, I’m using my Nikkor 85mm portrait lens (beautiful bokeh) or my Nikkor 60mm Micro lens for close-ups.** My Bag Notes (System: Nikon D600 and Nikkor 24-120mm f/4 lens) **Tamrac Evolution 8: This is a well-designed and functional backpack/sling bag. I use this bag to store my camera system when not in use. Besides storage, I use this bag if I need to take everything or the “kitchen sink” with me to a photo event. Note: once this bag is filled (including laptop), it can get pretty heavy.Tamrac Aria 6: This is a soft and lightweight messenger bag. I actually use this bag primarily for photographing weddings and church events. If I know I will be shooting for several hours, this is the bag I take with me. I can carry my camera system along with an extra lens (e.g. Nikkor 85mm) and my Nikon SB-700 flash. I can also throw in my iPad or Kindle HD Fire into the bag.Lowepro Slingshot 102: This is one tiny bag. It’s also a nice non-bulky and lightweight bag. I gutted out the main camera compartment (removed the padded dividers). This bag will hold my camera system with the lens hood extended! I have to place the camera in sideways with the grip side facing the side opening. This bag will hold my camera system plus my SB-700 flash (stored folded in the top area). I use this bag for short trips and traveling when I don’t need to bring my “kitchen sink”. I imagine this would be a great bag for short hikes. One of the features I like about this bag is the ability to swing it from my back to the front and take out my camera for photo ops.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francisco Solareslarrave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6JENTW2JETID53ACICKSL5N4TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SMAPFPSKXWZL?ASIN=B00VIQOZJ2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2012",
                "reviewTitle": "5.0 out of 5 stars Good travel lens!",
                "reviewText": "I will not bash this lens just because it's a zoom, but I won't heap praise on it either. As far as zoom lenses go, this one is a fairly decent one, and in only one aspect is it better than its predecessor: constant aperture.Otherwise, I must say that this lens is a noble idea: a nice, vast range of focal lengths in one single package does the trick for traveling. And the lens itself isn't too heavy either! In fact, compared to other travel zoom lenses, this one strikes a decent compromise. It's lighter than the AFS 24-70 (but slower), and a bit heavier than its predecessor, the AF-S VRI 24-120 of variable aperture, and also heavier than it's cousin, the plasticky AF-S 24-85. Besides, the zoom rings are in the \"wrong\" position (the zoom ring is closer to the camera in the 24-70, while this one has it farther from the body) and this can make for some awkwardness while getting used to the lens (like trying to zoom with the focusing ring, for instance). However, this indecision in Nikon lenses is something I had to get used to, as there seems to be no standard regarding where the focusing and zoom rings will go in a lens.Since I purchased this lens shortly before a trip, I can report that the lens is remarkably tough, and that the lens hood comes in handy as an equally tough accessory. I don't know how many times the hood hit doors and walls (not too hard, admittedly), thus protecting the front lens element, but every time it happened, I was glad. I may update this review in regards to the distortion this lens may cause at its wide end (whether it appears), because it's something we must expect from it. However, all in all, despite it's being a tad slow (aperture starts at f4), this lens makes for an excellent and versatile travel companion. I have an upcoming stay in Spain, and I'm seriously considering taking this lens instead of my AF-S 24-70 because of its size and zoom range. However, let's see about distortion before making any further decisions. In the meanwhile, I should say it's worth a try and the price and conditions under which I bought my copy couldn't be beat (who would say not to buying this lens and paying it in about 24 interest-free installments with the Amazon store card?). Hence, it has my recommendation!EDIT: I write this only to confirm a statement I made in the text, about this lens being lighter than the AF-S 24-70. In fact, it's lighter enough to consider it the perfect travel lens. However, my experience has been odd: while in Chile, I took long walks with my D700 and this lens and I returned exhausted to my place because of what I thought was the heft of this lens (combined with the camera and battery pack). Much later, in Spain, I also walked a lot with my AF-S 24-70 (which I took with because it's faster), but I was not as dilapidated whenever I came back from my excursions as I was when I walked with the 24-120. In short... go figure. All in all, this is a very decent lens that shows no discernible barrel distortion at the wide end. At least, I didn't encounter any in the photos I made with this lens. Go ahead and try it!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Earl N.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 11, 2023",
                "reviewTitle": "Great👌",
                "reviewText": "Item was as described. And it arrived on timeHave not gotten the chance to test it yet so can't say more about it now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeferson Rodrigo da Silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 29, 2023",
                "reviewTitle": "Lente Versátil, só poder para a 24-70 2.8",
                "reviewText": "ótima lente, mas é um pouco escura. Sua nitidez máxima é alcançada em 5.6, a abertura máxima de F4 nem sempre é útil. Serve para todos os momentos, mas vai requerer um equipamento de iluminação, ou uma FF que consiga elevar um pouco o ISO sem dar trabalho na perca da nitidez.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris Lejarazu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 22, 2021",
                "reviewTitle": "El mejor lente que he utilizado",
                "reviewText": "Estoy feliz con este lente, por mucho el mejor que he utilizado. Su versatilidad es la mejor compañera para fotografía de paisaje y viajes. Aparte de que me llegó UN MES ANTES de lo planeado. Feliz con mi compra.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "eddiMioeddiMio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 2, 2018",
                "reviewTitle": "Allround-Zoom für Vollformat und APS-C (DX)",
                "reviewText": "Hier bei Amazon kann man bereits viele Rezensionen zum Nikkor 24-120 f4 lesen. Die allermeisten sind sehr positiv und das wohl auch zu Recht.Ich möchte jetzt weniger auf die einzelnen technischen Details eingehen, sondern würde gerne über meine Erfahrungen mit diesem Vollformatobjektiv an meiner APS-C-Kamera berichten.Seit 2010 bin ich im Nikon-System. Zunächst D90, dann D7000, D7100 und aktuell D7200. Also alles Kameras mit dem kleinen APS-C-Sensor, sprich Nikon DX. Neben einigen Standardzooms für DX habe ich mich auch mit Festbrennweiten beschäftigt und bin hierbei u.a. auch auf das 50mm 1,8 G gestoßen, welches für Vollformatkameras (Nikon FX) gebaut wurde.Dieses Objektiv war eine ganze Zeitlang mein Immerdraufobjektiv. Nicht nur die hohe Lichtstärke hatte mich überzeugt sondern vorallem die Tatsache, dass ich durch die Kombination aus kleinem APS-C-Sensor und dem „viel zu großen“ Linsendurchmesser auch eine ganz andere Bildqualität erreicht hatte. Meine Bilder hatten zum Beispiel keinerlei Randabschattungen mehr und die Bildqualität ist auch vom Zentrum bis hin zum Randbereich nicht mehr abgefallen. Klar, denn die Randbereiche mit der naturgemäß schlechteren Bildqualität liegen ja nun außerhalb des Sensorbereichs.Ich probierte weitere Festbrennweiten aus und kam schließlich zu dem Schluss, dass das Fotografieren mit Festbrennweiten zwar absolut seinen Reiz hat, aber mein persönlichen Anspruch doch mehr Richtung Flexibilität geht.Also konzentrierte ich mich wieder auf Zooms. Da mir allerdings meine DX-Objektive nicht genug Qualität lieferten (subjektive Bewertung) kam ich auf die Idee, mir ein vollformattaugliches Zoom anzuschaffen. So geschehen mit dem Nikkor 24-85 VR, was mich echt überzeugte. Tolles Ding, super Bildqualität, aber irgendwann wurde es mir am hinteren Ende zu kurz.Nach wirklich langem und ausführlichem Studiums des Internets traf ich dann endlich meine Entscheidung und bestellte das Nikkor 24-120 f4 ED VR.An einem APS-C/DX-Sensor verhält sich das Objektiv wie ein 36-180mm Zoom. D.h. es ist grade noch so weitwinklig geht aber dafür recht stark in den Telebereich.Es hat in allen Brennweiten eine durchgängige Eingangs-Blendenöffnung von f1:4. Das hört sich im ersten Moment zwar etwas lichtschwach an, ist aber in der Praxis kein Problem. Zu lange Verschlusszeiten werden durch den hervorragenden Bildstabilisator vermieden und (zumindest an der D7200) hat man auch noch annehmbare Bildqualität bei ISO 3200.Wenn man sieht, dass man auch bei einer Brennweite von 120mm mit der 4er-Blende arbeiten kann, dann relativiert sich der negative Gedanke der Lichtschwäche wieder.Ich möchte hier nochmals erwähnen, dass ich dieses Vollformatobjektiv an einer APS-C-Kamera verwende. Daher sind meine Erfahrungen nur auf diese Kombination bezogen und keinesfalls auf die Verwendung des Objektives an einer Vollformatkamera.Kommen wir zur praktischen Bewertung des Objektives.Das 24-120 ist ein tolles Allroundzoom für Reise und Reportage. Es ist mein Immerdraufobjektiv. Es umfasst am DX-Sensor einen Bildwinkel entprechend 36mm bis 180mm. Wer es gerne etwas kürzer (weitwinkliger) hätte, wird keinen Spaß daran haben.Ich selber bin kein Freund von besonders weitwinkligen Bildern und komme daher mit diesem Zoombereich gut klar.Da dieses Objektiv ja eigentlich zu groß ist für meinen kleinen Sensor, gibt es keinerlei Vignettierungen, Bildfehler oder Unschärfen in den Randbereichen.Je mehr Licht da ist, desto besser spielt es sine Trümpfe aus und liefert tolle Qualität bei allen Brennweiten und Blenden ab.Im Innenbereich bei künstlichem Licht ist man allerdings darauf angewiesen, den Bildstabilisator einzuschalten und die ISO hochzuschrauben bzw. den Blitz zu nutzen. Die Qualität ist auch bei schlechtem Licht recht gut, aber natürlich merklich schlechter als bei gutem Licht. In diesem Fall wäre eine Blende 2,8 oder größer natürlich schon sehr cool.Muss an dieser Stelle nicht erwähnen, dass das Nikkor 24-70 f2,8 VR mehr als doppelt so teuer ist und zudem am 50mm weniger Brennweite im Telebereich hat.Soviel zur Bildqualität. Beispielbilder sind anhängig.Das Objektiv ist sehr solide gebaut. Der Haupttubus besteht aus technischem Kunststoff. Beim Zoomen bewegen sich zwei Objektivröhren hin und her, welche aus einer Magnesiumlegierung gefertigt sind. Der Zoom-Ring läuft sehr weich und geschmeidig, der Fokus-Ring hat etwas Spiel und läuft nicht so weich wie der Zoomring.Das Objektivbajonett ist aus Metall gefertigt und verfügt über eine Gummidichtlippe.Darüber hinaus finden sich drei Schalter auf der linken Seite des Objektives. Der Umschalter für den Fokus-Modus, Einschalter für den Bildstabilisator und der Modus-Wahlschalter für den Bildstabilisator. Auch diese Schalter sind gegen Staub und Feuchtigkeit abgedichtet.Das gesamte Objektiv ist (laut Nikon) gegen Staub und Spritzwasser abgedichtet, so dass man das Objektiv auch im Regen oder am Strand betreiben kann.Als Zeichen für seine professionelle Ausstattung und besondere Verarbeitung hat Nikon diesem Objektiv den „goldenen Ring“ verliehen. Das zu Recht.Habe mehrfach bei Regen, Nebel und Meeresgischt auf Sylt fotografiert. Nie ein Problem gehabt.Das waren meine persönlichen Gedanken zu diesem tollen Objektiv.Ich muss gestehen, dass ich dieses Objektiv sehr schätze und es nicht mehr hergeben möchte. Aber ich muss auch eingestehen, dass mich so mancher Testbericht im Internet und den diversen Foren oftmals verunsichert hatte.Oftmals wird dieses Objektiv mit seinem Vorgänger verwechselt, welcher wohl wirklich mies war.Es gibt auch Experten die der Meinung sind, dass an eine APS-C-Kamera auch nur ein APS-C-Objektiv gehört. Ich bin kein Experte und ich will mich auch nicht als Experte aufspielen, aber ich kann diese Expertenmeinung absolut nicht bestätigen. Ganz im Gegenteil.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7192ezUOHwL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/815DOkV6g7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61tv0ZaLZML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61OTjT8tW0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71UV39aMeOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71FqygL50qL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61MbZyLHfOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81uNtISbRIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71x2pttAYeL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ezZOiz4tL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61l25S-Cu7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71BfCvyKihL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81VFFrNTDtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Cfuz8eHfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71vEtdJp2BL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wayne Nugent",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 15, 2023",
                "reviewTitle": "Incredibly fast and a good price",
                "reviewText": "Great price very prompt delivery",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$399.00",
                "sellerName": "Port Hole Renewed",
                "sellerRating": "4.5"
            },
            {
                "price": "$429.00",
                "sellerName": "Minty Gadgets (we track serial numbers)",
                "sellerRating": "5"
            },
            {
                "price": "$429.99",
                "sellerName": "Xpress Products (We track Serial Numbers)",
                "sellerRating": "5"
            }
        ]
    }
}