{
    "remaining_requests": 41504,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Certified-Lightning-Charging-Compatible-Multi-Color/dp/B0B8CJRPTW",
    "body": {
        "name": "MenoSupp iPhone Charger [Apple MFi Certified] 3Pack 10FT Lightning Cable Fast Charging iPhone Charger Cord Compatible with iPhone 13 12 11 Pro Max XR XS X 8 7 6 Plus SE and More (Multi-Color)",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Certified-Lightning-Charging-Compatible-Multi-Color/dp/B0B8CJRPTW",
        "soldBy": {
            "sellerID": "AMJW0COIB6VAH",
            "name": "dongqianqian8784",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AMJW0COIB6VAH&asin=B0B8CJRPTW&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CMQPRMDZ"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41BbD4ph1JL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41HuRU2pq4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41b6pReKTJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41R6o4EcqSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41irvs8XdzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rxcaIuwDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LYFFwZ33L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: MenoSupp",
            "link": "https://www.amazon.com/MenoSupp/b/ref=bl_dp_s_web_69586709011?ie=UTF8&node=69586709011&field-lbr_brands_browse-bin=MenoSupp"
        },
        "brand": "MenoSupp",
        "merchantInfo": "GRDYMX",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 22051,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 9 hrs 47 mins",
            "FREE pickup Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 10 hrs 2 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✨【iPhone Charger Fast Charging】: iPhone charger cable is made of high-purity copper core and intelligent chip, with overcharge protection, stable current protection, automatic switching, and battery protection, and can support up to 2.4A fast charging and 480 Mbps transfer speed.",
            "✨【Apple MFi Certified】: Manufactured with Apple chips, the Lightning cable fully supports iOS versions and all future updates. They are certified for high quality, tensile strength, fast charging, and 480Mbps transfer speed, ensuring full charge and sync compatibility with your iPhone devices.",
            "✨【Delightful Length&Superior Durability】3 colorful Apple MFi-certified iPhone charging cable, 10 feet extra long, feel free to choose where to charge. iPhone charging cable with reinforced joint designs that have passed many times bending tests for extra protection and durability.",
            "✨【iPhone Perfect Compatibility】: iPhone charger cable MFi certified to ensure a full charge and compatible with iPhone 13/12/11/11 Pro/11 Pro Max/XS/XS Max/XR/X/8 Plus/8/7 Plus /7/Sync 6s Plus/6s/6 Plus/6/5s/5c/5/Air 2/mini/mini 2/mini 4 etc.",
            "✨【High Quality, High Service】: Apple MFi certified 3 iPhone charging cable, 10 feet extra long, convenient to charge your device in bedroom, sofa, office, back seat of car, travel, if you have any product questions, please get in touch with us anytime. Our service team will provide you with a satisfactory solution within 24 hours."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Cables & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=23666438011"
            },
            {
                "name": "Cables & Interconnects",
                "link": "https://www.amazon.com/Cables-Interconnects-Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_5?ie=UTF8&node=172463"
            },
            {
                "name": "Lightning Cables",
                "link": "https://www.amazon.com/Lightning-Cables/b/ref=dp_bc_aui_C_6?ie=UTF8&node=6795233011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "MenoSupp"
            },
            {
                "name": "Connector Type",
                "value": "Lightning, USB Type A"
            },
            {
                "name": "Cable Type",
                "value": "Lightning"
            },
            {
                "name": "Compatible Devices",
                "value": "iphone"
            },
            {
                "name": "Special Feature",
                "value": "High Speed, Heat Resistant, Fast Charging"
            },
            {
                "name": "Compatible Phone Models",
                "value": "iPhone 13/12/11/11 Pro/11 Pro Max/XS/XS Max/XR/X/8 Plus/8/7 Plus /7/Sync 6s Plus/6s/6 Plus/6/5s/5c/5/Air 2/mini/mini 2/mini 4"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "iPhone"
            },
            {
                "name": "Color",
                "value": "Colorful"
            },
            {
                "name": "Connector Gender",
                "value": "Female-to-Male"
            },
            {
                "name": "Data Transfer Rate",
                "value": "0.48 Gigabits Per Second"
            },
            {
                "name": "Shape",
                "value": "Round"
            },
            {
                "name": "Number of Pins",
                "value": "8"
            },
            {
                "name": "AC Adapter Current",
                "value": "2.4 Amps"
            },
            {
                "name": "Unit Count",
                "value": "3 count"
            },
            {
                "name": "Item Weight",
                "value": "4.8 ounces"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Model Name",
                "value": "Daniu-A01"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Outdoor, Indoor"
            },
            {
                "name": "Number of Items",
                "value": "3"
            },
            {
                "name": "Package Dimensions",
                "value": "8.98 x 5.91 x 0.59 inches"
            },
            {
                "name": "ASIN",
                "value": "B0B8CJRPTW"
            },
            {
                "name": "Item model number",
                "value": "Daniu-A01"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 22,051 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#124 in Lightning Cables"
            },
            {
                "name": "Special features",
                "value": "High Speed, Heat Resistant, Fast Charging"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Audio Jack",
                "value": "Lightning"
            },
            {
                "name": "Whats in the box",
                "value": "iphone charger"
            },
            {
                "name": "Manufacturer",
                "value": "MenoSupp"
            },
            {
                "name": "Date First Available",
                "value": "August 2, 2022"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Made of high-quality materials Superior craftsmanship is mainly the use of superior materials. This charging cable uses high-purity and thicker copper wire, which makes the transmission and charging more stable. For iPhones, stable charging is very beneficial to battery life. Fast charging and transferring data To reduce cable resistance and increase charging speed, high-quality four-core copper wire is used internally, so in most cases, your device can charge at 2.4 amps and transfer files at 480Mbps. Sturdy and wear-resistant This charging cable is covered with pvc material, which makes it stronger and more durable. Not easily damaged when pulled, folded, bent.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ebf3181b-dfaf-49b5-976f-810e0c498758.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4c6dcf9e-297f-413a-8608-b67bdd3fe3bb.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2e8ddaab-5637-4105-968c-72ccd954abf3.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6ca29bc1-7478-4802-ba5f-59aa6f56d56b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ebf3181b-dfaf-49b5-976f-810e0c498758.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4c6dcf9e-297f-413a-8608-b67bdd3fe3bb.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2e8ddaab-5637-4105-968c-72ccd954abf3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/16c2d43a-b7d5-4ecf-a6b8-dfd784682ab9.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "IR8",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMQHV4MOKB7WSML2JB4BF5RTYTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MEVMID7AHIX7?ASIN=B0B8CJRPTW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Charger!",
                "reviewText": "⭐⭐⭐⭐⭐I couldn't be happier with the Apple MFi Certified iPhone Charger 3 Pack! These 10 FT Lightning Cables have been an absolute game-changer for me. Here's why I'm giving them a solid 5-star review:1. **Fast Charging:** These cables truly live up to their promise of fast charging. My iPhone charges in no time, which is a lifesaver when I'm in a rush or need a quick top-up before heading out.2. **MFi Certified:** Knowing that these cables are MFi certified brings peace of mind. I don't have to worry about compatibility issues or potential damage to my precious iPhone. These cables are designed to work seamlessly.3. **Durable and Tangle-Free:** The quality of these cables is impressive. They are sturdy, and the 10 FT length is incredibly convenient. Plus, they don't tangle easily, which is a huge plus for someone who's always on the go.4. **Convenient 3-Pack:** Having three cables in one pack is fantastic. I can keep one at home, one in my car, and one at the office. It's a small investment for the convenience and peace of mind it provides.5. **Affordable:** These cables are competitively priced, especially considering the quality and performance. I've spent more on less reliable cables in the past, so this pack of three is a great deal.Overall, these Apple MFi Certified iPhone Charger Lightning Cables have been a lifesaver for me. They charge my iPhone quickly, are durable, and offer excellent value for the price. I highly recommend them to anyone in need of reliable charging cables for their Apple devices.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hannah Bohbot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYSROH5ZGMLIKQNKRLL26U5II4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18B7VVNBRBXSP?ASIN=B0B8CJRPTW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Aesthetic and Functional!",
                "reviewText": "I've been in the market for a durable, long charging cord for my iPhone for years! I've gone through so many that quickly fray or break after just a week or two of use. This one is definitely a game-changer!First and foremost, the length of this charging cable is a game-changer. It offers an incredible amount of flexibility and convenience, allowing me to comfortably use and charge my devices even when the power outlet is not within close reach. Whether I'm sitting on the couch, lying in bed, or working at my desk, the extra-long cable ensures that I can continue using my device without any restrictions.The durability of this charging cable is exceptional. The high-quality construction and reinforced connectors make it sturdy and long-lasting. I no longer have to worry about frayed or damaged cables that require frequent replacement. This cable is built to withstand everyday use and withstands the test of time.Another standout feature is the tangle-free design of the cable. It stays neat and organized, even when stored or transported. This eliminates the frustration of untangling knots or dealing with messy cables, allowing for a hassle-free experience every time.The price is reasonable, especially considering the superior quality and extended length it offers. It's a worthwhile investment that pays off with its convenience and reliability. The beautiful colors are just another bonus!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Online Gourmet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGW7ZIKGUIGOAT6VIU45K3JNDKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM4IDZZX7SO2P?ASIN=B0B8CJRPTW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Outstanding Apple MFi Certified iPhone Charger - Reliable, Fast, and Colorful!",
                "reviewText": "I recently purchased the iPhone Charger [Apple MFi Certified] 3Pack 10FT Lightning Cable, and I couldn't be happier with the performance and convenience these cables provide. As an Apple user, having a reliable and fast charging cable is essential, and this product has proven to be an exceptional choice. Allow me to share my experience with this outstanding iPhone charger.First and foremost, the Apple MFi certification of these lightning cables guarantees their compatibility and reliability with all Apple devices. Whether I have the latest iPhone 13, 12, 11 Pro Max, XR, XS, X, or even older models like the 8, 7, 6 Plus, or SE, these cables work seamlessly. I appreciate the peace of mind that comes with knowing my devices are protected and will charge efficiently without any error messages or compatibility issues.The 10FT length of these lightning cables is a game-changer. It provides the freedom and flexibility to charge my devices comfortably while still using them. Whether I'm in bed, on the couch, or sitting at my desk, the generous length allows me to use my iPhone while it's charging without feeling restricted. It's a convenient feature that enhances my productivity and overall user experience.The fast charging capability of these cables is impressive. They deliver a reliable and efficient charge, reducing the waiting time and ensuring my devices are ready to go when I need them. The durable construction of the cables guarantees their longevity, so I can rely on them for fast charging for a long time to come. It's a time-saving feature that I greatly appreciate.The inclusion of three cables in different vibrant colors is a delightful bonus. The multi-color set adds a touch of personality and fun to my charging routine. It also makes it easy to differentiate between cables when charging multiple devices or sharing with family and friends. The color variety adds a pop of excitement to my charging setup.Furthermore, the build quality of these lightning cables is outstanding. The connectors are sturdy and fit securely into my devices, ensuring a reliable and stable connection. The cables themselves are made of high-quality materials that resist tangling and fraying, even with regular use. This durability ensures that my cables remain in excellent condition for long-lasting performance.Lastly, the customer service provided by the seller is exceptional. They were responsive and attentive, addressing all my inquiries promptly. The packaging was secure, and the cables arrived in perfect condition. Their commitment to customer satisfaction is commendable and further reinforces my confidence in their product.In conclusion, the iPhone Charger [Apple MFi Certified] 3Pack 10FT Lightning Cable is an outstanding investment for any Apple user. Its reliability, fast charging capability, generous length, vibrant colors, and excellent build quality make it the perfect charging solution. I highly recommend these lightning cables to anyone seeking a reliable and convenient way to charge their iPhone. Choose these cables and experience the convenience and efficiency they bring to your charging routine!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.99",
                "sellerName": "GRDYMX",
                "sellerRating": "5"
            },
            {
                "price": "$9.99",
                "sellerName": "guanweikunSDTTIJJG",
                "sellerRating": "5"
            },
            {
                "price": "$9.99",
                "sellerName": "Maoyuan Huanxiang Store Shenzhen Branch 0322",
                "sellerRating": "5"
            }
        ]
    }
}