{
    "remaining_requests": 851,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dance-Donegal-Jennifer-Deibel/dp/0800738411",
    "body": {
        "name": "A Dance in Donegal",
        "price": "$11.03",
        "originalPrice": "$17.00",
        "rawPrice": 11.03,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dance-Donegal-Jennifer-Deibel/dp/0800738411",
        "soldBy": {
            "sellerID": "A17QD08NDKY2KP",
            "name": "ARAUA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A17QD08NDKY2KP&asin=0800738411&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "23",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/519bBnzK-2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51wj5qi9PcL.jpg",
            "https://m.media-amazon.com/images/I/61krk70Sj8L._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jennifer Deibel",
            "link": "https://www.amazon.com/Jennifer-Deibel/e/B089X4VQ5V/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ARAUA",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 443,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews From the Back Cover \"Jennifer Deibel's debut is rich in atmosphere, family mystery, and sweet romance. A gem!\"--Julie Klassen, author of The Bridge to Belle IslandAll her life, Boston-born Moira Doherty has relished her mother's descriptions of the Emerald Isle. When her mother dies unexpectedly in the summer of 1920, Moira is compelled to fulfill her dying wish--that she become the teacher in Ballymann, the beloved village in Donegal, Ireland, she's heard so much about.After an arduous voyage, Moira begins a challenging new job in an unfamiliar and ancient country. Though a few locals offer a warm welcome, others are distanced by superstition and suspicion. Rumors about Moira's mother are unspoken in her presence but threaten to derail everything she's journeyed to Ballymann to do. Moira must rely on the kindness of a handful of friends--and the strength of Sean, an unsettlingly handsome thatcher who keeps popping up unannounced--as she seeks to navigate a life she'd never dreamed of . . . but perhaps was meant to live.\"With an authenticity born of having lived in Ireland herself, the author deftly paints a lush landscape, colorful customs, and memorable characters with personal journeys of their own. This impressive debut marks Jennifer Deibel as an author to watch.\"--Jocelyn Green, Christy Award-winning author of Veiled in Smoke\"Fans of Catherine Marshall's Christy will want to clear room on their favorites shelf because this one's earned a place alongside!\"--Kristy Cambron, bestselling author of The Paris Dressmaker and The Butterfly and the ViolinJennifer Deibel is a middle school teacher whose work has appeared on (in)courage, on The Better Mom, in Missions Mosaic magazine, and other publications. With firsthand immersive experience abroad, Jennifer writes stories that help redefine home through the lens of culture, history, and family. After nearly a decade of living in Ireland and Austria, she now lives in Arizona with her husband and their three children. You can find her online at www.jenniferdeibel.com. About the Author Jennifer Deibel is the author of A Dance in Donegal (winner of the Kipp Award for Historical Romance), The Lady of Galway Manor, and The Maid of Ballymacool. Her work has appeared on (in)courage, on The Better Mom, in Missions Mosaic magazine, and in other publications. With firsthand immersive experience abroad, Jennifer writes stories that help redefine home through the lens of culture, history, and family. After nearly a decade of living in Ireland and Austria, she now lives in Arizona with her husband and their three children. You can find her online at JenniferDeibel.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 47 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"Deibel's descriptions of Ireland's landscape, enticing cuisine, sonorous language, and vibrant culture converge to form a spectacular background for the story.\"--BookPage starred reviewAll of her life, Irish-American Moira Doherty has relished her mother's descriptions of Ireland. When her mother dies unexpectedly in the summer of 1920, Moira decides to fulfill her mother's wish that she become the teacher in Ballymann, her home village in Donegal, Ireland.After an arduous voyage, Moira arrives to a new home and a new job in an ancient country. Though a few locals offer a warm welcome, others are distanced by superstition and suspicion. Rumors about Moira's mother are unspoken in her presence but threaten to derail everything she's journeyed to Ballymann to do. Moira must rely on the kindness of a handful of friends--and the strength of Sean, an unsettlingly handsome thatcher who keeps popping up unannounced--as she seeks to navigate a life she'd never dreamed of . . . but perhaps was meant to live.Jennifer Deibel's debut novel delights the senses, bringing to life the sights, sounds, smells, and language of a lush country and a colorful people. Historical romance fans will embrace her with open arms.\"God's redemptive love is the highlight of this debut work . . . Fans of historical Christian romances in the vein of Kristi Ann Hunter and Jen Turano will want to keep an eye on Deibel.\"--Library Journal\"Deibel's exemplarily executed debut is a touching tale of love and forgiveness that also beautifully captures the warmth and magic of 1920s Ireland. The author's flair for vivid characterization is especially striking in Moira, whose realistic struggles with her faith give her memorable depth and relatability.\"--Booklist Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Christian Books & Bibles",
                "link": "https://www.amazon.com/Christianity-Religion-Spirituality-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=12290"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Fiction-Poetry-Christianity-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172806"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Revell (February 2, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0800738411"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0800738419"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.88 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#77,003 in Books (See Top 100 in Books) #328 in Christian Historical Romance #466 in Christian Historical Fiction (Books) #7,951 in Historical Romances"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 443 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/1552e23c-f2f5-454c-b1c2-281530675793.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dec58109-e453-4356-9f9a-d6acbaf1109c.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bd4e48b3-51ed-478d-ba92-17be937f7a53.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "lighthouse88",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEJI4X7IL5GWC62TIHPQBEP3OLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H4AFRAHFSSZJ?ASIN=0800738411",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 30, 2021",
                "reviewTitle": "5.0 out of 5 stars Heart grabbing tale",
                "reviewText": "If you like stories set in Ireland that have the flavor of the Gaelic language, with a touch of romance and a flair of mystery, here is the book to read. The novel is a debut by author Jennifer Deibel who has herself been immersed in the Irish culture shares the richness of the Emerald Island through this tale. The lead character is a young woman currently living in Boston with her mother; her name is Moira Doherty. Moira’s mother has been sharing stories of Ireland for all of Moira’s life. They stirred in her heart the desire to go there someday. Well, for Moira that day has arrived. After losing her mother and not sure what she is to do, she senses the Lord telling her to go forward with her plans. With her head filled with stories of her mother’s homeland along with the ache of her mother’s death, Moira steps into her future. From the moment she lands on the island, she encounters a different language with some very different customs and beliefs. Moira is welcomed into her temporary place of residence as she acclimates to the area in preparation to teach the children of the town’s school.Throughout the book there is something in Moira’s past that she is unaware of, but all the people in town seem to know and look at her with questioning eyes. Moira is a young woman with hopes to understand what has drawn her to the very town her mother grew up in and what secret lies in her mother’s life that is impacting Moira’s life now. Moira is befriended by most of the local town’s people though she has a few of them who are threatening her with revealing her secret, the secret Moira doesn’t know.The climax in the book is well written and comes with such heart-pounding force I couldn’t help but continue reading to see how it would be resolved. The book started out slow for me but quickly progressed as I was drawn into the mystery of what lay behind Moira’s life. The author has another Irish romance novel forthcoming, and a teaser is included in the back of the book. I look forward to her next book that I hope includes the flavors of faith, romance and a touch of mystery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alissa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFS5MB4PAFVTITXBOVPEB67O33FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDIYCXKOVDIIF?ASIN=0800738411",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2021",
                "reviewTitle": "4.0 out of 5 stars Escape to the windswept shores of Ireland....",
                "reviewText": "Escape to the windswept shores of Ireland and experience a small Irish village through the eyes of Moira, the new American schoolteacher who has returned to the place of her mother’s birth to shepherd the students of the small community. Upon her arrival, she finds that her mother’s reputation is not what it should be, and she deals with foes young and old who hold the past against her. Amid it all, the kind and handsome thatcher Sean shows strength and compassion through various trials and tribulations, and an undeniable connection is formed. As troubles abound, Moira questions her choice in starting this new life she never dreamed of, but that God has designed especially for her.Rich with descriptions of the Emerald Isle and her culture, this story allows escape to the wonderous place that is Ireland. I truly felt like I was standing on the cliffs of Ireland with Moira. I could hear the Irish music floating on the wind. I could hear the lilt of the voices in the village. I could see the rolling green hills dotted with thatched cottages and stone ruins. As someone who is longing to visit Ireland, this book was a fantastic escape until I can experience the real thing. The story was rich in historical knowledge and cultural depiction that I loved, and I feel like we really get a glimpse of life in a small Irish village in the 1920s. While the story is a wonderful example of redeeming love and forgiveness, this was not a light-hearted story. It is rich with lessons and spiritual truths, but there are parts of the narrative that are much heavier in subject than I ever expected. However, the heavy parts of this book clearly define the message of God’s redeeming love and restoration, which is perfectly depicted by the time you reach the story’s wonderful ending. I wish the romance were more prominent in the plot, but the protective and handsome hero and strong heroine make the love story sweet as they face troubles together. With strong spiritual truths, unparalleled depictions of Ireland and her culture, well-developed and heartfelt characters, a gentle romance, and a heartwarming conclusion, this story is a well-written gem and should not be missed. I highly recommend A Dance in Donegal to any fellow lover of Ireland and her culture, and I cannot wait to see what Jennifer Deibel does in her next sweeping Irish romance.I received a copy of this book from the author and the publisher for review purposes. My thoughts are my own. I really did enjoy it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P. Lawrence",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDEKNEOZ3MQ4TFWSGK5ISDHQRTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19F5Z2EHLGSW?ASIN=0800738411",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2021",
                "reviewTitle": "5.0 out of 5 stars I couldn’t put it down!",
                "reviewText": "In just a little over 300 pages, Jennifer Deibel has succeeded in pulling me deeply into the lives of the people of Ballymann, and I want to know more......More about Moira, the strong yet vulnerable adventurer whose reliance on God, faith, forgiveness, and willingness to learn left me wondering about her earlier years in Boston and what is next in store for her in Ireland....More about the people Moira met here: more of Peg and Colm’s love story; how Sean and Declan became such opposites after growing up in the same place and time; and more of the children at Moira’s school.The exploration of cultures, superstitions, and unapologetic sharing of faith in God regardless of background inspire me to be mindful of my own approach to situations whether joyful or painful.I found the reading pace to be comfortable, with descriptions of people, the land and sea, and village life being sufficient to paint pictures in my mind without getting bogged down in the details.Special kudos to Hannah, artist and the daughter of the author, for the map which is so helpful in imagining the physical layout and distances among sites in and around the village. Thank you for sharing this precious gift.I received a free advance copy of this book as a member of the launch team, and purchased a copy to share as well. This is my honest review, and I eagerly await the next of what I believe will be many more inspiring novels from Jennifer Deibel.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louise",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 7, 2021",
                "reviewTitle": "Lovely book",
                "reviewText": "Lovely book couldn't put it down",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 3, 2022",
                "reviewTitle": "Sweet",
                "reviewText": "Lovely Christian historical romance! Well written, with themes of forgiveness, trust and redemption woven throughout the story. Lots of scripture references included in a natural flow, without being awkward or preachy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.14",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}