{
    "remaining_requests": 860,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Town-Called-Paradox-Richard-Starks-ebook/dp/B08LG9XZL9",
    "body": {
        "name": "In A Town Called Paradox",
        "price": "$7.99",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Town-Called-Paradox-Richard-Starks-ebook/dp/B08LG9XZL9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/919pSEF7QhL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Richard Starks",
            "link": "https://www.amazon.com/Richard-Starks/e/B001K8CSNS/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 93,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Nominated as BOOK OF THE MONTH by Discovering Diamonds, a leading independent book-review site. \"In A Town Called Paradox is one of those rare, glittering reads that traps the reader immediately and doesn't let go. Thank you for an emotional, gripping and utterly rewarding read.\"Selected as an INDIE BOOK WE LOVE by LoveReading, a top book-recommendation website. \"This book will grab your attention from page one... I hope you will read and thoroughly enjoy it, as I did...\"I WASN'T looking for Marilyn Monroe even though I knew she was in town filming River of No Return... So begins In A Town Called Paradox – set in Utah during the 1950s when the Big Five Hollywood studios arrived to film their blockbuster movies.Corin Dunbar – banished to live with her aunt Jessie, an obsessively religious spinster who runs a failing cattle ranch in Utah – hates her new life until Hollywood transforms the rural backwater of Paradox into a playground for glamorous stars. Seduced by the glitz, Corin finds work in the movies, but after a brush with the casting couch channels her growing ambition into saving the ranch—the jewel of the Dunbar family for three generations.When Corin falls for Ark Stevenson – a charismatic stranger drawn to Paradox by his fascination with the movies that are filmed there – her future seems bright. That’s not the outlook facing Yiska Begay, a Navajo on the run from prison.These three different lives unexpectedly collide as each of them seeks their own kind of freedom: Corin is determined to cast off the restrictions imposed on her by society; Ark yearns for a spiritual freedom after he suffers a horrific accident; and Yiska is desperate to regain the physical freedom he has unjustly lost.In a gripping climax, Corin is faced with an agonizing dilemma. She can win them all the freedoms they crave - but only at a heartbreaking cost.Told mainly by Corin—now a middle-aged woman still haunted by her decision—In A Town Called Paradox is a poignant love story that explores some of the ideas and beliefs that shape our lives as it asks the question: If each of us has a life story, who determines how it unfolds - and how it should end?",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B08LG9XZL9"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Prestwicke Publishing (February 3, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 3, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1046 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 318 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#612,816 in Kindle Store (See Top 100 in Kindle Store) #907 in Native American Literature (Kindle Store) #3,180 in U.S. Historical Fiction #3,335 in Small Town & Rural Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 93 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "S. Ritchie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3KUYOSF3OUYF5E4F5AOSTCXKZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21EUUABDDDWUJ?ASIN=B08LG9XZL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Long, but worth the time",
                "reviewText": "I really loved this book. It gets better and better the further you read. There are several stories that weave together and even though it has some heartbreaking moments, the end result is as it should be.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Readerly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJHI6KGEOTGXW7AEAJYKHQU4H3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C4R4ZWIW6PXE?ASIN=B08LG9XZL9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2021",
                "reviewTitle": "4.0 out of 5 stars Vividly descriptive",
                "reviewText": "There’s no question that the authors of “In a Town Called Paradox” are pros at vividly-descriptive writing. Their non-fiction books have transported me to unusual destinations across the world where they’ve traveled in order to research their subjects. From ancient monasteries across Spain, to some of Tibet’s most rugged mountains, to the belly of the Amazon, I’ve been there with them. None of the Starks-Murcutt team’s keen observational skills coupled with their facility with words are lost on “In a Town Called Paradox.” I was quickly whisked away to the iconic red rock landscape of Utah under its brilliant blue skies, and remained there throughout the book.The characters in “Paradox” are also colorful and carefully drawn, from protagonist Corin Dunbar, her aunt Jessie and infamous friend Dottie, to a host of others including small town cattle ranchers, law enforcement officers, a Native American prison escapee, and various cast members on location for ’50’s Hollywood films.“In a Town Called Paradox” is mostly fast-paced from start to finish, and covers a great deal of ground. As a reader, I would have preferred less detail about a few of the many topics addressed within the book (the divergent views on death come to mind) and even eliminating a few sidelights that seemed unnecessary to the plot (such as the Rock Hudson reference). But the book still captured my attention with its well-researched references to astronomy, Native Americans, film-making in the 1950’s, and even the unexpected topic of bull insemination.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William L. Korstad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUXNKCQCRXY4WCNDYWC7VN3JWTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYLWZSVZQJXBS?ASIN=B08LG9XZL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2021",
                "reviewTitle": "5.0 out of 5 stars An gripping story with am exciting ending",
                "reviewText": "Paradox is a gripping tale about a young woman, Corin, whose family tragedy sends her from a comfortable urban life with her loving father to live in rural, unfamiliar Utah with her spinster aunt. Once there, Corin quickly adapts to her new surroundings. You watch her experience each new challenge with ever-increasing confidence. She experiences the joys of life but is dealt a terrible blow. Her encounter with a runaway convict provides the ultimate test of principle vs. duty.The book presents a colorful cast of characters that play in and out of Corin’s life for better or worse. Unlike authors such as William Kent Kruger and Ken Follett, who write lengthy episodic stories marching towards an increasingly obvious climax, we are never sure of Corin’s ultimate fate until the very end.I’m usually a slow reader, preferring to enjoy the scenery along the way. But the last hundred pages of ever-increasing intensity held my concentration until I finished the book at 3 a.m.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V. Borders",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFPSJECVM3JCMGHVJTKPSKU74RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K77DI98ST509?ASIN=B08LG9XZL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2021",
                "reviewTitle": "5.0 out of 5 stars A gripping, satisfying, story of love.",
                "reviewText": "I loved this story from the very beginning, it grabbed me immediately. Many times during reading, I would be in tears - but they were loving tears. Such a beautifully written story of the lives of 4 different people who all come together in a surprising and very satisfying ending. I hated to see this story come to an end. I will be following these two authors to see what they come up with next!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol Hansen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWCHKZZYL37IV77MBVNRSX4SADA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZNHCJS2Y6B3U?ASIN=B08LG9XZL9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2021",
                "reviewTitle": "4.0 out of 5 stars The story keeps you interested, keeps moving along",
                "reviewText": "I liked the character development, how one character is destroyed halfway through the book. It had some sad parts and some revealing parts. There was good research into small towns in Utah. I could picture it being near or in red rock country. It was a good picture of life in a small town and all the interactions that occur. My favorite character was Yskay Begay aka Lowell Smith, a native, with a great natural look on life, having escaped from prison. I didn't really connect with Jesse. David Smith",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cats7449",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYYTEWMXFTMGXXXUBWDR2LV673A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R350JU72NJBCV?ASIN=B08LG9XZL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2023",
                "reviewTitle": "5.0 out of 5 stars This book was so good...",
                "reviewText": "that I'm turning around and reading it all over again. Highly recommended, both for the beautiful story and the elegant language.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "On_a_Sandbar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQSXD5OIWEULLWFD5OTRJ5OO23A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5RGKOX5TF6KJ?ASIN=B08LG9XZL9",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2021",
                "reviewTitle": "3.0 out of 5 stars Unique historical fiction!",
                "reviewText": "The life of Corin Dunbar changes drastically when she is sent as a child from her home in Yonkers, NY to live with her aunt Jessie in the small desert town of Paradox, Arizona. Paradox becomes a film making mecca for Hollywood westerns of the 1950’s and’60’s.I really enjoyed the first half of this engrossing piece of 1950’s/60’s historical fiction., I was thinking this would be at least a 4 star or possibly a 5 star rating. After the halfway point, the story took a u-turn, with too much going on in different directions and I did not care for the path the plot took. I ended up giving 3 stars on Goodreads. For me, it was a disappointment.CW: sexual harassment, sexual assault, violence, assisted suicidePublication date: 2/3/2021Thank you to NetGalley and Prestwick Publishing for my e-arc in exchange for an honest review",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EricG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZAYJ2YZJSNR4CTS3YYYTQKNORQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QJ937S9G5GHP?ASIN=B08LG9XZL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2021",
                "reviewTitle": "5.0 out of 5 stars Beautifully done !",
                "reviewText": "This fascinating novel has everything a reader would want: interesting plot and characters and very fine descriptive writing that brings the reader directly into the action. The fact that the authors use plot twists and the dilemmas of their characters to make thoughtful and perceptive comments about life and love in general raises the novel far above most of the popular fiction of the day. Don’t be surprised if this turns into a successful film script !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pat Davies",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 15, 2021",
                "reviewTitle": "Compelling story",
                "reviewText": "Lots of twists and turns, and a great scenic background, in this story full of secrets, heartbreak and redemption",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 8, 2021",
                "reviewTitle": "You'll root for Corin every step of the way",
                "reviewText": "A terrific read. We follow Corin Dunbar’s life journey in Utah in the mid-50s while she and her Aunt Jessie (the sort of believer who gives religion a bad name) struggle with a failing ranch while the visiting Hollywood studios—filming westerns in the surrounding red-rock country—add a touch of excitement to the small town of Paradox. Among the finely detailed supporting characters are the full-blooded Navajo Indian Yiska Begay, who bears his great injustice with equally great dignity, and Ark Stevenson, Corin’s soon-to-be husband who can tell you a story about every star in the sky. At the heart of it all are choices. Corin meets every one head on with a brave, open heart as she copes with the tragedy that befalls her. Lots of twists and turns cap this fine tale.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}