{
    "remaining_requests": 785,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Last-Wicked-Scoundrel-Scoundrels-Novella-ebook/dp/B00DQ859VI",
    "body": {
        "name": "The Last Wicked Scoundrel: A Scoundrels of St. James Novella",
        "price": "$4.99",
        "originalPrice": "",
        "rawPrice": 4.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Last-Wicked-Scoundrel-Scoundrels-Novella-ebook/dp/B00DQ859VI",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81c7BRUg9kL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lorraine Heath",
            "link": "https://www.amazon.com/Lorraine-Heath/e/B000APAQ54/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 967,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157305011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00DQ859VI"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Avon Impulse (January 7, 2014)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 7, 2014"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 827 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 170 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#157,361 in Kindle Store (See Top 100 in Kindle Store) #1,012 in Scottish Historical Romance (Books) #1,473 in Mystery Romance #2,459 in Victorian Historical Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 967 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ChristiReadsALot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG53XRBF7KLZ3KNTWIAGEYGVV2LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HWN9UL2HFD0R?ASIN=B00DQ859VI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2021",
                "reviewTitle": "5.0 out of 5 stars Perfect end to Scoundrels of St James series!",
                "reviewText": "The Last Wicked Scoundrel is a novella/end to the Scoundrels of St. James series. I’ve been looking forwarded to these 2 characters getting their HEA from book 1 so I was so excited to get to their story. I do wish this was longer than a novella but that’s just because I never wanted it to end and I love LH’s writing so much. 😁😍William Graves father was a grave robber and took William along with him when he was a young lad. After his mom died, his father abandoned him and William found himself alone and on the streets at 8-years-old, and soon fell in with Feagan (a man who managed a group of child thieves). You will definitely get more out of this novella if you read the series in order as events in this go back to something that occurred in book 1 of the series. Winifred “Winnie”, Duchess of Avendale, is living life as a widow and raising her young son. It’s been 3 years since the death of her husband, who was a cruel and abusive man. Winnie has been spending lots of time with Dr. William Graves and plans to put her funds towards helping build a hospital for him.This read was so sweet and special. I loved Winnie and William’s connection, they originally met in book 1 so they have years of time spent near one another. This has mutual pining which I adore and William was of course the doctor/caretaker for when Winnie was injured and abused by her husband. I loved all the rest of William’s friends in this series, they are all so central to one another’s lives and stories so this was just a treat to have them all together again. I especially loved seeing Winnie come into her own and break out of that fragile shell she became by being abused, I loved that she fought for fellow women and even opened a sanctuary for fellow survivors of domestic abuse.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AZsenorita",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4K53BRH3RVMWHDCI7PHD73WC3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYRH6Y4W2IQ2I?ASIN=B00DQ859VI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 18, 2023",
                "reviewTitle": "4.0 out of 5 stars The handsome Dr",
                "reviewText": "William & WinnieThis is the 5th and final book 📕 for Scoundrels of St James series by Lorraine Heath. It was shorter than the other 4 books so their romance was a little bit short compared to the others. The H in this story a physician who grew up with the group of children thieves. Their comradeship was as strong as when they grew up together on the streets as adults. The h is supposedly widowed from a cruel monster of a husband that beat her within an inch of her life. The group then come up with a scheme to fake his death and send him off to Tasmania on a prison ship. In the meantime the H takes care of h and nurses her back to not only physical health but also gives her the confidence that she never had in her abominable marriage. They fall in love with each other but suddenly the h starts having weird things happening at her home where she suspects the husband has come back to haunt her. In reality it takes him 3 years to escape and return to London. He starts messing with h and she thinks she’s going mad. There is a final confrontation where the husband tries to kill H and plans to declare her mad to be sent to an asylum. The h has become confident and strong during his absence and stands up to him and hits him with a fire porker on the back and one final blow on the head where he falls and hits his head on the concrete floor. The inspector of the group is called and he determines that he will report a thief broke into the house and he died as h was defending herself. They make passionate love and marry and get their HEA. I love her epilogues because she gives us juicy stuff on what happens to the characters where they have children that brings them joy to their lives. I recommend this Book 📕",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bookiewookie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI2IYZQJ6OBXPMK7WXAA5FMKE3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5WAQQ8ECSFR0?ASIN=B00DQ859VI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 15, 2016",
                "reviewTitle": "5.0 out of 5 stars A gem in a great series. Loved it.",
                "reviewText": "I read this series a book at a time, as they were released, through a book club, along with my Mom. We both found it very enjoyable, except for two we didn't care for as much, and we both proclaimed a desire to read about the mysterious and charming William Graves. But it never showed up. Until now, with my Amazon Prime, where I discovered this novella book, causing me to jump for joy. I loved this book. After so much anticipation, I feared disappointment, but just the opposite happened.Winnie is hosting a ball to raise money for a hospital, dedicated to Dr William Graves, the doctor who saved her from death when her husband beat her years earlier, IN BED WITH DUKE, and William loves excuses to be around her, hold her in a dance. Now widowed, Winnie is finding the strength to be her ownself, discovering her self-worth, and it is William who helps her to do this.But then Winnie thinks she is losing her mind, with things disappearing and reappearing, the scent of her husband's caraway seeds filling the rooms, etc. It is William she turns to, and it is William she needs, and William who will do anything to help her resolve the unsettling events.William has secrets of his own, and as romance begins to fully blossom between them, the pace picks up, filled with mystery, suspense, and challenges from the past.I never found a dull moment, and I was fascinated by the return of all the old characters from the series. I, for one, think that Lorraine Heath outdid herself with Williams story. And this story is going to get a lot of rereading through the years ahead. Tomorrow I am passing it along to my Mom to read. Extremely satisfying conclusion to a very satisfying series.This novella is 130 pages long, and then after that, there are a few excerpts from other books.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Strongest Cognac",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 20, 2022",
                "reviewTitle": "not the best in the series…",
                "reviewText": "I finished it for the sake of finishing the series. I do hope that each character had different sentiments when they fell in love and not just the same oh he could not hold the impulse of imagining her in bed, digging her fingers into his back, engulfing him in her exotic scent of whatever flower blablabla.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tonion",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 26, 2018",
                "reviewTitle": "Es ist sicher nicht der Letzte!",
                "reviewText": "Wo kämen sonst die neuen Geschichten daher! Nette Untergaltung!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudia Viana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 14, 2014",
                "reviewTitle": "Great ending!",
                "reviewText": "Nice to read about the last scoundrel. Winnie became a true fighter and William a great man. Great series! I recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs P-j Brindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 21, 2014",
                "reviewTitle": "Very enjoyable read",
                "reviewText": "Having read the previous 'Scoundrel' novels a while ago, I was intrigued to find another member who had not yet found love.Winnie was helped by the gang in earlier books and has been quietly been rebuilding her life. Dr Graves has been watching over her for three years, never dreaming that any indication of affection from him would be gladly received. Of course there are dragons to be slain and his friends all unite to help the couple.True love conquers all in this fast moving romantic adventure. A must read...",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katya Harris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 4, 2016",
                "reviewTitle": "Four Stars",
                "reviewText": "Not as good as the second and third in the series",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}