{
    "remaining_requests": 987,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lost-Apothecary-Novel-Sarah-Penner/dp/077831197X",
    "body": {
        "name": "The Lost Apothecary: A Novel",
        "price": "$10.36$10.36$9.21$9.21$10.36",
        "originalPrice": "$17.99",
        "rawPrice": 10.36,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lost-Apothecary-Novel-Sarah-Penner/dp/077831197X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51HfTvwKedL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31xRXa0KkFL.jpg",
            "https://m.media-amazon.com/images/I/51W28HxYQUL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sarah Penner",
            "link": "https://www.amazon.com/Sarah-Penner/e/B088MMFPX6/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Golden Olson's and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 44943,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"The Lost Apothecary is a poisonously good read... An enthralling work of mystery, murder, trust, and betrayal. Set in an atmospheric London, Penner's immersive story flows skillfully from past to present, revealing the heartaches and lost dreams of three captivating main characters in a page-turningly tense drama that surprises right up until the final paragraph.\" —NPR“You will not be able to put it down.” —theSkimm\"A juicy spring read.” —Katie Couric, Wake-Up Call“An impressively original, deftly crafted and fully entertaining novel from cover to cover, The Lost Apothecary by Sarah Penner fairly crackles with compelling suspense, features truly memorable characters, and a series of cliffhanger style plot twists and turns.” —Midwest Book Review“Engrossing, with rich detail, assured pacing and effective suspense.” —Tampa Bay Times“Spellbinding… Like in a well-brewed potion, all the ingredients have been given exactly the right level of care and time, and the result is a novel that simply overwhelms with its delicate spell.” —Bookpage“Enthralling… Musical prose… A completely absorbing story of the power of secrets and finding one’s way.” —Historical Novel Review, A Best Book of the Month Pick\"In The Lost Apothecary, Sarah Penner convincingly weaves three heroines and two timelines into one tale of poison, revenge, and the silent network of women helping other women in a world stacked against them…. A bold, edgy, accomplished debut!\" —Kate Quinn, New York Times bestselling author of The Alice Network and The Huntress\"Dark, clever, and wickedly fun, The Lost Apothecary is a true page-turner. Sarah Penner has given us a puzzle box of women's lives, betrayal, power, and history. It's a book that slyly asks what any of us deserve and if, sometimes, that might not be a little poison.\" —Erika Swyler, bestselling author of The Book of Speculation“Filled with fascinating historical detail... With gathering intensity, author Sarah Penner builds toward a heart-pounding, satisfying conclusion. A skilled, captivating debut that celebrates the strength of women across the centuries.” —Kristin Harmel, New York Times bestselling author of The Book of Lost Names\"Penner's debut had me completely under its spell. The women of The Lost Apothecary, separated by centuries, seek both revenge and truth in this powerful story. Riveting and utterly original.\" —Fiona Davis, bestselling author of The Dollhouse\"Sarah Penner kept me guessing until the last page of this addictive, atmospheric novel… Meticulously researched, The Lost Apothecary is both a cure for idleness and a recipe for intrigue. Prepare to be consumed by this carefully plotted, propulsive debut.\" —Amy Meyerson, bestselling author of The Bookshop of Yesterdays\"An intoxicating debut, The Lost Apothecary is a riveting tale of poisons and potions and dark deeds in the name of survival.” —Heather Webb, bestselling co-author of Meet Me in Monaco“Readers who enjoy Katherine Howe and Susanna Kearsley will be drawn to this promising, fast-paced debut.” —Booklist“Intriguing… Readers who enjoy parallel historical/contemporary narratives about women’s lives, such as Claire McMillan’s The Necklace or Liz Trenow’s The Forgotten Seamstress, will enjoy the historical details and mystery in this engrossing tale.” —Library Journal About the Author Sarah Penner is the New York Times and internationally bestselling author of The Lost Apothecary which will be translated into forty languages worldwide and is set to be turned into a drama series by Fox. Sarah spent thirteen years in corporate finance and now writes full-time. She and her husband live in Florida. To learn more, visit SarahPenner.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 3 mins",
            "FREE delivery February 29 - March 4 on orders shipped by Amazon over $35",
            "Or fastest delivery February 27 - 29",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 12 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "INSTANT NEW YORK TIMES BESTSELLERNamed Most Anticipated of 2021 by Newsweek, Good Housekeeping, Hello! magazine, Oprah.com, Bustle, Popsugar, Betches, Sweet July, and GoodReads!March 2021 Indie Next Pick and #1 LibraryReads Pick“A bold, edgy, accomplished debut!” —Kate Quinn, New York Times bestselling author of The Alice NetworkA forgotten history. A secret network of women. A legacy of poison and revenge. Welcome to The Lost Apothecary…Hidden in the depths of eighteenth-century London, a secret apothecary shop caters to an unusual kind of clientele. Women across the city whisper of a mysterious figure named Nella who sells well-disguised poisons to use against the oppressive men in their lives. But the apothecary’s fate is jeopardized when her newest patron, a precocious twelve-year-old, makes a fatal mistake, sparking a string of consequences that echo through the centuries.Meanwhile in present-day London, aspiring historian Caroline Parcewell spends her tenth wedding anniversary alone, running from her own demons. When she stumbles upon a clue to the unsolved apothecary murders that haunted London two hundred years ago, her life collides with the apothecary’s in a stunning twist of fate—and not everyone will survive.With crackling suspense, unforgettable characters and searing insight, The Lost Apothecary is a subversive and intoxicating debut novel of secrets, vengeance and the remarkable ways women can save each other despite the barrier of time.Don’t miss THE LONDON SÉANCE SOCIETY! Sarah’s next spellbinding book about truth, illusion and the grave risks women will take to avenge the ones they love. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Park Row; First Time Trade edition (February 22, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 077831197X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0778311973"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.32 x 0.89 x 7.87 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,470 in Books (See Top 100 in Books) #134 in Mothers & Children Fiction #485 in Literary Fiction (Books) #485 in Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 44,943 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The London Séance Society The Lost Apothecary Discover more spellbinding books by Sarah Penner ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5cb436a-198e-4106-9e35-7c764fa1c97e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/57359a0b-cb78-4e57-b6fb-262e4ed172ae.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/da1a7b55-459b-410e-a52b-826b806f70eb.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/03a507f4-0e8d-44a7-8f60-29878f5d228c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2165a7fa-a6ce-4265-b456-bc4a9803c180.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/656afbbb-b757-43fd-bc4d-60f91a00b692.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/17ec23a1-a49b-4721-88b1-7ead5642167f.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. Lapin Zell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF74W5F7P2533PBYIYPMGNQED2RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1566E0OPWCTX6?ASIN=077831197X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Engrossing and suspenseful to the very end",
                "reviewText": "I loved this story. It is told by three voices: Eliza, Nella and Caroline. Caroline is from present day, the other two from the late 18th Century London. The author does a superb job intertwining the timelines effortlessly, and uses them to underscore the suspenseful story. As the story advances, the two timelines begin to converge and the result is a book that is very hard to put down. This book grabbed me early on and did not let go until the very last page. This one will stay with me for a long time. An excellent read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2CEUZ5AN4RZ6BHRJQ4FWLFS67Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AI3P3C1N2D7B?ASIN=077831197X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars I want to know more, 3.5 but rounding up",
                "reviewText": "I really liked this book. I have been on the fence about reading it, I'm so glad someone picked it this month. I'm a fan of historical fiction and this did not disappoint. Going back and forth in the timeline and between lead characters added to the suspence. I really liked the characters and wish there were more to their stories. I will recommend to others but I don't know that i would read it again.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sunny315",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDEXWGDR3LKZRBROMGWNPQUB3OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YQ0TTV6SPV0B?ASIN=077831197X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars I WILL NEVER RECOVER FROM THIS",
                "reviewText": "BODIED. ABSOLUTELY BODIED. SO GOOD. IM SO EMOTIONALLY WRECKED FROM READING THIS BUT IN SUCH A GOOD WAY. This book lives in my head rent free since the day I finished it and it's been at least 2 months. The plot (on your toes), women empowerment (yes), plot twists (I can't even). This was too good. First time I've ever had a book make me cry and it was THIS ONE. READ ITTTTT",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJHVBROE4CLJ4Y2FS6AAW5PRVWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UJGZRUDTP8CY?ASIN=077831197X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2021",
                "reviewTitle": "3.0 out of 5 stars Anticipated Read, Enjoyable but Hoping for Something More",
                "reviewText": "Historical fiction is my jam, and The Lost Apothecary definitely falls into that genre. I love books with strong female characters and stories that involve healing and herb lore. This book is fun to read because it interweaves the stories of two women, one in the past and one in the present.Alongside Nella, the herbalist, plying her trade in the late 1700s in London, England, is Caroline, an American, arriving solo to London for a planned ten year anniversary trip after catching her husband cheating on her with a work colleague. Caroline's anger, grief and confusion over her husband's infidelity force her to confront the direction her life has gone and to question if there isn't something more for her to pursue beyond marriage, children, and making herself fit into the spaces that make her husband's pursuits more attainable. She reflects on her love for British history, Victorian authors and their stories, and her unfulfilled dream of attending Cambridge whilst (don't you just love the word \"whilst\"?) walking through London. As she walks, Caroline is invited to try mudlarking, a tourist activity involving mucking about on the Thames after the tide is out to find odd, old, or valuable bits left behind from the water. As it happens, Caroline does find something rather rare and, thus, begins her journey to discover its origins, the people related to it, and in the midst of all of that, she reignites her passion for history, research, and herself.I enjoyed the other, more minor characters in the story. Alfred, the mudlarking tour guide, and Gaynor, his research librarian daughter, provided bright spots in an otherwise dark story and provided the help Caroline needed to uncover the secrets of Nella's world. The conflict between Caroline and her husband, James, is believable, and it helps to drive the story forward. The twist with the events that happen in the middle of the story and how it ties into Nella's storyline is canny and makes you want to keep reading until the end.I have been anticipating reading this book since I heard about it coming out last fall. This is the author, Sarah Penner's, debut novel, so I had no previous works to check out, but as a herbalist and former practicing holistic healthcare practitioner, stories involving plants as medicine and women cunning enough to use them always capture my attention. It is well known in herbalist circles that almost any healing substance in the wrong dose can be used to hurt. It was all for the better that in this story the herbs being used were to poison men taking advantage of women in a time when women had little to no power at all. Love those strong, wily, feminist characters! Bring it!It was disappointing for me to learn, then, while reading the first few chapters how Nella managed clientele seeking her sinister services -- a setup involving almost no protection of her identity. The story lost a star at this because this part of the plot was too difficult to believe.Additionally, there is young Eliza, a girl, who comes to deliver Nella a request from her employer. Her naiveté regarding her own body and events in the home in which she serves form are difficult to give weight to, and yet, they are the whole basis of why she seeks to remain with Nella. Eliza's reliance on magic to resolve the dilemma at the end was also too much to swallow, and so the story lost another star.Finally, while there were many other interesting characters in the story in Nella's timeline such as Lady Clarence, her maid, Lord Clarence, and Miss Berkwell, these figures were not as fleshed out as they could have been and would have given the story better plausibility.Favorite Excerpt“At this, I stopped in my tracks. A decade ago, in college, I'd graduated with a degree in British history. i'd passed my coursework with decent grades, but I'd always been most interested in what lay outside the textbooks. The dry, formulaic chapters simply didn't interest me as much as the musty, antiquated albums stored in the archives of old buildings, or the digitized images of faded ephemera--playbills, census records, passenger manifest lists--I found online. I could lose myself for hours in these seemingly meaningless documents, while my classmates met at coffee shops to study. I couldn't attribute my unconventional interests to anything specific, I only knew that classroom debates about civil revolution and power-hungry world leaders left me yawning. To me, the allure of history lay in the minutiae of life long ago, the untold secrets of ordinary people.\"RatingI liked The Lost Apothecary. Aside from the previously mentioned plot hole with Nell's business setup and the issue I had with Eliza, the story has a fun concept with otherwise well-developed main characters and good attention to historical detail. This book is recommended especially for folks who like strong female characters, stories based on the healing arts or herb lore, intrigue, and historical fiction based in London.",
                "reviewVotes": "82 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lovestoread",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZBK6U44K7PCA4DVSZXXNLRMHDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R362HDBRFLTONM?ASIN=077831197X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars This is a bookclub pick.",
                "reviewText": "It turned out to be a good pick.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheri A. Wilkinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSLQ43ODLVUIP5M22XFLIXSISGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22G29YXIYOK79?ASIN=077831197X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Compelling, thought-provoking...hard to put down.. a good read...",
                "reviewText": "The Lost Apothecary by Sarah PennerLondon 1791 , in a dark back alley is a secret Apothecary run by Nella. Her potions for women are used for purposes of ill intent. Tweleve-year-old Eliza shows up one day and an unexpected bond is formed between the two.Present Day London, Caroline is spending her wedding aniversary alone. She finds a vial along the River Thames and learns of \"Apothecary murders\" centeries ago. The vial is a link. She is consumed with curiosity and finding out what happen so many years ago.Told from past to present in three voice: Nella, Eliza and Caroline. Moving at a fast paced with a compelling plot and (interesting) likable characters. I was engrossed from the first page, I could not put it down.Overall I found The Lost Apothecary very enjoyable. I highly recommend and look forward to reading more from Sarah Penner .",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abbie Frontera",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHI3MHDL6HCHQY3CL6E6KWQIPSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G0XB175NNSU2?ASIN=077831197X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Hard to put down!",
                "reviewText": "Beautiful story & message, would highly recommend this to anyone that would like to read it. Our book club did a good job picking this!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gary Mattingly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPKPP2CFNG6WERREUCZ4JIMV3LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GO3GOZ1YIBDS?ASIN=077831197X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "4.0 out of 5 stars An interesting path of mystery",
                "reviewText": "Very enjoyable book. Kept me wanting to read more. Interesting history and insights. Being personally interested in herbal remedies and concoctions made the story even more interesting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Salima Queen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 10, 2023",
                "reviewTitle": "very interesting",
                "reviewText": "Loved this book and the author takes you on an incredible journey.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 15, 2021",
                "reviewTitle": "MUY RECOMENDABLE...",
                "reviewText": "EL TEMA, EL IR Y VENIR DE UNA EPOCA A OTRA, TE MANTIENEN EN VILO.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julie Yarrow",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 15, 2024",
                "reviewTitle": "Absolutely brilliant!",
                "reviewText": "What a talent this author is! I was gripped from start to finish. Moving from present day to the 1700’s was easy and, the way the characters merge over the centuries was just superb! I didn’t want it to end! Highly highly recommend!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ray",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 1, 2023",
                "reviewTitle": "Book review",
                "reviewText": "I can easily say this is one the best books I've so far. An all-time favorite! I love the way we keep on going back and forth between the two times lines. The author leaves the chapter at just the right point so that you can't resist reading up ahead. I had to remind myself so many times that I have a life and I have things other than reading to do. It was so hard to leave this book once I immersed myself in it.The book talks about the journey of three women or rather, two women and a girl, and the timeline keeps on switching from the present to the 18th century. Caroline is an American who's on a 'trip' to London and London is where the events of the apothecary and related mystery took place, centuries ago. Caught in her own life problems, trying to find a distraction, Caroline finds herself trying to uncover the mystery of the Lost Apothecary and follow her dreams.This is a wonderfully plotted and awesomely carried-out story. I think it's a bit underrated though, even 5 stars are not enough for this one. This book is a 1000% recommended.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Inge Schiebelsberger",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 1, 2023",
                "reviewTitle": "History is alive!!",
                "reviewText": "Stunning and gripping; history still touches us across the centuries; never underestimate its intricate weavings; makes you want to spend time in old reading rooms or mudlarking",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.67",
                "sellerName": "AP Books & Stuff",
                "sellerRating": "4.5"
            },
            {
                "price": "$10.36",
                "sellerName": "Kevabooks",
                "sellerRating": "5"
            }
        ]
    }
}