{
    "remaining_requests": 875,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Girl-Called-Samson-Novel/dp/1542039746",
    "body": {
        "name": "A Girl Called Samson: A Novel",
        "price": "$10.03",
        "originalPrice": "$16.99",
        "rawPrice": 10.03,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Girl-Called-Samson-Novel/dp/1542039746",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/813ZUorpUiL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Amy Harmon",
            "link": "https://www.amazon.com/Amy-Harmon/e/B007V3HXUY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 32356,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “This is a thought-provoking, deeply moving read in which a patriotic woman, forbidden from serving her country due to her sex, defies all odds to do it anyway. Harmon’s riveting narrative allows Samson’s bravery, both on and off the battlefield, to soar from the pages of long-forgotten history.” ―Historical Novels Review“This story has completely captured my adventurous heart.” ―Brenda McDearmon, Texas Over Fifty Travel Blog“A masterpiece. This is a brilliant book.” ―Christina Shoemaker, author of The Whole Cook“A story of courage, hope and love. It touched all the most sensitive parts of my soul.” ―Barbara Kloss, author of The God's of Men series“A Girl Called Samson is a history lover's dream. These are the stories that often get overlooked.” ―Book Adoration Reviews“An incredibly moving story of bravery and love that stretches far beyond the page.” ―Books Uncharted Reviews About the Author Amy Harmon is a Wall Street Journal, USA Today, and New York Times bestselling author. Her books have been published in more than two dozen languages around the globe. Amy has written nineteen novels, including the USA Today bestseller Making Faces. Her historical novel From Sand and Ash was the Whitney Award–winning Novel of the Year in 2016. Her novel What the Wind Knows topped the Amazon charts for thirteen weeks and was on the top 100 bestsellers chart for six months. Her novel A Different Blue is a New York Times bestseller, and her USA Today bestselling fantasy The Bird and the Sword was a Goodreads Best Book of 2016 finalist. For updates on upcoming book releases, author posts, and more, join Amy at www.authoramyharmon.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 50 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From New York Times bestselling author Amy Harmon comes the saga of a young woman who dares to chart her own destiny in life and love during the American Revolutionary War.In 1760, Deborah Samson is born to Puritan parents in Plympton, Massachusetts. When her father abandons the family and her mother is unable to support them, Deborah is bound out as an indentured servant. From that moment on, she yearns for a life of liberation and adventure.Twenty years later, as the American colonies begin to buckle in their battle for independence, Deborah, impassioned by the cause, disguises herself as a soldier and enlists in the Continental army. Her impressive height and lanky build make her transformation a convincing one, and it isn’t long before she finds herself confronting the horrors of war head-on.But as Deborah fights for her country’s freedom, she must contend with the secret of who she is―and, ultimately, a surprising love she can’t deny. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Lake Union Publishing (April 1, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 411 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1542039746"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1542039741"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 14.5 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,559 in Books (See Top 100 in Books) #53 in American Historical Romance (Books) #620 in American Literature (Books) #805 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 32,356 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/c6088775-6fd5-4e5c-8a54-a95e4eb3a935.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MJLovestoRead",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBP3HXJ24GXRJZVXVXKXUK7UI3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EUDO4XNW9EZ5?ASIN=1542039746",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Stunning message of resilience and hope.",
                "reviewText": "A Girl Called Samson is yet another triumphant historical work of fiction by the talented Amy Harmon. Taking a real-life heroine in one Deborah Samson (also known as Sampson) and giving her the spotlight she deserved and would have undoubtedly shied away from to an extent, I am truly in awe of this remarkable woman's story. Harmon does a wonderful job of bringing Deborah's world to her readers. A journey simply unbelievable to even those closest to her, it's an adventure that will truly shock and astound you. Once again showing just how resilient the human spirit can be when faced with adversity.I can't tell you how enamored I am with Deborah. That she could tackle any task put in front of her. That she revered the Almighty while oft-times questioning why as a woman she wasn't allowed to be more than was expected of her. The fact that she decided to go 'under cover' and present herself as a young soldier floored me in the very best way. Getting to be witness to her historic venture into the unknown. How she managed to fool every authoritative figure. How they admired her tenacity, her bravery and how she literally became a hero in every sense of the word, whether she wanted to be one or not. A life well-lived but perhaps not the one she had envisioned or thought predestined. But it was one that is simply incredible.Harmon takes us through all the ups and downs of her young life, which is a part I thoroughly enjoyed. From her time with the Thomas family to her decision to join the military, those moments of feeling as if she actually belonged somewhere after what transpired with her birth family warmed my heart. Not to mention all that the Rev. Conant did for her spirit.The use of letters throughout this book was very clever on Harmon's part as we get to know Deborah through her thoughts of worry and fear of what her life will become if she doesn't try and rid herself of everyone's expectations. Those inner thoughts are what carry this book and provide Deborah's true sense of self, whether she was the woman servant for the Thomas family or the newly-created Robert Shurtliff as part of the American Revolution.The book goes forth at a steady pace with much detail presented to fully glean just what happened during this volatile time in American history. I found some to be a bit tedious midway through my read as the book felt more like a biography than a work of fiction. But the latter quarter or so picked up and was once again more about relationships with others than just Deborah's secret and somewhat solitary life as a soldier. I will say her cleverness at staying hidden and remaining one of the boys was almost incomprehensible. The fact that she pulled off this stunt was as magical as her childhood breeches once were.Whether she is Deborah Samson or Private Robert Shurtliff, this person is a soul like no other. A pioneer who is an inspiration to everyone who says 'it can't be done'. The added bonus of a fictional romance added a very tender quality to this book, showing Deborah she truly could be loved when the early abandonment of her mother told her otherwise. Her beloved is a wonder in his own right and their pairing was both beautiful and sacred.Overall, I will admit that Harmon combined real events with a fictional flavor quite well. Familiar names are dropped here and there who provided a bit of disbelief for our heroine that she was actually rubbing elbows with the most powerful of men. That she mattered and that she was able to be a part of history while giving her all no matter the circumstance. I still can't even fathom all she endured and how she managed to keep her identity a secret for so long. It is that extraordinary.Living in Massachusetts has definitely sparked my interest in researching this woman a bit more and I'm hoping to visit some of the places mentioned as well as Deborah's final resting place. Amy Harmon continues to bring history to life with these well-written works of fiction and A Girl Called Samson is one not to be missed. That life, liberty and the pursuit of happiness are never far from Deborah's thoughts is a testament to her will to survive and the perfect reminder to all of us that we can accomplish more than we think. That in itself is one stunning message.4.5 stars!",
                "reviewVotes": "110 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIBH5W37ZH75LHBRU4JBGVBBMGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FZC94Z6Z96UG?ASIN=1542039746",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars A woman ahead of her times!",
                "reviewText": "I loved this book and was so pleasantly surprised that it was based on truth, not a wishful creation. As a woman who grew up a daughter from a farming family whose mother believed that a “girl” could do anything a “boy” could do and a father who loved his daughters just as much as his sons, it was my privilege to succeed in both areas…….so, how could I not love “A Girl Called Samson.”",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE2WMKDE5XN7E5EJXIOS4FERS2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OHLF8PQQJ4R7?ASIN=1542039746",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "4.0 out of 5 stars An Excellent Story!",
                "reviewText": "We need more stories like this...A Girl Called Sampson is about Deborah Sampson who secretly enlists as a soldier during the American Revolution. At the time, girls were not allowed to be in the army, but she manages to keep her secret long enough to witness the Battle of Yorktown.The first part of the book beautifully sets up how she grew up, and who and what shaped her character. She carries these with her into the war. In the final third of the story, she falls in love with one of the generals.A few mild cuss words, scenes of what Deborah has to deal with while serving in a men's only army, and a few romantic scenes that leave little to the imagination are about the worst in this book.Christa",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sleepless in San Diego",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4QRRCPG7H2ML6ZG5HJS67QGNUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30MBQEX9C7BC5?ASIN=1542039746",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Remarkable!",
                "reviewText": "I have long been a fan of Amy Harmon! I wasn't sure what to expect in this story, but her ability to weave fact and fiction is true gift to the reader!The characters leave a legacy in history, but are indelibly etched into my heart, spirit and respect!A Girl Called Sampson is a brilliant accomplishment and a compelling historical manuscript! It is a truly amazing account of the horrific fight for independence, and the terrible sacrifices for the cause of freedom!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Larissa Hosang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5CWGBGPYPB2DHPDPOFSNJTZI4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AQPAILUU4NTV?ASIN=1542039746",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars A beautiful reimagining of history through a woman’s eyes",
                "reviewText": "I loved this book. It takes place during the war for independence plus a bit before it. The first part of the book reminded me a lot of Anne of Green Gables but as it went on it took on a Mulan twist. It is also based off of a real person which makes it all the more fun. It’s a well written book that really brings history to life.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3MRWWN6AD56TQG3R3QZNY4AITQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LATVY7KFLZK6?ASIN=1542039746",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Wow!",
                "reviewText": "I didn't really know what to expect. But I loved this story! Would be a great read forc4th of July. I loved Deborah Samson. I loved being reminded of the sacrifices that were made for the freedoms we enjoy. Also the sad reminder that war affects everyone. I loved John Patterson and the Reverend. I loved Deborah's can-do attitude. That her hard life motivated her to do all she could. She broke through limitations. Just a really great read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bradley Everett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQSEXIGSMT32ZZNDBJWYXWUFGNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UV1VHE1ENMF2?ASIN=1542039746",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Wow! What a great book!",
                "reviewText": "I don't think I have ever written a book review, but I do like to read book reviews before I buy one. This book was fantastic, and I read it in two days. For me, that's probably a record, because I don't read very fast, and I usually don't sit for hours and just read. This book just drew me in right from the start, and I couldn't put it down. I don't like strong language, and detailed intimate relationships (I tend to read more youth/young adult books for that reason), but this book was tastefully done and not the focus on those two things I mentioned. So, if you want live in a young girl/women's story of being a soldier in the Revolutionary war and her experiences, you got to read this book. You won't be disappointed! This is the first book I read of Amy Harmon, and now I'm going to have to look up her other books to read. She just has a gift of writing and story telling!",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melanie P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGODUGBVMEE6JA2Q2YR7Z7X4IIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18PPGDY04WRSV?ASIN=1542039746",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Wonderful story",
                "reviewText": "What a treasure to have a current issue (gender) cast in a story of old. While much of it is predictable, I appreciated the questioning of a person's role in life, often dictated by societal norms.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sclaffer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2024",
                "reviewTitle": "Not to be missed!",
                "reviewText": "I do not usually rush to read historical novels written by women. (Tsk!Tsk!). As this one seemed a little out of the ordinary I began reading and am glad I did. It is skilfully woven around historical fact and very absorbing. I saved the author’s note until the end which made my enjoyment of the novel even greater as I then researched some of the historical figures mentioned in the text. I expect that you will enjoy this tale as I did.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sairs_readsandreviewsSairs_readsandreviews",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 1, 2023",
                "reviewTitle": "Beautiful story, inspired by true events.",
                "reviewText": "Based on a true story, this historical romance really pulled on my heart strings!Deborah is a tenacious woman, born at a time where she had no freedom as an individual due to her status and gender. Abandoned by her family for a 'better life' of servitude, when she turns 18 she is expected to wed and be a house wife for the rest of her years, replacing the family she worked for with a husband.Rejecting society’s expectations of her, Deborah embarks on a journey of relentless suffering and periods of joy and belonging during conflict which to her is everything she dreamt of and more.The portrayal of this story was very compelling and kept me right there with Deborah as she experienced childhood, life as a soldier and womanhood on her own terms.I highly recommend this book to anyone really as it has so many themes and areas of depth. There are comments on gender, historical references, warfare, romance and comradery as well as conflict and drama. A very well written book that I am really glad I read via a Book club. I felt there was a little bit of a drag towards the middle of the book but as we read it in sections this possibly added to this.Reading the authors notes at the back and hearing how she researched and developed the story from the real Deborah Samson honestly had me shed a tear to think of the element of truth within this. Women in history are so often overlooked so I am grateful this story is out there and being shared.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wC8WNuSNL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "stella",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on April 29, 2023",
                "reviewTitle": "Bouleversant",
                "reviewText": "J'ai adoré Deborah. Cette femme que l'on va suivre tout au long de sa vie extraordinaire. C'est une battante et une révolutionnaire. Une femme au coeur de lion. Je recommande chaudement. A lire et relire. Merci Amy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luiza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 1, 2023",
                "reviewTitle": "Amazing and breathtaking!!",
                "reviewText": "Amy harmon is one of a kind, i loved this book so much!! Best read of this year till now...she never disapoints",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bozena F.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 1, 2023",
                "reviewTitle": "incredibly spellbinding story",
                "reviewText": "I love all of Amy Harmon's books.She doesn't just write historical fiction stories, she writes life-changing stories.WOW! This book is an unbelievably fascinating and gripping story.It's even more fascinating to know that the main characters in this book are real people who actually experienced all of this or almost all of it since part of the story is of course fiction.This book begins in 1770.Deborah, the main character of this story is 10 years old.Her life has never been easy and at the age of 10 the whole ordeal of being forced to be a servant and thus the feeling of not being free began.What began when she was ten years old has shaped her and her whole life. She has imagined what it would be like if she were free and could do what she wanted, which of course was unthinkable for women at that time.As the American colonies began to fight for independence, Deborah is 21 years old and can't handle the unfairness that only men can be soldiers and enlisted in Continental Army disguises as a man.And so Private Robert Shurtliff aka Samson was born.Yes, it's also a beautiful and unique love story that begins after Samson has been in the army for over a year.Yes, it's an incredibly spellbinding story, as is the whole life of Samson and Deborah.I love this book.I love all the characters.I love this real, raw and authentic emotional story.I love that I've learned ones again so much from this book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}