{
    "remaining_requests": 772,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Falling-for-Highlander-audiobook/dp/B01MQIF6UH",
    "body": {
        "name": "Falling for the Highlander",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Falling-for-Highlander-audiobook/dp/B01MQIF6UH",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51uCRcd1fbL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lynsay Sands",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Lynsay+Sands&search-alias=audible"
        },
        "brand": "Lynsay Sands&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2813,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "New York Times best-selling author Lynsay Sands welcomes listeners back to the Scottish Highlands, where a gallant warrior vows to protect a beautiful runaway. Lady Murine Carmichael has known her share of bad luck. But when her debt-ridden half brother tries to sell her off in exchange for a few Scottish horses, it's the final straw. If keeping her freedom means escaping through harsh countryside alone, so be it. She has barely begun her journey when she lands an unlikely escort - the brawny Highlander who just refused to buy her virtue. Dougall Buchanan was disgusted by Lord Danvries' shameful offer, but Murine tempts him beyond measure. Even bedraggled and dusty, the lass glows with beauty and bravery. Dougall wants to do more than just help her flee. He wants to protect her - with his life and his heart - if she'll only let him. For Murine may be pursued by a powerful foe, but nothing compares to the fiery courage of a Highlander in love. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10177"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 39 minutes"
            },
            {
                "name": "Author",
                "value": "Lynsay Sands"
            },
            {
                "name": "Narrator",
                "value": "Elle Newlands"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 31, 2017"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B01MQIF6UH"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#41,755 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #689 in Historical Romance (Audible Books & Originals) #925 in Scottish Historical Romance (Books) #2,303 in Historical Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bubbee and Admirals momKathy Arnold",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHBFU4LFAOF4OAQO4TP7IBE5SJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWZ8OYJB2PRE5?ASIN=B01MQIF6UH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "5.0 out of 5 stars This book is only one of a series of books about the Buchanan brothers",
                "reviewText": "When Dougall met with a man to sell him a couple of horses, it turned out the man had no money. To rectify the situation, the man, Montrose, offered to pay Dougallwith his sister Murine. Murine is a case in itself. She overheard her brother talking and decided to run away. Instead of mounting a horse... she rode a bull. Marine has a problem with fainting. She and Dougall have all sorts of \"problems\" with her fainting while trying to get her away to safety.The whole book is alright histeracle situations that will hold your Interest and keep you laughing. It's hard to put a book like this one down. Lyndsay Sands has done it again with her Historical Highlander Series. It's another keeper",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNKIVB7MNGCT5NJQ2LA5GO4QZWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35DQSPBCREBCC?ASIN=B01MQIF6UH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Love it",
                "reviewText": "The author is great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TracyJane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4XZXKYMBCASW7ESD2KPE2G7TQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGO7B9Y9MU4DU?ASIN=B01MQIF6UH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 1, 2017",
                "reviewTitle": "4.0 out of 5 stars 4 stars",
                "reviewText": "I really enjoyed this book, but I will be honest - it has been so long between books in this series, that I honestly don't remember reading about Murine in the previous novels.Murine has been living with her half-brother in England since her father died the previous year. She is not happy in his home and feels isolated - she has not heard from her friends since she moved and is beginning to wonder if they are getting her messages. When she learns that a group of Scotsmen are coming to see her brother, she wonders if she can convince one of them to carry her message to Saidh.Dougall has come to England to sell horses to Murine's brother. When her brother cannot produce the coin to pay, he offers Dougall his sister in exchange - not to marry, just to \"use\" until he feels the debt is repaid. Dougall is outraged and disgusted by the offer and refuses. When her brother suggests that they wait a day because he is sure his neighbor would pay to use his sister - Dougall makes it clear that even if Montrose got the money, Dougall would never sell his horses to him. He and his brothers immediately leave the castle and travel to the village.Murine is humiliated and appalled by her brother's offer and knows that he will sell her - she decides that she must leave and travel to Saidh's home and hope that she can help her.When she meets up with Dougall and his brothers on the road - they are surprised to learn that she is their sister Saidh's friend - the very friend that saved her life! They agree to take her to Saidh and protect her from her brother. Before they can start out - men from her brother's castle come looking for her and Dougall orders his brothers to hide her. While hiding, Murine faints, Dougall takes her up on his horse and holds her so tightly, that each time she comes to, she faints again from lack of air. When they finally stop to rest the horses - it is amusing to see Dougall and his brothers doting on Murine.The trip to Scotland is plagued with \"accidents\" which Dougall believes are caused by Murine's tendency to faint - even when she insists that she did not faint. Dougall and his brother's agree that Murine must be saved from her brother and think that she should marry as soon as possible. Several of the brothers offer, and even though he is not in the market for a wife - Dougall doesn't want anyone but him to marry her. There is a bit of a misunderstanding between Murine and Dougall after they kiss.They realize that they are being followed just before they reach their home and Murine is injured - Once they arrive in the gates - Dougall announces that he is going to marry Murine. But first she must be tended. While Murine is recovering - Dougall and his brothers learn that Murine's brother is nearby and looking for her - Dougall takes Murine into hiding and their relationship begins to blossom.It appears that these two will get their HEA, but first they will have to solve the mystery of who is trying to kill them and why.This was a good book, it is well written and flows nicely, the love scenes were steamy, the mystery was well done and while it was amusing, it was not nearly as funny as previous books by Ms. Sands. I especially enjoyed catching up with Saidh and Greer and Dougall's brothers are always entertaining (seriously hope they all get a book!) I would be happy to recommend this book and am looking forward to the next installment in the series.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNDFKJ5IPJLSKU5YI2O5LTACUSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GGJR12PD6RQY?ASIN=B01MQIF6UH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastic Author and Series",
                "reviewText": "This Author delivers such a fantastic read with ups and downs and surprises along the way. The highlander series is steamy and spicy and perfect for our romance book readers club night!!! You gotta read this Author, you will NOT be disappointed!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimberly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOSTEV4KTFMVEFV47FNCBEBYRAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J6JH4RRCE2Z4?ASIN=B01MQIF6UH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 14, 2017",
                "reviewTitle": "5.0 out of 5 stars Read or listen. Good both ways",
                "reviewText": "Setting: Scotland During the reign of James VI? Not sure.Genre: RomanceWhen Lady Murine Carmichael 's half brother decides to sell her virginity in exchange for either the horses he wants or the coin to buy them, she takes off. When Dougall Buchanan and his brothers meet her on the road they impulsively decide to hide her from her brother's men. When they address her as \"Lady Danvries\" (her brother's name) she corrected them, at which point they figured out that she was their sister's friend who had played an important part in her (the sister's) story. So this book revolves around her escape from her brother's men and the mystery of what is going on in his household. Murine and Dougall are attracted, as will happen in love stories, and events happen apace.Sands is a very experienced author. She has grammar, usage, and pacing down pat. The dialogue and situations are engaging. I love the humor she weaves through what could be a serious story. I generally don't read her historical romances, mostly because I can't place these books in an era of time, and that just bugs the sh*t out of me. A king is mentioned, but Scottish or English? I'm leaning toward James VI of Scotland/James II of England given history, but I'm not sure.I got it in both Kindle and audio for the Whispersync. The narrator does an amazingly wonderful job. I first heard Elle Newland performing Samantha Young's books, and she put just as much talented energy into this,",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JEANNE",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 24, 2019",
                "reviewTitle": "Most definitely",
                "reviewText": "As usual I can only praise Lyndsay Sands AGAIN for another fantastic book.It was so enjoyable, that once I started reading this book, I couldn't put it down until it was finished.For anyone that enjoys Lyndsay Sands books, please, please, please make sure you read this because it is most definitely worth it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jane Hartley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 20, 2022",
                "reviewTitle": "Contradictory review",
                "reviewText": "Ok.These books keep you turning the page..... but.... expect each bride too, take an arrow, be knocked on the head and be kidnapped in every book.I actually started with the Wolf then realised it was the current book of the series. I went back to the start bought a package and read from book 1.All have there own story but basically follow the same out line.I also find myself just flicking pages at the 'intimate descriptions'",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 13, 2022",
                "reviewTitle": "Interesting story",
                "reviewText": "Great story...book had some damage to the cover and spine",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pol",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 11, 2021",
                "reviewTitle": "Excellent",
                "reviewText": "A very interesting first read of Ms Sands work and definitely not the last. The story was comfortably convoluted, occasional red flags noticeable to the reader and well thought out schematics for the action.Using immersion reading with audible, I listened alongside and very pleased to hear a genuine Scots accent, this making the book a much more enjoyable experience. Off to start the next novel.Recommended",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 17, 2017",
                "reviewTitle": "Entertaining but deja vu",
                "reviewText": "To be honest if I hadn't read previous books in this series I would have given this book five stars. It's funny and full of great action and romance. Heroine Murine is rescued by Dougall and his brothers while fleeing from her vile step brother. The hero's seven brothers form an entertaining chorus for this road trip story. Dougall is not looking for a wife but frail Murine appeals to him more and more as they travel to their home. Along the way there are mysterious assassination attempts, but they are not sure who is the target. It's a fun story told in a very entertaining way with some steamy romance to liven the journey.But it's almost the same story as previous HR books by this author. The same elements are all present. Mysterious assassin, multiple head injuries, some physical comedy, and you know there will be many erotic encounters in convenient streams and ponds. So that's why I only gave it four stars.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}