{
    "remaining_requests": 886,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Black-Cake-A-Novel/dp/B09B2NNXMG",
    "body": {
        "name": "Black Cake: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Black-Cake-A-Novel/dp/B09B2NNXMG",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51TEE4GVOpL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Charmaine Wilkerson",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Charmaine+Wilkerson"
        },
        "brand": "Charmaine Wilkerson",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 21606,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NOW A HULU STERAMING SERIES NEW YORK TIMES BESTSELLER READ WITH JENNA BOOK CLUB PICK AS FEATURED ON TODAY Two estranged siblings delve into their mother’s hidden past—and how it all connects to her traditional Caribbean black cake—in this immersive family saga, “a character-driven, multigenerational story that’s meant to be savored” (Time). “Wilkerson transports you across the decades and around the globe accompanied by complex, wonderfully drawn characters.”—Taylor Jenkins Reid, New York Times bestselling author of The Seven Husbands of Evelyn Hugo, Daisy Jones & The Six, and Malibu Rising ONE OF THE BEST BOOKS OF THE YEAR: Oprah Daily, NPR, BuzzFeed, Glamour, PopSugar, Book Riot, She Reads We can’t choose what we inherit. But can we choose who we become? In present-day California, Eleanor Bennett’s death leaves behind a puzzling inheritance for her two children, Byron and Benny: a black cake, made from a family recipe with a long history, and a voice recording. In her message, Eleanor shares a tumultuous story about a headstrong young swimmer who escapes her island home under suspicion of murder. The heartbreaking tale Eleanor unfolds, the secrets she still holds back, and the mystery of a long-lost child challenge everything the siblings thought they knew about their lineage and themselves. Can Byron and Benny reclaim their once-close relationship, piece together Eleanor’s true history, and fulfill her final request to “share the black cake when the time is right”? Will their mother’s revelations bring them back together or leave them feeling more lost than ever? Charmaine Wilkerson’s debut novel is a story of how the inheritance of betrayals, secrets, memories, and even names can shape relationships and history. Deeply evocative and beautifully written, Black Cake is an extraordinary journey through the life of a family changed forever by the choices of its matriarch. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b?ie=UTF8&node=9822"
            },
            {
                "name": "Black & African American",
                "link": "https://www.amazon.com/African-American-Literature-Books/b?ie=UTF8&node=9823"
            },
            {
                "name": "Women's Fiction",
                "link": "https://www.amazon.com/African-American-Womens-Fiction/b?ie=UTF8&node=9059881011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "12 hours and 2 minutes"
            },
            {
                "name": "Author",
                "value": "Charmaine Wilkerson"
            },
            {
                "name": "Narrator",
                "value": "Lynnette R. Freeman, Simone Mcintyre"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "February 01, 2022"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09B2NNXMG"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#419 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #5 in African American Literature #7 in Coming of Age Fiction (Audible Books & Originals) #12 in Black & African American Women's Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Terri E. Pollard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKD3HAZYVNLCU45QU4BFQHUW4BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PVVQ1WJC34WV?ASIN=B09B2NNXMG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars My First Taste of Black Cake",
                "reviewText": "I liked the rich descriptions of the characters who were complexed people living a human experience. I would recommend this book as a required reading of school systems in the Eastern Caribbean, and anyone who wants to understand the journey of discovering their family history. I came to read this book as a member in a book club of U. S. Peace Corps Volunteers in the Eastern Caribbean and found familiarity in learning about the characters while eating my first piece of black cake.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIL74CVJI7GTLCSHOIEUKJL4PWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IQPH33JBXA2F?ASIN=B09B2NNXMG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "4.0 out of 5 stars A beautiful debut",
                "reviewText": "This book was in need of a bit of fine tuning. I did enjoy the multiple POV's and multiple timelines with short chapters. However the story was trying to cover too many topics. It went wide instead of deep. Wilkerson juggles a lot within the story, rotating between the past and present in brief chapters that, while written entirely in third person, spirals through the characters to reframe on their specific lives, emotions and thoughts. The style gives each character their individualism while also weaving them together to view each individual as connected through the community of their shared lives. The ending is clean answering of the questions the story raised.It took a bit of time for Black Cake to pick up the pace, and there were way too names keep straight at times. Foreshadowing was overused, I could foresee each and every reveal. The characters would always explain their thoughts, not very subtly, and would repeat their thoughts several times. This I would have edited down. As a reader, I want something to ponder, but this was spoon fed a little too much.Black Cake is a story of Identity: what it means to be who you are, how heritage can either define you or hold you captive, and how place and opportunity can shape your destiny. At first, we are introduced to Benny and Byron's story, and I was intrigued by these narrators and their differing perspectives. The premise was sound, and I thought by story's end I would have a firm sense of WHO these two were and who they could become down the line. At first, the book felt balanced: we got small glimpses into mother Eleanor's life without losing hold of the present-day narrative.As time went on, however, the central theme of the story became more and more divergent, as character after character was introduced, new locations and complications arose, and the book started to lose focus---and lose my attention. The dramatic 'twists' became a bit repetitive, and there was a heavy emphasis on certain themes such as abuse, without any true conclusion. The moment I started to connect to a new character's story line, we jumped to another point in time, a new location, or back to present day, and it left me feeling a bit underwhelmed.After reading about the making of Black Cake which is a cake bursting with fruits, soaked in rum, and browned with sugar (hence the name). I am curious to experiment with some recipes.As debuts go, this is a strong one, and I look forward to seeing what else Wilkerson publishes.",
                "reviewVotes": "81 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tianna M. Ewing",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3LH7DOCTTRN5U5BAUEW4UXCIJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27ZQZ9A5T1VZP?ASIN=B09B2NNXMG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Nonlinear Timeline",
                "reviewText": "Every family has secrets; however, Eleanor Bennett has multiple secrets that are sure to rock her family to the core. Born to a gambling father, Eleanor has an upbringing that's not typical of your everyday child. From rape to recreating identities, Black Cake is a rollercoaster of family drama and secrets. Once I got past the storyline switching from present to past, I was able to thoroughly enjoy the book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SNA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7YTEOQOCPQJDVBKL6EINO6UW4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13YZL4SVEOGCO?ASIN=B09B2NNXMG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Perspective is everything",
                "reviewText": "Telling one persons story is challenging enough but Wilkerson had taken on the complexity of weaving together multiple lives that intersect to the point one is not themselves without the others. This book is a love story to growing up in the Caribbean and I found myself yearning for the simplistic childhood that includes rich food, salty sea and community.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathryn Conroy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW6562N3JURITICBRTMOQFVZVDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XZK0PE421U54?ASIN=B09B2NNXMG",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2023",
                "reviewTitle": "3.0 out of 5 stars An Overrated Novel That Is One Big Soap Opera: Melodramatic, Overly Sentimental, and Slow-Paced",
                "reviewText": "Whine. Whine. Whine. It seems like that is all the characters are doing. And at 400 pages, that gets old. Fast.But let's back up. This (overrated) novel by Charmaine Wilkerson tells the multigenerational story of a family from an unnamed island in the Caribbean, and the tale is woven by jumping back and forth in time and place and character. While this is a common literary technique, it takes real skill to pull it off. Wilkerson doesn't have that skill. The extremely short chapters—some just a paragraph or two long—switch topics and characters and timelines so quickly and at times so randomly that the effect is jarring and disorienting.This is the story of Covey, short for Coventina, the daughter of Johnny Lyncook and Mathilda Brown. He is Chinese. She is Black. But Covey is soon heartbroken when Mathilda disappears one night. She runs away from a life she hated but leaves behind a confused little girl, who is raised by Pearl, the family's cook and housekeeper. Because of something truly horrific that her father does, Covey also disappears from the island, fleeing to England and eventually adopting the name Eleanor. She then leads a convoluted undercover life that is filled with tragedy and fleeting bits of happiness. The other part of the story is told after Covey's death, when her grown children, Byron and Benny, listen to a tape-recording Covey has made, explaining everything. This sends them into a tailspin because it has turned their supposed family history and identity into a pile of lies. And that's saying something because both are already filled with resentment and bitterness long before their mother even died. When the pieces of this long, dragged-out story finally come together, the ending is treacly sweet.The novel is one big soap opera—and not a fun, sassy soap opera, but rather one that is melodramatic, overly sentimental, and very slow-paced. One horrible thing after another happens. Byron and Benny are consumed with so much anger toward each other that they don't speak, a classic TV soap opera ploy to limit critical communication and further the ridiculous plot. And when they do talk, they whine. Incessantly.This is such a shame because the story Wilkerson is trying to tell is an important one. But the meaning, import, and historical significance of that story is lost in the amateurish structuring of the novel.One clever part of the novel is how Wilkerson uses food, beginning with the traditional Caribbean recipe of black cake, a kind of plum pudding that takes months to make, to tell the characters' stories, hopes, and dreams. Unfortunately, the novel is as dense as the cake.",
                "reviewVotes": "101 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Margaret ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 10, 2023",
                "reviewTitle": "Life is different for most. Everyone has a story.",
                "reviewText": "Love the book reminded me of parts of my life.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rebel1",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "Amazing book",
                "reviewText": "Such a good read. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ShaljamiShaljami",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 26, 2023",
                "reviewTitle": "A Delightfully Warm Tale",
                "reviewText": "After the death of Eleanor Bennett, her two children Byron and Benny are left behind with an inheritance of a black cake (made from family recipe) and a voice recorded story. A story about a young girl, a promising swimmer who fled her native land as a result of being the prime suspect of a murder.Their world quakes with various questions as she reveals that they have another sister and that they must eat the cake only when the time is right. They will know know when the time is right.The narration oscillates between the past and present setting smoothly. The story unfolds beautifully whilst touching on various themes like family, lineage, racism, survival, cultural diaspora, environmental issues, motherhood and so many more. I particularly enjoyed debutant author's storytelling style, there was an immediate command yet a warm ease to the whole atmosphere. It made me look forward to keep turning the pages for revelations.The characters, each and everyone of them entwined in realistic, flawed relationships. These characters Benny, Byron, Eleanor, Charles, Covey, Pearl, Bunny and Marble will stay with me for a long time. The delicacy of handling blame, regret, guilt, confusion was masterfully crafted.My review will be incomplete if I don't talk about the black cake traditions, the food and culture element in the story. It gave it an added leverage to the story for me personally. The description and details of the setting clasped together wonderfully along the plot.Finally how the plot unfolded and then wrapped up in the end felt just right to me.This is a tale that warms one's heart through and through. There was so much to take away from this tale. I recommend it to all those who love a good historical family fiction.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61m2bUeLwaL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "SMG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 2, 2022",
                "reviewTitle": "Great read",
                "reviewText": "I have friends from the islands and this book was just full of culture and a great story. I loved every minute and could not put it down.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louise Mangos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 10, 2022",
                "reviewTitle": "Colourful characters, beautiful writing",
                "reviewText": "This is so much more than a family saga. Wilkerson has created such a colourful world taking the reader on a magical journey, geographically and through generations. Heart-wrenching in places, these characters will stay with you long after you have finished their story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}