{
    "remaining_requests": 832,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Last-Mermaid-Novel-Shana-Ab%C3%A9/dp/0553584979",
    "body": {
        "name": "The Last Mermaid: A Novel",
        "price": "$7.99$7.99",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Last-Mermaid-Novel-Shana-Ab%C3%A9/dp/0553584979",
        "soldBy": {
            "sellerID": "A34MOU1WOG7LRW",
            "name": "Zoom Books Company",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A34MOU1WOG7LRW&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "Only 7 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Jv82OSvlL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/418uW5M1OML.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Shana Abé",
            "link": "https://www.amazon.com/Shana-Ab%C3%A9/e/B001H6UWTU/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Zoom Books Company",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 106,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 7 hrs 46 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 6 hrs 31 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 13 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bantam; Reprint edition (June 1, 2004)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Mass Market Paperback ‏",
                "value": "‎ 592 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0553584979"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0553584974"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.18 x 1.24 x 6.8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#290,707 in Books (See Top 100 in Books) #11,599 in Fantasy Romance (Books) #48,762 in Contemporary Romance (Books) #81,416 in Genre Literature & Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 106 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marilyn Rondeau",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESJ4DADFVN3US6YJTGZHZ7VLYMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24H2K3PWIN4GQ?ASIN=0553584979",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2004",
                "reviewTitle": "5.0 out of 5 stars Totally Awesome Love Stories!",
                "reviewText": "This is an amazing tale set in three separate time periods and linked together by the prologue that explains the myth and how the curse came to be as the original mermaid of Kell lost her one true love and how her descendants all fought and found their way to discovering their destinies and true love.531 a.d. --- The Picts ambushed Aedan, a Prince of the Isles who would one day be King. Mortally wounded he was then shipped out to the middle of the ocean near the mysterious island of Kell, dumped overboard and believed to have drowned. Actually, he did drown, but through the enchanted ministrations of the siren Iona, who lived on the enchanted island of Kell, Aedan was restored back to life. Love blossoms with exquisite sensuality between the two, yet Aedan felt impelled to build a vessel to return to his home and save his people knowing that he would be leaving a part of his soul behind with Iona. Deliberating over the knowledge that a slow death would occur should she leave the island of Kell, Iona follows Aedan to inform him that she would be having his child only to find that once again, Aedan was betrayed, a prisoner in his own castle and near death. Risking her own life by leaving the magical waters of Kell, Ione would save Aedan once again, but could she survive herself? - Thrilling, with intense action and sensuality.1721: Ronan MacMhuirich, Earl of Kell, mysterious and beloved laird of his clan is the target of an unlikely assassin. Rarely appearing in the London social circles he and his clansmen traveled to the city to try and discover who was attempting to kill him. Searching for an assassin he discovered instead a mysterious and beautiful woman from an exotic land. Leila, not only a skilled assassin, but also gifted with `sight' that could prove to be much more dangerous to Ronan than any assassins weapon. Irresistibly drawn to one another, the beautiful would-be slayer and Ronan (a male siren) would discover a magic more powerful than either of their gifts - the magic of love found only by true soul mates. - Very ORIGINAL, passionate and sultry!2004: Ruri Kell, is still dealing with the unexpected death of her parents when several things happen. First she receives a very old silver locket; discovers she has inherited an island no one knew existed; and a devastatingly handsome Scot, Dr. Iain MacInnes, has arrived at her door offering her an astronomical amount of money to buy the island. The one condition of the sale is that she must travel to the island (she who is deathly afraid of water) and `see' it first before selling. Unknown to Ruri was that she was the last descendant of the Kell's, and knew nothing of her father's family history. Iain had been waiting several lifetimes for her and for himself too and would only be free to love when she could `remember' who and what she really was.All three stories/books were very original, sensual and passionate love stories, my favorites being Aedan and Ronan's stories. Ms. Abe is a favorite author of mine and it has been a long time between books. I am delighted to say this was well worth the wait and I heartily recommend this for lovers of this fantasy genre as an enjoyable and very original read. --- Marilyn Rondeau, Official Reviewer for [...] ---",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zana U.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIWFN2ZB27MXMNZU2PVTV5GP6CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38E5MMGMM87B3?ASIN=0553584979",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful wonderful such a gift ...",
                "reviewText": "Loved this book. The 3 books so unique but connected! Enjoyed the hero so much I re-read it after I finished the siren. Shane Abe' is a very talented writer and exceptional storyteller/story conjurer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MDH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGV7AI3XWIHFL3JSSAKFBJEBTGQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MROTQQTWNXZY?ASIN=0553584979",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2022",
                "reviewTitle": "4.0 out of 5 stars a good tale",
                "reviewText": "a good tale, well 3 tales",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carrie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIEKD76FLDTPPDBI5EKHI5GFN7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BMJEXAANYSG3?ASIN=0553584979",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 25, 2015",
                "reviewTitle": "5.0 out of 5 stars Amazing story!",
                "reviewText": "Shana Abe is the most amazing storyteller. She transforms wonderful myths into beautiful stories. I wasn't sure about this book at first, with its length and the three stories woven together but it was extremely satisfying in the end. The ending was surprising and lovely, with the role changes and the full circle connections that they make. It really was amazing.The way that the stories are set up, you get the legend, a very early, medieval continuation of the myth and the curse. <spoiler> as I was reading this story I hadn't realized the nature of the book yet so it was a different experience than the others. Aedan was a mirror of the fisherman and brought the legend to life in a more real sense than before.</spoiler> Then it moves on to a more modern, regency era story which summarizes the story more completely, with the outcomes of the previous story and adds more magic. This was my favorite of the three, I think <spoiler> it took me longer to get into this story than the others but once I was in, it was magical. Leila was completely unique and Ronan was so sweet. We got to see different roles of the siren and more extensive powers of them both.</spoiler> The final story is set in the modern day. It further summarizes the myth more completely and brings it full circle back to the beginning. <spoiler> The most intriguing part of this story to me is the switched roles. It took me a minute to figure it out but HE is the original siren and SHE was the fisherman. It was island interesting turn of events and the perfect ending.</spoiler> I have to say the connections between stories <spoiler>such as the marble treasure shelf in the grotto, the Lamont resentment, the Spanish sight, the tapestries interesting castle, the king who almost died and so many more </spoiler> made the stories distinct but also a continuous myth that lives on. It was an amazing effect.I loved this story and would read it again. And recommend it to anyone.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BeadCatz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMUJGD56QXKRQXQP3NDMUJXGPAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FTA109O5YHS2?ASIN=0553584979",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 13, 2007",
                "reviewTitle": "3.0 out of 5 stars DISAPPOINTED!!",
                "reviewText": "I found this novel after reading Smoke Thief and Dragon Thief, both outstanding books. I am glad I read those two books before reading this one because if I had read The Last Mermaid first, I would never have purchased the other two.This was a big disappointment and I had a very difficult time finishing it. The story idea was great and could have been a fantastic novel however; the plot was weak and boring. There was no action, no conflict or development of characters. I believe if Ms Abe had introduced a protagonist to the stories, it would have helped some.The final story in this trilogy was by far, the best. I did find the going back and forth between past and present scenes, very disconcerting but it was still a much more pleasant read than the first two stories. I felt the characters were better developed and not \"wimpy\" as in the first two stories.I do not recommend this book at all, but I do highly recommend The Smoke Thief and The Dragon Thief.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karine Cyr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 18, 2023",
                "reviewTitle": "Lovely story",
                "reviewText": "This was a really good book, nicely written",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Najade",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 3, 2007",
                "reviewTitle": "shana abé at her very best",
                "reviewText": "this book is full of adventure, breathless suspense, heart-rending emotion and real enchantment, all written in shana abé's wonderful, poetical language.a rare pearl from the depths of the sea...enjoy.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}