{
    "remaining_requests": 821,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Italian-Villa-emotional-absolutely-historical-ebook/dp/B082BBSXR6",
    "body": {
        "name": "The Italian Villa: An emotional and absolutely gripping WW2 historical romance",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Italian-Villa-emotional-absolutely-historical-ebook/dp/B082BBSXR6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91IvhaToRmL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Daniela Sacerdoti",
            "link": "https://www.amazon.com/Daniela-Sacerdoti/e/B004Z6HBKM/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 8261,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B082BBSXR6"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bookouture (February 17, 2020)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 17, 2020"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3222 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 270 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#76,443 in Kindle Store (See Top 100 in Kindle Store) #27 in Historical Italian Fiction #735 in Women's Historical Fiction #818 in Sisters Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 8,261 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "P. Blevins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5OZRDARE5O55VBCRBHWGYCO5WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMQ7EBQGCP5W0?ASIN=B082BBSXR6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2020",
                "reviewTitle": "5.0 out of 5 stars Couldn't put this book down",
                "reviewText": "The Italian Villa: An emotional and absolutely gripping WW2 historical romance which was written by Daniela Sacerdoti. It is set in the make-u[ village of Montevino. The village is based on the actual village of Caravino. The scenes set during WW2 came from the memories of her own Grandmother and the adventures were inspired by history. The combination of all of this results in a fantastic book which is extremely hard to put down.Callie had been orphaned by a fire and had spent eight years in the foster care program. No family had wanted to keep her for long. She had made her way and was now working as a waitress and saving her money for college. She was going to make something positive for her life. Then, she receives a notice on her twenty-first birthday to contact a lawyer as he had something for her. She met with him and discovered she was adopted and that her birthmother had left her a villa in Italy. She set out to discover who she really was.Callie had no idea what she would find in Montevino; but she knew it would be something and traveling to Italy in itself would be rewarding. Maybe she could figure out what she wanted to do. In attempting to discover the secrets of her past, she uncovered the secrets of the Italians who grew so close to her.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Constant Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIGAGXXVXJ3IPKCU3ADY7CXZM2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TJUYQ81Z8MVM?ASIN=B082BBSXR6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 22, 2022",
                "reviewTitle": "4.0 out of 5 stars Light, Romanticized Story of Suddenly Inheriting an Italian Villa",
                "reviewText": "Read this book if you would enjoy a light, pleasant romantic fantasy set in small town Italy. Do not read this book if you are looking for a serious novel about Italy during WWII. Actually, don’t read this book if you are looking for a serious novel about anything. That may sound like a negative review is ahead, but it’s not. The author did a good job of writing the book that she wanted to write. You just need the right expectations. This book tells the story of Callie, a young woman of Italian descent who begins the book as a waitress in Texas. Callie was orphaned young and raised in foster care. She is barely scraping by financially as she tried to save money for college, although she has no idea what she would like to study. Out of the blue, when she becomes 21, she receives a letter from a lawyer that turns her life upside down. Not only was she adopted, but she also just inherited a villa in Italy. Don’t think too hard about it, because you will enjoy the story more if you don’t worry about whether any of it is credible. In no time, our nearly penniless young woman has left her job, bought a plane ticket to Italy, and set out to jump into life in Italian village. Fortunately, her adoptive parents taught her Italian. The story really begins once Callie arrives in Italy. There is romance and a highly romantic view of village life. The language is inoffensive, and the romance is G rated. There are flashbacks to the village during WWII through the pages of a diary kept by Callie’s great-grandmother.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGW3UWIS5GDDGUGSJGQNJVAZNHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGAUEUNRQAS8C?ASIN=B082BBSXR6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Writer",
                "reviewText": "The story was well written and flowed nicely. I looked forward to picking it up each day as the storyline was captivating. Loved it and happy to have found this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marion Marchetto, author",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENBUXPSQTEVMHI7K4YJ3EYWNRPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXGKY7RVNWOO4?ASIN=B082BBSXR6",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2021",
                "reviewTitle": "3.0 out of 5 stars Texas Waitress in Search of Her Family",
                "reviewText": "I’m a big fan of historical fiction set in the WWII era. And I love the Italian countryside. So I figured The Italian Villa would be a good fit for my reading taste. We first meet Callie, a waitress in a Texas diner, one her twenty-first birthday. It is a milestone day for her even though she has been on her own for the past couple of years. With her parents having died in a fire when she was a young girl, Callie has been shifted between various foster homes. But now she has her own apartment and a job; she’s working extra shifts to save for college although she has no idea yet of what she wants to study. But her whole life is about to change when she learns that she has an inheritance – a villa in Italy left to her by her real mother. Callie reels from the news that not only is she a property owner but that her parents were really her adoptive parents. She is given a box that contained several items, one of which is the war-time diary of a young woman named Elisa Stella.With trepidation, Callie sets off for the mountainous region of north western Italy and the village of Montevino. A picture-perfect village nestled in the foothills of the Alps, north of Turin and south of Geneva, has played a large part in Callie’s heritage. But the people there aren’t quite as open to accepting her as she might have hoped. Nonna Tina, a local innkeeper of a certain age, sees something in Callie and by bits and pieces helps the young woman to piece together her lineage. Meantime, Callie takes up residence in the villa (Casa de Lucciole) which is on the grounds of an actual castle. There she meets the groundskeeper, Tomasso. There first meeting is the stuff that stories are told about – a violent rain storm, a treacherous drive up a mountain, getting drench and taking shelter at his place, and a marvelous dog named Morella.The story of finding who all these people really are (exactly who is Flora, the woman who maintains the villa?) is interspersed with entries from the old diary that seem to parallel Callie’s adventure. She decides to remain in Montevino for a while longer to discover what happened to her mother and learn who was her father.As another review has said, ‘it is a story of love, loss, and secrets’. I thoroughly enjoyed the rich details of the village, castle, and the villa itself; enough to make me want to live in Montevino. The plot is very emotional. The diary entries of Elisa show the reader how insidiously the villagers, even Elisa’s younger brother, were duped into accepting Fascism. As historical fiction it works very well. But the contemporary side of the story left me wanting. The character of Callie seemed disjointed. Sure she had been thrown a loop, but she seemed to accept things as they came. I was happy that in the end she found the family she’d been searching for her entire life.As historical fiction, this is a short book – only 268 pages. There could have been so much more added here about the war years and their long-range impact on the current village and its citizens. Several minor grammatical errors contributed to the lower rating.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debbie A",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AER63QGED7OKURIVXDUMWMXWSF6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ELN5FR8MDV8X?ASIN=B082BBSXR6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2021",
                "reviewTitle": "5.0 out of 5 stars Spectacular",
                "reviewText": "This book captured and swept me away! It grabbed my attention and drew me in like no book has ever done. The stories were intense and passionate of families and their bonds.It was a great story of the war and how it can impact people - families of different generations.Even though I too was adopted but born of German heritage, the ache and longing to know of a family and past was brought to the surface through this book.Daniela was able to capture the true emotion of a child/ adult without a birth family and how it feels. The yearning and the desire to be from someone, a family, that may or may not know about their existence and just might want to find and connect.I could go on and on with all the emotions. But… I must Thank Daniela, for bringing the thoughts to paper in such an amazing and passionately well written novel!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Acacia Grove",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 11, 2022",
                "reviewTitle": "It's Italian with a twist, but maybe this situation might be more common than we think.",
                "reviewText": "The whole food and wine business is very enjoyable.The simplest foods are the most delicious.Just the name Montevino should spell it out meaning Wine Mountain.On the whole it was interesting and readable with all of the twists and turns to keep one reading to the end in one reading.Thank goodness that it was not very long, so I did not miss sleep as some long books would do.Also, the story about Leone's sweet factory is very realistic and the best sweets come from those mountainous areas.Very enjoyable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bunty17",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 4, 2020",
                "reviewTitle": "What a Journey!",
                "reviewText": "What can I say Daniela never fails to create a story where your get so emotionally involved and almost feel the characters emotion. The journey for Callie was all about finding out the truth from her birth which was not only a shock but a very emotional time which led to to a new and happier life in a little Italian village. The diary of Elisawhich again you could almost relate to person from a different era of history WW2. I loved every bit of it and as per usual reading Daniela’s work shed a few tears along the way during this read. I would love to find out more of Elsia and Leo life after the war and would love to know if they had any more children. Although I don’t think this happened. It would have been nice if the outcome was different and dark eyes continued through the descendants. Just because I love happy endings.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marion",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 4, 2020",
                "reviewTitle": "Una commovente e appassionata storia d'amore",
                "reviewText": "Premetto che adoro questa scrittrice! Ho letto tutti i suoi libri ed alcuni li ho addirittura riletti.L'amore di Elisa per Leo, la sua famiglia e la sua nobile professione, ne fanno un'eroina a cui vorremmo assomigliare. La dolce determinazione di Callie conquista e Flora regala speranza a chi crede che tutto sia perduto. Una storia sulla resilienza, sull'onore e sull' Amore.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fran Haywood",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 9, 2022",
                "reviewTitle": "The Italian Villa",
                "reviewText": "I loved this novel! Daniela sacerdotal makes you feel like you’re actually there. The heroine discovers her Italian heritage through a diary left for her to receive when she turns 21. A real page turner!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beatrice Wise",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 20, 2021",
                "reviewTitle": "Good book",
                "reviewText": "Easy quick read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}