{
    "remaining_requests": 814,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Confederates-Physician-Alison-Blasdell/dp/1796847186",
    "body": {
        "name": "The Confederates' Physician",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Confederates-Physician-Alison-Blasdell/dp/1796847186",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31mzsOMuCML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61ZqBTgtvVL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Alison Blasdell",
            "link": "https://www.amazon.com/Alison-Blasdell/e/B07M6BS3GF/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 473,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            ""
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "When the Confederacy captures her, she's given a choice: treat the Confederate wounded and be branded a traitor by her own people, or refuse and be among the hundreds buried in a common grave on the battlefield.“…an excellent historical fiction…”-The Faerie Review“…a really good read about the Civil War…”-Reading is My Remedy“…a story for anyone who loves US history and a fabulous love story…”-Amazon review“…intertwines the beauty of love with the pain of war…”-Amazon review“…Civil War historical fiction at its best…”-Amazon reviewThe year is 1863, and the United States is entering the third year of the Civil War. Young Samantha Carter, recently educated as a physician in Paris, defies her father, disguises herself as a boy, and runs away to enlist in the Union Medical Corps. On her way there, she is captured by a Confederate patrol. When the commanding officer, Major Ethan Winters-Hunt, discovers that the Yankee “boy” is a capable surgeon, he forces her to serve as a surgeon for the Confederate Army.Samantha is unprepared for the horrors of battle and finds she must draw upon the strength and native mysticism imbued in her as a child, running wild on the Western Frontier with the Lakota Indians. She must maintain her disguise under rigorous conditions. She is loyal to the Union, and yet she must save the lives of enemy soldiers.As Ethan takes Samantha from her first battlefield experience in Virginia to the defense of Atlanta, a tenuous friendship develops between them. Eventually, Samantha's identity as a young woman is discovered, and the friendship that Ethan and Samantha share turns into a passionate love that is severely tested by deceit and betrayal as the nation rages in war.;The Confederates' Physician is an epic love story that takes the reader back to the bloodiest time in American History—when families were torn apart, loyalties were tested, and innocence was lost.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Independently published (April 23, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 493 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1796847186"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1796847185"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 15 - 18 years"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.35 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1.24 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#97,212 in Books (See Top 100 in Books) #237 in Southern Fiction #695 in American Historical Romance (Books) #11,225 in Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 473 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Pat Schenk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFYXPZ7WT5P2OTMBANMAAM45PVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BZXTJH588XNF?ASIN=1796847186",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Totally Amazing",
                "reviewText": "I didn't want to read this book, it must be phenomenal for me to review. This book was so educational and the romantic aspect was developed so heartbreakingly beautiful that it is a must read. I hate sad stories but sometimes you just have to let the tears flow. And the ending was worth it",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Speedy Grandma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED3J4AVTNJK3ZT6K7KEZLPTKRHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17GY22KKGVEMK?ASIN=1796847186",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 4, 2023",
                "reviewTitle": "5.0 out of 5 stars A really good novel about the horrors of the war that deeply effected both sides",
                "reviewText": "Alison Blasdell compiled fiction and fact that is totally engaging in THE CONFEDERATES' PHYSICIAN about a very young woman with a very strong will who is determined not only to be a physician, but to be one for the Union army during the Civil War! Events turn drastically, however, when she is captured by Confederate soldiers and forced to be a surgeon for them. How in the world could that happen you ask? She is also a master of disguise, appearing to be a young boy. Some readers have faulted the author for the fifteen-year-old age of the female protagonist, but in 1860s America, she was more than \"of age,\" and the romantic relationship that ensues was not out of the ordinary for the times. Personally however, I would have found the whole story more palatable and believable had she been a few years older, at least, but that did not keep me from enjoying it. We are warned in the synopsis of \"adult content,\" and that is very correct. The violence of war is just realistic and understandable; the bedroom activity was a little more graphic than I needed, but not outrageous. I was disappointed that the author used the name Belle for the madam; that just overtly added to the GWTWind flashbacks. But all in all, I really enjoyed all of the story and liked how it unfolded. I loved the interspersed Indian background and input into the character's persona. Samantha's horse Kota was marvelous. It's a really good novel about the horrors of the war that deeply effected both sides of the American people.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEONSB34OW4XY75BVKUIM5VIQISQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AFC957JZUCLF?ASIN=1796847186",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "4.0 out of 5 stars Great Book",
                "reviewText": "This is probably the best book I have read based in the American Civil War. The author does an excellent job of explaining why southerners withdrew from the Union and fought the Federal troops who, in their view, invaded their lands destroying their crops and homes. As she correctly pointed out, most southerners did not own slaves and were not fighting to preserve slavery.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marilyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7IGR45OWH7GZQL7CFBQBBX7OMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2F12147DEDRFA?ASIN=1796847186",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2023",
                "reviewTitle": "5.0 out of 5 stars A geat story",
                "reviewText": "At a time when women were not allowed to be educated as a physician, this rebellious young girl was sent to live with an Aunt in Paris, France, with her aunt enrolling her in a finishing school in Paris, but she wanted to study medicine and disguising herself as a boy, went to college to study medicine. Her aunt never realized what she had done. After 2 years she came back to her very angry father in the Northwestern Iowa Frontier but decided she wanted to work in the Union Medical Corps so disguising herself as a boy again she ran away and headed east. She never got to the Union lines as she was picked up by the confederates and once they found out she was a surgeon they kept her. It is a story of love, loss and terrible fighting during the Civil War. I thought it was a wonderful story.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sylvia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEG4X35JRO3LCAURROMNMHGR6GOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FV808UIAYXO6?ASIN=1796847186",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Loved this Book! Highly recommend it!!",
                "reviewText": "I recommended this book to my book club and we all enjoyed the read. It made for lively discussion.When I contacted Ms. Blasdell for questions, she promptly replied with thought provoking questions.Apparently, she is not only brilliant, but very, very nice!The book was quite thought provoking for me, as I grew up in the South and Daddy’s word was law.This young woman defied her Father and disguised herself as a man in order to give service to her Union.She was captured by a Confederate and the bond formed was so captivating.My book club had issues over the age difference and probability of such a relationship, but were reminded that many young women indeed were married to much older men.I heartily recommend this book to anyone who would like to read a bit of history combined with a bit of romance.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Horselover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4C45JDQLVH4WJ6IXJ2RFY6JO3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13CUYA8FBD1WW?ASIN=1796847186",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Very good book",
                "reviewText": "I really enjoyed this book. Since I was born and raised in Richmond, VA. Until outside people took over our city and decided we should erase all of our historical markers, it was a huge part of our city. They even dug up APHills grave to remove his statue. It’s a shame that the people of today don’t know the truth about why this war was fought. Slavery was only a part of their reasons. Plus, the North had slaves too, no matter how much they try to hide that. I think this book dealt with a lot of the issues of that time. It was a very interesting read. I wish someone would write a book about the Irish slaves. That is a huge part of our history too. I love history, it’s important to learn from past mistakes. We need more books about historical events, since they don’t teach it anymore.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rosemary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM3JIHZSGQZE3CXCCF43BUVK67Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D6JJTEOIFOC1?ASIN=1796847186",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 19, 2022",
                "reviewTitle": "5.0 out of 5 stars Change of pace!",
                "reviewText": "Change of pace! I like to switch up my books. So I move to all different writers. This particular book caught my eye. It was set in the time of our \"War between the States\". Reminded me a lot of Gone with the Wind, yet completely different. To me it was a page turner. It was realistic, novel and compelling. I found it relaxing and exciting to read. Loved the characters and how they were interwoven in the story to keep my attention. A girl of fifteen becomes a surgeon on the battlefield in the southern states. Now you ask, \" How is that possible?\". Guess you will have to read this book to find out! Enjoy!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hadidja N",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHL5F3BZIWGVH4BUF7KEQTSR2WPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MM4BZ8B2HKG1?ASIN=1796847186",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2022",
                "reviewTitle": "4.0 out of 5 stars amazing writing",
                "reviewText": "I enjoyed the writing and the strong characterization. I only have a couple of complaints. I feel uncomfortable about 15 year old women/girls being taken in intimate relationships by grown men. I know that there are cultures and communities where this is practiced even in the 21st century. I would have preferred not to read about that for my recreational literature. My other complaint is about the gory details of war and the cruelty of men. But it was such a compelling love story that I just had to accept the shortcomings that came with it. I also have a weak spot for women healers and the influence of the unseen world(spirit of Ancestors guiding the living in good deeds).Thank you Alison for this beautiful novel. Just make the next one less gruesome and make your strong female heroine a little bit older than15",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}