{
    "remaining_requests": 768,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Constant-Princess-audiobook/dp/B07L14Z5RS",
    "body": {
        "name": "The Constant Princess: The Plantagenet and Tudor Novels",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Constant-Princess-audiobook/dp/B07L14Z5RS",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/618NFvikQeL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Philippa Gregory",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Philippa+Gregory&search-alias=audible"
        },
        "brand": "Philippa Gregory&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 6302,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A new unabridged recording featuring an afterword read by the author! From number-one New York Times best-selling author and “queen of royal fiction” (USA Today) Philippa Gregory comes the remarkable story of Katherine of Aragon, princess of Spain, daughter of two great monarchs, and eventual queen of England when she marries the infamous King Henry VIII. Daughter of Queen Isabella and King Ferdinand of Spain, Katherine has been fated her whole life to marry Prince Arthur of England. When they meet and are married, the match becomes as passionate as it is politically expedient. The young lovers revel in each other’s company and plan the England they will make together. But tragically, aged only 15, Arthur falls ill and extracts from his 16-year-old bride a deathbed promise to marry his brother, Henry; become queen; and fulfill their dreams and her destiny. Widowed and alone in the avaricious world of the Tudor court, Katherine has to sidestep her father-in-law’s desire for her and convince him, and an incredulous Europe, that her marriage to Arthur was never consummated, that there is no obstacle to marriage with Henry. For seven years, she endures the treachery of spies, the humiliation of poverty, and intense loneliness and despair while she waits for the inevitable moment when she will step into the role she has prepared for all her life. Then, like her warrior mother, Katherine must take to the battlefield and save England when its old enemies the Scots come over the border and there is no one to stand against them but the new queen. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10177"
            },
            {
                "name": "Renaissance",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17745822011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "17 hours and 55 minutes"
            },
            {
                "name": "Author",
                "value": "Philippa Gregory"
            },
            {
                "name": "Narrator",
                "value": "Karina Fernandez"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "February 26, 2019"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07L14Z5RS"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,435 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #11 in Renaissance History Fiction #578 in Literary Fiction (Audible Books & Originals) #624 in Women's Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sandra Valois",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4WCSFCPRWDDIMRDKK53IFRKA6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W2FKJJKLV0PM?ASIN=B07L14Z5RS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Book is great, but smells like perfume!",
                "reviewText": "Seller- please ensure there’s no perfume in future sales. It really affects people like me with severe allergies. Book is airing out in garage for a few months…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruth Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPRK4J6EBGLG3UNSWWR3EWLG67A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GNKK0FV8QW8T?ASIN=B07L14Z5RS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2013",
                "reviewTitle": "4.0 out of 5 stars A woman defined by her faith in her God and His purpose...",
                "reviewText": "The youngest daughter of two of the most famous monarchs in Spanish history, Isabella of Castile and Ferdinand of Aragon, Catalina, the Infanta of Spain, knew her destiny from the time she was three years old. Betrothed to Arthur, the Prince of Wales and Tudor heir, Catalina was destined to become the Princess of Wales and then Queen of England, carrying her mother's passion to defend the faith of the Roman Church to England's shores, securing a critical alliance and cementing a lasting peace between Spain and the newly-installed Tudor king, Henry VII. Though she has prepared her entire life to be God's anointed queen in England, Catalina finds herself ill-prepared for the emotional and physical adjustments her new life requires. Though she finds her intended attractive and harbors hopes for an affectionate union, those girlish dreams are soon dashed by the political machinations of the English court that put such pressure on her marital relations the young couple become even further estranged with little impetus to overcome their personal and cultural differences.But Catalina perseveres, and falls deeply in love with Arthur, who proves to be a dedicated prince and a promising ruler. The future the young princess was raised to believe her birthright seems secure, and the un-imagined gift of passion she feels for her young husband is a blessing that surely signals their union and marriage are highly favored -- until disaster strikes, and in the damp and cold Welsh climate Arthur falls ill and dies, but not before exacting a promise from Catalina that will change the course of her life forever. Demanding that she claim their five-month marriage was unconsummated in order to marry his younger brother Henry, and in so doing fulfill her destiny to be queen, and in so doing assume a position of power and responsibility that will allow her to fulfill their shared dreams for Arthur's rule. Devastated by her loss but determined to keep her word, Catalina embarks on a game of intrigue and danger that will cost her far more than she'd ever dreamed -- for to keep her promise she must find the strength within her to withstand the power plays and political machinations within and without her household that would seek to see her denied her birthright. But the girl who arrived on English shores an innocent will not be denied, and Catalina, daughter of kings, fights to achieve her destiny as queen of England and in so doing her constancy and passion leave an indelible mark on the pages of history.After revisiting several Tudor-era films (among them Elizabeth and Elizabeth: The Golden Age) I found myself wanting to explore more Tudor-set fiction, and so decided to try my first novel by the prolific Philippa Gregory. Katherine, the wife whom Henry VIII abandoned after over twenty years of marriage has always held a special fascination for me. She not only one of the wives to have survived Henry's mercurial temperament when it comes to women, but she never ceased fighting for her place, her rights, or denying Henry's right to have their marriage invalidated, a sacred promise she believed in and respected in spite of Henry's betrayal. While her life has always been marked by faithfulness and constancy in my mind, I have always tended to picture her as the middle-aged matron, failing to ever imagine her in the first bloom of youth, and how that vibrancy and the years she endured as a young widow must have marked her and informed her later decisions and beliefs.Following Arthur's death, following the generally accepted historical record Catalina vowed she was a virgin, and therefore provided a dispensation from the pope was provided, as such was therefore able to marry her one-time brother-in-law Henry, when he reached his majority. Gregory, however, takes this one step further, by asserting that Catalina lied -- that her marriage to Arthur was in fact a marriage in word and deed, and the lie was therefore necessary to maintain her position as queen-to-be. Frankly, I've always thought it a little unlikely that her first marriage wasn't consummated, so I had no issue with this scenario -- nor does it, in my mind, invalidate Katherine's famously devout nature. At this point in her life, little more than a child, in danger of losing everything she was raised to be -- her very identity -- one can imagine that such a falsehood might be viewed as a matter of survival. Given how Henry treats Katherine after twenty-plus years of marriage -- setting aside the all important issue of the lack of a male heir -- I loved Gregory's idea that, once upon a time, a vibrant, loving marriage was within Catalina's reach. And if keeping a deathbed promise to her beloved Arthur meant securing a marriage with Henry at any cost -- it's a lie I can imagine was not spoken lightly or without great personal cost.Gregory divides the novel between third-person narrative and first-person, italicized \"diary entries\" told from Catalina's perspective. The balance between third- and first-person point-of-view works less well than one could have wished -- I think Gregory would've been better served to stick with a third-person account of Catalina's life, as more often than not the italicized entries recap action already covered or are frankly too long for the italicized format. Whether or not you like Gregory's take on Catalina's early life, she's produced a highly readable, entertaining account of Catalina's first years in England. Gregory's succeeded in crafting a narrative that is evocative of the time period and a highly sympathetic portrait of a princess who, time and again, refused to be bowed by circumstance. Sure to provoke further interest in the time period and its heroine, The Constant Princess has dramatically increased my respect and admiration for a woman whose faith and constancy in the face of her marriage's dissolution is arguably the result of a lifetime of determination and dedication to her faith and principles.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Simone 08",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3MLF67JPTYVNMJAOTJCYLWQKUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZPZNCW01BHN6?ASIN=B07L14Z5RS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 26, 2014",
                "reviewTitle": "5.0 out of 5 stars Queen Katherine of England and how the great lie changed history",
                "reviewText": "This is the story of Henry VIII's first wife, Katharine of Aragon. It is about her beginning in Spain and continues as she becomes Princess of Wales and then, Queen of England.It is an amazing story. She is born Catalina of Aragon, youngest daughter of King Ferdinand of Aragon and Queen Isabella of Castile. The two managed to run the Moors out of Spain, begin the Inquisition, and unite Aragon and Castile into the realm of Spain. Catalina stays with her mother on the battlefield, learning battlefield strategy and viewing Isabella donning armour and leading the troops into battle. Throughout the narrative, we learn about the great society of the Moors, about their great learning in medicine and science and their tolerance of all religions. Not so the Catholic Isabella and Ferdinand, who drive the Moors and the Jews from Spain and impose Roman Catholic doctrine on all citizens.Catalina has been promised to Henry VII's oldest son, Arthur, since infancy, in efforts towards a union of Spain and England. She has been raised in the belief that her destiny is to be Queen of England. At the age of 15, she is married in England to Arthur and the two take up residence in Wales, since Arthur is Prince of Wales, next in line for the throne. His father, Henry VII is the first Tudor king. Catalina and Arthur loathe each other at first, but soon fall madly and deeply in love. They are only supposed to meet once a week to begin an heir, but through a secret passage, Arthur goes to Catalina and they make mad, passionate love every night.But not for long. In the fifth month of their marriage, Arthur develops \"the sweats\" (unknown disease, but thought to be caused by bad sewage and water, similar to cholera). Within days, he is dead. Philippa Gregory thinks that on his death bed, he extracted a promise from Katharine, which lie would change the course of English history. In any event, fact or fiction, the lie went down in history as fact. \"The lie\" enables her to marry the second son, Henry, to become Henry VIII and fulfill her destiny as Queen of England.Katherine is 6 years older than Henry. It takes a few years, during which time she is pursued by the father, Henry VII, and suffers from poverty when she is ignored. But Henry the Younger has quite a crush on his late brother's widow, and finally, they are married.We know that she was eventually supplanted by Anne Boleyn, but there is a lot of living to do before that time is reached. Henry was not trained to the kingship as was his older brother, Arthur and has been vastly spoiled by his grandmother. He remains vain, selfish, willful and hedonistic to the point where Katherine takes over the running of the kingdom by paying bills and assuming all the necessary duties to keep the court afloat and afford Henry's self-indulgent, extravagant life style.This is a magnificent story of a queen who knew how to run a court logistically and when Henry was absent with a war against the French, how to man, supply and lead an army against the Scots, and win it.It is also about her struggles towards motherhood, of babies lost and one, Mary, born. It is a story of her unending, timeless love for Arthur and how she fulfills her destiny to be queen of England through \"the lie.\"Gregory's narration is juxtaposed through a third person account of historical events and Katherine's private thoughts at every step of development.This story of Queen Katherine is a compelling narrative from beginning to end. In the concluding passages as Anne Boleyn appears on the scene, we know how it will all turn against Katherine. There is therefore a touch of sadness for this great woman and outstanding queen, as we realize what struggles she has ahead of her. But that cannot dim, the greatness of her achievements.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen Brown",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2024",
                "reviewTitle": "Great book",
                "reviewText": "Enjoying the series",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vazquez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 13, 2020",
                "reviewTitle": "Fácil lectura",
                "reviewText": "Muy buen libro fácil lectura",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hannah",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 12, 2019",
                "reviewTitle": "Incredibly well-written & stunning portrayal of Katherine of Aragon",
                "reviewText": "The Constant Princess is the sixth instalment in Gregory’s fantastic series: The Plantagenet and Tudor Novels. Each book in the series focuses on a different famous woman, who was central to history during either the Plantagenet or Tudor times and tells the history from her point of view. As per many of her novels, the history is mixed with scandalous gossip, unconfirmed rumour and some fiction, which truly brings the characters to life.“Words have weight, something once said cannot be unsaid. Meaning is like a stone dropped into a pool; the ripples will spread and you cannot know what back they wash against.”Katherine of Aragon: known to many as the first of six wives of Henry VIII. She is often outshined by Anne Boleyn (his second wife, who influenced the King to separate England from it’s original Catholic religion to form the Church of England) and Jane Seymore (the only woman he ever loved). However, before this she was born Catalina, the Spanish Infanta, and both her parents were incredibly powerful monarchs in their own right. From the age of four, she knew she would be queen of England, but she was in fact betrothed to Arthur, Henry’s brother. The Constant Princess starts with Catalina in Spain, continues to her time meeting and courting Arthur, and finishes with the infamous divorce proceedings.I found that Katherine came across incredible well in this novel. Previously, I had never given her much thought: I was always more interested in Anne Boleyn. There was so much I didn’t know about Katherine, which was fascinating to read about.“He may well speak French and Latin and half a dozen languages, but since he has nothing to say – what good are they?”This is quite a controversial opinion, but I liked the way Gregory portrayed Katherine and Arthur’s relationship to be one of true love between two partners who respected each other. Whether or not this was true, and whether or not the marriage was consummated (which Gregory claims) was actually a large reason that Henry VIII gave for divorcing Katherine later on in their marriage. I thoroughly enjoyed the beginning part of the book when they were discussing their plans for the future and exploring the castle in WalesKatherine’s friendship with Margaret Pole was another part of the book I really enjoyed. Looking at facts alone, these two shouldn’t have been friends: Margaret was from the house of York, which was overthrown by the Tudors and her younger brother was murdered under the order of Katherine’s father. Yet, despite this, they still maintained a good friendship and Margaret was even made one of the ladies in waiting when Katherine became queen.“War does not answer war, war does not finish war. The only ending is peace.”Henry VII’s character was fairly one-dimensional: he was an ignorant tyrant who well in love (read here lust) with every beautiful woman he saw. I would perhaps have liked to see a different side to him, but this didn’t have too much of an impact on the story for me because the main focus point was Katherine.I thoroughly enjoyed reading The Constant Princess; I didn’t know very much about Katherine before and found her an incredibly interesting character to read about. I liked her relationship with Arthur & her friendship with Margaret Pole.I never normally suggest certain people shouldn’t read a book, however I will make an exception here. Gregory’s books are historical fiction novels – please see the emphasis on the word fiction: they are not completely historically accurate. Personally, this doesn’t deter from the story for me but I know some would prefer their history separate from their fiction, so if this is you then I wouldn’t read this book. The historical inaccuracies may annoy you.“True obedience can only happen when you secretly think you know better, and you choose to bow your head. Anything short of that is just agreement, and any ninny-in-waiting can agree.”",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karin VL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 17, 2018",
                "reviewTitle": "Très beau livre",
                "reviewText": "Cette biographie romancée de Catherine d'Aragon est splendide ... et fait mal au coeur. La vie des princes est décidément peu enviable, pense-t-on en le refermant. Très beau portrait de femme. J'ai adoré.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 17, 2016",
                "reviewTitle": "Wunderschönes Buch",
                "reviewText": "I love the Tudors series and this book is also wonderfully written. I read it after the Boleyn timeframe and it was really interesting to see how the deserted, abandoned queen Katherine has actually started off.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}