{
    "remaining_requests": 898,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/One-Blackbird-Crow-Novel/dp/1542091144",
    "body": {
        "name": "One for the Blackbird, One for the Crow: A Novel",
        "price": "$10.99$10.99",
        "originalPrice": "",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/One-Blackbird-Crow-Novel/dp/1542091144",
        "soldBy": {
            "sellerID": "A3CPF34RXD60YO",
            "name": "FindAnyBook",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A3CPF34RXD60YO&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41eRMsxNmXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51rrrdCKtoL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Olivia Hawker",
            "link": "https://www.amazon.com/Olivia-Hawker/e/B07GPRRHRB/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "FindAnyBook",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 31477,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review A finalist for the Washington State Book Award and the WILLA Literary Award for Historical Fiction“Enchanting…A skillful storyteller, Hawker serves up seemingly endless pages with vivid Wyoming descriptions…A suspenseful female-survivor story, about hardship on the frontier.” ―Authorlink“Set in 1876 Wyoming, One for the Blackbird, One for the Crow is a deftly crafted historical novel that fully captures hardscrabble life on the American frontier. An absorbing read from first page to last, and highly recommended.” ―Midwest Book Review About the Author Through unexpected characters and vivid prose, Olivia Hawker explores the varied landscape of the human spirit. Olivia’s interest in genealogy often informs her writing: her two novels, The Ragged Edge of Night and One for the Blackbird, One for the Crow, are based on true stories found within her own family tree. She lives in the San Juan Islands of Washington State, where she homesteads at Longlight, a one-acre microfarm dedicated to sustainable permaculture practices. For more information, visit www.hawkerbooks.com/olivia."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 53 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the bestselling author of The Ragged Edge of Night comes a powerful and poetic novel of survival and sacrifice on the American frontier.Wyoming, 1876. For as long as they have lived on the frontier, the Bemis and Webber families have relied on each other. With no other settlers for miles, it is a matter of survival. But when Ernest Bemis finds his wife, Cora, in a compromising situation with their neighbor, he doesn’t think of survival. In one impulsive moment, a man is dead, Ernest is off to prison, and the women left behind are divided by rage and remorse.Losing her husband to Cora’s indiscretion is another hardship for stoic Nettie Mae. But as a brutal Wyoming winter bears down, Cora and Nettie Mae have no choice but to come together as one family―to share the duties of working the land and raising their children. There’s Nettie Mae’s son, Clyde―no longer a boy, but not yet a man―who must navigate the road to adulthood without a father to guide him, and Cora’s daughter, Beulah, who is as wild and untamable as her prairie home.Bound by the uncommon threads in their lives and the challenges that lie ahead, Cora and Nettie Mae begin to forge an unexpected sisterhood. But when a love blossoms between Clyde and Beulah, bonds are once again tested, and these two resilient women must finally decide whether they can learn to trust each other―or else risk losing everything they hold dear.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Lake Union Publishing (October 8, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 495 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1542091144"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1542091145"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.06 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32,230 in Books (See Top 100 in Books) #945 in Family Life Fiction (Books) #1,436 in Women's Domestic Life Fiction #2,929 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 31,477 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "V",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7427ODB4TEQCOA5YWCMNARADAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3S149AN5B751I?ASIN=1542091144",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Very Detailed",
                "reviewText": "I can’t imagine what it would have been like living in the prairie but the author gives a great job of describing it in detail. I would have like to have seen more time pass and see Beulah and Clyde come together as a couple and maybe even see whether or not Cora reconciles with her husband. But the book was long so I can understand why it ended where it did.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fiona",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7C4QHYPVOQLMUFIW3IGBYEH7MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ARGNRCEWSPBL?ASIN=1542091144",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2023",
                "reviewTitle": "4.0 out of 5 stars Great story telling",
                "reviewText": "I loved this book ! The characters and descriptions were so well done, felt like I was living on the farm , suffering along with them. Each character was so well defined, they seemed real. When one was cleaning parsnips, I could see and feel them in my hands. My only issue was an animal that was born severely deformed, no chance of survival. The author took a mystical approach to the situation, which didn't ring true on any level. When a animal is suffering like that, it should be dispatched, ASAP. So I really didn't agree with that at all.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK6RQL3GKRHO5DPC7242VE4BW4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E4YRP76L1YT4?ASIN=1542091144",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Historical Fiction Meets Genealogy",
                "reviewText": "Olivia Hawker takes us back in time to the days of homesteading with precise details to imagine yourself in that time. However, instead of boring us to death with a bunch of historical facts, she takes turns telling the story from the point of view of the different characters in such a way that you become completely immersed in their lives and can’t wait to turn the page to see what happens next. The way she described the land, the layout, the details in the landscape, and in the contact characters’ homes, would enable an artist to re-create those scenes accurately. While I had never heard of her prior to reading this novel, I spent about three days on the last chapter, as I did not want the story to end. As I finished the last few pages this morning, the first thing I did was come back on and order another one of her books. I will treasure this book to study the craft of writing historical fiction, based on my own genealogical research, and family artifacts.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGUGLBA4FUW7IWYDFJH6KBA5ZVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB00U7T9G6MOO?ASIN=1542091144",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars one for the Blackbird",
                "reviewText": "This will stay with me. The poetic descriptions of the prairie, the smells, the colors, the connection to nature, especially Beulah, the young girl who was so open in her thinking. I loved the characters who grew and changed and felt so real, in a time past yet still so relatable because they are human. There is so much in this story, betrayal, murder, guilt and blame and redemption.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alli Robi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQ3VVKT6BPFOBFMQWUWGBR4QDCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37TX8R18HQGSU?ASIN=1542091144",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "3.0 out of 5 stars good read",
                "reviewText": "I enjoyed this story. So innocent and sweet. Cora and Nettie are so brave and forgiving. Not sure I could be friends with the person that hurt me.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "karen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOBLJ4ZB625VMRF4URLUGGNMH5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPPXB78U6O6NE?ASIN=1542091144",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2020",
                "reviewTitle": "4.0 out of 5 stars Unremittingly grim...",
                "reviewText": "I feel some obligation to mention something other reviewers didn't - or not that I saw, anyway. But this book is centered on death. People die, some by the hand of others, some by accident, some by means unknown, while others simply disappear. Animals die, too, in every way. Many are slaughtered, lots more suffer accidents, are others hunted or merely killed, and some manage to escape... but none of them are free of the threat of death any any given moment.I didn't downgrade the book because of predilection, however -- the death scenes, both human and animal, are not gratuitous. On the contrary, I'm sure this depiction of prairie life in that place, during those times, was perfectly accurate. \"Rachel's Caloff's Story\" a book written by her Caloff's granddaughter, is a non-fiction account of this same area and time. It tells much of the same story, only in Caloff's case, she mentions that indeed, some of the women did literally lose their minds, stuck alone out there on the prairie, faced with extreme hardship and the need for more hard physical labor than few adults could manage, long term. In fact, my one set of grandparents also homesteaded like this, in North Dakota, in a similar sod hot -- but they never told me -- or indeed anyone else -- as much as one word about the experience. For as long as they lived, neither of them could ever be persuaded to talk about those years to anyone. It must have been dreadful.Perhaps we all agree that there is a time and place to read various kinds of books. My only suggesting is that this is a profoundly sad and/or depressing book. Yes, there are moments of transcendence, but not very many. And not for long. If this would be a bad time for you to enter this most difficult world, then put this book aside for later. On the other hand, if the notion of shared misery gives you a lift, you couldn't do better than this one.Please note that in general I appreciated -- can't say 'enjoyed' -- this book. I never felt like stopping listening, although I did fast-forward a few times when the animal slaughter got too much for me, a process called \"culling the herd\". That I simply couldn't take. If you can handle this kind of raw reportage of an extremely difficult time in America, this is a book you won't want to miss.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVGKIBW7Q52XEQGH63ZPPFVJGTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMU1LTWTU9IEM?ASIN=1542091144",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent read!",
                "reviewText": "Loved this book- historical fiction- two families thrown together by tragic circumstances that must help each other over the course of two years. Wives and children- two homes- one dead husband and one in jail. Excellent read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacx87 ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXWWRKHAIN5OJM2RRHGTYBDLMYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37EJJ0EUDZLV1?ASIN=1542091144",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars One to grow",
                "reviewText": "The writing *chefs kiss! I could imagine myself being out on the fields with Beulah an Clyde, I could see the summers an winters, I could clearly see the ewes giving birth to their babies, it was wonderful to readI enjoyed every bit thank you!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Photo-Op Dave",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2024",
                "reviewTitle": "all creatures",
                "reviewText": "This author’s concept of spirituality has helped me in developing more facets of my own, deepening my understanding of the interconnected nature of all creatures, great and small. Thank you, Olivia!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Turquoise4",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 17, 2023",
                "reviewTitle": "Life is a circle.",
                "reviewText": "I loved this book for the descriptions of the natural world and how she brought to life a picture of the farm. The story was told from the viewpoint of each character. There was a spirit in the sprawling landscape, birds, trees, the river and the body of Substance which Beulah was able to hear. The author, Olivia Hawker brings this novel to life.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenny Sayell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 21, 2022",
                "reviewTitle": "Excellent",
                "reviewText": "I really enjoyed this story and went on to read more books by Olivia Hawker. Thankyou for making them available on \"unlimited\".",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anju De",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 20, 2021",
                "reviewTitle": "Deeply sketched characters you start believing in",
                "reviewText": "slow but sure to etched in mind black grey and white in classic combination I enjoyed thoroughly the Saga of everyday struggle of living in wilderness",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniela ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on July 4, 2020",
                "reviewTitle": "Un p.....e",
                "reviewText": "Come sprecare un titolo, praticamente una delle poche cose belle di questo libro, per il resto noioso, ripetitivo e altisonante, sfiora spesso il ridicolo involontario......insomma dalle mie parti si definirebbe un pippone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}