{
    "remaining_requests": 897,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Girl-Guernica-historical-novel/dp/0778333442",
    "body": {
        "name": "The Girl from Guernica: A historical novel",
        "price": "$15.91 $10.33",
        "originalPrice": "$19.99",
        "rawPrice": 15.91,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Girl-Guernica-historical-novel/dp/0778333442",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "Only 19 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Pwj0Z54hL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Karen Robards",
            "link": "https://www.amazon.com/Karen-Robards/e/B000AP70OE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by Benjamins Bookshelf.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 801,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “With gripping descriptions of bombings, fearful interrogations, and a blooming love story, Robards delivers a fantastic, captivating historical romance.\" --Booklist\"The Girl from Guernica is a riveting, high-stakes pager-turner that had my heart teetering in my throat and left tears in my eyes. Karen Robards gives us a meticulously researched story about the atrocities of the Guernica bombing that underscores the importance of reclaiming one’s power and the impact of one’s love for their family. I could not recommend this book more!\"—Madeline Martin, New York Times bestselling author of The Last Bookshop in London\"A stunning story of a family torn apart amidst the horrors of war, and a young woman’s determination to persevere as the shards of her previous life fall with vicious stabs around her. With beautiful and excruciating detail, Robards pulls the reader into another time and place, proving once more she is a master of storytelling.\"—Noelle Salazar, USA TODAY bestselling author of The Flight Girls and Angels of the Resistance “Dramatic, pacy and energetic, Robards’s historic tale of approaching war lands with frightening contemporary relevance.”—Jenny Lecoat, New York Times bestselling author of The Girl from the Channel Islands“A truly outstanding novel, brilliantly written, that captured me and held me in its grip from page one. At its heart this story is about family love and the umbilical cords that stretch but never break. So much can be learnt from the telling of this story of what is truly important whether we live in a privileged, safe environment or in a theatre of conflict. The Black Swan of Paris reminds us of the power of love, hope and courage.”—Heather Morris, #1 bestselling author of The Tattooist of Auschwitz\"I loved The Black Swan of Paris, which has everything you could ask for in the best historical fiction. A strong heroine to root for, a handsome and seductive spy, and a family secret that drives the plot at breakneck pace, all set against the sweeping backdrop of World War II. This novel is Robards's best yet!\"—Lisa Scottoline, #1 bestselling author“Long a master of suspense, Karen Robards turns her formidable talents to the Second World War. The Black Swan of Paris tells of singer Genevieve Dumont, who must navigate a tangled web of torn allegiances, painful secrets and a past that refuses to set her free, as she struggles to save all she holds dear from the Nazis. Boldly conceived and richly realized, Robards establishes herself in a single sweep at the forefront of World War II novels with an emotional and powerful tale.”—Pam Jenoff, New York Times bestselling author of The Lost Girls of Paris“An extraordinarily suspenseful, emotional read—The Black Swan of Paris is a stunning World War II novel that captivated me from the very first page to its breathtaking conclusion.”—Kelly Rimmer, bestselling author of The Things We Cannot Say\"Robards blends commendable attention to historical detail with intense realism and deep feeling. Historical fiction fans will be enthralled with this richly hewn novel and the romance and danger lurking around its every corner.\"—Publishers Weekly, starred review on The Black Swan of Paris\"An engaging story that explores an often overlooked aspect of World War II lore. For fans of Kristin ­Hannah’s The Nightingale, this page-turning novel full of suspense and excitement examines the lengths to which we are willing to go for our loved ones.\"—Library Journal on The Black Swan of Paris“An emotional tapestry of divided loyalties and love.”—AARP on The Black Swan of Paris\"Beneath the glitz and glamour of the life of singing star Genevieve Dumont, aka Black Swan, lies a whirlwind story of love, loss, sacrifice, and war in Paris, 1944. Robards delivers a suspenseful historical account of the women in the Résistance who used heart, body, and soul to advance the Allies plans for an invasion, despite the ironclad control of the Nazis... WWII history buffs will appreciate the accurate depictions and backdrop, while romantic-suspense lovers will eagerly follow Genevieve from the seashores of France to the hilltops of Germany.\"—Booklist on The Black Swan of Paris\"One of the most popular voices in women's fiction.\"—Newsweek\"One terrific storyteller.\"—Chicago Tribune About the Author Karen Robards is the New York Times, USA TODAY and Publishers Weekly bestselling author of fifty novels and one novella. She is the winner of six Silver Pen awards and numerous other awards."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 53 mins",
            "$3.99 delivery February 23 - 27.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 4 hrs 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Inspired by Picasso’s great masterpiece Guernica, New York Times bestselling author Karen Robards returns with a riveting story of love, intrigue, deception and bravery in the face of war…On an April day in 1937, the sky opens and fire rains down upon the small Spanish town of Guernica. Seventeen-year-old Sibi and her family are caught up in the horror. Griff, an American military attaché, pulls Sibi from the wreckage, and it’s only the first time he saves her life in a span of hours. When Germany claims no involvement in the attack, insisting the Spanish Republic was responsible, Griff guides Sibi to lie to Nazi officials. If she or her sisters reveal that they saw planes bearing swastikas, the gestapo will silence them—by any means necessary. As war begins to rage across Europe, Sibi joins the underground resistance, secretly exchanging information with Griff. But as the scope of Germany’s ambitions becomes clear, maintaining the facade of a Nazi sympathizer becomes ever more difficult. And as Sibi is drawn deeper into a web of secrets, she must find a way to outwit an enemy that threatens to decimate her family once and for all. Masterfully rendered and vividly capturing one of the most notorious episodes in history, The Girl from Guernica is an unforgettable testament to the bonds of family and the courage of women in wartime. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ MIRA; First Time Trade edition (June 27, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 480 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0778333442"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0778333449"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.26 x 1.13 x 7.97 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#488,026 in Books (See Top 100 in Books) #1,270 in World War II Historical Fiction (Books) #2,701 in Espionage Thrillers (Books) #3,212 in 20th Century Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 801 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW6COEKTL3SYJGQFE7YX2GJEJHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PZT9ZZ1HLKXH?ASIN=0778333442",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2023",
                "reviewTitle": "5.0 out of 5 stars The Girl from Guernica: An epic historical novel",
                "reviewText": "So many stories of the horror humans have endured because of delusional egotistical vicious murderers. Hitler, Mussolini, Hirohito the emperor of Japan brought the Earth into a war of indescribable horror. They themselves never stood at the frontlines of their militaries, but forced others to fight the battles. This story was told from a different perspective than Americans have ever been exposed to. I am grateful for this writer bringing attention to Spains perspective or the horror that was brought to them. Knowing that behind the German lines there were people who fought Hitler’s soldiers as spy’s was acknowledging not all German people were supporting Hitler. As a side Note: I had a friend who was brought up in Germany during the war, she told of the general population in Germany that little or nothing to eat. She told of going to the trash bins of Hitler’s army looking for potato peelings, peelings from carrots, onions, brown cabbage leaves, turnip cores, even the gristle from meat that was being thrown away. As the years pass, it is the stories that people do not know about that can bring the horror of any war to life.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWBZCIA7TXSNUVK2UCMV7KZJCMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HJG1IP0DHBO?ASIN=0778333442",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Spellbinding with great characters",
                "reviewText": "Loved this book. Fascinated by the historical elements which I knew nothing about. Characters are fictional but I really liked all of the main ones. Author's writing was so descriptive and compelling that I felt I was there. I couldn't wait to find out what would happen next. I was very sorry to learn that this seems to be her only historical fiction book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ginger Russell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYETZTNENW7TJP4IUJ4VSI6NQEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H7ZBC7VXYGUD?ASIN=0778333442",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2022",
                "reviewTitle": "4.0 out of 5 stars Good Book",
                "reviewText": "This was interesting. I heard of Guernica a very long time ago because of the Picasso painting, but I did not know much about it. So I was intrigued by the story line, and it was different from most of the WWII era novels that I've read. I thought the book was well written, and it held my interest all the way through.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Joy  Myers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ6YRBHBFR4YVTLRX4NEI7NCYFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R6354GBJ8I84?ASIN=0778333442",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Vivid and true--historical fiction at its best",
                "reviewText": "I read this book in two sittings, it was impossible to put down. We are taken deeply into the tragedy of Guernica and see it through the eyes of its victims. The arc of the story is broad and covers many years, bringing us to a satisfying conclusion toward the end of the war. While there is a love story threaded through, it does not distract from the very real struggles of the protagonist and many who fought for democracy during WWII.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7TUAEIRA65Q2CMOR42XV7LQGFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S4I4EPXYIGUF?ASIN=0778333442",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2023",
                "reviewTitle": "5.0 out of 5 stars A moving review of familial and social upheaval associated with World War II.",
                "reviewText": "The Spanish Civil War is best remembered as a preview of things to come during World War II. The Luftwaffe bombed the village of Guernica , killed 1700 people and destroyed centuries of cultural prosperity and ancient architecture in the mid-1930s. We know about Pearl Harbor, but few of us realize that the extensive damage and cultural upheaval caused by The Luftwaffe in Spain was of equal significance. The Nazi contribution to World- wide economic collapse and the death of social responsibility is not a current issue, and few alive today can describe the total lack of civilian security and happiness experienced by our parent's generation in Europe. The Girl from Guernica creates a vivid narrative of the extent and social consequences of Fascist absolutism before and during World War II in Spain and Germany. This is a riveting story and will appeal to the younger generation as much as to today's parents and grandparents.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Glenda Sue Crawley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEID7CG6AFRMGVORVPD2APPBTTKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RNXKQUGK24AV?ASIN=0778333442",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Make sure you read this book",
                "reviewText": "I liked everything. I could not put it down once I started and almost cried when the end came. This author kept me on edge throughout and all I could do was think about the story. I hope I never have to become a Sibe. I can't wait to read other books by this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDPT6CQ3XM4Z4QRG5NYIJZSQ3PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GEUJFH6I7QZX?ASIN=0778333442",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Guernica",
                "reviewText": "I loved this novel. What sense of character is displayed by the different characters. Horrible things happen in war, but miracles do happen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEMRVLS746GN23TBNQGRKQDREMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPVGAUVUQA9GW?ASIN=0778333442",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2022",
                "reviewTitle": "4.0 out of 5 stars Captivating",
                "reviewText": "Karen Robards has done it again. This was hard to put down and started with a tragedy from history I was not familiar with. The storytelling and the characters were so real! Very good.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah K Smith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 28, 2024",
                "reviewTitle": "amazing!",
                "reviewText": "Couldn’t put this down and sobbed at the end - will never read the last chapter of one of Robards books on the treadmill in the gym again! 😂",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 8, 2022",
                "reviewTitle": "Guernica high in the western Pyrenees?",
                "reviewText": "The author prides herself of doing a thorough research. But doesn't even know where to locate the town of Guernica.Has completely let me down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teddy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 4, 2023",
                "reviewTitle": "Brilliant Delivery Service",
                "reviewText": "Very good price, excellent delivery and brilliant service.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "thelma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 1, 2022",
                "reviewTitle": "Brilliant",
                "reviewText": "Description is wonderful and the each chapter leads into next with excitement",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "susan rusby",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 30, 2023",
                "reviewTitle": "Very well written. Good story line.",
                "reviewText": "I feel that the story is very good. It keeps you interested, but it lacks the 'can't put down' feeling of Karen Robards earlier books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}