{
    "remaining_requests": 774,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Other-Einstein-Novel-Marie-Benedict/dp/1492647586",
    "body": {
        "name": "The Other Einstein: A Novel",
        "price": "$10.16$10.16",
        "originalPrice": "",
        "rawPrice": 10.16,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Other-Einstein-Novel-Marie-Benedict/dp/1492647586",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81K4pLE3vUL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Marie Benedict",
            "link": "https://www.amazon.com/Marie-Benedict/e/B01EX8MYO4/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 13683,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 39 mins",
            "FREE delivery March 3 - 13 on orders shipped by Amazon over $35",
            "Or fastest delivery March 2 - 11"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 1492647586"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Sourcebooks Landmark; Reprint edition (August 29, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9781492647584"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1492647584"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.84 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,758 in Books (See Top 100 in Books) #30 in Biographical Historical Fiction #59 in Biographical Fiction (Books) #830 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 13,683 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Carnegie’s Maid The Only Woman in the Room Lady Clementine The Mystery of Mrs. Christie Her Hidden Genius Don’t miss these inspiring reads from Marie Benedict! Discover the story of one brilliant woman who may have spurred Andrew Carnegie's transformation from ruthless industrialist to true philanthropist. Based on the incredible true story of the glamour icon and scientist Hedy Lamarr, this book celebrates the many women in science that history has overlooked. The ferocious story of Clementine Churchill, the ambitious woman who did not flinch through the sweeping darkness of war, and who would not surrender to expectations or to enemies. A thrilling reconstruction of one of the most notorious events in literary history: Agatha Christie's mysterious 11-day disappearance in 1926. Shines a light on Rosalind Franklin, whose world-changing contributions were hidden by the men around her but whose relentless drive advanced our understanding of humankind. An explosive novel of history's most notorious sisters, one of whom will have to choose: her country or her family?",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce4eb622-3a88-4948-b109-a9231d268bcd.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c10fad9e-5bb8-4d4e-a162-6b574f0c923b.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f875d1c-fc7b-4c52-b1c4-d71ec94d206c.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed09c5ee-76f6-43c9-8963-0f23e357a617.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ec94862-ae6e-4841-9827-f97bbec625ea.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dec89f20-26e5-4e26-a77b-dc99978339f8.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "nicole w brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH75DPMVVY73SKJNRGKUZK2RKXBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EJ59DMMCWSUL?ASIN=1492647586",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2019",
                "reviewTitle": "5.0 out of 5 stars An incredible story that paints Einstein in a poor light; brings forth Milena in a much better one.",
                "reviewText": "This book is about Albert Einstein 's first wife, Mileva \"Mitza\" Maric, a Serbian woman with a limp whose parents didn't believe she had any hopes of a future with a husband but was rather brilliant with math and science and could possibly have a future as a professor and doing research. Switzerland was a progressive country that was allowing women into its colleges and universities and Mileva was accepted into Swiss Federal Polytechnic in Zurich.She took up lodging at Engelbrecht Pension an all-girl boarding house where she became friends with Milana, Ruzica, and most especially Helena who also had a limp. She had never had friends before.as.She was always teased and ridiculed. In class, Dr. Weber was particularly hard on her because she was a woman and because she was Serbian. One student reaches out to.her and that student was Albert Einstein. He flirted shamefully with her and she turned him down. Her friend Ruzica talked her into going into one of the cafes where Einstein and his friends were having an intellectual discussion on science and she found herself drawn into the discussion. When Einstein found out about the women's playing music after dinner he showed up uninvited with his violin to play with Milena. The other women don't much care for him, though.Helena and Milena have made a pact to not have a man in their lives and to focus on their careers. But soon, Helena has found a man to love and has broken the pact. So, Milena doesn't see why she has to keep the pact too, especially when her mother is encouraging her to pursue romance even though her father is against it. Einstein and Milena have talked about marriage and while Einstein has graduated now and is looking for work, which is hard because his teachers aren't giving him good recommendations due to his absentees from class and his disrespect toward them. Milena took a semester off her second year in order to cool off her feelings for him and got behind in school which meant that she had to wait another year before she could take the test.Einstein talks her into taking a vacation at Lake Como where they can make love before they get married. Milena comes back pregnant and Einstein won't marry her without a steady job. She flunks the exams due to her pregnancy and he refuses to come to her home to talk to her parents about the pregnancy. He has a lead on a job in the Patent Office but for now, he's tutoring. She takes the train up to the next stop to see him but he refuses to take the train up to the next stop to see her. Eventually, her money runs out and she must go back home furious at him for not seeing her. She has a baby girl that he asks her to leave with her parents six months later because he got the patent office job and he listed himself as unmarried and he can't show up with a child in tow. So she does for now.On a paper they worked on together he asks that she take her name off of it in order for him to get better job prospects when he shows it to a friend. A year later their daughter comes down with scarlet fever and dies. On the way home riding the train, she comes up with the Theory of Relativity. The year 1905 was known as Einstein's Year of Wonder. He published four groundbreaking papers. Milena's name was supposed to be on them but he took her name off of them. She was furious. This cracked their marriage. Not to mention the infidelity. Einstein was a real bastard.While this book plays a little fast and loose with the facts in that no one really knows what really happened and the author is imagining what she thinks happened, it is indeed a possibility. You really feel sorry for Milena who loses everything in her association with Einstein. This was a really good book that tells an incredible story. I give it five out of five stars.Quotes I had become the embodiment of the old Serbian phrase the house doesn’t rest on the earth but on the woman.-Marie Benedict (The Other Einstein p 175)",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MAK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFFTQC6NNPIAIUR3PFNRIUIQLVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32L7Z92BGTRYX?ASIN=1492647586",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "4.0 out of 5 stars Interesting & engaging",
                "reviewText": "I recommend reading the author’s note at the end before reading the book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ann Handy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLX4YHU65GVWN7GD4SBHJRQZPKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R470I50V42FI6?ASIN=1492647586",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Albert Einstein: Who is this Man?",
                "reviewText": "Even knowing that this was a fictional novel, and after I read Benedict's background on the writing I found my view of Albert quite shaken. Einstein has long been one person I have admired. Even taking into account for literrary license I can see how his huge personality sucked the life out of the people who made his lifestyle possible. Benedict made a very interesting read and showed us how things very well could have been.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie McCall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIAFYGY52CLYABTK4YS42R6NWDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LNWA8MIQMU3P?ASIN=1492647586",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2021",
                "reviewTitle": "3.0 out of 5 stars Great Potential, Yet Slow",
                "reviewText": "April 2021 has been a month of firsts for me as far as authors. The Other Einstein was my first Marie Benedict book, and I so wanted to love it. I expected something akin to The Paris Library, which I did enjoy very much. And in fact, Marie Benedict does a lot of things well in The Other Einstein.For me, the novel's biggest draw was main character Mileva \"Mitza\" Maric. I adored her and considered her a fictional sister from our first meeting. From her scholarly bent to her mild disability, I felt like Mileva and I were almost twins from different eras. My heart broke for her as she was marginalized based on disability and sex, but I cheered for her gumption, determination, and intelligence. Better, Mileva is a three-dimensional and fully human character. She is not an \"inspiration\" just because she happens to be a disabled woman in a time period inhospitable to both those distinctions. Although I will admit, to a person with a literature brain instead of a science brain, Mileva certainly inspired me with her acumen for and dedication to physics.I also loved the scenes with Ruzica, Milana, and especially Helene. They are the kinds of friends I wish I'd had growing up and while pursuing advanced degrees. And while I knew the point of The Other Einstein was to take a look at well, Einstein's wife, I kind of rooted for the quartet to somehow stay \"together,\" single and pursuing their careers in an early twentieth-century example of feminism. But if I couldn't have that, the friendships and dialogue are wonderful enough. Mileva's relationship with Helene is particularly interesting, feminine without being silly and sometimes painful without being full of angst.I also applaud Marie for delving, at least somewhat, into the social climate of Germany, Switzerland, and the Austro-Hungarian empire of the time. I wasn't familiar with Eastern European culture before reading this book, and while I knew a little of the prejudice ethnic groups like Serbians faced, I didn't know much about that, either. Marie taught me a lot without being pedantic or dry, and without driving it into my head that bigotry was a huge obstacle for the Einsteins. In fact, the constant presence and \"normality\" of anti-Serbian attitudes, anti-Semitism, anti-feminism and the rest made it all the more jarring. I even caught glimpses of what Germany, Austria, and fellow countries would face in the ensuing half-century.Finally, I appreciate Marie's work in delving into a character, a real person, about whom history tells us almost nothing. Under her hand, Mileva Maric Einstein becomes relatable. She enjoys the same things modern women do, like hanging out at coffee houses or visiting beautiful forest haunts, with her own spin on that enjoyment thanks to her prodigy status. She looks for God in science and science in God, and has to struggle to form her own identity and philosophy after being told, \"You can only do certain things, fit into certain places, accomplish what is approved.\" Not only Mileva herself, but the people and settings around her, written with such detail, carried the story for me.Okay, so what's the problem? Well, \"problem\" kind of depends on who you ask. For me, about halfway through and even before that, The Other Einstein became tediously slow. Mileva was growing, events were happening...and yet she always seemed acted upon, not like a self-determined person. Part of that is probably her time period; no such thing as politically correct history, after all. But also, her character voice became bogged down. Telling over showing, a hazard of first-person POV, eventually became a problem, as did some obvious and sensory phrases. For example, during a scene where Mileva is infuriated, she straight up says, \"I felt rage.\"Additionally, it seems odd, but I didn't like the presence of Einstein in this story. I don't know much about him personally, so Marie's portrait may well have been accurate. That wasn't my issue. My issue was that I could see where his and Mileva's relationship was going a mile away, and thus, what the lesson or point of the book would be. Combine that with the ever-slowing pace, and I got bored and disappointed.With this said, the things I didn't like about The Other Einstein were probably down to Marie's stylistic choices. If you're a fan of her writing style, you'll probably love the book, and as noted, there's a lot to like regardless. I'm disappointed The Other Einstein wasn't a favorite, but willing to try more like it and recommend it to particular audiences. My recommendation is stronger if, like me, you enjoy stories of smart or prodigy women, or women with unusual talents or circumstances, making their way in what was and sometimes still is a man's world.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariana Rosas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 11, 2022",
                "reviewTitle": "Increíble libro",
                "reviewText": "Bien documentado con mezcla de ficción. Te hace sentir el amor que fluye y el coraje que puede producir compartir su vida con alguien como su esposo. Lo recomiendo en su idioma original el vocabulario es muy formal. Me encanta.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MARINA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 25, 2023",
                "reviewTitle": "Adoro los libros de esta autora",
                "reviewText": "Me encantó este libro y me dio visibilidad sobre la historia que no conocemos. Me encantan los libros que escribe Marie que da visibilidad a figuras femeninas de la historia",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ABHIK DE",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 4, 2023",
                "reviewTitle": "Excellent Book",
                "reviewText": "Very good and engrossing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 5, 2022",
                "reviewTitle": "Bought as present !",
                "reviewText": "Bought as a Christmas present As what do you buy a woman who has most things 👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rhodo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 28, 2020",
                "reviewTitle": "I found this to be a TERRIFIC read",
                "reviewText": "It is not too long so I snuggled down in my recliner and didn't stop reading it until I had finished it. It purports to tell the story of a young Mr and Mrs Einstein. I was very surprised by what I read. If it's true (and the author gives numerous sources including personal letters). If it's true, I was shocked to find that Al was something of a mysoginistic a--hole. What a shock. Mrs E was the one who could to the complicated arithmetic and physics to support the theory of relativity. Al didn't give her credit until the got divorced at which time he gave to her the cash which he was given along with his Nobel Prize. What an eye-opener (if true). And all very well written.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.66",
                "sellerName": "Shakespeare Book House",
                "sellerRating": "5"
            }
        ]
    }
}