{
    "remaining_requests": 931,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Praise-Bees-Kristin-Gleeson-ebook/dp/B011GRO8T4",
    "body": {
        "name": "In Praise of the Bees: A literary historical novel of Medieval Ireland (Women of Ireland Book 1)",
        "price": "$0.99",
        "originalPrice": "",
        "rawPrice": 0.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Praise-Bees-Kristin-Gleeson-ebook/dp/B011GRO8T4",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91uxdy75ptL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kristin Gleeson",
            "link": "https://www.amazon.com/Kristin-Gleeson/e/B0088HDT5U/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 3350,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B011GRO8T4"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ An Tig Beag Press (September 10, 2015)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 10, 2015"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4062 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0995628157"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,795 in Kindle Store (See Top 100 in Kindle Store) #23 in Historical Mystery, Thriller & Suspense Fiction #65 in Historical British & Irish Literature #112 in Historical Literary Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 3,350 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Headly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV2W5NOBJQXDPSIMXMESMQRAKBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R276SSXZ2V1IK7?ASIN=B011GRO8T4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars A story based in fact from old Ireland",
                "reviewText": "Begorrah! And its a lovely tale to to be repeated forever.Its actually a story about murder and vengeance and how the Irish slowly came to embrace the Catholic Church .The story unfolds with a terrible beating of a young woman found by the side of the road. Beaten, stabbed and joints broken and now being found by a passing stranger, she's carried to a Convent overseen by a very caring and wise Mother Superior.Seeing how this is the medieval Ireland there are many instances of the Irish language, Gaelic, abundantly inserted in the story.It's a bit difficult to figure out at times but the author has included a handy reference of pronunciation and meaning thereof.What will happen to the young lady is always a question and keeps you interested throughout the book. Will she exact revenge or will new faith show a different way?One takeaway from the story is, should you ever get the chance to visit Ireland .....take an umbrella!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Verity Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFJETADE4GMIAMJGAICOJRTFJ3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V7UMI3FK0S1Z?ASIN=B011GRO8T4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "4.0 out of 5 stars A slow-burn mystery",
                "reviewText": "This is an interesting mystery novel, although I suspected the culprit almost as soon as he was mentioned. The long, slow path to the revelation of the truth was worth it, though. And the characters all seemed like very real people of their time.Only two things bugged me: one was the excessive use of Irish terms (it's hard to keep referring to a glossary in an ebook), and the other was the use of present-tense storytelling (which is currently very popular, but not preferred by me).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Picky Girl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMA77W2Y2UY5UZHYWDNTU3OIQWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25YJAL16QB652?ASIN=B011GRO8T4",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2018",
                "reviewTitle": "3.0 out of 5 stars Landed with a thud",
                "reviewText": "It makes me sad to write this review and I wavered between 2 and 3 stars because I really wanted to like this book. It opens strongly, with severe injures to an intelligent, appealing heroine and ends with a tentative, lukewarm thud. The reveal of the attacker, what should be the climax of the book, is vague and emotionless. Aine/Cuimne’s reaction is similarly equivocal. (Potential spoiler alert) When she learns the identity of her attacker and brother’s killer she’s confused? She seeks no justice, seemingly feels no anger (let alone terror) turns to needlepoint and simply lets it all go? Then, conveniently, the wife of her love interest suddenly wants to join the order and make sure he has someone younger to give him children and offers him up basically on a silver platter? Sure.In the first half of the book I felt the characters’ motivation. They were three dimensional flesh and blood people living In a fully realized, full color world. Then that feeling slowly leached away leaving a colorless, gray, dull hodgepodge that was part history lesson, part language training, and thoroughly unsatisfying.After the obviously thorough research, and creating a heroine I truly empathized with, the ending was so facile and rushed I felt incredibly let down. Aine and I deserve better!",
                "reviewVotes": "48 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louise Hampton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENBLHB6WTSRUXAU247JGRYLWKFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TD6ORNHA7P5U?ASIN=B011GRO8T4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautifully Woven Tale!",
                "reviewText": "I chose this book because I have a fascination with both history and 🐝 bees!I am an apprentice Beekeeper in my retirement after lifelong love ofe bees!This book is a beautifully woven tale of a young womans journey back from death to control of her life.She is blessed by being taken to a community led by the most spiritual of women. Not only skilled in healing the troubled souls coming her way but skilled in skills of healing the body. The leader of the community is our master Beekeeper, and her philosophy is enhanced by her observations of Bee colony activities. She relates these activities the wonder of God's plan for how one should live life.Our main character is restored by life at the community and leaves to find her purpose but ultimately has to return to the spiritual community to find the true answer to her questions. A wonderful read full of history, mystery, and spiritual thought-provoking ideas!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "arthur rees",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEX4VJQJBNYUJ7GRSY7IGYXVBJIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P9SIA9JYGRUV?ASIN=B011GRO8T4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Irish medieval church history",
                "reviewText": "This novel provided insight into the lives of medieval peoples, particularly women. The time period when the worship of many gods was being challenged by the emergence of Christianity. I wish the enclosed Irish dictionary was alittle broader to assist my understanding of words used (but not defined). Overall a very interesting story and recanting of the lives of 2 Irish saints.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P.J-F.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 7, 2024",
                "reviewTitle": "I'm not sure how",
                "reviewText": "This book held me. I'm not religious, I can not easily identify with this woman... And yet...Thank you for a well-written, enjoyable story.And it's QUEEN bee, not \"king\". -1 ⭐.Sorry, that grates.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 27, 2024",
                "reviewTitle": "Wow just wow",
                "reviewText": "Truely inspiring, not at all what I expected. It didn't trot out the same tired scenarios it is truely unique.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AMZ Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 30, 2020",
                "reviewTitle": "Interesting historical novel",
                "reviewText": "I was drawn to the book because of its plot & setting. It's probably my first foray into early Irish history. The plot is neatly woven, and kept me glued till the end. Aine/Cuimne is a strong woman & her progress from where we meet her for the first time till the end is quite engaging. Mathair Gobnait must have been an extraordinary woman. The fine nuances of life in the community are very well sketched. Overall an interesting read, and the only thing that needed some more explanation was the reason behind the attack on Aine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LHK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 26, 2017",
                "reviewTitle": "Well researched and interesting",
                "reviewText": "I love a historical novel that is well researched. This one definitely fits that description.The story was interesting and had me captivated from the beginning. I couldn't wait to find out more about the mysterious protagonist. I won't say much about the plot, so not to spoil it, but I felt the second half of the novel had a much slower pace. The mystery was solved at the end, but the resolution was unstatisfying for me. It did however fit in with the strong theme of Christian forgiveness that runs through the novel.The best part about this book is the glimpse of medieval Ireland that it gives you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NicShef❤️Reading",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 7, 2017",
                "reviewTitle": "Fascinating historical fiction...",
                "reviewText": "Kristin Gleeson has written a wonderful story based on an incredibly generous community of women in Ireland in Medieval times. A glorious and unique story about 6th Century Ireland, it is excellent historical fiction - both fascinating and gentle. I like the fact that it has many strong, intelligent female characters in it. I'm not normally one for historical fiction of that period, but the theme of bees attracted me to the title and I was most intrigued by the premise.A farmer and his son discover an unknown women (Áine's) in a ditch with bones broken and her body covered in blood. She is taken to the convent (abbess), Máthair Gobnait, who is known for her healing through honey and herbs.She observes a community of nuns intent on celebrating God and healing the sick, which opens up a sense of peace to her life and in her soul. As Áine recovers, listening to the hymns and sounds of worship her body, mind and soul recover. We long for Áine to remember her past if only to find out the nature of her attacker. We follow this young woman's story through her conversion to Christianity, recovering of memories, and the choices she has to make.Later canonized as Patron Saint of bees, Mother Gobnait is portrayed as warm and wise, overseeing all the practical tasks in this self-sufficient community. And of course she is an expert beekeeper, passing on her love of bees to her newest follower, Aine. The overarching story of Aine's recovering her memory and facing what this means for her is unveiled slowly... to the hard choice she must make, as she remembers people from her past life.I enjoyed Kristin Gleeson's writing very much she portrays relationships realistically and draws out the characters well, if you like historical fiction this is a great tale to enjoy. This is a definite 5 star read.PS:- Throughout the book there is Gaelic Language interwoven throughout which can be confusing, there is a glossary in the back which helps...",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}