{
    "remaining_requests": 786,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/When-We-Were-Enemies-Novel-ebook/dp/B0BXBFVSG7",
    "body": {
        "name": "When We Were Enemies: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/When-We-Were-Enemies-Novel-ebook/dp/B0BXBFVSG7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81-jSNdPhnL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Emily Bleeker",
            "link": "https://www.amazon.com/Emily-Bleeker/e/B00O086G2E/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 11943,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BXBFVSG7"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Lake Union Publishing (December 1, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ December 1, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 8257 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 345 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,556 in Kindle Store (See Top 100 in Kindle Store) #11 in Historical World War II Fiction #26 in Small Town & Rural Fiction (Kindle Store) #32 in 20th Century Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 11,943 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/e2dc1bd8-b019-4181-a987-6879bef32ff6.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Susan Fryman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV77MB73U4LQ5AVC6UZ57VWPS5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7QLD8F0SKRHM?ASIN=B0BXBFVSG7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars When We were Enemies",
                "reviewText": "A dual timeline story following Vivian and Elise, who are related. Fascinating from the beginning. Excellent job with the dual timeline and character development. Vivian is second generation Italian and takes a job at Camp Atterbury. I learned quite a bit about this Camp, close to my home. It housed Italian and German POW’s during WWII. It also held USO functions as it does today. It also talks about housing close to 5,000 refugees from Afghanistan recently. The history was quite interesting. Elise is getting married in modern times and coerced into marrying at the chapel in Camp Atterbury built by the Italians POWS. This book gave a glimpse into the lives of these Italian POW’s at this Camp. Vivian and Elise have much in common with family life and romance, both have bumpy roads. This was a new author for me and I look forward to more of her books. I received an advance review copy for free, and I am voluntarily leaving my review.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LKB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECZL3DOUAPJJWQ5OIEQLQ36FLBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TLNR4TKYN5FO?ASIN=B0BXBFVSG7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "4.0 out of 5 stars Family drama then and now",
                "reviewText": "3.5 StarsCurrent day, Elise is a PR powerhouse. She is also the daughter of a famous actress and the granddaughter of a beloved Hollywood icon. Newly engaged, she is talked into combining her wedding planning with a documentary about her famous grandmother’s early years, against her better judgement. It’s 1943 and Vivian needs a way to help support her injured father, mother who is in a psychiatric hospital and younger sister, still at home. She secures a job at a POW camp translating for the military and the Italian Prisoners. Vivian moonlights as both a dancer and a singer at the local USO.The book follows both stories, easily switching between the two. The author gives us a look into the prisoners, military and the local USO club, not to mention film making. Vivian’s dedication to both family and job are admirable, always putting her own wants and needs secondary, totally realistic to the time. Storylines flow nicely and the cast of characters is easy to follow. Characters are transparent, there are no surprises into their nature. The stories come together nicely, but there were a few gaps I would have liked filled in. The story could have been a little longer to really bring it to a more complete close. The war takes a backseat to the family drama unfolding. I’ve enjoyed this author’s previous thrillers and look forward to reading her again.Thanks to NetGalley and Lake Union Publishing for the ARC. This is my honest opinion.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Montclairmomreader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETOERM3E2HQGPYW6TMKGRFADR6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXCBHIYKDJ3RR?ASIN=B0BXBFVSG7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Immersive story, expertly-drawn characters",
                "reviewText": "What is not to love about this book?A dual timeline twisty plot with just the right dose of sexual tension and romance, family secrets, mother-daughter drama, and history. In 1943, Vivian, a young Italian American girl who sings for the USO gets a job as a translator for Italian prisoners of war held in internment camps on US soil. This is a part of WWII history I knew little about. Bleeker does a masterful job creating the era and weaving historic details into Vivian’s story, including her sense of loyalty to the US and her compassion for the prisoners, especially a young priest whom she befriends. The second timeline, present day, is centered around Elise, the granddaughter of Vivian who, we learn, became an iconic film star. Elise, who is grappling with the death of her last fiancé and feelings of ambivalence toward her current one. As Elise prepares for her wedding—at the church where her grandmother Vivian also wed—she unwittingly lands upon secrets that have the potential to threaten her grandmother's reputation and the family's legacy. Expertly drawn characters, immersive story and vivid language.No spoilers, but I highly recommend this book!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janna K Brimer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWNBSX7YS55PPXI5SYIPZ2HENHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNMO871OSTGWI?ASIN=B0BXBFVSG7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Emily Bleeker understands being human",
                "reviewText": "There are so many states of being human, determined by environment, period of time, family, talents, weaknesses, strengths, and even world events that we cannot control. Cultural influences wrap us up and throw us into a state of mind that we don’t even recognize as being caused by our heritage and the customs we learned by osmosis. Some cultures value the strong man being the boss in the household, the protector and bread winner. Others value the strength women have to keep everything afloat in the midst of crisis. Nearly everyone contemplates whether they believe in God or not and at some point in their life they make a decision regarding that question. Emily seems to create characters who we as readers can identify with in some way. She had me empathizing with her characters from the POWs to the spoiled rich kid, to the overly protective parent and the woman who made excuses for brutish actions of her lover/abusive husband. The plot gave away clues to misdirect and also revealed subtle hints about the generational truths that had been hidden. Enjoy the ride through the humanity of this tale.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frieda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKRF7AIK2L6LN42TZ2VBJNQTTVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U3L16G7QTVOD?ASIN=B0BXBFVSG7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "4.0 out of 5 stars When We Were Enemies",
                "reviewText": "I really liked this book, but i held back one Star for 2 small negatives. I'll begin by saying that the characters were very realistic, maybe too realistic at times. Enough to trigger PTSD! But the stories as a whole are well written. The two timelines meld together well, as far as I see. I felt the characters emotions as deeply as my own! I could see myself as either Vivian or Elise, IF I could sing & IF I had my own business! The negatives are that I'm not a fan of multiple timelines, but even though there are only two, I kept getting them confused, more than usual. Second is something I've seen in many modern books, so it may be just a new writing style. I felt that the book has a rushed ending. Elise's story could have gone on a bit more, but at least leaves me with hope. Mostly it's Vivian's story that felt clipped, or as the author said at one point \"left on the cutting room floor\". What happened after the Chapel Dedication? Her career? Her personal life? How was her family affected, other than having bills paid & education set up?? What, if anything, happened later w/ her & the Priest? I just have too many questions!!!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bruna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 15, 2024",
                "reviewTitle": "Fun!!!",
                "reviewText": "This book kept me wanting to read more and more. I had never read something from this author, but I'm excited to read more, especially after I saw that it is somewhat based on true stories. Reading is light, and I like that is divided into small chapters for each character, so you get these small chunks of each one's stories and you can't wait to know more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael J.N.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 29, 2024",
                "reviewTitle": "Excellent read",
                "reviewText": "This is the second Emily Bleaker novel I have read and like the first (When I'm Gone) I enjoyed it very much.The two different time lines which are inextricably linked have great characters and plenty of tension which keeps the narrative moving at a good pace.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Down Under Reviewer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 8, 2024",
                "reviewTitle": "wow",
                "reviewText": "This story was amazing as it crossed between two women and two different events in time. With a bit of mystery thrown in it was a great story. Though for me an epilogue would have been great to let you know what happens in the future. Though it does end with a hint of what was in the future.Narration was awesome.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne Guenther",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 30, 2023",
                "reviewTitle": "Loved it",
                "reviewText": "My first book by this author and it did not disappoint. I loved it, it grabbed me from the beginning, it was very hard to put down at the end of the day. I look forward to reading more of her books",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Library Lady",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 4, 2024",
                "reviewTitle": "generational story",
                "reviewText": "This story alternates between modern day Elise's story and that of her Grandmothers in 1943. To be honest I found Vivian's story far more gripping than Elise's. The modern day story was contrived and didn't feel real whereas the war time love triangle would have made a great story on it's own.The ending was abrupt and disappointing .",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}