{
    "remaining_requests": 995,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Seamstress-New-Orleans-Fascinating-Historical/dp/1496738160",
    "body": {
        "name": "The Seamstress of New Orleans: A Fascinating Novel of Southern Historical Fiction",
        "price": "$10.47",
        "originalPrice": "$16.95",
        "rawPrice": 10.47,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Seamstress-New-Orleans-Fascinating-Historical/dp/1496738160",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81TUaDXg1mL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Diane C. McPhail",
            "link": "https://www.amazon.com/Diane-C-McPhail/e/B07K1LWJDL/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 3905,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for The Seamstress of New Orleans “McPhail entices with the story of two women from different backgrounds who discover common ground in turn of the 20th-century New Orleans…An undercurrent of New Orleans’s dark side propels the story, heightening the tension and supplying McPhail with a wealth of evocative details. Historical fiction fans will be drawn to this.” —Publishers Weekly “From the captivating first line, The Seamstress of New Orleans transports the reader to the mystery and sultry magic of New Orleans. With McPhail’s acclaimed and atmospheric prose, The Seamstress of New Orleans is a tale of well-guarded secrets, societal bonds that must be broken, and women’s powerful resilience. A powerful and fascinating story.\" —Patti Callahan, New York Times bestselling author of Surviving Savannah “In a time and place when women were relegated to the home, these New Orleans ladies set about crafting their own future. Story threads of missing husbands, menacing gamblers, and a society on the cusp of changing women's rights weave together to form a riveting tale. The history of the first all female krewe was so captivating that it sent me to do some googling for extra information. McPhail has stitched an impressive work of historical fiction that will fuel plenty of bookclub discussions.” —Pamela Klinger-Horn, Valley Bookseller (Stillwater, MN) “Reading this novel is like dining on a creole dish: rich, mysterious and oh so satisfying.” —Fran Ziegler, Titcomb’s Bookshop (East Sandwich, MA) “McPhail has created a novel that is at once a mystery and a novel of feminine friendship and empowerment. She reminds the reader of how constricted life for women at the turn of the century was, and she illustrates this with two very different characters…The Seamstress of New Orleans leaves you wanting more of New Orleans, a place that is saturated with history. It is a perfect summer book to sit back with a glass of sweet tea and enjoy.” —New York Journal of Books About the Author Diane C. McPhail is an artist, minister, and acclaimed author of The Abolitionist’s Daughter and The Seamstress of New Orleans. A graduate of Ole Miss, Duke Writers, University of Iowa Distance, and the Yale Writers' Conference, she is a member of NC Writers Network and the Historical Novel Society. She lives in Highlands, North Carolina with her husband and dog. For more information, please visit Diane online at DianeMcPhailAuthor.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "$22.19 Shipping Import Fees Deposit to India",
        "deliveryMessages": [
            "Delivery Thursday, March 7. Order within 22 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Set against the backdrop of the first all-female Mardi Gras krewe at the turn-of-the-century, the acclaimed author’s mesmerizing historical novel tells of two strangers separated by background but bound by an unexpected secret—and of the strength and courage women draw from and inspire in each other.“An undercurrent of New Orleans’s dark side propels the story, heightening the tension and supplying McPhail with a wealth of evocative details.” —Publishers Weekly1900: Though the dawn of a new century promises social progress, there are few options for women like Alice Butterworth, pregnant and abandoned by her husband. In desperation, Alice leaves Chicago’s bitter cold and travels to New Orleans, where she offers sewing lessons at an orphanage.Young widow Constance Halstead has thrown herself into charity work since her husband’s death. Seeing Alice’s skill, she offers lodging in exchange for help creating a gown for the Leap Year ball of Les Mysterieuses, the first all-female krewe of Mardi Gras. Leap Years offer women a rare opportunity—to turn the tables on men, upending convention. As the breathtaking gown takes shape piece by piece, it becomes a symbol of empowerment for them both.But overshadowing all is the Black Hand—the vicious New Orleans gang to whom Constance’s husband was deep in debt. His death hasn’t satisfied them. And as Mardi Gras draws near, a secret emerges that will cement the bond between Alice and Constance, even as it threatens the new lives each is building . . . Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ A John Scognamiglio Book (June 27, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1496738160"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1496738165"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 14.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.46 x 0.94 x 8.24 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#52,352 in Books (See Top 100 in Books) #4,506 in American Literature (Books) #6,552 in Historical Fiction (Books) #8,196 in Women's Literature & Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 3,905 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI6QZ6OF2BDAFJ3ZHNYQCUZGUKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26P0LQU9N3XOF?ASIN=1496738160",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars 5 star book!",
                "reviewText": "I had a hard time putting this book down! I loved the time period and the story line. It makes a great book club read. I would love to see the dress!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPRT4WZAS7RQOYIPM6TT3D32XZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O1PXULU80HUS?ASIN=1496738160",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "4.0 out of 5 stars Plot Twist",
                "reviewText": "Spoilers in this review****I was a bit confused when I first started reading this book. I couldn’t figure out why the main character shad 2 daughters then no children, especially since they both had a baby boy that died. It took 5 chapters (sad, right?) to finally grasp that these are two women living parallel lives that would soon pivot and intersect. I do feel the book was a bit shallow for what I typically read, though it would have been much longer if they had delved into the characters backgrounds or lives more than just this one circumstance, so I do get it. And it seemed to end on a cliffhanger with Alice knowing the children are half siblings but not ever telling Constance or even Analee. I’d love to see a sequel about Analee and her perspective. Particularly since this time period was still segregated. It would be a very interesting follow up.Overall, the story line was good, the characters were just dynamic enough to build upon and the moment of Alice totally solving the puzzle was decent. (It could have been given a bit more importance in the story). I gave it a 4⭐️ for keeping me engaged and wondering when things would happen.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angela Alvarez Velez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQHI6ILJ3VDLENCRUDX6BLKXC6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XFQD7OFYSQZZ?ASIN=1496738160",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2022",
                "reviewTitle": "3.0 out of 5 stars Lots of potential but even more problems",
                "reviewText": "MINOR SPOILERS. (The kind you find out about in chapter two, but be warned) The idea of this book was very seductive, but there were a few problems in the execution. Chief among them was that the dialogue was clunky, a whole bunch of info-dumping where you could tell the author was just trying to tell you that she had done her research. There is an exchange about how aspirin comes from willow bark or whatever that does nothing to forward the plot, a bunch of sewing references and mythology that come out of nowhere and contribute nothing. There are so many of these. How many times does Constance say she is grateful for the Napoleonic law that protects her money? Five? Ten? Once is enough. We get it. And the inner dialogue is so repetitive. One paragraph after another restating the same thing. And the flashbacks and the backstory are the same throughout, with no additional layers, nothing new gained from looking back, just over and over how everything reminds her of her mother and her baby and her mother but also her baby but look, this reminds her of her mother and also her baby but sometimes her father and also her mother and her baby for BOTH WOMEN. The \"twist\" wasn't really that twisty, fairly predictable but also made no sense. All in all, the book seemed to have no climax. Wait, the ball, this is it, something is going to happen, it's going to be BIG...oh, wait. No. Ok, but the police are here, they know something, it's going to be BIG. Oh, no it's not. But Dorothea, surely she knows, she's going to say something. Oh, no she's not. Martin, that's it, something's going to be interesting there. No, it's not. Alice is going to say something! She doesn't. But surely this is about the orphanage. Or the vote. Or the other women. Or feminism. Or justice. Or not. The end is rather unsatisfying. Also, the whole part about the husband's double life was disappointing in a modern book. I get that this was an issue then but it isn't now and the author could have done better than to describe a man who was attracted to other men as \"less than a man\" or \"not a real man\" or needing to make up for his sinful, perverse ways by pretending to be attracted to \"women with boyish bodies\" and having him be guilty of every vice to reinforce this idea that he was a baaaaaaaaaad man, and the woman who forgives him is of course close to sainthood, dripping with understanding, but of course she could not love him but she does not blame him but he was evil and deserved to die but she rises above it all with a knowing smile and a gleam in her eye for she is so good and look, she made a friend! Really needed a good editor.",
                "reviewVotes": "106 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lgjones01",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA276NRDHNU6TQ52WAHFIMRYGJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JW85STBITUWI?ASIN=1496738160",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Great story",
                "reviewText": "I referred to a friend after the first dozen chapters.😃 I'd love a follow up to see What became of everyone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "alirob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYBL2F3IWZZVBFHHZDSUYPWPG2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ASLH3JAOGE41?ASIN=1496738160",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "4.0 out of 5 stars The Seamstress of New Orleans",
                "reviewText": "The storyline was good. However, it seemed a bit too slow. Unlike other books that keep you going, this was a bitbhard to go back to.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Hall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK4SXXIFBI3B533DHBV2FXQEMIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FXGUQ2A397QB?ASIN=1496738160",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved every page.",
                "reviewText": "Diane, another master piece even better than the last. I’ve binged this book from start to finish. All the elements of a good story combined with history and art.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Sage Johannes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQEMBFDV5V4X2M46GEZBJ6XLUFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22KQGWBIJ1MBN?ASIN=1496738160",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Historical fiction and mystery - well written",
                "reviewText": "I enjoyed the combination of mystery and historical fiction. Two strong women who through their friendship find their purpose and way in a time when it was still very much a mans world.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gigi Jordan Hunter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVDVQUGHSFLECBUZ7G5I4FCQAMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM3KV4WI1OPSV?ASIN=1496738160",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Who is he anyway?",
                "reviewText": "The alternating chapters for Constance and Alice seem to establish the plot. As each woman describes her own husband it is possible to recognize the similarities of the men. Each husband was distant. Each was ineffectual as a lover. Each had been responsible for his own son's death. Each traveled extensively for his job and was gone for extended periods of time.Constance was raised in the wealthy New Orleans society. Alice was raised on a prairie farm. Both women were basically ignored by their own fathers. Their mothers treated each more lovingly. The women were put in a role of subservience to the men in their families.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 28, 2022",
                "reviewTitle": "Brilliant story",
                "reviewText": "This was a great story of New Orleans at the turn of the19th century and brought it to life with the detail and description of Victorian America and the life and times of both rich and poor alike in a unique city",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}