{
    "remaining_requests": 1013,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Americas-First-Daughter-audiobook/dp/B0195ED2CO",
    "body": {
        "name": "America's First Daughter: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Americas-First-Daughter-audiobook/dp/B0195ED2CO",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61FwqB4xuRL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Stephanie Dray",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Stephanie+Dray"
        },
        "brand": "Stephanie Dray",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 24903,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In a compelling, richly researched novel that draws from thousands of letters and original sources, best-selling authors Stephanie Dray and Laura Kamoie tell the fascinating, untold story of Thomas Jefferson's eldest daughter, Martha \"Patsy\" Jefferson Randolph - a woman who kept the secrets of our most enigmatic founding father and shaped an American legacy. From her earliest days, Patsy Jefferson knows that though her father loves his family dearly, his devotion to his country runs deeper still. As Thomas Jefferson's oldest daughter, she becomes his helpmate, protector, and constant companion in the wake of her mother's death, traveling with him when he becomes American minister to France. It is in Paris, at the glittering court and among the first tumultuous days of revolution, that 15-year-old Patsy learns about her father's troubling liaison with Sally Hemings, a slave girl her own age. Meanwhile Patsy has fallen in love - with her father's protégé, William Short, a staunch abolitionist and ambitious diplomat. Torn between love, principles, and the bonds of family, Patsy questions whether she can choose a life as William's wife and still be a devoted daughter. Her choice will follow her in the years to come to Virginia farmland, Monticello, and even the White House. And as scandal, tragedy, and poverty threaten her family, Patsy must decide how much she will sacrifice to protect her father's reputation, in the process defining not just his political legacy but that of the nation he founded. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b?ie=UTF8&node=10177"
            },
            {
                "name": "Biographical",
                "link": "https://www.amazon.com/Biographical-Historical-Fiction/b?ie=UTF8&node=9332127011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "23 hours and 28 minutes"
            },
            {
                "name": "Author",
                "value": "Stephanie Dray, Laura Kamoie"
            },
            {
                "name": "Narrator",
                "value": "Cassandra Campbell"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 01, 2016"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0195ED2CO"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,899 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #30 in Biographical Fiction (Audible Books & Originals) #54 in Biographical Historical Fiction #99 in Biographical Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Suzanne L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHDEFOX5NUCCFWA7ZVZ64SV2NDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W23ZOJVC49VS?ASIN=B0195ED2CO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Read!",
                "reviewText": "Love historical fiction and this book is a very interesting read. Even though it’s fiction it provides a very vivid portrait of the era.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B. Burnham",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5Z2EGPOE6PMQCDVCWD7QNMQBKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OFCHYIQXL4AM?ASIN=B0195ED2CO",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Extraordinary life of Martha \"Patsy\" Jefferson Randolph",
                "reviewText": "My book club reads a lot of biographical fiction. It’s an interesting and entertaining way to learn more about a specific time, place, and person in history. This month we chose America’s First Daughter by Stephanie Dray and Laura Kamoie. With the first person POV of the main character, Martha “Patsy” Jefferson Randolph, it explores the life of not only Thomas Jefferson’s daughter, but of his contemporaries and family members. The book begins when Patsy is a young girl and finishes with her later years. It is filled with historical detail that a history-nerd will love. The Revolutionary War and the early years of the nation are not time periods I generally read, but this book was fascinating in its portrayal of a young nation founded on high moral principles, yet in reality a democracy riddled with injustices. Slavery, the huge elephant in the room given Jefferson’s own ownership of slaves and his relationship with Sally Hemings, is a big part of the story. Patsy is definitely a woman of her time, and though she abhors slavery (as do many of her acquaintance) she is unable to affect any kind of meaningful change. In fact, those with the power to do so either were unsuccessful or left it to later generations. The authors do a good job of balancing the context of the time (slavery, limited rights of women and children) with an honest portrayal of the subject matter. This is Patsy’s story to tell, and I feel the authors allowed this incredible woman to tell it. Patsy was witness to so much — the American Revolution, formation of a new nation, the unfolding of the French revolution, the rise and fall of political factions — yet she was first and foremost a dutiful daughter, a committed wife, and a nurturing mother of many children. Her life was both extraordinary and ordinary, and the novel expresses that so well.If you are a fan of early American history, then this book is definitely for you. My book club googled a lot during the reading of the book! We also had an outstanding discussion.Recommended.Audience: adults.(I purchased Kindle ebook from Amazon. All opinions expressed are mine alone.)",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elias D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWYWJWBMJ4H252KNNUYVMP5FKDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CNXA7477QI27?ASIN=B0195ED2CO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2017",
                "reviewTitle": "5.0 out of 5 stars yet I learned so much more about him and his brilliant but tortured soul",
                "reviewText": "A little disclaimer before we begin. I’m a MASSIVE history nerd, and even more so, American History (mostly Revolution and Civil War). Between having the Hamilton soundtrack on repeat most days, our recent Independence Day in America, a few historical road trips over the past couple of months, and the current state of affairs in our nation, I couldn’t help but pick up this book. I actually purchased it months ago, but when I was going through my personal shelves looking for something that just “spoke” to me in the moment, this was the one that won out instantly. After spending almost a full month savoring every page, I can finally say it was well worth the journey.I always knew the Founding Fathers were superheroes of sorts. As Thomas Jefferson told me when I was in Williamsburg not too long ago, “we stand on the shoulders of giants”, and while he was referring to those who came even before him, I know I can say this about these men as well. Speaking of Jefferson…While First Daughter is a work of historical fiction, the authors clearly did their research and brought in material from thousands of letters and documents to tell the story through the eyes of Martha “Patsy” Jefferson Randolph. We meet her as she travels with her father and family to escape the British during The Revolution and follow every monumental moment of her life to an Andrew Jackson presidency.Throughout most of the book, she speaks of her father doing his duty to the American nation, but what she doesn’t tell us directly is the part she played helping to shape the country. The Jefferson family suffered quite a bit, and thanks to Patsy, I was able to go behind closed doors and really understand and sympathize with not only their family, but the author of The Declaration of Independence and our third president.My heart ached for Mr. Jefferson, yet I learned so much more about him and his brilliant but tortured soul. His losses are tremendous, whether it’s of a child or his beloved wife, but his duty to family and country are to be admired greatly. He promises his dying partner he’ll never marry again, so Patsy becomes his companion of sorts and helps him on days when he can’t even seem to get out of bed. Of crows, he has Sally too, but his relationship with her causes his soul to tear in two as he tries to make the right decisions, while also keeping her safe from public ridicule.Patsy deserves all the credit in the world. She cares for her father whether they’re under the same roof, or far apart. She advises him on matters of family and state, while also keeping their home at Monticello afloat as best she can. With an abusive husband and eleven children of her own, she never loses heart, and does what she can to make sure everyone is seen to and cared for properly.This story is so rich in history, drama, romance, and politics, that it can draw in numerous audiences. There is something for everyone, I assure you. I walked away from these pages having learned infinitely more about my country’s founding, the genius who helped to establish our roots, and the daughter who went above and beyond her patriotic duty and shared the gift of her father with us all. I didn’t want it to end, and now all I want to do is gobble up more novels just like this one!",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sue Baker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 14, 2021",
                "reviewTitle": "A well written story. Excellent read.",
                "reviewText": "This is an easy to engage with story. The writing flows well and you quickly feel like you know the characters. I would recommend this book to anyone who is interested in a good story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonio V.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 14, 2022",
                "reviewTitle": "It was a beautiful read",
                "reviewText": "Beautifully written and engaging, I bought it for my daughter who is particularly passionate about historical fiction. She fell in love with the heroine and read the book in 3 days. Bravo!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 26, 2018",
                "reviewTitle": "I was so sad to finish this book",
                "reviewText": "this is such a different way to learn about US history and one of his presidents. it is beautifully written and so interesting.i tried to read slower towards the end to make it last",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy Davies",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 6, 2018",
                "reviewTitle": "Exceptional",
                "reviewText": "Because of its length I had to put it down and pick it back innumerable times but it is so well written and organised that I never lost the thread. Not for history buffs only - it’s for anyone who loves a good book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Purple Cat 65",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 28, 2016",
                "reviewTitle": "Excellent historical novel.C.A.T Purple Cat!",
                "reviewText": "A well written book with sound historical research that brings alive the people of that particular time in American history thoroughly enjoyable. C.A.Thomas",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}