{
    "remaining_requests": 996,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Paris-Edward-Rutherfurd-audiobook/dp/B00B3Y1CI6",
    "body": {
        "name": "Paris: The Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Paris-Edward-Rutherfurd-audiobook/dp/B00B3Y1CI6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61tmahQ27eL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Edward Rutherfurd",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Edward+Rutherfurd&search-alias=audible"
        },
        "brand": "Edward Rutherfurd&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 7643,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the grand master of the historical novel comes a dazzling, epic portrait of the City of Light.Internationally best-selling author Edward Rutherfurd has enchanted millions of readers with his sweeping, multigenerational dramas that illuminate the great achievements and travails throughout history. In this breathtaking saga of love, war, art, and intrigue, Rutherfurd has set his sights on the most magnificent city in the world: Paris. Moving back and forth in time across centuries, the story unfolds through intimate and vivid tales of self-discovery, divided loyalties, passion, and long-kept secrets of characters both fictional and real, all set against the backdrop of the glorious city - from the building of Notre Dame to the dangerous machinations of Cardinal Richlieu; from the glittering court of Versailles to the violence of the French Revolution and the Paris Commune; from the hedonism of the Belle Époque, the heyday of the impressionists, to the tragedy of the First World War; from the 1920s when the writers of the Lost Generation could be found drinking at Les Deux Magots to the Nazi occupation, the heroic efforts of the French Resistance, and the 1968 student revolt. With his unrivaled blend of impeccable research and narrative verve, Rutherfurd weaves an extraordinary narrative tapestry that captures all the glory of Paris. More richly detailed, more thrilling, and more romantic then anything Rutherfurd has written before, Paris: The Novel wonderfully illuminates hundreds of years in the City of Light and Love and brings the sights, scents, and tastes of Paris to sumptuous life. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Family Saga",
                "link": "https://www.amazon.com/Family-Saga-Genre-Fiction-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10163"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "38 hours and 20 minutes"
            },
            {
                "name": "Author",
                "value": "Edward Rutherfurd"
            },
            {
                "name": "Narrator",
                "value": "Jean Gilpin"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "April 23, 2013"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00B3Y1CI6"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,281 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #190 in Fiction Sagas #648 in Literary Fiction (Audible Books & Originals) #800 in Historical Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lora S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZL7PB4UL47R3E24ENBLOLK6DVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RUW8KUABROEM?ASIN=B00B3Y1CI6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2022",
                "reviewTitle": "5.0 out of 5 stars the story of Paris in the interactions of six families",
                "reviewText": "I was happy to get a chance to review Paris: The Novel in such close proximity to my review of R.F. Dederfield’s Give Us This Day. Both books are large sagas of historical fiction. But they differ significantly as a reflection of the different focus of their respective authors. And I don’t mean just that one is set primarily in France while the other takes place mostly in England.Give Us This Day is primarily the story of one family and their family business, with small side trips into the adventures of a few of the employees of the business. Paris: The Novel, on the other hand, as the name implies, is more generally the story of a place – specifically the city of Paris. This is also a story told primarily by the means of families – six main families in this case, with a few scattered appearances by famous historical people and some not-so-famous.Aside from the large outlines of the history of France, the backbone of the overall plot is based on the rivalry between two families – the de Cygnes, a noble family (as in, by the end of the book they have a title) and the le Sourds, who are decidedly not noble. In fact, you could say that they are anti-noble during large parts of their history.This book differs somewhat from the other books by Edward Rutherford that I have read also in that, unlike Sarum, The Forest, or London, it doesn’t proceed in strictly chronological order. After a few opening scenes to get the city past its Roman and barbarian beginnings, we meet the Widow le Sourd (she is one of two le Sourd Widows, which confused me until I went back and read her part more closely) who is taking her son to the place where his father died. This is sometime in the 1870s. The story she tells her son is of the Paris Commune, which I had thought happened somewhere in the timeline of the French Revolution, but apparently was much later. This appears to have been a period of a few months when Paris became a small communist country. The Widow le Sourd thinks it was wonderful, but then the people who had previously been in charge got their military act together and attacked the city destroying the short-lived Commune. A last group of holdouts, including the Widow’s late husband, were executed against a wall of the Pere Lachaise Cemetery. The officer in charge of the firing squad was a Vicomte le Cygne. The Widow’s son, Jacques, vows he will wipe the de Cygne family off the face of the earth.Years later, he thinks he sees a chance but is thwarted by one of the other characters – a seemingly unrelated interaction. Later still, le Sourd and de Cygne meet up again on a battlefield in World War I, and once again le Sourd is really going to do it. He tells de Cygne that he is, and why. De Cygne agrees but asks him to take a lighter made from a bullet casing by one of his men, which he considers lucky, to his son after his death. Le Sourd walks away without killing him after all.We go back in forth in time, meeting the Blanchard family of merchants and artists and their lives, loves, and intrigues. We also meet the Gascon family – Thomas and Luc. Thomas gets a job working on the Statue of Liberty with M. Eiffel. Later, he works on the famous Eiffel Tower. One day, he has to take off to rescue his little brother, Luc from bullies in his neighborhood.It is impossible to keep up with all the adventures and betrayals that happen in all our families through the years. There are good things and bad. The Jacob family (back some hundreds of years) encountered many of the usual prejudices that plagued most places in Europe during this period and haven’t entirely gone away even yet. The book gives a very good rendition of what happened to this one family when the King took it into his head to expel all the Jews – taking all their assets for himself, of course.All the threads of all the families come together during World War II when most of them become involved in one way or another in the Resistance. Some of the characters are too old by then to do much, but others, despite their age, are right there in the middle of everything. Thomas Gascon, who has been running his own engineering firm since his days on the Eiffel Tower, comes back with some of the less savory characters from his old neighborhood to disable the elevators in the tower so that Hitler can’t go up it when he comes to Paris. But even more intriguing are the goings-on surrounding Luc Gascon, who gets caught trying to play both ends of the spy game as the war is trying to draw to its conclusion.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mimbelina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWBYP2BNMGQJCJZJSH2FZGJ37AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34O8Q8ND7WBFA?ASIN=B00B3Y1CI6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2013",
                "reviewTitle": "4.0 out of 5 stars Travel with me to Paris",
                "reviewText": "From today’s master of epic storytelling comes a novel that captures Paris in all of its contradictory moods: fiery passion and suave calm, loyalty and rebellion, peace and war, hope and despair, light and dark. With his meticulous research and imaginative prose, Rutherford takes the reader on a journey that spans centuries, tying together the histories of several families as they make their impressions on the very heart of Paris. We watch in fascination as Thomas Gascon helps to build the Statue of Liberty and the Eiffel Tower. Our hearts ache with Jacob as he watches his daughter escape with her forbidden lover. We listen with blushing cheeks to the tales that come out of the Moulin Rouge; we laugh along with Marie when she is introduced to the incomparable Ernest Hemingway. And we stand tall with Charlie as he gives his all to protect his beloved city. All that Paris is - all that it is imagined to be - is captured here in these spellbinding pages.In all honesty, I wasn’t sure I was going to enjoy this novel when I first started reading it. I’ve been a fan of Mr. Rutherford’s works for so long that I expect them to grab hold of me from the very beginning and hold me captive until their thrilling end. This novel, however, with its jumping narrative (as opposed to the fluid shift through time that he has employed previously) felt broken and disorienting. My initial reactions to the characters, too, were not as positive as they have been in the past. However, as I went further and further into the novel, I found myself drawn in despite my reservations. By the middle of the book, I was once again a happy captive, anxious to get to the end and hoping for the best for all of my favorite characters. As in life, the resolution did not unfold exactly as I had hoped it would, but it was satisfying nonetheless. Though I would certainly recommend other Rutherford books to first time readers (my favorites are the Ireland and London books), this tome is still one that should not be overlooked - especially by armchair travelers like me!!With his unrivaled blend of impeccable research and narrative verve, Rutherfurd weaves an extraordinary narrative tapestry that captures all the glory of Paris. More richly detailed, more thrilling, and more romantic then anything Rutherfurd has written before, Paris: The Novel wonderfully illuminates hundreds of years in the City of Light and Love and brings the sights, scents, and tastes of Paris to sumptuous life.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZLLQKXV2PSUR3EOQQCIYB2OGXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22K6N0MH96KJ?ASIN=B00B3Y1CI6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars The story is good and the history is also a plus",
                "reviewText": "I have read several of this author's books and I find them interesting. If the buyer doesn't like books several pages, they might not be interested this book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ILyktucher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETZW5BZ57ZXAZPYTQ6VXKNHSKPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BZLVBZNKJHTC?ASIN=B00B3Y1CI6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Book arrived in a very timely manner in EXCELLENT condition. Well-pleased!",
                "reviewText": "The book was in great condition, as was the dust cover. The delivery was timely and I'm very happy with the purchase! Highly recommend seller (and the book!!)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert B. Lamm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOBC3QLEFN4JLHNWC7KHXM5JZ5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R102O5A7L8EU1V?ASIN=B00B3Y1CI6",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2022",
                "reviewTitle": "3.0 out of 5 stars Historical Soap Opera",
                "reviewText": "This is my first Rutherfurd work, but I gather it’s typical of his approach — hundreds of years of history as seen through the experiences of several different families who interact to a greater or lesser degree. I decided to read it because I’m planning a trip to Paris later this year and, while I’ve read lots of books about Paris and have been there several times, I wanted a referesher.I’m not sure I got what I wanted, because the book is as much soap opera as history. I’m not suggesting that the history is wrong - it seems clear that Rutherfurd has done his research well. But it’s as much soap opera as it is history, and sometimes the latter suffers for the sake of the former. The coincidences that tie the various families together are a bit much and strain credibility.Don’t get me wrong - it’s not a horrible book; it’s not a hard read, though it is significantly longer than seems necessary, with some segments seemingly thrown in just to avoid missing an historical period. But when compared to some greater works of historical fiction, it leaves something to be desired.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynn C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 3, 2022",
                "reviewTitle": "I recommend this bookseller",
                "reviewText": "I was pleasantly surprised, my book arrived in very good shape/condition, there was minimal/ slightest wear on the spine (on the edge), but didn't interfere at all with reading legibility.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ma. Dolores Mestre R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 15, 2022",
                "reviewTitle": "Un libro fascinante",
                "reviewText": "Cómo todos los libros de Rutherfurd, esta novela es mágica. Transporta al lector a la Francia de varios siglos, haciendo su lectura imposible de parar. Altamente recomendable!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Norman Clark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 13, 2022",
                "reviewTitle": "Epic novel with real history!",
                "reviewText": "Bought with two other Rutherford books as a Christmas gift to myself last year. Unusual 'time' structure employed which really does work. PLus if you really want to read the true history of the Eiffel Tower this is just one treasure trove of infomration. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "david canford",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 17, 2023",
                "reviewTitle": "One of his best",
                "reviewText": "Some have complained how this novel jumps around between different time periods. Personally, I preferred its structure to his other novels I have read where the author proceeds from (usually) Roman times to the twentieth century (which usually comes across as a rushed afterthought). You’re just getting acquainted with the characters in one century and then he leaps forwards many decade or a century or two. Most of ‘Paris' is about the period from 1885 to 1945 so you get to spend much more time with the characters portrayed in that period than his other novels allow. There are brief returns to earlier times, such as the reign of Louis XIV and the Revolution. A fascinating read if you love or like Paris. I learned so much I didn’t know and the various plots are good too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 18, 2017",
                "reviewTitle": "Great work, as always!",
                "reviewText": "I've been a fan of Edward Rutherfurd's work since \"London\". By the end of the book it feels like the characters are real friends that are going tonbe missed afterwards. I'm looking forward to the next one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}