{
    "remaining_requests": 727,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Countess-Revolution-sweeping-historical-heart-breaking-ebook/dp/B0B52S28TX",
    "body": {
        "name": "The Countess of the Revolution: A sweeping historical fiction novel based on the heart-breaking events of the Revolution",
        "price": "$3.99",
        "originalPrice": "",
        "rawPrice": 3.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Countess-Revolution-sweeping-historical-heart-breaking-ebook/dp/B0B52S28TX",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81mRiBz2rIL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lana Kortchik",
            "link": "https://www.amazon.com/Lana-Kortchik/e/B01AH92FC4/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 153,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "‘Everything I love about historical fiction and more.’ Reader review ⭐⭐⭐⭐⭐March, 1917Petrograd is on the eve of revolution. For Countess Sophia Orlova, the city of her childhood – the only home she has ever known – has become her deadly enemy. The mob are ready to get rid of anyone connected to the old regime, including Sophia.When rebels threaten to shoot Sophia and her husband, they are saved by Nikolai, a fervent supporter of the revolution. Determined to help Nikolai’s cause, Sophia sets up a hospital wing in the house, nursing injured victims by his side.Her kindness has captured Nikolai’s heart, but their burgeoning romance is forbidden. With battle lines drawn between the new and the old, both their lives are in danger…Will their love be strong enough to overcome the horrors of war?From the bestselling author of Sisters of War comes a heart-wrenching novel of lovers trapped on the opposite sides of a terrifying political conflict, loss, and sacrifice.Readers LOVE The Countess of the Revolution!‘This is the best book I’ve read in ages. I absolutely loved it. It is brilliantly researched and very well written.’ Reader review, ⭐⭐⭐⭐⭐‘This book was well written with a captivating storyline and well-developed characters. It was everything I love about historical fiction and more.’ Reader review,⭐⭐⭐⭐⭐‘I absolutely loved this book. The plot, the characters, the writing are so compelling. I really did find this such a page turner and enjoyed it very much. Right up there with the best books I’ve read this year, it is so much more than a love story. Fantastic.’ Reader review,⭐⭐⭐⭐⭐‘This is an excellent read. It pictures what it is like living as a civilian during war so mirrors the conflicts and choices for thousands caught up in a disastrous strife. Thoroughly recommended.’ Reader review,⭐⭐⭐⭐⭐",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B52S28TX"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ HQ Digital (September 15, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 15, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2216 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 371 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#516,966 in Kindle Store (See Top 100 in Kindle Store) #1,201 in 20th Century Historical Romance eBooks #1,202 in Historical World War II Fiction #2,293 in Women's Historical Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 153 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/20ca3ac4-1db8-4ac2-97be-5590ed822c1f.__CR0,0,2021,625_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/783cb4a1-0856-4592-8c0b-d7628980009c.__CR0,0,2021,625_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a08d205-b035-408b-9f9d-b388cd1ae385.__CR0,0,2021,625_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Gerhard Dennis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUU4WB4PEN4GPXBLJJEKLIJSU4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RME0BNKHM00K?ASIN=B0B52S28TX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2022",
                "reviewTitle": "5.0 out of 5 stars Fascinating Historical Fiction",
                "reviewText": "Revolutions (and wars in general) are not as romantic as the victors would have us believe. But amidst all the suffering and death, romantic relationships can take root, as they do in this book. While unflinching in her portrayal of a tumultuous time in history, Ms. Kortchik does not overlook the human element in her account of the travails of Sophia and Nikolai. This is a well-written tale that is both instructive and entertaining, and fans of good historical fiction should enjoy it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sterling Silver Magnolia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7D4LDC7Q25LRQLQZWCCVOJQLPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18OFX812SM5IM?ASIN=B0B52S28TX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "4.0 out of 5 stars Excellent historical romance",
                "reviewText": "Long but worth every page. Historical setting is very accurate in general - gives it more depth. Kept me up late to see what happens next!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa J. Frazee Clark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2MNY2ACTJVBNW553C2J44K2MLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZSA231HHPUP0?ASIN=B0B52S28TX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2023",
                "reviewTitle": "5.0 out of 5 stars amazing",
                "reviewText": "A good story about two brothers on different sides of the revolution. Story about how family comes before politics, brother love and how families can get along first. Looking forward to another book by Lana kortchik.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Whiskey in the Jar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBZBBLJJZC7GJE5DEGCO2MN2VQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14JI7H0RDMKDB?ASIN=B0B52S28TX",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2023",
                "reviewTitle": "3.0 out of 5 stars New Adult Historical Fiction",
                "reviewText": "The sprawling Kazan Cathedral, the symbol of Russia’s victory over Napoleon, of freedom and sacrifice, of bravery and spirit, sported a red revolutionary flag.Count Dmitry Orlov is throwing his Countess Sophia Orlova a lavish twenty-third birthday party but it's March of 1917 in Petrograd and the only people who show up are the Bolsheviks. Arrogance kept Dmitry from leaving the city when Sophia wanted to leave with their friends and now their home is being ransacked and the men surrounding them are calling for their blood. Before Sophia is struck down, a man enters and with his authority he saves them. Nikolai, Dmitry's younger banished brother because of his ideals, is a Bolshevik and manages to keep them alive in the home that isn't their own anymore. However, revolutions are never easy and Russia is not done with her turmoil, as the Bolsheviks, Mensheviks, and Imperial Army all vie for power, Sophia, Dmitry, and Nikolai are all tossed around by the winds of fate and love.Her crime was having everything while they had nothing, having been born into luxury while their whole lives they had struggled to put bread on the table.Told from Sophia's point-of-view, this hit some of the big moments and followed along the broad strokes of the revolution during 1917-18. Sophia was younger and previously very privileged, as the story goes on, reader's get to know Sophia and see that ennui was starting to creep into her life and she wanted to care more about things other than balls and jewels. She had worked as a nurse and helped Russian soldiers coming home injured from World War I, so she has some taste of the outside world. It seemed pretty instant her attraction to Nikolai (there are a lot of “twinkling” eyes in this) and what pulls her to him is his caring and passion for something that seems big and important. Dmitry seems to only care about his cigars and keeping up appearances, so when Nikolai talks about his vision for the new Russia, he seems more interesting and her attraction to her brother-in-law grows. ‘Tsar Nicholas abdicated in favour of his brother, who refused the throne and surrendered the power to the Provisional Government. As of today, there is a new order in Russia.’The danger of the revolution and the forbidden love developing sets the story up for some great emotional dramatics but Nikolai never developed beyond a good-looking guy who writes speeches and while the historical events and people are mentioned and Sophia has to run and sometimes interacts with them, I never completely felt the depth of it all. The story and characters read like New Adult historical fiction to me, not quite delivering the emotional depth for me. Sophia likes that Nikolai cares about something important but it's more from a fangirl pov, she doesn't necessarily agree, disagree, or thinking deeply about it all and Nikolai seems to just travel around saving her at moments and write speeches; we never see what he is doing for the Bolsheviks. The romance between the two was pretty weak for me.The newly established regime saw danger everywhere. And it endeavoured to eliminate this danger at all cost.The story did have Sophia traveling from Petrograd, to Kislovodsk, and then to Tambievskii in the mountains to be with the Cossacks and we get a glimpse of Andrei Shkuro. With the war, we of course get the drama of her trying to hide her feelings for Nikolai from Dmitry and her bestfriend Regina. Regina develops a liking for Nikolai too and is convinced he is going to ask her to marry him. For a long time, the reader isn't sure if Regina is making something up in her own mind or if Sophia's feelings are one-sided. It's around the half-way point that Nikolai makes his feelings known but then he's captured as the Mensheviks are taking power and his fate becomes unknown to Sophia for a while.He was her husband’s brother.The second half has things deteriorating between Sophia and Dmitry and it becomes harder for her to hide her feelings for Nikolai. The last twenty percent hurried along with betrayals, seemingly betrayals, and Sophia finally making a choice. The chaotic and dangerous atmosphere of Russia at this time was felt, all the running from city to city, Nikolai getting arrested and then Dmitry and Sophia getting arrested, the changing regimes in power but the romance between Sophia and Nikolai felt like teenagers in the throes of hormonal first love, which didn't really fit with the real life dangerous times. The epilogue also didn't fit for me as it was from Dmitry's point-of-view and while it gave an update on how things worked out for Sophia, the tone of it didn't work as the story had previously been all from Sophia. This had some interesting moments but the overall mood felt more like, easier, on the surface New Adult historical fiction.I received this book for free, this does not affect my opinion of the book or the content of my review.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Main Street Love",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJBW2YTKLX6BBXUQZNEWIG2VQHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW21V7QC0O2P1?ASIN=B0B52S28TX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2023",
                "reviewTitle": "4.0 out of 5 stars A Compelling Historical Fiction Journey Through Russian Revolutions",
                "reviewText": "In \"The Countess of the Revolution,\" Lana Kortchik delivers a captivating historical fiction that provides readers with a multifaceted view of the intricate and world-altering Russian revolutions of the 20th century. Having previously enjoyed several of Ms. Kortchik's works, I eagerly anticipated her perspective on the 20th-century Russian revolutions. Despite my existing knowledge of Russian history, I found her portrayal brimming with drama, humanity, romance, love, loss, and a profound exploration of patriotism. At the heart of the narrative is Countess Sophia Orlova, a complex and intriguing central character who effectively bridges multiple worlds. Through her transformative experiences, the story unearths the shades of gray that permeate reality, reminding us that the world is seldom confined to stark black-and-white distinctions.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sibyl noack",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPKKW5JKOYYGAUZDPY27YCPNTOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DPY44RCVSD9J?ASIN=B0B52S28TX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2023",
                "reviewTitle": "5.0 out of 5 stars A Novel of War and Love",
                "reviewText": "This novel is set in 1917 during the Russian Revolution. As the Bolsheviks take control, the old elite fight for their lives. The characters are entwined in love and jealousy. Any reader interested in this time will have a difficult time putting this novel down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karla R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJBLO5ZGPGSMHLL3ERFSXBFAKOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SDO52F9RKMK9?ASIN=B0B52S28TX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Intense story of family and love",
                "reviewText": "A captivating and heart breaking story during the Russian Revolution. The author wrote a story that had me on tenterhooks even though I knew what lay ahead historically. What kept me reading was her way of weaving the historical aspects of the Revolution without sounding like a text book and integrating an intense story of family and love.Sophia and Nikolai had a sweet relationship that could only naturally develop into love. Their forbidden love left me heart broken a few times but thankfully there is a HEA... it just takes so much to get there.Overall a well written historical fiction. I highly recommend for fans of the forbidden romance trope and the Russian Revolution.I received an ARC from Netgalley and Harper 360. All thoughts and opinions are my own and offered voluntarily.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denise Teulon Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 16, 2023",
                "reviewTitle": "Great read",
                "reviewText": "Story based on fact.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark McKay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 22, 2022",
                "reviewTitle": "A compelling story",
                "reviewText": "I don't read a lot of historical fiction, but having read Lana's work in the past, I wanted to see how this story unfolded. It's a compelling story, which had me turning the pages to find out what happened to the potentially star crossed lovers. I wasn't disappointed.The story is enhanced by the historical links the author has to the events of 1917 in Russia, and is more poignant for it. It had me wondering how people of all classes coped with those traumatic events, and it kept me involved in what is a story well thought out and well told. If you're a historical fiction fan and you like a bit of romance, this one's for you.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leola Meagher",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 28, 2022",
                "reviewTitle": "This book provides a good view of the damage done by a revolution. So much needless suffering.",
                "reviewText": "The book is well written and the story is fast moving and kept my attention to the very end.I highly recommend this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vasilica Zmeu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 12, 2022",
                "reviewTitle": "Amazing book",
                "reviewText": "The book is so captivating, once I started I could not put it down.The tumultuous time of the revolution is so well described. Through the eyes of Sophia Orlova, you feel the loss of everything that was normal, the uncertainty, the fear, but also the love and the hope for a better future. Sophia transforms during these hard times into a remarkable woman who finds comfort in helping others. The love story provides a respite from all the sadness and misery that the revolution was causing.It was a great read and I highly recommend it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 6, 2023",
                "reviewTitle": "Full of twists and turns",
                "reviewText": "A really good paced story full of twists and turns in the lives and relationships of the main characters. The author manages to show the very difficult times all Russians went through at the time of the revolutions. A good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}