{
    "remaining_requests": 1010,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Spanish-Daughter-Lorena-Hughes/dp/1496736249",
    "body": {
        "name": "The Spanish Daughter: A Gripping Historical Novel Perfect for Book Clubs",
        "price": "$9.02$9.02",
        "originalPrice": "",
        "rawPrice": 9.02,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Spanish-Daughter-Lorena-Hughes/dp/1496736249",
        "soldBy": {
            "sellerID": "AKEDNPGP790V7",
            "name": "Murfbooks",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AKEDNPGP790V7&asin=1496736249&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Sz9ssnZZL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lorena Hughes",
            "link": "https://www.amazon.com/Lorena-Hughes/e/B071NSS7Z5/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ZBK Wholesale",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 6514,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for The Spanish Daughter“A lush Ecuadoran cacao plantation is the setting for this imaginative historical drama filled with sibling rivalry and betrayals. Threaded throughout this dramatic family saga are descriptions of cocoa-making that will leave your mouth watering for chocolate.”—The Washington Post“A sweepingly elegant historical novel.” –Ms. Magazine “Hughes portrays a small cast of characters while providing whodunit suspense and lots of background information on cacao plantations and insights into the way social classes are embodied in the production of chocolate. With an equal mix of historical fiction, dramatic family conflict, and mystery, this tale should please fans of Christina Baker Kline, Lisa Wingate, and Kate Quinn. Beginning with a map and ending with a reader’s group guide, Hughes' tale of secrets, treachery, and chocolate will be appreciated by fiction readers looking for an extra level of engagement.” —Booklist“Passionate and suspenseful, The Spanish Daughter is a satisfying historical mystery set in a lush tropical land.”—Foreword ReviewsSTARRED REVIEW “An engrossing mystery/romance set in early 20th-century Ecuador and Spain… Fans of historicals will appreciate the descriptions of dress, local foods and customs, social stratification, and the cacao industry, a source of an economic boom and bust in early 20th-century Ecuador… As addictive as chocolate, this ends on a modern and satisfying note.” —Publishers Weekly“A lushly written story of bittersweet family secrets and betrayals that ultimately celebrates the healing power of hope, resilience, love—and chocolate!” —Andrea Penrose, author of Murder at the Royal Botanic Gardens “A lyrical and nuanced study of family and belonging. Readers will fall in love with The Spanish Daughter’s unique setting amidst the cacao plantations of Ecuador in 1920, its lush and vivid prose, and compelling and audacious heroine. I’m already looking forward to the sequel.” —Anna Lee Huber, USA Today bestselling author of Murder Most Fair “A deftly written story entangling family, identity, chocolate and murder, set in the lush golden days of Ecuador’s cacao boom in the early twentieth century. Hughes gradually weaves the separate tales of her narrators into a single strong thread, drawing you into the world of three very different sisters united by deception and loss. An exciting debut from this fresh voice!” —Shana Abé, New York Times bestselling author of The Second Mrs. Astor “An atmospheric and captivating mystery set against the backdrop of 1920s Ecuador, The Spanish Daughter is an engrossing, suspenseful family saga filled with unpredictable twists and turns.” —Chanel Cleeton, New York Times bestselling author of Next Year in Havana About the Author Lorena Hughes is the award-winning author of The Spanish Daughter and The Sisters of Alameda Street. Born and raised in Ecuador, she moved to the United States when she was eighteen. Her previous work has won first place at the 2011 Southwest Writers International Contest in the historical fiction category, earned an honorable mention at the 2012 Soul-Making Keats Literary Competition, and placed quarter-finalist in the 2014 Amazon Breakout Novel Award. Named one of 9 Rising Latina Authors You Don’t Want to Miss by HIP LATINA, she’s the coordinator of the UNM Writers Conference. Lorena lives in Albuquerque, New Mexico and can be found online at Lorena-Hughes.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 15 hrs 6 mins",
            "FREE delivery February 29 - March 4 on orders shipped by Amazon over $35",
            "Or fastest delivery February 27 - 29"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“An engrossing, suspenseful family saga filled with unpredictable twists and turns.” —Chanel Cleeton, New York Times bestselling author of Next Year in Havana“With an equal mix of historical fiction, dramatic family conflict, and mystery, this tale should please fans of Christina Baker Kline, Lisa Wingate, and Kate Quinn.” —BooklistThe Washington Post Books to Read Now | Ms. Magazine Reads for the Rest of Us | Bustle Most Anticipated Books | PopSugar Best Books | BiblioLifestyle Most Anticipated Historical Fiction Books | Book Riot Book Recommendations | Finer Things Book Lover Gifts They’ll Actually Love Perfect for fans of Julia Alvarez and Silvia Moreno-Garcia, this exhilarating novel transports you to the lush tropical landscape of 1920s Ecuador, blending family drama, dangerous mystery, and the real-life history of the coastal town known as the “birthplace of cacao.”As a child in Spain, Puri always knew her passion for chocolate was inherited from her father. But it’s not until his death that she learns of something else she’s inherited—a cocoa estate in Vinces, Ecuador, a town nicknamed “París Chiquito.” Eager to claim her birthright and filled with hope for a new life after the devastation of World War I, she and her husband Cristóbal set out across the Atlantic Ocean. But it soon becomes clear someone is angered by Puri’s claim to the estate… When a mercenary sent to murder her aboard the ship accidentally kills Cristóbal instead, Puri dons her husband’s clothes and assumes his identity, hoping to stay safe while she searches for the truth of her father’s legacy in Ecuador. Though freed from the rules that women are expected to follow, Puri confronts other challenges at the estate—newfound siblings, hidden affairs, and her father’s dark secrets. Then there are the dangers awakened by her attraction to an enigmatic man as she tries to learn the identity of an enemy who is still at large, threatening the future she is determined to claim… “A lush Ecuadoran cacao plantation is the setting for this imaginative historical drama filled with sibling rivalry and betrayals. Threaded throughout this dramatic family saga are descriptions of cocoa-making that will leave your mouth watering for chocolate.” – The Washington Post “A sweepingly elegant historical novel.” – Ms. Magazine“A lushly written story of bittersweet family secrets and betrayals.” —Andrea Penrose, author of Murder at the Royal Botanic Gardens “Passionate and suspenseful, The Spanish Daughter is a satisfying historical mystery set in a lush tropical land.” —Foreword Reviews STARRED REVIEW “Engrossing…As addictive as chocolate.” —Publishers Weekly “Richly captivating.” —Woman’s World “A fascinating historical.”—PopSugar Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Kensington (December 28, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 305 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1496736249"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1496736246"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 5 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.85 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,894 in Books (See Top 100 in Books) #45 in Hispanic American Literature & Fiction #3,044 in Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 6,514 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5177a1b2-c784-4611-aa0e-7a68f1e27f1f.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a62ad2c5-b967-4848-8039-0df7e2c18682.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/60a5e686-9bed-45fc-9cca-0922be553097.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2cf823ed-ca06-4b88-8f9d-3832952dd218.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c068fbae-530f-494e-9860-dad427ac1a8d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b49381b1-38cf-4acb-be0b-682efaa68380.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Diane Cox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUULNNYKLBA7UP5SB6XCYIL2QVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2K2PAU7M6B09B?ASIN=1496736249",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars A very interesting read that you can't put down.",
                "reviewText": "The story takes place in Ecuador and the main character Puri wants to find out who is trying to kill her.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JMKJMK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL7WWELN3BNCWSCIUNQHD7SPZJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IR7Z13AK6LN?ASIN=1496736249",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Book pages were stained",
                "reviewText": "A lot of pages in this book were stained. It was still readable but disappointing. The story itself was okay, convoluted and messy but ultimately tied up well. If you enjoy mystery type books, this is a decent choice. A bit slow moving but satisfying at the end.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71aB2yz1oiL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roger Luekens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3HZERGSFFWSMD3SBFHN6UK6NBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12V1U5W2WH7SN?ASIN=1496736249",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2023",
                "reviewTitle": "3.0 out of 5 stars An interesting summer read with an intriguing ending",
                "reviewText": "This is not my favorite book, but it held my interest in the last half of the book. I am not sorry that I read it.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customersandra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGML3EGJSLT26M3NQBANNBJQROJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHC7XKOOYKCSX?ASIN=1496736249",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars a fabulous book. hard to put it down, a number of twists and turns, a beautiful picture of the countries; made me feel as if I was there.",
                "reviewText": "I couldn’t wait to get back to reading it. A book that made me feel as if I was there.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs. Patricia J. Harwood",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSN2T3XD3UAS4EQLKBUWRODPSTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22ZIVO84UFHOM?ASIN=1496736249",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Family Rancour",
                "reviewText": "The Spanish Daughter was interesting in how this daughter wanted so much to have her South American family and still find the slayer of her husband.I rated it four stars because I could no.t believe her long presence of being her husband by wearing artificial beards, wigs and his clothing would deceive anyone for so long.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeni Rae",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPJ25FDGIK46XVFT22FATY2VGKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS4W3KBC675AA?ASIN=1496736249",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "Purchased as a gift. They loved it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen Lawler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP5FHUMTP3K2CIYKTP4KTYIC2PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSYM23VUT1KO5?ASIN=1496736249",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 21, 2022",
                "reviewTitle": "4.0 out of 5 stars Suspense, History and good story",
                "reviewText": "The Spanish Daughter by Lorena Hughes was a very good and interesting book. It is based on Historical events so the details the author brought in were both interesting and great to learn about. It takes place in the 1920's where Maria Purificacion de LaFont-Puri the daughter of a Spanish mother and French father is the main character. The Father, Don Armand has deserted the family to go to Ecuador to start a Cacao farm and becomes very wealthy. The book begins after Puri is married and her mother has died. They are traveling to Ecuador to take over her legacy of the farm after her fathers death. All begins as her husband is murdered on the ship but the killer is meant for Puri. She decides that she is in danger and assumes her husbands identity and tells all that Puri was killed. Upon arriving she finds out her father had remarried and has 2 daughter and a son. The story proceeds as Puri, as her husband tries to find out who wanted her dead. The details of the Cacao farm and of Ecuador are interesting and the story continues with her hunt for who is wanting her gone. Puri was a Choclatier back in Spain and had a little shop that she thrived on making Chocolate and has hopes of continuing in Ecuador and introducing them to chocolate.The characters were interesting and well developed. The story kept my attention and I would recommend it!!",
                "reviewVotes": "49 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Nungesser",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG7QQ7LGKP35MRUSLU4FJDFHO7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LYQCENKA35RW?ASIN=1496736249",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Good read",
                "reviewText": "Book club must!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H. Kotrus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 21, 2022",
                "reviewTitle": "From beginning to end - fascinating",
                "reviewText": "Absolutely kept me fascinated from the first page to the last. The characters are interesting, the plot twisted and turned in just the right amount and places, and the way the history of chocolate was included was a great compliment to this family drama.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 31, 2022",
                "reviewTitle": "Some what interesting",
                "reviewText": "Kept interest through the book but a bit of a boring endingA little far fetched",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marysol Preciado-Bell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 31, 2023",
                "reviewTitle": "A Good Read",
                "reviewText": "I read this book for book club and I really enjoyed it. There were enough twists in the plot to keep it interesting and not too confusing. I would recommend this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jean",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 20, 2022",
                "reviewTitle": "Strong story line",
                "reviewText": "Still to read this book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.02",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            },
            {
                "price": "$9.49",
                "sellerName": "__hopefulness__",
                "sellerRating": "5"
            },
            {
                "price": "$9.49",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}