{
    "remaining_requests": 859,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Under-Gilded-Moon-Joy-Jordan-Lake/dp/1542090032",
    "body": {
        "name": "Under a Gilded Moon: A Novel",
        "price": "$9.16$9.16$7.60$7.60",
        "originalPrice": "$14.95",
        "rawPrice": 9.16,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Under-Gilded-Moon-Joy-Jordan-Lake/dp/1542090032",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "9",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41N4FAb40LS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51mty6Lq0ZL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Joy Jordan-Lake",
            "link": "https://www.amazon.com/Joy-Jordan-Lake/e/B001JS14JI/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Jenson Books Inc and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 15917,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 48 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Lake Union Publishing (December 1, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 413 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1542090032"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1542090032"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 14.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#389,591 in Books (See Top 100 in Books) #4,819 in Historical Mystery #16,780 in Teen & Young Adult Literature & Fiction #28,234 in Women's Literature & Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 15,917 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNMSAY6EJ2S4KAMBIZGJFLSAB6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13ECBP6IUN1O5?ASIN=1542090032",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2020",
                "reviewTitle": "5.0 out of 5 stars Grew up in Asheville and questioned if I would like this book, but it rang very true!!",
                "reviewText": "When I first saw this book, I was skeptical, but I bought it anyway. I was raised in Asheville, and my grandfather was employed by the Biltmore Estate for many years, working in the dairy at first and later delivering milk and other dairy products around the wider Asheville community. My parent's and grandparent's homes were just a short distance away. Biltmore Village was a part of my daily experience from birth. It is a part of so many of my personal memories, as well as those I heard from my grandparents, my mother and my uncle about their memories of the estate as they grew up. The Vanderbilts regularly held holiday gatherings for their staff and the staff members families through the years: I remember hunting Easter eggs there, and seeing the Christmas tress lit, and many such festive occasions. Yes, Mr. Vanderbilt was a product of his wealthy upbringing in many ways, but he was quite rare, as this book portrays, in his early efforts to understand \"the locals\" and certainly rare in his efforts to provide decent jobs, at decent wages, and in his ongoing efforts to see to it that people had decent housing, food, and medical care. This book did not go far enough forward in time to cover Mrs. Vanderbilt: a pity, because her focus on, and promotion of, the weaving skills (and other skills) of the local women that provided wages for many over several generations. I hope to see a subsequent book covering her many contributions to the community. As a child, I had to have each of my baby teeth pulled since the roots did not dissolve. The reward I requested each and every time was stopping at the weaving center created by the Vanderbilts, where for decades large looms were positioned so that visitors to the estate could watch as intricate bedspreads, coverlets, and many other items were woven and offered for sale. Many, many other weavers wove at home, but were able to market their work through the Biltmore Estate and Biltmore Village shops. Houses built for many of the people employed at the estate as it was built and expanded are still standing, and still occupied. Many advancements in modern forestry were promoted there and spread out to other regions of the country. So this book \"rang true\" to what my family had experienced and the stories I heard in my childhood. I was pleased to see a balanced portrayal of how hard it was for people like the Vanderbilts to understand the damage they wrought on the community on the one hand, but also portrays their efforts to understand and assist \"the locals.\" While selling the family farms was extremely difficult, it is also true that in most instances the land had been farmed to death over the generations. That, and the changes in the overall culture of the US meant that change was coming to the area whether it was wanted or not. I do believe that ultimately the good intended by G.W. Vanderbilt at least balanced the damage done by the building of the estate, and in the long run has contributed quite a lot to the development of the Asheville area. This book accurately portrays the times and the feelings of the parties involved, and is both an interesting and informative read. I truly hope there will be a sequel to this book about the later efforts within the community by both George Vanderbilt and his wife Edith.",
                "reviewVotes": "344 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHQMBQSRQ276JWWETGLAOLQ4BHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14YCXAA505JKS?ASIN=1542090032",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "4.0 out of 5 stars Strong ending and strong heroine",
                "reviewText": "I had a hard time getting invested in the book which could have been due to the sheer investment at building the characters, of which there were many. Around the midpoint of the book my curiosity was peaked and I found myself more engaged. I’m glad I stuck it out because the mystery and story were worth the investment! Kerry is a great leading lady and a good representation of the contrast between classes of that time period.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan F",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPQZKTB4WUJTXV6ALKHJDNG2XDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Q7J949T2MOEY?ASIN=1542090032",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 31, 2021",
                "reviewTitle": "3.0 out of 5 stars Potentially good story in need of an editorial overhaul...",
                "reviewText": "I wanted to like this book. And there were parts of it that were very good and I think have great potential. But it was disappointing that it didn’t quite reach the bar for me. I liked the historical background, and the descriptions were good. But the book seemed to struggle with a theme. Was it a love story? A story about white supremacy? A murder mystery? A family redemption story? If a love story it left too much undeveloped. It never really showed anyone falling in love...lust maybe? And why does John Cabot keep flashing a “I love you” sign at Kerry even from the beginning of meeting her? What was that about? (I got the backstory on it being from his mom, but why did he flash it at her all the time?) And the transitions from scene to scene were disjointed and abrupt, and without any rhyme or reason. And confusing as to the passage of time progressing. There was too much telling the motivations of the characters and not enough showing. I also found it unbelievable how much of the time the characters overheard each other, even with large supposed physical distances inside and outside the house. It seemed contrived. And the villains were very one dimensional, and seemed to have absolutely no inner conflict or reasoning skills. As a murder mystery it seemed very unlikely and unbelievable, with only Kerry seeming to have any insight or detective skills, yet also being very unwise in the way she displayed them. Also as family redemption it just didn’t seem to flesh out properly and fully. It seemed to fall short there as well. Perhaps the best aspect was the historical backdrop.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melanie P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGODUGBVMEE6JA2Q2YR7Z7X4IIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12NN8GPU2KAGD?ASIN=1542090032",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful historic literature",
                "reviewText": "A sneaking \"thriller\" with characters to question, love, and think less of set to the background of riches and poverty, cultures, traditions, and change.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jcasciato",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIN2AZT63VTQXUGNYQHRQGRTKDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DQQVAUBBPDWM?ASIN=1542090032",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Historical mystery",
                "reviewText": "Very interesting story set in the Gilded Age in the Blue Ridge Mountains and Asheville area. Combining aspects of the wealthy elite and the local Appalachian people, the tale combines history and mystery with a lot of drama and a little bit of romance. I will have to check out the author's other works.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Pfeiffer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 30, 2021",
                "reviewTitle": "A fictional account of the gilded age at Biltmore, home of George Vanderbilt",
                "reviewText": "Although this wonderful book is a fictional story, some of the characters were real and actually existed in that age. Also, the setting of the book, is in or near Biltmore, the luxurious home of George Vanderbilt, which was being built in 1895-96 the time in which this tale takes place. Even some of the household staff were based on real individuals. Perhaps that is what makes the story seem so real, at least it did to me.The book opens with the arrival of the train and visitors from the North to Asheville, North Carolina, in the Blue Ridge Mountains. The people of Southern Appalachia are mostly poor white farmers with a spattering of black and Asian and when the aristocratic Vanderbilt family decides to buy up the surrounding land to build a mansion and huge estate grounds, the farmers feel they have received an offer they can't refuse. Some of them move on to another part of the State and a few lucky ones get jobs taking care of the estate. The household needs, gardeners, stable grooms, maids, housekeepers and many other workers. Kerry MacGregor is one of those who has come home to take care of her ailing father and one of those few farmers who has not yet sold his land. But farming doesn't pay enough to keep her siblings and other relatives with enough food to keep them from starving. So this woman who was earning a college degree on scholarship, gives up her dream, and becomes a maid at Biltmore for the sake of her family. This plot would have been interesting enough to me, but a murder has taken place and Kerry suspects she knows who did it. So there is the element of mystery included in the day to day struggle of her family.The writing is excellent and the story is well plotted, but the fascination for me was the Biltmore which is the largest private family home in the USA and still in the hands of the Vanderbilt family relatives.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "miss a l sayer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 9, 2020",
                "reviewTitle": "A must read, it will bring you to tears.",
                "reviewText": "One of the most moving books I have read this year. The young boy Finn doesn’t fit into mainstream education, his little quirks and idiosyncrasies annoy his peers. Bullied unmercifully at school his Mum tries hard to protect him, she takes her protection of him to extreme lengths. There are so many wonderful twists and turns in this story that are so relatable. As a teacher, sometimes working with children who have Asperger syndrome and then later, working in community mental health, this story appealed to all aspects of my work. Beautifully written from Finn’s perspective, it gives a rare insight into the mind of a child who struggles with every aspect of every day. A triumph!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Skippy Flink",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 26, 2021",
                "reviewTitle": "Wow! A brilliant story!",
                "reviewText": "I had the pleasure of staying in North Carolina with friends, who live in Old Fort, and we went to see Biltmore House in 2014, to read this book and see in my mind that beautiful house again, with the stone lions at the door, the town of Ashville, brought back so many memories. And those magnificent horses that pull the carriages to take tourists around the beautiful grounds of the Biltmore estate. A brilliantly written story, and kept me guessing right up until the end. I could thoroughly recommend this book to anyone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Franniez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 12, 2023",
                "reviewTitle": "Not what I expected",
                "reviewText": "Engaged and curious as to what was going to happen next, kept me reading this novel. It had an edginess to it that kept me from guessing the outcomes and yet I felt that some of the characters had no purpose. All in all, I still enjoyed it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julie Young",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 20, 2023",
                "reviewTitle": "Good book",
                "reviewText": "Good book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}