{
    "remaining_requests": 979,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Last-Days-Night-Novel/dp/0812988922",
    "body": {
        "name": "The Last Days of Night: A Novel",
        "price": "$11.22$11.22",
        "originalPrice": "",
        "rawPrice": 11.22,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Last-Days-Night-Novel/dp/0812988922",
        "soldBy": {
            "sellerID": "A1ZWVJTZO5RWFA",
            "name": "ZBK Wholesale",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1ZWVJTZO5RWFA&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91OTkGBeayL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Graham Moore",
            "link": "https://www.amazon.com/Graham-Moore/e/B003DAV0U8/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ZBK Wholesale",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 10021,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 15 hrs 3 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 15 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Random House Trade Paperbacks; Reprint edition (May 23, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0812988922"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0812988925"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.1 x 0.8 x 7.9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#68,373 in Books (See Top 100 in Books) #992 in Historical Thrillers (Books) #1,387 in Political Thrillers (Books) #5,782 in American Literature (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 10,021 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Thomas M. Loarie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6RQJ4WEU4OVFUFZNCQYLKRJ22Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IAOL8OB22ODM?ASIN=0812988922",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2017",
                "reviewTitle": "5.0 out of 5 stars Edison vs Westinghouse: A Story of Invention, Technology, Business, the Practice of Law & Entrepreneurship",
                "reviewText": "Those who follow my reviews know that it is rare for me to review fiction. It takes a very special story for me to engage in fiction. “The Last Days of Night” by best-selling author Graham Moore is such a story. As a work of “historical fiction,” it will appeal to history buffs, those interested in invention, technology, business, the practice of law and entrepreneurship.Set in New York City and Pittsburgh in the late 1800s, “The Last Days of Night” centers on the invention of the light bulb, the war over the adoption of A/C current, the largest ever patent-lawsuit (Edison vs Westinghouse) and the creation of today’s global giant General Electric.The author states, “the bulk of the events depicted in the book did happen and every major character did exist.” But adds that nothing (in the book) should be understood as verifiable fact. This book is a “Gordian knot of verifiable truth, educated supposition, dramatic rendering and total guesswork.”It follows the ground-breaking “non-fiction fiction” art form pioneered in 1966 by Truman Capote’s award winning “In Cold Blood”.The main characters include Thomas Edison, George Westinghouse, Nikola Tesla, J.P. Morgan, Agnes Huntington and Paul Cravath.Cravath, the protagonist, is a 26 year old attorney only 19 months out of law school. The story begins with Cravath being hired by Westinghouse to prosecute a patent-related lawsuit against Edison to prevent him from having a monopoly on “light”. The central Issue at the heart of the legal squabble was “who invented the light bulb?”The first electric lamps a century earlier and by 1878, arc-lighting systems and electrical “candles” were being sold to cities and towns throughout the US, but the quality of light was bad. Gas lights remained as they were far safer and more beautiful. The market for a better bulb was immense and not crowded. Much was at stake for both the winner and the loser.Nikola Tesla, an inveterate inventor, plays a central role in the book as the inventor of A/C. We learn that Tesla, thought to be eccentric by all who knew him, was possibly a schizophrenic. Agnes Huntingon serves as Tesla’s patron and as a romantic interest for Cravath.Edison’s lawyers claimed his patent covered all designs of all light bulbs. It was up to Cravath to show that Edison patented a specific lightbulb, not the entire idea of the lightbulb. Tesla, who worked at one time for Edison was hired by Westinghouse to beat Edison by having him make a better light bulb. Tesla’s genius and Westinghouse’s need to win motivated Tesla to invent alternating (A/C) current and a new bulb that would operate on A/C.The war over the ownership rights to the light bulb then grew to become the war of current (A/C vs direct current) and the commercial beginnings of electricity generation and distribution.At the end, there is a secret coup within Edison General Electric which was backed by J.P. Morgan to depose Edison. The Edison General Electric was renamed General Electric and became the global manufacturer of the electric bulb based on Tesla’s idea. Westinghouse became the manufacturer of Tesla’s electric-power generation system. Tesla, on Westinghouse’s request, signed away his royalties. He would die penniless in 1943.The Edison versus Westinghouse became an undead lawsuit. It lived on beyond the time litigants cared about its result. Edison’s patent was eventually upheld in the court but it was soon to expire.Cravath went on to create what has been known as one of the premier U.S. law firms, Cravath Swain and Moore, for nearly two centuries. He developed a pyramidal structure, the “Cravath System”, to handle the light-bulb suit. It proved useful in other cases as well. Each suit was overseen by a partner at the firm, below which a team of associates handled the daily drudgery of legal work. The associates ascended through a hierarchy of their own. They became partners themselves based on the length of time they had been with the firm. This system rivaled Westinghouse’s factories for efficiency of production. Cravath turned the practice of law from a craft into an industry.Edison, Westinghouse and Tesla, who in their own ways, changed the world: they did what they loved; “for Edison who loved the audience it was the performance. Westinghouse was different as he loved the products themselves and he made them better than anyone else. Westinghouse did not want to sell the most but wanted to make the best. Tesla, the third leg, only cared for the ideas themselves. Once he had an idea, he was done, he knew he had solved the problem and moved on.” Only together could these three have birthed the system that is now the bone and sinew of these United StatesAuthor Moore previously won an Academy Award for the screenplay to “The Imitation Game” which told the story of mathematical genius Alan Turing. He is now working on a screenplay for “The Last Days of Night.”As an engineer and an entrepreneur who has been involved at various levels in the commercialization of over thirty inventions, I found “The Last Days of Night” to be one of those great “hard to put down” books.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. K. Tenny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH7XZSSAXXCDY3P6TLHJSVUZ7GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E49NPPVZJ2Q1?ASIN=0812988922",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "4.0 out of 5 stars interesting",
                "reviewText": "I have never given much thought to the race to discover the electric light bulb and the race light up America. It was an interesting book. Though the book is a work of fiction as is the main character. Never the less, in spite of myself enjoyed reading about more real inventors than I would I guess were involved int that race. In this computer age with the good and bad of AI looking us in the face, this was an interesting look back that included some mystery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert P Gelms",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHWGKPST5YZ6CWYDAQP23ENKB2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CHX2EZ2AMDUM?ASIN=0812988922",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 14, 2018",
                "reviewTitle": "5.0 out of 5 stars Wow, Wowser, Wowsest.",
                "reviewText": "God Said, “Let There Be light.” Thomas Edison Said, “Not Yet.”By Bob Gelms Graham Moore is an exceptionally good writer who makes himself increasingly significant every time he touches a keyboard. In my view, he has already turned himself into a writer who must be read. I’ll now read anything he writes. Mr. Moore has won an Academy Award for the screenplay he wrote for the motion picture The Imitation Game. It also won him a Writers Guild of American Award from his peers and was nominated for a Golden Globe. Flush with success, he quickly published his first novel, The Sherlockian. It raced up the charts into best-seller-land and I wrote about it in the last issue of 365ink. Tempus Fugit and along comes his second novel, The Last Days of Night. It, too, is a best seller but a bigger one at that and one of the best examples of historical fiction that comes to mind. If you’ll pardon a colloquialism, it’s a humdinger squared. The events that take place in the book are all true. The major characters and a few of the minor ones are all real people. I found it incessantly fascinating. You will read about the relationships between George Westinghouse, Nicola Tesla, Thomas Edison, Westinghouse’s lawyer, Paul Cravath, an appearance by J. P. Morgan, and a whole congregation of New York socialites, mega-wealthy business men and politicians. Most of these relationships became poisonously deadly. At issue first was the light bulb. Thomas Edison conned the public into believing that he had invented the little glass miracle that glowed in the dark. He didn’t. Men by the names of Sawyer, Man, and Joseph Swan did the real inventing and held the patents. Edison “borrowed” their work which gave him a massive leg-up. Edison improved the design just enough for the Patent Office to issue him a patent. Then George Westinghouse did to Edison what Edison did to Sawyer, Man, and Swan. He made a better light bulb, but in Westinghouse’s case he did make a better bulb…much, much better in almost every way. Edison promptly sued Westinghouse for one billion dollars with a “B.” While this was going on, there was a life and death struggle to see which form of electricity would wind up in use all over the world in people’s houses and businesses. Would it be Edison’s DC (direct current) which was massively inefficient, outrageously expensive, and horrifically dangerous? Or would it be Tesla’s and Westinghouse’s AC (alternating current) which was efficient, inexpensive, and safe? It was a war. Read and learn. Nicola Tesla was a bona fide, 5 star, golden genius, the kind of genius that would be mentioned in the same sentence with Sir Isaac Newton and Leonardo da Vinci. He was also psychotic in the clinical sense. He described getting his ideas fully formed from dreams or hallucinations that were vivid, lasted days, and were sometimes scary. He, eventually, had a total nervous breakdown. Tesla should have been born at the end of the 21st century. He was that far ahead of the times. In the 1890s, he described in detail television, cell phones, radio and wireless communication. When Gugliemo Marconi “invented” radio using 17 of Tesla’s patents, the court case that ensued went all the way to the SCOTUS. Six months after Tesla died a penniless vagrant in a flop house in New York, the SCOTUS vacated Marconi’s claim of inventing radio and gave the invention’s ownership to Tesla because of Marconi's patent infringement. Nicola Tesla invented radio not Marconi. Tesla worked for both Edison (which ended incredibly badly) and Westinghouse (which also ended badly). Tesla was not a businessman and being thrown into the proverbial tank with sharks like Morgan, Edison and Westinghouse, poor Nicola Tesla was torn apart and eaten alive. Westinghouse, Edison, J. P. Morgan, and Paul Cravath who was Westinghouse’s wunderkind attorney, managed to resist killing each other despite the fact that they all had serious thoughts of doing so. They came together in a genius settlement that Mr. Cravath, who was 27 years old at the time, devised. That didn’t stop a massively hostile takeover attempt by one or more of the lads of one or more of the existing companies. The Edison General Electric Company, in what was nothing more than a malicious act of payback by someone who had the power to do it, removed Edison’s name from the company and that, dear reader, is how we got General Electric. Graham Moore’s The Last Days of Night is a grand slam home run. It’s wonderfully written, plotted and spellbinding. It is endlessly entertaining. I give it 8 stars out of a possible 5. You will not be disappointed.",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rose Vines",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4XOSVNFC2ZTVNHNXP6LNKU37RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NQG3JKSFAHUM?ASIN=0812988922",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Rivetting",
                "reviewText": "I initially picked up The Last Days of Night because of the account it contains of William Kemmler’s execution. My day job is working to end capital punishment, and I had been researching the history of the electric chair.Kemmler’s story is only a tiny part of the book, which is a fascinating story of the early electrification of the country. Moore focuses on the people who drove this revolution, idiosyncratic characters who would not be out of place in fiction.Beautifully written and very easy to read. I highly recommend it, especially to fans of Erik Larson.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Al Phillips",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2022",
                "reviewTitle": "Truth is always stranger than fiction.",
                "reviewText": "Graham Moore paints an entirely plausible story line about four non-fictional characters representing good and evil in this world. Historical fictions are my favourite books and this is the first I've read of Moores. I will definitely read more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hm",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 2, 2019",
                "reviewTitle": "new york fan",
                "reviewText": "eine erste reise nach new york? nicht ohne dieses buch!! lässt sich dort ( aber auch anderswo) sehr gut lesen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Graeme Blanch ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 22, 2019",
                "reviewTitle": "Fabulous read",
                "reviewText": "Loved the story and loved Graham’s use of language.Also loved his clarification at the end explaining which parts of the story was fiction, and which parts he fabricated.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 6, 2017",
                "reviewTitle": "Shame it was fictionalised",
                "reviewText": "This is a fascinating story but personally I would have preferred it to have been written as history rather than a novel. I know that the author, at the end of the book, clearly spells out what is true and what isn't, but even so.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "fionna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 8, 2017",
                "reviewTitle": "An entrancing 'factionary' based on the legal fight over the light bulb.",
                "reviewText": "This beautifully crafted book tells the tale of the fight to spread the use of electricity through the story of a young lawyer briefed by Westinghouse in the patent struggle over the lightbulb with Edison. The main character come to life brilliantly and I found myself repeatedly turning to Google searches to find out more about them. I also ended up wondering what Westinghouse, Edison and Tesla would be thinking now if they saw the world lit up by the world...and the evidence of global warming. They'd surely be at the cutting edge of alternative 'green' energy.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.66",
                "sellerName": "Murfbooks",
                "sellerRating": "5"
            }
        ]
    }
}