{
    "remaining_requests": 734,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/War-Orphan-unputdownable-heart-wrenching-historical-ebook/dp/B0CKZHL322",
    "body": {
        "name": "The War Orphan: An unputdownable and heart-wrenching WW2 historical fiction novel (Women of War)",
        "price": "$3.99",
        "originalPrice": "",
        "rawPrice": 3.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/War-Orphan-unputdownable-heart-wrenching-historical-ebook/dp/B0CKZHL322",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81n95zDXk5L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Anna Stuart",
            "link": "https://www.amazon.com/Anna-Stuart/e/B07Z55CWD8/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "",
        "customerReviewCount": 0,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "1945, Auschwitz: I stumble out of the gates, tightly grasping the hands of two smaller children. Hunger swirls in my stomach and the barren landscape swims before my eyes. I can barely believe it. We’re free. We survived. But what happens now…Sixteen-year-old Tasha Ancel turns to take one last look at the imposing place that stole her freedom and her childhood. She has no idea how she continued to live when so many others did not. For the first time in months, her heart beats with hope for her future and that of the smaller children who cling to her now.Tasha was torn from her mother’s arms by an SS guard days before the gates of Auschwitz opened. Now she only has a lock of her mother’s fiery hair. Desperate to be reunited, Tasha asks everyone she meets if they’ve seen a woman with flame-red hair. But with so many people trying to locate their loved ones in the chaotic aftermath of war finding her feels like an impossible task.Officially an orphan, Tasha is given the chance to start a new life in the Lake District in England. She knows her mother would want her to take the opportunity but she can’t bear the thought of leaving Poland without her.Tasha must make a heartbreaking decision: will she stay in war-ravaged Europe and cling on to the hope that the person she loves most in the world is alive, or take a long journey across the sea towards an uncertain future?An absolutely unputdownable and heart-wrenching WW2 story of survival against all odds and learning to live and love again. Fans of The Tattooist of Auschwitz, Orphan Train and The Nightingale will be gripped.What readers are saying about Anna Stuart:‘BLEW me away… I was in absolute AWE reading this… I could picture everything… SPEECHLESS… It brought tears to my eyes.’ @thatbookishvixen, ⭐⭐⭐⭐⭐‘Absolutely heart-wrenching… I raced through this book… Grabbed me from the first paragraph and didn’t let go until the last line of the fabulous ending. Anna Stuart is fast becoming my favourite WW2 author. A cracker of a story.’ Goodreads reviewer,⭐⭐⭐⭐⭐‘Shattered my heart… I was in tears… So powerful you feel as if you are there… incredibly moving… Absolutely brilliant… this gut-wrenching journey will hit your heart… I highly recommend.’ Cindy L. Spear,⭐⭐⭐⭐⭐‘This book is everything! It deserves every one of its five stars and more!…I can’t recommend this book highly enough, the writing and the storyline are exquisite.’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘I couldn't put it down… a heart-wrenching and emotional journey that will leave you in tears… My heart broke multiple times throughout the story… powerful… gripping historical fiction novel that will tug at your heartstrings.’ NetGalley reviewer, ⭐⭐⭐⭐⭐‘Reading this book absolutely broke my heart… A haunting story that will stay with me long after I've turned the last page… heartbreaking historical fiction… Gripping and emotional… a must-read.’ Vegan Book Blogger, ⭐⭐⭐⭐⭐‘From start to finish, this book had me captured… Heart-wrenching… An emotional rollercoaster… I think I went through every emotion as I read this story. What a page-turner!’ @celticcaston,⭐⭐⭐⭐⭐‘Utterly brilliant, emotionally charged… this truly is one of the best books I've ever read.’ Goodreads reviewer,⭐⭐⭐⭐⭐ Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CKZHL322"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bookouture (March 7, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ March 7, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1962 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 415 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,699 in Kindle Store (See Top 100 in Kindle Store) #233 in Historical Literary Fiction #337 in Women's Historical Fiction #359 in 20th Century Historical Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}