{
    "remaining_requests": 730,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Target-Switzerland-Muller-Political-Intrigue-ebook/dp/B08D9XMCTD",
    "body": {
        "name": "Target Switzerland: A Paul Muller Novel of Political Intrigue (Wages of Appeasement Book 3)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Target-Switzerland-Muller-Political-Intrigue-ebook/dp/B08D9XMCTD",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81f+52cG-AL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "William N. Walker",
            "link": "https://www.amazon.com/William-N-Walker/e/B072Q3CY1B/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 614,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Inspired by actual events - Target Switzerland is a gripping historical novelThe year is 1939 and Europe is hurtling toward war. Paul Muller is an intelligence agent trying to fend off threats from Germany, but also from Britain and France. Secret agreements reveal unexpected danger and new menacing entanglements as Switzerland becomes a target in the impending conflict. Target Switzerland is another plunge into the cauldron of pre-war Europe by the author, who once again delivers a richly atmospheric narrative transporting the reader into that fraught era. Muller uncovers plots and schemes to gain advantage by ruse and ploy—and violence. A compelling story of intrigue and deception as parties plot and scheme to defeat one another. The novel draws on a little-known historical fact in fashioning a taut and absorbing storyline. Diplomatic deception leads to high stakes disputes and risky encounters as Muller confronts deadly spies, negotiates with corrupt arms dealers and unravels subversive financial transactions. The atmosphere of doubt and fear will resonate with readers watching the characters confront dangerous choices, unwitting actors on a path to war. Smoky meetings, shady deals and political betrayal provide the background for an intense narrative. Readers of Danzig and A Spy in Vienna will recognize the deft pen and sophisticated narrative of the new master of the interwar novelHigh praise from early reviews of Target Switzerland:“William Walker has become the new master of the interwar novel, capturing the intensity and drama of the unfolding spectacle of a world spinning toward war. He continues to deliver sophisticated insight into an epoch of uncertainty and fear, bringing history to life in his realistic portrayal of men and women confronting life and death choices.” Trace Evidence Press.“A gripping, fast-paced novel of historical fiction that captures the atmosphere of fear and uncertainty as Muller seeks to navigate forces jockeying for position in the unfolding crisis. Arms trafficking, financial manipulation and casual resort to violence offer the framework for this richly detailed and highly entertaining novel.” Bookmarks Switzerland was a target for all the belligerents. Paul Muller is the agent charged with keeping them at bay.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B08D9XMCTD"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 30, 2020"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1927 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 357 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#227,867 in Kindle Store (See Top 100 in Kindle Store) #1,077 in Military Historical Fiction #1,643 in War Fiction (Kindle Store) #2,973 in War Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 614 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Thomas B. Lanigan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNYVIIJSLVGE4EK6W7OSMMVAA3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IZ3HAWMCZZEH?ASIN=B08D9XMCTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars great series",
                "reviewText": "Very interesting books on diplomacy and intrigue. Reads quickly but covers many important historical aspects of Switzerland’s neutrality” during the war.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Shulman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5LQHLWVMVEQ44DJRVZ4CR7AOOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REQ0AW9Q1J2UD?ASIN=B08D9XMCTD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2021",
                "reviewTitle": "4.0 out of 5 stars Economic Warfare",
                "reviewText": "This is William Walker’s third novel featuring Paul Muller his diplomat/spy protagonist. I reviewed his first novel “Danzig” a few years ago and have yet to read his second. Our characters come on the scene in late 1938 where neutral Switzerland is caught in a vice between England/France on one side and Nazi Germany on the other. England is threatening to engage in economic warfare against Germany, a war in which the Swiss economy would be collateral damage.The Brits seek out Muller to get information on the German economy. Muller is set up as a lure to find out what the Brits are up to. With the aid of Hilde Magendanz, an economist buried in the bowels of the Swiss National Bank he hits paydirt. Hilde initially comes off as a “mousey woman” in dingy office actually is not only brilliant but rather glamourous in high diplomatic settings. It is no brainer to figure out that there would soon be a romantic attachment between her and Muller.Hilde discovers that the German economy is teetering under the weight of armament expenditures that is rapidly draining Germany’s foreign exchange reserves. Hjalmar Schact the Reichsbank president urges Hitler to cut back his armament buildup which Hitler accedes to in part, but in the end, Schacht is fired. Simply put Hitler had no choice but to go to war sooner rather than later.We find out that the Swiss are fearful that Germany was planning an end run around the Maginot Line through Switzerland. Though neutral Switzerland entered in a secret defense pact with France who would come to its aid should Germany invade, something I did not know.There is much more in the book and it makes for a good read. Walker makes at least one mistake when he attributes the phrase “arsenal of democracy” in 1939, when in fact Roosevelt doesn’t utter it until December 1940.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Bothwell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6CBVDFNBWFQX5I72UJSNPNR6BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WYVMNNNH42QU?ASIN=B08D9XMCTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2020",
                "reviewTitle": "5.0 out of 5 stars Unique approach to international intrigue",
                "reviewText": "The literature of international intrigue is simultaneously very broad and very shallow. Espionage abounds in all directions, of course. The characters may occupy lofty positions, or function as harassed and cynical grunts at the bottom. They may practise economic warfare, blowing up munitions trains or heavy water plants. But very seldom do they do the sums, the accounts, that ofrm a large part of the sinews of power. That perspective is what informs William N. Walker's (the N is important because there is at least one other William Walker in the international relations business) trilogy of novels on the adventures of a young Swiss on the fringes of Nazidom just before the Second World War. Paul Muller, the scion of a Swiss banking firm, applies his talents in Vienna in an attempt to save Austria's gold reserves from the Nazis, in Danzig (Gdansk today) to try to hold off the Nazis in the League of Nations free city of Danzing, the Hong Kong of that day. In this last book, Target Switzerland, Muller returns to his home turf and once again confronts the expansion of Nazi power. The reader will learn a lot about how Hitler managed the German economy -- and what that economy was. Walker has a lot of explaining to do, but the explanation is accurate, and it is not dull. Most i9mportantly, it does not interfere with the character of Muller, very Swiss, and the galaxy of character he meets. The Brits are full of mindless derring-do, the French are oblivious, the Germans and their Swiss dupes are sinister, and there is a love interest who turns out to be more interesting and to my mind more talented than her lover, Muller. This is an unusual book, or books, but it's one of those books that educates as well as entertains. Highly recommended.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RAA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2YUCC5ECZEOV36DTMQDJGCJ7QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UMCMPGVO6ZZI?ASIN=B08D9XMCTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars The excitement of history is so well illustrated by the author in his series of stories on Europe in",
                "reviewText": ". His style created a fast paced novel that I normally have to read through thru the night. However, with the extent of factual history, I'm continually checking the maps and other references for further information. Great entertainment and education!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLJONBJIROTAO3LE4VGN3BPJC6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QCOB8K8SF3FR?ASIN=B08D9XMCTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazon customer",
                "reviewText": "I do enjoy reading your Paul Muller series. Interesting read and helpful insights you created in your summary of events that pertained to the novel. However I think you could dig a little deeper in how the Swiss could maintain their neutrality when all of Europe was under siege including neutral nations.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David S. Ross",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYZ7QCWM4IDIDHGVY4VAVKZGT7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R229JX92IBYAMG?ASIN=B08D9XMCTD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2021",
                "reviewTitle": "4.0 out of 5 stars Interesting historical novel",
                "reviewText": "The lead-up to the Second World War as experienced by a young member of the Swiss ministry. Describing the precarious position Switzerland found itself between Nazi Germany, the UK and France, as the Swiss try to maintain their neutrality in the face of threats to their economic life.The novel starts off with an historical event previously unknown to me: the capture of secret plan between the French and Swiss militaries to oppose a German invasion of France across the Gempen Plateau, near Basel. This true event plays in the background during the main events of the novel, which occur in 1939.The writing is good and well-paced, and I look forward to reading other books in the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mountaineer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA2HOUKRVQ3QYFUHM6SSUYCC5CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36NCBGKSE2BXC?ASIN=B08D9XMCTD",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2022",
                "reviewTitle": "3.0 out of 5 stars Lacks looked-for tension.",
                "reviewText": "Based on historical events. Interesting, but lacks atmospheric tension. Needs better editorial work....misspellings of German words abound. Author's experiences help with plot but cannot, do not compare with works by Furst, Harris , or Downing. Average for this genre.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 16, 2022",
                "reviewTitle": "Brilliant, informative, thoughtful and thought-provoking.",
                "reviewText": "A moving and informative account of neutrality and sovereignty in Europe on the brink of war. Paul Muller works for Swiss Military Intelligence, and has to prepare for possible German attack. Difficult to distinguish fact from fiction; strong characters; and a powerful sense of place.This is one of four books, all based on a Europe on the brink of war.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stanly W. Conner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 25, 2021",
                "reviewTitle": "Pre-World War II Political/ Intelligence Novel",
                "reviewText": "This is the third novel in the Paul Muller series. All three novels are historical fiction written from the perspective of a Swiss national which, in itself, is unusual. The author has done a splendid job in marrying historical fact with political/intelligence fiction. His \"Author's Afterword\" on this latest occasion goes on a bit long, but that is a very minor criticism in relation to the overall strength of the story. I look forward to a continuation of Paul Muller's exploits in the next book \"If War Should Come\".",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tony Goode",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 2, 2021",
                "reviewTitle": "A must read.",
                "reviewText": "A gripping novel about the impact of the machinations of the great powers in the run-up to the Second World War on Switzerland. Can't wait for the next installment.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}