{
    "remaining_requests": 759,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Unfinished-Gift-Homefront-Novel-Book-ebook/dp/B07Z1C9J4G",
    "body": {
        "name": "The Unfinished Gift (A Homefront Novel Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Unfinished-Gift-Homefront-Novel-Book-ebook/dp/B07Z1C9J4G",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91vYUv0cm9L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Dan Walsh",
            "link": "https://www.amazon.com/Dan-Walsh/e/B0024JAOZ6/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2795,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "— Double Carol Award-winner (Best Debut Novel, Best Historical Fiction) —Patrick Collins has three items on his Christmas list. He wants the army to find his father. He wants to leave his grandfather’s house. And he wants--very badly--the wooden soldier tucked away in his grandfather’s attic. Set at Christmastime in 1943, The Unfinished Gift is an engaging family story that reminds us of the surprising things that can affect powerful change in our hearts–-like a young boy’s desperate prayers, a shoebox full of love letters, even a dusty, long-forgotten wooden soldier. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158280011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07Z1C9J4G"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bainbridge Press; 2nd edition (October 30, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 30, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2249 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 264 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1734141719"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#57,895 in Kindle Store (See Top 100 in Kindle Store) #176 in Christian Historical Fiction (Kindle Store) #209 in Religious Historical Fiction (Kindle Store) #227 in Christian Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 2,795 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nancy Condie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2XQO4DZGVFX2UZYWBCMRS5YL4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LEOEEU0V7B27?ASIN=B07Z1C9J4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Original and heartwarming",
                "reviewText": "After the first Dan Walsh book I read, I liked it so much that I have purchased almost all of his books. This story really captured my interest from the first and held it till the last, and I couldn't wait to read the next book. It has an engaging plot that can be suspenseful yet still heart warming. The story was very engaging and as I began to guess where the story was going my interest was more intense. What an original story, and an original ending! I've read several of his books now and really appreciate the fact that they are clean enough that I am comfortable reading them, and I'd be willing to recommend them to my children and grandchildren. I love that the main characters have Christian values, and believe in miracles, and prayers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kmcgraw",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF24CFGGLDAUL56VI7ZXU3BTSJ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38ZIV3BFW3H1L?ASIN=B07Z1C9J4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Life changing work",
                "reviewText": "I wish I just could say how wonderful Dan Walsh's stories are, and of course they are. But they are so much more! The Lord used this story to show me how selfish and self centered I have been. Thank you Dan, God has used this book to bring me to an important crossroads in my life.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5HPD7FAPXY5LMAWJETYJPQDI4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R54MA98XPTCNT?ASIN=B07Z1C9J4G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "4.0 out of 5 stars A Novel, but yet...",
                "reviewText": "This novel is a page-turning read on it's own but with many subliminal threads on gender, employment, children's rights, bitterness and forgiveness, the value of life, racial attitudes, family strife, security, personal warmth and empathy. And yet, it's an easy comfortable read - you don't feel you're being preached at on racial values for instance, the story is the issue and the issue is part of the story! Just read it as a time-passer, if you will, but don't be surprised if you find yourself remembering and dwelling on it subsequently!!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBIFFLTHNMZEBOEMDN7XKHL6AIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MKOTJBL4GLW2?ASIN=B07Z1C9J4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Couldn't stop reading!",
                "reviewText": "This book almost killed me! There was so much heartache in the beginning I almost gave up. I'm glad I didn't because the ending was so much better because of the contrast. I will definitely get the sequel.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "authorlady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDUD6FDZW2KX44N5ER3QE3DAGTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X4IRUG9E028F?ASIN=B07Z1C9J4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2013",
                "reviewTitle": "5.0 out of 5 stars A Wonderful Author, Dan Walsh",
                "reviewText": "When I started The Unfinished Gift I knew I would not stop until I reached the end. It came in the mail at about noon and I finished it at 10:30 that night.It was about a family at odds with each other. The father, Ian Collins, had disowned his son, Shawn, because he married a girl he didn't want him to marry. Shawn was in the army and it was December, 1943, Shawn's little seven year old boy, Patrick, was riding in the car with his mother when she was killed. So Patrick was taken to his grandfather's house, to a man who was not very nice to him. Ian had not spoken to his son since before Patrick was born and had never met Patrick. He called him \"the boy\" most of the way through the book because he could come to accept him as a real person. Ian did not want to come to terms with his feelings. He was mad and he wanted to stay that way. He ignored Patrick, yelled at him, and made him feel more alone.The lady from child services, Katherine Townsend, tried to locate Shawn to tell him of his wife's death, and tried to protect Patrick from his grandfather. Meanwhile, Shawn was shot down over Germany while flying a plane and reported \"missing in action.\"When Ian got the telegram about his son, he began to think back, and his heart began to soften. Patrick steals the show in this book.The Unfinished Gift was a wooden soldier Patrick found in the attic. You'll have to read the book to see how this worked into the melting of his grandfather's heart. It's a wonderful story. This book was full of adventure from the first word.The story continues in the sequel, The Homecoming, when Shawn returns home from the Army. This book contains a lot of history of the war, stories about bombing missions during World War II, stories about people and their hearts.Shawn came home a hero. The story of his mission where he saved most of the members of his crew and got them home without being captured made world-wide news. Ian is impressed with this, so his heart begins to soften. He begins to realize how foolish he has been for the past eight years.Shawn is still in the Army and is sent back, but with a different job. Still, however, he has to leave Patrick, so he hires Katherine to be his nanny; to get him to school, to see to his needs, and to help Patrick's grandfather.I enjoyed both these books. I'm glad I read them both because it helped me see how a family at odds could come together again, and how God worked in people who didn't know Him to cause them to believe in Him.Of course there is a happy ending. I'll let you guess what it is. Or better yet, order these two books and read them for yourself. I can guarantee you won't want to put them down.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandustin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5MS3MUKBP6M5R4M5ZRTO2DE2FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCQ8MFM5RR4OO?ASIN=B07Z1C9J4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Sweet story",
                "reviewText": "It's midway through WWII. A bitter old man, his estranged son away at war, the son's wife suddenly killed in an auto accident and a 7 y/o boy with no place to go. Dan weaves an amazing story of God's love and how it changes lives.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYLCWVWLGOIZHY7GQSVE4DDIHMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L8RXAANEJ8ZA?ASIN=B07Z1C9J4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2023",
                "reviewTitle": "5.0 out of 5 stars quality story but Christmas too",
                "reviewText": "Quality of Wonderful Life. But so many layers of elements of situations and characters. Loved it. Didn’t start as gChristmas story good for all time",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrshagrid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBS6JXD3TLXRXSUS6FYS5CX2A5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M2TMDOF7OJGJ?ASIN=B07Z1C9J4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2022",
                "reviewTitle": "5.0 out of 5 stars Touching tale",
                "reviewText": "A beautiful story about faith, forgiveness, and love. 7 year old Patrick is sent to live with his grandfather he's never met when his mother is killed in a car accident. The grandfather, Ian Collins, is a bitter and lonely old man. When he looks at Patrick he sees his son Sean, a son that is away fighting the Nazis. A son to whom he hasn't spoken to in almost 10 years.As events unfold, Patrick is the catalyst that thaws Ian's heart. A wonderful story for the holidays.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine Goodnough",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 31, 2021",
                "reviewTitle": "Grandpa Scrooge meets a loveable little boy",
                "reviewText": "A crotchety old man finds himself the custodian of his young grandson, Patrick Collins, whose mother was killed in a car accident. The unwilling Grandpa is to look after the boy until the father, a pilot away fighting World War II, can be granted compassionate leave as sole parent.Sadly, the old man and his son have been estranged for years. Will his grandson be the link that will bring them together them again? Will the long-abandoned gift Patrick finds in the old attic be finished someday? This is a heart-warming Christmas story with sympathetic characters.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Murray",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 15, 2023",
                "reviewTitle": "A wonderful story of redemption, love, hope and reconciliation",
                "reviewText": "I loved this story of loss, grief, faith and hope. It’s about a little 7 year old boy’s loss, his forgiveness at being mistreated and his faith and hope in God. I wish we could all have the innocence and love of a seven year old child. It would make the world a better place.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hoener, Birgit",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 7, 2021",
                "reviewTitle": "More please",
                "reviewText": "This story tugged at all my emotions, brought tears to my eyes more than once, but also smiles to my face.It is 1943, and America is fighting in WW2. Seven year old Patrick's father is a Bomber pilot somewhere in England fighting against the German Nazis. When Patrick's mother Elizabeth dies in a car accident just before Christmas, he is taken to his only living relative, his Grandfather Ian, while the authorities are looking for his Dad. However, his Grandfather seems to be a cantankerous and bitter old man, himself at war with everyone and eveything, and estranged for some time from his own son. He does not want Patrick upsetting his routine, and it's a good thing there is Mrs Fortini, Ian's neighbour, who looks after Patrick. Can the little boy soften the heart of his grandfather, particularly when they receive unsettling new about Patrick's Dad?This is one of the best Christian Stories I have read in a long time: it lets readers look into how rewarding Faith in God and Jesus can be, without hitting them over the head with religion every other sentence. The story starts sad, and seems to get sadder and more desperate (depending on the point of view of the various characters), but through it all God's loves embraces the protagonists, if they let it do so. Brilliantly written, with lovable and realistic protagonists, and a very good plot.Heartbreaking, heartwarming, and uplifting.I want more of this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Toots Sullivan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 14, 2023",
                "reviewTitle": "a tear jerker",
                "reviewText": "A lovely story woven beautifully by Dan Walsh. The people, the township, the settings all seem so real and are easy to envision from the writing. Very well done and completely clean.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashlee Meagan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 17, 2021",
                "reviewTitle": "Beautiful story",
                "reviewText": "Loved how they story unraveled. The relationship between the grandfather and grandson develops over the story and how the author wove in the life during WW2",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}