{
    "remaining_requests": 736,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Burma-Sahib-Novel-Paul-Theroux-ebook/dp/B0C7VYHTPJ",
    "body": {
        "name": "Burma Sahib: A Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Burma-Sahib-Novel-Paul-Theroux-ebook/dp/B0C7VYHTPJ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81330e2TZeL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Paul Theroux",
            "link": "https://www.amazon.com/Paul-Theroux/e/B000APWE3G/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 18,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C7VYHTPJ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Mariner Books (February 6, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 6, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3060 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 397 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 006329754X"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,873 in Kindle Store (See Top 100 in Kindle Store) #44 in Historical Literary Fiction #99 in American Literature (Kindle Store) #217 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 18 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Burma Sahib The Bad Angel Brothers The Mosquito Coast Under the Wave at Waimea Mother Land The Lower River",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/dd72fc71-fd5d-4cec-aa9a-c54facdef7d3.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a2f25346-c535-4435-ad75-1b9f5e557025.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/efd050ca-1b9b-4ac5-8aab-d597961930d3.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ec3211a2-7463-49ec-b04a-fb0f39d7fda4.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8281ff31-073d-4e96-ac4f-0d220001ee4f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e1b6222c-35f6-4dbc-b712-4d6c6b7e3a21.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ab14a8b1-8237-4b5e-8beb-362dfabe4ee4.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/331f59bb-0732-44c2-b241-e9d3c6104801.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e779df3b-b2e9-43d1-9536-73ca3a34a540.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Maggie L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3IH4Y6VVC5D2K6JC56CHKZ4IGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XM2A5Z3B1MWN?ASIN=B0C7VYHTPJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars The question is: what experiences informed your life?",
                "reviewText": "This book is a lyrical masterpiece about the quality of life and how we choose whom we become and what we believe.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mohit G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCDAPR5NWTDMS6GAJDURYFABH2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1L4FSMSYDFTJ7?ASIN=B0C7VYHTPJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Enjoyable historical fiction",
                "reviewText": "This is my first work from the author and since this particular period in colonial history is of great interest to me, I was really looking forward to getting my hands on this.The author's use the of the language is evocative of the time period and he deftly handles the various characters, some fictional, some obliquely related to real.I am glad to say that I enjoyed the book thoroughly and will be seeking more works from the author.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "eyes.2c",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJ57WGZAGKTJABEQ3N6G7EGGK4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QZ00NMKW2TQ7?ASIN=B0C7VYHTPJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars A man of his times, out of place!",
                "reviewText": "Insecure, bullied ex-Etonian, Eric Arthur Blair (George Orwell) becomes a policeman in Burma. Blair is a tall, gangly chap who finds people and relationships a burden. His inner world is far richer. Blair is withdrawn. His passion is books. That list is certainly edgy. Huxley, Lawrence for a starters. Inside he’s a rebel, an agitator. However he’s nineteen years old and en route to Burma as a training policeman with the Imperial Forces.“ [Blair’s] detachment remained, the hovering, watchful self, seeing the young man in the jacket and tie on deck, like a character in a story, knowing what the young man was hesitant to admit: that he was uncertain; that he really didn’t have a clue; that he was to be a policeman.Blair’s life in Burma will be very different to the life he dreams of. A puzzle he has to somehow push through. An outsider trying to find his way in.Burma has a strong culture dating down through the centuries, rich in food, in color and movement. Paradise with more than a sting in its tail. A culture disdained by its imperial masters. Welcome to the British Raj.He’ll confront jingoism, culture wars, attitudes to mixed races, women, and troubling juxtapositions about life and viewpoints. He is introduced to pleasures of the flesh, he finds love only to realize its limitations. He canes prisoners and sees himself back at Eton being bullied. He hates his actions. He feels unclean. His conscience is troubled. However his survival is reckoned on sticking with the status quo—the Sahibs.That means hiding the fact that he has two half caste uncles, and cousins. Relatives he wants to hide for reasons of his own acceptance, as much as for their protection from insular snobbery and disdain.Burma, part of Britain’s far flung empire, a place the British cling to and impose their rule of law on.The story of this troubled, non conformist, who conforms in the worst possible way, is broken open in the worst way possible. Blair finally escapes to a different and we can only hope more satisfying future.Last we see Blair, he is immersing himself in sociological investigations in the north of England. He writes under his other persona, George. The name he gave his writing self in Burma.An intriguing novel that immerses the reader in the Imperial Police Force and has the main character pondering questions. Yet those questions are silenced, submerged by tradition and rules, unwritten and written. Judgement to the letter of the law with very little scope for compassion. Blair becomes part of the very system he condemns. A proper Burma Sahib, on the outside. Inside he’s a tortured, conflicted soul.Eric Blair is a character not soon forgotten. George Orwell didn’t. This fictionalised tale of Orwell’s early years is thought provoking and brilliant!A Mariner Books ARC via NetGalley.Many thanks to the author and publisher.Please note: Quotes taken from an advanced reading copy maybe subject to change(Opinions expressed in this review are completely my own.)",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "scifishm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEB6O73AKDUOUMGVQMF7NY5PX4ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GU78MLX15BOF?ASIN=B0C7VYHTPJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars An intimate, if imagined, portrait of Eric Blair, in 1920s Burma, transforming into George Orwell.",
                "reviewText": "Paul Theroux’s latest novel (his 30th, I think) is a fictional account of a formative period in the life of Eric Blair, the man who became George Orwell. The book comes with the usual disclaimers for a work of fiction about a real person: “ “Names [etc.] … are products of the author’s imagination. . . . not to be construed as real . . . any resemblance . . . entirely coincidental.”But I don’t believe him. That is, I will grant that the British characters Blair interacts with in the book--all believable in their vocabulary, their backgrounds, their usually terrible behavior as British military policemen, their complacent acceptance of their role as colonial overseers for the empire, and their attitudes toward Blair’s struggles and failures in that role—are imagined.And I will grant that the believable natives in Blair’s world—the Burmese, the Indians and the other “Orientals,” as Blair calls them—the men who obediently and zealously perform their duties as Blair’s subordinates in the police; the robbers and rapists and other miscreants who are the ostensible reason that the British police force exists at all and are the targets of British zest for cruelty; the angry mobs who threaten British control and are the real reason for the police; and the Indian merchant, fluent in English, with a most English last name (Thackeray!), who becomes Blair’s closest friend and Blair’s confessor—are imagined.And I grant that the believable women Blair gets involved with—his selfish idealized attachments to his “keeps” (you’ll have to read the book to find out what that means) and to the one woman with whom he thinks he has fallen in love—and the sex scenes that leave little to the imagination—are imagined.But Theroux’s beautiful passages that immerse us in the landscape of Burma, its birds, its flowers, its trees and foliage, its rivers and creeks—its sensuality—certainly are not imagined.And I am convinced that the Blair in Theroux’s novel is not a fiction. I refuse to believe that the Blair who spurns the usual progression of a British schoolboy from Eton to Oxbridge and instead goes to Burma—his Oxford as he says--to be a policeman, is imagined.The Blair who says upon his arrival in Burma: “I hate this, I shouldn’t be here, I will never succeed”—is not imagined. The Blair who is self-conscious about being tall, who can feel clumsy and ugly, is ashamed of his parents, who is incapable of refusing an order even though he almost always wants to, who feels his role as a policeman is turning him into someone he despises, I believe this is the real Eric Blair.When we see Blair recognize the inevitability of seeing his life in Burma through the eyes and words of Kipling or reading and admiring and wishing he could write like his heroes: Jack London, Butler, Wells, Lawrence, Maugham, and dismissing the writers—Huxley, Forster--he believes waste his time or get it all wrong, we are seeing the real Eric Blair.When Theroux slowly reveals for us the emergence of Blair’s secret self—the rebel who despises authority, the diarist, the notetaker who sees salvation in writing-- who becomes the someone he had always known was inside him, “the inner man Blair thought of as George,” Theroux is telling us about the real Eric Blair.Throughout the book Theroux gives us hints of some of the books and essays Eric Blair will write once he becomes George Orwell: Burmese Days, obviously; “Shooting an Elephant”; Down and Out in Paris and London (because “being a tramp was a proper vocation and a refuge”); Animal Farm (where some are more equal than others); and--when a colleague of Blair says at one point “the rat has its uses,” and Blair is appalled at seeing a dead man’s face that has been gnawed by a rat; and when Blair visits a prison built around a panopticon and asks himself “what if a whole society was a panopticon with a tyrant at its center in the watchtower,” an all-seeing eye--1984.Theroux’s Blair thinks that readers “get to know fictional characters with more intimacy than any living person.” Well, by the end of Burma Sahib, the reader knows the formative experiences and ideas of Eric Blair—of George Orwell, the most influential writer of the 20th century-- more intimately than it is possible to know from any biography. This is Paul Theroux’s great achievement in this great book.An advance copy in galley form via NetGalley.My thanks to author and publisher.Please note: Quotes taken from a galley may change in the final version.(Opinions expressed here are my own.)",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}