{
    "remaining_requests": 1022,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shiloh-Novel-Shelby-Foote/dp/0679735429",
    "body": {
        "name": "Shiloh: A Novel",
        "price": "$14.49$14.49",
        "originalPrice": "",
        "rawPrice": 14.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shiloh-Novel-Shelby-Foote/dp/0679735429",
        "soldBy": {
            "sellerID": "A3VXS3MWPH9PED",
            "name": "Legacy Books & Media",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3VXS3MWPH9PED&asin=0679735429&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71czc0uz2vL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Shelby Foote",
            "link": "https://www.amazon.com/Shelby-Foote/e/B000AQ48MU/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "The BAP Goods",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 756,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 15 hrs 7 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 15 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Vintage (April 9, 1991)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 240 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0679735429"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0679735427"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.24 x 0.63 x 7.95 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#239,947 in Books (See Top 100 in Books) #2,316 in Contemporary Literature & Fiction #3,198 in War Fiction (Books) #14,393 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 756 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "D. Earls",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHII2OEYWK4H3NUJH4NUTHQ2K64A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38MKXPEQ2GKS2?ASIN=0679735429",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 19, 2013",
                "reviewTitle": "5.0 out of 5 stars Easter eggs galore",
                "reviewText": "Not going to try to add to the praise this book has received, but would like to point out some of the overlooked literary devices in the book. It appears to be a series of disconnected stories from six (well, more on that later) narrators. To those with the desire to delve more deeply into connectivity, the following linkages appear:1. Lt Palmer Metcalf will be observed by Pvt Luther Dade when Gen Johnston's command passes the Mississippians (Ch 3).2. Pvt Luther Dade will inquire of an unnamed sergeant where he can find a doctor during his wanderings over the battlefield (Ch 3). That sergeant is Jefferson Polly of Forrest's cavalry. In fact, Polly will report about being asked by a wounded youthful soldier where he can find a doctor (Ch 5).3. Capt Walter Fountain's narration ends abruptly, but we learn in the Otto Flickner narration that Fountain has been killed by a cannonball (Ch 4).4. In the Indiana squad chapter, there are twelve sections. Each section is narrated by one of the twelve members of the squad, and, with a little sleuthing, the order of the narrators can be worked out: Robert Winter (killed), Sgt Bonner, Klein, Diffenbuch (wounded), Holliday, Cpl Blake, Joyner, Grissom (wounded), Pettigrew (killed), Lavery, Amory, Pope.5. Lt Palmer Metcalf will cross paths with Jefferson Polly in his closing chapter. He will also cross paths again with Pvt Dade, the young soldier on the wagon who moans exactly what he moaned to the captain of his regiment after receiving his bayonet wound.For those interested in external linkages, consider this. The casualty rate among narrators closely echoes the casualty rate suffered by both armies during the battle. Luther Dade's last name is the same as Shelby Foote's middle name. He hails from fictitious Jordan County, which is the name of Foote's next book. And finally, Metcalf refers to a portrait of his mother hanging in his family home in New Orleans. The portrait was painted by Thomas Sully, who also painted a famous portrait of our third president, Thomas Jefferson. Thomas Jefferson's older sister was Polly Jefferson. The narrator of the fifth episode is Jefferson Polly.None of the above are obvious at first read, but when the curious reader chooses to delve more deeply, the underlying structure is there.Let me just add that the writing in this book is wonderful. It is spare and elegant, not stark and sparse. It is also wonderfully clear. There isn't a single sentence in the entire book that has to be re-read to be understood.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. G Watson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVZFZTN4MW2CXG7R34S6N3NTB6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R8SJP1NQ01WF?ASIN=0679735429",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 2, 2012",
                "reviewTitle": "4.0 out of 5 stars A Novel of a Regional Form",
                "reviewText": "SHILOH was the novel Shelby Foote was always expected to write - a novel of the Civil War, with which he will always be inextricably linked. It's an unusual little book - fans of his massive narrative history of the war will be surprised to see that it weighs in at a trim 221 pages - and if it commits a sin, it is in perhaps not being an epic. But its lack of greatness is in a way part of its charm. Foote was always at his best explaining how flesh-and-blood human beings shaped history with their doings and don't-ings, and SHILOH is less a novel about the decisive battle of the West and more about the ordinary people who fought it.The novel is written from six points of view: Palmer Metcalfe, an officer on the staff of the rebel army under General Johnston; Walter Fountain, a Union staff officer; Luther Dade, a Mississippi rifleman; Otto Flickner, a canoneer from Minnesota; Jefferson Polly, a cavalryman under Nathan Bedford Forrest, and Robert Winter, who speaks for all twelve of the men of Squad 6, 23rd Indiana. The way the men relate their tales to the reader varies; some write it in epistolary (letter) form, while others speak directly to the audience. The personalities of the characters vary widely, with some of the men well-educated and others \"barefoot in their speech.\" The one unifying factory is that except when recounting the doings of others, there are no heroes.In writing SHILOH, Foote tried hard, and I think succeeded, in presenting war - especially 19th century war - as controlled chaos, with the emphasis on the \"chaos\" and not the \"control.\" Also in presenting human motives as what they were and not what we'd like them to be. Metcalfe is confident his paper plans will come to fruition, and bewildered when reality refuses to correspond. Fountain has no idea what he is getting into. Winter records that nobody in his squad likes anyone else. But the show is stolen by Flickner, who, after running away from the battle, challenges another skulker to a fight for calling him a coward. The skulker says, \"If you're so alfired brave, sonny, what you doing back here with us skulkers then?\" Polly replies with dignity: \"I ain't scared the way you made out. I'm what you call demoralized.\" Only a Southerner like Foote could write dialogue so true to the 1860s, and only a man so steeped in the history of the war could reproduce its atmosphere so completely.The weaknesses of the story are bound up with its strengths. Having six characters writing six in voices gives the reader the feel of working through a book of essays or recollections rather than a novel, and the fact that several of the stories loosely interweave doesn't really do much to pull them all together. What's more, those who have real Foote's Civil War Trilogy will recognize many passages taken almost word for word from those books and transplanted here; Foote was unable to resist doing this apparently, when he was writing exposition.Overall, however, I can't do anything but recommend this book, particularly if you've never read Foote's nonfiction work on the war. He writes beautifully when he wants to (\"I'd done as poor a job of making a bad man as I had of making a good one\", says Polly), and always with wit and a certain melancholy (Metcalfe's father suffers from \"Regret...regret of a particularly regional form.\"). What's more, he sums up the reason for the South's defeat as only a man born and raised in Mississippi could: \"We were sick with an old malady; incurable romanticism and misplaced chivalry...We were in love with the past, in love with death.\" Foote said in an interview once that the Civil War was the war that defined America, and to understand that definition you could do worse than reading SHILOH.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LBF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEXRQDEUI5HEOHYHIXDNHJYTWSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OC547OW06U76?ASIN=0679735429",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Great read",
                "reviewText": "Shelby Foote best Civil War writer.Any book by him is excellent.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Jamakaya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2IZCNERD5W2N32BJQMDCUBG3AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRQPKKROMDCXZ?ASIN=0679735429",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2015",
                "reviewTitle": "5.0 out of 5 stars A Soldier's Eye View of the Battle",
                "reviewText": "In “Shiloh,” historian Shelby Foote tells both sides of the Battle of Shiloh, April 6-7, 1862, from the points of view of Union and Confederate soldiers. Each chapter is told from the perspective of a soldier caught up in the fighting – a rifleman with the 6th Mississippi, an adjutant with the 53rd Ohio, a scout with Nathan Bedford Forrest’s cavalry, an artilleryman with the 1st Minnesota Battery, etc. Through their eyes, the feelings of the fighting men and the sights and sounds of the battle are brought vividly to life. We get into the heads of these men as they wait for action and charge the enemy, dodging bullets and cannon fire, and as some march dejectedly away from the battlefield. Along the way, we get short but insightful portraits of Generals Grant, Sherman, Johnston and Beauregard as they lead their men.Foote’s descriptive prose is fantastic. His keen eye for the changing natural environment around the soldiers – the rain, the mud, the trees and sky and river – enhances the martial atmosphere of the battle. Foote’s soldiers/storytellers are fictional, yet their stories are emblematic of what individual men might have experienced. I take issue with his romantic portrayal of the cutthroat Nathan Bedford Forrest but since I’m a Yankee that’s probably to be expected! Some reviewers criticize the book as not living up to “The Killer Angels” and its detailed explication of the Battle of Gettysburg. I think “Shiloh” had a more modest purpose. It’s a compact narrative in the mold of “The Red Badge of Courage.” On the whole, this riveting, compassionate novel is a wonderful addition to any Civil War buff’s collection.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Derek Hillard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 10, 2021",
                "reviewTitle": "Enthralling",
                "reviewText": "Excellent short novel on the actions of six fictional soldiers during the battle of Shiloh. The novel intermingles the fictional characters with historical characters and historically accurate events. It is not heavy on battle details so there is no getting bogged down at that level, just story telling at its finest. I was familiar with the battle of Shiloh before I read this novel, I watched a 20 minute pictorial re-creation on YouTube, that was sufficient to 'set the scene' for me. Highly recommend this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LA CHAPELLE 61",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 13, 2019",
                "reviewTitle": "TRES BIEN",
                "reviewText": "TRES BIEN",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "movamental",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 28, 2015",
                "reviewTitle": "My first civil war novel",
                "reviewText": "Having noted Shelby Foote in Ken Burns's civil war documentary, i thought I would read the historians acclaimed novel Shilo and I was not dissappointed. The battle is told from the perspective of four Confederates and three Union soldiers, each has an interesting experience to relate.Nathan Bedford Forrest features twice in two separate stories. Shelby does mention the story of NBF which has been used to build the legend, albeit he was a brave and fearless fighter. Why no mention of the 40 negroes that rode with him, I suppose was not part of the project. That little detail will no doubt be left to myself.In these days where the US has gone nuts banning the confederate battle flag, one really ought not allow racists and lefty Marxist/Hollyweird re-tell your history. Flags like guns don't kill nasty people do.I liked this story and it was an easy read.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vissecq andré",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in France on May 14, 2019",
                "reviewTitle": "L'absurdité de la guerre",
                "reviewText": "Un récit poignant de la guerre de sécession vue à travers les pérégrinations de combattants des deux camps",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sby",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 20, 2013",
                "reviewTitle": "Shiloh battle",
                "reviewText": "I have read the books by Shelby Foote, the detailed history all 3 volumes, which kind of got me hooked on the Civil War here. that following a smaller version based on the discovery channel, also a must read.I liked this book, as the characters overlap as the battle unfolds. events from one view are seen from someone elses view who takes you to another point of the battle.You almost certainly get placed in the battle from both sides point of view, which I found great. Plus it gives you that insight, that one view always has an opposite you might want to think about.This book definately explains the battle lines and how they came to be, but without all of the detail you could get if you wished elsewhere. But you will certainly understand how the battle was fought.Trouble is. I wish it had been longer. Having started it, I couldn't put it down, so another great book by the author.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.53",
                "sellerName": "CE_BOOKHOUSE",
                "sellerRating": "5"
            },
            {
                "price": "$15.22",
                "sellerName": "Entertainly",
                "sellerRating": "5"
            },
            {
                "price": "$16.95",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}