{
    "remaining_requests": 820,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Storm-Beyond-Tides-Jonathan-Cullen-ebook/dp/B09BM419DK",
    "body": {
        "name": "The Storm Beyond The Tides: A World War Two Historical Novel of Love and Loss (Shadows of Our Time Book 1)",
        "price": "$5.99",
        "originalPrice": "",
        "rawPrice": 5.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Storm-Beyond-Tides-Jonathan-Cullen-ebook/dp/B09BM419DK",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61lMWaKESwL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jonathan Cullen",
            "link": "https://www.amazon.com/Jonathan-Cullen/e/B07NW1LSY9/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 2905,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09BM419DK"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Liquid Mind Publishing (August 10, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ August 10, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1249 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 342 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1685330533"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#102,187 in Kindle Store (See Top 100 in Kindle Store) #462 in Historical World War II Fiction #586 in American Historical Romance (Books) #891 in Women's Historical Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 2,905 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/0fa14d54-651c-4bce-9976-6c7ee6e422fb.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/795df758-e124-4feb-9f81-31ebe5ae4c49.__CR0,0,1458,1458_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/d9918f0c-8948-4391-8790-652e39b3758c.__CR0,0,1458,1458_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/c4b21c49-6cb0-4b65-a1f3-1596daaca814.__CR0,0,1458,1458_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/f24c47a5-0b4a-4d21-9e5d-3be2819de838.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Virginia Dill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFWUR5MVFJWSQDPPQ5JFMJEKMBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P6T21IP22EEA?ASIN=B09BM419DK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2022",
                "reviewTitle": "5.0 out of 5 stars 'Un-put-down-able' historical fiction with a sprinkling of romance and lobster rolls",
                "reviewText": "Book Review: The Storm Beyond the TideBy Jonathan CullenIf you love a good, quick WW2 love story which wraps vivid settings, believable characters, and painful historical details into one crafty, ‘un-put-downable’ WW2 romance, you will enjoy The Storm Beyond the Tide. It is the story of a poor fisherman’s daughter, Elle Ames, who lives on Monk Island in coastal Maine with her fisherman father and family, who meets a German boy, Karl Brink, vacationing with his Anti-Nazi professor father and mother, who hope to extend their visas to stay in America, during the fateful summer of 1939. At a time when Hitler’s Horror is already capturing US headlines, Cullen’s story will send you splashing through the storm-tossed waters of coastal Maine during a period in our history where prejudice and suspicion were fish served up daily in US cities as the US prepared for WW2. I love a good quick WW2 read and hoped to find a new author I hadn't read before. I wasn't disappointed when I discovered this novel in Jonathan Cullen’s, Shadows of Time Series.The setting had me wandering the tidal backwaters, the brackish coves, the sunlit beaches, and salivating over the lobster references as summer memories worked their magic in my brain. The setting was enriched by the pre-war angst of Elle, a young girl who grew up on Monk Island, a ferry ride from the ‘big city’ in Portland. The romance between Elle and Karl pulled me into a what I refer to as well-researched historical fiction, with a sprinkling of romance as the pair embark inside a forbidden love story, both too young to understand the political implications. Using the Forbidden Romance trope which pulled me into the story to start, I quickly became immersed in the fast moving, even paced, narrative which kept me engrossed in the plot well into the night. Karl's father, an anti-Nazi German professor, the opposite of Elle’s rigid father, a down-on-his luck and oftentimes shady fisherman, sucked me in like melted butter on a lobster claw.As the romance unfolds, the reader is greeted by the impossible situation many Germans faced as Hitler’s menace set the world on fire. As the lovers’ worlds collide, and Karl’s father struggles to get a sponsor for his visa to keep the family safe in America, Elle is falling hopelessly in love with Karl, as Ben, his father’s partner and the story’s troublemaker who falls for Elle, begins to set in motion all the back-handed jealousy and vengeful traps, a romance reader comes to hope for when choosing a romance novel. What would a romance novel be without a jealous back-stabbing rival for the hero or heroine’s attentions?As the winds of war echo from across the pond, and Karl must return to Germany at the height of Hitler’s madness, he is forced to join the Nazi submariner division of Hitler’s war machine, but, ready, willing, and able to defect. As the suspense mounts, leaving both Elle and Karl on opposite sides of a world in conflict, the story’s ending borders on the unbelievable. A few side stories peppered throughout the intrigue, reveal to what extent Ben will go to win Elle’s heart, a match we first believe Elle’s father is hoping will finally settle his daughter down. The complex layer of conflict Ben brings to the story kept me reading, as family secrets are revealed amid the military coastal buildup on Monk’s Island as family truths and sorrows are revealed and friends are found.Rich in historical details and shimmering with beach scenes, the only negative I found was, the love story needed a push in the romance writing, oftentimes coming through as flat and drifting. Although well-written, the story had a few editing errors which didn’t detract from the story or the plotline. I found myself enjoying a new author. At times the romance felt like Swiss cheese with a few holes in it. Although a heartfelt romantic story which ultimately provides a HEA, there were some loose plot ends I won’t discuss as they would spoil the read for others. Often, the romance lacked the steam necessary to fuel a romance lover’s locomotive. But what was missing in overt romantic interludes, the author made up for with historical authenticity and a breezy, ‘I-can’t-put-this-down’ suspenseful love story. Rich and colorful in detail, the characters came to life as if I was walking the craggy shores of Monk Island and summering in coastal Maine in 1939 with all the innocence of a young girl in love with a man, many saw as the enemy.The book was layered beautifully with just the appropriate mosaic of backstories woven throughout, as the plot points moved the story along quickly. The angst the islanders and the German Brink family felt as war drew near, was credible. The historical retelling poured through the book like the German war machine ploughed through Europe in the late 1930’s and early 1940’s.I was so surprised at the simplicity of the writing, the moving plot, and the believable characters, I read the rest of the books in the series over the next two days. I enjoyed the novel. To weave a Forbidden Romance inside a horrific period in world history, left me begging for more. Give it a go. It’s an easy, breezy beach/mountain vacay read, filled with plotline pleasure. Spoiler Alert: Book should be marketed as historical romantic suspense. Although the story meets the criteria for the romance genre, providing the genre necessary HEA, the story is more a cross-pollination of suspense, history, and romance, but nonetheless enjoyable.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BookHawk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECCGMPM2UKVC4A4NKYOCZ7VQMZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3A0A8ODA42D1A?ASIN=B09BM419DK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "4.0 out of 5 stars written as if for young adults",
                "reviewText": "The writing is competent but the narrative is just not compelling. Four stars may be generous. A lot of local Maine knowledge doesn’t make up for the naïve storyline",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "felipe quesada",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ4MYGMUJF25GZJHGKOIF5UZ2WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28OS7WIPN94L4?ASIN=B09BM419DK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Happy ending",
                "reviewText": "Im usually more interested in military history than a romance. This book was different for me in many ways. A good pace with strong characters.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIGSANGEHL5PWSL3OP6F24XQUWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W9TV9PP66YM6?ASIN=B09BM419DK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 23, 2020",
                "reviewTitle": "3.0 out of 5 stars Kind of boring",
                "reviewText": "I hate writing this review since I’m sure the author really spent time with this book. However, I must agree with other reviews about this book being quite boring and missing the element of surprise. The characters and story line is quite cliche, pretty girl meets mysterious guy. There’s no build up to peel interest so I stopped reading it and just wasn’t able to finish it. Perhaps it changes farther ahead, but it just didn’t do this early enough for me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jewell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5VC3JADUWBTHKGIRJRPGMADZYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UVA29DBEIYV1?ASIN=B09BM419DK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 25, 2019",
                "reviewTitle": "4.0 out of 5 stars Good story though romance could be stronger",
                "reviewText": "I was interested in this novel because I am interested in romance and World War II. The plot begins with a 1939 summer romance between Ellie, a girl from a poor family in Monk Island off the coast of Maine, and Karl, son of a German couple who visit the island in hopes of staying in the United States due to the father’s anti-Nazi activities. They cannot find a sponsor, and at the end of the summer must return to Germany. Karl and Ellie do not even have a chance to say goodbye. As the war years go by, Karl, who is now in the German Navy, manages to get a letter to Ellie saying he will return. Ellie has begun dating Ben, the young man who works for her father. Ben finds Karl’s letter and turns it over to military authorities. Is Ben a sympathetic character or a bad guy? I felt sympathy for him, the poor boy from the north of the island. As his employer, Ellie’s fisherman father is very hard on him, and Ben just accepts the abuse. Also, Ben is very patient with Ellie as she keeps her distance from him over so much time. Meanwhile Karl, on a U-boat crew, hopes to escape from his boat to return to Ellie as, guided by Karl, it approaches the coast off Monk Island.It’s a good plot, but the author perhaps needed a woman to help with the sections about Karl and Ellie’s summer romance. I had just read an excellent romance by a woman which portrayed the experience of falling in love so well. In contrast, Cullen’s description of the love relationship seems just factual. To have rendered their love more convincingly would have enhanced the rest of the novel. However, the plot becomes exciting, and Cullen excels in describing Karl’s experience on the U-boat and his escape. Also Cullen’s knowledge of history seemed solid.(Spoiler alert in the following). I had to read closely to figure out what happened in the end, and the ending raised some questions for me. But it seems Ellie’s father, portrayed in the first part of the book as the evil father trying to prevent Ellie from being with a “Kraut,” changes his mind when Ellie finally tells him Karl and his family were anti-Nazi. (Why didn’t she tell him sooner?) Thus, when he discovers Ben about to turn the escaped Karl in, he kills Ben to save Karl and helps Karl escape—but he never tells Ellie. Karl remains in hiding until the end of the war in Europe. Later, when he and Ellie are reunited and Karl tells her the story, he says maybe her father was afraid to tell her of his escape, but that needs more explanation, I think. The novel also needed a little proofreading (the proofeditor’s fault?)—there were a few typos and grammar errors (Laying on his side, he…. She knew her father and him were….). Still, I enjoyed the novel and read eagerly to the end, hoping it would be happy.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOZB7CNXX6HHDY2UATK66DNFZGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25ZFLUI5Y1UYF?ASIN=B09BM419DK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 5, 2019",
                "reviewTitle": "5.0 out of 5 stars For fans of historical fiction, World War II, New England history, and great love stories",
                "reviewText": "This is a beautifully written and well researched book. “The Storm Beyond the Tides” tells the story of Ellie Ames, the daughter of a lobsterman in coastal Maine, and her relationship with Karl Brink, the son of German university professors visiting Maine in the summer of 1939. War hasn’t broken out yet, but it’s only a matter of time. Can their young love survive the mounting obstacles thrown their way? Prejudice, violence, family strife, betrayal, economic loss, and war all conspire against them. Is love eternal? Or is theirs only meant to last the summer? Rich with strong and compelling characters and fascinating history, Cullen paints a portrait of life in New England on the eve of World War II and explores the devastating impact war has on a coastal community and its inhabitants.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne Pantano",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDPBBNNWOXXVI3UUZWRNJUAFESQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B7LZ3E6SW9M2?ASIN=B09BM419DK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2022",
                "reviewTitle": "5.0 out of 5 stars A Wartime Romance Across the Ocean",
                "reviewText": "A youngGerman boy snd his family try to get visas to stay in America, specifically in Maine, as WWII begins. He falls in love with a young American girl but during wartime was their love meant to be?",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter McBride",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 9, 2019",
                "reviewTitle": "A page-turner as no other",
                "reviewText": "It's almost a cliché: young lovers belonging to opposing factions, as was the case with Romeo and Juliet. The author begins his story just before the outbreak of WWII and Karl hails from Germany. He falls in love with Ellie, the daughter of a lobsterman on Monk Island, off the coast of Maine.The islanders have been alerted to the rise of Adolf Hitler and his followers, and see the new arrivals as the enemy. The irony is that Karl's father, a university professor, bitterly opposes the Nazis and has taken his wife and son to the USA to escape the war that’s threatening Europe and beyond.To their dismay, circumstances cause Karl and Ellie to be separated. He must return to Germany with his parents. Both are heartbroken, America is drawn into the war, and the lovers resign themselves to a life apart.I have to say that prior to reading Cullen’s novel the closest I’d gotten to Maine was eating Maine lobster on two occasions—yummy! But this book drew me in and I learnt so much about life on those islands. And his fascinating examination of two families separated by a lot more than language would have made Shakespeare nod his head in appreciation. A must-read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}