{
    "remaining_requests": 980,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Spy-and-Traitor-Ben-Macintyre-audiobook/dp/B07DHR7427",
    "body": {
        "name": "The Spy and the Traitor: The Greatest Espionage Story of the Cold War",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Spy-and-Traitor-Ben-Macintyre-audiobook/dp/B07DHR7427",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/512tQtzk1VL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ben Macintyre",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Ben+Macintyre"
        },
        "brand": "Ben Macintyre",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 31285,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER The celebrated author of Double Cross and Rogue Heroes returns with a thrilling Americans-era tale of Oleg Gordievsky, the Russian whose secret work helped hasten the end of the Cold War. “The best true spy story I have ever read.”—JOHN LE CARRÉ Named a Best Book of the Year by The Economist Shortlisted for the Bailie Giffords Prize in Nonfiction If anyone could be considered a Russian counterpart to the infamous British double-agent Kim Philby, it was Oleg Gordievsky. The son of two KGB agents and the product of the best Soviet institutions, the savvy, sophisticated Gordievsky grew to see his nation's communism as both criminal and philistine. He took his first posting for Russian intelligence in 1968 and eventually became the Soviet Union's top man in London, but from 1973 on he was secretly working for MI6. For nearly a decade, as the Cold War reached its twilight, Gordievsky helped the West turn the tables on the KGB, exposing Russian spies and helping to foil countless intelligence plots, as the Soviet leadership grew increasingly paranoid at the United States's nuclear first-strike capabilities and brought the world closer to the brink of war. Desperate to keep the circle of trust close, MI6 never revealed Gordievsky's name to its counterparts in the CIA, which in turn grew obsessed with figuring out the identity of Britain's obviously top-level source. Their obsession ultimately doomed Gordievsky: the CIA officer assigned to identify him was none other than Aldrich Ames, the man who would become infamous for secretly spying for the Soviets. Unfolding the delicious three-way gamesmanship between America, Britain, and the Soviet Union, and culminating in the gripping cinematic beat-by-beat of Gordievsky's nail-biting escape from Moscow in 1985, Ben Macintyre's latest may be his best yet. Like the greatest novels of John le Carré, it brings readers deep into a world of treachery and betrayal, where the lines bleed between the personal and the professional, and one man's hatred of communism had the power to change the future of nations. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Politics & Social Sciences",
                "link": "https://www.amazon.com/Politics-Social-Sciences-Books/b?ie=UTF8&node=3377866011"
            },
            {
                "name": "Politics & Government",
                "link": "https://www.amazon.com/Politics-Government/b?ie=UTF8&node=5571255011"
            },
            {
                "name": "Specific Topics",
                "link": "https://www.amazon.com/Specific-Topics-in-Politics-Government/b?ie=UTF8&node=5571258011"
            },
            {
                "name": "Intelligence & Espionage",
                "link": "https://www.amazon.com/Political-Intelligence/b?ie=UTF8&node=3049221"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 20 minutes"
            },
            {
                "name": "Author",
                "value": "Ben Macintyre"
            },
            {
                "name": "Narrator",
                "value": "John Lee"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 18, 2018"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07DHR7427"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,776 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #2 in Intelligence & Espionage (Audible Books & Originals) #2 in Espionage True Accounts #2 in 20th Century History"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Charles Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMSFDF4URKWUW4KYCOGURAQ2VJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X4D6G955C8E5?ASIN=B07DHR7427",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2018",
                "reviewTitle": "5.0 out of 5 stars Hot-property prospect keeps business executive up late at night.",
                "reviewText": "The Spy and the Traitor, by Ben Macintyre, published in 2018, is the definitive, highly informative, non-fictional account of the defection of a senior-level Soviet spy. He decided to go to the West in the summer of 1985 amidst a flurry of political instability and an uncertain future in the Kremlin. The book is jam-packed with significant historical events taking place on a massive global scale, many of which most of us have all but forgotten, if we knew about them at all. For example, Stalin's purge of 1936-38, the Soviet invasion of Hungary in 1956, the construction of the Berlin Wall in 1961, the Soviet suppression of the Spring uprising in Czechoslovakia in 1968, and Britain's expulsion of 105 key Soviet intelligence officers in 1971. Are we beginning to see a pattern here? Is history repeating itself? It's like looking at your reflection in a two-way mirror. You see life from \"Both Sides, Now,\" as in the Joni Mitchell song from many moons ago. Be that as it may, the book depicts interesting, biographical information about some of the most famous (or infamous) spies of the twentieth century from the U.K., the U.S., and the U.S.S.R. An excellent selection of photographs is included, which represents a virtual \"Who's Who\" gallery in high-resolution from the shadowy world of cloak and dagger. The book takes you on a virtual tour of the most conservative hot-beds of intrigue you can imagine from around the globe. Make no mistake about it. It's a no-holds-barred, kiss-and-tell book. You can hardly miss, skimming the pages of this book, if you're on a fact-finding mission concerning the secretive intelligence community operating with impunity in the 1960's to the 1990's. What formerly had been considered classified, closely guarded secrets has suddenly \"come alive\" and become common knowledge. Shocking! I shiver at the mere thought of another \"cold war.\" To think that all of these events actually transpired before the advent of super-fast, high-volume storage, internet-accessible personal computers, thumb-drives, and the foggy cloud of securely triple-encrypted data is mind-boggling. \"Where is Ed Snowden, when you need him to reset a password?\" Most of all, the book provides keen insight into what it takes to make it to the top of the bureaucratic hierarchy in the corporate boardrooms of spy-craft. You are constantly reminded that longevity is never guaranteed in the spy trade. You find out the hard way that building a successful business career in \"Her Majesty's\" secret service is definitely no accident. A good spy (and author) can fully describe, characterize, criticize, evaluate, and assess his subject within the space of two or three paragraphs, pointing out all of his flaws, failures, faults, weaknesses, shortcomings, and inadequacies in the process. He knows what he's up against. He reads his adversaries like a book. He knows their limits. Good luck with that, James! There are ramifications for your actions. You're either on your way up or on your way out the door, when you mix and mingle with that sort of crowd. R. Royce rode the beach cruiser in a northerly direction to the park proceeding at a pleasant, leisurely pace. He stopped and leaned the bike against the trunk of an old walnut tree, to walk alongside a clear running creek. Oftentimes, he enjoyed reveling in and communing with nature. The weather was warm and sunny, for a winter day. The winds were calm. He noticed the brown paper grocery bag through the branches of a tremendously large, towering maple tree, all camouflaged and concealed by an abundance of leaves. One principal branch had fallen into a great depression in the muddy embankment, due to a lightning strike. It too was covered over with leaves, and partially hidden from the view of prying eyes behind some dense undergrowth and the trunk of a fallen oak. He quickly retrieved the item, then walked back to the bike. He placed the lunch-sack size bag inside the water-proof, rip-stop fabric bike pack which had been velcro-ed on top of the bronze anodized-aluminum rack, affixed to the back of the bike. The metal rack had been firmly attached to the titanium frame with small stainless steel bolts, nuts, and washers, and fit stylishly over the rear wheel. The flat, broad surface of the rack thus placed in this manner had the added advantage of preventing water from spraying up his backside when he rode through water puddles on the sidewalks and in the roadway, much in the same way as a curved metal fender skirting would, but without the narrow space between the tire and the fender becoming clogged up with mud and debris, causing the bike to drag, and not roll as freely, almost effortlessly, as it should. He truly loved the technology, innovation, and ingenuity behind fine craftsmanship. He climbed aboard the cruiser bike, thought about poor \"Pee Wee Herman,\" and rolled away swiftly downhill. He was elated, and accelerated. It went faster than usual. \"Not bad for a day's work,\" said Royce, having returned to the apartment, well-exercised and exhilarated. He verified the contents of the bag, which might have contained sandwiches and cans of soda for an impromptu picnic. Except it didn't. \"Don't quit your day job,\" said Meghan, his constant traveling companion and business associate, seated on a flowery sofa in the living room. \"Some people would kill for a 'Pay-Day' like this,\" he said, taking a bite out of a warm portion of fruitcake, the shape of a candy bar. He began stacking bundles of $100 bills in two neat piles. The total added up precisely to a total of $65,000. \"One for me, one for you. One for you, two for me,\" she recited. \"Fair is fair,\" he said. \"Who said money doesn't grow on trees?\" \"As long as the assignment doesn't involve extortion, blackmail, or serious bodily injury, we can't lose,\" said Meghan. \"Simple arithmetic, security and surveillance are all important,\" said Royce. \"Today's task reminds me of the country and western music we heard broadcasted over the public television station airwaves the other night. Two musicians were playing guitars, one acoustic, one electric.\" \"Their instrumentalist performance was flawless. They sounded absolutely fabulous. One of them sang a song, called 'The Walk of Life.' I don't think I'd exactly call it a recent hit. It sounded more like a popular Cajun tune of the 60's or 70's,\" said Meghan. \"Sticks right in your brain.\" Royce pulled out an old guitar case that was \"stashed behind the couch,\" reminiscent of Glen Campbell, on his way to Arizona. He extracted an old wooden dulcimer and began to strum. She began to hum. She scraped a bottle cap over a corrugated, dull gray, galvanized metal wash-board. Ecstatic, they played their roles to the hilt. \"You don't think, they'll miss the money, do you?\" he asked. \"Not really. There's plenty more where that came from.\" she replied, confidently. \"Cornelius said he would help the 'Small-Fry' out with a safer, more lucrative part-time job. It's honest work, with incentive pay. The job satisfaction he gains will make it even more rewarding in the long run.\" \"You're suggesting that 'the Rascal' keeps his job and isn't incarcerated?\" asked Royce. \"What are friends for if they can't bail you out, when you make a drastic error in judgement that has the serious consequences and far-reaching implications of an international incident?\" asked Meghan. \"Selling public information for the greater common good may not seem to be that big of a deal, in all fairness, when your loyalist customer has an obvious need to know and the means to pay big bucks for it. Yet, as we have learned from past experience, there are more important issues at work in the marketplace than the latest fashion trends.\" \"However convoluted your logic is, I have to admit that making a fashion statement should be a matter of personal taste and preference,\" said Royce, reflecting for a moment on the gravity of the situation. \"The affected individual must ultimately, rationally, and creatively decide for himself which role he is to play. Others will judge him accordingly, however wisely, collectively and humanely.\" \"Finders, keepers,\" said Alexis Sue, having been briefed about the operation on the following day. \"Losers, weepers!\" \"Right,\" said Cornelius Korn, the most far-sighted and trustworthy member of the group of long-time business associates. \"Except, we should have something to trade of equal value, for a win-win situation all the way around.\" \"They lost their investment capital in a volatile trading day on Wall Street. Our contact in Washington will square the deal. Shall we move on to new business?\" asked Royce. He was growing impatient. \"Okay, done deal, said Korn. \"By the way, do you know anything about the latest fighter jets?\" he inquired, casually changing the subject. \"Not much,\" said Royce. \"You'd need a squadron of military pilots to brief you.\" \"I can't help you in that department, either,\" said Meghan. \"I've retired and lost my FAA certification.\" \"In that case, we should stick to strictly civilian pursuits,\" said Korn. \"Keep a low profile and our feet firmly planted on solid ground.\" \"Agreed,\" said Royce. \"I think we're running low on ammunition, anyway.\" \"We can always fall back and resume work on our mining interests,\" suggested Alexis Sue. \"Let's do it,\" said Meghan. \"We're all out of hyper-sonic projectiles.\" \"We pull the plug on this operation, as of now,\" said Korn. \"I'll notify Washington.\" \"See you back at the ranch,\" said Royce.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jim Collins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFILZY6EZ54A4B72GS3UEGSOVJ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30YENK2X5FLL5?ASIN=B07DHR7427",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Best non-fiction spy thriller ever written",
                "reviewText": "Wild that I grew up while a lot of this was happening... Great story about someone who risked his life to change the world for the better.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ella Mc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUZH3IET2UJ5HQWU5YELKMV7JKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MFJOXI54DSYS?ASIN=B07DHR7427",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Second time reading",
                "reviewText": "And it's even better this time. The spy story is amazing, as always with Ben Macintyre and the personal cost is nearly impossible to imagine. That's why I only used 4 stars. I wanted more on the deep personal cost here. Much like Kim Philby who was revered in the USSR, drinking and completely alone, but always a hero, I felt a lot of pain about where our great hero landed, and they seem very similar. Aldrich Ames gets uncritical \"master spy\" status here, when he was mostly just an amazing example of the CIA's ineptitude. There is no discussion at all about Robert Hanssen over at the USSR section of the FBI, also selling people out to the exact same Soviet spy master at the exact same time.Thankfully the Brits do a better job than my own country on this front. In any event, the more I read of this period, the more amazing that anyone made it through alive. The Soviets had a virtual library of spies in the US on whom to call, and the UK did right to not tell the US. Only CIA hubris caused the massive loss found here, not some super talented Rick Ames. (Read A Spy in Plain sight for a quick gloss on the huge number of Soviet and Russian spies in the US IC at this time. It is terrifying.) And after rereading this history, I find the idea of Ames as superior in any way more infuriating. Ames was lucky, and Oleg Gordievsky was .... not lucky, that the many US intelligence services apparently couldn't figure out who was an obvious problem, despite Ames basically showing the evidence in every way possible.Sorry, after reading this true story, I find the lack of humanity and pure greed of Ames especially galling. I may never get over it.However this book is a good example of how, at least in this case, the Brits did a textbook job of caring for their Joe, and how US hubris nearly killed him anyway. Read it, anything written by Ben Macintyre is always worth reading, sometimes more than once!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charles Brooks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYCVMNGE2NU22NO762SNDFN4DOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8BBGRLKT28Q?ASIN=B07DHR7427",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Page turner",
                "reviewText": "I really liked that this one was based on a real person. The background story was really interesting and held up the whole book. Highly recommend if you enjoy spy craft. This one is the real deal.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William D Copenhaver",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ3T5RVOB3MZ3I76U4PTJ2SI5MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HZXHGLCXKE2P?ASIN=B07DHR7427",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars interesting",
                "reviewText": "Great story and details of this interesting figure in history. It is amazing all that he was able to reveal.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYDDKP2MU2BQ4HZN5J34TY45O7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29KBGCM6OQLHI?ASIN=B07DHR7427",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars sad and inspiring",
                "reviewText": "You cannot admire and honor Oleg. He was able to rise above the false doctrines of Communism and see the human spirit longing to be free. To be free to make their own decisions and sources of enjoyment and progress. So much courage and self control is hard to imagine. All of what he did was so so good. The cost to him was so, so sad. All that was dear to him was the price he paid.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQAKW5C5NLQEFAEMGIZ7HLW6DHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWIEIC1OH89F?ASIN=B07DHR7427",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Good Book",
                "reviewText": "Good Book if you like spy and true stories. Would recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joseph Kaback",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 19, 2023",
                "reviewTitle": "great read",
                "reviewText": "Loved this book. Most interesting and educational about spying at the top level of governments of Britain and Russia. The story moves at a quick pace especially the last third when it was impossible to put the book down. If you want to learn how a spyoperates, read this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 16, 2023",
                "reviewTitle": "Intrigante",
                "reviewText": "Excelente novela basada en una historia real. Increíble la intervención de la nteligencia de la Unión Soviética para crear ideologías extremas en varios países que afectan la política de desarrollo económico de libre mercado y las instituciones democráticas de las naciones. Interesante que aún en la actualidad sucede.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gustavo Andrés Lorenzi Mendez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 12, 2023",
                "reviewTitle": "Best book ive ever read, not including selfhelp books",
                "reviewText": "very well written and detailed by the author / gives a whole overview about the Cold War / exciting and tense.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MR2020",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Poland on January 21, 2024",
                "reviewTitle": "Great book for all interested about Cold War",
                "reviewText": "What is incredible about this true-life spy story is that you can read it like a classic novel, as it never slows its pace. This captivating espionage tale is a real page-turner. What struck me most in this book is how likeable the main character really is.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leiding Chen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 12, 2023",
                "reviewTitle": "top quality! it said like new, it is indeed like new!",
                "reviewText": "top quality! it said like new, it is indeed like new!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}