{
    "remaining_requests": 826,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Remember-Love-Ravenswood-Book-1/dp/B09T5BM3BF",
    "body": {
        "name": "Remember Love: Ravenswood, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Remember-Love-Ravenswood-Book-1/dp/B09T5BM3BF",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ghxW5VaeL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mary Balogh",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Mary+Balogh"
        },
        "brand": "Mary Balogh",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3053,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The handsome and charismatic earl of Stratton, Caleb Ware, has been exposed to the ton for his clandestine affairs—by his own son. As a child, Devlin Ware thought his family stood for all that was right and good in the world. They were kind, gracious, and shared the beauty of Ravenwood, their grand country estate, by hosting lavish parties for the entire countryside. But at 22, he discovered his whole world was an elaborate illusion, and when Devlin publicly called his family to account for it, he was exiled as a traitor. So be it. He enlisted in the fight against Napoleon and didn't look back for six years. But now his father is dead, the Ware family is broken, and as the heir he is being called home. It's only when Gwyneth Rhys—the woman he loved and then lost after his family banished him—holds out her hand to help him that he is able make the difficult journey and try to piece together his fractured family. It is Gwyneth's loyalty, patience, and love that he needs. But is Devlin's war-hardened heart even capable of offering her love in return? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Romance-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13371"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "12 hours and 9 minutes"
            },
            {
                "name": "Author",
                "value": "Mary Balogh"
            },
            {
                "name": "Narrator",
                "value": "Rosalyn Landor"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "July 12, 2022"
            },
            {
                "name": "Publisher",
                "value": "Recorded Books"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09T5BM3BF"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,045 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #118 in Historical Romance (Audible Books & Originals) #2,707 in Historical Romances"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Betty Stover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5QLTOTG67RXVVU46RFL2PYZYXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ8IH8H22LKLW?ASIN=B09T5BM3BF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent read.",
                "reviewText": "I enjoyed this book and Remember Me. I am looking forward to reading Ben’s story when it is in paperback.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shesha Randall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJFRHXASHV4FTYIVOCWNFRYNJFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNJS22R7VLTTU?ASIN=B09T5BM3BF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 20, 2023",
                "reviewTitle": "4.0 out of 5 stars INTROSPECTION THE HEART OF THE NOVEL",
                "reviewText": "As a Mary Balogh fan, I found this novel a little daunting at times. Gloomy perhaps. But as always her writing is superb in every way, bringing to life the interaction of a group of people, when faced with a challenging event. Something which might affect even people in today's world! Never an easy situation to face!But the introspection of the main protagonists, is written with such depth and understanding of human nature, that it is absolutely inspiring. The romance is there, as complex, and yet as simple as the problems encountered. Her description of events, and finer details of the period, make it easy to lose oneself in a different world, where emotions run deep even in the minor players. Where love between individuals emerge to support loved ones, and ultimately to heal damaged souls.I would certainly recommend this book.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenny Lange",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2VHPGMF3SSAKRXMDMADE7CVF6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSNC9XMONXF58?ASIN=B09T5BM3BF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Loved every moment",
                "reviewText": "Wow! I have not loved one of Mary's books as much since Slightly Dangerous. While others may have found it too descriptive and wordy, I loved every moment. I really got to know the characters and the setting and feel like the Ware family are actually people I know. A tortured hero is always my favorite and Devlin fit the bill! I am anxiously awaiting reading about the entire family - especially Ben (sigh). Great start to what I am anticipating being a wonderful couple of years of delicious reading.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQEFK4WDBLXFDVU2AJG4FZLRWMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RARVK7TWV37EH?ASIN=B09T5BM3BF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2022",
                "reviewTitle": "5.0 out of 5 stars Five stars but so dully repetitive",
                "reviewText": "Mary Balogh is always a five star writer compared to the competition. But her themes have become stupidly and dully repetitive … as others have explained much more eloquently than I… And by the way, I take my hat off to the early excellently written reviews of this book : some of you should seriously try your hand at becoming authors yourselves!Back to ‘Remember Love’…Sorry Mary but can you not find even one story without the angle of unfairly disgraced hero (or heroine) being slowly redeemed by ‘love’…?The inner talk of the H and h… unutterably uninteresting… much ado about nothing. Or is this just …reality…?I am two thirds through this anticipated new book … and nothing but stilted conversations … suppressed grief … misguided duty… serious unreality …O for the privilege to be a superlatively titled and rich gentleman … that is so utterly weighed down by nobility and burning seriousness… that he breaks apart his whole family’s illusions in one furious moment, and then cannot bear even thinking of his siblings or parents for six whole years … acting the paragon of mindless soldierly integrity … All this, when his life instead, could have been extravagant enjoyment of his privileges… if only he would deign to be human …Is such a man believeable? Certainly impressive in his stubborn adherence to unflinching action over feeling… but identifiable as a real person … no. I am reminded of the Shakespearian line on Romeo: “Why such a man is he, he is a man of wax..!”And the heroine is otherworldly in her perfection - when such weighty subjects are addressed, such a paragon of virtue is… convenient?Perhaps Mary’s brilliance as writer, in spite of the low entertainment value of this book, is that she convincingly shows us that outliers such as this man exist, and can be … redeemed by love …?Will read on and hope it gets sunnier😊",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lydia Main",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHEE5UJ2JBMKQUQMXNBORJ7BHZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MMNRDCOGNN11?ASIN=B09T5BM3BF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Redemption",
                "reviewText": "It's a lovely story of what the true meaning of giving one's self to another. The honest meaning of allowing everyone respect and allowing them to help each other. Devlin and Gwyneth are torn apart by the dishonesty of his family. The price was felt by all. Devlin was almost distorted, as were his younger brother and sisters. Feelings and love, will it be possible to regain a happy life?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Book Rdr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECTDXTUEZYL3FCPFW3IFN7HBLHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8MY13ZUQE8PO?ASIN=B09T5BM3BF",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "3.0 out of 5 stars A lot of filler",
                "reviewText": "I love Mary Balogh but this book is a boring slog for the first 119 pages. The first chunk is an info dump on every family member and the setting. Then you get every excruciating detail of what must be the longest and dullest summer fête ever held. The MCs both think about the same topic multiple times.It’s too easy to excuse the overuse of detail as the need to set up the series. An editor should have used the red pen a little more thoroughly on this, but I guess they don’t care because they know it will sell with Ms. Balogh’s name on it.I really hope book 2 is better, though I hesitated to pre-order it based on this book. If it’s not better, I give up on this series. Life is too short.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bobbie Jo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJY3XHIRD2W3PM337PRC2WTSQPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROLZSCR94G62W?ASIN=B09T5BM3BF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2022",
                "reviewTitle": "4.0 out of 5 stars A doomed love affair turns into the gentlest & most earnest romance I've read this year",
                "reviewText": "Kicking off a brand new Mary Balogh series, this heartrending and unexpectedly thought-provoking historical romance is the most gentle and soft I have read this year, even though I didn't expect it to turn out that way. I was left with that sweet feeling of contentment that can only come with the sigh you breathe with the perfect happy ending. And wow, what a set up for a series this book is.Have patience in the first act, because it is essential to understand each member of the Ware family (of Ravenswood Hall) and their relationships with one another for the climax that comes not at the end but in the second act. And what a climax. It serves as the context for the rest of this novel, and the foundation for those to follow.Mary Balogh can write a male main character like no other, and she returns to one of her (and my!) favorite male archetypes -- a returning soldier from the Napoleonic Wars.Woven throughout this mutual pining, second chance romance (yes please!) are a number of poignant and timely themes including truth, honesty, integrity, loyalty, acceptance, forgiveness, hope, and, of course, the power of love in the shaping and changing of people's lives.I can't wait for the next one, but I've got my fingers crossed for Ben or Stephanie!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amelia306",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 22, 2022",
                "reviewTitle": "Another great book!",
                "reviewText": "I thoroughly enjoyed this novel. Her storytelling is so good that you are drawn into, and lose yourself in, the story. She is a master at painting pictures with words and the characters and dialog are so believable. I have read almost all of Mary Balogh's books and I have loved them all. This one is no exception and it's not an exaggeration to say she is, hands down, the best regency romance author ever!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Helen Musson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 21, 2024",
                "reviewTitle": "Brilliant!",
                "reviewText": "Brilliant!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Iwona Jagla",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 1, 2023",
                "reviewTitle": "Very disappointing read.",
                "reviewText": "Not the Mary Balogh of her earlier books. The spark just isn't there.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine Henderson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 9, 2024",
                "reviewTitle": "Remember Live",
                "reviewText": "I liked everything about this book. It was a love story but it was also about family. It showed how someone is really not the person you thought they were and how it can affect multiple people in the future. Just a great read. Can’t wait to read more of Mary BaloghNovels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nanie g",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 17, 2023",
                "reviewTitle": "I love all her work",
                "reviewText": "I loved the way the author shaped the life of two family’s over a longer period and recorded all the changes. It’s a believable story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}