{
    "remaining_requests": 809,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bonfire-Night-Anna-Bliss-ebook/dp/B0C15XTD6H",
    "body": {
        "name": "Bonfire Night: A Gripping and Emotional WW2 Novel of Star Crossed Love",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bonfire-Night-Anna-Bliss-ebook/dp/B0C15XTD6H",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91uarNiSi-L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Anna Bliss",
            "link": "https://www.amazon.com/Anna-Bliss/e/B0BGSXWVKQ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 52,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“A most tender work of art...Bonfire Night is a treasure of a novel, beautifully written with the unflinching style and subtle psychological insights of such masters as Ian McEwan and Graham Swift.” –Natalie Jenner, internationally bestselling author of The Jane Austen Society and Bloomsbury GirlsSpanning from England's anti-fascism protests of 1936 through the aftermath of WWII, this moving, intricately wrought historical novel brings together a young Irish Catholic photographer and a British Jewish medical student, each discovering the price of love, art, and ambition…London, 1936: At twenty-one, Kate Grifferty is a press photographer in a Fleet Street agency, an unusual job for a young woman. But Kate is both talented and daring, recklessly going wherever the story might be—including, one October day, to an anti-fascism protest in East London. There, she meets David Rabatkin, a brilliant Jewish medical student. While his idealistic brother is eager to go to Spain and join the fight for the Republic, David knows where his path lies: at home, fulfilling the expectations of his profession and his family. Kate is exposed for the first time to the dangers and demands of David’s world, where marrying within the Jewish faith is seen as not only preferable, but key to survival. Kate neither expects nor wants to be any man’s wife, hampered by convention. And though she and David are both outsiders, as war looms, other differences between them are thrown into sharp relief.Brighton, 1940: Catastrophe forces Kate to flee London and the onslaught of war finds her working at her sister’s seaside boarding house, while David tends patients at a busy London hospital as the Blitz rages. But Kate’s challenges and disappointments have only deepened her desire to capture images of life unfurling around her, the beauty and violence, struggles and surprising joys. And soon fate and ambition will align, providing her with the chance to make her mark at last . . .",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C15XTD6H"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ A John Scognamiglio Book (December 26, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ December 26, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4846 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 372 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#400,829 in Kindle Store (See Top 100 in Kindle Store) #414 in Jewish Literature (Kindle Store) #802 in Jewish Literature & Fiction #1,028 in Historical World War II Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 52 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e6d93cae-fd61-49cb-9526-22c06993fa80.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/46f8fc9d-b698-4452-9ee5-5894fa03df0b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6df77aa4-0d1b-41f9-8339-a35d6a881da1.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lovemybooks2020",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5VC43Y4HQ6U3LSIJQASPKZFXNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NDPFVMTYV6JG?ASIN=B0C15XTD6H",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Amazing historical fiction!",
                "reviewText": "𝗛𝗮𝗽𝗽𝘆 𝗧𝘂𝗲𝘀𝗱𝗮𝘆!⁣“If you are a fan of Kate Quinn or Kristin Harmel, pull up a chair and settle down with Anna Bliss’s propulsive debut 𝘽𝙤𝙣𝙛𝙞𝙧𝙚 𝙉𝙞𝙜𝙝𝙩. Wonderfully written and exquisitely researched, the work is a rare look into the rise of fascism in London preceding World War II, while exploring the costs of both love, female ambition and the lengths we will go to in order to make our mark on the world.“ —Jo Piazza⁣⁣“A most tender work of art, providing a heartrending look at a couple in love while the world implodes and explodes around them. With the eye of a painter, Bliss uses the finest of brushes to vividly and crisply depict her characters while displaying an astonishing breadth of compassion for the situations in which they must struggle and persevere. 𝗕𝗼𝗻𝗳𝗶𝗿𝗲 𝗡𝗶𝗴𝗵𝘁 is a treasure of a novel, beautifully written with the unflinching style and subtle psychological insights of such masters as Ian McEwan and Graham Swift.” –Natalie Jenner⁣⁣Spanning from England’s anti-fascism protests of 1936 through the aftermath of WWII, this moving, intricately wrought historical novel brings together a young Irish Catholic photographer and a British Jewish medical student, each discovering the price of love, art, and ambition…⁣⁣Thanks @suzyapprovedbooktours and @annablissauthor for my gifted copy! I love historical fiction and this book was wonderful! I always learn so much from each ww2 book that I read. This one was no exception, it was engaging, suspenseful, beautifully written, and an emotional love story. This book puts her right up there with the historical fiction greats!⁣⁣",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alice E. Traugott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHOPOAL2DRIMYUXR7ZAXM4ROAJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KV3WT79D4AAQ?ASIN=B0C15XTD6H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Very well-written and Compelling Story",
                "reviewText": "The characters and setting in Bonfire Night are so compelling and relatable - especially in light of the events occurring now in 2024. I enjoyed this book so much - I hated for it to end. I am looking forward to the next book written by Ms. Bliss. Definitely an author to watch!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Subakka.bookstuff",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKOS35YKTE4A7QDXHJWKRSOOL7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R238AIVYPB0LRU?ASIN=B0C15XTD6H",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars A complicated love story in a turbulent time",
                "reviewText": "This was an eye-opening look at England's political and cultural landscape during the late 1930s—especially the rise of fascism and the subsequent anti-fascism protests.The story follows Kate Grifferty, a woman photojournalist - which is rare, who is driven to prove herself and advance in her career. She crosses paths with David Rabatkin in East London at an anti-fascist protest. Kate is there to get a great photo; David is coming from the hospital, where he is a medical student, to meet his brother.The two were not looking for love; both were ambitious and had careers ahead of them. Even more of an obstacle: Kate is Irish Catholic, while David is Jewish.This is undoubtedly an emotional and complicated love story during a turbulent time. I enjoyed that Kate is a strong-willed woman, and the descriptions of her work are fascinating.Although not surprising, it’s always heartbreaking to see how much racism, antisemitism, and division always existed everywhere, no matter what was going on in the world.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ST826",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6NMTQGNE3DRAM7IT73UZR7MU3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O2B9UMDFDIBT?ASIN=B0C15XTD6H",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "3.0 out of 5 stars It’s alright",
                "reviewText": "Review: Bonfire Night by Anna BlissWhile parts of this book were interesting, emotional, and heart-breaking it was, unfortunately, slow and almost boring at parts. The main character was unlikable for me, despite her being developed well over the first part of the book. There were some fascinating insights and well told parts, but overall I didn’t love this book. There was some unnecessary spice to it as well. I’m interested to see where this author goes after after this debut novel, you can tell she’s researched well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "New author Anna bliss has come out with her first book and I’m amazed how well she not only sets the scene of amazing part of history and the character development. Loved the story and connection between them and kept me coming back for more. Can’t wait for her next book! ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHAHU2VE5ISCKQ67NDUX6TWV27A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPLQKUWR2ONLW?ASIN=B0C15XTD6H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Beautiful story set in a turbulent time",
                "reviewText": "The backdrop of ww2 sets the stage for beautiful connections through conflict in and around the personal development of both people. Loved it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TarheelreaderTarheelreader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3YGB6D6EUYULD75MM2DPGW4A2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2N7MDEXKS2QGL?ASIN=B0C15XTD6H",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Swept up in this story",
                "reviewText": "Bonfire Night is the story of Kate and David starting out with each of their early lives. David is Jewish and Kate is Catholic, when the meet at an anti-fascism protest in London. Kate is a press photographer in a male-dominated field, and David is a medical student (and later doctor). Eventually they part ways and life has a way of moving on, but their story is long from over.Bonfire Night has tension, suspense, and lots of history set during the tumultuous and harrowing years of 1936 and 1940. Overall, it’s a well-written historical novel with a strong romance and a memorable cast of characters. It kept me on the edge of my seat at times, and I was truly swept up in the journey from start to finish.I received a gifted copy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715tL++XM9L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}