{
    "remaining_requests": 1008,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Undertakers-Assistant-Amanda-Skenandore/dp/1496713680",
    "body": {
        "name": "The Undertaker's Assistant: A Captivating Post-Civil War Era Novel of Southern Historical Fiction",
        "price": "$9.75 $3.03",
        "originalPrice": "$16.95",
        "rawPrice": 9.75,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Undertakers-Assistant-Amanda-Skenandore/dp/1496713680",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91AGbYjW18L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Amanda Skenandore",
            "link": "https://www.amazon.com/Amanda-Skenandore/e/B07CK4V2Q5/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by Goodwill of Dayton Ohio.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 5020,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 16 hrs 6 mins",
            "$3.99 delivery Tuesday, February 27.",
            "Or fastest delivery February 22 - 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Kensington (July 30, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1496713680"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1496713681"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.43 x 0.85 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#26,093 in Books (See Top 100 in Books) #658 in Coming of Age Fiction (Books) #2,382 in American Literature (Books) #2,472 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 5,020 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Linda Weber",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDCEJTY2HUPIVY3J2IHV32JYXFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AC82IFLEC45V?ASIN=1496713680",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2019",
                "reviewTitle": "5.0 out of 5 stars Fans of Historical Fiction Must Not Miss this Illuminating Page Turner",
                "reviewText": "When I was a young girl I read Johanna Spyri's Heidi. I couldn't stop crying after I read the last page, not because it ended sadly but because there was no more. I was so deeply enmeshed in the lives of the characters I couldn't accept that, for me, their lives ended with this story.The Undertaker's Assistant, the second novel by author Amanda Skenandore, affected me in precisely the same way. I could barely force myself to put the book down and go to bed. I rushed back to the pages as soon as I arose each morning. I wept copious tears when I read the last page. I was so thoroughly involved in the lives, emotions, successes and failures of each character in this story it felt as if I was tearing off skin to let them go.Ms. Skenandore has succeeded in penning yet another book that should be a best seller by any yardstick that includes literary fiction. Her writing is so steeped with honesty, so well researched, and so poignantly laid upon the page as to elevate the reader to a new level of understanding, sympathy, empathy and intellect.The main character, Effie, and all the auxiliary characters will be forever inscribed upon my mind and indeed, my very soul. This author succeeds in framing every scene with words that evoke every sense from sounds to smells to emotions and everything in-between. You cannot read this book without being carried back in time to another place; you cannot go on this journey without experiencing the wounds our society inflicted on so many and is still inflicting, without remorse, on the descendants of the people these characters are built upon.The book is so relevant to the here and now of conversations going on in our current political climate, the upcoming election, the pain filled and hurtful rantings of those without empathy for the suffering of other human beings.I loved this author's first book, Between Earth and Sky, that dealt so deftly with the travesty of assimilation of the Native American population via Indian Boarding Schools, for it's sensitive portrayal of the human cost of \"helping\" the \"other\" in society through the tender and ill-fated romance of the main characters. This book, The Undertaker's Assistant, opened my eyes to a period of history I knew little about, Reconstruction after the Civil War. Effie and Samson and Tom and Adeline and Jonesy and so many others spread across this period of history in such a natural and believable way under Ms. Skenandore's able pen. Their lives were fraught with trauma, rising above their beginnings, falling into easy and strangling relationships without a thought, the everyday carrying on of life's routines, successes, disappointments, human weaknesses and human strengths. The longing to know who we are, where we came from and where we are going was upfront and present throughout the story. Feelings of emptiness, not fitting in, falling deeply and inexplicably in love, entitlement, prestige, debasement and as many others as you can conjure are all present and accounted for. This is a book that will make you feel and make you think. It will expand your grasp of a period in history that continues to trouble us today. I hope it will make you feel something you haven't felt before.I know this author is a nurse, but her grasp of what an Undertaker does blew the doors off. What detailed explanations and descriptions, what a nuanced portrayal of the need for detachment, what wonderful skill in taking the reader into an unseemly experience and actually making us watch with sensitivity. This type of thing makes me squeamish but the author brought me into this part of the story with the necessary detachment to avoid those feelings. She's good.TheA negative? Perhaps for me, because I don't speak French, the frequent use of french phrases interrupted my thoughts and feelings from time to time as I tried to decipher the author's intent or meaning. And vocabulary unique to the time forced me to stop and look up a word much more often than I am used to. I think I have a good vocabulary and a good education until I read something by Amanda Skenandore! I can't wait for her next book.",
                "reviewVotes": "79 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "YetiJedi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXWHOX2LBPEM4YFLAB6ZYJVRAIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVX1EXU7GRZJ1?ASIN=1496713680",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "4.0 out of 5 stars A remarkable addition to post-civil war historical fiction",
                "reviewText": "I loved this take on the Reconstruction era of the South. I thought the timeline of Effie's memory was well-paced and emotionally sound. The most serious thing that happened between her and Samson felt very out of character, but that was my only quibble with the events. I've never read a book from an embalmer's point of view, so that was really interesting. Recommended!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZRLOTA3OEYRBITRVFMOJXS5VZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WZM1H04AHJJR?ASIN=1496713680",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Interesting read",
                "reviewText": "Engaging, unusual story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy S Borgsmiller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLVVVP5FVCH2UHHMALCU4ZHUG2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EG0KH4EWP2TF?ASIN=1496713680",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 28, 2023",
                "reviewTitle": "3.0 out of 5 stars A Different Perspective",
                "reviewText": "I didn't live in the post civil war era, and most documentaries I have watched were not told from the African American perspective. This novel, The Undertaker's Assistant, tells the story of a young black woman, in New Orleans, about 10 years after the Civil War. Effie is skilled in embalming and she returns to the south after the war to reconnect with her past.I found this book to be an interesting read. The author, Amanda Skenandore, referenced events from that era and location. It would have been helpful if she had included more information in her text. I found myself frequently looking up background facts, so that I had a better understanding of matters.I do enjoy historical fiction and think most people would like this book.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOCK2WY372ORQ37L5CCHPZQUXWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D68B9163NSK0?ASIN=1496713680",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Very good story about an unusual woman during post reconstruction Louisiana.",
                "reviewText": "Getting to know Euphemia Jones is like peeling back the layers of an onion. Effie is a 7 yr old runaway slave who fled to a camp of Union soldiers. She is taken in by the camp saw bones and learns to be his assistant. Later she learns the undertaking trade and helps many black women and men. In so doing she finds her own family and history.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPRT4WZAS7RQOYIPM6TT3D32XZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27IGMURJMXM2Y?ASIN=1496713680",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Interesting Twist",
                "reviewText": "Effie’s journey to remember her past through her present is filled with palpable emotion. The fear and sadness rips at your heart while the gut wrenching and then sweetness take turns. This book was written so that you feel just enough. This was my first historical fiction experience and I find myself seeking out more. While the slavery aspect was mentioned and the horrors of the treatment of slaves mentioned, it was still a tame description. Enough that your mind knew how bad it was going to get without the author putting words on the paper.Overall it was a good read. The characters had depth and various backgrounds. Though I was a bit disappointed with the lack of time spent on the relationship changes between Effie and Mr. Whitaker.I would recommend this to someone looking for a book with less traditional and vibrant romance but still wanting a bittersweet ending of love lost and found.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Hastings",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2H5N2O3ER7GNSKMX7TNPUKQUHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DCSYAQH2HYUY?ASIN=1496713680",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great story, well written!",
                "reviewText": "Enjoying reading it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dawn ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWL7UUA5KR45L6TKNCX7TFZQDYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OTF9RHY9XTTW?ASIN=1496713680",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Love the photo",
                "reviewText": "Arrived on time. Great condition, nicely packaged. I bought this because the story seemed reall interesting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Novak",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 7, 2023",
                "reviewTitle": "Gets under your skim",
                "reviewText": "The writer let's you live the life of an intelligent black woman after the civil war.Painful but you 'll be glad you read it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patty",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 11, 2023",
                "reviewTitle": "great setting",
                "reviewText": "The main character is a freed slave who is an embalmer. the book starts about 11 years after the Civil War, when Effie moves to New Orleans from Chicago where she's lived since she was little.The writing isn't particularly good and the plot is pretty stupid, but the setting during reconstruction, and the background events, are interesting enough to make it worth reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}