{
    "remaining_requests": 1004,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Women-Novel-Kristin-Hannah/dp/1250178630",
    "body": {
        "name": "The Women: A Novel",
        "price": "$19.19",
        "originalPrice": "",
        "rawPrice": 19.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Women-Novel-Kristin-Hannah/dp/1250178630",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/5112eIqM9pL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51lxx68FRXL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kristin Hannah",
            "link": "https://www.amazon.com/Kristin-Hannah/e/B000APANXE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 7081,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ St. Martin's Press (February 6, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 480 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250178630"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250178633"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.44 x 1.44 x 9.56 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1 in Books (See Top 100 in Books) #2 in Family Life Fiction (Books) #2 in Historical Fiction (Books) #3 in Women's Domestic Life Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 7,081 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2402cf13-3e37-487c-a5a8-2bdb9a9f1a29.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dde85af6-5288-470d-945e-98223560bdbc.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e02bc411-2fdf-40e3-b0e5-dcfa3ea9f1d8.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1960cc1f-00a6-4abb-be0f-14e0420ef8fd.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f7c8de91-41ff-4435-88bf-57fb80c99a93.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CeleneCelene",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFZPCT2A2UEJGA7TATGQTTHLHGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YHF60GQ3BYRE?ASIN=1250178630",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Absolutely amazing! An easily, well deserved 5 star read!",
                "reviewText": "Kristin Hannah is back, baby!!! In a world where The Nightingale is numero uno I am here to tell you The Women gives it a run for its money!What an emotional rollercoaster ride! In true Hannah fashion, she rips your heart apart and mends it back together but with this one she did it to me several times. In a span of two pages, mine was pieced together just to be shattered again. But the ending. Oh my goodness. That ending. 🥺❤️Historical fiction has always been a favorite of mine, but the last year or so I haven't really focused on it. I knew when I saw this book releasing I was going to read it and with the high praise I saw right off the bat even before its release, I had a feeling I, too, was going to love it. But I also was hesitant, because Historical Fiction hasn't been my go to lately. It can seem daunting to me at times. They are usually based on true stories and real people, so you know it is going to be an emotional ride. You just don't know if you are ready to embark on that journey or not. If you know what I am talking about or have felt similar, I am here to tell you, do not let that hold you back on reading this book! This book has the emotions of a romance novel, the edge of your seat tension like a thriller, and it is an absolutely must read for everyone! Please don't let this one pass you by. Even if historical fiction is not your normal go to genre, I promise this one is worth it!Hannah's writing is something magical. You are immediately hooked and transported to this world she has created on page one. In our world of reading books, there are good writers, there are bad writers, and then there are phenomenal writers. And Kristin Hannah, my friends, is a phenomenal writer!! When you read her books, you are seeing the words play out inside your head so easily, you feel like you are watching a movie. She is cinematic and that is how I know this book is going to translate so well to screen. How can it not with the foundation she has provided them?? (Yes, Warner Bros. has picked this up for a film! 🙌)So many HF novels focus on WWII. I love those books just as much as the next person, but it is so refreshing to get a different time period, especially from a queen like Hannah. I know nothing of the Vietnam War. I do remember seeing footage of how some people reacted and their opinions of the war, but not to the depths this book takes you on. Or how women were treated that were veterans in this war. That was eye-opening and heart wrenching, but sadly not surprising.Yes, this felt personally for me. As a nurse and a former ICU nurse, I love when we get a protagonist that is also in my field. But this book gutted me and made it feel like Hannah personally dug deep into my soul and stirred up feelings I had buried down deep with this one. I was wrecked. Like sitting in a Mexican restaurant with people all around with tears streaming down my face wrecked while reading this book. I can't tell you the last time a book emotionally wrecked me like this one did. Now I am not saying everyone will have that visceral reaction. In fact most probably won't, but I am just telling you that is the response this book got from me. 😅 As usual, I went in blind not knowing what this book was about. I saw high praise and great feedback so I was excited, but like I said earlier I wasn't expecting this response from reading it.If you'd like to know a short synopsis of the book, it centers around a combat nurse, Frankie, who as recently graduated from nursing school, and despite her parents' protests and disappointment she has joined the Army to assist as a combat nurse in the Vietnam War. You watch Frankie transform from a naive, young girl who is in way over her head into a straight rockstar and that is something I think everyone in our field can relate to despite all of us not being in a similar predicament she is in.It is divided into two parts. Frankie's experience during the war and when she comes home. That was another unique take that I appreciated from the author. So many books stay in the combat part of war. Rarely have I read one where you go with the protagonist when they come back home and deal with the \"After\" part. There are some triggers, so if you want to know more about those feel free to reach out!I've never read a book centered around the Vietnam War, so I am extremely grateful Hannah chose this time period to write this amazing novel. And if you haven't gathered it already, I highly recommend this book for everyone. You are simply doing yourself a disservice if you skip over it. Period.**Also fun fact and as if i couldn't love this book anymore, my name made an appearance in the book. Granted it was spelled different (Celine), but it was still a pleasant surprise. ☺️",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715Q368rhoL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stay At Home Shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHUTJ656INTVRQVUA25VWY25NKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHXF3JDNGQLK8?ASIN=1250178630",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars ⭐️⭐️⭐️100 STARS⭐️⭐️⭐️",
                "reviewText": "No one, and I do mean NO ONE, weaves a story together into a beautiful tapestry quite like Kristin Hannah. I’ve been looking forward to this book’s release for months simply because I know this about the author. Every single one of her books I’ve read has taken me on an incredible journey to another time that has left me reeling in some unimaginable way. And this one did not disappoint. I completely devoured it over the past two days.I am grateful for the hours upon hours of research, including what must have been riveting first-person accounts from women and men who were there to experience this time in history, that Kristin Hannah undoubtedly dedicated into creating this beautiful masterpiece of a story. She makes it feel real. Genuine. Meaningful. And it deserves 100 stars, at least.Why?It’s absolutely brimming with palpable emotion. Every laugh, every tear, every dream, every struggle, every love, every fear, every sorrow, and every heartbreak felt by Frankie was real and raw and untethered within me. It was the best kind of connection a reader can possibly feel with a character.It’s absolutely brimming with a part of history that I simply did not know, was never taught in school — the Vietnam War era. The vivid description of Frankie’s time as an Army nurse “in country” was brutal and horrific and utterly shocking, which made it all the more believable and relatable. My heart pounded through the mortar attacks and constant gunfire and bombings. My ears echoed with the thwump, thwump, thwump of the helicopters bringing push after push of wounded soldiers in for emergency treatment. My eyes burned with the imprint of gushing blood and severed limbs and eviscerated bodies of those wounded, terrified, crying soldiers. Some were saved. Most were lost. All were important. And my heart broke every time Frankie held a dying soldier’s hand, promising to write to his wife. Or his girlfriend. Or his sister. Or his mom.It’s absolutely brimming with the shameful reality that our Vietnam Veterans faced when they returned home from duty. Spat on. Ridiculed. Jeered at. Hated. By their fellow Americans, no less. They were heroes, but they were treated as second-class citizens. Peons. It’s appalling and unfathomable to me.Finally, it’s absolutely brimming with strong, heroic, kick-a$$ women. Women who shared a life-altering experience that was the best time of their lives. And the worst time of their lives. Women who had to fight to be seen upon their return stateside. Women who had earned a place at the heroes’ table, but were repeatedly rejected and dismissed by society. Women who had to forge their own new paths and relearn their place in the world around them. Women who, through it all, formed an unbreakable bond of friendship — a sisterhood — that crossed all the boundaries and lasted all the years of their lives. #TheWomen",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 13, 2024",
                "reviewTitle": "All the stars!",
                "reviewText": "As I've come to expect from this author, this book is powerful. I'm a Canadian who grew up during the time period discussed. I was 7 when John Kennedy was assassinated and 12 when Bobby and MLK were assassinated. At that part, I started reading the paper and watching the news every day. I was a teenager through the Vietnam War era and shed tears over Kent State and all the atrocities of the awful war they were in. I remember reading about how the returning vets were treated. I knew young girls who \"went to visit an aunt in another city\" for a few months and came back looking very subdued. This book brought to life that era (and it's amazing musical soundtrack) again in my heart and my mind. I shed tears. It all rings true. What a brilliant job of giving us characters we can so easily see and hear in our minds and giving us a story line that sounds like it couldn't possibly be true - yet many of us know that it's absolutely true. Well done!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tawnimara",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 11, 2024",
                "reviewTitle": "the women",
                "reviewText": "What a fantastic book. Couldn’t put it down and it’s so true. Everyone and I mean EVERYONE should read it. Well down Kristin! Well done.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "russell parkes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 16, 2024",
                "reviewTitle": "brilliant how true it is",
                "reviewText": "The turning point of things to come little did we know at the time the lies the deceit sad in way",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Agnes Jackson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 15, 2024",
                "reviewTitle": "Fascinating time",
                "reviewText": "I find stories that are written a time in history that actually live in/through very interesting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patricia Manina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 11, 2024",
                "reviewTitle": "Fabulous Book",
                "reviewText": "I love this author and enjoyed all the books of hers that I have read. I highly recommend this touching, factual and historically informative book. I would highly recommend it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}