{
    "remaining_requests": 834,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Queen-Hereafter-Novel-Margaret-Scotland-ebook/dp/B003E8AJ9M",
    "body": {
        "name": "Queen Hereafter: A Novel of Margaret of Scotland",
        "price": "$1.99",
        "originalPrice": "",
        "rawPrice": 1.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Queen-Hereafter-Novel-Margaret-Scotland-ebook/dp/B003E8AJ9M",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/9170IJr6YFL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Susan Fraser King",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_ebooks_1?ie=UTF8&field-author=Susan+Fraser+King&text=Susan+Fraser+King&sort=relevancerank&search-alias=digital-text"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1344,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B003E8AJ9M"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Crown; Reprint edition (December 7, 2010)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ December 7, 2010"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5766 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 354 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#76,721 in Kindle Store (See Top 100 in Kindle Store) #78 in Historical Biographical Fiction #105 in Historical Scottish Fiction #365 in Medieval Historical Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,344 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "N Spuh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSSMMHHEULHDFUC66VN3TYWAFCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3II05U1VDPCTY?ASIN=B003E8AJ9M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars secular book about a saint",
                "reviewText": "This book is about Saint Margaret of Scotland, but she is not identified as a saint in the book. The book is about a charitable queen who had her strengths and weaknesses. She wanted to become a nun, but was forced to marry. If you are careful with what your daughters read, the wedding night description was a little more detailed than necessary for the teenagers who will be reading this. Pros: the battles were not too bloody, she was realistic in that she had her struggles, and there are good secondary characters. It is also written in an old-style language, but not so that it is hard to understand.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Regan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYEUWECWULYH4TFRYYSLKWHK66Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35HSJ08CWB5O2?ASIN=B003E8AJ9M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2015",
                "reviewTitle": "4.0 out of 5 stars The Beauty and the Beast, or a Saint Marries a Scot",
                "reviewText": "This is a fictional account of the real Margaret of Wessex who became Queen of the Scots in 1070. The author focuses on the early part of her marriage to Malcolm, King of Scots. The marriage was, by all historical accounts, a great love story and Malcolm was smitten at first sight of her, yet you won’t read about it here. Instead, there is a fondness that develops between them over time as Malcolm comes to admire his saintly queen.The story begins in 1069 as Margaret and her family seek sanctuary in Scotland at the time the Conqueror is ravaging Northumbria. Margaret desired a convent life but it was not to be. According to this story, Malcolm ignored her for weeks after she came to his court but then decided to wed her. I found that hard to believe, a virile Scottish warrior ignoring a beautiful Saxon princess right before his eyes. Then, too, the description of Malcolm and Margaret’s wedding night was a dull moment that I just couldn’t quite see happening the way it was described given all we know about the two of them. But, ah well.Malcolm was known to be illiterate and Margaret read to him; however, in this story he was reading treatises on law when she met him and she just taught him more. Margaret is portrayed as history records her: devout, smart and committed to seeing Scotland turn toward the Roman church. Though she was kind to her subjects, she did not appear to adopt the Scots’ culture. Instead, she gave her children decidedly English names and Malcolm went along with it, presumably to indulge his wife who brought him much honor.Perhaps the most interesting character, at least to me, was Eva, the daughter of Macbeth's stepson and heir, Lulach, who was slain by Malcolm in order to gain the throne. Taken to Malcolm’s court as a hostage, Eva has spunk, dividing her loyalties between her family who wants her to spy for them and the queen she has befriended. I really liked Eva. She is the only other character whose perspective we have besides Margaret. We are never inside Malcolm’s head and he remains something of an enigma.King’s attention to detail is laudable and she brings 11th century Scotland to life. It’s a fairly tame but well-told story of the Scot who married the woman who became Scotland’s only royal saint. We get to see how she might have been with those who served her and those she served for she was ever doing charitable acts. It proceeds at a leisurely pace and historical fiction lovers will find it a worthy read.",
                "reviewVotes": "60 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Rothwell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7EQ5VNR7BOW3IEI2C6OGIIVBUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33PN3EMJICWOT?ASIN=B003E8AJ9M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 1, 2012",
                "reviewTitle": "5.0 out of 5 stars A wonderful novel set in the eleventh century",
                "reviewText": "This is a lovely and beautifully written novel of Queen Margaret of Scotland that has opened up a whole new era of history for me. My interest has been sparked, and I want to know more of Margaret, Malcom and their legacy. This novel was very well-written, and the author painted a wonderful picture of wild and rustic Scotland and all it's natural beauty. Even her descriptions of the castles and churches were poetic. Susan Fraser King has truly brought history to life in these pages, and I loved every word.I found Margaret to be an expertly crafted central character, as we are able to see her as a living, breathing woman--a wife and a mother--and not just as a Queen and a saint. Knowing that Margaret was later named a saint by the Church is fascinating to me, and made reading this novel all the more enjoyable. Margaret is purely human and is shown to have many faults, as we all do, and yet through her acts of charity and kindness it becomes easy to see why she was regarded so highly. It casts a different light on the concept of a \"saint\". This novel has given me much food for thought regarding that.One of the nicest touches in this novel was the inclusion of primary sources: translated quotes from medieval texts. They were a really great addition to the main body of the novel. Also, the author's note at the back was very interesting and showed the author's passion for the era. I just love reading the words of someone who loves history as much as I do.I definitely recommend this novel, and it will always have a spot on my shelf.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SherrinB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHRVB2BVSGLCJWBPBFKI2K6H33Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EMJWEDY1IYQK?ASIN=B003E8AJ9M",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 3, 2017",
                "reviewTitle": "3.0 out of 5 stars It took me ages to finish reading this well-researched book.",
                "reviewText": "I knew nothing about Queen Margaret of Scotland, which is why I had selected this book. My biggest surprise was that her royal family came from Hungary. Ms. King's novel definitely filled me on the struggles between England, Scotland, Wales and the mistrust of each with the other. From the character Eva I learned about the life of a Welsh harpist and the place of music in a warrior's household. The descriptions of the daily lives of women in this household were details that brought home how constricted they were. Strong Margaret had a knack for working around that. She transformed an ill-kept, ill-run castle into a home for the ambitious King Malcolm. Her days were informed by her impressive regimen of prayer as she adjusted to married life although she felt suited to a cloistered life.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BlueBird1212",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTTFH5MMC7CZUXUZOQCQMKLBE5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31407KYPRM4PL?ASIN=B003E8AJ9M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 8, 2021",
                "reviewTitle": "5.0 out of 5 stars Loved it!",
                "reviewText": "I am a person who remembers history best when told in a story and that's why I really love historical fiction. The author brought this time period to life. There are so many little details that lets the reader create the time period in their mind and really see how people lived back then. Sainted Queen Margaret is a role model for a lot of us and this book did a wonderful job of highlighting why she was sainted and why many women, wives, mothers, and widows cherish her memory. Many thanks for a job well done. I have read most everything I can find on Queen Margaret and feel that I have gotten the most out of this well written historical fiction. If you like Queen Margaret you will most certainly love this book. Tapadh leibh airson sgeulachd cho breagha. Tha gaol mòr agam air. ~ Ogha don Bhanrigh Mairead :)",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SCS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 6, 2016",
                "reviewTitle": "Enjoyable and accurate picture of a saint and a rebel.",
                "reviewText": "Writing about a saint is difficult. It isn't easy to make someone so perfect interesting. However by weaving the story of the famous Saint Margaret, Queen of Scotland with the fictional account of a hostage, Eva , who is a Celtic Bard, we get two interesting women with two different points of view on life. Queen Margaret, wife of the Malcolm who is triumphant at the end of Shakespeare's Macbeth, is a true medieval woman. She is extremely devout, denying herself food and rest in order to purify her soul in the interest of achieving forgiveness for her sins. Eva, on the other hand, is the illegitimate daughter of a Scottish warrior king. She is as rebellious as Queen Margaret is devout. Eva is also that rare but not unknown phenomenon of a Scottish female Bard and harpist. These two very different women, hostage and queen, find common ground and make an alliance with each other. This history takes you through the violent time when William the Conqueror was taking over England and fighting with Scotland. The author gives you a glimpse of what that must have meant to the peoples of Great Britain and has a wonderful eye for accurate historical detail. This book is worth reading for the history and also for the well-developed characterizations of two interesting women. You won't be disappointed.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy McFarlane",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 11, 2016",
                "reviewTitle": "An excellent piece of historical writing.",
                "reviewText": "What an absolutely marvellous story. It is so well written with oodles of factual and historical information on this much loved but private lady. I read it in one sitting after I had finished the first; Lady Macbeth, which this sort of follows on from. It is so refreshing to read stories from this era which are not written too often, if they are they're usually more brutal tales from the killing fields of those times. This was well paced, absorbing and I couldn't put it down at all until I had reached the end several hours later. Highly recommended and I hope she has more in the same vein to write about in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "I. A. Peden",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 14, 2018",
                "reviewTitle": "Queen Margaret, Malcolm Canmore, Macbeth and Gruadh ( lady Macbeth).",
                "reviewText": "Many a wee Scots boy or girl was taught about Queen Margaret and Malcolm III , Canmore, and this novel certainly brings back the innocence of a Scots primary school history lessons of the 1950's. The Saintly Queen Margaret coming from Hungary , bringing order to the King who killed Macbeth in Battle! A great story for innocent minds.!Unfortunately, age brings a sceptical colour to the reader, and , I would have preferred a much more nuanced picture of Margaret and Malcolm, with , Queen Margaret hopefully portrayed as more than the ever praying saint , who washed the feet of the poor!However, I , like many Scots, I have been brought up with the romance of Queen Margaret, the brutality of Malcolm Canmore, Macbeth and then there was ............Gruadh ( lady Macbeth).I , like many Scots cannot escape the Histories taught in my early years..........and this book will bring back many a memory.Hopefully, Queen Margaret was not far different from this romantic story ........but I doubt it !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DOROTHY CARMICHAEL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 17, 2015",
                "reviewTitle": "Four Stars",
                "reviewText": "It was interesting to find out more of Margaret of Scotland even in a fictionalized form",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Val P. Red Deer Ab Canada",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 30, 2017",
                "reviewTitle": "Enlightening",
                "reviewText": "A history lesson without the dryness. I truly enjoyed this story. Found it very hard to put down. Thank you Susan",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}