{
    "remaining_requests": 855,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Iliad-Gareth-Hinds/dp/0763696633",
    "body": {
        "name": "The Iliad",
        "price": "$13.29$13.29",
        "originalPrice": "",
        "rawPrice": 13.29,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Iliad-Gareth-Hinds/dp/0763696633",
        "soldBy": {
            "sellerID": "A2XF5HY28Z1YOG",
            "name": "Goodwill of Colorado",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2XF5HY28Z1YOG"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51rKgAZtqBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61oyeQFlWvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61KqnHwrhjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61qNc irQgL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gareth Hinds",
            "link": "https://www.amazon.com/Gareth-Hinds/e/B001IXQ1X8/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Goodwill of Colorado",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 983,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review In his latest graphic novel adaptation of a classic text, Hinds (The Odyssey) condenses Homer’s epic poem of gods and mortals at war, covering most of the major events and adding supplemental material that expands the story slightly beyond the original...The most striking scenes are the battles, presented in intimate detail and in awe-inspiring, sweeping overviews. Hinds’s relatively plain language retains just enough meter to hint at the cadences of the work, and, together with the dynamic art, creates an accessible entrée to an enduring classic.—Publishers Weekly (starred review)Clear scaffolding, well-chosen abridgements, readable prose, and stunning art invite readers into this exceptionally compelling version of the episode of the Trojan War handed down through Homer’s Iliad...Readers who have struggled to follow the poetry of the standard text or to become emotionally invested in a summary will have no such difficulty here; Hinds has truly produced an easy-to-follow, engrossingly cinematic blockbuster on the page.—Bulletin of the Center for Children's Books (starred review)\"Sing to me, O Muse, of the rage of Achilles\": a rousing graphic rendition of Homer's great epic...An expertly crafted rendition and a welcome invitation to younger readers to immerse themselves in the ancient past.—Kirkus ReviewsThis modern graphic novel retelling of Homer’s epic immediately draws in readers with its artistry and readability...This is a well-done adaptation of an important, thought-provoking poem.—School Library ConnectionAs with his treatment of The Odyssey (rev. 11/10), Hinds offers an ambitious and compelling comics adaptation of a Homerian epic...By highlighting the efforts of the goddesses, along with amending Helen’s understanding of her role in the war, Hinds makes an effort to address the story’s inherent hypermasculinity, reminding readers that “the war is the work of angry gods and angry men.”—The Horn BookArrestingly, Mr. Hinds depicts the meddling immortals in translucent, sugary Easter-egg colors. This initially whimsical-seeming decision has the effect of highlighting the mocking distance between the fickle, impulsive Olympians and the flesh-and-blood men and women who pay the price for divine caprice on the earth below...Those who know the epic will find an engrossing and rewarding account: gory, affecting, unforgettable.—The Wall Street JournalUnpacking ‘The Iliad’ as a reader is one thing; adapting it for comics is a hurdle of a different magnitude. Enter Gareth Hinds, the Vermont-born artist who has reworked literary classics from Shakespeare, Edgar Allan Poe and more. His magnificently realized graphic telling of ‘The Iliad’ — in its wealth of muted watercolored hues and evocative landscapes — condenses a more than 20-book-length poem into 251 pages of narrative comics. It follows an equally sweeping interpretation of “The Odyssey,” which had a loose, sketchbook-style look as compared with its spiffy successor.—Los Angeles TimesThis is no mere comics adaptation of an ancient classic. Through his intricately illustrated panels, Gareth Hinds brings us The Iliad’s depth, brutality, and power. A Herculean effort worthy of the original.—Gene Luen Yang, Michael L. Printz Award winner for American Born ChineseWith his graphic novel retelling of The Iliad, Gareth Hinds has created a work of such scope and power that it boggles my mind. It truly lives up to the — dare I say it — epic scale of the original poem.—George O’Connor, author of the New York Times best-selling Olympians series About the Author Gareth Hinds is the acclaimed creator of the graphic novels The Odyssey, Poe, Beowulf, Macbeth, Romeo and Juliet, The Merchant of Venice, and King Lear. He lives near Washington, D.C."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 48 mins",
            "$3.99 delivery Wednesday, February 28.",
            "Or fastest delivery February 23 - 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In a companion volume to his award-winning adaptation of The Odyssey, the incomparable graphic novelist Gareth Hinds masterfully adapts Homer’s classic wartime epic.More than three thousand years ago, two armies faced each other in an epic battle that rewrote history and came to be known as the Trojan War. The Iliad, Homer's legendary account of this nine-year ordeal, is considered the greatest war story of all time and one of the most important works of Western literature. In this stunning graphic novel adaptation — a thoroughly researched and artfully rendered masterwork — renowned illustrator Gareth Hinds captures all the grim glory of Homer's epic. Dynamic illustrations take readers directly to the plains of Troy, into the battle itself, and lay bare the complex emotions of the men, women, and gods whose struggles fueled the war and determined its outcome. This companion volume to Hinds’s award-winning adaptation of The Odyssey features notes, maps, a cast of characters, and other tools to help readers understand all the action and drama of Homer's epic. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17466"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Candlewick; Illustrated edition (March 12, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 272 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0763696633"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0763696634"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 years and up"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN910L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.86 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.75 x 0.75 x 10.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,606 in Books (See Top 100 in Books) #23 in Epic Poetry (Books) #32 in Teen & Young Adult Greek & Roman Myths & Legends #248 in Fantasy Manga (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 983 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Gareth Hinds’ companion volume to his graphic novel of The Odyssey",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/62294ad0-4cb8-4a73-b7ef-08c151a87f21._CR0,0,970,300_PT0_SX970__.jpg"
                ]
            },
            {
                "media_text": "Features notes, maps, a cast of characters, and other tools to help readers understand all the action and drama of Homer's epic",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bdc4c917-9856-46ac-8709-be9041b5cff4._CR0,0,970,300_PT0_SX970__.jpg"
                ]
            },
            {
                "media_text": "The Iliad The Odyssey Romeo and Juliet Read all of award-winning Gareth Hinds's stunning graphic novel adaptations! More than three thousand years ago, two armies faced each other in an epic battle that rewrote history and came to be known as the Trojan War. Renowned illustrator Gareth Hinds masterfully adapts Homer’s classic wartime epic. Fresh from his triumphs in the Trojan War, Odysseus, King of Ithaca, wants nothing more than to return home to his family. Instead, he offends the sea god, Poseidon, who dooms him to years of shipwreck and wandering. A New York Times bestseller! When Romeo and Juliet first meet, they don’t know they’re from rival families — and when they find out, they don’t care. How much will they have to sacrifice before they can be together?",
                "media_link": []
            },
            {
                "media_text": "Macbeth Beowulf Poe: Stories and Poems At the urging of his wife, Macbeth resolves to take the throne by the most direct path: a dagger in the heart of King Duncan. But is Macbeth prepared to commit more murders to keep the crown? Hinds brings Shakespeare's classic tragedy to life. Grendel’s black blood runs thick as Beowulf defeats the monster and his hideous mother, while somber hues overcast the hero’s final, fatal battle against a raging dragon. Beowulf’s heroic saga finds a true home in this graphic-novel edition. In a thrilling adaptation of Edgar Allan Poe’s best-known works, Hinds translates Poe's dark genius into graphic-novel format. The seven graphic narratives amplify and honor the timeless legacy of a master of gothic horror. Ideal for Halloween!",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/62294ad0-4cb8-4a73-b7ef-08c151a87f21._CR0,0,970,300_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bdc4c917-9856-46ac-8709-be9041b5cff4._CR0,0,970,300_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/203027df-7e36-4add-82c0-8f6c499f2b7a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c21f155c-216d-41ec-a52e-b2487aa49c9d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/992319f4-8376-47e5-bc09-8b9582fb9bbc.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8c58bfb8-fb7c-484e-b357-6e60fee83686.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ee16f59-a93f-4cbe-a51e-a5e855df5973.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/307cf0d9-660e-4464-b55d-ad2edd10c997.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Diane Sweeney (Pt. Loma)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUOOBKH2HWO3UEW4V7JFF62JPSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R290LR0807UOGY?ASIN=0763696633",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Totally legitimate version of this great poem.",
                "reviewText": "I think this graphic novel is FANTASTIC! It is a totally authentic version of the Iliad for any reader. The author’s notes clarify that the Iliad was written several centuries after the fact of the Trojan War and that the story had been passed down as poem and song in a long oral tradition. It was eventually written down, probably by several “bards of the Homeric tradition.” There are several translations of the Iliad so there is not any definitive “original.”As a scholar and teacher, I generally want students to read original works of literature but, when I see the depth of detail and the close adherence to what we believe to be the “original” author’s intent and meaning in Gareth Hines’ graphic historical novels, I think they are outstanding versions of fine literature for teens and adults.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janet L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPZQRS4AVHPISNQWTUJ44U7NBLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HLJIW3CWMFPG?ASIN=0763696633",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Book arrived in great condition",
                "reviewText": "This graphic novel of the Iliad was in good condition as the seller stated. It looks brand new and I am sure my grandson will enjoy it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAF7BR2ATPT6UFFPYR76LLQOGRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37LADMYX0VNIP?ASIN=0763696633",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Great read!",
                "reviewText": "This is a great read for middle school-high school. Tells the story but includes amazing graphics that add to the storytelling. Def recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deane Rynerson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLGBGZQA3EMFIXIGKWIKEPRF27Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKSVQRX7OB7B8?ASIN=0763696633",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 3, 2023",
                "reviewTitle": "5.0 out of 5 stars A Dramatic and Excellent Adaptation",
                "reviewText": "Having never actually read the Illiad, I was intrigued by the prospect of a graphic novel adaptation and I found this to be a very engaging read. The art style maintains the right amount of realism to maintain the weight of the original work and the novel captures the drama and emotions extremely well. It makes the Illiad feel like a war story, which is arguably what it always was, showing the valor of those who fight, but also emphasizing the loss and tragedy of such brutal conflict, making sure to name every warrior lost in the fighting for example. Definitely recommended if you're a graphic novel fan or are interested in a unique version of the Illiad.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lydia C. Janning",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGQ5NX5Z4TNNYX7AWRD2YAAG2AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QW5YNLI7A0C4?ASIN=0763696633",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 1, 2023",
                "reviewTitle": "4.0 out of 5 stars ease of understanding",
                "reviewText": "The graphics are wonderful. I would have liked all the plates in color",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs. Wang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOI2AZMNWXXL6JNMFGX7PTGLESQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V8UCXBAORRHH?ASIN=0763696633",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 12, 2019",
                "reviewTitle": "5.0 out of 5 stars Thank you, Mr. Hinds! Mission accomplished!",
                "reviewText": "First of all, I am biased: I believe that The Iliad is both the pinnacle and the foundation for all Western literature, and one of life's great joys for me was learning to read the immortal words of Homer in ancient Greek when I was a teenager. So imagine the thrill of seeing those immortal words translated into a graphic format! This is a complex tale, told in complex language, with an impossibly wide cast of characters in a culture that seems far away from our modern world, and yet it all comes alive on the pages of this graphic novel, just as relevant to our current events now as it was almost 3000 years ago. I am the parent of two students with learning challenges, and I am using this book to make the classics accessible to them. There is nothing simple or easy about the Iliad. The author streamlines the story somewhat, and uses different types of visual cues and reader guides to facilitate reading comprehension. At the same time, the author uses many of Homer's narrative tricks to bring specific moments to life. This book does contain plenty of violence, human trafficking and references to rape (it's about a war), so parents should exercise their judgement about appropriateness for children or young teens. It's approximately a 7th grade reading level. But it's ideal for getting young adventure-lovers hooked on heavy-hitting literature - definitely not for the Charlotte's Web crowd. As soon as the book arrived on my doorstep, I went straight to the scene of Priam clasping the knees of Achilles, and it was exactly as I'd hoped, exactly as Homer describes it. That scene answers some of life's big questions: How do you forgive the unforgivable? What does it mean to be human? What does anything mean? The author's artwork includes some archaeological touches from the time period of the Trojan War, very nice to see. The overall effect is stunning, and captures the spirit of Homer's epic poem. I didn't think the author could possibly top his editions of Beowulf, King Lear or The Odyssey, but here it is: the cornerstone of Western literature. Highly recommended for adults, teens and tweens who are curious about this ancient tale.",
                "reviewVotes": "71 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel Aguilar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESIY24PYJMCISEEMFTXLIM2MU7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P0TIZ329D82R?ASIN=0763696633",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Makes Illiad more digestible",
                "reviewText": "Illiad is over 2,500 years old. This version made it more understandable (and palatable) for my middle schooler!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bjorn OlafssonBjorn Olafsson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHSGIFWBTOJ3HFPOSPAB24QDPEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IJ3OGLKQPD7V?ASIN=0763696633",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 28, 2019",
                "reviewTitle": "5.0 out of 5 stars Absolutely stunning. A masterpiece.",
                "reviewText": "Gareth Hinds has successfully captured the essence of The Iliad, and arguably even more impressive, at the same time made the story accessible to a much larger audience than ever before. On top of this, the story retains it's artistry, so the reader is treated to a high quality retelling, which while using basic English, does not condescend to the reader.Mr. Hind's works are excellent for teaching these stories to English learning students in ELA classes, or in ESL classes. They would even benefit a reader who is reading a translation of the original text, who may be unfamiliar with the history, or the conventions of literature of Antiquity.Even the illustration clearly involved careful consideration and attention to detail, and walks a balance between accuracy to the text and historical context, and assisting the reader to visualize the action. For example, in the interest of allowing the reader to more easily recognize major characters, the first letter of their name is cleverly and subtly worked into the character's armor or vestments. Also, all of the Greeks wear read, while the Trojans are all clad in blue.It is hard to overstate the value of this master work by Hinds. There is no reader of the Iliad who cannot appreciate the deep level of respect with which Hinds has treated Homer's epic.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81Y7mAhVvML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mauricio Rene Ponga de la Torre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 29, 2023",
                "reviewTitle": "Great book for kids",
                "reviewText": "My 9 year old boy loves this book. The characters and the drawings are so cool that many other families asked me to borrow the book. Definitely I will buy the companion book the odyssey",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Placeholder",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 16, 2019",
                "reviewTitle": "Great effort",
                "reviewText": "It's a feat to make a graphic novel of a complex epic. Well done. The artwork could have been better.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "luisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 16, 2019",
                "reviewTitle": "Muy bien",
                "reviewText": "Todo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeronimo Caballero",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 12, 2019",
                "reviewTitle": "An excellent retelling of a classic tale",
                "reviewText": "A picture is worth a thousand words, and this version of the classic tale is full of detailed images, drawn with love. Hinds doesn't limit himself to merely telling the story, he also shows us maps of the ancient locations, and provides a detalied explanation of the context of this famed trojan war. He provides a near exhaustive list of all the characters involved, and their respective feats (or defeats) in the plains of ancient Troy. Some consider this attention to detail as detrimental, but I consider it entirely positive.This is not necessarily a children's book (though it is rather child friendly) as it is full of blood and violence, and some sexual references, though never in a distasteful manner.In conclusion, this new adaptation by Gareth Hinds a great, innovative version of the classic tale. Filled with both words and images, it captures the depth of The Iliad while also captivating our minds with wonderful illustrations. Do not pay attention to the bad reviews, this is a very enjoyable version, well worth the price. Even as an 8 year old, I believe I would have greatly enjoyed this book. Reccommended for all lovers of history, greeks (or achaeans as Homer called them) and ancient battles.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marianna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 30, 2021",
                "reviewTitle": "Stellar interpretation",
                "reviewText": "A superb interpretation of a classic tale, read with my 9 year old - it's rather bloody but it exposes the absurdities and futility of war so well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.30",
                "sellerName": "All American Textbooks",
                "sellerRating": "4.5"
            }
        ]
    }
}