{
    "remaining_requests": 870,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wild-Lasses-Highland-Beasts-Highlander-ebook/dp/B0CPC4DS77",
    "body": {
        "name": "Wild Lasses and Highland Beasts: A Scottish Medieval Highlander Romance Collection",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wild-Lasses-Highland-Beasts-Highlander-ebook/dp/B0CPC4DS77",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81GJSO0z18L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lydia Kendall",
            "link": "https://www.amazon.com/Lydia-Kendall/e/B07G4CV1FJ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 148,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Three cruel Highlanders meet their matches in lasses that refuse to submit to them…Enraptured by the HighlanderWhen her brother’s murderer is captured in their dungeons, Adelaine starts visiting the Highlander to find out more. But Caelan is innocent. And if they don’t find the real killer, Adelaine’s father will soon execute the man she fell for…Healing the Tormented HighlanderEntrusted with a crucial mission to guard a mysterious key, healer Ceana approaches Laird Raghnall, and sparks fly. But she is soon faced with a devastating choice: fulfill her promise to her dead parents, or stay with her one true love?The Revenge of the Highlander’s BrideDetermined to save her family from ruin, Margery travels to Scotland, only to be captured by a brutish Laird, Darach. And even though they don’t trust each other, they can’t deny the sizzling passion threatening to engulf them…*Wild Lasses and Highland Beasts is a steamy Scottish historical romance collection. Each book in the series is approximately 90.000 words (around 450 pages). No cheating, no cliffhangers, lots of steam and a happy ending.Get this collection for free with Kindle Unlimited! Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CPC4DS77"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Cobalt Fairy LLC (December 1, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ December 1, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3872 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 967 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#29,256 in Kindle Store (See Top 100 in Kindle Store) #46 in Scottish Highlanders Historical Romance eBooks #88 in Medieval Historical Romance (Kindle Store) #93 in Medieval Historical Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 148 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "DebiKien",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJOJUXYADLCKTUBMIPQUZFCE4HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12KMU2KRWGCG1?ASIN=B0CPC4DS77",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Three Ladies, Three Stories",
                "reviewText": "Three ladies in different predicaments try to find their way to make things right. One laird is declared a murderer facing death, but claims he is innocent. Adelaine decides to find the truth and when she does finds herself in trouble also.Ceana has been forced to be a keeper of a key she has no idea why. Running away she finds herself at Laird Raghneall's keep insisting that she stay there because of the dangers traveling the roads. However, unknown to him the danger lurks withing.Margary was being forced to marry a man she felt was being dishonest with her and her father. Determined to find out what he was hiding she decided to go to a previous area he had lived. However, when she did, she found herself in Laird Darach keep. Deciding to hide who she is she becomes a servant within the keep. Darach finds out her secret and tells her he will aid her but someone else heard the secret and decides to use it to his advantage. ARC Review",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7YATEHKJDNKFL6TIEDNAOZ455A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B2NWPK04UYZ?ASIN=B0CPC4DS77",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Losing More Than Heart",
                "reviewText": "Once again, author Lydia Kendall has delivered and written emotionally charged books! In, “Wild Lasses and Highland Beasts”, details of each character, in each of her three books are written expertly! Wonderful author! Readers are gifted with seeing through her words the emotions and actions of her characters. Book 1“Enraptured by the Highlander”The war between Scotland and England are not new to anyone living in the chaos.Caelan McLagen, Laird of Loch Mahrais, was loved and revered by his soldiers and Clan. It was only after his brother’s passing, did Caelan become laird.At the urgency of their Scottish King, Caelan and other lairds were pressured to add men to the fight against the English. With only subtle promises to provide aid to each Clan that did so, they fought valiantly but were captured by the English.Caelan McLagen, was not only captured by the English, he was also thrust with healing the Earl of Daffield’s son, Peter Watson. An Englishman who had fought against Caelan.Adelaine Watson is devoted to her brother and attempts to please their father. Her father can be staunch and unmoving in his ideas and beliefs.There are hidden agendas, deception, misuse of power, struggles, hatred and lies, confusion, loss of happiness, of love, and life.Great book!Enjoy 🌻 ~~~~~~ Book 2“Healing the Tormented Highlander”Ceana Morvell lives a quiet life in the forest with her grandmother, Maighread Morvell. Maighread is an exceptional healer and raised Ceana to follow in her footsteps. Maighread has always sheltered Ceana.Unfortunately, danger comes to their home. Maighread had sense the danger and forced Ceana to leave immediately, so she could be safe. Never leaving her home before, Ceana is terrified not knowing what to expect.Raghnall MacCramhain, Laird of Mhaol Chalium, is a devoted laird to his clan. After helping Ceana settle in the castle, spending time as her protector while collecting plants and herbs, he begins to have feelings for Ceana and not just physical.Things had started to change around the clans land, and even closer to their village. There is more tension, feelings of uneasiness with more traffic on the roads, and clan land.This book contains, intrigue, secrets, uncertainties, old legends, treason, kidnapping, loss of life, cloaked figures, loss of respect, heartache and a twist we don’t see coming.Great book!Enjoy 🌻 ~~~~~~ Book 3“The Revenge of the Highlander’s Bride”Darach McLeold is Laird of Castle McLeold. His clan knows his honesty, fairness, and his loyalty to his clan. His father’s recent passing made Darach laird before he was ready. His cousin Balgair, who he grew up with, helped the transition and is Darach’s right hand man.Events start to become problematic for Castle McLeold. Darach has his suspicions, but needs proof to resolve matters. Tension from a neighboring laird is also on his mind.Margery Briley, the daughter of Lord and Lady Lashentire wants what her mother and father have found together. Love. Margery has been given permission by her parents, to do just that. Unfortunately, with the passing of her mother, her father now sees that she needs to marry so he knows she will be taken care of.Mr. Ashley Paverton, an acquaintance of Lord Featherly, is introduced to Margery’s father Lord Lashentire, as a possible business opportunity. But Margery isn’t as blind as her father after the loss of his wife.There is suspense, and many twists you may not see coming. Years of lies uncovered, adultery, deception, blackmail, treason, death, heartache, abuse, and plotting with eyes of grandeur. But also, happiness, love, peace, and friendship.Great book!Enjoy 🌻 ~~~~~~",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeanne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4TA2U4Q6TXANDAKZICUW7V3V3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P97XW3SNHVQZ?ASIN=B0CPC4DS77",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Wild Lasses & Highland Beasts",
                "reviewText": "All 3 love stories were very well written & highly memorable! Each story was entirely different from the others but they did have a common theme. In each instance, either the Highland Laird or his English lass discovered that their was a beloved & trusted family member who betrayed them with evil intentions. Fortunately the Laird & his lass always prevailed by working together & had their happily ever after.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tori",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYDXA72BYSGT5B42KIUOIBNM2GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UDBKO769HGP7?ASIN=B0CPC4DS77",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Finding their true loves",
                "reviewText": "Good triumphs over evil with the help of the lasses and their highland loves. Ms Kendall delivers again with delightful tales that keep you enthralled as you read. Don't start it late at night unless you are prepared to lose some sleep as you'll read until the end of the book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Merry Jelks- Emmanuel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDXDVVL6RA7L52M53PRQ22CCRAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TZQXXZYWQVNP?ASIN=B0CPC4DS77",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Great Collection",
                "reviewText": "This collection has three enchanting medieval romances that drew e in and had me all caught up in the stories. They are a great representation of the time period and are descriptively well written and had me feeling like I had taken a step back in time as I read the stories connecting with the characters. I enjoyed all three stories from start to finish.I am volunteering to leave a review for an ARC of this collection.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sierra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOG4DHUGT2OFKUAJ5ZHU4MIBMDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QO3JQDK9BCSL?ASIN=B0CPC4DS77",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Great stories",
                "reviewText": "Really hard to pick a favorite, all were great. I loved each of the main characters. They were strong and once set their minds, they continued, no matter hardships or things in their way. You feel like you are there as they are so descriptive. Buy the book, settle down with a hot chocolate and a throw and enjoy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOYCE FLEMING",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEO3A4T2DIS4BRTB46RTEPNBCGWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XI403529DJMC?ASIN=B0CPC4DS77",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars I couldn’t put it down",
                "reviewText": "What a page turner ! It has everything you could want in a romance novel. Intrigue, violence, love, suspense, and a surprise ending. I loved it. You will too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXFEMW5RPSWLG5ELU3CBSZHBTWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IA8WLWDK2PDL?ASIN=B0CPC4DS77",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "4.0 out of 5 stars Love booksets",
                "reviewText": "I love booksets for a number of reasons but the main one is because I get to sit with my favorite authors for hours on end. There are three beautifully written stories here of couples who are search for their own happiness and joy. Each is an adventure with strong characters, drama, a bit of humor, and lots of romance. I especially love to read these on cold dark nights as I can let my imagination flow without interruption to a place and time filled with new innovations, close knit societies, changes on the horizon and characters that I would love to have as friends. Don't miss out on this set is special.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G.R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 7, 2023",
                "reviewTitle": "love and danger",
                "reviewText": "I just love Lydia's books, they are always a perfect combination of headstrong characters butting heads, sparks flying and a dangerous situation to be solved before the HEA.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marion L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 12, 2023",
                "reviewTitle": "An enjoyable Highlander Romance Collection",
                "reviewText": "Was published books by the author.The plots are captivating with plenty of hot chemistry, intrigue, suspense and mystery. The well-developed main characters are very likeable and they fight for their love.If you like various emotional, suspenseful and steamy historical Highland romances in one book, you will enjoy this collection.ENRAPTURED BY THE HIGHLANDERA fast-paced story with very likeable main characters and a gripping plot that is peppered with romance, deceit, lies and suspense with plenty of twists and turnsAdelaine falls in love with Caelan, who is accused of killing her brother and is being held in her father's dungeon. But who killed her brother and how can Caelan's execution be prevented...HEALING THE TORMENTED HIGHLANDERA riveting story with likeable main characters that will captivate you with romance, hot passion, secrets, deceit, lots of twists and turns and a surprising ending.When her grandmother hands her a key and tells her to flee, healer Ceana lands on Raghnall's doorstep. The two are immediately attracted to each other and sparks of desire fly between them. But Ceana soon realises that her situation has worsened and she has jumped from the frying pan into the fire. And she has to decide whether to leave her lover or stay and fight...THE REVENGE OF THE HIGHLANDER’S BRIDEA good read with likable characters and a gripping storyline layered with romance, mystery and suspense.Margery wants to avenge her family's demise, but falls captive to Darach's men and ends up in Scotland. Darach himself faces his own obstacles. Margery conceals her identity and becomes a maid in his castle.As they fall in love, they are surrounded by intrigue, lies and enemies who try to take control of their lives...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}