{
    "remaining_requests": 942,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Great-Circle-novel-Maggie-Shipstead/dp/1984897705",
    "body": {
        "name": "Great Circle: A Novel (Man Booker Prize Finalist)",
        "price": "$11.02$11.02",
        "originalPrice": "",
        "rawPrice": 11.02,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Great-Circle-novel-Maggie-Shipstead/dp/1984897705",
        "soldBy": {
            "sellerID": "A8146B9Q816MQ",
            "name": "Martistore",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A8146B9Q816MQ&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41G1W6z-faL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31IsqOYTCyL.jpg",
            "https://m.media-amazon.com/images/I/51Vz-WCJE-L._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Maggie Shipstead",
            "link": "https://www.amazon.com/Maggie-Shipstead/e/B007CRE8IY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Martistore",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 15663,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review WOMEN'S PRIZE FOR FICTION NOMINEE • BOOKER PRIZE FINALIST • ONE OF THE BEST BOOKS OF THE YEAR: TIME, NPR, Washington Post, EW, Boston Globe, LitHub, and more“Great Circle is a masterpiece . . . one of the best books I’ve ever read” —J. Courtney Sullivan“A sumptuous epic . . . exhilarating . . . this book delivers a series of ahas, of sweet, provocative points of contemplation that make the reader feel alive.\" —Leigh Haber, Oprah Daily “A soaring work of historical fiction . . . So convincingly does Shipstead stitch her fictional heroine into the daring flight paths of early aviators that you’ll be convinced that you remember the tragic day her plane disappeared. Great Circle is a relentlessly exciting story about a woman maneuvering her way between tradition and prejudice to get what she wants. It’s also a culturally rich story that takes full advantage of its extended length to explore the changing landscape of the 20th century. My top recommendation for this summer.” —Ron Charles, The Washington Post “A feat of a story in every sense.”—Entertainment Weekly“Shipstead's writing soars and dips with dizzying flair . . . With detailed brilliance, she lavishes heart and empathy on every character (save one villain), no matter how small their role. Many authors attempting to create an epic falter at the end, but Shipstead never wavers, pulls out a twist or two that feel fully earned, and then sticks the landing. An expansive story that covers more than a century and seems to encapsulate the whole wide world. ”—Boston Globe “Thrilling . . . Great Circle starts high and maintains altitude. One might say it soars. An action-packed book rich with character . . . Great Circle grasps for and ultimately reaches something extraordinary. It pulls off this feat through individual sentences and sensations—by getting each secondary and tertiary character right . . . What’s so impressive is how deeply we come to care about each of these people, and how the shape and texture of each of their stories collide to build a story all its own. It’s at the level of the sentence and the scene, the small but unforgettable salient detail, that books finally succeed or fail. In that, Great Circle is consistently, often breathtakingly, sound.” —Lynn Steger Strong, The New York Times Book Review “Shipstead’s eye for detail, character and the moments that tell all make this a true literary achievement.”—Zibby Owens, Good Morning America“Great Circle is an epic trip—through Prohibition and World War II, from Montana to London to present-day Hollywood—and you’ll relish every minute.”—People “Swinging from one century to the next, from the moneyed splendor of cities to the shifting Antarctic ice, Shipstead's prose overflows with meticulous detail. Shipstead's intellect and knowledge are on full display . . . One finds twists and surprises, unexpected connections—though the work's ultimate interest mirrors a quality shared by the Graves twins: a natural, boundless curiosity.” —Minneapolis Star Tribune “Bestselling novelist Maggie Shipstead was struggling to depict a female adventurer. So she became one. Shipstead’s debut, Seating Arrangements, [sealed] her reputation as an impeccable craftswoman of upmarket beach reads . . . But the stakes of Great Circle are higher—for its heroine, literally life or death. Though Shipstead never learned to fly herself, she aligned with her main character Marian Graves in more important ways . . . She is interested in testing her limits.” —Los Angeles Times“Glitz and guts square off in Great Circle: a tale of two women set apart by a century, fighting to retain control of their own lives in a society that demands subservience. Shipstead is adept at writing so vividly, the reader can feel the thrill and pain of her characters. Cunningly crafted. . . richly layered, a joy to read . . . riveting.” —The Spokesman-Review “Marian Graves’s 1950s quest, a pole-to-pole route around the globe, will not be truly finished until twenty-first-century Hadley Baxter is cast as the film version of Marian—not because the two women share history, letters, or mementos (those common tropes of historical fiction), but because of their shared dissatisfaction with the patriarchal system guiding their lives . . . A novel with rich prose and even richer symbolism.” —Bethanne Patrick, Virtuoso “In one word: fantastic. Shipstead's writing is absolutely stunning, each character coming to life through her mesmerizing descriptions and masterful imagery. Each high is ridden along with Marian, each low felt intensely and deeply as though it were happening in real-time. Even the most technical details—such as complexities regarding airplanes and machinery—jump off the page, drawing the reader in. Shipstead sets the scene of each location striking beauty and detail . . . She has created a world so unique and filled with such riveting characters that it is devastating to have to leave them behind.” —Ally Kutz, Erie Reader“The Marian portions rove from Montana to Manhattan to Scotland and Antarctica, and read like a carnival of early-20th-century American history, packed with bootleggers, treacherous boxcar rides, and tragic shipwrecks. The Hadley chapters offer a delectable dissection of life as a celebrity, serving up an intelligent skewering of the Hollywood machine and allowing the book to take flight.”—Vogue\"A breathtaking epic . . . This is a stunning feat.\"—Publishers Weekly [starred review]“A fat, juicy peach of a novel . . . A tremendously well-written book, epic in spirit and scope, swooping across continents and through time so effortlessly that it belies the seven years it apparently took to complete.” —The Telegraph [UK]“A sweeping, swashbuckling book, full of colour and grand destiny . . . glorious mythmaking. This is a novel of magnitude in all senses: themes, size, scope and ambition. Its literary wingspan stretches from the tectonic bump-and-grind of the ice age to the erotic imaginings of internet fan fiction . . . The joy of this dynamic, soaring novel is not a welcome extra but its very engine. Most novelists have their limits and cut their cloth accordingly. Shipstead is a writer who can vividly summon whatever she chooses, taking the reader deep inside the worlds she creates . . . Her writing is confident and knowing; her descriptions of light and air sometimes beautiful. Marian Graves is a character so real that I twice googled her to check.”—Financial Times [UK]\"The destinies of [Shipstead's] unforgettable characters intersect in ways that reverberate through a hundred years of story. Whether Shipstead is creating scenes in the Prohibition-era American West, in wartime London, or on a Hollywood movie set, her research is as invisible as it should be, allowing a fully immersive experience. Ingeniously structured and so damn entertaining; this novel is as ambitious as its heroines—but it never falls from the sky.\"—Kirkus Reviews [starred review]“Highly recommended—intricately designed, [with a] compelling cast of characters. As Hadley learns some of Marian’s secrets, readers will wonder how much we can truly know anyone.” —Library Journal [starred review]“Transcendent . . . A rolling, roiling epic . . . Through the interwoven stories of impetuous flyer Marian Graves and flavor-of-the-month actress Hadley Baxter, Shipstead ponders the motivating forces behind acts of daring defiance, self-fulfillment and self-destruction. An ambitious, soaring saga—[Shipstead] takes her characters to dizzying heights, drawing readers into lives of courage and mystery.”—Booklist\"Inherently epic . . .Shipstead sweeps readers from earth to sky and back again . . . Underpinning it all is a reverence for nature, thrumming in the forests of Montana, the jagged peaks of Alaska and the stupefying ice shelves of the Antarctic. Shipstead’s exhilarating, masterful depictions of Marian’s flights feel like shared experiences that invite readers to contemplate both magnitude and majesty. Great Circle is sure to give even firmly earthbound readers a new appreciation for those who are compelled ever skyward.\"--BookPage [starred review] About the Author MAGGIE SHIPSTEAD is the New York Times-bestselling author of three novels and a short story collection. Her novel Great Circle was shortlisted for the Booker Prize and is currently a finalist for the Women’s Prize. She is a graduate of the Iowa Writers’ Workshop, the recipient of a fellowship from the National Endowment for the Arts, and the winner of the Dylan Thomas Prize and the L.A. Times Book Prize for First Fiction. She lives in Los Angeles. Excerpt. © Reprinted by permission. All rights reserved. Little America III, Ross Ice Shelf, AntarcticaMarch 4, 1950I was born to be a wanderer. I was shaped to the earth like a seabird to a wave. Some birds fly until they die. I have made a promise to myself: My last descent won’t be the tumbling helpless kind but a sharp gannet plunge—a dive with intent, aimed at something deep in the sea.I’m about to depart. I will try to pull the circle up from below, bringing the end to meet the beginning. I wish the line were a smooth meridian, a perfect, taut hoop, but our course was distorted by necessity: the indifferent distribution of islands and airfields, the plane’s need for fuel.I don’t regret anything, but I will if I let myself. I can think only about the plane, the wind, and the shore, so far away, where land begins again. The weather is improving. We’ve fixed the leak as best we can. I will go soon. I hate the never-ending day. The sun circles me like a vulture. I want a respite of stars.Circles are wondrous because they are endless. Anything endless is wondrous. But endlessness is torture, too. I knew the horizon could never be caught but still chased it. What I have done is foolish; I had no choice but to do it.It isn’t how I thought it would be, now that the circle is almost closed, the beginning and end held apart by one last fearsome piece of water. I thought I would believe I’d seen the world, but there is too much of the world and too little of life. I thought I would believe I’d completed something, but now I doubt anything can be completed. I thought I would not be afraid. I thought I would become more than I am, but instead I know I am less than I thought.No one should ever read this. My life is my one possession.And yet, and yet, and yet.Los AngelesDecember 2014I only knew about Marian Graves because one of my uncle’s girlfriends liked to dump me at the library when I was a kid, and one time I picked up a random book called something like Brave Ladies of the Sky. My parents had gone up in a plane and never come back, and it turned out a decent percentage of the brave ladies had met the same fate. That got my attention. I think I might have been looking for someone to tell me a plane crash wasn’t such a bad way to go—though if anyone actually ever had, I would have thought they were full of shit. Marian’s chapter said she’d been raised by her uncle, and when I read that, I got goose bumps because I was being raised (kind of) by my uncle.A nice librarian dug up Marian’s book for me—The Sea, the Sky, etc.—and I pored over it like an astrologist consulting a star chart, hopeful that Marian’s life would somehow explain my own, tell me what to do and how to be. Most of what she wrote went over my head, though I did come away with a vague aspiration to turn my loneliness into adventure. On the first page of my diary, I wrote “I WAS BORN TO BE A WANDERER” in big block letters. Then I didn’t write anything else because how do you follow that up when you’re ten years old and spend all your time either at your uncle’s house in Van Nuys or auditioning for television commercials? After I returned the book, I pretty much forgot about Marian. Almost all of the brave ladies of the sky are forgotten, really. There was the occasional spooky TV special about Marian in the ’80s, and a handful of die-hard Marian enthusiasts are still out there spinning theories on the internet, but she didn’t stick the way Amelia Earhart did. People at least think they know about Amelia Earhart, even though they don’t. It’s not really possible.The fact that I got ditched at the library so often turned out to be a good thing because while other kids were at school, I was sitting in a succession of folding chairs in a succession of hallways at every casting call in the greater Los Angeles area for little white girls (or little race-unspecified girls, which also means white), chaperoned by a succession of nannies and girlfriends of my uncle Mitch, two categories that sometimes overlapped. I think the girlfriends sometimes offered to take care of me because they wanted him to see them as maternal, which they thought would make them seem like wife material, but that wasn’t actually a great strategy for keeping the flame alive with ol’ Mitch.When I was two, my parents’ Cessna, which my dad was flying, crashed into Lake Superior. Or that’s the assumption. No trace was ever found. They were on their way to a romantic getaway at some friend’s middle-of-nowhere backwoods cabin to, as Mitch put it, reconnect. Even when I was little, he told me that my mother wouldn’t quit fucking around. His words. I’m not sure Mitch believed in childhood. “But they wouldn’t quit each other, either,” he’d say. Mitch definitely believed in taglines. He’d started out directing cheesy TV movies with titles like Love Takes a Toll (that was about a toll collector) and Murder for Valentine’s Day (take a wild guess).My parents had left me with a neighbor in Chicago, but their last will and testament left me to Mitch. There wasn’t really anyone else. No other aunts or uncles, and my grandparents were a combination of dead, estranged, absent, and untrustworthy. Mitch wasn’t a bad guy, but his instincts were of the opportunistic, Hollywoodian variety, so after he’d had me a few months, he called in a favor to get me cast in an applesauce commercial. Then he found my agent, Siobhan, and I got consistent-enough work in commercials and guest spots and TV movies (I played the daughter in Murder for Valentine’s Day) that I can’t remember a time I wasn’t acting or trying to. It seemed like normal life: putting a plastic pony in a plastic stable over and over while cameras rolled and some grown-up stranger told you how to smile.When I was eleven, after Mitch had stepping-stoned from movies of the week to music videos and was white-knuckle climbing into the indie film world, I got my proverbial big break: the role of Katie McGee in a time-travel cable sitcom for kids called The Big-Time Life of Katie McGee.On set, my life was squeaky-clean and candy-colored, all puns and tidy plotlines and three-walled rooms under a hot sky of klieg lights. I hammed it up to a braying laugh track while wearing outfits so extravagantly trendy I looked like a manifestation of the tween zeitgeist. When I wasn’t working, I did pretty much whatever I wanted, thanks to my negligent uncle. In her book, Marian Graves wrote: As a child, my brother and I were largely left to our own devices. I believed—and no one told me otherwise for some years—that I was free to do as I liked, that I had the right to go any place I could find my way to. I was probably more of an impetuous little brat than Marian, but I felt the same way. The world was my oyster, and freedom was my mignonette. Life gives you lemons, you carve off their skins and garnish your martinis.When I was thirteen, after the Katie McGee merch had started selling like crazy and after Mitch had directed Tourniquet and was rolling around in success like a pill-popping pig in shit, he moved us to Beverly Hills on our shared dime. Once I wasn’t stuck out in the Valley anymore, the kid who played Katie McGee’s big brother introduced me to his rich dirtbag high-schooler friends, and they drove me around and took me to parties and got in my pants. Mitch probably didn’t notice how much I was gone because he was usually out, too. Sometimes we’d bump into each other coming home at two or three in the morning, both messed up, and we’d just exchange nods like two people passing in a hotel corridor, attendees at the same rowdy conference.But here’s a good thing: The on-set tutors for Katie McGee were decent, and they told me I should go to college, and since I liked the sound of that, I weaseled my way into NYU after the show ended, with substantial extra credit for being a B-list TV star. I was already packed and ready to move when Mitch overdosed, and if I hadn’t been, I probably would have just stayed in L.A. and partied myself to death, too.Here’s something that might have been good or bad: After one semester, I got cast in the first Archangel movie. Sometimes I wonder what would have happened if, instead, I’d finished college and stopped acting and been forgotten about, but it’s not like I possibly could have turned down the colossal amount of money that came with playing Katerina. So everything else is irrelevant.In my blip of higher education, I had time to take Intro to Philosophy and learn about the panopticon, the hypothetical prison Jeremy Bentham came up with, where there would be one itty-bitty guardhouse at the center of a giant ring of cells. One guard was all you needed because he might be watching at any time, and the idea of being watched matters way more than actually being watched. Then Foucault turned the whole thing into a metaphor about how all you need to discipline and dominate a person or a population is to make them think it’s possible they’re being watched. You could tell the professor wanted us all to think the panopticon was scary and awful, but later, after Archangel made me way too famous, I wanted to take Katie McGee’s preposterous time machine back to that lecture hall and ask him to consider the opposite. Like instead of one guard in the middle, you’re in the middle, and thousands, maybe millions, of guards are watching you—or might be—all the time, no matter where you go.Not that I would have had the nerve to ask a professor anything. At NYU everyone was always staring at me because I’d been Katie McGee, but it felt like they were staring at me because they knew I didn’t deserve to be there. And maybe I didn’t, but you can’t measure fairness in a lab. You can’t know if you deserve something. Probably you don’t. So it was a relief, too, when I quit school for Archangel, to go back to having a million obligations I had no choice about and a daily schedule I didn’t decide for myself. At college I’d flipped through the course catalog, as fat as a dictionary, in complete bafflement. I’d drifted through the cafeteria, looking at all the different foods, at the salad bars and the mountains of bagels and the bins of cereal and the soft-serve machine, and I’d felt like I was being asked to solve some monumental, life-or-death riddle.After I’d wrecked everything and Sir Hugo Woolsey (the Sir Hugo, who happens to be my neighbor) started talking to me about some biopic he was producing and pulled Marian’s book from his tote bag—a book I hadn’t thought about in fifteen years—suddenly I was in a library again, looking at a slender hardback that might hold all the answers. Answers sounded nice. They sounded like something I wanted, not that I could ever quite unravel what I wanted. Not that I even really knew what wanting meant. I mostly experienced desire as a tangle of impossible, contradictory impulses. I wanted to vanish like Marian; I wanted to be more famous than ever; I wanted to say something important about courage and freedom; I wanted to be courageous and free, but I didn’t know what that meant—I only knew how to pretend to know, which I guess is acting.Today is my last day of filming for Peregrine. I’m sitting in a mock-up of Marian’s plane that’s hanging from a pulley system and is about to be swung out over a giant tank of water and dropped. I’m wearing a reindeer-fur parka that weighs a thousand pounds and will weigh a million once it gets wet, and I’m trying not to let on that I’m afraid. Bart Olofsson, the director, took me aside earlier, asked if I really wanted to do this stunt myself, given, you know, what happened to my parents. I think I want to confront that, I said. I think I could use the closure. He’d put his hand on my shoulder, done his best guru face. You are a strong woman, he’d said.Closure doesn’t really exist, though. That’s why we’re always looking for it.The actor who’s playing Eddie Bloom, my navigator, is also wearing a reindeer-fur parka and has waterproof blood makeup on his forehead because he’s supposed to be knocked out by the impact. In real life, Eddie usually sat at a desk behind Marian’s seat, but the screenwriters, two aggressively cheerful brothers with Hitler Youth haircuts and Hitler Youth faces, thought it would be better if Eddie came up front for the death dive. Sure, fine, whatever.The story we’re telling isn’t what really happened, anyway. I know that much. But I wouldn’t say I know the truth about Marian Graves. Only she knew. Eight cameras will record my plunge: six fixed, two operated by divers. The plan is to do it once. Twice, at most. It’s an expensive shot, and our budget was never enormous and has now been exhausted and then some, but when you’ve come this far, the only way out is through. Best-case scenario, it takes all day. Worst-case scenario, I drown, wind up In Memoriam, wind up like my parents except in a fake plane and a fake ocean, not even trying to get anywhere.“You’re sure you want to do this?”The stunt coordinator is checking my harness, all business as he digs around my crotch, feeling for the straps and clips among bristly reindeer hair. True to type, he’s got a leathery face, a leathery wardrobe, and a stop-action way of walking from a few imperfect repair jobs.“Totally,” I say.When he’s done, the crane lifts us up, swings us out. There’s a scrim at the end of the tank that makes a kind of horizon with the water, and I’m her, Marian Graves, flying over the Southern Ocean with my fuel gauge on empty, and I know I can’t get anywhere other than where I am, which is nowhere. I wonder how cold the water will be, how long before I’m dead. I think through my options. I think about what I’ve promised myself. A gannet plunge.“Action,” says a voice in my earpiece, and I push on the fake plane’s yoke as though I’m going to fly us down into the center of the earth. The pulleys tip the nose, and we dive. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 59 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 59 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER • A TODAY SHOW #ReadWithJenna BOOK CLUB PICK • The unforgettable story of a daredevil female aviator determined to chart her own course in life, at any cost: an “epic trip—through Prohibition and World War II, from Montana to London to present-day Hollywood—and you’ll relish every minute” (People).After being rescued as infants from a sinking ocean liner in 1914, Marian and Jamie Graves are raised by their dissolute uncle in Missoula, Montana. There--after encountering a pair of barnstorming pilots passing through town in beat-up biplanes--Marian commences her lifelong love affair with flight. At fourteen she drops out of school and finds an unexpected and dangerous patron in a wealthy bootlegger who provides a plane and subsidizes her lessons, an arrangement that will haunt her for the rest of her life, even as it allows her to fulfill her destiny: circumnavigating the globe by flying over the North and South Poles.A century later, Hadley Baxter is cast to play Marian in a film that centers on Marian's disappearance in Antarctica. Vibrant, canny, disgusted with the claustrophobia of Hollywood, Hadley is eager to redefine herself after a romantic film franchise has imprisoned her in the grip of cult celebrity. Her immersion into the character of Marian unfolds, thrillingly, alongside Marian's own story, as the two women's fates--and their hunger for self-determination in vastly different geographies and times--collide. Epic and emotional, meticulously researched and gloriously told, Great Circle is a monumental work of art, and a tremendous leap forward for the prodigiously gifted Maggie Shipstead.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Vintage (April 5, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 672 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1984897705"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1984897701"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.2 x 1.11 x 7.95 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,181 in Books (See Top 100 in Books) #90 in Biographical Fiction (Books) #285 in 20th Century Historical Fiction (Books) #1,337 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 15,663 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6b98045-02c1-4758-a9e0-95cb18412d31.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8c0d781a-9379-470e-8037-f8939009e36b.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/260e200c-3ef7-4ef1-a32e-39dcf5c957c1.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b4b9c20-ad09-463a-bc02-df4ad9348aec.__CR0,0,1080,1080_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AmazonBuyerNorCal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZUGNWEXKXSTEPAB7GLBAHZ7PBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQXK2O8N88XSH?ASIN=1984897705",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars entertaining book, sort of long",
                "reviewText": "This was an entertaining book. It was quite long and it took some time to chug through it. I liked it because it had some content about my home town of Missoula Montana, and it also had some aviation content. I am not sure I felt a lot of sympathy for the characters in the book, they seemed to somewhat make a mess out of their lives even through they had enough brains and talent to do otherwise. Still interesting. Take this book along if you have a long sea voyage with many days of idle time, nothing to do but read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JacqueF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEQJO7MZKKB7KZFMKVFMAXOHODA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37O5NYTC2HJLK?ASIN=1984897705",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Interesting stories",
                "reviewText": "This novel contains stories about individual people, describing how their lives intersect. The only character I really cared about was Marian's brother .Sometimes I found the author was too wordy and I found myself skimming in order to move forward in the story.I would recommend this book to people who are either interested in flying private planes themselves or reading about the history.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LindaL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPXPAPYBROFF7NGTD4TEDU6T35Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IVLNZC7RBO0C?ASIN=1984897705",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2021",
                "reviewTitle": "5.0 out of 5 stars A Great Long Read",
                "reviewText": "<em>The New York Times</em> calls this novel ambitious. It certainly covers vast territory—literally and figuratively, in its 600+ pages. I devoured all the pages since it is written beautifully with so many literary elements. However, I am still working on understanding how the circle and its symbolism highlight the story. Marian Graves is a fictional female aviator who went missing as she sought to circumnavigate the earth north-south over the poles. In a parallel story, Hadley Baxter, a modern actress, prepares and then plays the role of Marian in a Hollywood movie. We begin to learn Marian’s backstory from Hadley’s contemporary impressions.The story alternates between Marian’s and Hadley’s lives. The Marian parts of the book are lengthier and better developed, with great characters and plot points. Hadley’s sections are thinner and almost annoying at times, but I can see why the author weaved her tale into this epic story. Hadley had been a struggling actress when she landed the part of Marian and identified with her immediately. Hadley also represents a modern woman who may need to connect with historical women to understand herself better.After Marian and her twin brother Jamie were born on a ship, The <em>Josephina Eterna</em>, in 1914. Their mother, suffering from postpartum depression, evidently commits suicide and their father, Addison Graves, saves the twins as the ship sinks. Addison leaves Marian and Jamie with his brother Wallace in Montana while he does time at Sing Sing. Wallace is an artist and has little desire or competence for raising children. So, Marian and Jamie pretty much rear themselves with a neighbor and friend, Caleb, whose mother is an alcoholic and prostitute. Caleb and Marian exchange sexual favors and eventually have an on-again-off-again, circuitous relationship throughout their lives. Marian, Jamie, and Caleb, all suffering from virtual abandonment by caregivers, develop different levels of trust with each other and the people they meet in their lives’ wanderings.The movie that Hadley stars in is entitled <em>Peregrine</em>, after the name of Marian’s plane. The literal meaning of peregrine is “tending to wander.” Besides the obvious desire of Marian to wander in a great circle around the world, there are other great circles of realization experienced during the travels of various characters from Montana to Vancouver, Alaska, Hawaii, New York, Antarctica, and more. Yes, the different geographic locations provide more circles to consider. One wonders how much of the main characters’ predispositions are related to their lack of parental grounding.Marian Graves has an early interest in learning to fly, but she realizes that being female is an impediment to achieving her passionate goal. Her early attempts to appear masculine and earn money include chopping off her hair and dressing like a boy. She ponders and questions her sexual identity during her life, accounting for some of the great circle metaphors. Shipstead uses engaging and thought-provoking names and symbols. While she yearns to be male, Marian’s brother Jamie is a budding artist, animal rights advocate, and vegetarian. He is sentimental and thoughtful. The gender-neutral names and plot points force us to consider gender roles and expectations and the difficulties of those who don’t conform.Marian eventually acquires a benefactor to support her flying lessons and provide a plane for her to fly. Still, Barclay Macqueen is an abusive man who is involved in bootlegging and other illegal activities. As a result, Marian must compromise her integrity in many ways to begin to accomplish her goals. Her self-determination and free-spirited disposition lead to myriad adventures and interactions with many three-dimensional characters.Marian took her infamous flight after serving as an ATA pilot in London during the second world war. Jamie seems to be too much of a pacifist to serve in the war effort until he finds an acceptable opportunity as an artist. There are many subplots and side stories about famous aviators, war efforts, and news items of the entire century covered in the timeline of this novel. The story spans the globe in settings. I found all of it intriguing, and I liked how the author integrated the plot and themes.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "switterbug/Betsey Van Horn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFC4L6YCFUMKPSTZP4E4DS6E2PPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30ZK7TLFXBVBF?ASIN=1984897705",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2021",
                "reviewTitle": "5.0 out of 5 stars Stunning and satisfying",
                "reviewText": "Maggie Shipstead has outdone herself in this extraordinary tale of resilience and perseverance, constructed with two parallel storylines of two complex women. Marian Graves and her twin brother, Jamie, are raised by an alcoholic/gambling addict uncle, in the wilds of Montana, during the Prohibition days. The fateful story of their parents is told with superb detail in the early pages of the book. Marian and Jamie become well educated in the natural world, where they spend a lot of time, and their uncle ensures that their literacy and creative spirits thrive. Besides Marian, Jamie has a story with many adventures, and his fate is inextricably bound with Marian’s.At an early age, Marian becomes self-sufficient and ambitious, especially after witnessing a husband and wife pilot team that visit for a show. She is determined to fly planes--and do whatever it takes to save the money (her uncle squandered much of their inheritance). Marian is disciplined, courageous, and highly intelligent, as well as physically strong. Moreover, she is devoted to Jamie. Yes, she has assistance from a wealthy cattle rancher with a stake in criminal enterprises, but most of her accomplishments were despite him, not because of him. She becomes a legendary aviatrix.We meet Hadley Baxter in late 2014, also raised by her uncle. Her parents died in a plane crash in Antarctica, their bodies never recovered. Hadley is quite young, yet is already a movie star, a household name, thanks to luck and timing. She got into showbiz with the help of her stuntman uncle, and landed the part of a superhero in a film franchise, Archangel. However, at this time, Hadley is a work-in-progress--a navel-gazer, the acme of vanity, who confuses love and lust. Hadley leaps before she looks in almost every area of her life. She hardly “earned” her status--it’s more like she fell into place. The young actress is privileged, frustrating, and loveable. Yes, loveable. Fundamentally, Hadley has a tender heart--she just doesn’t know where she misplaced it.After making millions on Archangel, Hadley impulsively sabotages her superhero role (unlike her counterpart, Marian, who planned vigorously and resourcefully to achieve self-sovereignty against the tide of traditional gender roles). And due to social media, Hadley’s reputation is also in shambles. While at her lowest and most self-pitying, she is offered an opportunity to play Marian in a hagiographic film of Marian’s life. It’s a chance to mature, to step into a new role that could lead to self-agency and self-determination. After reading a book about Marian’s journeys, as well as some of Marian’s pilot logbook, she becomes infatuated with the brave female aviatrix who dared to circumnavigate the globe.The novel is about 75% Marian, 25% Hadley (this isn’t an exact figure, of course). Shipstead is astonishing on all fronts. Plotting, themes, character development, language, and pacing just vibrate off the pages. This epic and startling tale of two women, a century apart, illustrates the “great circle” of life in unexpected and exquisite ways. It also demonstrates that we can only have a limited view of other people's lives, which is framed by our own experiences. Hadley and Marian can be fierce and uncompromising, even as they paradoxically sacrifice-- for a desire to be seen, to be made manifest in magnificent and sublime ways. It’s a sweeping narrative that made me feel special just for reading it.I won’t go into the story details; it’s enough to say that Marian and Hadley’s stories intersect through the author’s masterful and elaborate storytelling talents. Shipstead’s meticulous research adds even more luster to this tale. Interspersed with the parallel narratives are portraits of pilots--mostly female--who have broken records and braved the impossible. For readers who would want to know beforehand--the tale also covers scenes of sexual abuse/assault, graphic at times but eloquently nuanced. THE GREAT CIRCLE will surely be one of my top 10 of the year.“What is the border between life and oblivion? Why should anyone presume to recognize it?”",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM73GFRDR7PY4EEKQYFVXZFCCLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QTCLQB6F6MT2?ASIN=1984897705",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "4.0 out of 5 stars slow start",
                "reviewText": "Slow start and dragged a bit. Character development was good. A bit too melancholy for my taste. If you are a reader of hers it will probably work for you otherwise eh.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Baldy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2024",
                "reviewTitle": "Fantastic story, very well told",
                "reviewText": "It's a bit of a soap opera, particularly in the first quarter of the story as the characters are established, but the intricate plot is rewarding, and there's a welcome twist at the end. Enjoy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 9, 2022",
                "reviewTitle": "A love story about flying",
                "reviewText": "Great read overall. A fascinating story about life, love and flying. The only thing I'd criticize is that I don't feel like the parallel story set in the present really contributes to the book. I don't even remember the protag's name. Marian's story was all I cared about. Still 5 stars because her parts were so awesome.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2022",
                "reviewTitle": "A story brilliantly told, a remarkable and rewarding read.",
                "reviewText": "Great Circle reminded me of the movie version of The French Lieutenants Woman. In both that movie and this book events from the past and the making of a movie about those events run side by side. The difference here is that some of the characters from the past and the present are linked. This makes Great Circle something more than just an historical novel. The historical part concerns Marian Graves, an aviator who in the 1940’s attempts to circumnavigate the world by flying over both poles. It’s interesting here though that Maggie Shipstead didn’t choose to write about one of the many female aviators such as Amelia Earhart or Amy Johnson but instead created a heroine of her own in Marian. The 21st century part of the story concerns an actor Hadley Baxter who in an attempt to revive her flagging reputation prepares to portray her in the movies.This duel story gives Great Circle two heroines and Shipstead skillfully interweaves the lives of Marian and Hadley highlighting the parallels between their experiences.As Hadley immerses herself in Marian’s story in order to develop her role she finds Marian’s experiences help her to navigate her own life.The majority of the novel however concerns Marian who’s story actually starts before she was born in 1914 and goes on to trace her life from cradle to grave. I found her story the more interesting of the two.We are told something of Marian’s fate at the beginning of the book. Initially I felt this took something away from the story. I am not overly keen on endings being revealed at the beginning of stories. However at over 600 pages I felt there must be something more here than just the story of a round the world flight attempt, and this proved to be the case. Great Circle is much much more than that.Maggie Shipstead’s book is populated by strong, vivid, memorable characters and the stories of these people as their lives intertwine are heartbreaking at times sometimes shocking and even achingly funny, but mostly they are totally believable. Their stories also hold a few surprises along the way, it isn’t predictable. The core of the story though is Marian’s circumnavigation of the world and I became totally absorbed in her obsession with flight, willing her on every inch of the way. Shipstead’s brilliant descriptive prose puts you firmly in the aircraft with her. However Marian’s eventual destination isn’t the point here, it is the story of getting thereIf I was to make a criticism it would be that Marian’s story is brought to life better than that of Hadley’s. Marian’s story is full of extraordinary detail bringing it into sharp focus, it’s incredible realistic. Hadley’s story however feels a bit lightweight in comparison. In conclusion however Great Circle, which covers many years and half the world, is a fabulous epic of a novel. It’s a story brilliantly told and is a remarkable and rewarding read.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nandhini(Books and Bliss)Nandhini(Books and Bliss)",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 25, 2021",
                "reviewTitle": "Can't wait to read this great book!",
                "reviewText": "This book is one of the longlisted books of Booker Prize 2021. This review is about the condition of the book and not the content. The book arrived in great condition, and it is a big floppy paperback edition therefore it's very comfortable to read and no need to worry about breaking the spine of the book! I've heard really good things about it , and I can't wait to read it!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/811gXQg9NAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81wCPr+j4ZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ingrid S Hoelscher Menzell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 10, 2021",
                "reviewTitle": "BEST book I have read so far 2021",
                "reviewText": "Marvellous writing, marvellous story, don't miss It!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}