{
    "remaining_requests": 900,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/German-Wife-absolutely-heartbreaking-historical-ebook/dp/B09JR1QNH3",
    "body": {
        "name": "The German Wife: An absolutely gripping and heartbreaking WW2 historical novel, inspired by true events",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/German-Wife-absolutely-heartbreaking-historical-ebook/dp/B09JR1QNH3",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81ZfR52D4IL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Debbie Rix",
            "link": "https://www.amazon.com/Debbie-Rix/e/B00QYE6L8Q/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3183,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Inspired by true events, this is a heart-stopping, unforgettable story of ordinary people fighting for survival in the darkest of times. Fans of Orphan Train, The Tattooist of Auschwitz and My Name is Eva will be utterly gripped by this beautiful, tragic World War Two novel.Germany, 1939: Annaliese is trapped in a loveless marriage. Her husband Hans has become cold and secretive since starting a new job as a doctor at Dachau. Every morning she watches from her kitchen window as he leaves in his car. The sight of him in the dark uniform of the SS sends shivers of fear down her spine and she longs to escape…When a tall, handsome Russian prisoner named Alexander is sent from Dachau to work in their garden, lonely Annaliese finds herself drawn to him as they tend to the plants together. In snatched moments and broken whispers, Alexander tells her the shocking truth about the camp. Horrified, Annaliese vows to do everything she can to save him.But as they grow closer, their feelings for each other put their lives at risk. And Annaliese finds herself in grave danger when she dares to fight for love and freedom…America, 1989: Turning the pages of the newspaper, Annaliese gasps when she recognizes the face of a man she thought she’d never see again. It makes her heart skip a beat as a rush of wartime memories come flooding back to her. As she reads on, she realizes the past is catching up with her. And she must confront a decades-old secret – or risk losing her only son…Readers love The German Wife:‘Exceptional… gripped me right from the very start… heart-wrenching… so beautifully written with real moments of bravery and hope… heart-breaking… I loved this book and I wish I could reread it again for the first time as it truly is that special. Five stars just isn’t enough.’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘Wow… I am sobbing. I loved this book so much… I completely devoured this book and it will stay with me a long time. Absolute 5 stars.’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘Heart-stopping, unforgettable tale of ordinary people fighting for survival in the darkest of times… kept me glued to my Kindle through the whole book!’ NetGalley reviewer, ⭐⭐⭐⭐‘Heart-wrenching, extremely sad, and completely gripping WWII story! I was hooked from the first chapter and stayed glued all the way until the end, in one sitting!’ @ink_drinker64, ⭐⭐⭐⭐⭐‘I couldn’t turn the pages fast enough and was amazed to realise that I had read the book from beginning to end in less than 24 hours, using up more than its fair share of my desktop tissue box along the way! Amazing… gripping… addictive… wonderful.’ Fiction Books, ⭐⭐⭐⭐⭐‘Had me gripped… filled with secrets and lies and a devastating love and loss. Wonderful story telling.’ Kraftireader, ⭐⭐⭐⭐⭐‘Found myself hanging on to every word and every plot twist… an incredibly emotional read… brilliant historical fiction.’ Readsbyem, ⭐⭐⭐⭐ Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09JR1QNH3"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bookouture (January 13, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 13, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1940 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 423 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#50,202 in Kindle Store (See Top 100 in Kindle Store) #68 in Literary Sagas #200 in Romance Literary Fiction #414 in Historical Literary Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,183 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Edgar Allen Pooh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFECITV3G7YFXPAFJ2J6RQGTWAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15OACEHI3BBC8?ASIN=B09JR1QNH3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2022",
                "reviewTitle": "5.0 out of 5 stars Definitely a different plot",
                "reviewText": "Unique plot. Life was crazy and people found themselves making sometimes immoral choices. Realistic ending. Survival was paramount but humanity being what it is ... Survival doesn't mean no damage lingers in the Soul to thwart a fairy tale ending.And villains are not always eroded by a core made entirely of evil...but by their failure in character to act or to stop evil but instead to choose to contribute to b the horror with reputedly benign intention.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dennis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6SFR4XGOMGMWRWK3VA2GQKLIEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD5NW8R3B51R3?ASIN=B09JR1QNH3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2022",
                "reviewTitle": "4.0 out of 5 stars Entertaining but OFFENSIVE!",
                "reviewText": "Debbie Rix has written a novel that I definitely enjoyed reading and looked forward to continuing each night for a few days. The explanations and motivations of the characters were made clear so the major plot twist was plausible - and in deed intriguing. But Jewish readers such as myself who tend to think beyond the lines might be deeply offended by its glaring omission, and assumptions that are the core of this book.Every scholar or even casual reader of the Holocaust understands that many groups of people were persecuted during Adolf Hitler's reign in Europe. But no group was singled out, chased, excluded, humiliated, tortured, hunted, robbed, and betrayed like the Jewish population was. Ignoring this and going the extra mile to reinforce the victimhood of the other groups is to betray the memory of the 6 million - even in fiction.In the book, the prisoners at Dachau were Communists, Political prisoners, Poles, and Russian POWsWhat? The writer intentionally leaves out that this prison/death camp was primarily housing Jews and that the prisoners were primarily Jewish. Nowhere in these pages is the reader allowed to understand that Dachau was home to Jews before the Germans could get around to legally murdering them.The maid in the story goes to market, is in the city, regularly runs errands........and never notices how the Jews are being hunted and made extinct during the entire war? She has no idea that the Jews are being evicted and \"resettled\" while their apartments and homes are liquidated. No mention at all of what is happening to the Jews of Munich during the entire 5 years that this couple is living in the heart of German Jewish misery.The wife walks around all day not knowing that her husband is torturing \"subjects\", (not Jews) all day at work. She doesn't see the flyers; she has no opinion about the trucks carrying away Jewish furniture, art, musical instruments, jewelry, appliances all day. One day she sees some people being treated badly.. They're not Jews though.... they're just people being treated harshly.The reader is owed a little truth in a novel such as this. The glaring and continual omissions are deeply offensive as the author goes out of her way to include the other persecuted types.The prisoners are never referred to as Jews in this book. The Volkswagon factory workers are not Jewish. The poor souls being experimented on are not Jews. The hundreds of corpses on the train outside are not Jewish. The prisoners about to go on the death march are not Jewish. The corpses in the ovens are not Jewish...... The mother in law wonders why there aren't more \"slaves\" around to help clear the roads.Announcement to Debbie Rix: The slaves were Jews. Those on the forced death marches were Jews. Those ashes in the ovens were Jewish ashes. The trainloads of dead bodies were Jewish dead bodies. The house that those Germans were living in was probably once a Jewish house. The mother in law's Jewish neighbors were previously arrested, tortured, starved, and deported. All this happened under the watchful eyes of those wonderful, thoughtful, kind, well mannered citizens of Munich: And the lovely, likeable German characters who were portrayed herein. Even Dr. Death is kindly. Please.The opportunity to educate a younger audience about who the Germans really were and how they watched as their neighbors (1 in 7 people were Jewish in Munich in 1938) were mercilessly destroyed is appalling to me. Would have been nice if someone in the story had noticed that by the end of the book the Jews of Germany were, well, gone.I did like the book though. Tell me a story. Make a good ending. Check and Check.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danette Munkvold",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3HB4Y42SBG26BM5DNZVCHH6XVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IFWH981LDTD9?ASIN=B09JR1QNH3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 2, 2022",
                "reviewTitle": "5.0 out of 5 stars A new perspective",
                "reviewText": "This book represented a new perspective to me of the wife of a doctor, locked in to a terrible situation. The author does well to try and portray the emotions of each character, the challenges they each faced, how they dealt with the aftermath of the war. I was unaware of the Nazi requirement for its leaders to produce heirs, such that couples kidnapped children or planned affairs to have children. A worthwhile read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barb WJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3RY7ELA67DACTC3BEVDXQOBVIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LPIQTXOO7GLW?ASIN=B09JR1QNH3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2022",
                "reviewTitle": "5.0 out of 5 stars A couldn’t stop reading book.",
                "reviewText": "I had no idea what to expect but found this book impossible to put down. I just kept reading as I waited to see how the story would end. Loved the.book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "elizabeth mahan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX4N2OLC322OBWID2BDQ42JHLQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDFHXMDJTNEWK?ASIN=B09JR1QNH3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Loved this book",
                "reviewText": "This book remains fascinating throughout. I think it gives a real life view of different perspectives held by different people in Germany in that time period. I was so glad that the book ended with clarity on the characters at the end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan McCracken",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERNY3F22C6STK47F7SPLXHTNFEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EM13JISV5YG?ASIN=B09JR1QNH3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Interesting book",
                "reviewText": "It was a good book but I prefer true stories.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "glaur11",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC62WK2IZLQODV6QNDTSHIJU6FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UP5ZYCXDXAZH?ASIN=B09JR1QNH3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 28, 2022",
                "reviewTitle": "5.0 out of 5 stars Greta Reading",
                "reviewText": "It is a beautifully crafted story, a historically accurate novel, that takes you on a ride with layers of nuance that many may have not considered. In the end, the reader turns the last page, fully satisfied by the brilliantly told story. Good book to read. I recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "susan r rice",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLRGN65I227SM5BYEMFSX5HR2PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OM3BE76L3K8H?ASIN=B09JR1QNH3",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2023",
                "reviewTitle": "3.0 out of 5 stars Disappointed",
                "reviewText": "My book club book, have not discussed it yet! Not a fave…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 7, 2023",
                "reviewTitle": "very well written",
                "reviewText": "For people who likes ww2 subjects and a good romance, this is perfect for you, I read it in 4 days. Great reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colleen Robinson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 15, 2023",
                "reviewTitle": "Great book",
                "reviewText": "Great story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. McCarthy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 21, 2023",
                "reviewTitle": "Great story!",
                "reviewText": "The characters are nicely developed, and the plot has a number of very interesting twists. The female protagonist is a strong example to younger women. You’ll enjoy it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fernando Renedo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 28, 2022",
                "reviewTitle": "Good feelings",
                "reviewText": "I loved this book, it is amazement and romantic story, but the pain it was truth. At least there were good people everywhereI like the end how the principies hold on and their first love remains even in a war or in any circunstaces.It deserve to make a film",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "June Considine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 28, 2022",
                "reviewTitle": "An Enthralling Read",
                "reviewText": "The German Wife is a finely woven story with a chilling undercurrent running below the normality of domestic life during the Nazi regime. The author focuses on the monstrous medical experiments that took place during that period and explores them through the lens of a young, naïve wife and her husband, an ambitious doctor, whose desire for recognition allows him to become part of the SS and, in doing so, to bury his conscience in the name of ‘science.’Debbie Rix does an excellent job of bringing us into the era of World War Two in Germany. Annaliese, the German wife, is struggling to adjust to what has turned into a loveless marriage as her husband becomes consumed, yet horrified, by the medical experiments taking place at Dachau. The love she develops for a Russian prisoner-of-war is a tender backdrop to the dark and brutal forces at work around her.The German Wife is expertly researched and the author does not flinch from exploring the atrocities that took place during that era yet she seamlessly combines it with the daily day-to-day routine that continues in the midst of war. The dangerous decisions that are made within the cracks of that normality are what drives the book forward and makes it such an enthralling read. Highly recommended.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}