{
    "remaining_requests": 1014,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Where-Lost-Wander-Novel/dp/B07ZPHCMNZ",
    "body": {
        "name": "Where the Lost Wander: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Where-Lost-Wander-Novel/dp/B07ZPHCMNZ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51zD5b85IWL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Amy Harmon",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Amy+Harmon"
        },
        "brand": "Amy Harmon",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 33301,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In this epic and haunting love story set on the Oregon Trail, a family and their unlikely protector find their way through peril, uncertainty, and loss.The Overland Trail, 1853: Naomi May never expected to be widowed at 20. Eager to leave her grief behind, she sets off with her family for a life out West. On the trail, she forms an instant connection with John Lowry, a half-Pawnee man straddling two worlds and a stranger in both.But life in a wagon train is fraught with hardship, fear, and death. Even as John and Naomi are drawn to each other, the trials of the journey and their disparate pasts work to keep them apart. John’s heritage gains them safe passage through hostile territory only to come between them as they seek to build a life together.When a horrific tragedy strikes, decimating Naomi’s family and separating her from John, the promises they made are all they have left. Ripped apart, they can’t turn back, they can’t go on, and they can’t let go. Both will have to make terrible sacrifices to find each other, save each other, and eventually...make peace with who they are. Read more",
        "breadCrumbs": [
            {
                "name": "Audible Books & Originals",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_1?ie=UTF8&node=18145289011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18574426011"
            },
            {
                "name": "World Literature",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18574521011"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18574541011"
            },
            {
                "name": "Native American",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=18574545011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "11 hours and 46 minutes"
            },
            {
                "name": "Author",
                "value": "Amy Harmon"
            },
            {
                "name": "Narrator",
                "value": "Lauren Ezzo, Shaun Taylor-Corbett"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "April 28, 2020"
            },
            {
                "name": "Publisher",
                "value": "Brilliance Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07ZPHCMNZ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,099 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #7 in Native American Literature (Audible Books & Originals) #7 in Western Romance #24 in American Historical Romance (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AnneShirley_and_meAnneShirley_and_me",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG54IM2L6JARGR2LAWJMXZIWHV4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M2NH8FY6C6TQ?ASIN=B07ZPHCMNZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful read",
                "reviewText": "🌟🌟🌟🌟🌟Did you know that you can still see the ruts from the wagons that traversed across the west on the Oregon Trail between 1846-1869? (Pictured above)🏞️ More than 400,000 settlers used the trail for routes bound for Salt Lake City, Utah, Montana and California, as well as Oregon. Between four-six percent of emigrants did not survive the 2,170 mile journey.🏞️This story is about one such journey. Actually it is about many people’s journey…Settlers from the East and Native American tribes. The first few pages of this book absolutely pulls you into the action with the clever technique of starting with the middle of the story. After that chapter, the author restarts the story at the beginning of the journey that lead to that action. I loved this aspect of the book.🏞️ Historical Fiction based on the author’s family history🐴 A love story… family love, love of heritage as well as romantic love🏞️ CONTENT WARNING: ⚠️ There is violence (physical and sexual), ⚠️Not closed door but also not graphic, ⚠️Native Americans are a large part of the storyline so if you are sensitive to the telling of a story through the lens of the time period, this isn’t a book for you🏞️ I can’t even begin to describe how complex this story is, not from a storyline perspective but from an emotional perspective. I think I went through the whole range of emotions 🫣😳🤭🥰🥲😢🤬😮🐴 I can’t believe I waited so long to read this book! Do yourself a favor and READ it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71qtBRyh19L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7ZRU2TTBYSEWFPDYGCQQ43UQSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3O37V2Q2C0SM2?ASIN=B07ZPHCMNZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars A Beautiful Historical Novel",
                "reviewText": "Where the Lost Wander is a beautiful, descriptive novel set in the landscape of the Oregon Trail in the 1850s. We follow Naomi May and her family as they leave Missouri for a new life in California.Along the way Naomi and her family encounter loss and love, and learn about the strength and resilience found in family. I laughed, cried, and cheered Naomi through this poignant novel. The only thing this story was wanting for was for it to have more chapters. I didn't want to say goodbye to the characters at the story's conclusion.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie I Dwyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYBNLXTZSJQ6JI3WB5WK4ZNJZGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT8QUQAYHSUTX?ASIN=B07ZPHCMNZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Enjoyable Read",
                "reviewText": "I enjoyed this book with one minor annoyance of the “insta love” between John and Naomi. It took a while for me to believe the chemistry between them but grew to believe it in the second half of the book when tragedy difficult situations arise. I love how the book captured the difficulty of what pioneers faced on the Oregon Trail and how the main characters overcame.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MJLovestoRead",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBP3HXJ24GXRJZVXVXKXUK7UI3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21NRE21EJR6RN?ASIN=B07ZPHCMNZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 28, 2020",
                "reviewTitle": "5.0 out of 5 stars Timely exploration of a long ago journey west that is boundless beauty from start to finish!",
                "reviewText": "Where the Lost Wander is powerful in the most subtle of ways. Amy Harmon takes us on a journey like no other and one I will admit I was hesitant to take. But with a most intense prologue, my interest was piqued in a way I didn't expect. And before I knew it, I was deep into Harmon's exquisite writing and just like Naomi Way and her beloved family and their brutal trek west, I wasn't turning back.Harmon in my opinion, couldn't have written a more timely piece. With this worldwide pandemic strangling our very livelihoods, I almost felt a kindredship towards these weary travelers and their new normal. Even with a pretty decent-sized wagon train, leaving behind all that they knew in Missouri for a new life in California, there were still times of loneliness, monotony and extreme doubt that this was still the right thing to do. The May family is strong, seemingly resilient and full of faith that everything will turn out all right. I couldn't help but feel their inner thoughts and feelings in much the same way I do in this new world of ours, 2020 reflecting some of what they were experiencing in the 1850's.The underlying slow burn romance between Naomi May and one John Lowry gave this book the minute ray of sunshine in an oft-times brutal existence. Living in wagons, never knowing what might lie ahead and traveling a treacherous route, I savored the calm Naomi and John would provide to not only each other but those around them. They have this almost spiritual connection with Naomi understanding John almost immediately. His half-breed existence was never an easy one, being a contentious matter for many around him and yet Naomi became his balm from the first time they laid eyes on each other and only saw his beautiful soul from that moment forward.John's understated nature and the industrious way about him clearly reflected both his upbringing by his hardworking white father and step-mother and his innate sense that came from his indian mother. He's quiet yet is a fierce thinker and he proves over and over again, even to those who don't take kindly to his mixed-race nature that he is worthy of both respect and love. And I just adored how tenacious Naomi was in capturing his heart even as he tried his hardest to resist her. She is a true marvel.Like most other Harmon books, there is much to digest. And with the time-frame being one I wasn't too keen about, I was sure that I'd get lost in archaic verbage that would bring the story down. However, I am the first to admit that I enjoyed learning more about that time and just what early settlers had to endure. Even with loss of life, loss of precious goods and the loss of their will, I was beyond impressed at how each person did their best to carry on even when all felt lost.A true testament to the their strength and grit, I fell hard for this group of characters. It is most definitely Naomi's story, however, taking us along while she continually takes time to illustrate her loved ones, using that talent to thwart many a threat and keep those she loves most close to her heart. I was forever in awe of how she never wavered in her determination, only breaking when it was beyond her control. But her love of her beloved John was truly a godsend and proved to be her savior time and time again. They held each other up, took each other's pain and loved each other with all they had. A true partnership in every sense of the word.Where the Lost Wander touched something in me that I wasn't necessarily always comfortable with but at the same time gave me a renewed hope that this current situation we are in will eventually pass. I wanted to turn away at some of the more excruciating scenes, but knew it was all part of the history that Americans lived through and I felt privileged to be able to witness some of it 'firsthand'.There is an ethereal quality to this book that gave it a magical kind of feel, especially the use of otherworldly dreams whether from the stalwart Winifred May or from the formidable Washakie. When life handed both John and Naomi moments of pure horror and grief those visions were the push both often needed to carry on.I applaud Amy Harmon for taking a part of her own husband's ancestry and crafting a story that brings to life a time that I thought of as a bit dry and dusty as the plains the wagon trails traveled upon. I surprised myself at how much I enjoyed it and it has given me a new outlook in these troubled times, knowing we are always stronger than we may think and that this too shall pass.5+ stars!",
                "reviewVotes": "87 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Valerie E",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVOAAWOBJOPRYLC6CCNNB26FDOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKRTT2VYMAXD6?ASIN=B07ZPHCMNZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Highly Recommend",
                "reviewText": "This novel takes place on a journey from St Joseph, MO to California. Naomi May and her family are on a wagon train seeking a better life and future. John Lowry joins them. But on their journey, they go through hardships. Among the hardships, Naomi and John find comfort in each other, ultimately leading to a love for one another. It was sad to read about what people endured during these times while on The Oregon Trail. These people were brave.It has been a long time since I read a book that I couldn't put down or laughed or cried. The story was written in feelings. Highly recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chuck canham",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRKSYOWHFPMRO4G27WRZPV36OZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17I1IYAX2KFWO?ASIN=B07ZPHCMNZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars powerful story of survival and peace",
                "reviewText": "Amy Harmon is a grand story teller. She weaves a tale of adventure love and sorrow set in the pioneer days of the way west on a wagon train. The lives of the Indigenous people and white settlers are a complex co-mingling of survival and mistrust. I truly recommend this to anyone.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heather Proctor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMDAP6T5TKNFOQ2ELFUOYERMFNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20VSP2YERE9NN?ASIN=B07ZPHCMNZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2024",
                "reviewTitle": "4.0 out of 5 stars captivating tale",
                "reviewText": "Great tale of traveling west and the hardships endured on both sides with a touch of love , joy and, loss , and grief .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marisol Barrera",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 24, 2021",
                "reviewTitle": "Where The Lost Wander is a Heartbreakingly beautiful love story",
                "reviewText": "“It’s worth it. The more you love, the more it hurts. But it’s worth it. It’s the only thing that is.”Where The Lost Wander is a Heartbreakingly beautiful love story filled with culture, hope, loss, adventure, grief, strength and survival. It’s the story of people who chose to leave everything behind on the search for a better life in the west in the 1850’s. It was definitely an emotional rollercoaster. The unforgettable characters were fantastic. Naomi “Many Faces” May was so strong and inspiring. John “Two Feet” Lowry was just such a beautiful soul. I absolutely loved the May brothers and each and every relationship in the story. The description of the atmosphere was amazing, Amy made me feel like I was on that Oregon trail right next to them. It made me appreciate my life a little more.💫Read if you like•Dual POV•Western Romance•Instant love•Forbidden Romance•Overprotective MC•Family dynamics•Flawed real characters“I need her to go. To stay. To forgive me. To forsake me.”",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charlotte",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 26, 2023",
                "reviewTitle": "beautiful & moving",
                "reviewText": "I’m not the best with words but I just had to write a review of this if only to say what a beautiful way with words Amy Harmon has, any book I read of hers truly moves me, this one being no different",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 14, 2021",
                "reviewTitle": "Superou expectativas!",
                "reviewText": "Uma história incrível e forte, personagens interessantes e bem desenvolvidos, e escrita maravilhosa. A autora consegue te puxar para dentro da narrativa, a leitura é muito envolvente e eu não conseguia parar de ler.Já imaginava que fosse gostar, mas certamente superou minhas expectativas. Se tornou um novo favorito e deixou a vontade de ler todas as outras obras da autora.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Venise",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 1, 2022",
                "reviewTitle": "Voilà ce qu'est l'amour",
                "reviewText": "C'était merveilleux, magnifique et on ne peut plus émouvant. John Lowry et Naomi m'ont ébranlée, leur histoire et la plume de l'auteure m'a une fois de plus chamboulée... C'était une épopée tellement belle, des personnages réels nous accompagnant...Je vous invite vraiment à lire la note de l'auteure une fois que vous aurez fini l'histoire. Vraiment, c'était si réel, si pur, passionnant. Une si belle histoire d'amour et je les aime comme s'ils étaient réels et ils le sont, cette histoire était tellement immersive, simple et complexe aussi. Parfaite.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "missydamiao",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 15, 2020",
                "reviewTitle": "Unlike anything you will read!",
                "reviewText": "Everytime I open an Amy Harmon book, I am anticipating experiencing one of the best books of the year. Every book she has ever written has never failed to disappoint, and each becomes a new favorite. I knew Where the Lost Wander was going to be an epic read, but what I hadn't prepared for was how captivating it was going to be, how it held you in it's grasp with every written word. Taking note of very little touch, glance, word, hug, whisper, and gesture between the characters, and gobbling them up like it was going to be your last. I wasn't expecting to feel breathless, desperate to know what was going to happen to Naomi and John, but also feeling so aganozied and not wanting to continue for a little while, to live with the May family and little longer.In the very first chapter of the book, we are introduced to the May family. William, Winifred, Will, Warren, Webb, Naomi and little precious Wolfe. It is 1853 and they are searching for a better life, using stagecoaches to cross the overland trail to cross thousands of miles to get to california. Tradgedy strikes the entire, family and Naomi is separated from John. From that point on, the majority of the book takes you back, to the start of their journey, where Naomi meets john, a half white, half Pawnee native who is also known as \"Two Feet\". You fall in love with Webb, the little shoeless warrior. Winifred is the most endearing woman, and William May, whose love for his family shines throughout the book. Knowing what was going to befall the family was so hard. The more I fell in love with them, the more I didn't want to continue. I wanted the family to strive through the hardships of the trail and come out whole at the end. It was hard. My heart hurt. My stomach felt knotted and my heart oh so heavy.But Amy Harmon creates such a vivid, beautiful experience. It was like you were living the book, experiencing the trail for yourself, experiencing the fear, and the courage it took to cross that trail for months on end. And while there is romance, this story is SO MUCH MORE. It is about hardships and hope, life and death, perseverance and survival. The love of a family. And it's also about heritage, where you come from, where your home is but also feeling like your in two places at once and don't belong anywhwere. And then finding your place in the love of another.This is historical fiction unlike anything I have ever read. I am so in love with this book, with these characters and the stories they had to tell. I loved how I felt like I was learning a part of our history I really never knew before. And I especially love that Amy Harmon didn't hold back. She gives it to you, all of it. Life isn't pretty, and it most definitly wasn't back then. But you learn, you grow, you survive. This story was hard, but it was beautiful.I can't say enough of this book. It was everything I hoped for and never knew I needed. Amy Harmon has outdone herself!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}