{
    "remaining_requests": 973,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Pontius-Pilate-A-Novel/dp/B09RTQGNK8",
    "body": {
        "name": "Pontius Pilate: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Pontius-Pilate-A-Novel/dp/B09RTQGNK8",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41YLr40rhlL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Paul L. Maier",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Paul+L.+Maier&search-alias=audible"
        },
        "brand": "Paul L. Maier&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 631,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Award-winning historian and best-selling author Paul L. Maier has created a compelling style of documentary fiction. He uses what is historically known of Pilate's life, adds in the known political climate of first-century Judea, and unveils the colorful, untold story that changed history. He provides intriguing answers to questions such as:What really happened at that most famous of trials?Were the proceedings against Jesus legal?Did cowardice or necessity motivate Pilate's judgment?What became of this successful Roman politician after his verdict?Filling in the details of Pilate's early career in Rome, Maier captures the drama of imperial Rome under Tiberius Caesar, the plotting of his political allies and enemies, and his relationship with his beloved but ambitious wife, Procula. His great moment arrives as he exchanges the intrigues of Rome for the bewildering environment of Judea, navigating new and dangerous waters. In Pontius Pilate, Maier paints a picture for modern listeners to help them understand the behind-the-scenes complexities, political and religious realities, and ultimately, the humanity of the people we know from Scripture. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10177"
            },
            {
                "name": "Ancient",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17745820011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "15 hours and 2 minutes"
            },
            {
                "name": "Author",
                "value": "Paul L. Maier"
            },
            {
                "name": "Narrator",
                "value": "David Colacci"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "February 22, 2022"
            },
            {
                "name": "Publisher",
                "value": "Tantor Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09RTQGNK8"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#76,378 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #89 in Ancient History Fiction (Audible Books & Originals) #220 in Christian Historical Fiction (Audible Books & Originals) #265 in Biographical Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dan400Man",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESLVTUU3JQFQACNXVT34U46QKYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10QQVYMQS8M55?ASIN=B09RTQGNK8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Paul Maier is a gifted writer! This is great religious fiction.",
                "reviewText": "Pontius Pilate is one of the most tortured souls in the Bible. He's the most powerful man in Judea in his time, but he realizes there is something different about this Jesus of Nazareth. For any other man brought before him for trial, he wouldn't have given much care about a defendant's fate if the Jewish religious leaders had put up as much of a protest as they did for Jesus. Any man besides Jesus? \"Well, sheesh, it's not worth the headache, and I really don't need Rome to hear about this. Tough luck, dude.\" But the Holy Spirit is working on Pilate in order to fulfill scriptures. We never hear another word in scripture about Pilate after the resurrection, and it's easy to wonder about his eternal fate. (And, if you think Pilate's damnation was a slam dunk, may I present to you Saul, responsible for the murders of many Christians before Jesus stopped him in his tracks (literally!) and converted him into His greatest apostle, Paul.)Maier, a renowned Biblical-era historian, has a great knack for writing fiction that doesn't contradict known historical fact. In this 3rd edition, there are 19 pages of footnotes to support Maier's fiction choices. I don't consider myself to be a great student of history, but I learned a lot about Judea and the politics in Jesus' time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melodie Fleming",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAZGDLVY5SHI4QUX5X5GZJBXL6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DLMWMGHTCY1C?ASIN=B09RTQGNK8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Maier's Documentary Style Novel is Interesting and Informative",
                "reviewText": "Love this author's style. He calls it a documentary novel. There are notes in the back to explain creative decisions and historical detail. This book helped me gain a greater understanding for the political pressures in Palestine during the 1st century. I felt transported to Jerusalem.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin W. Haug",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIOEZHFTPZQUDOC6UN2FLUCEL6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UYSP3OH5G0OO?ASIN=B09RTQGNK8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 13, 2013",
                "reviewTitle": "4.0 out of 5 stars Intriguing Perspective",
                "reviewText": "In my 20 years of theological education and practice, I never had come across the perspective Maier shares. I do not know if this is because of ignorance on the part of my professors and teachers or because of a pervasive ideology running through liberal Protestantism (of which I am a part). What I do know is that Maier's novel fascinated me from the start.Little was ever taught regarding the Roman governing dynamics which played a part in Israel and the very tenuous relationship between the empire and the Jewish people. Maier reconstructs this throughout his novel and gives the reader a glimpse into those dynamics. He further shows how these matters directly affected the trial of Jesus of Nazareth.For those from a liberal protestant background, the book can be mind blowing at times, and if you come from that background and wish for this to happen, dive right in.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anthony(Tony) Riggio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAMJFN3RWLK4MEB5BKLMUCUKA2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5I5RMKB7TKK2?ASIN=B09RTQGNK8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2015",
                "reviewTitle": "5.0 out of 5 stars Roman History, the Crucifixion, diplomacy, The ancient Jewish mind",
                "reviewText": "March 3, 2015A review by Anthony T. Riggio of the novel Pontius Pilate written by Paul L. MaierI purchased this book in the Kindle format from Amazon and read it in a couple of days. The author is Paul Maier who is a professor of history at Western Michigan University.Pontius Pilate was a Roman Praetorian Guard and a protégé of L. Aelius Sejanus who was at the time of Pontius pilot's assignment as Governor of Judea, his intermediator to Augustus Tiberius, the ruler of Rome and its empire. Tiberius assigned Pilate somewhat reluctantly. He had nothing against Pilate but his delays in making assignment was due to his extreme paranoia concerning all of his subordinates and probably due to his ever growing mental lapses.Pilate is assigned to Judea and travels there with his wife Procula and their entourage. The subjects in Judea were a difficult people and almost immediately they tested Pilates Governorship making Pilate realize that this was just the beginning of his supervision of Judea. The Jews resented the fact that their ruler Herrod and his sons were subordinate to Pilate. Between the Herrod's and the religious Pharisees and the Sanhedrin civilian managers, who made life for Pilate miserable and causing intrigues which could doom his Governorship and possibly his life as a consequence of Tiberius' unstable view of life. Procula was the steering rudder to his reign and often gave him good guidance in view of the stresses of dealing with the Jews in Judea.Of course his reign is contemporaneous with the teaching life of Jesus of Galilee and soon their paths cross and Procula senses the possible ruin of Pilate over the controversies involving Jesus' supposed violations of religious law. His accusers tried to make this a violation of Roman law and Pilate was caught in this confluence of forces. He judged Jesus as innocent but because of the troublesome Jewish leaders, he was forced to condemn Jesus to his fate.Mailer tries to paint Pilate as a hapless but tryingly well intentioned victim of events that he had no control of and in spite of Procula's warnings, he follows through with the execution.A short period after, Pilate is summoned back to Rome at the demand of Tiberius and is facing certain punishment and possibly execution because of the complaints of the Jews and the Sumerians whose revolt he harshly put down. While travelling back to Rome, Tiberius dies and his successor is Caligula a soon to be mad emperor and who proceeds to make Pilates life miserable.I found this book very well written and researched and while certain events were filled in with the author’s view of probabilities as to dialogs and certain outcome. Overall Maier presented a well written work and substantiated it with a wealth of researched sources. I totally enjoyed reading this book and learned much of Rome and Judea during this significant period in the development of these times and future consequences of events portrayed in this work.I highly recommend reading this book especially for lovers of History and a view of events we learned it the Gospels. I rated the book with five (5) stars. It was a fun learning experience.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "paul forsyth",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 21, 2019",
                "reviewTitle": "Did not disappoint",
                "reviewText": "An historical drama of a real flesh and bones portrayal of Pontius Pilatus. It's fiction but the author has not taken too much liberty with the Biblical narrative",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 4, 2016",
                "reviewTitle": "I love the story very much so far",
                "reviewText": "I love the story very much so far. I am about one third of the book. I should have read Pontious Pilate first before reading \"the Trial of Jesus: Victim of Bigotry and Cowardice \" The reason is that we understand better why Pilate made the decision he did regarding the sentence of Jesus.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 27, 2015",
                "reviewTitle": "A great book",
                "reviewText": "Brilliant book. Easy to read and yet historically based - and accurate.Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phil",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 3, 2017",
                "reviewTitle": "Excellent Read",
                "reviewText": "Anyone who has a good working knowledge of the New Testament but not of Ancient Rome will love this book. It adds body to the context of the New Testament. Love how Paul brings history to life!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 26, 2014",
                "reviewTitle": "Pontius Pilate",
                "reviewText": "I thought this was a thoroughly absorbing read, well researched and elegantly told.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}