{
    "remaining_requests": 865,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Night-Angels-Weina-Dai-Randel-ebook/dp/B09YR79N3Q",
    "body": {
        "name": "Night Angels: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Night-Angels-Weina-Dai-Randel-ebook/dp/B09YR79N3Q",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81wX7w+cDiL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Weina Dai Randel",
            "link": "https://www.amazon.com/Weina-Dai-Randel/e/B00Y9ARK7S/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 18951,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09YR79N3Q"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Lake Union Publishing (February 1, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 1, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5436 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 375 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,700 in Kindle Store (See Top 100 in Kindle Store) #23 in Historical German Fiction #37 in Historical European Fiction #88 in World War II Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 18,951 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/68ddc002-cebb-4f57-b8fe-47808acc499a.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/b2615c4c-7486-4a90-99eb-abdc6514914d.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/548a8b8b-f582-4f2a-af14-50cf5bfbc0f7.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "P. K.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7XDYOYFDUV4FOTKCVW5SVW4R3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EUNXMQBTRGZA?ASIN=B09YR79N3Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent Historical Fiction",
                "reviewText": "Just when you think you’ve read every WW2 story out there, you discover something like Night Angels. Based on the real-life actions of Dr. Ho Fengshan, the Chinese consul general to Austria, and his wife Grace, this story of heroism, compassion, and quiet resistance in the face of grave danger is one you’ll never forget. Through Dr. Ho’s efforts, thousands of Jews were able to escape Nazi-occupied Vienna with the visas he issued. Despite countless warnings from his superiors, Dr. Ho never relented in his convictions or his single-minded humanitarian mission.Weina Dai Randel’s depiction of a Vienna on the brink of war is both beautifully rendered and harrowing in its depth and honesty. This is a novel you’ll want to take your time with—it’s not always an easy read, but it’s an important one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christin Keck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQRPXVZCIVSS2VI3FZNIPOKO5RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E0FMGGD9B4RU?ASIN=B09YR79N3Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2023",
                "reviewTitle": "4.0 out of 5 stars A historically accurate and beautifully written account of a terrible time",
                "reviewText": "This book is about Ho Fengshan, a Chinese diplomat stationed in Vienna in the mid-to-late 30's, just before WWII. He is an actual historical figure, and the novel is a dramatization of what it might have been like during that horrible time when the Nazis were beginning their horrible solution to the \"Jewish problem.\"Fengshan was married to a woman named Grace, a half-Chinese American woman, who is depicted in the book as being very childlike and dreamy--not very engaged with issues or the world, but very young and beautiful and an asset for Fengshan to take around to the numerous gatherings, parties and soirees that he must attend. However, Grace is just extremely introverted and not confident at all; she doesn't speak either German OR Chinese, she is lonely and isolated and withdrawn. Her husband is aware of this, and he hires her a tutor to teach her to speak German--a young woman named Lola Schnitzler. The two women meet in the park, and Grace is immediately captivated by Lola's strength and optimism, but from that first meeting something goes horribly wrong; Lola sits on a bench in the park and she and Grace are arrested by the Gestapo. Of course, this is because Lola is Jewish and because Grace cannot read the small sign on the bench, which prohibits Jews from using the bench in any way, to warn her not to sit there. The women are taken to the Gestapo headquarters where they meet Adolph Eichmann, and his gang of sadistic thugs. Lola is beaten, Grace, being the wife of the Chinese diplomat, is released earlier and treated somewhat better, but it focuses Eichmann's attention on her and her husband, and he begins a systematic harrassment of both, as much as he can get away with.Lola and Grace, however, manage through all of this to become friends--Grace's first and only friend in Vienna, and it brings Grace out of her shell and gives her confidence, and shows her that she has more strength than she knows. Over the next two years as the War ramps up and Hitler's tactics remove more and more freedoms from the Viennese Jews, this proves to be the saving of Grace, her husband, and even Grace's relationship with her 9 year old stepson Monto, whom she was convinced hated her.The story moves on through the machinations of the Holocaust and Grace and her husband Fengshan diverge into different coping strategies--Grace involves herself with Lola and her family, helping them get out of Vienna, encouraging her husband to grant them exit visas to Shanghai, getting Lola's niece Eva (also 9 years old) to safety in Britain by smuggling her to a rescue organization. And as she gains in strength and involvement, so does Fengshan--who defies his government's orders by issuing thousands and thousands of visas to Jews, until Eichmann manages to get them all sent to concentration camps or extermination centers. Fengshan becomes obsessed with saving as many as he can, even though he has no idea if any of the visas he issues are doing them any good. (They were. They DID.) And though there is some separation in their goals and activities, Grace manages to become pregnant--something she has always wanted. But Eichmann proves to be the worst villain of all. At the climax of the book, a tragedy occurs that will change everyone's lives, and which will nearly kill Grace, and it is Eichmann's fault entirely.The couple take different paths in their grief and to face the horrors that are uncovered by this situation, and Grace retreats even further than she was at the beginning. Fengshan risks his own life and puts his career on the line. Lola, who had been taken into custody again and sent to a ghetto and labor camp, has seemingly disappeared from Grace's life. She sinks into despair.I won't tell you how this ends, though you might think you know anyway. If you have seen Ken Burns' film \"The US and the Holocaust\" you will see how meticulously and accurately this novel has been researched. It's a fine companion to that film, in fact. The characterizations of Fengshan, Grace and Lola are spot on, and descriptions are perfectly drawn to evoke the time and place.I thoroughly enjoyed this book, despite its subject matter, which is just not pleasant to know or read about. I recommend it. The writing is quite good. And discovering that Fengshan was actually a real person, and that he saved thousands of Viennese Jews through defiance of his own government, and while his country was under attack by the Japanese, is uplifting. So few stories of the Holocaust are. The author does not stint on her historical facts, though she says she has \"imagined\" the daily life of Fengshan, and invented Lola and Grace's relationship entirely. It matters little. She manages to evoke the time and attitudes perfectly. This is an excellent read.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMN6UMJYYJRSZ73QL3GRV5ZOCOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ROD64OOEDXSQ?ASIN=B09YR79N3Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Ho Feng-Shan's wife was indeed in Vienna with him and his son",
                "reviewText": "I've been reading \"My Forty Years as a Diplomat\" by Dr. Ho Feng-Shan, and I'd like to refute the criticism of one of his relatives and some readers who said that his wife, Grace, was not in Vienna when the events told in this book happened. In fact, on page 48 of the Kindle version, Dr. Ho writes, \"For a few days before leaving Vienna, we lived at the nearby Imperial Hotel.\" Then, on page 49, he states,\"In May 1940, as I was to leave Vienna, . . . With my son Monto and Grace, we took the train to Trieste, Italy.\" It seems clear to me that Dr. Ho's wife Grace was, indeed, in Vienna with him during the period portrayed in this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert R. Clarke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5MQSNN4YL7KULQVKKZPYOQ25HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPT0H7R6Z26BT?ASIN=B09YR79N3Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars WEINA DAI RANDEL",
                "reviewText": "WEINA DAI RANDEL IS AUTHOR OF THE BOOK NIGHT ANGELS. THE STORY IS A CONTEMPORARY AND JOURNALISTIC ACCOUNT OF THE ATROCITIES AND LIFE COUNT OF A VIENNA REUNION STILL OCCURRING TODAY. ALTHOUGH THE BOOK FRAMES THE DIALOGUE AND PLOT AROUND A CHINESE VIENNESE WOMAN'S RECOUNT OF HER PAST ALOUD, THE MISGIVINGS OF THESE TRAUMAS ADD UP TO THE THIRD REICH OF THE GERMAN FURER ADOLF HITLER. THIS IS THE ONLY WAY TO UNDERSTAND THIS WAIF AND HOW SHE IS THERE TO PASS ON TRADITIONS AND CUSTOMS TO HER FRIENDS AND CUSTOMERS. THIS WAS A MIND-BENDING READ.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "F.K.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOJXCG2PKK7XNJXYABK6YT3FYRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JK7US8RHM7V0?ASIN=B09YR79N3Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Learn what happened to the Vinnese Jews",
                "reviewText": "Written from the perspective of the Chinese Consul General in Vienna and his wife, it is a compelling story of their lives in Vienna during World War II and in the process you also learn a lot about the atrocities committed by Adolf Eichmann to Viennese Jews. I am a WWII historical fiction fan, but had never gotten any perspective on what happened in Vienna. While it is still a 'story' and at the end of the book the author is very good in differentiating what was real and what was fictional, you still learn a lot about the horrible things that happened to the Jewish people there and how the Chinese Consul General tried to help.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dakobah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAF6LH6W3QNJW6R34F4MEA57O3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KQZJKS7PLHJ8?ASIN=B09YR79N3Q",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "3.0 out of 5 stars love the story but didnt love the ending",
                "reviewText": "not going to lie it was a hard book to get through, not because it was boring, but the way the Nazi's treated the jews was very hardbreaking. its like this throughout the whole book.usually a book sets up the hardship and the ending is how the protagonist overcame the problem at the end of the book.****spoiler warning****my issue is with ending of the book has to due with Lola Snitchzler . the entire book she faces so much hardship with her brother passing and cant get a visa or her train ticket. Just as you think she is finally going to get vengeance and feel like lola can get revenge from the way she was treated, we get a bad attempt at an assassination of a Nazi general, the author had to kill her off. There was such buildup only for it to be anticlimactic.3/5",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GMH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF25PDHWUCU22XOFAZHNQYHHGL4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29LJY3FMPH23L?ASIN=B09YR79N3Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent",
                "reviewText": "I loved the research that went into this book. The culture of the Chinese Diplomat, the culture of the American born Chinese Bride, the Vienna of years ago. All of this weaved into a story of heroism. Absolutely must read!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jack Olson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFURW6QHLUXUHDSOHRUZCUAGKFIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MUJ80KKS6P9G?ASIN=B09YR79N3Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Touching, tense and moving.",
                "reviewText": "This well written story builds complex relationships and characters. It is a story that shows how people and relationships are tested in times of upheaval. It was difficult to put down so enjoy the read’",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A guy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 28, 2023",
                "reviewTitle": "Could hardly put it down",
                "reviewText": "I just went through a rollercoaster of emotions while reading this book. It's very well written for an audience with a mature appreciation of literature. I mean to say that in a good way regarding the descriptive detail about people, places, thoughts, feelings, etc. I take got into the characters and felt their pains and joys. Also it's historical fiction, so it's not totally imaginary but very relatable. The author gave a small but realistic taste of war as well. I miss reading books like this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jaxbanham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 26, 2023",
                "reviewTitle": "captivating",
                "reviewText": "An extraordinary book giving an insight to the daily lives of those caught in the Nazi machine. A thought provoking read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Helen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 9, 2023",
                "reviewTitle": "INTERESTING READ",
                "reviewText": "This is a very interesting book about an unthought of aspect of the Nazi/Jewish question. I found it very interesting and very engrossing. A little slow to start but I could not put it down. The weaving of differing cultures and expectations was particularly interesting. Would thoroughly recommend it……",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 7, 2023",
                "reviewTitle": "Against all odds",
                "reviewText": "Grace is the American-born wife of Dr Ho Fengshan, the Consul General of China, currently based at the Chinese consulate in Vienna. As a diplomat’s wife, Grace is expected to accompany her husband to social gatherings and official functions. However, although being half Chinese herself, she can speak neither Chinese nor German. Coupled with the fact she is also shy, she therefore finds the fulfilment of these societal obligations both difficult and challenging.Fluent himself in German, Fengshan is keen for his wife to learn the language too. However, despite his attempts to introduce Grace to several tutors, she successfully manages to avoid them all until, running out of excuses, she eventually agrees to meet Lola Schnitzler, a young Viennese Jewish woman with whom she strikes up a close friendship.Unfortunately, with Austria now in the grip of the Third Reich, their friendship is a problem for Fengshan. Even though the Führer’s policies had strained relations between China and Germany, Fengshan’s superior had ordered him to maintain a functional diplomatic tie to the new regime – which meant avoiding contact with all Jews. With no other friends in Vienna, Grace refuses to abandon Lola, causing Fengshan to re-evaluate his loyalty. Torn between his duty to China, his love for his wife, and the growing injustice towards the Jews, Fengshan finally makes a decision that could put all their lives in danger.Having read the blurb, I was not sure at first whether I was going to enjoy this novel. However, I was glad I decided to depart from my usual preference for crime thrillers and take a chance, as ‘Night Angels’ proved to be not only enjoyable but totally engrossing.Set against a backdrop of Hitler’s growing hostility towards the Jewish population, the author has combined the heroic actions of the real Dr Ho Fengshan with the fictional story of two women, from very different backgrounds, whose forbidden friendship eventually destroys both their lives. This combination of both fact and fiction makes for both an exciting and moving read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul mcdonald",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 21, 2023",
                "reviewTitle": "A real page turner",
                "reviewText": "I enjoyed the characters and the story.The story starts in 1938 in Vienna and provides insight into the persecution of the Jews. Then Hitler invades Poland.“Hitler claims that in Poland, gallows after gallows have been erected to hang the good German people, many Germans are persecuted in a bloody frenzy of terror, and innocent German blood is flowing on the streets of Warsaw.”I can’t help but see the similarity with Russia’s invasion of Ukraine, whereby Putin claims the Russian citizens are being persecuted by the Nazis in Ukraine.Could this happen today?Unfortunately I think it could, and maybe already has commenced, only this time it isn’t the Jews being persecuted.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}