{
    "remaining_requests": 992,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/My-Dear-Hamilton-audiobook/dp/B077NN1WWF",
    "body": {
        "name": "My Dear Hamilton: A Novel of Eliza Schuyler Hamilton",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/My-Dear-Hamilton-audiobook/dp/B077NN1WWF",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51sBrSA5VfL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Stephanie Dray",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Stephanie+Dray&search-alias=audible"
        },
        "brand": "Stephanie Dray&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 11586,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the New York Times best-selling authors of America's First Daughter comes the epic story of Eliza Schuyler Hamilton - a revolutionary woman who, like her new nation, struggled to define herself in the wake of war, betrayal, and tragedy. In this haunting, moving, and beautifully written book, Dray and Kamoie used thousands of letters and original sources to tell Eliza's story as it's never been told before - not just as the wronged wife at the center of a political sex scandal but also as a founding mother who shaped an American legacy in her own right. A general's daughter... Coming of age on the perilous frontier of revolutionary New York, Elizabeth Schuyler champions the fight for independence. And when she meets Alexander Hamilton, Washington's penniless but passionate aide-de-camp, she's captivated by the young officer's charisma and brilliance. They fall in love, despite Hamilton's bastard birth and the uncertainties of war. A founding father's wife... But the union they create - in their marriage and the new nation - is far from perfect. From glittering inaugural balls to bloody street riots, the Hamiltons are at the center of it all - including the political treachery of America's first sex scandal, which forces Eliza to struggle through heartbreak and betrayal to find forgiveness. The last surviving light of the Revolution... When a duel destroys Eliza's hard-won peace, the grieving widow fights her husband's enemies to preserve Alexander's legacy. But long-buried secrets threaten everything Eliza believes about her marriage and her own legacy. Questioning her tireless devotion to the man and country that have broken her heart, she's left with one last battle - to understand the flawed man she married and the imperfect union he could never have created without her.... Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b?ie=UTF8&node=10177"
            },
            {
                "name": "Biographical",
                "link": "https://www.amazon.com/Biographical-Historical-Fiction/b?ie=UTF8&node=9332127011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "23 hours and 7 minutes"
            },
            {
                "name": "Author",
                "value": "Stephanie Dray, Laura Kamoie"
            },
            {
                "name": "Narrator",
                "value": "Cassandra Campbell"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "April 03, 2018"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B077NN1WWF"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,454 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #41 in Biographical Fiction (Audible Books & Originals) #79 in Biographical Historical Fiction #142 in Biographical Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brooke Connolly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW65DC4FTM3ELHPNPHBMZE5D47Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FNY989SSNEZS?ASIN=B077NN1WWF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Very heavily researched",
                "reviewText": "I thought this was by far the best of the historical fiction books that were released in the wake of the musical. It’s actually quite true to history and the authors obviously did an insane amount of research. I actually connected with Eliza in this novel and believed in the romance, which I found difficult in some of the others. I recommend it to historical fiction lovers, especially ones with an interest In Alexander/Eliza Hamilton.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shannon Ross Stahl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG3TFQKE3ZOV5CSDHZ7CNFTZDYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OJIKZ46DBUQH?ASIN=B077NN1WWF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars I quite enjoyed this book presented from Eliza’s point of view",
                "reviewText": "Enjoyable read; easy to read; and I respect that some assumptions need to be made in lieu of having historical evidence - I do enjoy historical fiction!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELFSED45MC2HFH4SOCAUYFMPBYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LNTHSCULPAIG?ASIN=B077NN1WWF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2023",
                "reviewTitle": "4.0 out of 5 stars who needs Broadway?!?!",
                "reviewText": "Amazingly written, heartfelt, and inspiring. This book is fully of surprises and a differently light on one of americas founding fathers. Highly recommend for historical fiction lovers!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denise Guajardo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG7SLSSSOUJPWAX4NYVOG46MWMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PF0EXU1WFVP7?ASIN=B077NN1WWF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Very interesting and entertaining",
                "reviewText": "I am especially happy for the details included afterwards which explain what is historically accurate and what is fiction. I enjoyed all of it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary E. Trimble",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMSMFZQIIGKSIY7PKJGRHXM65GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31O7TUB7XTBGR?ASIN=B077NN1WWF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2020",
                "reviewTitle": "5.0 out of 5 stars Held my fascinated attention",
                "reviewText": "My Dear Hamilton: A Novel of Eliza Schuyler Hamilton by Stephanie Dray and Laura Kamoie, is an epic story written in the voice of Alexander Hamilton’s wife.The novel covers the period of 1777 through 1837. Elizabeth Schuyler, the daughter of a general, grows up in colonial North America during the American Revolution. When she meets a young officer, Alexander Hamilton, she’s captivated by his charisma and brilliance and falls in love despite his perceived shameful bastard birth and the uncertainties of war.Elizabeth, or Eliza, as she prefers to be called, finds herself in the thick of war, ugly politics, even scandal. Hamilton is revered by many, but also has powerful political enemies. The Hamiltons joyfully celebrate the inauguration of George Washington, the nation’s first president. The two main political parties of the day are the Federalists, President Washington’s party, created largely by Alexander Hamilton, and the rival Republican party, formed by Thomas Jefferson and James Madison.The Hamiltons have several children and Eliza works hard as a wife and mother. Although many in high office have slaves, the Hamiltons firmly believe in the concept of the Constitution, that all men are created equal, applies to all, including slaves and women. They believe slavery is cruel, a sin against God, and a betrayal to the principles of the revolution. Eliza not only makes due with their meager finances, she helps her husband with his speeches and social obligations. They have a loving and supportive marriage.When a sex scandal encroaches her own home, Eliza struggles through heartbreak and betrayal to find forgiveness. She is a strong woman, a woman of passion and principles. Eliza finds the strength to face the humiliation, the gossip mongers, the cruel newspaper accusations. Eliza is an inspiration, an American legacy in her own right.My Dear Hamilton is a large volume—672 pages—that held my fascinated attention throughout. I learned so much about the attitudes and conditions of our nation’s early years. Alexander Hamilton was a remarkable man. He fought and helped win a war, raising to the rank of general. He was instrumental in building a federal government. He created a coast guard, a national bank, and devised a scheme of taxation that held the states together. He was brilliant, but flawed, as Eliza was to learn. I loved reading about our country’s early days and I appreciate even more what it took to establish our great nation.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnnetteBReviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4OAEALEOJ4TRA2CK33UKT4F4FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VBNVED5QG88J?ASIN=B077NN1WWF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2019",
                "reviewTitle": "5.0 out of 5 stars Insightful Story of American History",
                "reviewText": "A collaboration of two very talented writers brings an insightful image of a remarkable woman Elizabeth Schuyler Hamilton: “…the boyish sort of girl who preferred climbing trees and hiking through the woods, or the veritable spinster, more concerned with nursing sick soldiers than landing one for a husband.” But Alexander Hamilton’s love had changed everything.1780 Morristown, New Jersey. On a cold winter day “and in the darkest hour of the war,” Eliza carries a letter from her father to General Washington at Ford Mansion. At the bustling headquarters, she meets a young aide-de-camp Alexander Hamilton.Their attraction is instant. He is torn, because of his background of illegitimacy, not matching her social status. But she accepts him. His manners, intelligence and ambition are what matters to her.As a wife, she learns how to manage temperamental outbursts of her husband. And she learns from an experienced wife, namely Mrs. Washington. “Sometimes we encourage, sometimes we challenge, and sometimes we manage…”1783 Philadelphia, Pennsylvania. Now, a congressman’s wife as Hamilton was “elected to serve as one of New York’s five delegates to the Congress of the Confederation.”The Treaty of Paris grants America her independence, forcing the British soldier to leave the newly forming lands. With that, the aftermath brings unstable currency, hostility, and the lawlessness. “No sooner had we driven the king from our shores than we seemed intent on proving that we were uncivilized people who couldn’t live without a monarch to keep us from behaving as beasts.”The confrontation continues with those for or against a strong central government.When George Washington becomes the first President, Alexander Hamilton becomes the first Secretary of the Treasury.As Hamilton’s career advances, his private life takes a different turn. He claims it was a set up involving a woman. And now he is blackmailed for adultery.He “embroiled himself in two affairs of honor in the space of an hour.”Years later, another duel doesn’t go well for Hamilton.Told with impeccable prose and smooth dialogue, progressing easily and naturally. The etiquette of ballrooms, rivalry of soldiers, courtly manners and intelligence come alive in this complex story.Set against the wars for independence and conspiring time to build a new country free of king, with its new laws. It brings a very insightful history lesson, full of ambition, rivalry and love. A very passionate love for creating a new nation.Above all, this is a story of Elizabeth Schuyler Hamilton. A woman who went through marriage and motherhood, who experienced losing a husband, child and a sister who was also a very close friend and confidante. Her feelings and emotions through all this are movingly depicted.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFJ5H7BWSONEPU6MSRM5DCAB5WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18WJZIJXG1RTK?ASIN=B077NN1WWF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2023",
                "reviewTitle": "4.0 out of 5 stars Interesting spin on history",
                "reviewText": "Enjoyable spin on historical figures. Brings history alive. Recommended reading for women's viewpoint. We're so often mere footnotes in historical accounts.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paula E. Gervis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2ZGSMV654YIXC4KVL2JICJKOMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R83M7EVR328QR?ASIN=B077NN1WWF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars arrived on time",
                "reviewText": "good condition",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carol",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 29, 2023",
                "reviewTitle": "Any Hamilton lover will enjoy",
                "reviewText": "I love the musical Hamilton and this book was interesting to me so I purchased it. I have to add a warning as the book does not completely follow the theatre play flow but it is still a marvellous read. Worth reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcela LimonMarcela Limon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 14, 2021",
                "reviewTitle": "Las hojas están mal cortadas.",
                "reviewText": "Aun no lo he leído, pero las páginas están mal cortadas lo cual le da una mala apariencia. Es mi única queja.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/D1DFyYzW+eS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonio V.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 14, 2022",
                "reviewTitle": "Eliza Hamilton is a delight",
                "reviewText": "The story was incredibly engaging and Eliza's story is always breath taking",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Johannes Schäffner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 12, 2020",
                "reviewTitle": "Simply stunning",
                "reviewText": "A must read for everyone even remotely interested in the era of the founding fathers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L.D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 28, 2020",
                "reviewTitle": "Amazing!!!",
                "reviewText": "Excelente libro!! Mi hija es fan del musical Hamilton y está encantada con el libro. Aprende historia y relaciona los hechos del libro con el musical. Recomendable 100%",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}