{
    "remaining_requests": 972,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Between-Shades-Gray-Ruta-Sepetys/dp/014242059X",
    "body": {
        "name": "Between Shades of Gray",
        "price": "$9.21$9.21",
        "originalPrice": "",
        "rawPrice": 9.21,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Between-Shades-Gray-Ruta-Sepetys/dp/014242059X",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81LNxn8xNUL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ruta Sepetys",
            "link": "https://www.amazon.com/Ruta-Sepetys/e/B003NWP99Y/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 10116,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 17 hrs 2 mins",
            "FREE delivery Wednesday, February 28 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Philomel Books (April 3, 2012)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 014242059X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0142420591"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12+ years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL490L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.96 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,221 in Books (See Top 100 in Books) #7 in Teen & Young Adult European Historical Fiction #8 in Teen & Young Adult Holocaust Historical Fiction #20 in Teen & Young Adult Fiction on Prejudice & Racism"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 10,116 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Bletchley Riddle I Must Betray You The Fountains of Silence Salt to the Sea Between Shades of Gray Out of the Easy Read more by Ruta Sepetys: This middle grade WWII historical adventure follows two siblings at Bletchley Park as they try to unravel a mystery surrounding their mother’s death. A gut-wrenching, startling historical thriller about communist Romania and the citizen spy network that devastated a nation. A gripping, extraordinary portrait of love, silence, and secrets under a Spanish dictatorship. This epic WWII novel shines a light on one of the war's most devastating—yet unknown—tragedies. A story of loss and of fear -- and ultimately, of survival. A rich story full of secrets, lies, and the haunting reminder that decisions can shape our destiny.",
                "media_link": []
            },
            {
                "media_text": "Between Shades of Gray: The Graphic Novel You: The Story Read more by Ruta Sepetys: A story of loss and of fear--and ultimately of survival--in a brand-new four-color format. The nonfiction debut by #1 New York Times bestselling and Carnegie Medal-winning author Ruta Sepetys. Perfect for fans of Burn After Writing and Bird by Bird.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5730c5d3-d33d-4713-be87-9336fe9ba84f.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b7c66eb-358d-441b-8393-8fe3f6c87894.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72b7900d-3a9f-445a-afb6-b79c56a59f5b.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bcfd082b-877e-4a04-ae86-f3ac6b6d1736.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d063456a-d8b5-4aab-ab8a-4001495a54fc.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b80caa3c-261c-4559-9c14-477ca48a9ae4.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/40a17e9d-74fd-406f-bbcc-67a8eff1e3ba.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/298bb120-4aaf-40b6-a6c2-cd225f61ede7.__CR0,0,300,600_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kimbie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGNQIXZBBHK2RPPEKCZH6AE6UUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E20UIKAAWMNC?ASIN=014242059X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars An Amazing Story!",
                "reviewText": "I could not put this book down, read it in one day. I don't know that much about Russian history except for the non aggression pact with Germany during WWII and Hitler's subsequent. turning on them.This story barely touches on that. It is about Stalin going after people in the Baltic states and sending them to Siberia as enemies . Luna is a 15 year old girl who dreams of being an artist, living a comfortable life until her family is taken from their home and deported to Siberia. It is about surviving and also dealing with heartbreak.My only complaint is that I want more. This book could have been twice as long and I would have been happy. A great read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7UEVZR22QZMYDUFMGPVZ4WRKEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UI65KPCUJ43U?ASIN=014242059X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Sad Novel",
                "reviewText": "\"Between Shades of Gray\" by Ruta Sepetys is a poignant and haunting portrayal of a lesser-known aspect of World War II—the forced deportation of Baltic peoples by Stalin's regime. The story revolves around Lina, a young Lithuanian girl, who, along with her family, is torn from her home and sent to a Siberian labor camp.It's a book that educates, enlightens, and deeply touches the reader's heart, leaving a lasting impact.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sara B. Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE63C4VLHAN4CUJTVV5TFUUE7SZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z6505E42NWF7?ASIN=014242059X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Fantastic start to the New Year",
                "reviewText": "A surprise to read a fiction based under Stalin’s rule and from the victims perspective. My only complaint is I wasn’t big on the jump back to recent memories in between story lines. I also wish the story had not stopped so abruptly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kürzel,R.F.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGY2RMUF45VPMJCWNKSC3UF7GQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REB80KHNJNJI1?ASIN=014242059X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Best book I read",
                "reviewText": "I loved her style of writing, just beautiful. Very touching . I didn’t want to put the book down. It really drew me in.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laima",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAOW74ROZPPUSWVOFORJUW76IMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VC18O083GZPM?ASIN=014242059X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2012",
                "reviewTitle": "5.0 out of 5 stars Journey into the Backwaters of the Heart",
                "reviewText": "Journey into the Backwaters of the Heart: Stories of Women Who Survived Hitler and Stalin I read Ruta Sepety's \"Between Shades of Gray\" with fascination. As a Lithuanian-American I had grown up with the stories of Stalin's gruesome deportations to the Far North. While studying at Vilnius University in 1988-89 I was asked by the Lithuanian publisher VAGA to translate excerpts from Laptev Sea survivor Dalia Grinkeviciute's memoir \"Lithuanians by the Laptev Sea\". Working with Grinkeviciute's text changed me forever. No longer could I see the facade of things (I was at the time living in Vilnius, which was part of the former Soviet Union) but saw through the facade to the gruesome reality of the machinery of the GULAG system that had built and fed the fast-paced growth of Soviet industry during the Stalin years.Twenty years later, in 2007, as part of my Fulbright project, I interviewed survivors of Siberian exile for my work of literary journalism \"Journey into the Backwaters of the Heart\". At the time I met and interviewed a woman named Ryte Merkyte, who was exiled to the Laptev Sea, the exact location that Sepetys's protagonist Lina is exiled, at the age of nine. Her crime--her mother was a mathematics teacher who was not good at hiding what she really thought about the Soviet occupation. In our conversations Ryte did not focus only on telling me about the horrors of those dark years of deportation, but talked to me of survival, as in spiritual survival. She had a lot of insight into how a human being endures such conditions and not only remains human, but comes out of the experience with a sense of enlightenment about the human spirit. I'd like to quote a few things that Ryte said to me, which appear in the chapter \"The Woman Who Slept With a Packed Suitcase Under Her Bed\" in \"Journey into the Backwaters of the Heart\".\"Even now I sleep with a packed suitcase under my bed--just in case the Russians start deporting Lithuanians again. This time, I'll be ready.\"\"In order to survive, you must throw away all your bad energy. Anger takes up too much energy. That is why most exiles are so spiritually balanced. After a person has lived through what we have, you learn to experience everything in life with joy. It is like when a boat is sinking. At first the passengers in that boat toss out a few things to lighten the load. Then they toss out a few more things. Finally, they throw everything out in hopes of surviving. For those of us who ended up in the most extreme place of deportation, the far north, it was like that. Your body can barely hold on, so you gather all your strength and focus on one thing--to live. You throw away all the negative emotions, all the anger, the hurt, the jealousy. And that makes you spiritually free. Once you've thrown them away, and I mean really thrown them away, then they are gone forever.\"\"There have been many dictators in history who have murdered entire nations. But never before in history has a regime succeeded in destroying a nation's morality like the Soviets did in Lithuania. Once a nation's morality is destroyed, it is almost impossible to get it back.\"\"I still remember winter in the Arctic. For one entire month, there is no sun. Then one day, a little pink shows up on the horizon. Then, when you see the first rays of the sun break through, you feel unimaginable happiness. Then slowly the light returns and then it is sunny all day long. There were exiles who went blind when the sun came back. They went blind from the light reflected off of the snow. That first year for a month we had all walked around in total darkness and could not see each other. When the sun came back and we saw each other again, we were horrified: We saw emaciated, dirty, diseased skeletons where once we'd seen human beings.\"The stories that I collected from women who had survived Siberian exile, as well as those of women who had joined the armed resistance against the Soviet occupation, inspired me to explore how the memory of war and terror is passed down the generations, even when the younger generation grows up in America, safe and far away from the place where these terrible events took place. I let my imagination roam and the result is the novel, \"This is Not My Sky\". This is Not My Sky: A Novel",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roseann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYB4MVMWCPZJX2CSV5JP4VIT3SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RBKDX19HDP71?ASIN=014242059X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Granddaughter enjoyed it.",
                "reviewText": "I’ll do anything to encourage my grandkids to read. When they enjoy an author,I try to find other books they have written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brielle Bennett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWSJ677NKBE7IO7OX2O7PKRPJ3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UYMVXM9UFXJ9?ASIN=014242059X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 21, 2023",
                "reviewTitle": "4.0 out of 5 stars An Amazing Story About an Overlooked Part of World History",
                "reviewText": "this is an old favorite of mine that i first read 8 years ago as a required reading in 7th grade. i didn’t remember much about it, however, i did remember how much i loved it! so i bought it and read it again recently :)between shades of gray is a YA historical fiction novel, telling the story of a teenage girl, lina, whose family is deported to a labor camp in siberia during the soviet annexation of lithuania.i absolutely loved the way this story was told. it takes place during a terrible time in world history, but i loved the way it emphasized hope.before reading, i never knew of the events that took place regarding the soviet union during the second world war. this was truly an eye opening read.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "colleen wall",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 1, 2024",
                "reviewTitle": "My favourite",
                "reviewText": "Definitely one of my top 5 favourite books. Raw, real, suspenseful, and heart warming.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine Boos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 17, 2021",
                "reviewTitle": "Deportation of Lithuanians during WWII by the Soviet Union",
                "reviewText": "What an experience this book was!!! It took me on a long and gruesome journey of deportation from Lithuania in 1941 to Siberia to end on the Arctic circle. The main character, Lena, 15 at the beginning of the story will not give up on her will to survive hardest work, starvation, diseases and death around her. Whether she finds her strength in her drawings depicting the people around her and hoping they will reach her father, or in her youth, anger at all the injustices she experiences, she strives at remaining true to herself. Extremely well written, the author succeeded in intertwining the present horrors to memories remembered by Lena which might have helped her to go each day a bit further. The story swirls in constant tension. However, the chapters are short which allowed me to breathe out and relax.Excellent read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francisco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 28, 2019",
                "reviewTitle": "¡Excelente historia!",
                "reviewText": "El libro está muy bien escrito, además, te ayuda a conocer un poco más a historia de la segunda guerra mundial, pero no simplemente el lado alemán, francés, sino el lado ruso.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shilu LkrShilu Lkr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 14, 2019",
                "reviewTitle": "Heart wrenching yet beautiful book",
                "reviewText": "How do i even begin describing about this book and the life lesson it has taught me. I was warned before i started reading and i will warn you with this - READ ONLY WHEN YOU ARE ALONE. WHY? BECAUSE THERE’S 99.9% CHANCE YOU WILL CRY. But if you are morbid and have weak heart just like me, it might haunt you for days or maybe even forever. I found myself sobbing in many parts. Still after turning down the last page, i couldn’t stop thinking about the hardship and atrocities the characters on this book has gone through.I’m thankful to @rutasepetysauthor for this amazing masterpiece. For throwing light on the rules of Soviet Union, otherwise for me, World War II was all about Holocaust, Nagasaki & Hiroshima and how the Jews suffered from Hitler. It’s also selfish of me to say but throughout the book, i was thankful to God & life that we aren’t going through this devastating siege like those people have gone through. I look back at ‘not so beautiful’ life of mine yet took deep breath..This book tells about a 15year old Lithuanian girl, Lina who along with her little brother & mother were deported to work in labor camp in Siberia by Soviet Police popularly know as NKVD. She doesn’t know if she’ll ever see her father or friends again yet she hopes for her family, her country, her future and her first love.The author, Ruta Sepetys wrote based on first hand family accounts & memories from survivors. It’s heart-wrenching. If you love history & history fiction, this one won’t fail you. Go and get it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Fe1gLS07L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zbsI59vTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dini",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 8, 2019",
                "reviewTitle": "Powerful, heartbreaking & full of enduring hope",
                "reviewText": "Late one evening in 1941, 15-year-old Lina is dragged out of her home by Soviet soldiers, alongside her mother and brother. She’s confused, scared, worried for her father and most of all wondering, why them? This story chronicles their journey to and their experience in Siberia where Lina and hundreds of thousands of Lithuanians, Estonians, and Latvians, identified as criminals against Soviet rule, were deported to slave in labour camps or outright exterminated. With her world torn apart and having to deal with trauma, loss, grief and despair, Lina keeps a tight hold to the hope of survival through her memories and love of art.“Have you ever wondered what a human life is worth? That morning, my brother’s was worth a pocket watch.”This was a harrowing and heartbreaking novel full of enduring hope in the face of absolute brutality and injustice. It was a testament to hope and love and kindness. I have always been gripped by historical fictions ever since I read books like Anne Frank’s Diary, the Devil’s Arithmetic, Night, and others about the holocaust, in school. I admit though, that I didn’t have any prior knowledge about the same horrors happening in other countries and to other peoples during that same period. This was a very educational read, as much as it was a poignant account of those who suffered under Soviet rule.Sepetys writes in a simple, yet powerful and compelling way that made it difficult to put this book down. I dreaded having to leave for work in the morning because I knew I had to put it to the back of mind and I couldn’t wait to race home and pick it up again at days end. I thought that all the characters in the book were well written and many of them had believably mature personas that I oftentimes forgot that Lina was only a teenager and her brother Jonas, only a boy.I greatly admired Lina’s strength of character throughout her story and her ability to keep hanging on to hope even in the most dire of circumstances and through the most debilitating of losses. Her strength and even youthful optimism in the face of adversity lent a lightness and much needed hopefulness to the situation that reminded me in ways of Anne Frank and her perception of her situation. Just as Anne did, I liked that rebellious Lina recorded events through her art and writing, despite the dangers of being discovered. Maybe it was selfish at times but it was also her way of ensuring that nothing was ever forgotten. What I also found very inspiring was that despite the amount of suffering that was inflicted upon Lina, her family and those around her, there was so much forgiveness and even kindness given to the enemy. All the characters felt so very much like family at the end and even the most frustrating/maddening characters managed to redeem themselves too.Although I felt the ending came quite abruptly, I can see why it was done that way, and I thought it wrapped the story up on a positive note, giving readers hope that there will be a somewhat happy ending to this story after all.This book made me think a lot about how despite having learned something from our history, it seems that we haven’t learned enough from it. There is still so much fear in people—fear of differences and of things that they don’t understand. It’s disheartening to know that there are still so many greedy, selfish and egotistical people in positions of power who use their words and actions to rouse hatred towards and stoke fear of others. But still, I believe in the power of human compassion and I stand with those who find the strength to step up against these types of people and their abhorrent actions. In her authors note at the end, Sepetys gave more background information to the Soviet massacre of over three million citizens of the Baltic states. I think the greatest lesson to be taken from this novel was beautifully summarized by her:“Some wars are about bombings. For the people of the Baltics, this was was about believing. In 1991, after fifty years of brutal occupation, the three Baltic countries regained their independence, peacefully and with dignity. They chose hope over hate and showed the world that even through the darkest night, there is light... These three tiny nations have taught us that love is the most powerful army... —love reveals to us the truly miraculous nature of the human spirit.”This was a fast and beautifully written read. I definitely look forward to reading more books written by Ruta Sepetys!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$4.54",
                "sellerName": "VikaSP",
                "sellerRating": "4.5"
            },
            {
                "price": "$4.29",
                "sellerName": "2ndchancebooks",
                "sellerRating": "5"
            },
            {
                "price": "$9.21",
                "sellerName": "Prime Goods Outlet",
                "sellerRating": "5"
            }
        ]
    }
}