{
    "remaining_requests": 950,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Exiles-Novel-Christina-Baker-Kline/dp/006235633X",
    "body": {
        "name": "The Exiles: A Novel",
        "price": "$10.95$10.95",
        "originalPrice": "",
        "rawPrice": 10.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Exiles-Novel-Christina-Baker-Kline/dp/006235633X",
        "soldBy": {
            "sellerID": "A1YF2PESGKL3NT",
            "name": "Shakespeare Book House",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1YF2PESGKL3NT&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "Only 9 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41wh2bm2mFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31NbI65t kL.jpg",
            "https://m.media-amazon.com/images/I/516xHO6wfaL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Christina Baker Kline",
            "link": "https://www.amazon.com/Christina-Baker-Kline/e/B001I9VW40/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Shakespeare Book House",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 10354,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 8 hrs",
            "FREE delivery February 26 - 28 on orders shipped by Amazon over $35",
            "Or fastest delivery February 25 - 27",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Monday, February 19. Order within 8 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Mariner Books; First Edition (July 6, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 006235633X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062356338"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 0.023 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 0.9 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,770 in Books (See Top 100 in Books) #164 in Cultural Heritage Fiction #689 in Women's Friendship Fiction #2,209 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 10,354 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c98b9dd8-a141-4dbb-9f42-cec84d9435bd.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce717b6d-ef6c-4b9f-a5f8-690c45462985.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9ec35e31-2679-420e-b609-3cadfe460dab.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ac0f6f76-19e6-4862-af0e-0dddaedbe07a.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "M D Tuch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLWNPFB6JGLN5IVAXAC7AGYKBJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OPA1Z1MCUPX2?ASIN=006235633X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2021",
                "reviewTitle": "5.0 out of 5 stars big fat shiny five stars",
                "reviewText": "‘The Exiles’ is a delightful book, a big fat shiny five stars. The subject matter is so relevant, even today. The penal colonies of Australia are a repugnant blotch in England’s expansive history, although many other nations can credit themselves with their own disgusting pages in their own histories. The 1840’s, the particular period of this novel, was a flourishing time for the fortunate, but for the unfortunate masses that polite society deemed different for whatever petty reason, life presented a daily struggle to survive, a varied version of hell on earth. But my purpose is to review this wonderful book, not to pass judgement on any nation’s failing.Evangeline is a delightful character and I felt a connection with her right away. Pressured into an affair resulting in pregnancy, she is accused of stealing a gift from her lover. Fourteen years transportation. Prison in Australia. A lot has been said about Evangeline’s naivete and her surprising story arc. I believe she was no more naïve than most girls her age, facing similar circumstances. I also commend Kline for making such a bold move in Evangeline’s story. The nerve! Difficult to read but grittily real in its happening. And then there was Mathinna, the aboriginal young orphan. I felt for her as well, enduring the bigotry of the colonial English rulers. Her story arc was also amazing and at the same time, realistically distressing. But all the characters were very credible, some, like Hazel and even Olive, were inspirational. The dialogue was spot on. The prose was beautiful, yet at times as rugged as the locale. Kline expertly places the reader on the high seas aboard a slave ship, then in the dark, dank, Hades-like prison known as The Cascades. I felt a link, albeit safe, with the convicts as they endured the hell of their days spent in solitary. The blunt hopelessness of their dreadful day to day lives.Kline provides a moral of a sort. A lesson to be learned. “Hazel had made a life for herself that would not have been possible in Great Britain, where the circumstances of her birth would’ve almost certainly determined the story of her future.” The hardships that people endure to achieve a better life, for themselves and their children, always makes such a great story. Kline tells it splendidly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie Nelson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEV55HIC2TIXGM3GKHFSRLWRSAHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1L42U0LG6G9KA?ASIN=006235633X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "4.0 out of 5 stars A tale of strong women",
                "reviewText": "I knew nothing about the transport of prisoners from England to Australia, other than it happened. This novel brought their story to life for me, along with the story of an aboriginal girl taken from her homeland. The common thread was the unfairness of their plights. Bad things happened to women back then and some very strong women emerged.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blue Eyes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDVOUXEKZNRWDTH456RX7BXWJWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNE05LY98SG1G?ASIN=006235633X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Heart breaking and heartwarming",
                "reviewText": "Women convicted of minor infractions are transported to present day Tasmania and sentenced to serve terms in multiples of 7 years. Many do not survive the sea voyage, the sailors on the convict ships, or the other prisoners. For those that do some survive the prison and convict work and go on to better lives.As a side story, a young aborigine girl orphan is taken as a “pet” as the white “invaders” of their land consider them little better than animals. Her story is heartbreaking.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3BWJW3LCOB67RM7RFX4KCIFX4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ3N3WGHDEPDL?ASIN=006235633X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 28, 2021",
                "reviewTitle": "5.0 out of 5 stars A storyteller extraordinaire",
                "reviewText": "Christine Baker Kline's beautifully crafted novel about the prison ships heading to the wilds of Australia with convicts, that in this instance were women. These women convicts were in most cases sentenced to harsh penalties for crimes that that didn't merit such terrible punishment's-pickpockets, harlots, debauchery.There are two concomitant stories, one takes place in England. It begins with Evangeline Stokes a young innocent governess, who through her misdeeds in service to her upper class employers was sentenced to 14 years of incarceration, beginning with her transport from England to Australia on a prison ship. Evangeline's friendship with a young woman named Hazel Ferguson. Their relationship changes both their lives. Hazel ultimately becomes the central figure in the book.The second story is about a young girl named Mathinna, an aborigines child of the Palawa tribe who ended up living with an English royal couple, Lord and Lady Franklin. oversaw the prisoner island of Van Diemen's Land which we know today as Tasmania. Mathinna was given a home with the Franklins mainly as an experiment to try and educate and \"tame\" this \"wild\" native to see if they could ultimately fit her into English society. The free Settlers from England viewed the Aboriginal population basically as savages.How these two young women come together in the story during the last third of the book.The thrust of the story is about women who fight against prejudice, the unjust, and unfair moral code that men are not a part of but women are. They fight for justice in a world dominated by men in order to be part of society to which they have so much to give.It is also a moving story about the stratagems of social class in that the rich have all the power and are always right, the poor have no power and are always wrong.Kline's research for this book is incredibly deep and accurate. The vivid descriptions of this wild continent of Australia in the middle 1800s, the intense agony and harsh conditions in which these women lived as prisoners brings you full throttle into a story you will not soon forget..",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erin Michelle Ross",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 31, 2023",
                "reviewTitle": "Fabulous historical fiction",
                "reviewText": "This is hands down one of my favorite reads of 2023. I was swept back to England and the plight of an unwed governess convicted of crime and sent to Tasmania. I met the many women and a few men that marked her journey. It was one of much despair and heartache. At times, I thought my own heart would break as there was just so much cruelty that Evangeline, Olive, Hazel , Mathinna and Ruby faced. Yet history is cruel and full of heartache. But I am ever changed by reading this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 25, 2021",
                "reviewTitle": "NONSTOP READ",
                "reviewText": "Loved it, so interesting to know this part of history pertaining to women....a great read, you will not be disappointed",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bridget",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 25, 2020",
                "reviewTitle": "I wish that this was available on Audible in the UK.",
                "reviewText": "I am still reading this my second book by this author; I'm really enjoying it but like to swap between my kindle and audible as a rule. Frustratingly, I'm unable to do this in the UK but would be able to in the US. Please Amazon, can you make the 2 available at the same time please? I thought about delaying reading this and maybe should have done so.I have now finished this. It is an excellent and thoroughly researched novel about women exiled to a penal colony in Van Diemen's Land in 1840 and to a lesser degree, the impact of British colonialism on the native people of Australia. I found it both gripping and interestingly detailed about every aspect of convict life in Hobart Prison.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "STEFFI",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 31, 2021",
                "reviewTitle": "Worth reading",
                "reviewText": "I really enjoyed this book. Heart-wrenching and so hard to put down. The ending felt like the story had just begun. Well done.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jo Fountain",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 28, 2020",
                "reviewTitle": "Pretty good read!",
                "reviewText": "I enjoyed this but it was somehow lacking in depth of characterisation! I couldn't fully connect with the main characters. They were a little empty and so didn't quite give the subject matter the oomph it deserves!!I was drawn to this by the title because back in the early 80's as a young teenager my mum and myself read a book called The Exiles by Vivian Stuart, the first of The Australians series of, I believe, 6 books! About a young girl who ends up in Newgate prison and is shipped off on the convict ships!I still have that battered, dog eared book that my long gone mum bought 2nd hand from a market stall back in about 1981. It still is probably my most favourite, or at least in the top 3 of my best books ever!!!My Mum read the series but I was new to the adult section in the library and wanted to read EVERYTHING hahaha! How I wish we had bought them all back then, as they now cost a fortune as 2nd hand copies! That gave the subject matter the justice it deserves and I still remember it today.Maybe that is why I can't quite give this book a better review! However I have read some of the blurbs on her other titles and have saved them to my, to read list, hence the 4* because it may not have lived up to what I wanted it to, but I did enjoy her writing!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}