{
    "remaining_requests": 856,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Babylon-Jewish-Captivity-Michelle-Cameron-ebook/dp/B0CB78NNCZ",
    "body": {
        "name": "Babylon: A Novel of Jewish Captivity",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Babylon-Jewish-Captivity-Michelle-Cameron-ebook/dp/B0CB78NNCZ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91Rte4PqK9L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Michelle Cameron",
            "link": "https://www.amazon.com/Michelle-Cameron/e/B001UC73TI/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 34,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CB78NNCZ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Wicked Son (September 12, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 12, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4420 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 472 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#265,788 in Kindle Store (See Top 100 in Kindle Store) #263 in Ancient Historical Fiction #288 in Jewish Literature (Kindle Store) #324 in Ancient History Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 34 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A simon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZZDJXBV4HNEOD5K7GW4RREPNJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3O0GZCWQNVD35?ASIN=B0CB78NNCZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars A Magnificent Achievement",
                "reviewText": "Michelle Cameron’s meticulously researched, multi-generational saga can be read on many levels of appreciation. First, it is a well-paced, gripping novel, filled with memorable characters immersed in a dramatic and intricate plot that sweeps across the landscape of ancient times. It is a sensual cinematic treat. Second, it is a depiction of a pivotal historical era as fictional characters mix with actual royalty and prophetic biblical figures. Next, it is a brave examination of profound moral dilemmas involving racial purity, as well as the life of the exiled and relocated peoples. And though the book begins in 586 BCE, it feels achingly true to modern life, tackling the horrific acts of mutilations, rape, kidnapping, and feminine suppression. Cameron reminds us of the original rights to the Jewish homeland and the seeds of anti-Semitism. Throughout, we have Uri, the scribe, who records events as they happen, as well as the ancient stories handed down from the elders. He urges us to appreciate the written word, to heed our past mistakes, and to avoid catastrophe. A book of great significance.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ionia Froment",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDNLNTANUGENK62RSTAQALJOWPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMPVX93CF7T97?ASIN=B0CB78NNCZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Different, in a good way",
                "reviewText": "\"Babyon\" by Michelle Cameron is an intriguing foray into historical fiction, encapsulating the harrowing yet resilient journey of the Jewish people during their exile to Babylon. The novel, rich in historical detail, offers an immersive experience into a pivotal biblical era. However, the book does present an interesting challenge regarding its target audience. At times, it appears to cater to a younger demographic with its approachable storytelling style, but then shifts to themes and narratives more suited to adult readers.What stands out in Cameron's work is her attention to the descriptions of the surroundings and her ability to vividly recreate the ancient world. The novel spans generations, allowing readers to journey through significant historical events from the destruction of Jerusalem to the return to Judea. This sweeping saga is underpinned by themes of survival, faith, and the enduring spirit of a community in the face of adversity.While the storytelling is engaging, readers might find themselves navigating through extensive family biographies and intricate historical details. This aspect, though enlightening, could pose a challenge for those who prefer a more straightforward narrative. Nonetheless, the novel's strength lies in its ability to weave a tapestry of characters and settings that are both informative and captivating.For readers interested in religious and ancient history, \"Babyon\" offers a compelling narrative that brings to life the trials and tribulations of a people committed to preserving their faith and identity. It's a book that not only stands out for originality but also immerses you in the struggles and triumphs of its characters.In summary, \"Babyon\" by Michelle Cameron is a novel that may oscillate in its appeal to different age groups but ultimately provides a rich and engaging exploration of a significant period in Jewish history. Its combination of historical depth and storytelling prowess makes it a notable addition to the genre of historical fiction.This review is based on a complimentary copy from the publisher, provided through NetGalley. All opinions are my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mally Becker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWLDOAJSFDKIZ6F222NHOXJM7NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAFPVJ2MOMX4E?ASIN=B0CB78NNCZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars A wonderful multigenerational saga",
                "reviewText": "TV producers and scriptwriters understand that viewers love \"big\" stories, tales that let us follow characters and families over time, through heartbreak and celebration, intrigues and drama. But those multigenerational sagas have been in short supply in the world of fiction. And that's exactly what I loved about Babylon, a family saga that covers three generations of the ancient Jewish exile. Author Michelle Cameron brings to life the times and characters we've read about in the Bible in such a vivid way. She made me feel as if I were marching through the desert to Babylon with Sarah and standing with her descendants as they struggled to maintain their religion and dignity. A great read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Avish",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFR5QPN2GWXXA7ZXLMU7ABNAXTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM11SUW3P519H?ASIN=B0CB78NNCZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Not to be missed",
                "reviewText": "Michelle Cameron's newest novel, Babylon: A Novel of Jewish Captivity, addresses a question so core to Judaism: \"Why do Jews survive when other ancient peoples did not?\" The answer seems to be found in the concept of purity, not only in the laws of Kashrut but also historically in relations between the Jewish community and other adjacent communities to which the Jews found themselves proximate. The same concept is playing out today in modern Israel, where Orthodox Jews fight secular Jews for the right to segregate their men and women while praying in the center of Tel-Aviv, the bastion of liberalism. Pursuing that purity that sets Jews apart is just as painful today as it has been during every other period of Jewish history. Michelle's excellent novel examines both the period of exile and the period after exile when the Jews were allowed to return home. It does what historical fiction does best: It entertains us by showing us in intimate detail what life was like then and making us think about the issues, both in the context of the times being explored and in our own times. Highly recommended.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chelsie S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZK4G7WMA6LCIU4RCSHKFYZW7IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCEEMK5LCM8H6?ASIN=B0CB78NNCZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Well written Biblical historical about the Jewish exiles in BCE.",
                "reviewText": "The history of the Jewish exiles starting in 586 BCE is told through five parts and three generations of Sarah's family and what they all endured to fight for their beliefs, religion and land. This novel really flowed and was an easy read considering it is based in BCE and this novel does not at all read like a high school history text book. I really enjoyed the depth to which the author did not shy away from and remembered many pieces of the story from the Bible. I think this novel gives a little more depth to those stories in that they are told through actual characters and families. I have often looked for a novel like this to help me understand more of the Biblical stories and the history of why the Jewish were always exiled from lands and yet they continued to have endurance, strength, faith and trust.Thank you to the author and publisher for the complementary novel. I will recommend this to those who look for historical novels of the Jewish community and Biblical stories. This review is of my own opinion and accord.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}