{
    "remaining_requests": 1025,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lost-Bookshop-charming-uplifting-perfect-ebook/dp/B0BMF2M8Z6",
    "body": {
        "name": "The Lost Bookshop: The most charming and uplifting novel for 2024 and the perfect gift for book lovers!",
        "price": "$2.99",
        "originalPrice": "",
        "rawPrice": 2.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lost-Bookshop-charming-uplifting-perfect-ebook/dp/B0BMF2M8Z6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91Sy3S-198L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Evie Woods",
            "link": "https://www.amazon.com/Evie-Woods/e/B0C597STWN/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 44310,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The Echo of Old Books meets The Lost Apothecary in this evocative and charming novel full of mystery and secrets.‘The thing about books,’ she said ‘is that they help you to imagine a life bigger and better than you could ever dream of.’On a quiet street in Dublin, a lost bookshop is waiting to be found…For too long, Opaline, Martha and Henry have been the side characters in their own lives.But when a vanishing bookshop casts its spell, these three unsuspecting strangers will discover that their own stories are every bit as extraordinary as the ones found in the pages of their beloved books. And by unlocking the secrets of the shelves, they find themselves transported to a world of wonder… where nothing is as it seems.Readers have fallen in love with The Lost Bookshop:‘Beautifully written and captures the wonder and awe that a story can bring to its reader…a delightful story for any book lover…an ode to storytelling and the connections that books can make!’ ⭐⭐⭐⭐⭐‘Wowwww!! It’s been awhile since I read something so fascinating, captivating and special all in one…It takes you on a journey like most books do, but this one, I just want to inscribe on my back and hope that it becomes a part of me so that I can carry it with me always’ ⭐⭐⭐⭐⭐‘A must read for readers that love books’ ⭐⭐⭐⭐⭐‘A beautiful story that begs to be read in one sitting…a magical story filled with beautiful prose and many surprises that readers will not soon forget’ ⭐⭐⭐⭐⭐‘This spellbinding book hooked me from the very beginning and I couldn't put it down til the end’ ⭐⭐⭐⭐⭐‘A love story, one with books and booklovers at its heart. A warm, wonderful novel that sweeps up the reader into an absorbing, magical tale’ ⭐⭐⭐⭐⭐‘If you enjoy books by the Brontë sisters … then I would fully recommend you read this book’ ⭐⭐⭐⭐⭐‘This novel has it all: wit, a dash of magic, and a large heart. A fantastic read’⭐⭐⭐⭐⭐ Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BMF2M8Z6"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ One More Chapter (June 22, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 22, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2865 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 444 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#145 in Kindle Store (See Top 100 in Kindle Store) #4 in Women's Historical Fiction #8 in Mothers & Children Fiction #10 in Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 44,310 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6f0c4757-e855-46ad-82f3-78e4bff7a01d.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c31e56a5-910e-4ce9-91ec-578daabf16ff.__CR0,0,300,300_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1f4b13c-c645-41dd-873c-24224ff9ba7d.__CR0,0,300,300_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0eb0ce27-7a39-474b-a1ba-5654dbfd6235.__CR0,0,300,300_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ca443e6-5e9c-47a5-8903-511344f9781a.__CR0,0,300,300_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4511e023-c8c4-4c36-b0c2-c4328ec713ea.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "sj",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCDZTZOXNA3PTJJ7JWSIV2CUVJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CQQUE780Z2K2?ASIN=B0BMF2M8Z6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars My first five star of the year!",
                "reviewText": "This book is magical, heart breaking, heart warming, inspirational, and thought provoking all in one! I loved every well written chapter!I could not find this book anywhere so I first went onto a different music app where you can listen to audiobooks and started listening there. I noticed after I listened to about 8 chapters that I was completely lost. I gave up on the audio and found the book on Kindle Unlimited. Then I started all over from the start of the book.Note: Though the audio version is VERY good, and the narrators are superb, this is the kind of book where you really need to pay attention to who's chapter you're on, or you will get confused. This story is told from the perspective of three main characters in two different time periods (one based in 1920+ and the other in more present time). Once you have your characters down and the cadence of the storytelling down, you won't get as confused. I did on occasion have to flip back to see who's character I was on to keep the story straight.The story...Wow, so much information is squeezed into each chapter! This author really knows how to immerse her audience into the story so you feel like you're right there with the characters. There's romance, intrigue, mystery, sadness, hatred, fantasy, war history, and so much more in this book. I don't want to say too much and give anything away. Suffice to say it was an incredible read and one I'll be talking about for a long time! I finished the book in two days then came back here to buy the hard copy. This is one of those books you need to have in your home library.Trigger Warnings:Domestic abuse, forced institutionalism, physical abuse, alcoholism, pregnancy, suicide, war",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "🌺 Lynne E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYGPUCRKH7G4VM22FM3VAKSQ23Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U4F49A10OGKS?ASIN=B0BMF2M8Z6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Romantic Fantasy With Two Separate Romances",
                "reviewText": "THE LOST BOOKSHOP is a romantic fantasy--basically it's chicklit that will appeal primarily to women. It's a page-turner at chapter endings, but overall a long read because the two plot romances advance so slowly. The characters (Opaline, Martha, Henry, Madame Bowden) are fleshed out so that the reader cares what happens to them.The characters' stories are told in more or less alternating chapters, a requirement because events occur many years apart in different eras. This structure is skillfully handled, a testament to the author's abilities as a writer.The two main plots are basically \"girl gets boy, girl loses boy, girl gets boy\". The bookshop itself is a vehicle for carrying the plots, and less of a character than I expected. I'd be interested in reading a sequel to this novel that is based on the mysterious Madame Bowden.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mom of 3 Boys and a Lil Lass",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNMUEBSCIN6HF3GC5QTWBV3GSHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R431R8E3WQQX3?ASIN=B0BMF2M8Z6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars A Magical Read",
                "reviewText": "Another enjoyable read. As a magical-fantastical story, this one fell a bit outside of my usual genres, but I throughly enjoyed the book, as evidenced perhaps by the fact that I finished reading it in three days - a task I accomplished quite frequently pre-kids, but not all that often these days.The story features the lives of Martha and Opaline, two women living similar lives in very different times. A third character, Henry, is interwoven throughout the book as well. All three are well-developed and interesting characters. Their similarities and the connections between them become more and more evident as the story unfolds; and what a story it is, full of twists and turns and aha moments, and the ending - I loved the ending!I will admit, there were a few times in the beginning of the book that I had to go back and remind myself whose chapter I was reading (each chapter heading is a character's name), but once I had become more familiar with the characters, the individual personalities became clearer and I no longer struggled to keep track of who was speaking; and even in the beginning, this sometime confusion did not at all detract from my enjoyment of the story.One note of caution I will add here: there is domestic abuse and/or alcoholism across the story lines. If you are sensitive to either of these, as wonderful as this book was for me, it may not be for you.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LFL8812",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7G37CAP3YBKO75EBC2SLCYW2GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA6G4660RXRJL?ASIN=B0BMF2M8Z6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic Story",
                "reviewText": "I could hardly put this down, in fact I read nearly half of it in one night. There are 3 MCs who each tell a chapter which ends with a cliff hanger so you have to read 2 more chapters to find out what happened. Also a different time period is involved. This was a bit confusing, especially in the beginning with so much to learn & keep up with. I am disappointed, tho, because I did not get the ending. I felt like it just stopped without some things being explained or gone into more & were just left hanging but that could just be me & not the fault of the book. I may go back & read the last part again or I may just reread the whole thing since I finally have most of it straight. I did learn a lot from this so going over all of it again would probably beneficial. I knew about how men had been able to commit women to asylums for no reason & how awful the conditions were in those places so all of that was disturbing--but necessary--to read about, especially for people who do not know. I didn't see any Christian or men bashing like one reviewer said. This is really a good book & I hope rereading it or part of it, will have the ending make more sense to me. Highly recommended & is among my favorites even if I don't quite get all of the ending.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "teacher with an opinon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYFCXQVRTRMX46Q27GTF5JL2FUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F36ADQHK6MTL?ASIN=B0BMF2M8Z6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars what a wonderful read!",
                "reviewText": "I don’t know when I purchased this book, but it’s been unread on my kindle bookshelf for way too long. It is absolutely delightful! The exquisitely written story of two separate lives, separated by time, twisting and entwining like the vines of the bookstore. The blurb describes it as “charming and uplifting” and it is just that! Mystery, books, history, academia, self-discovery, and just a bit of magic.The only caveat to my glowing review is the infrequent use of what I consider to be profane language. It is only occasional and perhaps even appropriately used…but is so glaringly at odds with the timeless prose that it feels harsh and inappropriate. Don’t let that keep you from reading…it’s only a few times, but it’s there and detracts from the magic.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda Rollins",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2024",
                "reviewTitle": "A masterpiece in pages",
                "reviewText": "“The Lost Bookshop”, is pure gold, a masterpiece that implements the here and now into the magical forces of the other world, a world beyond reality. What a glorious book! It’s a story that weaves together three extraordinary, charming and peculiar characters in Opaline, Martha and Henry, each striving to write their own stories or to simply find them. Either way, this book is hypnotic in its prose, it takes fictional writing to a whole new level for those who truly love books. It is an enchanting illustration in a world where books are fundamentally important, playing a pivotal role for those who choose to hold those majestic gems in their hands. When a book whispers, you listen intently to what it has to say. This book speaks volumes, it absolutely peaked my curiosity, it was definitely a page turner and it was so hard to put it down. I basically plowed through it full steam ahead, like I was under some type of hypnotic spell compelling me to read on.Life can cause individuals to view their own lives from the sidelines, not fully engaged within the confines of what life has to offer. It goes without saying that at times we all need a Madame Bowden in our lives just to add clarification to the things we don’t yet fully comprehend, a unique wizard of sorts who has the power to unlock secrets just sitting on a shelf. This vanishing bookshop has something to offer both Martha and Henry, they just need to conjure up the confidence to read between the lines and to see what cannot be seen, the author magically intertwines Opaline’s past life with the present. It’s pure genius, a fantastical journey where something lost can eventually be found if you stay on the majestical current path.This book adhered the conforming gender roles during Opaline’s storyline, a time when women were viewed as the weaker sex and therefore not taken seriously at all. Women had voices, but were never heard. It is noted that women writers used pseudonyms when writing back in the day, otherwise they wouldn’t get published as efficiently. Author Evie Gaughan used pseudonym Evie Woods at the author of this particular book, just to drive that point home.This novel incorporates great classic books, manuscripts and its authors into its storyline, and I liked that Sylvia Beach and her bookshop Shakespeare & Company were included as I read and enjoyed “The Paris Bookseller”. I am compelled to mention the cover, the concept brilliantly designed. My book was on my coffee table and the lights from the television changed the colour of the leaves on the front cover, the leaves twinkled with different shades, it was magical just as its content is.This novel will take the reader to a place of mystical magic with a dash of myth and I highly recommend it. Evie Woods lives Ireland and has created the most amazing book using her magical mind. It’s an intricately woven story with two vivid timelines that will burrow its way into your heart.LOVED THIS BOOK!!!!!⭐️⭐️⭐️⭐️⭐️",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Lou Rebelo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 18, 2024",
                "reviewTitle": "Mistérios e encantamentos numa livraria desaparecida.",
                "reviewText": "História de magia, segredos e encantamentos para os amantes. de livros e livrarias. // ML",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Goblander",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 1, 2024",
                "reviewTitle": "Brilliant and moving.",
                "reviewText": "I am an avid sci-fi reader and took a bit of a punt on this.I was not disappointed in the least.Evie Woods has written a brilliant story treading a beautiful line between sci-fi/fantasy, nostalgia and poignant realism. I was reminded of Ian Banks' The Wasp Factory and one or two other of his supposedly non sci-fi , but actually, crossover books, where genres are brilliantly blurred, as here.I take on board that the male characters are a tad one dimensional, and there are some loose ends that we are left to ponder - how delicious; But, the point is, that this is very much Martha and Opaline's story, everyone else is really only there to facilitate their trials and tribulations, and to help bring about the wonderfully twisty ending, where the important story lines do come to a wonderfully surprising conclusion.I think I will be pondering the in's and out's of this book for some time, and I am sure it will be one of the books that I come back to and immerse myself in again.Just to be clear, I pretty much read this in one hit over two days, only interrupted by picking up the band, traveling to a motel and then on the next morning to set up at the theater, pretty much finishing it between then and the end of the show, (luckily I'm the driver/stage hand). It's not that often a book makes you both laugh out loud, and brings a tear to your eye, often in the same chapter. Brilliant",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miriam Wexler",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 14, 2024",
                "reviewTitle": "Absolutely loved it.",
                "reviewText": "A beautiful story set into separate times yet enter connected the entire time. Magical and gripping. I couldn't put it down it was that good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joana Almeida",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 24, 2024",
                "reviewTitle": "Perfect for every book lover",
                "reviewText": "Almost finishing this book and it's already one of my all time favourites!It has romance, friendship, starting over, found family, books and a magical shop! What more could a bookworm want?!🥰",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}