{
    "remaining_requests": 731,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Susannas-Midnight-Ride-Revolutionary-Publishing/dp/1732220204",
    "body": {
        "name": "Susanna's Midnight Ride: The Girl Who Won the Revolutionary War (Courageous Women in American History)",
        "price": "$14.99$14.99$13.00$13.00",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Susannas-Midnight-Ride-Revolutionary-Publishing/dp/1732220204",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51UB1RcLqjL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51r9niCwDYL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Libby Carty McNamee",
            "link": "https://www.amazon.com/Libby-Carty-McNamee/e/B07DZXGNWK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by The Denver Exchange and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 343,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Susanna's Midnight Ride was an incredible story of determination and liberty. Libby Carty McNammee's fantastic writing really brings this story to life. Gave it five stars because there's no option for 6! ⭐️⭐️⭐️⭐️⭐️⭐️- Rose MoranI loved this exciting historical novel! It is based on the true story of Susanna Bolling, a 14 year old girl, whose courage and determination influenced the course of the Revolutionary War. This book held my attention from beginning to end. Couldn't put it down!-Cathy McCormackIn this exciting and page turning tale, McNamee shares the true tale of Susanna Bolling and her contribution to the American revolution. With constant action and rich vocabulary, this story keeps the reader engaged while sharing some of the lesser known or discussed elements of our history. This would make a great class read aloud to discuss alongside the history we teach of this time period.-Anne Counoupas About the Author A writer and a lawyer, Libby McNamee loves exploring America's many historical sites. When a descendant told her about Susanna's Bolling's heroism, Libby was determined to share it with the world. Susanna's Midnight Ride is her first published novel. Libby served as a US Army JAG Officer in Korea, Bosnia, Germany, and Washington State. She and her book-obsessed husband and son live in Richmond, Virginia. A Boston native, Libby graduated from Georgetown University cum laude and Catholic University Law School. Check out her blog Libby With a Y at www.LibbyMcNamee.com and drop her a line at Libby@SagebrushPublishing.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 34 mins",
            "FREE delivery Tuesday, February 27 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 34 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 IN JUVENILE FICTION, 2020 INDEPENDENT PUBLISHER BOOK AWARDS (\"IPPY AWARDS\"); #1 IN JUVENILE FICTION, 2020 PINNACLE BOOK AWARDS; FINALIST IN FICTION: HISTORICAL, 2020BEST BOOK AWARDS. As the former Colonies struggle for freedom, the American Revolution is in the hands of a brave and resourceful teenage girl. At sixteen, Susanna Bolling is like America in rebellion; she craves independence. While her brothers are off fighting for the Patriots, she longs to do more than tedious household chores and attend spinning bees in sleepy City Point, Virginia. When British General Cornwallis invades her family’s Bollingbrook Plantation, she overhears his secret plan to defeat the Patriots. Much to her shock, she finds herself at the center of the war. Now America’s fight for liberty hinges on her. But can she overcome her mother’s objections, face her own fears, and outwit the famed General and his entire Army? Based on the TRUE story of revolutionary courage and conviction that’s sure to captivate readers of all ages.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Sagebrush Publishing (June 15, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 230 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1732220204"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1732220201"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 9 - 13 years, from customers"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ Kindergarten and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 0.52 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#112,554 in Books (See Top 100 in Books) #25 in Teen & Young Adult United States Colonial & Revolutionary Period Historical Fiction #62 in Teen & Young Adult Military Historical Fiction #1,823 in War Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 343 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "jyoung",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELPEMN4ZFSWKO4RT55LE7YHRYXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IAPTIMEKY25G?ASIN=1732220204",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Enjoyable historic read.",
                "reviewText": "I love teaching history that isn't well known to my students. This book is a great one for them to read on their own and then discuss in class.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tommy g",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVTM63S2W3OC2RSAAEKMFQT6MRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30ML733DRPM02?ASIN=1732220204",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Reading",
                "reviewText": "Interesting, entertaining, and enjoyable",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bobbie T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRRMB5FWXFDLEOAMZEX72TR3STQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VSWLF56JWE6I?ASIN=1732220204",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 7, 2022",
                "reviewTitle": "5.0 out of 5 stars Inspiring read about the Revolutionary War for all ages",
                "reviewText": "I very much enjoyed reading the account of Susanna Bolling, and her courageous & patriotic contributions during the American Revolutionary War. The characters in this book were well developed, and I especially loved the fact that we are reading about a real historical figure, with fictional embellishments and creative license taken due to lack of recorded historical facts. I felt the author did a wonderful job portraying Susanna and giving us all a realistic historical review about the time period and the area in which the story takes place.It was a very enjoyable read, and I finished it in two short sittings because I simply could not put it down.This delightful and inspirational story was a lighthearted yet important account of important events in American history- a pleasure for the intended age group, and adults alike… Huzzah to author Libby Carty McNamee on your first published book! Looking forward to reading Dolley Madison next.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Avellina Balestri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTM6WMGN7KLTTNJLEJPRMQIKX3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YJC6NDJBTL5?ASIN=1732220204",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2023",
                "reviewTitle": "4.0 out of 5 stars Along for the Ride!",
                "reviewText": "I met the author of this charming book via Revolutionary War circles on FB, and this led me to pick up a copy on Amazon, since I have been binge-reading revolutionary fiction while writing my own revolutionary trilogy. This particular story deals with wartime experiences on the home front through the eyes of a teenaged girl, Susanna. She is living out the day-to-day of the waiting and watching part of war, as her brothers are off fighting for what often seems to be a lost cause. The author does a very good job dealing with the tension of waiting for the casualty lists to come in, and then even if your own loved ones are not on them, having to face neighbors whose loved ones will never be coming home. There is a particularly realistic scene of Susanna not having the heart to tell a neighbor that she has seen her son listed among the slain, and runs away, leaving the poor woman to find out herself. We also get to see the bitter divides within communities between Patriots and Loyalists, which manifests even at funeral services. The plot picks up pace when Lord Cornwallis and his regulars comes to town, resulting in Susanna finding herself a necessary component to keeping the revolutionary cause afloat by preventing the capture of the Marquis de Lafayette. I appreciated that the author referenced Cornwallis having just lost his beloved wife Jemima, which parallels the loss of Susannah's father. I rather wished this commonality could have been explored further and we could have fleshed out more about Cornwallis, not only in terms of his family life and tragedies, but also the fact that he started out as being quite sympathetic to colonial complaints in parliament and deeply regretted the necessity for the war at all, considering Americans to be his brethren and this entire scenario to be a civil war. It could have been interesting to see Susanna's own reaction to these layers to Cornwallis' character. I also rather wish we got more scenes with Tarleton, who was apparently wounded and staying in a bedroom of their home, which of course would cause quite the stir given his hardcore reputation and massacre potential. But aside from my daydreaming about plot expansion here and there, I quite enjoyed going along for the ride (pun totally intended) with Susanna. It brought back fond memories of growing up with the American Girl series. Felicity was always my favorite character (I still have her doll!), and Susanna's spunk reminded me greatly of her. I am also grateful to have learned about a real historical character who I only had an extremely passing knowledge of. I hope the author writes more books along this line, covering little-known heroic women from history! I know she has already written one on Dolly Madison, which I look forward to reading upcoming!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hannah H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKZ7PK33EJXE56UVTJH2XD4DLLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9LWNOTANFHDD?ASIN=1732220204",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2022",
                "reviewTitle": "5.0 out of 5 stars Huzzah!",
                "reviewText": "This amazing true story teaches readers about the American Revolution through the eyes of a young girl; giving middle-grade readers an opportunity to connect with history from a different perspective. McNamee brings Susanna Bolling's story to life in a brilliant way. One of my favorite aspects of the book is how she supplements historical accounts with handwritten letters between her characters. This mechanism transports readers back to colonial times and helps connect the bigger story to individual lives. I walked away having a whole new appreciation for 'The Girl Who Won the Revolutionary War.'",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amethestblaze",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWG7WTOPNREU7L4QQYND6NCBQOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R320VPGBMAFMRM?ASIN=1732220204",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderfully told",
                "reviewText": "Read this with my 12 yr old daughter. She loved it and it has led to some wonderful discussions. She liked it so much she has been devouring everything she can find on Susanna.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWYFT3ULGU5Y42UHHCGELG3VMEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6SMNMOZ5RMRG?ASIN=1732220204",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 5, 2022",
                "reviewTitle": "5.0 out of 5 stars DAR Bookclub",
                "reviewText": "I was able to join my mother's book club for this book since they were fortunate enough to have the author join in for the meeting.This book was a fast read and I think it is excellent for adolescents and adults alike, especially young women looking for inspiration. I enjoyed the story and really appreciated the notes at the end that specified which parts of the story were altered for the book since more often than not with books and movies based on true stories you are often left wondering what parts really happened and what parts were creative liberties. It was really nice to meet the author as well, she is a lovely person and if you are considering this book I high recommended it!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX2MU6EZDQXRAWGXG7VYBJKA5VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R326YJKMLYR2IV?ASIN=1732220204",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 11, 2022",
                "reviewTitle": "5.0 out of 5 stars GREAT READ, GREAT GIFT, BASED ON TRUE STORY OF TEEN DURING REVOLUTIONARY WAR",
                "reviewText": "Our book club chose to read a book aimed at preteens and young adults. I will be sending this book to one of my great nieces to read and pass on to her other cousins. Pre-teens and up will most likely enjoy this book, especially young girls, as it's based on a true story of a young girl during the Revolutionary War. Our book club met via a Zoom meeting, and the author, Libby Carty McNamee. What a wonderful experience to hear from her and be able to ask questions. And now I'm looking forward to reading her second novel \"Dolley Madison and the War of 1812\". (Yes, Dolley is spelled correctly)Review by Susan",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adrian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 12, 2018",
                "reviewTitle": "Susanna's Midnight Ride is a brilliant book filled with excitement and intrigue",
                "reviewText": "This review is from my daughter, she loved the book.Susanna's Midnight Ride is a brilliant book filled with excitement and intrigue. I am an 11 year old girl and I think it should be a 9+ only because it is filled with lots of descriptive writing so reading ages underneath may not understand some of the words in the book. I really liked this book because I could feel the same emotions the characters could and I learnt a lot more about the revolutionary war without realising it. Susanna's midnight ride is now one of my all time favourite books and once I started reading it I couldn't put it down even if it was my bedtime. That's why I gave it 5 stars. :] :D",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy Chambers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 29, 2019",
                "reviewTitle": "Fabulously written book telling a tale of the American revolution",
                "reviewText": "This book caught my imagination and I really enjoyed reading it. I am now off to find out more history about the American revolution. Very well written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}