{
    "remaining_requests": 813,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Far-Away-Home-Historical-American-ebook/dp/B0055U8ZRK",
    "body": {
        "name": "Far Away Home: An Historical Novel of the American West (Aislynn's Story Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Far-Away-Home-Historical-American-ebook/dp/B0055U8ZRK",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81TADFTCR0L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Susan Denning",
            "link": "https://www.amazon.com/Susan-Denning/e/B0056AT9CO/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 6366,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0055U8ZRK"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ No Limit Press (June 13, 2011)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 13, 2011"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 455 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 339 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32,745 in Kindle Store (See Top 100 in Kindle Store) #50 in Historical Irish Fiction #193 in Historical British & Irish Literature #200 in U.S. Historical Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 6,366 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMMMO7GYZZV5GTCFNSVDXWJXTEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J7D85HO9L0CC?ASIN=B0055U8ZRK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful story",
                "reviewText": "I loved this story. It made me cry for Johnny and their relationship and the baby. I am anxious to continue her story thank you LS",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF663KRIOOYNG4O2PAOYTKGQP6MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGIEDVN3723GW?ASIN=B0055U8ZRK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2023",
                "reviewTitle": "4.0 out of 5 stars Far Away Home",
                "reviewText": "I enjoyed reading this story although it got kinda boring in the middle. This young was very inexperienced but persevered though all kinds of troubles. I would like to read the sequel but can't find it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LFL8812",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7G37CAP3YBKO75EBC2SLCYW2GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UVQNL0OZ8GXF?ASIN=B0055U8ZRK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2020",
                "reviewTitle": "3.0 out of 5 stars Nicely Written, Faced Paced But A Mess",
                "reviewText": "This & the sequel were both on sale for Kindle so I got them at the same time so I could read one right after the other. I will review both together here. I read several reviews of Book I complaining about the ending which I only skimmed over because I didn't want anything to be ruined but they were right in their complaints. The book doesn't really end, it just stops--& mid crisis at that, like most of the chapters do. I find this EXTREMELY annoying & is why I usually avoid books that have a sequel. Stopping a story is just a cheap shot way of trying to be sure the readers will buy the next book, however long it takes to get that one out which is sometimes years. I have no idea about the time between these 2. If the book is good there is no reason to to this, they will want to get the next one, which should pick up some time later, even just a little later, to see what happens. Look at the Outlander series by Diana Gabaldon or The Bregdan Chronicles by Ginny Dye. I am waiting for Book # 18 on those, which was due out last Summer. I never thought I'd read 18 of anything but I am impatiently looking forward to it. Before I get to the reviews I have to say that several times the author mentions a podium when I am sure she means a lectern--pet peeve of mine since this is such a widespread mistake which I am on a campaign to correct. You STAND on a podium, like the conductor of an orchestra or sports medal winners like the Olympians do, Latin root word p-o-d, meaning foot. A lectern is an elevated desk you stand behind & put your papers on top. They are all over, at any presentation to a group. The President & press secretary stand at one during press conferences; they were used at the Presidential debates; they are just anywhere. I say these books are a mess because there are so many either loose ends or main character, Aislynn, changes her mind about the various men who have been interested in her without any reason or indication she has. I am not going to summarize the books here but in the 1st one into the 2nd she is in hot pursuit of Tim, a childhood friend who was a little older & became her protector. She obviously is in love with him & is shattered when he goes out West for work so she takes the dangerous journey out there look for him. Another fella from childhood who is interested in her goes with her to keep her safe but she is not in the slightest bit interested in him, in fact she doesn't even like him. The next thing you know she is married to him without any mention of a change of heart or feelings for him growing. This & that happens & Tim moves a way again, marrying a woman in poor health who dies soon after. He has been a tremendous support & comfort to Aislynn her entire life so he writes to her saying he needs her. Apparently he has written to her off & on but there is no mention of that till later. I thought it was over between them. She decided to go to him but there is no mention of her journey there, that she actually met up with him, or what transpired when she did. There is only a vague reference to her having seen him in a half a sentence quite some time later. Incredible, someone who was so important to her barely gets mentioned. I kept thinking & hoping they would end up together. Many of the chapters end during a crisis or argument & the next one picks up at the same time without a mention of how that turned out. Since the new one starts at that same moment, there is no reason for the chapter to have ended. For instance, one night she discovered a young girl cowering in the bushes outside her restaurant. She had escaped from the brothel she was forced to work at & had sustained a knife cut & other wounds. The girl was a former slave & she had numerous scars on her but were these from her days as a slave or her life in the brothel? It doesn't say. A man Aislynn knows but doesn't like, comes to her demanding the girl be returned to him so he can take her back. She yells \"NO!\" thru the door & that is the end of that chapter. The next one picks up about there but there is mention of the girl. It's not for many pages, maybe even the next chapter, that we learn Aishlynn did take her in & care for her. For much of this book she does not like or trust that man yet she ends up married to him, too, w/o any indication of a growing relationship between them. There is just SO MUCH of that it is tiresome but at the same time it is fast paced & I had trouble putting it down, especially the 1st one. The 2nd one is about the same, maybe a little less annoying, & it does have a decent acceptable ending but it was harder to get thru. I wanted to see how it ended so I kept going. The 2nd one had more actual history in it, like about Wyoming being the1st state to allow women the right to vote. In the 1st one I was wondering \"what history?\" It was just set in the post Civil War time period was about all. One reviewer said she was tired of Aislynn biting her lip. I hadn't noticed that before but read it when I went to read reviews again since I wasn't as taken with the books as others seem to have been. I was in the 2nd book by then but she is right, that is used excessively. It's just a shame because these 2 books have such potential it seems like a good editor could have pointed some of this stuff out & turned them into 5 star books but I am afraid, for me, they really missed the mark.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joan M. Poole",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM4UUOXUGDOAV7OLRNNEMSQNNWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OJXN3EIGNGYB?ASIN=B0055U8ZRK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Very Interesting",
                "reviewText": "Was thinking this was strictly a historical sort but it turned out to be so much more. It kind of got lost with my books on my Kindle and so glad I found it and the next book in the series. HAPPY READING FRIENDS",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanna M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHT2TBIWNKRIMYFLVPNCX7WQVQKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFZ4CK1RTE15M?ASIN=B0055U8ZRK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2015",
                "reviewTitle": "4.0 out of 5 stars A fiercely independent young woman...",
                "reviewText": "Following the tragic death of her father, 17-year-old Aislynn Denehy finds herself orphaned and desperate to support herself in post-Civil War New York City. Short of options, Aislynn decides to head west to Utah territory - the place where her lifelong friend and unrequited love Tim Nolan went to seek his fortune the previous year. Aislynn is determined to make herself a wonderful future, both financially and alongside Tim as a husband.Against her initial wishes, Johnny Maher - the young man whom Aislynn's father had wanted her to marry - decides he will accompany Aislynn on her journey.As expected, Aislynn and Johnny encounter many hardships as they head West - Indians, law-spurning white men, difficult weather conditions and terrain. But it's all worth it, Aislynn believes, as she'll soon be reunited with Tim. But will she actually find the happily-ever-after ending she's imagined so many times?Denning has clearly put a great deal of effort into researching 1860s life, both that of Irish immigrants in New York City and of the hopeful emigrants heading out West to find their fortunes. The complex and intriguing characters she creates to stand amidst the elements of the period are well defined as well.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CT Griff",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFR4JFQT3BWBUMPL4RJ5FFDBYPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1K7TT0VTM094O?ASIN=B0055U8ZRK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2020",
                "reviewTitle": "5.0 out of 5 stars Far Away Home - Book 1",
                "reviewText": "Growing up in the U.S., there's no end to the number of books & movies about the American West and the men who made it great, and not so great. Long overlooked are the stories of the women who joined the men in making the West a reality for all of us... this two-book series goes a long way in helping anyone understand what it was like to be young, headstrong, passionate about life and willing to risk much for even more.This historical fiction novel surrounds Aislynn through 4-5 years of her life and numerous events that could be the one that crushes her spirit and ultimately defeats her or the one that makes her stronger, more resilient and educates her like no schoolroom ever could.Some of the complaints about the practicality of the logistics really irk me. \"Pies with cream on the Oregon Trail - really?\" Yes ma'am, really. You have cows, thus you have milk, thus you have cream to whip. Pies were routinely baked outta wagon trains and in chuck wagons. And the quickness with which Liam Moran was able to move on Aislynn was, IMO, a literary technique to show Moran's ultimate predatory & evil side, not to dismiss the mourning of Johnny.Anyway... this was a great Book #1 that not only laid a foundation of great breadth for the plotlines to come but also thoroughly engages the reader with a fair amount of depth, too. At any one point in the book, I felt comfortable that I knew the primary & secondary characters, that basic histories had been presented and that motivations were, if not always crystal clear, they were at least logical when played out. At no point did I feel a need to re-read something or encounter a story-stopping \"Huh...?!?\" It flowed very well and the editing was terrific.I highly recommend this book, and its sequel \"Embrace The Wind.\"",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary hollingworthMary hollingworth",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 13, 2017",
                "reviewTitle": "Want to read a good book about the Wild West in the early days then go no further...........you will find it here",
                "reviewText": "What a great read. What I loved about it and its sequel was the perspective it brought on that part of America's history and also what it was like for women during that time. For someone who lives in Australia it was both a good story and good history brought to life. I was sorry to come to the end of this and it's sequel as I didn't want to finish the story....good characters and you felt absorbed by Aislynn, hoping that she could find security for herself and a better life. Well researched and I am looking forward to the next book by Susan Denning!!!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Wur01d0mL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Jay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 21, 2013",
                "reviewTitle": "I enjoyed this book very much!",
                "reviewText": "This book held my attention and was an interesting story about the pioneer days in the western US. I plan to read more by this author.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "maria sloot",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 7, 2014",
                "reviewTitle": "I really enjoyed the book because it was easy reading I really ...",
                "reviewText": "Hi! I really enjoyed the book because it was easy reading I really like al western book as long as there is not to many sex in it . But I would recommend it to anyone. mary",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beadyjan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 1, 2012",
                "reviewTitle": "Atmospheric historical romance on the Frontier",
                "reviewText": "I received this on offer as a free Kindle book and what an enjoyable gift it was.The story of Aislynn a young woman in New York in the mid 1800s an orphan, brought up mainly by men in particular Tim, her guardian after the death of her mother.She is devoted to Tim who rescued her as a baby. When he moves to Utah to work in a mining town alongside the railway being constructed she follows him, accompanied by the loyal Johnny whos adoration of her isn't at first reciprocated. struggling to sort out her feelings of love for these 2 men, she journeys across the frontier in a Mormon wagon trail, facing hardships and loss on the way.Life in Utah is difficult and still not much more than a child she has to begin to grow up fast. Despite her naivety and some poor decisions she begins to develop a strength of character and feisty determination which helps her as she grows into womanhood.Her mixed feelings for the enigmatic and rich Liam Moran, confuse her even further, but we see her begin to settle down building a business and settling with the man she discovers she really loves - until tragedy strikes and thraetens to take everything she has struggled for away.The writing is good not perfect, there are a few flaws and inconsistencies along the way, some conversations in the middle are very stilted as though the author intended to go back and flesh them out and forgot a few chapters! but overall the story is sufficiently compelling and the heroine interesting enough to allow one to gloss over these shortcomings and lose oneself in Frontier America where the historical detail and descriptions are thorough and well written.I thought this was quite similar in style to Belle by Lesley Pearse Belle and may appeal to anyone who enjoyed thisI would enjoy a sequel as there is so much more to discover about what happens to Aislynn after this story ends.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 1, 2017",
                "reviewTitle": "An interesting tale.",
                "reviewText": "Far Away Home was somewhat captivating and imaginativeA story of an Irish girl whose parents emigrated to New York.After the death of both parents she sets out for the West.with many dangers along the way . Many disappointments and some nice successes.A well thought out plot with many twists and turns.Worth the read.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}