{
    "remaining_requests": 787,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Flight-Sparrow-Novel-Early-America-ebook/dp/B00G3L13DS",
    "body": {
        "name": "Flight of the Sparrow: A Novel of Early America",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Flight-Sparrow-Novel-Early-America-ebook/dp/B00G3L13DS",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91tSHp3cvgL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Amy Belding Brown",
            "link": "https://www.amazon.com/Amy-Belding-Brown/e/B001HCXVLU/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 6470,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00G3L13DS"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (July 1, 2014)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 1, 2014"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5989 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ B010OJYMNM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#115,935 in Kindle Store (See Top 100 in Kindle Store) #218 in Native American Literature (Kindle Store) #297 in Biographical Historical Fiction #731 in U.S. Historical Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 6,470 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Editornado",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQ5KHVNZ67LUEUYLTO7MPCQUHLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28KPKQV4G98JX?ASIN=B00G3L13DS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2015",
                "reviewTitle": "5.0 out of 5 stars 17th-century abduction, slavery, and PTSD",
                "reviewText": "I first ran across the Mary Rowlandson story when I was researching my three books on William and Mary Barrett Dyer (two were historical novels that were light on fiction and heavy on fact, and the third was nonfiction). Mary's abduction from Lancaster, Massachusetts Bay Colony took place in February 1675. She was separated from her also-captive pre-teen children, and her six-year-old died of a gunshot wound. Mary was a slave to Weetamoo, a female sachem related to \"King Philip\" of the 1675-76 King Philip's War. Mary was marched around New England in the depths of a Little Ice Age winter and spring with her own bullet wound and heavy heart at the loss of her children, her sister, and her home and lifestyle, before being redeemed from captivity about three months later.The original Rowlandson book is moralistic and rather stiff, as you'd expect from the Puritan Congregationalists of the era. But in Flight of the Sparrow, author Amy Belding Brown gives much thought to the background of the story, and brings Mary Rowlandson to life. Brown must needs fictionalize the story somewhat, but I know from my own research and writing experience that when you spend so much time with the subjects of your books, you enter into their thoughts. Belding Brown was able to see Mary Rowlandson's traumatic experiences and the thoughts and actions which saved her life, and then deeply affected Rowlandson's return to \"civilization\" and normalcy--and perhaps a loss of her faith in humanity and God.There was an element of 21st-century feminism and abolitionism which Rowlandson probably would not have dreamed of, let alone spoken, but it makes the book approachable for most readers who are unfamiliar with 17th-century religious beliefs. In her fiction writing, Belding Brown deftly takes the reader through what must surely have been PTSD. Rowlandson was dragged through the wilderness both physically and spiritually and I found the deterioration of her religious beliefs to be believable. And readers are brought close, through 21st-century fiction, to what was likely very close to the truth.The book was beautifully written, and described the environment, customs, and lifestyles of the English settlers as they crashed against the Native American tribes in the 17th century. The one negative (for me) was that it was written in present tense. It's a device that's done more often these days, but it's not my favorite because it bumps me too often into the present. If that's something that bothers you, don't let it stop you buying and enjoying Flight of the Sparrow.Both Mary Rowlandson's original book (available free on Google Books and several platforms) and Belding Brown's Flight of the Sparrow are appropriate for ages teens through adult. There is some violence depicted, in the sacking of Lancaster and throughout Rowlandson's slavery experience in the wilderness, but it's probably realistic and certainly not gratuitous or salacious.If you're a descendant of Mary Rowlandson, you should read this historical novel to better explain the mysteries of 17th-century religious belief and culture. You'll think better of Rowlandson than you would from reading the journal alone. If you're not a descendant, then read Flight of the Sparrow to learn the strength of character our early-American ancestors had to have to survive the ordeal of settling a wilderness.",
                "reviewVotes": "51 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. A Bowen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM3B6PPBYJ3GOVVMBP6JKCS3HGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33583YP804I8R?ASIN=B00G3L13DS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2016",
                "reviewTitle": "4.0 out of 5 stars Compelling read",
                "reviewText": "\"Flight of the Sparrow\" is much more than a story of the capture and enslavement of a Puritan woman during the Indian uprising of 1676. Loosely based upon the real story of Mary White Rowlandson, daughter of a wealthy Massachusetts landowner and wife of a Puritan minister, the pages of this well-written novel unfold like poetry. Ms. Belding Brown's ability to make the reader feel each thought and emotion of her main character is one of her strengths as a writer. The plot moves at a riveting pace in the first half of the novel as we live through Mary's ordeal as slave to the Indian princess Weetamoo. Brown paints Mary as an always internally questioning, somewhat rebellious Puritan housewife before her capture. After her experiences with the Nipmuc tribe, and her eventual ransom back to her husband and community, she has great difficulty re-assimilating into her Puritan culture. Her brief enslavement and life as Chikohtqua, the name given her by a Praying Indian, James, changes her profoundly. I found this story mesmerizing, but had a hard time understanding Mary's tender, protective feelings for her captors. Weetamoo was not kind to her and she endured great hardships with the tribe as they made their way through rough terrain in the dead of winter. Yet she seemed to much prefer the Indian way of life to her life as a Puritan. Starvation, beatings, and separation from her beloved children -- one of whom died in her arms as a result of a musket wound from an Indian -- did not seem to be what she took away from her experience. Rather, she romanticized her \"freedom\" from the restraints of her life with her husband, Joseph, who is portrayed in the book as an evangelical minister who is a harsh judge of anyone who questions his God. Her poignant romance - unconsummated - with James affects her feelings not only for Joseph, but for the society in which she was reared. The Puritans are hard to like, no doubt, but I found myself questioning how realistic Mary's feelings were in the light of what she endured. I intend to re-read this to see if I missed something that would make it make more sense.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXXE7J7ZV2ERCMABJXXVXNSBDMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ05XUM1BJHH8?ASIN=B00G3L13DS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Book",
                "reviewText": "This was an excellent book. Sometimes a bit too vivid, but it was necessary for the reader to grasp the enormity of the events. I was hoping for a different ending and was hoping that some of the characters would re-emerge. Overall, I thoroughly enjoyed this book and could not put it down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elaine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEE4YNK4ZF3VNFWLYPC5USY6VNDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11JORNWITTICY?ASIN=B00G3L13DS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Gripping story",
                "reviewText": "I was enthralled by this story of human bravery. You will not be able to put it down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Forster Nadège",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in France on May 30, 2021",
                "reviewTitle": "Instructif et plutôt pas mal",
                "reviewText": "Plutôt intéressant. Quelques longueurs en milieu de récit mais globalement un assez bon livre. Lu en anglais donc je ne sais pas ce que vaut la traduction française",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 16, 2018",
                "reviewTitle": "Feminism did not drop out of the sky in the Sixties...",
                "reviewText": "If I really wanted to be picky, and I don't, I could find faults with the novel. And I certainly don't normally go analyzing everything I read. FLIGHT OF THE SPARROW, however, practically demands it. It is a wonderful piece of literature and I congratulate Ms Belding Brown and the publishers on a well-executed and fascinating story.What is the purpose of a historical novel? In my opinion, non-fiction explores the dry \"truths\", the statistics, the dates, the consequences of people's actions. A historical novel explores the soul of individuals within that frame of events, and should create a mirror that reflects our behaviours, thoughts, and ideas today so that we may connect and relate, but not jar us from an authentically built world in the past.This novel sucked me in and did what the best novels ought to do: it made me reflect, consider, think. When I was forced to come up for air, I did nothing but talk about it as I was still deep in the fictional world's embrace, deeply invested in what was happening with the characters (and could hardly wait to come back to it).Mary's personal journey, as told here--as interpreted and explored here by the author--is absolutely and wholly relatable to me. Having lived in four different countries myself, I understand how much can be absorbed and processed in a short three months when completely immersed in a new culture. And it does feel like years have passed. The culture shock and Mary's relentless questioning of what she believed to once know is--even according to science--wholly plausible.As for the \"feministic tones\", I shy away from labeling for the sake of convenience and category. Women have questioned their confining roles from the beginning of time and especially when faced with a culture that does things \"differently\". Here, the novel has simply called that theme \"freedom\"; both subtly and intentionally signalled with different objects: the sparrow, the cage, the confining clothing, the deerskin dress, the wilderness, the cultivated garden. That theme is consistent throughout the book.Writing from Mary's point-of-view, the author has managed to give her protagonist an authentic and believable voice. It stays on point, it's well-researched in language, and well executed. In fact, the entire book sings of an incredible amount of hard work and careful consideration. When I come away from studying meaning, technique and style, however, what I celebrate most is the great story this book has to tell. AND all the new stuff I learned!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "martha brown",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 31, 2017",
                "reviewTitle": "Super read!",
                "reviewText": "Outstanding story writing about early American history. I read it in two days.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susie C",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 7, 2015",
                "reviewTitle": "I was sorry went it ended.",
                "reviewText": "Flight of the Sparrow was a wonderful read dealing with two early cultures in North American history. I gained an understanding of some of the practices of the Puritan immigrants, their belief system and their lifestyle. I also gained an insights into the lives of the First Nations people and the horrors they faced with the arrival of European settlers. I could not put it down, I was anxious to learn the fate of the captives but I was allso saddened and ashamed to learn of the treatment dealt out to the Aboriginal people by European settlers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Dixon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2019",
                "reviewTitle": "Gift",
                "reviewText": "Daughter says it’s good",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}