{
    "remaining_requests": 827,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Her-Dark-Duke-Historical-Regency-ebook/dp/B0CRPHXQQZ",
    "body": {
        "name": "Her Dark Duke: A Historical Regency Romance Novel (Daring Dukes Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Her-Dark-Duke-Historical-Regency-ebook/dp/B0CRPHXQQZ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71M9oE9tOTL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sally Vixen",
            "link": "https://www.amazon.com/Sally-Vixen/e/B09XKD9PV4/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 288,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“Come to me tonight. I’ll show you what it means to be mine.”Rumored to have killed his betrothed, the Dark Duke scares everyone away.Except Lady Violet. Inspired by his dangerous allure, she writes a story where he's the worst kind of villain.When Xander finds out about it, he makes her an offer she can’t refuse: a fake courtship for a month, in exchange for…further inspiration.But the real man is far more seductive than the twisted version she weaved...And she can't resist him. Even if it traps her in a marriage of convenience with the Dark Duke...*If you like a realistic yet steamy depiction of the Regency and Victorian era, then Her Dark Duke is the novel for you.An enchanting regency romance of 80,000 words (around 400 pages), written by Sally Vixen and published by Cobalt Fairy.No cheating, no cliffhangers, and a strong happily ever after.Get \"Her Dark Duke\" today to discover Sally's splendid new story!",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CRPHXQQZ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Cobalt Fairy LLC (January 5, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 5, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3003 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 428 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,571 in Kindle Store (See Top 100 in Kindle Store) #57 in Historical British & Irish Literature #69 in Historical Regency Fiction #114 in Victorian Historical Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 288 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/352299c5-4485-42ff-a5bd-163e7ad1fbc7.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/9791c8f1-7ced-4ff2-970b-bac9527a87a2.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "rjm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDKZHBZFK4H6F6K3EQQ5QLOPAZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIJFAZHGOG09O?ASIN=B0CRPHXQQZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars The Dark Duke! Could he be capable of Murder?",
                "reviewText": "A truly captivating fast paced story with Violet, a secret story writer, who decides her latest writing be based on Xander, the Dark Duke's past. Violet decides she wants to break free from her usual wallflower status. She lacks confidence in herself to pursue her attraction to Xander.The Dark Duke also is still dealing with issues concerning his past betrothed which he refuses to discuss. The author at this point created a sympathetic Duke who doesn't quite know how to close that door after five years.It was so easy to care for both the hero and heroine. The pages will fly by as you continue to build your love for both of these characters knowing the betrothed being a key surprising character twist who finally appears later in the story. I wasn't sure how the author was going to resolve all the issues each of these characters created. I thoroughly enjoyed reading this page turner love story. It was easy to relate with this tale because we all have secrets and lack the trust needed to move forward.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JayP.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIGY7JEWTKGZJOZME7BAWOBOQKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35E93ETXIJWY5?ASIN=B0CRPHXQQZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Courageous wallflower wants to make amends",
                "reviewText": "There is nothing that the Ton loves more than scandal and when Duke Alexander's betrothed disappears just before the wedding, rumours abound that he murdered her. As a result he had become a recluse, but when someone starts to write a novel based on him as the central character, Xander is enraged and determined to find the culprit.Lady Violet, labelled a wallflower, confesses that she is the one behind the story and to make amends she agrees to portray Xander in a more positive light and become engaged to him for a month to try to salvage his reputation.I enjoyed the story with its witty banter and humour and I also found the main protagonists very likeable. This is an enjoyable story well worth reading.I received an ARC copy and this is my unbiased opinion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BBumbolow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJJOHIAI3G4UULSDJT7LDGRX4VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22SVUJFZL29XM?ASIN=B0CRPHXQQZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Hidden Desires",
                "reviewText": "A chance meeting, a strange attraction, writing and publishing a multiple chapter story that was patterned after Xander who the ton had labeled the Duke of Darkness. Lady Violet had not meant to cause Xander any more distress but her stories had enraged him and he had promised himself that he would find and punish the man who was doing this to him. Little did he know it was Violet until she came up to him and professed her apology for causing him distress. He then made a bargain with her that if she became engaged to him for one month, and painted him in a better light in her story, then he would forgive her and then the ton would realize that he was not the monster they had labeled him to be. This was an enjoyable, funny at times, steamy and captivating story. It has the drama at the end that all stories have but also shows the hearts and souls of the main characters and how they really feel about each other when all of the shadows are brightened and revealed.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMPOWYIWSYACTOPIHO6HAEBJ2VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGXO4IGT4AYWC?ASIN=B0CRPHXQQZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Cancer and Violet",
                "reviewText": "What an emotional and heart warming book and characters. It keeps you turning the pages to see if the Dark Duke will break his pattern and forever mire love Violet with his own being. It starts with a story of a character like the dark duke but is so much more. Highly recommend the book and author. they get th heir HEA and so much more. Happy reading!😊",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hopeless Romantic in Chicago",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMV7QKJRUSER4BWVT4GJUDX3QDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YJ057GAR0WO0?ASIN=B0CRPHXQQZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Interesting dark hero and light heroine",
                "reviewText": "I liked xander and violet. they were a fun couple. The storyline kept me engaged. Liked it more than Ruthless Duke. historical romances will follow similar tropes. I have read them all but I like when a story engages me, makes me laugh and go through other emotions. Some books take forever to read and this one I read in one day after work. good addition to the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rural Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4EWHQLR7DUBQ3KNYMNE6NJ23IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35PN37TGUF6MV?ASIN=B0CRPHXQQZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "4.0 out of 5 stars She's drawn to his darkness",
                "reviewText": "The ton believe that he murdered his betrothed. Hence the name Dark Duke. But did he?The ton sees her as a respectable wallflower who would never associate with the Dark Duke. But is that true?Although I have read many Sally Vixen's books, I have mixed feelings about Her Dark Duke.Overall, the story is interesting. The plot is somewhat believable and the ending is very good. It's the in between that has me undecided.I liked Violet (heroine), but I just never came around to liking Xander (duke-hero). To me, he missed the hero mark. I was also put off by Violets friends, but I really liked her sister. I liked that there was enough dialogue to balance the character's thoughts and the scene action. But, I think the balance would have been better with a bit more humor and a little less sex.Content 411: This book contains both secular and religious swearing. It also contains described consensual sex scenes.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MC Lang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2J472RWSIXNFAZY5QRCK6HAGLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G1HPO1HJ2JCP?ASIN=B0CRPHXQQZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars The dark duke enters the light!",
                "reviewText": "Her Dark Duke written by Sally Vixen is such a delightful Regency novel to read. Once again Vixen creates a book filled with believable characters who take the reader on a very exciting journey throughout the entire story. Be sure to disappear into Xander and Violet's saga as your heart will throb every step of the way!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2RDJSGZIN6JDNHLNXCYJAHX23Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VPGVA05Y98ZP?ASIN=B0CRPHXQQZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "4.0 out of 5 stars On the dark side of the Duke",
                "reviewText": "Well written, full of love, romance, society, action, steam, secrets, drama, dark and light side. Violet writes about the Dark Duke in a newspaper article but soon realizes she may have made a mistake. She goes to Xander and tries to make it better for him but realizes he doesn't believe her. He offers her a bargain- agree to an engagement for one month and all will be forgiven. But not as they both plan, they both end of having feelings for each other. Happy that they get to the point of their happily ever after. Would recommend to others.I am an ARC and leave this unbiased, honest review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D2015",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 11, 2024",
                "reviewTitle": "so fun",
                "reviewText": "Wow, what fantastic characters and a captivating storyViolet has been writing stories, stories that have painted the Dark Duke even darker. Xander isn't pleased, he's enraged and swears to find the culprit for darkening his name more so than it already is. He just had no idea that the man he planning to confront, was actually a wallflower.Violet didn't mean to cause any harm or distress to the Duke, she is rather fascinated by the alluring man. She decides to find him and make amends.Upon their meeting a bargain is made, she will play at being his betrothed to help him with his tarnished reputation.Their journey to a HEA all starts with a bargain, which leads to getting caught, stopping a scandal, sparks flying, and a happy ever after.A truly enjoyable read. I loved the Strength both H&H have. Xander is dark but not really bad, alluring, and strong. Violet is intriguing, daring, and very unique.I enjoyed all the aspects of the story and watching these two fall for each other. It was a clever plot, fast paced, and funI received an ARC from the author. All opinions expressed are my own",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 2, 2024",
                "reviewTitle": "Engaging and sweet",
                "reviewText": "Like every other book this book has modern outlook of regency era. I did like the fact that this book has different anticlimax than other books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pickle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 26, 2024",
                "reviewTitle": "THE CLOSER SHE GOT THE FURTHER HE WENT",
                "reviewText": "LADY VIOLET - Reputation of a bluestocking she has her group of friends they talk and discuss everything she does not want to marry she wants independence - unknown to her parents she has secretly been writing a story for a local paper using a pseudonym of a man the story is about a RAKE (she herself is very innocent) has no idea what to call the book it has no title yet but people are buying it.DUKE XANDER - Reputation as a RAKE has stayed away from society for five years since the gossip got worse - he was to marry his best friends sisterTilly she left him standing at the alter, and disappeared ( even her parents did not know where she was ) people accused him of killing her.Violet attends a ball with her friends glancing around she sees a man dark hair good-looking standing alone, fascinated by him she decides to base the man in her book after him and calls it THE DARK DUKE.WOW SO MUCH TO THIS STORY BRILLIANT CHARACTERS ABSOLUTELY LOVED XANDER AND VIOLET - (HOT) and a few surprises could not put this down.I RECEIVED AN ARC COPY",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marion L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 14, 2024",
                "reviewTitle": "A Sensual Allure",
                "reviewText": "I liked the story very much. The plot was nice and had some twists. The characters were very likable. I enjoyed the sensual chemistry between them and the steamy love scenes. Overall, a very good start to the new series!After being falsely suspected of murdering his betrothed five years ago, Duke Alexander was shunned by society and lived in seclusion on his country estate until a writer chooses him as the dark hero for her gothic novel. He is determined to find out who the writer is, take revenge and reappear in society. At a ball, Alexander is more than surprised when the wallflower Violet, whom he met by chance a year earlier, confesses to him that she is the ominous author of the story. Intrigued and attracted to her, he offers her a deal: they will pretend a fake courtship and in return he will help her find a good ending for her story.Violet has been fascinated by Alexander’s dark and sensual allure from the day they first met. That’s why she agrees to his proposal and she longs to learn more about passion. But then they are discovered during one of their steamy encounters and their planned fake courtship turns into a marriage of convenience with obstacles…If you like steamy historical romances with a dark heroes, strong heroines and a touch of suspense, you will enjoy this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 10, 2024",
                "reviewTitle": "the dark duke and the wallflower",
                "reviewText": "Loved it !!What a great story full of emotion, passion and steam! A page turner not to be missed! Pick your copy to find out how Violet melted and captivated Xander’s heart you won’t be disappointed 🤩🤩🤩",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}