{
    "remaining_requests": 861,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Magnificent-Lives-Marjorie-Post-Novel/dp/0593355709",
    "body": {
        "name": "The Magnificent Lives of Marjorie Post: A Novel",
        "price": "$13.96",
        "originalPrice": "",
        "rawPrice": 13.96,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Magnificent-Lives-Marjorie-Post-Novel/dp/0593355709",
        "soldBy": {
            "sellerID": "A2PCOX1H5YJX31",
            "name": "BookCafe",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2PCOX1H5YJX31&asin=0593355709&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81okzHKteLL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Allison Pataki",
            "link": "https://www.amazon.com/Allison-Pataki/e/B00E99MHW2/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "BookCafe",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 16306,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “This is an absolutely terrific novel. If you want to know more about the twentieth century, it’s all here . . . and if you want to be inspired by a brilliant, gorgeous, and powerful woman, then Marjorie Post fits will fill the bill. . . . Pataki manages to make every chapter in this long and complicated life fascinating. Marjorie’s love life is as enthralling as it is heartbreaking. Her four successive husbands are unequal to the task of truly loving a woman of such wealth and power. She never admits defeat, however, and ultimately embodies the ideal of a true American hero.”—Historical Novel Society“Allison Pataki takes the reader on a luxurious ride filled with jet-setting locales and opulent mansions, while deftly revealing how Marjorie Post’s humble beginnings fed her desire to become a new kind of heiress, forging her own way through the world and keenly aware of her legacy.”—Fiona Davis, New York Times bestselling author of The Lions of Fifth Avenue “The Magnificent Lives of Marjorie Post is a richly detailed and impeccably researched triumph. Historical fiction readers will love this immersive and sweeping tribute to the fascinating Marjorie Merriweather Post.”—Chanel Cleeton, New York Times bestselling author of The Most Beautiful Girl in Cuba “With remarkable expertise, Allison Pataki has given literary voice to this legendary and remarkable historical figure. Here is an intriguing plunge into the very soul of a woman who walked both the hard and the beautiful roads of life and deserves to be remembered. The Magnificent Lives of Marjorie Post is transportive fiction at its best!”—Susan Meissner, bestselling author of The Nature of Fragile Things“Allison Pataki has written a fascinating novel about one of Washington’s most formidable female figures.”—Nancy Rubin Stuart, author of American Empress: The Life and Times of Marjorie Merriweather Post“Chock full of stranger-than-fiction moments . . . Pataki’s story doesn’t skimp on Post’s dazzling adventures—there’s big money, big houses, and big jewelry at almost every turn—but it takes pains to present a private side of Post and establish her as more than just an heiress. . . . Post’s not just any historical titan. She was larger-than-life in her own time.”—Town & Country About the Author Allison Pataki is the New York Times bestselling author of The Traitor’s Wife, The Accidental Empress, Sisi, Where the Light Falls, and The Queen’s Fortune, as well as the nonfiction memoir Beauty in the Broken Places and two children’s books, Nelly Takes New York and Poppy Takes Paris. Allison’s novels have been translated into more than twenty languages. A former news writer and producer, Allison has written for The New York Times, ABC News, HuffPost, USA Today, Fox News, and other outlets. She has appeared on Today, Good Morning America, Fox & Friends, Good Day New York, Good Day Chicago, and MSNBC’s Morning Joe. Allison graduated cum laude from Yale University, is a member of The Historical Novel Society, and lives in New York with her husband and family. Excerpt. © Reprinted by permission. All rights reserved. Chapter 1Battle Creek, MichiganWinter 1891 I was raised in religion, but it was not God who loomed largest over my girlhood and its earliest memories. That was Charles William Post, Charlie, or simply C.W. to those who knew him best. To me, he was only ever Papa.He cut no particularly imposing figure, what with his narrow frame, standing at just over six feet tall, and his fine, blue-­eyed smile. But the man molded my world, and then he went on and changed everybody else’s as well.You might say the same about my education, too, for although I went to school for all of my girlhood, it was on Papa’s lap that I did the learning that would shape me. How Papa could spin a story, building worlds in my young mind until I came to believe that just about anything was possible. Because to Papa, anything was. There were the tales of the tall Springfield lawyer whom Papa admired, a family friend by the name of Mr. Abe Lincoln, who taught himself to read as a boy in a drafty log hut with nothing more than a tattered Bible and yet somehow found himself in charge of the White House. Of course Papa—­and then I—­knew all the presidents, but I loved the stories about Mr. Lincoln the best; Papa had made this singular man a friend while they lived in Springfield, after they’d both sprung up from nothing but their own grit and the fertile frontier soil.Oh, but there were other good stories, too. Papa’s words had me forging across the Great Divide on the back of a mule, just as he’d done as a young man with his brother, my Uncle Cal, the pair of them sifting for gold amid the red mud and the pines. He had me battling Chicago’s Great Fire or else waiting out a night of dust storms in Oklahoma, shivering beneath a heap of scratchy wagon canvas as the coyote yips mixed with the wind skittering against a flimsy tin roof. He talked of pianos that didn’t need human fingers to play and buggies that didn’t need horses to pull them.It always seemed to me that by the time I arrived in the world, Papa had tried his hand at pretty much everything: he’d been an inventor in California, a salesman in Illinois, a farmer in Nebraska, a rancher in the wild Oklahoma Territory. Success had come in fickle fits and bursts, with plenty of failure mixed in, but he’d managed to wed the sweetheart of his youth in the midst of it all. My mother, Ella Letitia Merriweather, a pale beauty with gray eyes and a reserved demeanor, came from a far more affluent family but the same Springfield roots.The borders of my young mind and memory can barely contain Papa: fine-­featured, with an easy charm and smarts to best anyone else in the room, a sharp humor and a kind voice—­but then sick. Suddenly and frightfully sick.It was this sickness that fueled our journey that winter, a journey that would end in a way that none of us, not even Papa, the incorrigible dreamer, could have possibly conceived.Battle Creek welcomed us with a wall of cold air, the sort of air that stuns, needling your cheeks and causing the breath to stick in your nostrils on the way in. Beside me, Papa leaned on Mother to limp off the Michigan Central line train car and onto the frigid platform. After weeks of travel, we had arrived, and for that I was grateful, but I feared that our stop might be Papa’s final destination.“Your father is near the end of mortals,” Mother had whispered to me on our long journey up from Texas, both her words and the skin around her lips pulling tight with worry. Our train car had rocked back and forth in a doleful rhythm as swaths of ice-­slicked farmland rolled past our frosted window. Papa groaned where he lay in the berth, the extra blankets doing little to warm his thin, trembling frame. I didn’t know if perhaps he’d heard Mother’s words and was trying to respond or if he was simply giving voice to the pain that gripped his failing body. I also did not understand why Mother couldn’t put a tender hand on him or lean close to offer some soothing words of comfort, anything to lend him just a tiny bit of warmth. But then I’d rarely seen her do such a thing. And to be fair to Mother, it wasn’t she to whom Papa called out when he had the strength for words. “Budgie,” he’d whisper, his breath a sliver of pearly mist in the cold compartment, his voice so faint that I almost couldn’t hear my nickname over the rolling thrum of the train’s forward motion. “Yes, Papa, I’m here,” I’d say, taking his wilted hands in mine and lowering myself down to pass the hours by his side. Singing the chaste Christian hymns he’d sung over my bedside. Thinking with an ache, but knowing better than to say aloud: Papa, please don’t leave me. What would I do without you?Papa’s symptoms were a list of words that meant little to me at my young age. Migraines, melancholy, dyspepsia, insomnia, anxiety—­all in all, a nervous disturbance of both the body and the mind. Papa wasn’t the only man to suffer such symptoms, but it seemed to me that nobody could have possibly had them worse.When at last the train lurched to its stop and we stepped out onto the platform, a weak winter sun was lowering itself over the bustling Battle Creek station. Grateful to be free of the train’s close-packed air and the scent of the many bodies riding within, I gulped in several large, cold breaths and immediately detected the belches of train soot mixed with the aroma of the countless cows that filled the flat surrounding countryside. There was another tinny smell, one that I’d soon come to know well enough: the promise of snow.Porters jostled around the crowded depot, seeing to trunks and boxes and weary travelers. Passengers shuffled about, looking for loved ones and luggage. I stood there shivering, glancing up at each parent in turn and wondering who was in charge: Mother? Or Papa, even though his body was so visibly useless? A porter in a smart cap and dark wool coat approached us, pushing a chair and looking to Papa with eyebrows raised. “A wheelchair, sir?”“Indeed.” Papa, leaning on Mother’s arm, nodded his feeble acceptance and collapsed into the chair’s caned seat with a relieved sigh.“To the San?” the porter asked, looking from Papa to Mother.We, like nearly everyone else on that darkening platform, had come for one reason: to seek the treatment of the famed Dr. John Kellogg. A physician by trade, the brilliant Battle Creek healer attracted the sick from the East Coast to the West—­old money and new—­and even from across the oceans. Slumped in his chair, Papa’s let loose a low, faint groan.“No, to this address,” Mother answered. Even though Dr. Kellogg and his wife had adopted dozens of children over the years, they did not look kindly on little ones roaming the campus, disrupting the hundreds of feeble patients and busy medical staffers, so Mother had arranged for us to take furnished lodgings in a house just several streets from the San campus.“It is the home of a widow, a Mrs. Elizabeth Gregory.” Mother handed the porter a paper with our destination scrawled in her stiff cursive, and she watched, rigid as the frozen lampposts, as the young man oversaw the unloading of our few trunks and boxes. While Papa’s body had gone slack with sickness, as though his bones could no longer hold him entirely together, Mother’s figure seemed to coil ever tighter under the strain of our situation. I don’t remember any hair color of hers other than white.“I understand that the address is near the Sanitarium campus of Dr. Kellogg?” Mother asked the porter, who nodded and assumed control of navigating Papa’s wheelchair through the crowded depot. “Oh, yes, ma’am. Everything in Battle Creek is near the San.” Mother nodded her terse approval, taking my hand in her too-­tight grip as we followed the young man and made our way down the platform toward the noisy street.Papa groaned as the porter did his best to gently lift him from the chair into a waiting wagon, where Mother and I also took seats. “You take care now, sir,” said the kind young man. “Dr. Kellogg will have you fixed up in no time. We see miracles every day—­folks limping off the train for treatment who end up skipping their way out of town.” Papa did his best to answer the attendant with a dim smile and a nod. Mother simply folded her gloved hands in her lap, eyes fixed on some indeterminate point across the flat, frost-­covered farmland. I sat up a bit straighter as Papa turned his gaze toward me and offered me a wink. We’d heard that Dr. Kellogg’s ways were unorthodox and his treatments expensive, but all our hopes hinged on the man. Papa was near the end of mortals, to hear Mother tell it, and we had come here at the end of our hopes and our pennies; if anyone could heal Papa after years of these baffling ailments, we hoped it would be Dr. Kellogg. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 49 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 3 hrs 19 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NATIONAL BESTSELLER • “Marvelous . . . I just had to be there with the Post cereal heiress through every twist and turn.”—Martha Hall Kelly, New York Times bestselling author of Lilac Girls“New-money heiress Marjorie Post isn’t content to remain a society bride as she remakes herself into a savvy entrepreneur, a visionary philanthropist, a presidential hostess, and much more.”—Kate Quinn, New York Times bestselling author of The Rose CodeMrs. Post, the President and First Lady are here to see you. . . . So begins another average evening for Marjorie Merriweather Post. Presidents have come and gone, but she has hosted them all. Growing up in the modest farmlands of Battle Creek, Michigan, Marjorie was inspired by a few simple rules: always think for yourself, never take success for granted, and work hard—even when deemed American royalty, even while covered in imperial diamonds. Marjorie had an insatiable drive to live and love and to give more than she got. From crawling through Moscow warehouses to rescue the Tsar’s treasures to outrunning the Nazis in London, from serving the homeless of the Great Depression to entertaining Roosevelts, Kennedys, and Hollywood’s biggest stars, Marjorie Merriweather Post lived an epic life few could imagine. Marjorie’s journey began gluing cereal boxes in her father’s barn as a young girl. No one could have predicted that C. W. Post’s Cereal Company would grow into the General Foods empire and reshape the American way of life, with Marjorie as its heiress and leading lady. Not content to stay in her prescribed roles of high-society wife, mother, and hostess, Marjorie dared to demand more, making history in the process. Before turning thirty she amassed millions, becoming the wealthiest woman in the United States. But it was her life-force, advocacy, passion, and adventurous spirit that led to her stunning legacy. And yet Marjorie’s story, though full of beauty and grandeur, set in the palatial homes she built such as Mar-a-Lago, was equally marked by challenge and tumult. A wife four times over, Marjorie sought her happily-ever-after with the blue-blooded party boy who could not outrun his demons, the charismatic financier whose charm turned to betrayal, the international diplomat with a dark side, and the bon vivant whose shocking secrets would shake Marjorie and all of society. Marjorie did everything on a grand scale, especially when it came to love.Bestselling and acclaimed author Allison Pataki has crafted an intimate portrait of a larger-than-life woman, a powerful story of one woman falling in love with her own voice and embracing her own power while shaping history in the process. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Ballantine Books (February 7, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 432 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593355709"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593355701"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.18 x 0.86 x 7.99 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,070 in Books (See Top 100 in Books) #13 in Biographical Historical Fiction #24 in Biographical Fiction (Books) #302 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 16,306 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0ef439ed-0b37-4bfe-90a5-91170997a3f3.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/74d4f1be-41b7-4758-940b-fbd887e6fb21.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1732a64e-a75e-46b9-a17d-b0dbe57d3ba3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/079894c4-1b5f-4445-a3f9-24dd649ce411.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "pkf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF42TC5SAT7TMHFEYBJAHOFJZPZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJA8U0JHW8XGH?ASIN=0593355709",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Fascinating look into her life and our world from 1887-1973",
                "reviewText": "I absolutely loved this book on so many levels. She was a brilliant woman way before her time. She did not let the mores of the world stop her. Brilliant business woman in a world of men. Great designer of homes and entertainer. Also, a beloved boss of her housekeeping staff. Her friends ranged from Alice Roosevelt to Lady Bird Johnson. One of her 4 husbands was EF Hutton. Another husband was the Ambassador to Russia after the Russian revolution. If you are ever in Washington DC, visit her home \"Hillwood\". Her collection of Russian treasures from the Czars and jewelry from Marie Antoinette are astounding. She also was a great philanthropist. At age 27 she became the wealthiest person in the world when she inherited the General Foods company . She expanded that wealth by introducing frozen foods into the marketplace with the Birdseye company. EH Hutton did not think that frozen foods would work- what did he know... I could go on and on- read the book.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ellewber",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUKKLMJJQSBO5QS6FVKHENXOTWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VNCXFAZ0KS0B?ASIN=0593355709",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Interesting life",
                "reviewText": "I had heard of Marjorie Post but really had no idea who she was. I enjoyed the first part of the book more than the latter half. She really was strong-willed and intelligent. It was amazing how she decorated, threw parties, and hung out with all the rich people and politicians. I did get a little tired of hearing about it, though. I started skimming when there were long paragraphs of decorating descriptions and lists of people who were attending her events. I was happy to hear about her philanthropy and willingness to help during the wars, etc.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arkansas berry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7REFN673QB6PRF7TFXQVISVMBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35CD5VEN3LLLE?ASIN=0593355709",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars A good read",
                "reviewText": "I knew who she was but learned many things about her.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB6NIX35IFHKQHMRXLSSFFMUCCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z9947BQMUSG3?ASIN=0593355709",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Well done",
                "reviewText": "Intriguing and informative. A great read for anyone interested in history. I learned so much about Ms. Post and her achievements.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE326AIWDFSS7AN3UVIJFEFI3ESA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BWCM3QQTU57Y?ASIN=0593355709",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "3.0 out of 5 stars It was not a page turner.",
                "reviewText": "A most remarkable woman whom I had never heard of before. If a man had done all that she had done, the world would know of him. That said, everything was just too matter-of-fact. It was hard to get real excited about this book. The most interesting feat was building Mar-a-Lago. Who knew she did it?",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEBW26WOXTKBP7QSUBWUQHGYTQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HNCG3P9N4ZF2?ASIN=0593355709",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing Life!",
                "reviewText": "I had no idea about this remarkable woman! A beautiful book, rich in detail from a lost era! Someone should make this into a movie!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine Martone",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMN67LBIGK6AAM2U7IORZ7ESOQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9WDU5EE25OWD?ASIN=0593355709",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Great historical information",
                "reviewText": "It was an easy read about a fascinating life. The negative is the immature writing style. Perhaps it was done to emulate the way Marjorie Post would have written a journal. But it was distracting. If she felt something “in her belly” one more time…read like a piece for a magazine",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEC3VSM2IWFSWZ2HTP63UQO5NWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQEX5P8CZFH0Q?ASIN=0593355709",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Fascinating and compassionate patriot",
                "reviewText": "I knew nothing about the Post Cereal history or its heiress through the Civil War, WWI, WWIi, and on through the Vietnam War. Such a fascinating link to all the history. Wonderfully written and a wonderful champion of Charitable donations to so much that helped our nation's hospitals, universities, and lots more. Highly recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marlene Dezotto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 20, 2023",
                "reviewTitle": "Very informative.",
                "reviewText": "This book is very well written.A fascinating topic. A must readThe Magnificent Lives Of Marjory Post.By Allison Pataki.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 7, 2022",
                "reviewTitle": "Really disappointing",
                "reviewText": "I love Allison's previous books but this was a hard long slog with the chief issue being an one dimensional character.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angart",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 3, 2023",
                "reviewTitle": "Money can’t buy you love.",
                "reviewText": "This is fiction based on the true life of a mega rich woman who inherited wealth beyond one’s wildest dreams. As a non American, I had never heard of Marjorie Post, nor the Cereal company that generated her great fortune, but I was intrigued to read about her.However I found this book rather slow going and difficult to engage with, because Marjorie does not come across as a very nice woman. I thought she was spoilt and arrogant and was not surprised that she made a mess of 4 marriages. I suspect she was used to always getting her own way and consequently she would have been very hard to live with.This is an okay read, but not riveting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 2, 2022",
                "reviewTitle": "Wonderful read.",
                "reviewText": "One of my favourite reads in a while.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francine B Delaney",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 12, 2023",
                "reviewTitle": "Fun this woman",
                "reviewText": "I enjoyed",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.40",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}