{
    "remaining_requests": 770,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ursula-K-Guin-Beginning-Searoad/dp/1598537733",
    "body": {
        "name": "Ursula K. Le Guin: Five Novels (LOA #379): The Lathe of Heaven / The Eye of the Heron / The Beginning Place / Searoad / Lavinia (Library of America, 379)",
        "price": "$45.00",
        "originalPrice": "",
        "rawPrice": 45.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ursula-K-Guin-Beginning-Searoad/dp/1598537733",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "This title will be released on February 20, 2024.",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71Tm1G0HE6L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ursula K. Le Guin",
            "link": "https://www.amazon.com/Ursula-K-Le-Guin/e/B000AQ2M2S/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "",
        "customerReviewCount": 0,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Ursula K. Le Guin (1929–2018) was the recipient of multiple Hugo, Nebula, Locus, and World Fantasy Awards. In 2014, she was awarded the National Book Foundation Medal for Distinguished Contribution to American Letters. Brian Attebery, editor, is emeritus professor of English at Idaho State University. He won the World Fantasy Award in 2021 for his editing of the Journal of the Fantastic in the Arts and has received the SFRA Award for Lifetime Contributions to SF Scholarship, the IAFA Award for Distinguished Scholarship and two Mythopoeic Awards for myth and fantasy studies. He edited The Norton Book of Science Fiction (1997) with Ursula K. Le Guin and Karen Joy Fowler. His most recent book is Fantasy: How It Works, published by Oxford University Press in 2022. In 2019 he was Leverhulme Visiting Professor of Fantasy Literature at the University of Glasgow."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22",
            "Or fastest delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Together for the first time, all 5 standalone novels from the Hugo and Nebula award–winning writer who reinvented science fiction, including one restored to printSpans from the 1971 classic The Lathe of Heaven to her career-crowning 2008 masterpiece LaviniaThis 7th volume in the definitive Library of America edition of Ursula K. Le Guin’s works presents 5 remarkable standalone novels that showcase her boundless creativity and literary range.In the Locus Award–winning The Lathe of Heaven (1971), one of Le Guin’s most admired works of science fiction, George Orr begins have effective dreams: dreams that change reality itself. But when he turns to the sleep researcher William Haber for help, the doctor sees an opportunity to use Orr’s strange gift for his own ends.A former Terran prison colony on the planet Victoria seems destined for revolution in The Eye of the Heron (1978), when the authoritarian leaders in the City try to assert control over the peaceful farmers who have been sent to live around them.The Beginning Place (1980) is a parable-like story in which Hugh and Irena have both found their way to the Beginning Place, a gateway to another world. The two initially become enemies, but must learn to work together when the utopia they’ve found turns out to have a shadow.The long out-of-print Searoad: Chronicles of Klatsand (1991) is a Winesburg, Ohio-like series of linked stories set in a small vacation town on the Oregon coast, where some of the characters have come for a weekend and some for longer, but all are pilgrims in the grip of inexpressible longings.And Le Guin’s final, powerfully feminist novel, Lavinia (2008), reimagines Virgil's Aeneid from the perspective of a woman who, in poet's telling, never speaks a word. Special features include an appendix presenting three essays by Le Guin related to the novels, previously unseen hand-drawn maps by author herself, helpful annotation, and a chronology of Le Guin's life and career.Brought together here for the first time, these 5 remarkable standalone novels showcase a Hugo and Nebula Award–winning master at her very best. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Library of America (February 20, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 1000 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1598537733"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1598537734"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.35 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.23 x 1.16 x 8.13 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#315,178 in Books (See Top 100 in Books) #126 in Science Fiction Short Stories #709 in Metaphysical & Visionary Fiction (Books) #3,488 in Short Stories Anthologies"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}