{
    "remaining_requests": 948,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tutors-Daughter-Julie-Klassen/dp/0764210696",
    "body": {
        "name": "The Tutor's Daughter: (An English Historical Regency Romance Novel)",
        "price": "$15.99$15.99$8.37$8.37$15.99",
        "originalPrice": "$20.00",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tutors-Daughter-Julie-Klassen/dp/0764210696",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51e5e0aQ38L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51SVqR3ob0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31XxKFh8SVL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Julie Klassen",
            "link": "https://www.amazon.com/Julie-Klassen/e/B001JS6J70/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Jenson Books Inc and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1687,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews From Booklist If Emma Smallwood doesn’t do something quickly, the Smallwood Academy will have to shut its doors permanently. So when the last student enrolled graduates, Emma persuades her father to write to Sir Giles Weston to see if he will consider sending his two youngest sons, Rowan and Julius, for tutoring. After all, John Smallwood had done an excellent job preparing Henry and Phillip Weston for university. Fortunately, Sir Giles is very receptive to the idea, but he wants Emma’s father to come to Ebbington Manor and teach the boys there. However, from the minute Emma and her father arrive at the Weston family home in Cornwall, someone, or something, seems determined to drive them away. In her latest captivating inspirational romance, Christy Award–winning Klassen effectively channels the gothic spirit of Austen’s Northanger Abbey, Du Maurier’s Jamaica Inn, and the classic novels of Holt by making effective use of her atmospheric Cornish setting and creating a plot packed with secrets and intrigue. --John Charles From the Back Cover Emma Smallwood, determined to help her widowed father when his boarding school fails, accompanies him to the cliff-top manor of a baronet and his four sons. But soon after they arrive and begin teaching the two younger boys, mysterious things begin to happen. Who does Emma hear playing the pianoforte at night, only to find the music room empty? And who begins sneaking into her bedchamber, leaving behind strange mementoes? The baronet's older sons, Phillip and Henry Weston, wrestle with problems--and secrets--of their own. They both remember the studious Miss Smallwood from their days at her father's academy. But now one of them finds himself unexpectedly drawn to her...When suspicious acts escalate, can Emma figure out which brother to blame and which to trust with her heart?Filled with page-turning suspense, The Tutor's Daughter takes readers to the windswept Cornwall coast--a place infamous for shipwrecks and superstitions--where danger lurks, faith is tested, and romance awaits.\"[a] lovely addition to the genre...Regency/Klassen fans will love the mystery, romance, and drama.\" --Publishers Weekly\"A clever book that incorporates what readers love of Jane Austen, Downton Abbey and even a bit of Jane Eyre. The novel offers everything a historical romance reader looks for.\"--Historical Novels Review about The Maid of Fairbourne Hall\"Klassen delivers another impeccably crafted romance rich in fascinating details about life both upstairs and downstairs in a country estate. An excellent choice for fans of faith-based fiction and readers who miss traditional Regency romances.\"--Booklist about The Maid of Fairbourne Hall\"Well-developed characters, plot twists, and attention to period detail make this a sure bet for fans of Regency novels. A hint of romance will win Klassen readers who enjoy Catherine Palmer.\" -Library Journal\"A remarkable tale with many unpredictable twists and turns.\"--CBA Retailers and ResourcesDiscussion questions included.JULIE KLASSEN loves all things Jane--Jane Eyre and Jane Austen. A graduate of the University of Illinois, Julie worked in publishing for sixteen years and now writes full time. Three of her books, The Maid of Fairbourne Hall, The Girl in the Gatehouse, and The Silent Governess, have won the Christy Award for Historical Romance. Julie and her husband have two sons and live in St. Paul, Minnesota. About the Author Julie Klassen (www.julieklassen.com) loves all things Jane--Jane Eyre and Jane Austen. Her books have sold more than 1.5 million copies, and she is a three-time recipient of the Christy Award for Historical Romance. The Secret of Pembrooke Park was honored with the Minnesota Book Award for Genre Fiction. Julie has also won the Midwest Book Award and Christian Retailing's Best Award and has been a finalist in the RITA and Carol Awards. A graduate of the University of Illinois, Julie worked in publishing for sixteen years and now writes full-time. She and her husband have two sons and live in St. Paul, Minnesota. For more information, visit julieklassen.com. Excerpt. © Reprinted by permission. All rights reserved. The Tutor's DaughterBy JULIE KLASSENBaker Publishing GroupCopyright © 2012 Julie KlassenAll right reserved.ISBN: 978-0-7642-1069-3Chapter OneBefore, however, Lucy had been an hour in the house she had contrived a place for everything and put everything in its place. —The Naughty Girl Won, circa 1800 Five Years Later April 1817 Twenty-one-year-old Emma Smallwood carefully dusted the collection of favorite books atop her dressing chest. It was the one bit of housekeeping she insisted on doing herself, despite Mrs. Malloy's protestations. She then carefully wiped her cherished teacup against any dust particle daring to lodge there. The cup and saucer were a gift from her mother—fine porcelain rimmed with real gold. Emma set the cup and saucer back atop the leather-bound volume of Sterne's A Sentimental Journey Through France and Italy. She angled the cup to best display the image on its side—a lovely painting of a graceful gondola in Venice. Emma had never sipped from the gold-rimmed cup. But she did like to look at it. To remember her mother, gone these two years. To remember a young man who had once left roses inside it. And to imagine visiting Italy someday herself. Morning ritual finished, Emma stowed her cleaning supplies and checked the chatelaine watch hooked to her bodice. She closed the cover with a satisfying snap. Precisely as she'd thought. Time to go down and send off their last remaining pupil. Reaching the bottom of the stairs, she saw Edward Sims standing in the hall, fidgeting with his valise. He wore a smart frock coat and top hat, and looked the picture of a young man ready to take on the world. \"All set, Mr. Sims?\" He turned. \"Yes, Miss Smallwood.\" Though she was only four years his senior, Emma felt a fondness bordering on the maternal when she looked at the young man who had lived with them for most of the last three years. She glanced around the empty hall. \"Has my father bid you farewell?\" Mr. Sims shifted and shook his head. \"I have not seen him this morning.\" Emma forced a smile. \"What a pity. He shall be so sorry to have missed you. I know he wanted to be here to see you off.\" Her father ought to have been there. But no doubt he had gone to the churchyard to visit her grave. Again. Mr. Sims gave an awkward smile. \"Tell him good-bye for me, and thank him for everything.\" \"I shall.\" \"And I thank you especially, Miss Smallwood. I learned a great deal from you.\" \"You are very welcome, Mr. Sims. I wish you every success at university.\" From the front window, she watched the young man walk past the Smallwood Academy sign, and down the cobbled lane, feeling the wistful letdown she often felt when a pupil left them. This time all the more, since there were no new students to replace him. The house seemed suddenly quiet and empty. She wished Mr. Sims had a younger brother. Six younger brothers. She sighed. Perhaps even amiable Mr. Sims would hesitate to recommend Mr. Smallwood as tutor, considering how little her father had actually been involved in his education. But how would they pay their cook-housekeeper and maid, not to mention the languishing pile of bills, without more pupils? Emma walked to the desk in the family sitting room, pulled out the bound notebook she kept there, and flipped past previous lists: Books read this year. Books to read next. Improvements needed to boys' chambers. Economizing measures. Places to visit someday. New texts and primers to order for next term: None. Diversions to improve Papa's moods/Improvement noted: None. Pupils by year. Her pupil lists, which had grown shorter with each passing year, included notes on each young man's character and his plans for the future. She turned to the list from three years before, running her finger over the few names, lingering on one in particular. Phillip Weston. Kind and amiable. Second son. Plans to follow his brother to Oxford and read the law. The brief note hardly did him justice. Phillip Weston had been her only true friend among her father's pupils over the years. Seeing his name caused her to turn to another page. Another list. Prospective pupils for the future: Rowan and Julian Weston? Emma thought again of the letter she had sent a fortnight before. She knew perfectly well Henry and Phillip Weston had two younger half brothers. Phillip had mentioned them often enough. Julian and Rowan were at least fifteen by now—older than Phillip when he'd been sent to the academy. But they had not come. She had broached the subject with her father several times in the past, suggesting he write to the boys' father. But he had hemmed, hawed, and sighed, saying he was sure, if Sir Giles meant to send his younger sons to them, he would have done so already. No, more likely, Sir Giles and his second wife had eschewed their humble establishment in favor of prestigious Winchester, Harrow, or Eton. \"Well, it would not hurt to ask,\" Emma had urged. But her father had grimaced and said maybe another day. Therefore Emma, who had been acting with increasing frequency as her father's secretary, had taken up quill and ink and written to Sir Giles in her father's stead, to ask if he might consider sending his younger sons, as he had his older two. She still could hardly believe she had done so. What had come over her? In hindsight, she knew very well. She had read an account of the daring travels of the Russian princess Catherine Dashkov. Reading about the princess's exploits had inspired Emma's rare act of bravery—or foolishness—whichever the letter had been. In the end, her letter apparently made no difference. Her assertiveness had been in vain, for there had been no reply. She hoped if Sir Giles had been offended at their presumption that word of it had not reached Phillip, who was, she believed, still away at university. Turning a page in her notebook, Emma tapped a quill in ink and began a new list. Measures to acquire new pupils. Someone knocked on the doorjamb, and Emma looked up. There stood Aunt Jane, who had let herself in through the side door as usual. \"Mr. Sims departed on schedule?\" Jane asked with one of her frequent smiles, punctuated by slightly crooked eyeteeth. \"Yes. You only just missed him.\" Emma set her quill back in its holder. Her aunt laid her bonnet on the sideboard and smoothed back her hair. Amidst the brown, Emma glimpsed a few silver hairs that had escaped her ruthless plucking. Jane, her father's sister, younger by six years, had never married. She lived in the house next door, which had been their parents' home. There she ran a sister school to the Smallwood Academy—a boarding school for young ladies. Jane peeled off her gloves. \"Dare I ask where your father is?\" Emma shook her head. \"He's been gone since breakfast.\" Aunt Jane pulled in her lips in a regretful expression, her shaking head mirroring Emma's. Mrs. Malloy, the Smallwoods' cook-housekeeper, brought in the tea tray and seemed not in the least surprised to see Jane Smallwood there. In fact, three cups already sat upon the tray. \"You will join me, I hope?\" Emma asked politely, knowing full well her aunt had planned to do so all along. \"Thank you, my dear.\" As if drawn by the warm trail of steam from the kettle or the smell of Mrs. Malloy's shortbread, the front door opened and Emma's father shuffled in, head bowed, thin mouth downturned, looking older than his forty-eight years. Mrs. Malloy bustled over to take his hat and muffler, scolding, \"Mr. Smallwood ... yer shoes are a right mess! And wet trouser 'ems in the bargain. Did ya swim 'ome?\" \"Do forgive me, Mrs. Malloy,\" he said dryly. Irony glinted in his round, blue eyes. \"I did not step in that puddle to spite you.\" He wiped his shoes and looked across at his daughter and sister. \"Am I in time for tea?\" \"Yes,\" Emma replied. \"Though you have missed Mr. Sims.\" Her father blinked, clearly surprised and chagrined. \"Left already? Good heavens. I wanted to be here. I do hope you passed along my gratitude and farewells.\" \"Of course I did.\" Her father sat down, rubbing his hands together. \"Chilly day. Damp too.\" \"You ought not to have stayed outdoors so long, John,\" Jane said. \"You'll catch your death.\" \"I should be so lucky,\" he murmured. Aunt and niece shared a look of concern. Emma poured tea into their plain everyday cups, and conversation dwindled while they partook of the simple repast of hot tea, bread, cheese, and shortbread. Her father ate a little of everything, she noticed, though his appetite was not what it once was. Emma nibbled bread and cheese but resisted the shortbread, though it was her favorite. Her slim figure was one of the few things her mother had praised. Emma allowed herself sweets only at Christmas and her birthday. She sipped her tea, then set down her cup. \"Well, Papa,\" she began, \"I have started a list.\" \"Another? What is it this time?\" She felt a flicker of annoyance at his condescending tone but replied evenly, \"A list of things we might try to acquire new pupils.\" \"Ah.\" He waved a dismissive hand as though the topic were trivial. Her aunt said more encouragingly, \"And what have you thought of so far?\" Emma looked at her gratefully. \"A new advertisement in the paper. Perhaps expanding to other newspapers as well, though that would be expensive. A larger sign might help. Our old one is showing signs of wear, I fear. And hardly visible unless one is looking for it.\" Aunt Jane nodded. \"Yes, a smart, well-maintained sign is very important, I feel.\" \"Ours is fine,\" John Smallwood muttered into his tea. \"It is not as though parents go wandering through the streets in search of a tutor.\" Emma weighed her best course, then said, \"You are exactly right, Papa. It is not passersby we need to attract, but rather well-to-do families farther afield.\" His eyes dulled, and his mouth slackened. \"I just don't have the energy for all of that, Emma. I am not a young man anymore.\" \"Oh come, John,\" his sister said. \"You have many good years ahead of you.\" He sighed. \"What a depressing thought.\" With a glance at her niece, Jane said, \"You have Emma to think of, John, if not yourself.\" He shrugged, unconvinced. \"Emma is more than capable of taking care of herself. As are you.\" At that, Emma and her aunt shared another long look. If Emma didn't think of some way to help her father soon, they would be in serious trouble, both financially and otherwise. They might very well lose their home and school—his only livelihood ... and hers. * * * Emma spent the next two days combing her memory and the newspapers for names of families with sons who were not already enrolled elsewhere, as far as she knew. She was hunched over the desk when Mrs. Malloy entered the sitting room with the day's post. \"'Ere you go, love.\" Needing to stretch, Emma rose and looked idly through the stack, dreading to find more bills or final notices. Her hand hesitated on one of the letters addressed to her father. The return direction: Ebbington Manor, Ebford, Cornwall. Ebbington Manor was the primary estate of Sir Giles Weston and his family. Excitement and fear twisted through her stomach and along her spine. She had all but given up hope of a reply. Because her father left it to her to open his correspondence—especially the increasingly depressing bills—she felt only minor qualms about lifting the seal and unfolding this letter as she had so many others. She glanced toward the door with a twinge of self-consciousness, then read the lines written in what appeared to be a somewhat hurried hand: My dear Mr. Smallwood, Thank you for your letter and your kind interest in my younger sons. You are correct that they have reached—nay, surpassed—the age when my two older boys left us to spend a few years with you there in Longstaple. However, Lady Weston feels that our youngest are too delicate to live apart from their mamma. While I personally think the experience would be as good for them as it was for Henry and Phillip, and would no doubt strengthen their developing characters in the bargain, I feel I must defer to my wife's wishes in this matter. I don't suppose you would consider coming to Ebbington Manor and teaching the boys here at, say, twice the boarding rate? If you could but spend one year here preparing them for university, how ideal that would be for us. Of course I realize that is a great deal to ask, especially considering the loss of your wife, which I was very sorry to hear of. But if you ever desire a change of scenery, do not hesitate to let me know. You would be most welcome. Your daughter as well. Yours most sincerely, Sir Giles Weston, Bart Good heavens, what a thought. That her father would give up his established academy to tutor two pupils. What personal service that would be! Many young gentlemen, fresh from university but without fortune, served as tutors in grand houses. But to presume that Mr. John Smallwood would leave his home and academy to do the same ...? Emma felt offended on her father's behalf. Had word gotten around that the Smallwoods were in dire straits? Emma huffed and tossed the letter back onto the pile. She stood there, stewing. But after vexation passed, she read the letter again. In reality, Sir Giles's tone was perfectly polite, nearly apologetic to even suggest such an idea. He merely wanted to see his sons well educated—all while kowtowing to his wife's irrational coddling. The first Lady Weston, Phillip and Henry's mother, had died when the boys were quite young. And Emma knew from comments Phillip had made that his stepmother, the second Lady Weston, was somewhat difficult—and that she favored her sons by birth far above her sons by marriage. Emma recalled feeling sorry for Phillip when he'd described his tenuous relationship with the woman. Emma did not recall Henry speaking of his stepmother one way or the other, though she and Henry had not been friends and therefore had not spoken of such personal matters. Emma thought of Ebbington Manor, a place she had never seen but had often imagined, high on a cliff on the windswept Cornwall coast. Of course she would enjoy seeing Phillip Weston again. But she reminded herself that he was away at Oxford, likely in his third year at Balliol. Not sitting at home waiting for her to visit. Should she show the letter to her father? She doubted he would even consider the notion, not when he spent hours each day visiting his wife's grave. And if he did agree, what would she do—pack up her father and send him off to Cornwall for a year while she remained behind with Aunt Jane? On one hand, that scenario appealed to her. How many times had her aunt suggested Emma teach with her someday, eventually becoming Jane's partner in the girls' school, if and when she felt comfortable leaving her father on his own? But her father still needed her. Emma had been helping him for years—first during her mother's long illness and then even more so after she'd passed on and her father's depression of spirits began. Emma wasn't certain he was capable of managing on his own. Although, at Ebbington Manor, he would be responsible for only the boys' education, and not the administration of an entire academy—juggling day scholars, tuition notices, as well as special sessions with the dancing master, drawing instructor, and French tutor. Yes, it might help her father if his focus were narrowed. Yet Emma couldn't be certain, and she couldn't abide the thought of sending him away on his own. What if he should fail? Embarrass himself and suffer the mortification of being dismissed? That would be too much for him to bear in his current state. You're fretting over nothing, Emma, she chided herself. He won't want to go. But when she broached the subject after dinner, her father stunned her by straightening and becoming alert, looking at her with more animation than she'd seen in years. \"Did Sir Giles really invite us to come and live there?\" he asked. \"Yes, but ...\" \"Interesting notion ...\" His eyes brightened as he looked toward the ceiling in thought. \"Father, I assure you I did not hint at any such arrangement, only asked if he might consider sending his younger sons to us here.\" Her father nodded, but he seemed not at all vexed about the invitation, nor her presumption in writing. He asked to see the letter, and she produced it. (Continues...) Excerpted from The Tutor's Daughterby JULIE KLASSEN Copyright © 2012 by Julie Klassen. Excerpted by permission of Baker Publishing Group. All rights reserved. No part of this excerpt may be reproduced or reprinted without permission in writing from the publisher.Excerpts are provided by Dial-A-Book Inc. solely for the personal use of visitors to this web site. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 8 hrs 45 mins",
            "FREE delivery Monday, February 26 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 22. Order within 9 hrs 45 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 16 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Award-Winning Regency Romance from Bestselling Author Julie KlassenEmma Smallwood, determined to help her widowed father regain his spirits when his academy fails, agrees to travel with him to the distant Cornwall coast, to the cliff-top manor of a baronet and his four sons. But after they arrive and begin teaching the younger boys, mysterious things begin to happen and danger mounts. Who does Emma hear playing the pianoforte, only to find the music room empty? Who sneaks into her room at night? Who rips a page from her journal, only to return it with a chilling illustration?The baronet's older sons, Phillip and Henry, wrestle with problems--and secrets--of their own. They both remember Emma Smallwood from their days at her father's academy. She had been an awkward, studious girl. But now one of them finds himself unexpectedly drawn to her.When the suspicious acts escalate, can the clever tutor's daughter figure out which brother to blame...and which brother to trust with her heart? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Christian Books & Bibles",
                "link": "https://www.amazon.com/Christianity-Religion-Spirituality-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=12290"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Fiction-Poetry-Christianity-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172806"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bethany House Publishers (January 1, 2013)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 414 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0764210696"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0764210693"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.3 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1.04 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#349,475 in Books (See Top 100 in Books) #684 in Religious Romance (Books) #824 in Religious Historical Fiction (Books) #1,994 in Christian Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,687 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Bridge to Belle Island An Ivy Hill Christmas A Castaway in Cornwall Shadows of Swanford Abbey The Sisters of Sea View A Winter by the Sea Also by this author",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8e524a75-0609-4b62-8837-832623eec440.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e7a8ae0-d4be-495f-a43c-25147c78b0eb.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76b77258-34b4-4ff2-ad0a-2d7f14b45e7f.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c3c4cd2-3d1b-4773-9af0-81df1426391e.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1cab4b0f-7df9-42c6-9f35-daddc19e27f8.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fb83885b-3c84-45e3-8f76-76151e91c37f.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stephanie McCall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIAFYGY52CLYABTK4YS42R6NWDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YFOMQK5EJER5?ASIN=0764210696",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 1, 2020",
                "reviewTitle": "5.0 out of 5 stars The Perfect Late Summer Romance with a Dash of Gothic Mystery",
                "reviewText": "The Tutor's Daughter is what might happen if Northanger Abbey and The Secret Garden had a baby, and maybe if Persuasion were its auntie. In my revisits of Julie Klassen's books, this is one of my favorites. The romance between Emma and Henry combines timeless and unique, and the mysterious elements add some delicious intrigue to the windswept, sometimes melancholy Cornwall setting.I found a literary soul sister in Emma Smallwood. At first I thought that was just because we would both be considered \"spinster bluestockings\" in Regency England--ladies who loved to read and study but often found ourselves at sea with socialization. But as the book progressed, I saw myself in Emma's need for order and control, too. That's why I felt conviction regarding her spiritual journey, but also rooted for her to learn and grow--because I found myself rooting for the same things in my own life. (Hopefully though, it won't take a near-drowning in a cliffside chapel in my case). :)Henry Weston was Emma's perfect hero, though a bit of a surprise as far as heroes go. That is, if I were Emma, I too would stay as far as possible from the grown up boy who pranked and teased me mercilessly in school--and not only school, but my own home, no less! The nerve! I didn't blame her for comparing Henry to the north wind at first, but if north wind Henry is, he is the bracing, refreshing kind. A perfect gentleman, yet bold and unafraid to stand up for those he loves and what is right, he made me swoon in an understated way. But sometimes understated heroes are the best.I loved the secondary characters too, mostly because the majority were unpredictable. Emma's comparison of the four Weston brothers to the four winds was a clever bit of symbolism, and it works wonderfully whenever we see the brothers on the page. Without giving away anything, I too tried to guess who was who, and found myself pleasantly though not unexpectedly surprised. As with all good suspense, the solution makes sense once you see it, but until then, guessing and puzzling things out is fun. Those secondary characters gave me a lot to puzzle over, especially Lizzie (was she a \"good guy\" or a \"bad guy\") Derrick Teague (how did he fit into the rest of the story) and even Adam (again, where did he fit in)?Speaking of Adam, I must applaud Julie for his character. I had a lot of mixed feelings, because as a modern reader, I hated the idea of Adam being raised elsewhere just because of a disability. I was also ready to say some Very Bad Things to Lady Weston and the Penberthys on his behalf. But, no such thing as politically correct history and all. For their era, the Westons mostly did the best they could--looking at you again, Lady Weston! And as for Adam himself--well, I'm not entirely on board with his savant characteristics because people still tend to think that all people like Adam are savants. But I liked how those skills were allowed to make up his whole character, and Adam does come across as three-dimensional. I felt terrible for him, but I never felt he was a helpless victim. Instead, I felt that with people like Henry and Emma supporting him, he could excel.The spiritual threads here are fairly subtle, but well done. There were many times Henry could've preached at people, and sometimes I admit I kind of wished he would. Mostly though, we see the difference between relying on God and ignoring Him through characters' actions. It's allowed to happen organically, which invites readers to think through implications themselves. Emma is a great example, in that she shuns God for taking her mother, yet seems to think He will treat her just as that critical parent did. I loved seeing her learn the opposite is true--because I have to relearn that fairly often. Another good example is Sir Giles, who struggles to lead his family and pays the consequences of his attitude, but is given a second chance.All this happens in a beautiful, and as I said intriguing, setting. Throughout The Tutor's Daughter, I could feel the sea winds and hear the ocean crashing against the cliffs, or the warning bell trying to shelter sailors and civilians from unexpected storms. I wanted to visit the Weston manor, maybe poke around and stir up a little intrigue for myself. Failing that, I'd have loved to share a book and cup of tea with Emma, or play chess or \"battles\" with Emma, Adam, and Henry. If I couldn't do that in real life, this novel was the next best thing. It gets my enthusiastic recommendation.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer.   Cheryl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWQ5FEN3KAP2F6NVHAV7G2XSU5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JGG7ND16T4SJ?ASIN=0764210696",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book! Loved it!",
                "reviewText": "It was a good book. Her writing is above some authors. Loved it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WRB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOJ2RCPUOP4CD6E6S5YO7T7BP4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R55TGD92GN7ZS?ASIN=0764210696",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2012",
                "reviewTitle": "4.0 out of 5 stars Julie Klassen never disappoints",
                "reviewText": "I was swept into the early 19th England century with the author's beautiful descriptive writing and flowing dialogue. Emma Smallwood and her father leave Longstaple and their failing academy and boarding school for Ebbington Manor on the Cornwall coast. It is there that Mr Smallwood is hired to tutor the two youngest Weston boys, Julian and Rowan. Ebbington Manor is laced with many secrets and mystery with complexities developing throughout.The Tutor's Daughter is filled with many well crafted characters - some likable and some not so likable. Emma, the tutor's daughter, is not quite a guest, not quite a servant, and certainly not family at Ebbington. Who is her ardent admirer who is sending the presumptuous notes? Are they a prank or are they sincere?Phillip and Henry Weston, the two eldest brothers, are quite interesting. Phillip, who seems to be the kind, mild, and friendly one and Henry, who is rather laconic - at least early on.Lady Weston, the stepmother to Phillip and Henry, comes across as an unkind woman who is very fond of money and not pleased to have a romance develop between one of her stepsons and Emma. And what is she hiding?Sir Giles, the father of the Weston family, tries his best to appease Lady Weston, but a nearly impossible task. He retreats to his library and drinks brandy when problems arise.Lizzie Henshaw, Lady Weston's ward, is my least favorite of all the characters - a bit hard to take with her sharp tongue. And what is her troubling secret?And finally, the two younger twin brothers, Julian and Rowan, who are full of pranks and a little hard to like at times.Julie Klassen never disappoints me with her beautifully written books and a style similar to Jane Austen. I know I'm in the minority, but I have to say that this is not one of my Klassen favorites. My favorite is still Lady of Milkweed Manor. The only negative comment I have is that the storyline moved too slowly in the first part of the book. I do recommend this book and all of Julie Klassen's books. You'll not be disappointed.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "McKenzie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 15, 2019",
                "reviewTitle": "The Tutor's Daughter - Julie Klassen.",
                "reviewText": "Fabulous read from Julie Klassen. Have read several of her books and this one does not disappoint. Great Novel and couldn't put it down read! H.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 11, 2017",
                "reviewTitle": "Romantic and mysterious",
                "reviewText": "Well written, with sufficient suspens to be surprised, yet sufficient romance to be happy with :)Some characters are nevertheless quite difficult to understand.Jane Austen's inspiration for sure, with a bit of Bronte too.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nadine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 24, 2014",
                "reviewTitle": "Easy read.",
                "reviewText": "Very enjoyable, held my interest, a little bit of everything in the book, ie. romance, history, suspense. An easy read highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ludo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on July 27, 2013",
                "reviewTitle": "(3,5) Tre stelline e mezza con riserva",
                "reviewText": "Inghilterra, periodo della reggenzaEmma Smallwood è la figlia di un insegnante vedovo e inconsolabile. Dalla morte della moglie, infatti, il signor Smallwood non si cura più di se stesso e della sua accademia per l'educazione di giovani gentiluomini che, di conseguenza, sta sprofondando nella rovina. Vista la triste situazione, l'invito che Sir Giles fa a Mr. Smallwood di trasferirsi a Ebbington Manor per fare da precettore ai minori dei suoi quattro figli non può che essere accolto di buon grado da Emma e dal padre, che decidono di partire alla volta della Cornovaglia. Giunti a destinazione, niente è come si aspettavano: la famiglia Weston pare non attendesse il loro arrivo e, poi, succedono cose strane... Chi è che suona il pianoforte la notte? Nel frattempo, Emma reincontra Philip e Henry Weston, i maggiori dei figli di Sir Giles, che già aveva conosciuto durante la loro permanenza all'accademia del padre. I due sembrano così uguali a come se li ricordava, ma pure così diversi e uno di loro si sente immancabilmente attratto da lei... Ma Emma? E che segreti nascondono i Weston e Ebbington Manor?AAA Trattasi di Christian fiction, narrativa cristiana. Personalmente la Chrstian fiction non mi dispiace, anche se cerco di non imbarcarmi in letture dai toni troppo predicatori e i contenuti eccessivamente morali perché, essendo poco abituata a quei tipi di registro, spesso mi suona un po' stonata. Dopo questa premessa, mi trovo a confessare che non sono riuscita ad apprezzare del tutto questo libro di Julie Klassen. Perché? Proprio perché troppo predicatorio. Ci sono rimasta maluccio, devo ammettere. Della Klassen avevo letto The girl in the gatehouse, in cui i temi cristiani di perdono e redenzione erano presenti, ma la religione non risultava pervasiva. The tutor's daughter, al contrario, è proprio... preachy! La vena moralizzante si sente molto e la lettura, per me, si è fatta più pesante.Detto ciò, rimane un romanzo carino in cui si uniscono romanticismo e mistero nella Cornovaglia di inizio Ottocento, un'area che nascondeva delle insidie e che era tristemente famosa per i terribili naufragi che si abbattevano sulle sue coste (e i naufragi, in questo libro, sono importanti.)Come in altri romanzi rosa a stampo cristiano, anche in The tutor's daughter ho apprezzato la trama più articolata rispetto ai romance tradizionali e il suo essere disincantato: si tratta di un libro a forte sfondo sentimentale dove alla fisicità del rosa classico si sostituiscono un numero maggiore di ostacoli da superare, una più complessa crescita dei protagonisti e in cui il lieto fine non è un «e vissero felici e contenti,» ma qualocsa di più realistico e umanamente realizzabile.Tre stelline e mezza con riserva perché troppo predicatorio per i miei gusti, come specificato sopra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ötti",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 9, 2013",
                "reviewTitle": "Wieder mal ein sehr gelungenes Buch von Julie Klassen.",
                "reviewText": "Inhaltsbeschreibung der deutschen Version (die im Juni rauskommen soll)Emma Smallwood begleitet ihren Vater nach Ebbington Manor, als dieser in dem Herrenhaus eines Barons der Hauslehrer der vier Söhne wird, hoch oben über der Steilküste Cornwalls. Doch es geschehen merkwürdige Dinge. Wer spielt Klavier mitten in der Nacht? Wer hinterlässt merkwürdige Hinweise in Emmas Schlafzimmer? Die beiden älteren Söhne des Barons haben ihre eigenen Geheimnisse. Sie kennen Emma noch aus ihrer eigenen Schulzeit und sie muss entscheiden, welchem Bruder sie trauen kann.Wenn man nicht warten kann, bis die deutsche Übersetzung rauskommt, greift man gern schonmal nach dem Original =) Lässt sich gut lesen und ist sehr verständlich.Die Geschichte ist sehr interessant und spannend geschrieben. Allerdings sind gegen Ende die jüngeren Söhne wenig glaubhaft. Trotzdem sehr empfehlenswert!Würde mich auf baldigen Nachschub von Julie Klassen sehr freuen!PS: Auf der Homepage der Autorin gibt es manchmal Bilder von ihrer Recherche in England und Background-Infos zu den jeweiligen Häusern und dem Umfeld der jeweiligen Titelheldin.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}