{
    "remaining_requests": 741,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beirut-Station-Two-Lives-Novel-ebook/dp/B0BV19QQD8",
    "body": {
        "name": "Beirut Station: Two Lives of a Spy: A Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beirut-Station-Two-Lives-Novel-ebook/dp/B0BV19QQD8",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71KsLyaAPYL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Paul Vidich",
            "link": "https://www.amazon.com/Paul-Vidich/e/B01EJXP0SU/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 528,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A stunning new espionage novel by a master of the genre, Beirut Station follows a young female CIA officer whose mission to assassinate a high-level, Hezbollah terrorist reveals a dark truth that puts her life at risk.Lebanon, 2006. The Israel-Hezbollah war is tearing Beirut apart: bombs are raining down, residents are scrambling to evacuate, and the country is on the brink of chaos. In the midst of this turmoil, the CIA and Mossad are targeting a reclusive Hezbollah terrorist, Najib Qassem. Najib is believed to be planning the assassination of Secretary of State Condoleezza Rice, who is coming to Beirut in ten days to broker a cease-fire. The spy agencies are running out of time to eliminate the threat. They turn to a young Lebanese-American CIA agent. Analise comes up with the perfect plan: she has befriended Qassem's grandson as his English tutor, and will use this friendship to locate the terrorist and take him out. As the plan is put into action, though, Analise begins to suspect that Mossad has a motive of its own: exploiting the war’s chaos to eliminate a generation of Lebanese political leaders. She alerts the agency but their response is for her to drop it. Annalise is now the target and there is no one she can trust: not the CIA, not Mossad, and not the Lebanese government. And the one person she might have to trust—a reporter for the New York Times—might not be who he says he is… A tightly-wound international thriller, Beirut Station is Paul Vidich's best novel to date.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BV19QQD8"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Pegasus Crime (October 3, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 3, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2561 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 301 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1639365117"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#23,519 in Kindle Store (See Top 100 in Kindle Store) #63 in Historical Thrillers (Kindle Store) #133 in Terrorism Thrillers (Kindle Store) #156 in Terrorism Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 528 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "korprof",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGB4J4BFTLYRXGFEIHOUKQSQOGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P78TRFRVBWZP?ASIN=B0BV19QQD8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Fascinating Page-turner",
                "reviewText": "I loved the story and the main character. Lots of conflicting interests…personal, career, Would like to see more with this character.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William de Rham",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIO7HNVQSDLCEWJZ5CQSKT72VIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UYEN7G7550BB?ASIN=B0BV19QQD8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "4.0 out of 5 stars A well-done spy novel",
                "reviewText": "With his newest novel, “Beirut Station,” author Paul Vidich has given us a cerebral, moody, absorbing tale of espionage laced with action and suspense. It’s a story more reminiscent of John le Carré than Ian Fleming or Robert Ludlum. There are no heroes, only spies and assassins.The time is 2006. The place is Beirut, Lebanon. Analise Assad, a young, intelligent, and attractive Lebanese-American Georgetown graduate, has recently joined the CIA. Now, she is part of an American-Israeli team charged with taking out Hezbollah terrorist Najib Qassem before he can assassinate US Secretary of State Condoleezza Rice during her upcoming visit. To be successful, Analise will have to exploit a number of people, including several possible love interests, as well as two teens depending on her to help them escape their war-torn country.Mr. Vidich seems to have done a ton of research to give us a very realistic story. He writes knowingly and with nuance about Lebanese history and politics, the city of Beirut, Israeli and American foreign policy objectives, espionage and terrorist tradecraft, what it means to be an intelligence officer (at both the senior and junior levels), and the emotional toll the profession can exact. His main characters have depth and complexity and are compelling. He’s successful at showing us the sights, sounds, and smells of a 2006 Beirut under assault and the city during earlier, more peaceful times.I did have some trouble getting into the story. If, like me, you’re not all that familiar with (or have forgotten) what was going on in Lebanon during the latter part of George W. Bush’s presidency, you might feel somewhat lost. (However, a quick trip to Wikipedia’s Lebanon article solved the problem for me.) Mr. Vidich also doesn’t hesitate to interrupt his story’s progress to explain what his characters are thinking and feeling. While those digressions do add immensely to the novel, giving it something of a literary quality, they do take some getting used to.Those who are fans of fiction and non-fiction tales about espionage should find much to enjoy in \"Beirut Station.\"",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suzanne NYC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOC6CCN3PD2TXMRREVCXVTT4LJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2737O9IXNL9W7?ASIN=B0BV19QQD8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars A compelling and unusual spy story.",
                "reviewText": "Fascinating, horrifying, and controversial with a conflicted female protagonist. The story gathers speed like a runaway freight train. It kept me up all night-what more can I say?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leonick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUKQC452A6JST2SQVYCHVDIKS3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30GD39M94W2HL?ASIN=B0BV19QQD8",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "3.0 out of 5 stars So So",
                "reviewText": "Analise (terrible name for a character) is a sympathetic protagonist but there are a lot of problems with the plotting of this novel which results in lack of plausibility in the characters and the story- few (serious) agencies still use mainstream media or UN organizations to place their non official cover officers. Not even in 2006. Analise seems to spend more time hanging out with her journalist contacts than doing any real UN work that would be part of her NOC identity- none of the characters ever cohere into fully rounded individuals- the author does not know Lebanon and it shows. McCloskey did a better job evoking St. Petersburg from a distance in the quite good “Moscow X”- the assignment to assassinate Qassem doesn’t make much sense as a plot driver. Killing a top leader wouldn’t deter or disrupt Hezbollah one inch (remember Mugniyeh, see the excellent “Rise and Kill First”)- the Israeli campaign against Lebanese politicians would have been a more interesting (and just as believable) plot device, but it doesn’t add much to the story in this book- the writing, suspense, plot twists, technical / specialist knowledge are all medium grade qualitybottom line: ok for a long flight or rainy afternoon",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert Price",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCGZIE5BJTZNTIWJQZQHDVWE5QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1848QXACRA10C?ASIN=B0BV19QQD8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars An interesting and worthwhile read",
                "reviewText": "This plodding story of a fictitious mission in Beirut with Israeli, US and Lebanese intelligence officers criss-crossing paths through seedy neighborhoods, luxury hotels and yacht clubs does have a slow burning suspense that builds and culminates with a satisfying conclusion. I think the author errored in using character names that are so obviously drawn from actual historical events in US espionage (Aldrich) and constant references to Philby were overdone. The story would have been better if he had left that out. Otherwise, I look forward to the next installment!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ron Ashkenas, author of &#34;Simply Effective&#34;",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6C2ZP3X77A4RRBQ3NZKETEW4CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I1T7B0DA1LXF?ASIN=B0BV19QQD8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "5.0 out of 5 stars If you like spy novels, this is one that you can't put down! Vidich's best.",
                "reviewText": "This is Vidich's best novel to date. Analise Abbas is a young CIA agent operating as a UN refugee worker in Beirut during the Israel-Hezbollah war in Lebanon. Caught between conflicting pressures from senior colleagues, an ambiguous relationship with a war correspondent, and her own morality, Analise is forced to make decisions that will affect her own life and those of the people around her. Beautifully written, Beirut Station captures the despair and danger of a city at war, and the inner struggles of a young woman trying to make sense of a situation with no rules.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Dekleva",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6S2G7OS3W42VSLK6M6VPYGNQJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CHLD89DH1UAW?ASIN=B0BV19QQD8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2023",
                "reviewTitle": "5.0 out of 5 stars A taut, captivating Middle Eastern spy thriller",
                "reviewText": "After a number of superb Cold War spy thrillers, Paul Vidich, with this excellent, taut thriller, makes his first foray into the wilderness of mirrors surrounding terrorism in the Middle East. His novel is set in Beirut and involves the psychological and moral choices made by a deep-cover CIA NOC, in a world where nobody can be trusted - not her fellow CIA officers, her Lebanese colleagues, or her Mossad counterparts. Because of its setting and plot, the novel has a natural tension which draws the reader along, to a gripping conclusion, with plenty of betrayal to go around. A fine effort by Vidich - 5 stars!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VICKY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMWSQKAVBLZBYXPPP34QZRAD2LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SBFVVVVZCVRV?ASIN=B0BV19QQD8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Modestly interesting",
                "reviewText": "Book has an interesting female spy who has failings, lack of ability to love, not much personal life….except that she is a slob. The story is interesting and has vague characters who are intertwined. But Annalise has scruples, no you cannot kill that terrorist now, who killed Aldrich, she does not like Bauman. Some men save her here and there but we do not see her beauty, her charm, her reality….just her work personality. Even James Bond had a senses of humor. Oh well….it is readable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ken Feingold",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 16, 2024",
                "reviewTitle": "Bad Choices",
                "reviewText": "The author needs to harken back to take a hard look at who he chooses to vilify. To put it mildly, I was not amused by his choices.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reader-718",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 8, 2024",
                "reviewTitle": "Top Class Depiction Of The Dirty, Duplicitous World Of Espionage!",
                "reviewText": "When your friends can become something an IQ Test, members of your own team so obfuscational it’s paradoxical & your workplace becomes a live maze of treachery; who do you trust, where do you turn?This is, without a doubt, a quiet titan of a book in the genre. I’ve read a handful of the authors work before and was always very impressed. This, though, this is a new level — and to be loudly applauded!I say, does the author perhaps have anything further in the DLB?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}