{
    "remaining_requests": 969,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Thread-Collectors-Shaunna-J-Edwards/dp/1525899783",
    "body": {
        "name": "The Thread Collectors: A Novel",
        "price": "$12.36$12.36",
        "originalPrice": "",
        "rawPrice": 12.36,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Thread-Collectors-Shaunna-J-Edwards/dp/1525899783",
        "soldBy": {
            "sellerID": "A1G0F2B5ILT0AO",
            "name": "B's Book Bin",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1G0F2B5ILT0AO&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81DgHugIGyL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Shaunna J. Edwards",
            "link": "https://www.amazon.com/Shaunna-J-Edwards/e/B09H8Y289G/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "B's Book Bin",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2022,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Advance Praise for The Thread Collectors“The Thread Collectors by Shaunna J. Edwards and Alyson Richman is the original story of a Black woman in New Orleans and a Jewish woman in New York, both of whom are fighting for the cause of freedom and Union victory through their needlework during the Civil War. Their lives converge in unexpected ways in an unforgettable story of female strength, hope and friendship. This collaborative work is magnificent—a true revelation!”—Pam Jenoff, New York Times bestselling author of The Woman with the Blue Star“The Thread Collectors is a brilliant story brimming with unexpected friendships and family ties that fed my soul. Historically sound and beautifully stitched, it is a story that will stay with you long after the last page is turned.”—Sadeqa Johnson, international bestselling author of Yellow Wife“The Thread Collectors is a gift—not only for lovers of historical fiction, but for readers everywhere who search for hidden truths behind the facts we think we know. Like the fearless, sensitive, and resourceful women they write about, Edwards and Richman have stitched together a glorious tapestry of resilience, survival, friendship, and love. This is a Civil War story unlike any other—a story readers will treasure from the very first page.”—Lynda Cohen Loigman, USA Today bestselling author of The Two-Family House and The Wartime Sisters“In their transfixing novel, Edwards and Richman offer a vibrant tapestry of characters whose lives have been shattered by slavery and Civil War, yet find a tenuous connection in scraps of fabric that symbolize hope, love, even escape. Both heartbreaking and thrilling, I dare you to put this novel down as it hurtles toward its riveting conclusion.”—Fiona Davis, New York Times bestselling author of The Lions of Fifth Avenue“The Thread Collectors pushes back against simple Civil War narratives and spotlights historical realities, including the abysmal treatment of Black Union soldiers, Southern antisemitism, and Northern racism…..This book, with its distinct prose, quick chapters, and dynamic characters, provides a stirring narrative and much-needed perspective in Civil War fiction.”—Booklist“The authors have penned an engrossing story, and they use it to expose many of the cruelties experienced by enslaved people, prejudice against Jewish people, military incompetence, and the devastation of the land by both armies. This they accomplish with grace and nuance, educating as they entertain…. This novel pulls the heartstrings of love and loss, terrors and joys.”—Historical Novel Society, Editors’ Choice"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 2 mins",
            "FREE delivery February 29 - March 4 on orders shipped by Amazon over $35",
            "Or fastest delivery February 28 - March 1"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“An unforgettable story of female strength, hope and friendship. This collaborative work is magnificent—a true revelation!” —Pam Jenoff, New York Times bestselling author of The Woman with the Blue Star“A brilliant story brimming with unexpected friendships and family ties. Historically sound and beautifully stitched, The Thread Collectors will stay with you long after the last page is turned.” —Sadeqa Johnson, international bestselling author of Yellow Wife 1863: In a small Creole cottage in New Orleans, an ingenious young Black woman named Stella embroiders intricate maps on repurposed cloth to help enslaved men flee and join the Union Army. Bound to a man who would kill her if he knew of her clandestine activities, Stella has to hide not only her efforts but her love for William, a Black soldier and a brilliant musician.Meanwhile, in New York City, a Jewish woman stitches a quilt for her husband, who is stationed in Louisiana with the Union Army. Between abolitionist meetings, Lily rolls bandages and crafts quilts with her sewing circle for other soldiers, too, hoping for their safe return home. But when months go by without word from her husband, Lily resolves to make the perilous journey South to search for him.As these two women risk everything for love and freedom during thebrutal Civil War, their paths converge in New Orleans, where an unexpected encounter leads them to discover that even the most delicate threads have the capacity to save us. Loosely inspired by the authors' family histories, this stunning novel will stay with readers for a long time. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Graydon House; Original edition (August 30, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1525899783"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1525899782"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 0.88 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#47,634 in Books (See Top 100 in Books) #123 in Jewish Literature & Fiction #133 in Black & African American Historical Fiction (Books) #1,207 in Women's Friendship Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,022 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d78bf9b-7cce-472f-9da1-ffd3672f174d.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ec4b30fc-da78-458d-90b5-c262ed494820.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a32b828-d28f-47d0-a2d6-07beb8a21767.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dde9768a-1667-4190-b7a3-8de07236f006.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXKIRU7G5V6Z2HKBYG2CB5DXAHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8PRLR00K6QVE?ASIN=1525899783",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Gripping",
                "reviewText": "This novel takes us on a journey of a shameful, painful, and complicated past, with moments of hope, and redemption and, after many twists and turns, brings us to a most bright and propitious ending. Human dignity prevails.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marti Perronie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6KVURK5BWGMSZVYDBKNKFT7M7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35VOBPQ2PMYOR?ASIN=1525899783",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2022",
                "reviewTitle": "4.0 out of 5 stars Great historical fiction",
                "reviewText": "Book review of my latest historical fiction, The Thread Collectors by Shaunna J. Edwards and Alyson Richman⭐️⭐️⭐️⭐️This story is told from the Civil War Era and I always loved to read and learn about this trying time in our history.In New Orleans, we meet Stella, who is a slave to a not so nice man, Mr. Frye. Stella decides to try to help her love William, who is a black Union soldier and an awesome musician, by sewing maps to help the enslaved men flee to freedom. She is gathering the information for her maps from Mr. Frye and knows that he will kill her if he figures it out.Then we have Lily, who is in New York City and a Jewish woman. Her husband is in the Union Army and stationed in Louisiana. She sewed a quilt and stashed sheet music hidden within the quilt for her husband Jacob the musician. Lily and Jacob write often, and he tells her about his friend William the gifted musician. But when months go by and Lily gets no letters, she goes in search for husband.When these two special ladies meet by chance, they come together to save their loved ones!I really liked this book and the sewing reminded me so much of my grandmother. I can't wait to discuss with @bookfriendsbookclub Sunday.#crazybooknerd #bookstagram #lovehistoricalfiction #bookfriendsbookclub #lovediscussinggreatbooks",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Moani Revoir",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHBIJEN43IWGDIPXOLJNGIJLWHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33NHCKN7IZZ5F?ASIN=1525899783",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Must read",
                "reviewText": "The authors captured my heart in the pages of this book. With every thread unwoven I felt for Stella and William and their families. I cried for them and cheered for them. This is a very thought provoking read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J Brav",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6MGWWN5TNYQ6QXKRWQJ2TPSKYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SDHT8VXWI8S5?ASIN=1525899783",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Unique and evocative Civil War tale",
                "reviewText": "I just finished reading The Thread Collectors, and was moved by this story of hardship, friendship, war and political division, discrimination and survival during the Civil War. It did a wonderful job of capturing two perspectives--Black and Jewish--not often captured in historical fiction of that era. I loved that the story was inspired by the two authors' friendship and their family histories.I was inspired by the creative ways the two main women got involved in supporting the Union (Stella with the maps she sewed, Lily with the quilts and bandages). I also appreciated that it wasn't just about the women's perspective, but also captured the men's experience. I loved the brotherly bond that developed between William and Jacob through their love of music. There were several realistic scenes about some of the traumas endured during those times that were deeply moving (and could warrant a trigger warning).Highly recommend, and look forward to reading some of Alyson Richman's other books (and hopefully other books by Shaunna J. Edwards).",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ilene",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHM2IB46LMRI3SGMSWQOXLJWVPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36RBL3J1U9M5P?ASIN=1525899783",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2023",
                "reviewTitle": "4.0 out of 5 stars The Thread Collectors",
                "reviewText": "Interesting story that chronicles two families. One a Jewish northern, one a black southern. Set in the midst of the American Civil War it shows the humanity and cruelty of the South during the war.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENVBSHCTGP5GXDQPVMKR3I6FBWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DLCHAA1V9RMJ?ASIN=1525899783",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "5.0 out of 5 stars The Thread Collectors",
                "reviewText": "The character development is so rich. I enjoyed all of them! The story seems true to the actual events of that era!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGBQJ7OSIHPMPGOOZZ5KFFCXHHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MA084YEJ4C3U?ASIN=1525899783",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2022",
                "reviewTitle": "3.0 out of 5 stars interesting book but uneven",
                "reviewText": "The book was sometimes very compelling and hard to,put down. The mishaps of William and Jacob and how Jacob was captured by a old woman who thought he was her son. Williams help to get Jacob back for Lily and finally, all leaving for a new life in New York. A hopeful ending. The book was uneven. Sometimes hard to put down and sometimes hanro to continue to read. It was interesting to hear th authors discuss the book and how it was written. That is why I picked it up again.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LindaG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2UIYSDIMQFXTUM4KBJVZELFRVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXIZSH7J3LSTW?ASIN=1525899783",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 17, 2023",
                "reviewTitle": "5.0 out of 5 stars An unexpected gem",
                "reviewText": "I'm not sure what I expected when I chose this book to read. What I found was a story that will long be remembered. This book is well written and filled with with stories that are both historical and current at the same time.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 23, 2023",
                "reviewTitle": "Thoroughly enjoyable account of the latter years of American Civil War.",
                "reviewText": "Enjoyed the dual story line of New Orleons runaway slave musician and the N.Y. Jewish musician's friendship.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.75",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            }
        ]
    }
}