{
    "remaining_requests": 804,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Counterfeit-Scoundrel-Chessmen-Masters-Seduction-ebook/dp/B0B2RPBHNN",
    "body": {
        "name": "The Counterfeit Scoundrel: A Novel (The Chessmen: Masters of Seduction Book 1)",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Counterfeit-Scoundrel-Chessmen-Masters-Seduction-ebook/dp/B0B2RPBHNN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81w9gDQ06IL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lorraine Heath",
            "link": "https://www.amazon.com/Lorraine-Heath/e/B000APAQ54/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 627,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B2RPBHNN"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Avon (February 21, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 21, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4141 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 377 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0063114631"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#136,968 in Kindle Store (See Top 100 in Kindle Store) #1,086 in Women's Historical Fiction #2,208 in Victorian Historical Romance (Kindle Store) #5,571 in Women's Romance Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 627 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Return of the Duke The Duchess Hunt Scoundrel of My Heart",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ac2f7536-dbab-4830-8e93-173d2fc3c0f4.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d407b6c1-f055-4ac3-9809-0e7f4431eea7.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4588eaff-d75f-4eea-8c7d-83655923b6f6.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6857abf4-8f97-459e-8a86-3efaf42cb65f.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LL3820",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXVTUVTHNJI6LCURB65EVGRCK2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SMDVIRJ3E85N?ASIN=B0B2RPBHNN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars the scoundrel made me swoon",
                "reviewText": "And i stayed up way too late reading this novel, but dont regret it one bit! Worth the read! On to the next book in the series!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheila M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEKDE4QV6FQYX4JVAPAQQCV2D6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MNAEB9JMNWCR?ASIN=B0B2RPBHNN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Solid Story with Good Connection between Bishop and Daisy",
                "reviewText": "FINAL DECISION: Because Daisy is a private investigator, there is a mystery here to solve. Ultimately, there are some unexpected twists in the story that I enjoyed. The plot here somewhat outweighs the romance, but I thought the relationship between Daisy and Bishop was fun.THE STORY: One of the Chessmen, Bishop, aka David Blackwood, is a notorious womanizer, having been named in various divorces as committing adultery with wives. Daisy Townsend is a private investigator who has taken a position in Bishop's house to confirm whether or not he is having an affair with her client's wife. Bishop can't stop thinking about his new maid when he sees her. The two seem to be playing a game, outsmarting and flirting simultaneously. When Bishop becomes a suspect in a murder, Daisy has to help find the real murderer.OPINION: This book is more mystery heavy than I expected from a Lorraine Heath book. (I think I could read a mystery series with Daisy and Bishop and be happy!) I thought the mystery was intriguing, and the twist in the story was unexpected but worked well in the context of this story.I also really liked the interactions between Daisy and Bishop. There is clearly a real intellectual connection between the two, along with hot chemistry. The scenes where the two are together are the best in the book. The negative in this book is that the two need to be together more in the book. Instead, there is much setup of the plot that the romance suffers somewhat. There is a bit of instant-love in this book because the two don't have enough time together.But the moments the two are together are wonderful as they challenge one another as to what is happening in the plot and their individual hang-ups about relationships and marriage. This book ends up being about making the decision to trust despite the evidence that things can go very wrong.Ultimately, this is a solid book that I liked because of the connection between Daisy and Bishop. It wasn't as angst-filled as other Heath romances, and I missed that aspect, but it was enjoyable.WORTH MENTIONING: I loved the Easter eggs of characters that appear from prior Lorraine Heath books.CONNECTED BOOKS: THE COUNTERFEIT SCOUNDREL is the first book in The Chessmen: Masters of Seduction series. However, the first Chessman is King, the hero of THE DUCHESS HUNT. It is unnecessary to read that book first, but I recommend it because it introduces the group of men about which this series is about.STAR RATING: I give this book four stars.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3RNHWGNVQ6FK6HUPBHNQHUDZ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGCOT7M0GD17I?ASIN=B0B2RPBHNN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 8, 2023",
                "reviewTitle": "5.0 out of 5 stars A great read",
                "reviewText": "I enjoyed reading about Bishop and Daisy, how they met to how they fell in love. He was a man who didn't care for men who abused their wives so he helped them get divorces. She was a female investigator and she was hired by one of the husbands to find out if his wife was being unfaithful, they felt an attraction for each other. There were a few areas that were very emotional and scary. I highly recommend this book! 👍👍👍👍👍❤❤❤❤❤",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Valerie A Kader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIDFCYXJKM3TAYIMFJKWFWMEBQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IFQTX4KDYTII?ASIN=B0B2RPBHNN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 3, 2023",
                "reviewTitle": "3.0 out of 5 stars Didn’t Connect",
                "reviewText": "I love historical romances! I’ve read many of this author’s books and liked them, even loved some. This book had an intriguing premise - spinster detective goes undercover as chambermaid in order to prove marital infidelity. The heroine, Marguerite/Daisy, was compelling - pretty, clever, and loyal. The hero, Bishop, was also compelling - handsome, aristocratic, and compassionate, if a bit scarred. Their chemistry seemed a forced. The storyline was fairly predictable. Overall, not a bad book, but didn’t connect for me.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deborah A Carter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6U76LZRKG4S7MACFG5IQYMS55A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CKSOTIVOB4CD?ASIN=B0B2RPBHNN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2023",
                "reviewTitle": "5.0 out of 5 stars What a man!!!",
                "reviewText": "He listened. He watched. He truly cared for women. He did his best to help those in need of help. Daisy was ver deserving of her Bishop. Glad for their happy ever after.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lady with a Quill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGGYQS7YYLSHGMFD7UJ4UH5ED6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W7BU9N4VFQQD?ASIN=B0B2RPBHNN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Cinnamon Roll and Lady Sleuth",
                "reviewText": "Lorraine Heath never fails to bring unique characters to her stories and a plot that keeps me on the edge of my seat. I was really excited to see that the heroine is a lady sleuth in this story, as I love a good mystery and ferreting out the truth. Strong, independent women in historical romance always resonate well with me, and then when you add in a hero who appears like a lothario but is really a cinnamon roll? Yes, please, may I have some more? The story did begin a little slowly for me, but as their encounters grew more frequent and the tension increased, I was quickly drawn in. In this romance, the hero falls first, which just made the tension heighten even more. Him, desperately trying to contain his lust for the heroine, and her, trying to focus on work but getting distracted by his muscles. I get it, girl. I do.Society thinks David Blackwood is a womanizer, out to seduce married women away from their husbands, and he appears quite successful at it. Having no intention of ever marrying, and wishing to keep up the image to continue his real purpose, he's never made any move to change this reputation. Until Marguerite Townsend. Marguerite enters his household as a maid, one who doesn't hesitate to speak plainly with him and seems to seek him out at every opportunity. He's instantly on guard, in case she discovers his secret - he isn't seducing women in truth but rather faking it, to save them from abusive husbands by forcing a divorce over infidelity. Unbeknownst to David, Marguerite was hired by one of those men to determine if his wife was having an affair, and she is instantly confused by what she sees. Something is going on...but not necessarily what it seems. When one of the women's husbands is murdered, and he is the prime suspect, it's time for Marguerite to change roles from maid to detective, to save the man who may be capturing her heart.David was such a sweetheart, I instantly adored his character. His clever way of keeping women safe had him instantly endeared to me, and then when it was coupled by his obvious muscular physique, I swear, my ovaries suddenly woke up and my body was asking if babies would be forthcoming. I'm not kidding - this man seemed to be every woman's dream...except for the fact that he was quite stubbornly opposed to getting into a serious relationship with anyone. Marguerite tested his resolve at every turn, and when they finally came together, it was hot, and the connection was intense. I could see how meant for each other they were, and it was sad to see how much they had to keep their relationship in the dark. Marguerite had never been in a relationship of any kind, so to be with a man like David was intimidating. But if she was going to have her first time with anyone, he is who she wanted. Someone who would be attentive, keep her safe and not ask for anything in the morning. Of course, her desire soon grew beyond midnight visits, and that's when things became tough. It was really clear they both felt strongly for each other, but David wanted to continue helping women, which mean still maintaining his reputation. A reputation that had no room for a steady woman like Marguerite. It had me torn, but I felt for Marguerite - I wouldn't want to deal with that either, always being kept in the shadows. Their relationship certainly wasn't smooth sailing, but oh, the journey to the ending they received was well worth it.As always, I love Lorraine Heath's writing. Definitely a hero to remember and a romance that will have me thinking of it fondly.**I received a free copy via NetGalley and this is my honest review.**",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SharHop3",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYJ6AEWPX3GSWWYUAFO3YHEZJ4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AO8LTE51YC2I?ASIN=B0B2RPBHNN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Enjoyable!",
                "reviewText": "I loved Daisy/Marguerite. It's a wonder that woman during Victoria's time were so strongminded and aggressive. It reminded me of PBS's Miss Scarlet and the Duke.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MSG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPB4LRBVQY4Y6NUCILQLC66F7KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33BWO4RCDPHG8?ASIN=B0B2RPBHNN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Of Chocolates and Daisies!",
                "reviewText": "Definitely 5 stars (IMHO). The story of Bishop & Daisy/Marguerite sizzled from the start. This book has all the elements that would keep the reader up until the wee hours of the morning—-glorious romance (not to mention chocolates😉), mystery, a tear-jerker (for Aunt Charlotte) and of course, HEA….Ms Heath has me hooked once again with her prose (it’s been ho-hum since Beauty Tempts the Beast)…❤️",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JackyC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 16, 2023",
                "reviewTitle": "Delightful surprise",
                "reviewText": "I've been looking for new authors to read and have found one with Lorraine Heath. A romance mixed with intrigue. Thank you Ms Heath for a thoroughly enjoyable read. Can't wait to lose myself in the rest of the Chessmen series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ChaCha Koco ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 27, 2023",
                "reviewTitle": "Disappointing",
                "reviewText": "Ms Heath is one of my favourite authors and I was looking forward to enjoying a new HR but this was disappointing. It was almost like she ran out of ideas and storyline’s of what to write and was forcing her way through this. It lacked the connection between the two leads and at times, I felt it was all over the place and I didn’t get to know the characters as well as some of her other books. Ms Heath has done much much better than this. Not one of her best.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}