{
    "remaining_requests": 927,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Highland-Treasure-Brides-Lynsay-Sands-ebook/dp/B087QHPKH4",
    "body": {
        "name": "Highland Treasure: Highland Brides",
        "price": "$7.99",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Highland-Treasure-Brides-Lynsay-Sands-ebook/dp/B087QHPKH4",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81qkoqRoNjL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lynsay Sands",
            "link": "https://www.amazon.com/Lynsay-Sands/e/B001H6N4AE/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2866,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B087QHPKH4"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Avon (January 26, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 26, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4044 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 359 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0062855409"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#135,735 in Kindle Store (See Top 100 in Kindle Store) #127 in British & Irish Humor & Satire #233 in Scottish Highlanders Historical Romance eBooks #868 in Alpha Male Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 2,866 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Surrender to the Highlander The Highlander's Promise The Wrong Highlander Hunting for a Highlander Highland Treaure ✓ ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1717577f-5b19-46b8-8227-23bea140bb54.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/35757f50-5704-40fa-a714-8964b7762802.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df9b6e54-ca93-4eb7-88ba-b1230c68ad62.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cc8a5eca-9281-4154-baa8-6d9fe43b3277.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49d7f719-ff5e-48a2-81bd-067b94ea8753.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/330980fb-0cea-4f1e-bf12-20f503981299.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNKIVB7MNGCT5NJQ2LA5GO4QZWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C863V4FPTEBI?ASIN=B087QHPKH4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful",
                "reviewText": "The series is great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denise DeCrescito (From In Here)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQWBCNRWJ6PO42IH62H33VP3ZUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9EV3LIJAMNJQ?ASIN=B087QHPKH4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2021",
                "reviewTitle": "5.0 out of 5 stars Excellent characters, entertaining story leads to a wonderful conclusion",
                "reviewText": "“Highland Treasure” is book 9 in the Highland Brides series by Lynsay Sands. Don’t be concerned about the whole sequence though, because you definitely can enjoy this story as a stand-alone. If you’ve had the pleasure of reading others in the series, then like me you’ll enjoy seeing Rory Buchanon at last find the woman that is his perfect match.Rory is a highly respected healer, something that sets him apart from his warrior siblings. He has earned a lot of money plying his skills to the wealthy who beg him to travel to them – even though he helps for free those who cannot afford it. As he is departing from a high-paying client in England, he receives a note asking him to deliver a treasure to the Sinclair Clan in the Highlands. The note directs him to a location where he finds a brutalized Lady Elysande de Valance and 2 of her family’s soldiers. She has to deliver something vital to the Sinclairs, while eluding the vicious maniac who killed her father and all but 2 of his soldiers, slaughtered innocents, drove her mother to her death and committed other atrocities. There is a lot to this story that I don’t want to go into because I think it’s a lot more fun to discover it for yourself. I will tell you that there is mystery, intrigue, humor, betrayal, lust, danger and love.Elysande is fiercely determined to deliver the treasure entrusted to her. She is smart and resilient, honorable and brave. Rory comes from a wonderful, close-knit family, and even though he is not primarily a warrior like the rest of them, they wholeheartedly support his devotion to being the best healer he can possibly be. He’s never been attracted to a woman the way he is to Elysande and fortunately the feeling is mutual. This book was a page-turner for me and I couldn’t put it down until I got to the very end. The epilogue was particularly wonderful and funny.I do wish we found out what happened to Simon – when you read the book you’ll understand what I mean. I’m looking forward to seeing Alick Buchanan’s story, and in that hopefully getting an update about Elysande and Rory.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BarbMN",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCKBDUB27CYZCICMHDK5H6TUJTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R380QTNQXUNYU5?ASIN=B087QHPKH4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2021",
                "reviewTitle": "4.0 out of 5 stars Rory Meets His Perfect Match",
                "reviewText": "We finally get an HEA for Rory Buchanan, one of my favorite of the Buchanan brothers.Rory has been too busy healing to bother with a wife but he has met his perfect match in Lady Elysande de Valance.The story opens with Elysande in the dungeon, beaten badly by the men of de Buci, once a close family friend but now he has killed her father and soldiers and her mother has been maimed (and soon dies). Two loyal servants have rescued Elysande and sneak her out of the castle to two soldiers who had been away when the massacre occurred. They are tasked to deliver Elysande to Rory to guard her and take her to her family in Scotland.Rory has been in detestable England healing a wealthy nobleman and is anxious to go home to Scotland. He and his men accept the task of delivering Elysande to her family but soon discovers how badly injured she is and admires her bravery in traveling with barely a complaint. He vows to heal her but finds that Elysande has also been taught healing by her mother. Rory also learns that Elysande has a vital message to deliver and that she is being pursued by de Buci. The trip is fraught with danger and Elysande has several “accidents,” making Rory suspicious that they have a traitor in their traveling party. The person is finally discovered and all is saved.I have loved Rory throughout the previous books. He’s a gentle healer but, being a Buchanan, he has also trained as a soldier and can hold his own in battle. In Elysande, he has found someone who can be a true partner with her also being trained In healing. Admiration soon turns to love and their romance is sweet and intimate. I love the townspeople who rally to help them and having brother Alick along adds humor to the story. The only issue I had is that there seemed to be a chapter missing between the showdown with the traitor and the epilogue. Although the epilogue was a good one, I would have liked to see another chapter to finalize the story with action rather than jumping forward to the epilogue where the rest of the action is just explained after the fact. This drops the story down to a 4 rather than a 5 for me.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TracyJane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4XZXKYMBCASW7ESD2KPE2G7TQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19SOLQ9IP6EC6?ASIN=B087QHPKH4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2021",
                "reviewTitle": "5.0 out of 5 stars 4.5 stars rounded up",
                "reviewText": "When renowned healer Rory Buchanan receives a message begging him to take Mairghread de Valance’s “treasure” to her sister at the Sinclair holdings in Scotland, he cannot refuse, but he is not prepared when he learns that the treasure is actually her daughter.After being betrayed and nearly beaten to death by a family friend, Elysande de Valance of Kynardersley is drowning in pain and grief and not sure who to trust, but something about Rory touches something deep in her and gives her the courage to tell him all – including the plot by her attacker, Baron de Buci, to kill King Edward III.As they travel, a bond forms between them, and soon it becomes clear that de Buci isn’t done hunting Elysande and Rory will have to play a deep game of intrigue to keep the woman he has come to love safe!I really liked this book, it was a bit more intense than the typical Lynsay Sands book, but it was a very riveting read! Rory and Elysande are so perfect for each other and I just loved the fact that she is also a healer and how put-out he was about it – that small detail and his reaction added some much-needed lightness to the book and save the story from being too grim. The heat level of this book was not quite at warm as the previous books, but it was just right for the story. This book has a bit of everything: intrigue, betrayal, murder, warm love scenes, a bit of lightness, another shocking betrayal, and finally a HEA complete with a fantastic epilogue. The book did have title errors and I did feel like the fate of one of the villains was left unanswered, but overall neither of these things impeded my enjoyment and I would happily recommend this book. This is the ninth book in the series, but can easily be read as a standalone title with no problems!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 19, 2022",
                "reviewTitle": "Couldn’t put the book down",
                "reviewText": "I like going back in that era The book is good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Heron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 5, 2021",
                "reviewTitle": "It’s Rory’s turn to find love.",
                "reviewText": "Rory Buchanan is in England—— not a place he enjoys being but the coin he was offered to heal an English lord was too much to say no to———- on the day he is to leave and head home to Scotland he receives a message, Sinclair’s aunt has sent her”treasure” to him. She wants it to be taken to Sinclair in Scotland and for him to ensure it gets there. All well and good, but Rory comes to find the treasure is actually an English Lady, fleeing for her life from an English nobleman who invaded her fathers castle killing him and all his soldiers before badly beating Elysande and her mother almost to death. De Busi believes Elysandes parents to be in possession of something which he will murder for. Rory has no choice he must find a way to keep Elysande safe from DeBusi and get her to Scotland as quickly as possible. What he does not expect are the feeling the Lady inspires in him, beaten half to death with her face a mass of bruises Elysande is still the most beautiful woman he’s ever seen. The Buchanan’s are a fine family and it’s been a great pleasure to see each sibling find their one true love, I will be sorry to see the series end, I think there’s only the youngest brother Alick’s tale left to tell.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 15, 2021",
                "reviewTitle": "Must read",
                "reviewText": "The highlander series is amazing! I love this book! Lindsay Sands has a way of making you not want to put her books down, you want to know what happens next. Not to mention how affordable her books are! I pre ordered it and was happily surprised how fast I got it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JUDEJUDE",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 3, 2022",
                "reviewTitle": "Love these books",
                "reviewText": "I love these books about these wonderful Buchanan brothers and sister and friends I now have all of them. And hope more will be written about them. Sadly when I ordered this book it was not with other items delivered but Amazon was good and ordered a second one to be delivered sadly it was a little damaged on the corner, I look after my books so it was a little sad to see the corner bent down. These books are really good I loved them on kindle and now in paperback. You really will enjoy each book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715T8rOueZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71A4OgPzpIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charlii",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 22, 2021",
                "reviewTitle": "One more to go",
                "reviewText": "Well with Rory now wedded and bedded, we have the younger Buchanan left.The story of Rory and his love was heartwarming and joy to read.Lynsay done it again. I can't wait for Alick's story.I thoroughly enjoy reading Lindsay Sands.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}