{
    "remaining_requests": 990,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/China-The-Novel/dp/B08GSW2Q84",
    "body": {
        "name": "China: The Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/China-The-Novel/dp/B08GSW2Q84",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51u2KSA00sS.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Edward Rutherfurd",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Edward+Rutherfurd"
        },
        "brand": "Edward Rutherfurd",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 5532,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The “unparalleled master of the historical saga\" (Newsweek) and internationally best-selling author of Paris and New York takes on an exhilarating new world with his trademark epic style in China: The Novel.Edward Rutherfurd has enthralled millions of people with his grand, sweeping historical sagas that tell the history of a famous place over multiple generations. Now, in China: The Novel, Rutherfurd takes listeners into the rich and fascinating milieu of the Middle Kingdom.The story begins in 1839, at the dawn of the First Opium War, and follows Chinese history through Mao's Cultural Revolution and up to the present day. Rutherfurd chronicles the rising and falling fortunes of members of Chinese, British, and American families, as they negotiate the tides of history. Along the way, in his signature style, Rutherfurd provides a deeply researched portrait of Chinese history and society, its ancient traditions and great upheavals, and China's emergence as a rising global power. As always, we are treated to romance and adventure, heroines and scoundrels, grinding struggle and incredible fortunes.China: The Novel brings to life the rich terrain of this vast and constantly evolving country. From Shanghai to Nanking to the Great Wall, Rutherfurd chronicles the turbulent rise and fall of empires as the colonial West meets the opulent and complex East in a dramatic struggle between cultures and people.Extraordinarily researched and majestically told, Edward Rutherfurd paints a thrilling portrait of one of the most singular and remarkable countries in the world. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10177"
            },
            {
                "name": "Cultural Heritage",
                "link": "https://www.amazon.com/Cultural-Heritage-Fiction/b/ref=dp_bc_aui_C_5?ie=UTF8&node=8946929011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "34 hours and 49 minutes"
            },
            {
                "name": "Author",
                "value": "Edward Rutherfurd"
            },
            {
                "name": "Narrator",
                "value": "Daniel York Loh, Zheng Xi Yong, Andrew Wincott"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 11, 2021"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08GSW2Q84"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,759 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #166 in Fiction Sagas #201 in World Literature (Audible Books & Originals) #231 in Cultural Heritage Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Clem",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG27XJS57LHUB3IX53KUSL3YPCNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYV69RN5NF1XQ?ASIN=B08GSW2Q84",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2023",
                "reviewTitle": "5.0 out of 5 stars One of his best. Would love a \"Part 2\"",
                "reviewText": "Rutherford’s latest (as of now) and, in my opinion, his best. I’ve written extensive reviews of all of Rutherford’s novels online and I like to think sometimes that he just might be reading them. Not realistic, of course, but I find it refreshing that the advice I’ve “offered” him, he’s actually listened and implemented; in this novel at least.Rutherford writes about places, and the people who live in those places. Some of his books have been titled Russia, London, Paris, and New York. His objective is to tell a story, or stories that also educate his readers on the history of the particular location. This can be rewarding but it can also be a hindrance if not done carefully. It’s hard to tell a compelling tale that takes place over 700 years or so. Often, we read of events that have historical significance of the particular place, with the characters rooted in the middle of said events. In order to tell such lengthy history, a lot of time periods are skipped, and so we never get to really know our characters that well. We’ll read about a young couple, for instance, and just as we’re getting to know them, we have to be jarred into the next section of the book that takes place 50 years later, and the young couple (if even still alive) are now in their waning years. We then have to assimilate their offspring, and just as we get to know them, the cycle begins anew.Rutherford is also guilty of pushing too much history and not enough story. Often, he’ll have two of his characters, say, at the dinner table, and one of the characters is telling the other one about the last half-century or so of history of the locale over brandy and biscuits. This really serves no purpose other than to ensure the reader has a better understanding of the place and time. Not necessarily a bad thing, but not something that many readers want to dig through when reading a “novel”.The good news is that “China” has very little of this. In fact, the entire story takes place over about a 70-year period. So, no, we’re not really reading that much about the entire history of the country, but my guess is Edward Rutherford realized he could effectively write a novel that “takes place” during an important part of China’s history and still succeed. He does so mightily. In fact, I would argue that he could feasibly write a “part 2” to this tale (he did so only once, when writing about Ireland). There’s an awful lot more story to tell about China.This book covers roughly the years of about 1830 – 1905. This was during the last dynasty (The Qing Dynasty) of China before the country became modern or westernized (or whatever). We read about several different characters and several different plotlines, yet they’re all tied together in some form or fashion. The overall theme of the book seems to be around the time England began selling Opium to China, which many would argue caused the downfall of the mighty empire. In fact, our main character is one of the English captains, and we follow his story throughout the entirety of the novel.We read about many indigenous people as well, Even though many would argue that the opium trade wrecked the country, when one looks at this place with Western eyes, we learn that this country was far from kind and or philanthropic towards its subjects. There were few that lived in power and luxury and the masses were subjugated to be peasants for life. When a servant to one of the emperor’s concubines is working on her mistress’ nails and accidentally cracks one of her fingernails, the poor soul is flogged to death.We also read about the cruelness of feet binding of women (ouch) and castration of men (triple ouch) in rather explicit detail. In case you’re wondering, the former is to make women more attractive to rich and powerful men. The latter is done since only eunuchs may serve in the emperor’s palace, since it would be a tragedy if any of the emperor’s harem of concubines were to become….well…disturbed.We read about a lot of other cultural practices and behaviors as well, and the reader finishes the novel wanting to learn more about the history and geography of the place. Rutherford succeeds very well if that was, in fact, his goal. There are a few real people woven into this tale as is common for this sort of work. The most notable is the Empress Dowager Cixi, a concubine of one of the less effective latter emperors who many say actually ran the empire until her death immediately preceding the end of the Qing dynasty.So if someone is wanting to learn anything about mid to late 20th century China, they should be warned that there is absolutely nothing here. Again, I wouldn’t be disappointed in a part 2 if Rutherford chose to continue his story. Although to be honest, there were many very dark moments for China from the rape of Nanking to the reign of Mao Tse Tung, that I imagine writing any kind of appealing story during this time in history might be too dark a task.If so, no great loss. This novel was a wonderful experience despite the fact that there is actually very little of the history of China told here.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Helms",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRZN6SAN62QVTVXIRKG6OML4YRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R194K446483HA2?ASIN=B08GSW2Q84",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Not Your Usual Rutherfurd Novel",
                "reviewText": "Edward Rutherfurd's latest historical epic may not be as sweeping and multigenerational as his earlier works, but it's still an engrossing read. Rutherfurd usually delights in following families across centuries--frequently many centuries--of the history of a specific locale (Paris, New York, London, etc). In CHINA, he instead zeroes in on a single period of Chinese history, the roughly seventy year decline of the Qing Dynasty from the Opium Wars to the fall of the last emperor Puyi. He otherwise employs his favorite plot devices, including interweaving family lines, contrast between tradition and modernity, and the cyclical rise and fall of cultures. If there is a weakness in his narrative it would be that, as he did with RUSSKA, Rutherfurd does tend to take a western-centrist perspective, with the native populations of both title countries portrayed as smugly ignorant and overconfident in their isolation that they can easily push back against any European invasion. CHINA is a novel about the clash of cultures more than a sweeping history of the various dynasties and evolution of the Chinese society from Confucianism to Communism. One might expect the latter if they have read his previous works, but his microcosmic examination of the truncated period of China's imperial fall is still an engrossing and entertaining read. Well worth picking it up. Recommended, if you can put your expectations aside.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6WU7GEIHD6N3KUDHLVO47DAGKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DPPJCG51SE57?ASIN=B08GSW2Q84",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Factual history given",
                "reviewText": "Edward Rutherford has never let me down. Epic novels with researched history, therefore; giving entertainment and education. He has the acumen to keep one enjoying every page. I have read, London, Sarum, The Forest and after this I am sure I will read Ruuska. Hope he is working on a new one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BNell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSPA4LXPVB4G7YNIMNFRJRNJFGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R71I8OM7UTEGZ?ASIN=B08GSW2Q84",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars China: The Novel. Great Informative",
                "reviewText": "So much history! Great book, loved the characters, generations, flow of story. Realistic view of colonization of world, not sugar coated history version.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H. Glen Rowe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZSOAY7DBNE24HG3JROH5FQZFPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SROB5UFU4410?ASIN=B08GSW2Q84",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Fascinating Read; Difficult to Put Down",
                "reviewText": "I didn’t know much at all about Chinese history. Rutherford’s excellent characters bring alive the fascinating events of this momentous period of history.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5Q2ORYRLE7P6ZXFP36BGJXHXLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11MYPVZLBKIUD?ASIN=B08GSW2Q84",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "4.0 out of 5 stars Different",
                "reviewText": "This story is such a departure from Rutherfurd's other books. I loved the others and was looking forward to this. The writing, characters and content were as usual, but instead of creating a history of the big moments in Chinese history, we only got a small slice covering the Boxer Rebellion and the Opium War. I did get immersed in the story and even did a deeper dive on some of the characters, but overall all, I think I wanted more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suetonius",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNDOH4S5IRABBIFGTUOQAJENJBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22ZO4Y5DSUF50?ASIN=B08GSW2Q84",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "3.0 out of 5 stars Small and faded out font",
                "reviewText": "Good book but small font that’s also faded instead of bold. Hard on the eyes. Paperback version.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ILyktucher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETZW5BZ57ZXAZPYTQ6VXKNHSKPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3S0SI4ABSEE9C?ASIN=B08GSW2Q84",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Book arrived in like new condition! So pleased with the item and service. Thank you.",
                "reviewText": "I was very happy with the prompt service, the condition of the book and the book itself is great, too! So glad I purchased it from this seller. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pedro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 13, 2023",
                "reviewTitle": "Easy reading",
                "reviewText": "learned about Chinese history in an enjoyable tale",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noreen Vanderput",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 15, 2022",
                "reviewTitle": "Muito bom",
                "reviewText": "Ver avaliação de outros livros em inglês",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anthony Reynolds",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 6, 2023",
                "reviewTitle": "Darn good read",
                "reviewText": "Like all mr Rutherfords books knowledgeable and professional writing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RAK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 23, 2023",
                "reviewTitle": "A must read on Chinese history",
                "reviewText": "One of the best books I have ever read. A history novel on 19th century China. A good mix of family stories, all day culture, lifestyle and politics. From the opium war to the death of Cixi, who reigned China longer than Queen Victoria did in the UK. Thrilling and entertaining, good to read, even for a German like me.Reading about the colonial powers ruling and exploiting 19th century China helps to better understand China today, growing to old greatness. I enjoyed reading this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Norman Clark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 13, 2022",
                "reviewTitle": "the hidden depths of China by a Master novellist/historian",
                "reviewText": "What better time to read this marvellous book? What made China? What makes it tick? What are Chinese values? Read and learn, and enjoy the whole process.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}