{
    "remaining_requests": 882,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Improper-Proposal-novel-Front-Brides-ebook/dp/B071HZ4XZ7",
    "body": {
        "name": "An Improper Proposal: Front Range Brides - Book 1",
        "price": "$4.99",
        "originalPrice": "",
        "rawPrice": 4.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Improper-Proposal-novel-Front-Brides-ebook/dp/B071HZ4XZ7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71NBMNz0+pL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Davalynn Spencer",
            "link": "https://www.amazon.com/Davalynn-Spencer/e/B002EZUEZK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1083,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Sweet Historical Western RomanceAn Improper Proposal – First in the Front Range Brides collection of stories about strong women who find and defend love in 1880s Colorado.**A standalone Western romance!**Love hadn’t brought her to Colorado, but it might be the one thing that keeps her there.Mail order bride Mae Ann Remington won’t let circumstances get in her way. When someone else’s greed costs her everything—including her groom—she does the only thing she can in a new town with no money or friends. She asks a stranger to marry her. Cattleman Cade Parker stops at the bank to withdraw cash for his sister, not find himself a wife. But that’s exactly what happens after a bank robbery leaves a farmer dead and his headstrong bride-to-be making a desperate business proposition. Convinced he’s gone loco, Cade accepts the spirited young woman’s offer, and they stop by the church before heading to the ranch, his horses, and the herd. He’s soon adding to Mae Ann’s fine cooking skills by teaching her to ride, shoot, and do what he tells her. She manages the first two fairly well, but gets her back up at the third. Cade struggles to keep his emotional distance from the stubborn gal whose gentle ways start drawing him in. But when a greedy neighbor challenges Mae Ann’s inheritance of her former intended’s run-down farm, Cade and Mae Ann drive to court at the county seat and into the jaws of a deadly storm. Not only must Cade fight to keep his new bride safe, he’s got to keep his heart from stampeding out of control. Taking on snakes, scoundrels, and second chances is one thing, but falling in love wasn’t part of the deal. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158280011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B071HZ4XZ7"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ storyDspencer (June 1, 2017)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 1, 2017"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1075 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 294 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#337,702 in Kindle Store (See Top 100 in Kindle Store) #1,418 in Christian Historical Fiction (Kindle Store) #1,645 in Religious Historical Fiction (Kindle Store) #2,128 in Christian Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,083 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/a05f14c5-d180-44c4-885d-eb400a508351.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/031a68ce-e228-4031-878c-1921b056d33e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/afe5bf1c-c9c6-454f-9fe7-655e306e90da.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tracey~book corner fan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIZVDJJYFPLLRVHCHVT733SAT5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMYQD8KNIJDBR?ASIN=B071HZ4XZ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2017",
                "reviewTitle": "5.0 out of 5 stars An Improper Proposal~proper by the time all is said and done~very enjoyable read!",
                "reviewText": "This is my first Davalynn Spencer book and I loved it. I was initially drawn to the cover and it's intriguing title. I read the sample chapters and found I wanted to know what was going to happen between Cade and Mae Ann. Mae Ann's a mail order bride who never makes it to the altar and offers herself to Cade as a wife. One who will cook, clean, garden and do his laundry. Cade agrees, but isn't really sure why he does, he's sworn off women after the last one broke his heart. They are married, but in name only. Yet there is an attraction there and I really enjoyed watching it play out. Deacon was a terrific secondary character that really had me laughing. I loved his cowboy rendition of Psalm 23, I smile every time I think about it:\"The Lord is my shepherd. I shall not want.He beds me down in green pastures with sweet water.He leads me on a good trail and stays with me in the tight places.And the Lord's spread will be my home forever. Amen.\"This is a wonderful, witty, western love story full of charm and appeal. It's book one in the Front Range Brides series, I'll be on the lookout for book two and hope I get a glimpse of Cade and Mae Ann down the road. I also happened to notice more of Spencer's wit at work in her publishing company's name, storyDspencer, very clever Davalynn!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEACS4MYNSDMLOYQA6VVDJ7XANSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8YKD7F0AE07X?ASIN=B071HZ4XZ7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2020",
                "reviewTitle": "4.0 out of 5 stars Recommended for Lover’s of The Old West",
                "reviewText": "I enjoyed the characters of this book. I believe it to be a true depiction of the way many looked at every day life. Basically, not much information was Available about how to improve communication between you and those in your life. Yet, life continued with powerful loyalty and commitment. You learned to count on those around you to survive. Commitment and love prevailed.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R H Spokane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4YHAOEQR7H6H5NRDZ2RAIXXJLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU1AF7O61VVLQ?ASIN=B071HZ4XZ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2017",
                "reviewTitle": "5.0 out of 5 stars One of the best historical romances I've ever read!",
                "reviewText": "This author is new to me, but after having read this book, I'm about to make it my mission to track down and read every book she's ever written! This is a story about a young woman alone in the world who sets out to marry someone she's only corresponded with. When she arrives, instead of going directly to the church where the pastor was waiting, her fiance asks that they stop at the bank to complete an errand first. While there, the bank is robbed and her fiance is shot and killed. In the aftermath, a kind rancher, who was also in the bank when it was robbed, helps arrange to get her fiance's body to the undertaker and then asks her if there was anything else he could do to help her. Still very much in shock and unsure of what was to become of her now, she looks up at the rancher and asks him, \"You wouldn't happen to need a wife, would you?\". And that's when her adventure really starts. Mae Ann and Cade begin their life together with the usual misunderstandings as any new couple, but with the added burden of being strangers, not knowing what to expect or what was expected. Heart rending with glimpses of the humorous moments encountered in blossoming relationships, this book truly touched my heart. My only regret was that it ended too soon!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gatorfrog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHT3DLUKZVLIAS4QRRI2ZJJH7IFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U3JVVE3NLQ6V?ASIN=B071HZ4XZ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2018",
                "reviewTitle": "5.0 out of 5 stars Mail order bride meets handsome rancher, fun and intrigue follow!",
                "reviewText": "An Improper Proposal, just the title alone grasps your attention, so I had to read the book. It is my first read of a Davalynn Spencer book but it will not be my last. I was captivated from the start to the finish. It is set in the late 1800's in Colorado and features a cowboy/rancher. Not much else needs to be said in my opinion. However, I will continue. Mae Ann Remington is a mail order bride who finds herself without a husband when she gets to Colorado. In desperation, she turns to a complete stranger, Cade Parker, and asks him to marry her. He is flustered at first and doesn't want to marry her (he had been hurt before) but he is a gentleman who feels something for her, so he agrees. They are married in name only, and head off to his ranch. He has a ranch hand named Deacon, who is a wonderful side character, you will love him. She starts cooking, cleaning, gardening, learns to ride and shoot and along the way, with criminals involved and shady things going on, Mae Ann and Cade fall in love. But it is so subtle and endearing, you will love it. I also love the Christian aspect of the book which is part of the characters and is very well done. Ms. Spencer has a new fan for life!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shanti",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTTMSG3WEY2O3NQURZNZYR3KYUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27J227TEFOKUL?ASIN=B071HZ4XZ7",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 22, 2021",
                "reviewTitle": "3.0 out of 5 stars Christian Romance",
                "reviewText": "I wish it were stated more clearly that this is a Christian romance. The story wasn't bad but all the references to God start getting a bit heavy handed at one point and made me less interested to continue with the book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnnE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVIDEJSTEIYRV6M5IQNWFW4MYOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R547X3FEWTAK4?ASIN=B071HZ4XZ7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2017",
                "reviewTitle": "4.0 out of 5 stars Sweet Romance",
                "reviewText": "She offers to be his wife as a business agreement, and if he's not pleased with her, she will go away. In the meantime, someone wants her land and someone is stealing his cattle. In the midst of all this, she tries to create a home that she longs to have and he must decide if he will risk his heart again.This is a well-written and sweet story. There is good character development. The ending is satisfying.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindy Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQFVLGOC2WM4NXH37WGYI2D7RJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KAURGTXQH30Y?ASIN=B071HZ4XZ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2017",
                "reviewTitle": "5.0 out of 5 stars Bank robbery, murder, mayhem and a wedding to start a new life for Mae Ann.",
                "reviewText": "Mae Ann Remington answers farmer Henry Reyker's ad for a bride. When she arrives, Henry wants to stop at the bank before going to the preacher. Big mistake, as a robbery takes place and Henry is killed while trying to protect Mae Ann's mother's brooch from the robbers. Left all alone in a strange town, penniless with no one she knows Mae Ann is in shock. A tall cowboy helps her get Henry to the barber/undertaker, and she asks him if he has a wife. When Cade Parker says \"no\", she asks him if he would like one. Shocked by her question, he says \"no\". When she looks so pitiful, he relents and takes her to the preacher and they wed. It is a business arrangement. She will cook, clean and help on his ranch,, and he will protect her. Henry's farm is wanted by Cade, and a sinister McGrath who will stop at nothing to get what he wants. The rest of the story is too good to impart, so please buy and read this wonderful tale of too stubborn people, an evil-intentioned neighbor, two robbers/murderers on the loose, a Crusty old cowhand named Deacon, and animals who play a part in this story of the old West.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denise Toon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 16, 2017",
                "reviewTitle": "Wonderful",
                "reviewText": "What a beautifully written novel. I loved the gentle characters and the storyline and the wonderful ending. Anyone one loves reading about mail order brides will enjoy this novel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}