{
    "remaining_requests": 997,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Demon-Copperhead-A-Novel/dp/B09QH6C42C",
    "body": {
        "name": "Demon Copperhead: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Demon-Copperhead-A-Novel/dp/B09QH6C42C",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61FWMT3bLiL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Barbara Kingsolver",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Barbara+Kingsolver&search-alias=audible"
        },
        "brand": "Barbara Kingsolver&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 92045,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "WINNER OF THE 2023 PULITZER PRIZE WINNER OF THE WOMEN'S PRIZE FOR FICTIONA New York Times \"Ten Best Books of 2022\" An Oprah’s Book Club Selection An Instant New York Times Bestseller An Instant Wall Street Journal Bestseller A #1 Washington Post Bestseller\"Demon is a voice for the ages—akin to Huck Finn or Holden Caulfield—only even more resilient.” —Beth Macy, author of Dopesick\"May be the best novel of 2022. . . . Equal parts hilarious and heartbreaking, this is the story of an irrepressible boy nobody wants, but readers will love.” (Ron Charles, Washington Post)From the acclaimed author of The Poisonwood Bible and The Bean Trees, a brilliant novel that enthralls, compels, and captures the heart as it evokes a young hero’s unforgettable journey to maturitySet in the mountains of southern Appalachia, Demon Copperhead is the story of a boy born to a teenaged single mother in a single-wide trailer, with no assets beyond his dead father’s good looks and copper-colored hair, a caustic wit, and a fierce talent for survival. Relayed in his own unsparing voice, Demon braves the modern perils of foster care, child labor, derelict schools, athletic success, addiction, disastrous loves, and crushing losses. Through all of it, he reckons with his own invisibility in a popular culture where even the superheroes have abandoned rural people in favor of cities.Many generations ago, Charles Dickens wrote David Copperfield from his experience as a survivor of institutional poverty and its damages to children in his society. Those problems have yet to be solved in ours. Dickens is not a prerequisite for listeners of this novel, but he provided its inspiration. In transposing a Victorian epic novel to the contemporary American South, Barbara Kingsolver enlists Dickens’ anger and compassion, and above all, his faith in the transformative powers of a good story. Demon Copperhead speaks for a new generation of lost boys, and all those born into beautiful, cursed places they can’t imagine leaving behind. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Coming of Age",
                "link": "https://www.amazon.com/Coming-of-Age-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3558939011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "21 hours and 3 minutes"
            },
            {
                "name": "Author",
                "value": "Barbara Kingsolver"
            },
            {
                "name": "Narrator",
                "value": "Charlie Thurston"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "October 18, 2022"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09QH6C42C"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#43 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Small Town & Rural Fiction (Audible Books & Originals) #3 in Coming of Age Fiction (Audible Books & Originals) #3 in Small Town & Rural Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mark Stevens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYFCXNFRVL5ISYTH7AO2CZH4WZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B6XFX65BAJG4?ASIN=B09QH6C42C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Copperhead Road",
                "reviewText": "In an interview with Ezra Klein on his podcast, Barbara Kingsolver said she wanted to write “the great Appalachian novel.” She conceded, however, that the notion “probably sounds ridiculous.”In particular, Kingsolver said she wanted to write about the fact that the people who live in Appalachia “are the most resourceful Americans you’re probably going to find anywhere.” Kingsolver, who was raised in rural Kentucky and now lives in rural Virginia, said she wanted to explore the shame she had internalized from her choice of a place to live.“How many people well-meaning people have asked me, ‘how could I live there in the middle of nowhere?’” said Kingsolver. “People, this is my everywhere. This is my everything.”Later in the chat: “Everybody looks down on the country people and the country people sort of absorb that. You can’t help but absorb it. So when I set out to write my great Appalachian novel. I was paralyzed with self-doubt because, I mean, my starting point was that I wanted to write about the opioid epidemic, which is become a huge assault on our culture, our families, our communities. It’s devastated so many of the good things about this region that we value and that we love. And so I wanted to write about these kids who’ve been damaged and this place that’s been damaged, and it seemed like a really hopelessly sad story. Plus, it’s about people that I didn’t feel the outer world cared about. And so I just really, I spent a couple of years walking around and around this story, trying to figure out how to break into that house because I really felt sure nobody wants to read it.”Well, Kingsolver was wrong. At least, she was wrong about the interest in her topic—not her take on the people of Appalachia. Winner of the Pulitzer Prize for fiction and 85,000+ ratings on Amazon (4.6 stars).There’s so much to like about Demon Copperhead but one of the main things is that it’s so breezily readable. For a 546-page epic, it goes down fast. It’s episodic, a la Dickens, but the character flow is organic, unforced. Demon’s voice is engaging and his struggles are real, particularly when it comes to the challenges of the foster care system and the brutality of OxyContin addictions. Kingsolver’s empathy for addicts comes pouring out of the story. She is non-judgmental, plays it straight.Here is Demon, somewhat early on, looking back on the power of addiction: “I had roads to travel before I would know it’s not that simple, the dope versus the person you love. That a craving can ratchet itself up and up inside a body and a mind, at the same time that body’s strength for tolerating is favorite drug goes down and down. That the longer you’ve gone hurting between fixes, the higher the odds that you’ll reach too hard for the stars next time. That first big rush of relief could be your last. In the long run, that’s how I’ve come to picture Mom at the end: reaching as hard as her little body would stretch, trying to touch the blue sky, reaching for some peace.”That’s as good a passage about the feeling of addiction, and a description of its power, that I’ve ever read. (Kingsolver also read that section on Klein’s podcast.)Kingsolver is a deceiving writer. Her style is unassuming and keen-eyed. The text is full of specificity. And energy. If you have any doubts about tackling this book because it looks too heavy, squash those notions. Here’s the beginning of Chapter 34:“A lot of firsts that school year. First scrimmage, first JV game, first tackle, first passing yards made. First school dance, with an eighth-grader girl that was dead serious about it. So, my first real date, evidently. Angus and Sax went together dressed as Planet of the Apes, loser of their grade contest (Sax) being the human on a leash. This is Homecoming mind you, not Halloween, so. Not a date. But Angus took mine over, ordered the corsage from Walmart, took me to Goodwill where we found this dope white suit from the sixties. In my size, unbelievable. I’ve grown into my hands and feet by this point, and I’m pushing 6 feet. Thank you, Mattie Kate.”Mattie Kate is the housekeeper who worked for football Coach Wingate, where Demon lived while he was being developed as a potential football star. There are plenty of characters to keep track of, but Kingsolver gives them juicy nicknames (again, a la Dickens) or colorful descriptions so they are easy to track. U-Haul. Fast Forward. Waddles. Mouse. If you know David Copperfield (it’s been decades since I read it) you’ll have a great time with what Kingsolver did with her names. For instance, Uriah Heep becomes Ryan Pyles.The “resourcefulness” of Demon is apparent in his stubborn ability to survive. He’s smarter than he acknowledges, and very observant. In Demon Copperhead, bad things happen to bad people and bad things happen to good people, too. Many around Demon are not so fortunate and literally or metaphorically drown. You can’t help but think about the failure of our institutions around child welfare, the foster care system, adult welfare, and drug abuse. But Demon finds his talent, develops a passion, and puts it to use. Hello, the power of art. And love. Every great novel, and this is one, is a love story in the end.Demon Copperfield was written with passion for Kingsolver’s very personal reasons. The execution is a thing of beauty—and something we can all admire.",
                "reviewVotes": "56 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ga303",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGORQTLLJS24CFTO4KLBKROYYWHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EI553TB8I4J1?ASIN=B09QH6C42C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Easily one of the best books I read this year.",
                "reviewText": "\"Demon Copperhead\" kept and kept on appearing in my \"suggested for you\" on Kindle, and each time, I kept thinking \"Ugh, not so much, I just want something to read, but not sure if I really feel like turning on my thinking cap for Barbara Kingsolver.\" Finally, largely out of self-defense as I was so tired of seeing it, I caved and got the book. When I look back on all that I have read this year, or even over the past couple to few years, I can't imagine not having read it.This book has been called a creative retelling of \"David Copperfield.\" As to that, I will begin by saying not \"I was born,\" but something far more provocative: I don't like Dickens. Sorry, I don't, despite having taken (or possibly because of having taken) an entire Senior English Seminar on his works in college. In that semester-long class, I was exposed to most of everything he'd written, including \"David Copperfield,\" and did what I had to do to participate in classroom discussion and achieve a grade. Shortly after that, I largely forgot \"David Copperfield\" and its characters or situations, so I read \"Demon Copperhead\" cover-to-cover without recognizing the parallels. It wasn't until after I finished the book and took a quick trip to Wikipedia that I saw how creatively these were done, from plot events to character names, and was impressed. (And for those reviewers who have said this is \"plagiarism,\" no, a retelling of an existing story is not plagiarism.)Rather than Dickens' coal-choked, vice-ridden, poverty-stricken 19th century London, the setting has been transported here to Appalachian Virginia, more or less in the present day. The titular character's surroundings are beautifully done, as Kingsolver's descriptions always are, and the reader is immediately immersed in his life's adventures and misadventures, from young childhood to young adulthood.I found the narrative voice of his childhood to be particularly effective. A child's perceptions of his world, however intuitive, are often incorrect or entirely made up based on emotions such as love or fear. Child Demon's voice felt very believable to me (and many times was cause for a chuckle, a chuckle not being easy to come by in a story with as many dark themes as this one has). From there, it is interesting to read a gifted writer changing the narrative voice as the character gets older.As always, always, always (and my favorite attribute of Barbara Kingsolver's writing), the descriptions of nature are wonderful and meticulously detailed, especially as seen through the perception of a child. (In one example, the character Maggot is observed by Demon to be holding a tiny, tiny grasshopper, so small it seemed to have come from \"a planet of smaller things.\")In being with Demon from childhood into young adulthood, we see a character who goes from fearing Boogeymen which live largely in his imagination to confronting Boogeymen which are real -- in this case poverty, the flaws of the foster care system, the manipulation of the people of this region by big business and government, and the horrors of the opioid crisis.I came across a number of reviews from readers who felt the depiction of the latter was one-sided and had very strong opinions about it -- I'm not here to debate that -- or that the themes of the book were too heavy-handed. And granted, while many (self included) believe that some of Barbara's Kingsolver's books are too heavy-handed in terms of social or ecological agendas, I felt this was much more subtle in \"Demon Copperhead\" and did not find the themes overbearing at all -- possibly because the reader is experiencing things through the eyes of a very well-developed character, rather than through the words or actions of less-developed characters in some of her other books where characters feel like devices and not people.Some say Dickens beat readers over the head with themes, too. Much as he may not be my favorite writer, however, I feel that he did a good enough job of creating a world and characters that he didn't have to beat anyone over the head with anything. I feel Kingsolver has achieved that here, too. Understanding the ugliness of a society as perceived by a believable character -- and feeling sad, appalled, ashamed, what-have-you -- is not the same as being hit over the head by something.There's some dark, dark stuff here, so fair warning: readers who aren't prepared for that had best pick up another selection. And if this isn't your cup of tea, please do that rather than drag down reviews of this one with expressions of shock about the \"trash\" herein. Things like sex, death by OD, people shooting up, etc., are part of this story.As others have said, however, I am flabbergasted by the fact that Amazon's age suggestion for this book is \"ages 9 and up.\" While there may be 9-year-olds at a reading level sufficient to comprehend the words, this book is *not* kid stuff.While a 70% five-star rating is a suggestion of the widespread appreciation for \"Demon Copperhead,\" there are, as always, other percentages of readers who liked it less or even hated it (which is the beauty of the right to freely express an opinion, or to admit that something is simply not to one's taste).If I had a nickel for every review that said this was a horrible book or a suggestion that Kingsolver has fallen off her game and ended by saying \"Go read 'The Poisonwood Bible',\" I'd be a rich reader indeed.I'll end by saying I *did* \"go read 'The Poisonwood Bible'.\" (Twice, actually, well before reading this one.) And this reader liked \"Demon Copperhead\" way better.",
                "reviewVotes": "101 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter M. W. Robinson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 20, 2024",
                "reviewTitle": "Superlative. She is a wonderful writer and this is her best",
                "reviewText": "Where to start? Kingsolver is a well-brought up older white woman. But she gets right inside the head of a mixed-race boy from trailer-trash, and gives him a memorable and eloquent voice. It is amazing. Demon stands right up from the page and gets into your head. It hits the trifecta: Lee County, poor white culture in the Appalachian, soaks into every word: we see it all, hear it all, feel it all. And then it is America and its dreams, and then it is everyone. Along the way, is a concerto with Dickens providing the orchestra to Demon Copperhead's soloist. There are a few books that change lives. This is one of them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephany andrews",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 10, 2023",
                "reviewTitle": "Only received four chapters",
                "reviewText": "I want to finish reading but I only received four chapters on this device.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miss AE",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 30, 2024",
                "reviewTitle": "Best book in a long time",
                "reviewText": "This is the best book I've read in a very long time (and I read a lot!). The character of Demon will linger in my memory for a long time too, I walked with him every step of the way or at least that's how it felt. It's an immersive and mesmerising read. A heart breaking story yet it is written with wit and warmth. It's multi-layered with an insight into the realities of life in life in 'hick country' America and the opioid crisis. On every page of this book you can feel Demon's hope and desperation, his struggles to make to make sense of life and to make the 'right' decisions.In boyhood and growing into adulthood somehow the author manages to portray these stages so vividly and so beautifully. When I read the reviews I assumed it would not live up to the hype but it does and so much more.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ramy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 19, 2024",
                "reviewTitle": "Finest richest storytelling you can hope for",
                "reviewText": "This book is traditional storytelling at its finest. Dickens would be proud.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonella ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 13, 2024",
                "reviewTitle": "Libro",
                "reviewText": "Bello !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}