{
    "remaining_requests": 960,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-19th-Wife-David-Ebershoff-audiobook/dp/B001FVJIO2",
    "body": {
        "name": "The 19th Wife: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-19th-Wife-David-Ebershoff-audiobook/dp/B001FVJIO2",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/618UHD6bXuL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "David Ebershoff",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=David+Ebershoff"
        },
        "brand": "David Ebershoff",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 2657,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Faith, I tell them, is a mystery, elusive to many, and never easy to explain.Sweeping and lyrical, spellbinding and unforgettable, David Ebershoff’s The 19th Wife combines epic historical fiction with a modern murder mystery to create a brilliant novel of literary suspense.It is 1875, and Ann Eliza Young has recently separated from her powerful husband, Brigham Young, prophet and leader of the Mormon Church. Expelled and an outcast, Ann Eliza embarks on a crusade to end polygamy in the United States. A rich account of a family’s polygamous history is revealed, including how a young woman became a plural wife.Soon after Ann Eliza’s story begins, a second exquisite narrative unfolds - a tale of murder involving a polygamist family in present-day Utah. Jordan Scott, a young man who was thrown out of his fundamentalist sect years earlier, must reenter the world that cast him aside in order to discover the truth behind his father’s death.And as Ann Eliza’s narrative intertwines with that of Jordan’ s search, listeners are pulled deeper into the mysteries of love and faith. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b?ie=UTF8&node=10177"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "19 hours"
            },
            {
                "name": "Author",
                "value": "David Ebershoff"
            },
            {
                "name": "Narrator",
                "value": "Kimberly Farr, Rebecca Lowman, Arthur Morey"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 02, 2008"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B001FVJIO2"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#30,802 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #322 in Historical Mysteries (Audible Books & Originals) #1,188 in Literary Fiction (Audible Books & Originals) #1,373 in Historical Mystery"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "H. Collison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTUSR4QW7M2CIY6P6GQSZCNOURQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB9LRPVUDM84G?ASIN=B001FVJIO2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 18, 2013",
                "reviewTitle": "5.0 out of 5 stars A complex, yet enjoyable, novel",
                "reviewText": "For many years, I've had a fascination with novels, documentaries and biographies of polygamist wives. Why? Not because I want to experience this lifestye; I'm very satisfied in my marriage of monogamy. I'm fascinated because I want to know \"what makes these women tick\". I wonder: \"Why would they subject themselves to a life like this? Why would someone put up with such a primitive, stifling lifestyle? Why wouldn't they want freedom?\"This book truly delivered answers to my questions. For many of these women, this is the only life they have known: they were born into it. Not only does it deliver answers, it also delivers a certain amount of mystique... there's been a murder... and I definitely love the mystery of a murder. The narrator of the murder mystery(son of one of the sister wives, accused of murdering her husband) is edgy and truthful. He tells it like it is, whether you like it or not. He's street-wise and connected to both worlds: the world in which he grew up and the \"real\" world.Little by little, he weaves the profile of his mother: someone who didn't resist what she married into; someone who did as she was told; someone who was obedient, for the gain of her salvation. The narrator methodically pulls apart life in a polygamist family. He describes how the cult gets rid of the young boys, so that the old men can have the girls all to themselves. He also reveals the characteristics of the other sister wives, and their relationships with one another.The narrator knows that evidence of murder may be pointing right at his mother. He wants to help her, but he's not sure how. He doesn't want her to be executed, yet how can he save her?There are two \"threads\" of story-lines in this novel: the historical and the modern-day. The historical portrays the saga of Brigham Young and his sister wives, especially his 19th wife, who campaigned to end polygamy. Both of these threads are woven in such a way, that many \"why's\" were answered for me. Both of them drew me in, and held my interest. I wanted to jump into the story-lines of both threads, and rescue the women involved, plead with them to leave the lives they were in, and encourage them that there's a better life outside of their boundaries.I wanted to assure the ones who questioned their lives, to stay strong and leave this cult-life behind. All ran the risk of what would happen if they abandoned their \"faith\".While this novel was more complex than most that cover this subject, I was both challenged in keeping both story-lines straight and educated about a subject that I find fascinating. I also enjoyed following how the murder mystery was solved. I highly recommend this book.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "voracious reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNOA5Y77GVOVRBE4OSLHJQQ4R6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXZ6MND28ROL1?ASIN=B001FVJIO2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 2, 2013",
                "reviewTitle": "4.0 out of 5 stars A Modern Day Murder Mystery Woven With Its Historical Past",
                "reviewText": "The story opens with Jordan Scott, the excommunicated gay son of a modern day Mormon plural wife. She is number 19. When Jordan was 14 he dared to hold the hand of one of his similarly aged stepsisters. For this act he was expelled from the community. His mother and father left him on the side of a highway with $17 and nothing more. Jordan succeeded in making a life for himself in L.A. doing construction work and partnering with another gay young man. Now fast forward about 5 years. Jordan sees on TV that his mother is accused of murdering his father. In spite of the hard feelings he has in being abandoned at 14 with so few resources he is sure his mother is incapable of murder and he returns to Mesadale, the fundamentalist , polygamous Mormon town in which he was raised to defend her.The author David Ebershoff weaves this murder mystery in and out of the true history of another 19th wife, Brigham Young's rebellious spouse, Ann Eliza Young. He uses several narrators to tell her tale including reporters, a woman writing a master's thesis, her son, Lorenzo, and Ann Eliza Young herself. Ann Eliza was a beautiful actress living in Salt lake City. She married a man and had two children by him. He failed to support her and she divorced him. Brigham Young was smitten with her and using various means of financial control, he forced her to marry him. He was much older than Ann Eliza, and she did not want to be a plural wife. He mistreated her and she left him escaping the polygamous community under cover of darkness. She then crusades to end polygamy claiming the practice to be barbaric and harmful to wives and their children. She travels on a very successful speaking circuit which is how she supports her two young sons. Lorenzo, the youngest boy accompanies her. She has audiences with congress and president Grant and she accomplishes her goal of outlawing plural marriage in the U.S. and its territories. In 1875 she publishes a best selling memoir criticizing the Mormon sect and their polygamous customs. Brigham Young is furious with her, and he and the church minions are aghast that she would expose the church to ridicule.So we have the tale of an early 19th wife interwoven with the tale of a modern day 19th wife accused of murdering her polygamous spouse. These polygamous fundamentalist Mormon sects are really cults that have brain washed their members. We see the danger of cults such as this through the modern day murder mystery. Unlike other reviewers I found the historical fiction of Ann Eliza's life to be more interesting than the modern mystery story. I am not a fan of novels that alternate between different narrators and time periods. For that reason I downgraded this book to 4 stars. However, this author changed the narrator and the time period as seamlessly as possible. The changes were not nearly as annoying as they could have been. I did enjoy the book, and I could not put it down. I'd like to see a film version. I understand there is a Lifetime channel film of this novel. This review is for the kindle version.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Victoria",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2NFFBYHU3ESLZIT6PHC3GCNJGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CD2E2YBRWTEU?ASIN=B001FVJIO2",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2009",
                "reviewTitle": "3.0 out of 5 stars Disappointingly Boring",
                "reviewText": "In my own little mind I've always conceptualized Mormonism as the love child of the Pope and Ron L. Hubbard. You have these devoutly Christian followers with some pretty Sci-Fi beliefs. Throw in the polygamy factor and I am perversely fascinated. It's no surprise, then, that I was instantly drawn to The 19th Wife.Here we have dual story lines: The trials and tribulations of Brigham Young's infamous 19th Wife, Ann Eliza, partnered with the trials and tribulations of a 19th wife from a modern day polygamous cult accused of murdering her \"husband\". For all the research the author did in preparation for this novel (and it is obvious he did his homework) and with all the intrigue that currently surrounds these polygamist sects, the book truly fell short of the glory it could have been.Whereas the modern-day plot completely captivated me (Warren Jeffs meets Murder She Wrote) the fictitious excerpts from Ann Eliza's book, The 19th Wife, just blatantly dragged. One does get an education about the origins of Mormonism, the exodus of the Mormons to Salt Lake City, and the \"philosophy\" behind polygamy, but there is so much added fluff that the focus of the whole story gets bogged down. By the time the murderer in the modern day plot was revealed, I was so eager for the book to be over, I didn't even care.Overall this was a good book, but it could have been soooo much better.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yidda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 1, 2017",
                "reviewTitle": "Used book",
                "reviewText": "Das Buch war in gutem Zustand und allemal sein Geld wert. Es kam in relativ kurzer Zeit bei mir an. Zuverlaessiger book dealer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customgruyer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 12, 2016",
                "reviewTitle": "Vg read",
                "reviewText": "!vvg LPBunk room mum mnb nhytrnj mk my bf bf by it Tre Derby by gt free sees xdr",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sun",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 25, 2015",
                "reviewTitle": "The 19th Wife",
                "reviewText": "The book presents a dual perspective on the faith and lives of the Latter Day Saints. The story based on historical evidence is compelling, and offers a clear insight into the beliefs that condoned and promoted polygamy in the LDS community. The murder mystery set in the modern day weaves flawlesslly, paralleling the historical narrative.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 14, 2015",
                "reviewTitle": "Five Stars",
                "reviewText": "Fascinating from beginning to end! This novel wove together history, crime, mystery and religion into a genre bending masterpiece!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NicolaB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 14, 2009",
                "reviewTitle": "Another amazing insight into Pologamy",
                "reviewText": "Having read the amazing book \"Escape\" by Carolyn Jessop I have become extremely interested in Pologamy, the FLDS and how it does (or doesn't) work. To start off I wasn't sure how this book was going to work, as you are effectively reading two different books together.... But it does! One book gives you the life story of a woman and history of what I assume are the FLDS and how they split from the Mormon Church. The other giving you a more modern take from a male child born into Pologamy and be-coming a \"Lost Boy\" to solving the mystery of his mothers arrest. This is great, as its normally from the femail persepective you see the multiple marriages. It covers things like the f*ck charts (the books words not mine)which apparently all the household have, for the man to know whose turn it is next.... yes believe me, apparently every household have one!! to how not everyone wants more than one wife.To get into the book from the start takes a little patience, but bear with it and you will be greatly rewarded.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}