{
    "remaining_requests": 963,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Last-Man-Novel-Santa-Robbery/dp/B0C5TS1JJX",
    "body": {
        "name": "The Last Man: A Novel of the 1927 Santa Claus Bank Robbery",
        "price": "$16.99",
        "originalPrice": "",
        "rawPrice": 16.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Last-Man-Novel-Santa-Robbery/dp/B0C5TS1JJX",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ysyaLx12L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51dy7FnYv4L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Thomas Goodman",
            "link": "https://www.amazon.com/Thomas-Goodman/e/B0CC6YF6V9/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 100,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review The Last Man seizes the reader on page one and doesn't let go. Goodman has deftly brought his characters to life.... Smooth, engrossing, entertaining reading, from start to finish.\" (Lone Star Literary Life) \"Goodman writes crisp, confident prose, giving us a novel as compelling as the incredible true story it's based on. The Last Man blends thrilling, cinematic set pieces with convincing character work that explores the nature of crime and rehabilitation. Fans of historical fiction should list Goodman among their 'must-buy' authors.\" (James Wade, two-time Spur Award-winning author of Beasts of the Earth) \"Goodman's debut novel is a remarkable accomplishment. Through gripping action scenes and slow-burn character studies, Goodman delivers an authentic Texas story that will keep readers turning the pages. At its core, though, The Last Man is more than the tale of a botched heist. It is a haunting exploration of man's inherent brokenness and the longing for redemption and liberation.\" (Eileen Flynn, Austin American-Statesman staff writer and editor 2007-2020, and University of Texas adjunct journalism professor 2007-2019) \"If you're from Texas and a history buff, you may have heard about the Santa Claus Bank Robbery, but I guarantee you haven't heard the story told like this. Goodman mixes fact and fiction in an irresistible blend of storytelling and action that will have you turning pages until the very end. Do not miss this fabulous Texas tale!\" (Kathleen Y'Barbo, Publishers Weekly bestselling author of The Black Midnight and the Bayou Nouvelle series) \"Goodman's research and meticulous attention to detail places the reader at the scene of the robbery and the aftermath, including the court proceedings, jail, and prison life. Most important, though, is the saving transformation of 'the last man'—a success story that all correctional professionals like me hope for, strive for, pray for, and love to see.\" (David Stacks - Director of the Texas Prison Museum and Retired Warden of the Texas Department of Criminal Justice) About the Author Thomas Goodman first ran across the story of the Santa Claus Bank Robbery when he lived in the small Texas county where it all took place. He currently lives in Austin, where he has been able to conduct extensive research on the true crime at the Texas State Library and Archives Commission. The Last Man is his first novel."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 7 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"A novel as compelling as the incredible true story it's based on.\" James Wade, two-time Spur Award-winning author of Beasts of the Earth.When Santa Claus enters a Texas bank just before Christmas in 1927, no one expects him to pull a gun.The fake white beard hides his identity from his neighbors while he and three others take everything. But their easy heist goes sideways fast when armed lawmen and citizens assemble to claim a new reward for dead bank robbers.Taking hostages, the gang forces a path through a frenzied and bloody shootout, setting the whole Lone Star state on their trail.One bandit dies in the getaway. One is executed in the electric chair. One swings from a rope in a mob lynching. The last man finds a life he always hoped for … if only he can keep it.Closely based on a true story, The Last Man is a gritty Prohibition-era crime novel filled with flawed characters and second chances.\"Do not miss this fabulous Texas tale!” Kathleen Y’Barbo, Publishers Weekly bestselling author of The Black Midnight and the Bayou Nouvelle series.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C5TS1JJX"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Mainsail Media (August 28, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 308 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8987750803"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.77 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#453,886 in Books (See Top 100 in Books) #2,878 in Christian Mystery & Suspense #3,036 in 20th Century Historical Fiction (Books) #4,215 in Historical Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 100 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD2ZT7YK64CBPNYX6KJEP6P5ORQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A5L4W6NY4IF9?ASIN=B0C5TS1JJX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Captivating read",
                "reviewText": "I appreciated the forthrightness of the author’s view of the individuals in the book. No downplaying of what the robbers did, including Robert Hill. I saw this as a balanced representation of the people and the times. And the inherent goodness of those who are not quick to judge, but are open to the possibility of redemption.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janice Hanna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRJ7BPOFPYXTSTY7YDDG4UO4BJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ICGAES8CK87V?ASIN=B0C5TS1JJX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful heartfelt story",
                "reviewText": "The research into these characters and their individual stories is fascinating and charming. I am a voracious reader and I am choosy on what I read. I was drawn in immediately to the character’s lives and the development of the story. Highly recommend this !!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rls8803",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGIMVMHMD45NA4KIYKZEWDAAIQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A86M9KODAMRF?ASIN=B0C5TS1JJX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Very entertaining historical novel",
                "reviewText": "As a Santa portrayal artist I was drawn to this book because of the Santa Claus angle. I was unfamiliar with the events of the great Santa bank robbery, so as I read the book I did some research on the side. The author does a great job of storytelling, and is historically accurate in the tale. He does a great job in making the reader care about rather unsavory characters. I found myself at the end cheering and hoping for Bobby’s redemption. There is also a good afterword in which the author discusses what is fact, fiction, and supposition.I think this book is a fascinating story of a true incident in a small Texas town. Great read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vekas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJAB4343LUKFZES36PJPGNZGZ4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ANHMYTGXS9OX?ASIN=B0C5TS1JJX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "4.0 out of 5 stars Real & Thoughtful",
                "reviewText": "The first 10 pages captivated me to read on. The thoughts of each character during this bank robbery and the prison system in the state of Texas during those times brought every page to life. Being a historical fiction reader, it did not disappoint. Next book, I will buy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ingrid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTCGG3JE5Q3LUCN3VX3VXWWTMXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NIPTPE05SB1W?ASIN=B0C5TS1JJX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderfully written and engaging, even if you are not a history buff!",
                "reviewText": "When I am searching for a new book to read, I generally do not look for or choose those that are historical.But this book kept me engaged. I found myself wanting to learn more about each of the characters individual stories and viewpoints. I found the book a bit long but realized that there was a lot to tell about the history and the characters individually and in order to do so, it could not be shortened. What I found the most impressive is when reading the authors notes after I finished the book, there was SO much extensive research and preparation done to present this as accurately as possible and help us to learn more about this event and the character's.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5ONVSEOCK2MXDXBEORGNEGQCIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NOBQGRLO64R1?ASIN=B0C5TS1JJX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2023",
                "reviewTitle": "5.0 out of 5 stars A Book hard to put down",
                "reviewText": "This is such a compelling read. The first thing that interested me is that it is based on a true story. The characters were very clearly introduced to the reader at the beginning. The story was so engaging, that when I was tempted to put it away and come back later, I found myself turning the pages to see what happens next. Thomas Goodman does a great job of keeping the reader in suspense until very late in the book regarding the identity of the last man. I found myself eventually rooting for one character. Even such a tragic story has what I consider a happy ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Schroeder ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECUFVVAWKVUAJ5TI2HTVQGDJLKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FA2JCL8INHLC?ASIN=B0C5TS1JJX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Great read!",
                "reviewText": "I usually have 2-3 books going at a time, depending on the mood that I'm in. Once I started The Last Man, I couldn't put the book down until I knew what happened to each of the characters. The book starts off with a \"bang\" and each chapter after reveals how the characters lived out their remaining days. This true event occurred in the 1920s, so we don't have access to these men and their thoughts and motives, but Goodman does an excellent job at bringing their characters to life, a story sure to stay with you for some time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hilrey L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK6V6IEQAP5GV55AAQ43DDHBGHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL4GS1UYR5MD5?ASIN=B0C5TS1JJX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 27, 2023",
                "reviewTitle": "5.0 out of 5 stars An entertaining, yet, thought provoking read.",
                "reviewText": "Even though I grew up in Texas with family roots in Eastland County, I was not familiar with the historical account of the Santa Claus Bank Robbery. The book is entertaining and Goodman s fascinating in how we builds the novel from the historical account. One really identifies with the characters as they experience early 20th century rural Texas, its judicial process and prison system. The transformation and eventual pardon of Bobby Hill in the book are an encouragement to all that bad can be redeemed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennie Redburn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 29, 2023",
                "reviewTitle": "loved it!",
                "reviewText": "I’d recommended this to anyone. A true story with thoughtful additions which make the story really interesting and engaging read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}