{
    "remaining_requests": 975,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Code-Name-H%C3%A9l%C3%A8ne-A-Novel/dp/B082QTZRRV",
    "body": {
        "name": "Code Name Hélène: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Code-Name-H%C3%A9l%C3%A8ne-A-Novel/dp/B082QTZRRV",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51clmOktQQL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ariel Lawhon",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Ariel+Lawhon"
        },
        "brand": "Ariel Lawhon",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 6953,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"This fully animated portrait of Nancy Wake...will fascinate readers of World War II history and thrill fans of fierce, brash, independent women, alike.\" (Lisa Wingate, number one New York Times best-selling author of Before We Were Yours) Based on the thrilling real-life story of socialite spy Nancy Wake, comes the newest feat of historical fiction from the New York Times best-selling author of I Was Anastasia, featuring the astonishing woman who killed a Nazi with her bare hands and went on to become one of the most decorated women in WWII.Told in interweaving timelines organized around the four code names Nancy used during the war, Code Name Hélène is a spellbinding and moving story of enduring love, remarkable sacrifice, and unfaltering resolve that chronicles the true exploits of a woman who deserves to be a household name.It is 1936, and Nancy Wake is an intrepid Australian expat living in Paris who has bluffed her way into a reporting job for Hearst newspaper when she meets the wealthy French industrialist Henri Fiocca. No sooner does Henri sweep Nancy off her feet and convince her to become Mrs. Fiocca than the Germans invade France and she takes yet another name: a code name.As Lucienne Carlier, Nancy smuggles people and documents across the border. Her success and her remarkable ability to evade capture earns her the nickname \"The White Mouse\" from the Gestapo. With a five million-franc bounty on her head, Nancy is forced to escape France and leave Henri behind. When she enters training with the Special Operations Executives in Britain, her new comrades are instructed to call her Hélène. And finally, with mission in hand, Nancy is airdropped back into France as the deadly Madam Andrée, where she claims her place as one of the most powerful leaders in the French Resistance, armed with her ferocious wit, her signature red lipstick, and the ability to summon weapons straight from the Allied Forces. But no one can protect Nancy if the enemy finds out these four women are one and the same, and the closer to liberation France gets, the more exposed she - and the people she loves - become. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10177"
            },
            {
                "name": "Biographical",
                "link": "https://www.amazon.com/Biographical-Historical-Fiction/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9332127011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "17 hours and 17 minutes"
            },
            {
                "name": "Author",
                "value": "Ariel Lawhon"
            },
            {
                "name": "Narrator",
                "value": "Barrie Kreinik, Peter Ganim"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 31, 2020"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B082QTZRRV"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,097 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #10 in Biographical Fiction (Audible Books & Originals) #11 in World War II Historical Fiction (Audible Books & Originals) #19 in Biographical Historical Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sharon  S  Sims",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNN5GD3T7YG4WNPV5J6JPSM2NZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19TB8US5MGBMM?ASIN=B082QTZRRV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars BEST WWII historical fiction",
                "reviewText": "There are tons of WWII novels. This is one of the very BEST and seems overlooked. Don't miss it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Benny 806",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAB6BFP5BJOWN35AO5ODAV5CQ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QQGQH24HUBTF?ASIN=B082QTZRRV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Wow!",
                "reviewText": "I downloaded this book some time ago and had forgotten that it was based on a real person, so I was amazed when I finished it and read that it was. The book was incredibly well written. At one point, I started wondering if it was a romance novel (which I do not read) but it turned out there was just a beautifully romantic segment to the story. When I read a book that jumps around in time like this, I often wonder if it would have been better if it had just been told chronologically, but I suppose the skipping around keeps you guessing more. At any rate, this is one of the best books I have read in a long time. I loved and admired the main character Nancy. She was definitely one of a kind. A must read for fans of historical fiction!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MaKenzie Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE4U77P3EK3KVNWODKK7MFTHU3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S67R8Z440FMJ?ASIN=B082QTZRRV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 3, 2023",
                "reviewTitle": "4.0 out of 5 stars You need to know about Nancy Wake!",
                "reviewText": "4 • ⭐️⭐️⭐️⭐️It is 1936 and Nancy Wake is an intrepid Australian expat living in Paris who has bluffed her way into a reporting job for Hearst newspaper. Flash forward to the peak of WW2 and this once bright eyed journalist is now the most wanted woman to the Third Reich.Espionage. World War 2. Nazis. French revolutionaries. True story. I write this in absolute awe of a Nancy Wake and her story. World War 2 seems like a dream with the evils done by Hilter and the Third Riech across Europe but to read novels like this and than see that this was a real woman with a real story… I can’t imagine what I’d done in her shoes.Amazing read! Highly recommend.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C Orr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGODV6WWXIH6PBGQUNY6ALVTN2CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FQTDROGUKNGT?ASIN=B082QTZRRV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 23, 2021",
                "reviewTitle": "5.0 out of 5 stars Incredible",
                "reviewText": "I feel rendered speechless by the story of Nancy Wake, easily one of the most remarkable people in history. To learn which parts of this historical fiction novel is true is mind-boggling; I won’t say more along those lines to avoid spoilers. If you don’t know Nancy’s story, do yourself a favor and read Ariel Lawhon’s book now, right away, and do NOT read the author’s notes at the end before you do. Also, do NOT make the mistake of consulting Wikipedia or Google before you finish the novel like I did. Read her story as Lawhon has let it unfold, and you will not be sorry.Nancy was an expatriate from New Zealand who moved to France at a young age. She fell in love with a wealthy Frenchman and made France her home. Her fairytale life was interrupted as World War II began. She helped smuggle documents and people, and then joined the French resistance. As the Gestapo’s most wanted person, she eventually had to escape France to avoid capture. She returned to London, trained with the Special Operations Executive, and became a secret agent and saboteur.There are heart-wrenching events and circumstances in this story, as you would expect in a novel set against the backdrop of World War II. There is one scene in particular that was absolutely horrific; it’s one of the worst things I can possibly imagine as a mother, and I couldn’t get it out of my head. I almost stopped reading at that point. I’m ultimately glad I didn’t, but I still wish that I could have skipped that part. Just know that there are a couple disturbing scenes, and decide accordingly whether you want to read this.The author mentions in the afterword the bad language throughout the book. It was authentic with regard to the person Nancy Wake was, and I respect Lawhon for including language that is authentic. If bad language would have you clutching your pearls, maybe skip this book, but know that you are truly missing out.Overall, this is an amazing rendering of the story of an amazing woman. It’s incredible, the ordinary and extraordinary bravery of human beings to persist in the face of, and fight against, the terrible atrocities that other human beings commit. I am glad to know Nancy’s story.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jim Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4GFGZFNEJREZ4G5GRSYPCLKIBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21RKNA6NCH4K0?ASIN=B082QTZRRV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Most of the characters are resl",
                "reviewText": "I liked the interweaving of fact and fiction",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diane E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDYIDJOOLSAFWXULXTXQCIW73DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27GZITGXFXYCI?ASIN=B082QTZRRV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars exciting story. loved her descriptive writing",
                "reviewText": "This book kept me up nights - reading more to see what would happen next.The only difficult thing for me was to jump back and forth between different years—some from the past and then , back to a future time. I was reading on a kindle and couldn’t just easily flip back through pages to see a previous year and to see what event tied to that time.But all in all, I loved this author’s writing & will read more of her books.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "a reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZTS256NIJBZVLZ54LPXXSUHTZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V36WJZFASJ9X?ASIN=B082QTZRRV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2022",
                "reviewTitle": "4.0 out of 5 stars Another Amazing WW2 Woman Resistance Fighter if You Can Stomach It",
                "reviewText": "I've been reading fictionalized versions of women who did amazingly brave things in WW2 and Australian Nancy Wake was certainly fascinating. The book requires paying attention to dates because of the non-linear timeline. There is a lot of profanity which is designed to make Nancy Wake the foul-mouthed Aussie w/her all-male colleagues more realistic. There are also graphic depictions of Nazi torture of civilians outside concentration camps that pop up randomly & I did skip most. The most confusing element to me - even though it's true to her life is that she was not trained by British SOE & sent to France to support the resistance fighters until 1944. Prior to that, she'd been doing brave - but not uncommon - resistance war work like delivering forged transport papers & accompanying refugees to their next stop in their journey to escape while her husband was away on active duty. What was never explained was why Wake was singled out & called the hard-to- capture White Mouse by the Nazi & Vichy governments for her work before & during 1943. The Author's Note are a must read, but I was left wondering why her early efforts made her such a target when she didn't become a ruthless leader & constant threat to the Nazis backed by British supplies and money until so much later. Still, a very good read.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sydney Otomancek",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 12, 2023",
                "reviewTitle": "Life changing!",
                "reviewText": "Probably one of the best books I’ve ever read. I have a terrible memory but I constantly bring this book up to others and couldn’t recommend it more if you wanted to read about a bada** woman!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eden",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 16, 2023",
                "reviewTitle": "Immensely enjoyable!",
                "reviewText": "It was hard putting this book down it was gripping from the beginning. Well written and with a sense of humour too. I was quite upset to discover the husband died. What a beautiful love story between Helen and her husband.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pascale GABRIEL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 20, 2023",
                "reviewTitle": "Excellent book",
                "reviewText": "Fascinating story . I had never heard of Nancy Wake before but her life was so inspiring that I couldn’t stop reading until the end of the book. I am from Marseille and all the descriptions of this town in the book rang a bell although it isn’t the same city at all nowadays . Thank you Ariel for these moments of great reading . I highly recommand this book .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ram",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 10, 2022",
                "reviewTitle": "A beautiful book",
                "reviewText": "Not just thrilling but has a strong character in Nancy wake with a debonair flaire.very well written, irreverent and brings to life a gripping story.. what a courageous and loving woman she was in real life.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meike",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 19, 2021",
                "reviewTitle": "mitreißend",
                "reviewText": "mitreißend und sehr bewegend! Zum Ende hin konnte ich es nicht mehr aus der Hand lassen. Für mich super inspirierend!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}