{
    "remaining_requests": 977,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sweetness-Water-Novel-Nathan-Harris-ebook/dp/B08F4ZQTQC",
    "body": {
        "name": "The Sweetness of Water (Oprah's Book Club): A Novel",
        "price": "$11.99",
        "originalPrice": "",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sweetness-Water-Novel-Nathan-Harris-ebook/dp/B08F4ZQTQC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91aFcehdq1L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Nathan Harris",
            "link": "https://www.amazon.com/Nathan-Harris/e/B0937P84GB/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 17863,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An Instant New York Times bestseller / An Oprah’s Book Club PickIn the spirit of The Known World and The Underground Railroad, an award-winning “miraculous debut” (Washington Post) about the unlikely bond between two freedmen who are brothers and the Georgia farmer whose alliance will alter their lives, and his, forever In the waning days of the Civil War, brothers Prentiss and Landry—freed by the Emancipation Proclamation—seek refuge on the homestead of George Walker and his wife, Isabelle. The Walkers, wracked by the loss of their only son to the war, hire the brothers to work their farm, hoping through an unexpected friendship to stanch their grief. Prentiss and Landry, meanwhile, plan to save money for the journey north and a chance to reunite with their mother, who was sold away when they were boys. Parallel to their story runs a forbidden romance between two Confederate soldiers. The young men, recently returned from the war to the town of Old Ox, hold their trysts in the woods. But when their secret is discovered, the resulting chaos, including a murder, unleashes convulsive repercussions on the entire community. In the aftermath of so much turmoil, it is Isabelle who emerges as an unlikely leader, proffering a healing vision for the land and for the newly free citizens of Old Ox. With candor and sympathy, debut novelist Nathan Harris creates an unforgettable cast of characters, depicting Georgia in the violent crucible of Reconstruction. Equal parts beauty and terror, as gripping as it is moving, The Sweetness of Water is an epic whose grandeur locates humanity and love amid the most harrowing circumstances.One of President Obama's Favorite Books of 2021Winner of the Ernest J. Gaines Award for Literary ExcellenceWinner of the Willie Morris Award for Southern Fiction Winner of the Writers’ League of Texas Book Award for FictionLonglisted for the Man Booker PrizeShortlisted for the Dylan Thomas Prize Shortlisted for the VCU Cabell First Novelist AwardLonglisted for the 2022 Carnegie Medal for ExcellenceLonglisted for the Center for Fiction First Novel PrizeLonglisted for the Crook’s Corner Book PrizeA Best Book of the Year: Oprah Daily, NPR, Washington Post, Time, Boston Globe, Smithsonian, Chicago Public Library, BookBrowse, and the OregonianA New York Times Book Review Editors' ChoiceA July 2021 Indie Next Pick Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B08F4ZQTQC"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Little, Brown and Company (June 15, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 15, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2324 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 369 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,844 in Kindle Store (See Top 100 in Kindle Store) #4 in LGBTQ+ Historical Fiction (Books) #13 in Black & African American Historical Fiction (Kindle Store) #42 in Black & African American Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 17,863 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1deb776f-3304-4009-913b-125f7e5b6f91.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BringData",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZRV7CKRFDWLCY3Q7VJ7U5CXVJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KO9J7ATRD8OZ?ASIN=B08F4ZQTQC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Highly Satisfying and Memorable",
                "reviewText": "It's easy to see why this book is on so many reading lists, including Oprah's and Obama's. It's historically interesting and beautifully written. I found many passages to mark so I could go back and read them again. The Walker family may have been unusual in that time and place, Georgia just after the Civil War, to be so accepting and welcoming to freedmen. It is hard to know. Still, I like to think that there were more people like them. I felt that the story showed both the good and bad of that era, with people in the south having to reconcile themselves to having lost the war and having to give up their slaves. I was fascinated by the view into the lives of the freed slaves, with so many really having nothing to take with them and nowhere specific to go. Imagine just being set free like that, after having been someone's property. I also felt that the friendship between Isabelle and Mildred accurately portrayed the strength and support women share with each other. This story is beautiful, both sad and hopeful, and memorable.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5A3CWGLJ2T5PCMZLZT24PS4Y3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36M95FOLCDZVS?ASIN=B08F4ZQTQC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Good reading",
                "reviewText": "Interesting characters",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raymond Burger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSO4KF77OI7S3ZPNCP6GYELU5XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E65PDG6J8CPE?ASIN=B08F4ZQTQC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Good reading",
                "reviewText": "Definitely keeps your attention. Marvelous story. Transports you to another time and place where hate and bigotry rule, but decency and honesty appear occasionally.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ilene Fowler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYVHVXT5V6UEO2U43BXSPJPA5FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNVUB5L23T473?ASIN=B08F4ZQTQC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Living a life fulfilled based on hope",
                "reviewText": "One of the most beautifully written books I’ve ever read. The story was sad, subject matter difficult, and at the same time uplifting. The human spirit…amazing…perseverance, respect for others and love carried the day.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna Hill Fielding",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVORRXXBARX4APP5U276CQDPUXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFTIS1SP0XJA3?ASIN=B08F4ZQTQC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2023",
                "reviewTitle": "4.0 out of 5 stars A Sad but Sweetly satisfying story of life after the Cicil War.",
                "reviewText": "It’s approximately the late 1800’s when Landry and Prentiss show up at George and Isabel’s farm. They make a deal with George to help him plant in exchange for land they can use to make money. Eventually, they plan to move away from this part if the south and look for their mother, from whom they were separated for many years. The first half of the story allows us to get acclimated to the people in the coomunuty, the brothers and George’s family, including their son Caleb, who had deserted his army troop towards the end of the war.But then something huge happens, and the story takes a huge turn — it goes from being a sort of slice of life, with the rest of the times there in the background, to becoming a true post-Civil War tale of how white people treated Black people and how the government was, at least for a time, ineffectual, to make the necessary changes to protect the newly freed slaves.After this event, the main characters grow and change in ways that make them proud — some have no choice because of he circumstances, and others, need to if they can ever have a shred of self- respect.And beyond all this is a book about the different types of love in our lives whether it’s same gender, long term spouses, brothers, parents and children, friends, and other iterations. That’s pretty much the reason that the book is sweet and sad.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Literary MC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEV77KHAU6FSXJ6OXGQNGVOUCJNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PQ5LWFJ4KM1H?ASIN=B08F4ZQTQC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2022",
                "reviewTitle": "3.0 out of 5 stars Good first novel by an up and coming author.",
                "reviewText": "I thought Nathan Harris's writing is very solid, very lyrical at times and very promising. The telling of the story, however, was so-so and meandering, and that's why I didn't give this first novel four or five stars.I did like the relationships between George, Prentiss, and Landry. What I didn't like forced upon me was learning that Caleb was alive and then about his relationship with August. I thought that part of the plot was a bit forced. Oh, and one of the critics called the moment between Caleb and August in the field where Landry saw them, \"Erotic and very telling.\" Really? The entire moment was maybe two short paragraphs. It wasn't erotic. And it only supported what the two boys had done prior to going off to war and I imagine during their time away. I thought the whole thing form me was a nothing burger.What I found implausible, was the sudden fire that burned down nearly the entire town, as if that were a metaphor for bad karma and somehow this town needed to be cleansed of its evil past. The other thing I did not find believable was how easily the sheriff caught up to George, Caleb, and Prentiss after the aforementioned had more than a day's head start. Even with George on his donkey Ridley and Caleb and Prentiss sharing a horse, there is no way, the Sheriff would so easily catch up to them. And once Caleb and Prentiss take off on foot and George is left to fend off the posse where he's shot, doesn't explain how suddenly the Sheriff didn't take off and capture Caleb and Prentiss, based on the ease it took him and his posse to track and reach them after more that a day to catch up.Another part of the story that bothered me, was what happened to August? After all, he murdered Landry. For me, that's a big deal. It's as if the author and editor believed they didn't really need to address it, and had that character flit off to somewhere else. leading me to believe that somehow he had gotten away with it, which he did. I think Harris owed it to us to sew this up much better than he did.Finally, the one character that I did believe and like how she had grown from beginning to end, was Isabelle. I thought Harris did a very nice job with her and I believed her coming around and growing from the time she encountered the two freedmen especially Landry. Also her relationship with her husband and her son Caleb. I thought the author did a very nice job with Isabelle giving the freedmen and women, and any man for that matter the opportunity to farm fifteen acres for themselves. That part of the story was very well told. Also, I liked the ancillary character Clementine, although I thought her last encounter with Isabelle was rushed and wasn't really fleshed out.In sum, this was a very good first novel, but I question Oprah's decision to promote this particular book when there are many more deserving novels out there (historical fiction) that told a much better story, had more convincing characters, dialogue and grit, a better plot, and more universal themes than this simple tale. In the end, I look forward to this young man's next book.",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pull It Together",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5WNW7DRXVGODBYXKQ7X3JO4IFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW3PR07Q6HHOF?ASIN=B08F4ZQTQC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Heartbreaking and Beautiful",
                "reviewText": "A beautifully written book about hope in the face of an unfair system. Although difficult to read at times, beauty, strength and hope shines through. The resilience of the human condition astounds.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arlene",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 26, 2023",
                "reviewTitle": "The title didn't appear to be what the book was about. Until the end.",
                "reviewText": "I was captivated from the start. It is not always nice to hear of the prejudices that we live with or have lived with. I can relate to that personally. The writing was very descriptive and so very imaginative . Being as this was the author's first book I think he should be very proud. I congratulate him on job well done. I truly recommend this book to all those out there who enjoy reading.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 4, 2024",
                "reviewTitle": "Wow!",
                "reviewText": "A great story, not always a comfortable read but very rewarding. Worth all the time you take to read it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LizM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 26, 2023",
                "reviewTitle": "Beautiful! But not in a soppy way!",
                "reviewText": "This book is so beautifully written - hard to believe it’s a debut novel and Nathan Harris was only 29 when he wrote it. If you like your books fast-paced then this is not for you but if you enjoy a good story (with a factual background) that is really well written then you will not be disappointed. By the end I felt I knew all the main characters personally and didn’t want to let them go!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 18, 2022",
                "reviewTitle": "The Sweetness of Water",
                "reviewText": "This was a very good novel, with a smart and well-developed plot. The main characters are presented by an omniscient narrator who draws the reader into the world of each protagonist. The author covers numerous themes that can relate to today's world, which I found made this novel worth my time to read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ellen d",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 17, 2022",
                "reviewTitle": "A really poetic novel which vividly takes the reader back in time",
                "reviewText": "I read a lot and couldn't put this book down. Hat's off for this author's first nove!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}