{
    "remaining_requests": 890,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ireland-Frank-Delaney-audiobook/dp/B0007URYAM",
    "body": {
        "name": "Ireland",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ireland-Frank-Delaney-audiobook/dp/B0007URYAM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51rqi4guLNL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Frank Delaney",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Frank+Delaney"
        },
        "brand": "Frank Delaney",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2598,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "One evening in 1951, an itinerant storyteller arrives unannounced at a house in the Irish countryside. In exchange for a bed and a warm meal, he invites his hosts and their neighbors to join him by the wintry fireside and begins to tell formative stories of Ireland's history. Ronan, a nine-year-old boy, grows so entranced by the storytelling that, when the old man leaves abruptly under mysterious circumstances, the boy devotes himself to finding him again. Ronan's search for the Storyteller becomes both a journey of self-discovery, long unspoken family secrets, and an immersion into the sometimes conflicting histories of his native land.A sweeping novel of huge ambition, Ireland is the beautifully told story of a remarkable nation. It rings with the truth of a writer passionate about his country and in full command of his craft. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Family Saga",
                "link": "https://www.amazon.com/Family-Saga-Genre-Fiction-Books/b?ie=UTF8&node=10163"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "19 hours and 29 minutes"
            },
            {
                "name": "Author",
                "value": "Frank Delaney"
            },
            {
                "name": "Narrator",
                "value": "Frank Delaney"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "February 17, 2005"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0007URYAM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#21,823 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #246 in Fiction Sagas #1,168 in Historical Fiction (Audible Books & Originals) #1,277 in Family Saga Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Clem",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG27XJS57LHUB3IX53KUSL3YPCNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38FAILTB8VK47?ASIN=B0007URYAM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2018",
                "reviewTitle": "5.0 out of 5 stars Treasure trove of history, myth, fable, story-telling...",
                "reviewText": "Ronan O’Mara is a nine-year old boy who lives in rural Ireland with his mother, father, and aunt. The year is 1951. One day, a mysterious stranger – an older man – appears at the doorstep. Who is he? We don’t know. We know his visit is expected. Neighbors come over, and the stranger tells the family and their neighbors a story. Several stories actually. It seems this is the gift of the stranger. A storyteller. Ronan wishes the man could stay forever, but his impatient mother feels he’s outstayed his welcome after a few days, and the stranger leaves. There’s something about this man that has touched Ronan’s soul though, and Ronan can’t rest easy with the stranger no longer in his life. So Ronan begins a twelve year quest to find the stranger.Now, before I go further, let’s go back to the stories that the old man told Ronan and company. These stories are quite a pleasant diversion from our “main” story. The stories that the stranger tells are about the people’s homeland and history -the history of Ireland. True, there’s a lot of myth, fable, and tradition within these yarns, but the storyteller knows how to enrapture an audience. It doesn’t surprise us in the least that Ronan can’t rest until he finds out where the man is after he leaves. At the very least, it would be nice to find out who he is.Reading this wonderful novel allows you to suspend any sort of disbelief you may have. Is it really common to invite a complete stranger into your house for a week simply because he can tell stories? Is this man even real? Or is he a figment of young Ronan’s imagination? Does the existence of this character serve only to aid Ronan discover his destiny? Good stories really are rare, and Frank Delaney simply entertains us to the point that we simply don’t want to add too much logic within the pages we’re reading. These stories of Ireland that are juxtaposed through the pages are simply wonderful tales, and many times altogether too brief.As Ronan embarks on his journey, he seems to be forever one or two steps behind the storyteller. But this doesn’t stop Ronan from hearing more of the stranger’s stories. Wherever Ronan goes, it seems he’s allowed to hear more stories from the stranger in many different forms. Sometimes, he hears the stories secondhand. Other times, the story teller leaves Ronan written tales that the storyteller composed for him to enjoy. It seems the stranger knows Ronan might be searching for him.What makes this novel more pleasurable as that we also get to know Ronan and his family quite well. Had these extra tales not been thrown into the main storyline, this still would have been a terrific book. Ronan, like all of us, has his own life to live, and as the story progresses, we learn more about his own personal history and the events that shape his character. So maybe a great way to describe this book is “several wonderful stories told within a story”.Although this book takes place in Ireland and all of the stories are about Ireland’s history, the overall feel is quite light. This isn’t a densely packed James Michener type of book. I feel that had author Frank Delaney wanted to write such a book, he could have easily done so, however. But overall, this book is rather light on the historical narratives of the country. The main objective here is Ronan, and his quest to find his calling.I loved this book. As someone who reads quite a bit of fiction, I never take great writing for granted. The story is the point of a good book, but more important is how the author tells the story. How else could John Grisham become so popular? On the surface, dozens of books about the law profession don’t sound very exciting, but Grisham is a great storyteller.And so is Frank Delaney. After reading this book (Summer 2018) I was sad to discover that Mr. Delaney passed away about a year ago. Fortunately, he has several other books that he penned (all seem to be somewhat related to Ireland), and I’m eagerly looking forward to reading more by this author.",
                "reviewVotes": "78 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. K. Fowler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4IN6UMZ6BSQNJG5GODKJT2WN7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AR03CEC7651E?ASIN=B0007URYAM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Where's my pennywhistle?",
                "reviewText": "Frank Delaney sings stories of Ireland, and I want to play along, an amateur at the knees of a master.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tigerlily64",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBBRERU7KIN2BV6SCG3BGBP7L4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIY12EQ697GXX?ASIN=B0007URYAM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2019",
                "reviewTitle": "4.0 out of 5 stars Ireland: Historical Facts, Storytelling, Myths and Lore",
                "reviewText": "\"Ireland” is Frank Delaney’s first book to be published in the United States. He hails from County Tipperary and writes about the country he loves.Delaney’s book is full of historical information, as well as Irish legends and lore. It delves into the remote past and even begins the story with the last Ice Age when glaciers carved out the hills and valleys of Ireland. This extensive historical novel covers a wide variety of material in Irish history. Delaney writes of the English oppression, the Irish resistance, heroes and myths, and the skill of storytellers. Even the different counties in Ireland are addressed with their distinctive cultural flavors.Itinerant storytellers frequented the area in Tipperary where the author grew up. The oral tradition was very strong. Stories, often with some elaboration, were handed down through the generations.Frank Delaney’s book centers on an itinerant storyteller and Rolan, a boy who had heard this amazing storyteller when his father invited him to his parent’s home. After a couple of days, his mother had made the storyteller leave, but Rolan, who was only a young boy at the time, had desperately wanted him to stay and never forgot him. Rolan’s mother was remote and cold. His father was also somewhat distant. Rolan was lonely and yearned for a feeling of belonging. He became consumed with this storyteller. “Like a plowman opening a field, he had carved out the beginnings of my imagination; he and helped me recognize instinctively the country and the people of whom I belonged”.Rolan followed this mysterious storyteller over the countryside but always missed seeing him. At times, Rolan received notes from the storyteller. The storyteller had promised to teach him, and, yes, certain notes gave Rolan information about the techniques of good storytelling.The storyteller’s disappearance was puzzling. At the end of the book, Rolan finds out some secrets that shed light on the storyteller’s behavior and his own relationship to the storyteller.The book is really an epic story. It was much longer than I expected. Unfortunately, sometimes it just dragged on and on, and I wanted it to be over. I had to read other books to get a break from it at times. Often I felt like I was reading a history book and had to really concentrate to take it all in. However, fact and fiction was so intertwined in sections that sometimes I was confused as to the historical facts. Sometimes more caffeine was needed to get me through some sections. However, the author’s research was excellent, and I really did learn a great deal about Ireland from reading this book.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "snippyw",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZMED2IV3O2A3YRXM5NWJ53JPLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NMIFXNZJEUGN?ASIN=B0007URYAM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars A Great Read",
                "reviewText": "For those who know Ireland or want to it’s a book to read. I highly recommend it - easy and pleasurable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOEYZOPRBDT6PDKNHHTL6YDRDUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17LAOCV7E431F?ASIN=B0007URYAM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars I love ireland",
                "reviewText": "Can't wait to sit with this lovely book,,haven't read much yet,but I treasure anything about the lovely Irish land!beautiful and magical.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Readitall",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 11, 2023",
                "reviewTitle": "How to become a storyteller",
                "reviewText": "This is the story of how a young boy grows up to become a storyteller, peppered with the stories he discovers along the way. The legends and history of Ireland are intertwined with a touching story of self-discovery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 29, 2023",
                "reviewTitle": "Excellent story",
                "reviewText": "I first read this book many years ago,I have been looking for a copy for along time.trying second-hand book shops,charity shops and car boot sales.So pleased that I found it at last.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.Warren",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 27, 2012",
                "reviewTitle": "Wunderbares Buch",
                "reviewText": "Ich liebe dieses Buch. Habe es im Weltbild Verlag vor Jahren auf Deutsch gekauft; es heißt da Schwer und Harfe, ist aber wirklich eher das was der englische Titel sagt: A Novel from Ireland.Es handelt sich um einen Geschichtenerzähler der jahrhundertealte Sagen, Mythen, Legenden und Geschichten von Irland im Buch erzählt. Selbst eingewoben in eine Story. Es macht Geschichte lebendig und ist wunderbar geschrieben. Man erfährt so z.B. wie New Grange erbaut wurde.Einfach schön für jemand der sich mit Irlands Historie beschäftigt.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pearl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on May 16, 2016",
                "reviewTitle": "1冊でアイルランドの歴史を鳥瞰できる",
                "reviewText": "1950年代のアイルランド．主人公の少年の家に一人の「語り部」 (story teller)がやってくる．全国を歩き回って個人宅や町の集会所でアイルランドの伝承や歴史物語を語って聞かせる職業語り部は，20世紀前半にはたくさんいたらしいが，その最後の一人ともいえる人物である．その物語に心奪われた少年は自らも物語を集め，やがて大学で歴史を学ぶまでになるが，それまでずっと行方知れずとなった語り部をさがし続ける．このストーリーを軸に，石器時代のニューグランジ遺跡の物語から，1916年のイースター蜂起まで，十数話のアイルランドの歴史物語が散りばめられている，という構成．そして最後に，主人公も知らなかった家族の秘密が明らかとなる．．．個々の物語は日本で言えば，天岩戸伝説，里見八犬伝，義経と弁慶の物語．．．といった感じで，おそらくアイルランド人には馴染み深いものなのだろうが，自分は知らないものが大半だったので，その点でも非常に面白く，勉強になった．アイルランドの歴史は，ヨーロッパの中でも特異なもので，イングランドとの確執は今も続いているが，その背景を理解するのにおおいに役立だった．これ1冊でアイルランドの歴史を鳥瞰できる，たいへん充実した読後感であった．",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheila Graham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 25, 2021",
                "reviewTitle": "A well-told story!",
                "reviewText": "I enjoyed the audible version of the book. I plan to continue to read the book, but it was lovely to have the story read to me by the author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}