{
    "remaining_requests": 837,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Her-Cursed-Duke-Historical-Innocence-ebook/dp/B0CSQHT5N1",
    "body": {
        "name": "Her Cursed Duke: A Historical Regency Romance Novel (Brides of Innocence Book 2)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Her-Cursed-Duke-Historical-Innocence-ebook/dp/B0CSQHT5N1",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81iHe3yWRmL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Harriet Caves",
            "link": "https://www.amazon.com/Harriet-Caves/e/B08TWSC2YK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 135,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CSQHT5N1"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Cobalt Fairy LLC (January 17, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 17, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3251 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 391 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,494 in Kindle Store (See Top 100 in Kindle Store) #45 in Historical British & Irish Literature #48 in Historical Regency Fiction #83 in Victorian Historical Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 135 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/69bb2c01-1379-474d-9eeb-e36a6f632d1f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/930b6d4b-e9cb-4975-a7aa-3f389f901c14.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/e08b7ca3-f4d7-4b27-95f7-8690ee6a3e41.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/e0332fe6-8bf4-44ca-9a1c-1ab85e9df51b.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marilyn Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ6NIHSI6VNXAYI4CFO5DRZDL5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33YKGZUQ0AU7U?ASIN=B0CSQHT5N1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars A fake engagement turns real!",
                "reviewText": "This was a story of a Duke that needs a fake betrothal to keep the young women from wanting marriage to him for his wealth. He asks a young woman to help him and have a fake betrothal to keep them away. She agrees but has different situations happen to prove they are together. But soon their feelings for each other change! I voluntarily reviewed an Advance Reader Copy of this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JustJeri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHBLAHCHQSSHGMWMM23QNR7XAKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDO1VGYL2ASV4?ASIN=B0CSQHT5N1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Pretend courtship",
                "reviewText": "Pressure from Prudence and Aiden’s families to marry, Aiden proposes a ruse that they pretend to court until the end of the season. Aiden has an unflattering name in the ton because of a tragedy that occupied when he was young, defining his hermit existence. The story is the second in a series of three sisters and how their found their true love. I enjoyed the story, but the the middle section could have been shortened. The only drama in this story is the emotional upheavals and growth occurring between primary characters. I really enjoyed the witty retorts shared by all characters. The areas that were somewhat confusing to me was that there wasn’t any more in-depth information or closure on Aiden’s “curse”, and there were several typos throughout the story. I received a complimentary ARC, but I am voluntarily offering my personal opinion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Margaret Knorr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJPXFOBO525Q3HQWPYIUXM7GCJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HKWLIZ52PPQP?ASIN=B0CSQHT5N1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Enjoyable read!",
                "reviewText": "I really enjoyed this book. I laughed and I cried. I could really relate to the characters. It was a very interesting premise I have not encountered before in a romance. I liked the independent, strong willed heroine. The hero was interesting as it took a little while to warm up to him. At times he seemed extremely juvenile and frustrating, but those are typical traits for a man! Eventually he wises up and embraces the truth he's been trying to ignore. I understand that the idea of a curse was necessary to move the story along, but it would have been nice for the conclusion if that idea had gotten dispelled.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sue Bronikowski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXQOKCVVKQE23A3XMCQJL4QODKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RWN9E3UCASS?ASIN=B0CSQHT5N1",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "3.0 out of 5 stars I would have liked it better if I had skipped a majority of the first 220 pages",
                "reviewText": "I had a very difficult time trying to come up with a rating for this book because my feelings about it changed so dramatically while I was reading it. For the first 220 pages, I found it so boring that I struggled to keep reading and even let the book sit for a couple of days because I didn’t have much interest in reading it. I found too much of it to be unnecessarily wordy and it dragged on.However, after page 220, that completely changed. I found myself staying up to finish it and was literally laughing out loud and crying (at different times). I especially appreciated the dialogue which suddenly had a witty humor that I enjoyed immensely and had me feeling a lot more positive about the book.That would have resulted in a higher rating except for some other issues. The story never resolved the cursed theme of the book which became obsessive and made no sense. Considering a duke’s power and influence, who would talk like that to a duke and why did he or his godmother allow it?? I also found that for a while I didn’t like the character of Prudence as much because her efforts to resolve it were “too little, too late.”I also found typos to be irritating, but the biggest negative for me is the latest trend of adding preview chapters that aren’t included in the same file but require the reader to go to another site to claim them. My distaste for the manipulative way that readers are forced to give their email information in order to access the preview chapter and extended epilogue can’t be overstated. It used to be that to read the extended epilogues you had to click and give your contact information (also requiring internet access and signal), but now authors are also adding introductory chapters that also require the same thing. It makes me angry that they manipulate readers like that, rather than just including the prequel chapters and extended epilogues as part of the book which they are.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMPOWYIWSYACTOPIHO6HAEBJ2VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJM2TM9DASYL4?ASIN=B0CSQHT5N1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Aiden and Prudence",
                "reviewText": "Wonderful book and characters. Aiden always thought he was cursed even though accidents and events happened in their natural course. He met Prudence and she stood up for him from the very beginning even though their courting wasn't real but a passing thing in their parts ,but love has a way of changing things. they work th heir differences out and get their HEA and so much more. Would highly recommend,only wish their was an extended epilogue to see where their life took them. Happy reading.😊",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nelle Renn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVKHDD7S4DTJFHS7N5QAMNMMTCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VQIR7IDF0UVZ?ASIN=B0CSQHT5N1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "4.0 out of 5 stars Pretend courtship",
                "reviewText": "The hero has had a lot of trauma in his life and the community sees him as cursed, threrfore, he has withdrawn from most social events. His godmother has other ideas and wants him to marry. The heroine is taking care of her grandmother until she can be reunited with her sisters. They meet at a garden party when she trespasses into the house. He sees her as a way to still his godmother’s pressure to marry as they agree to a fake courtship. I felt at times that the heroine carried her teasing a bit too far, as she was very considerate of others normally. The storyline was good with it taking them both some time to realize that their feelings were changing. I enjoyed this second book of the series and look forward to the other sister’s book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara  H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5R7NLEQXOKP2QIIONG4F54LXSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TV481LIPKBUP?ASIN=B0CSQHT5N1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars False rumors destroy Duke",
                "reviewText": "This was a sweet love story with a passionate side. The duke proposes a fake betrothal to hide from ladies wanting his wealth while despising him. Prudence is a loving lady always willing to help. Both have a reason to distrust love so what could go wrong? The characters were endearing and made you hope that they would get together at the end. Prudence is portrayed as a strong and loyal person while Aiden is sweet and hiding from life. This book kept me reading until the end. Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "barbara gerling",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQBKGDOJJZBXK3VI73NJ775MINA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QE95PPZTBT7X?ASIN=B0CSQHT5N1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars never give up there is always hope",
                "reviewText": "Aiden was thought to be cursed by everyone since he was the only survivor when his family got sick. When things go wrong, they all blame him. When he met Prudence, she was the first to see him for himself. He got her to agree to a pretend courtship. As they went through with the courtship, they grew close, and love soon followed. He got scared and sent her away but quickly realized his mistake and went after her.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pickle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 3, 2024",
                "reviewTitle": "ANYTHING CAN HAPPEN WHEN PRETENCE BECOMES REALITY",
                "reviewText": "AIDEN - After losing his family he became obsessed in the belief that he was cursed anybody he loved or cared for, SOMETHING would happen to them even the local Villagers and society believed him to be cursed terrified if he looked at them, moving away when he came near to them, due to this he became more of a recluse, his Godmother has told him constantly there was nothing wrong with him, he needed to marry find a young lady to court, (She decides to arrange a dinner where he may meet someone.LADY PRUDENCE - She and her two sisters were separated until her older sister Agnes was married Prudence has been sent to live with her grandmother who was getting older and needed help.While out walking by she trespasses on to the neighbours property - the Duke, he has a reputation of not being very sociable Prudence apologised (but he was having none of it)Aiden explains that his grandmother is holding a party which Prudence has also been invited to. He explains he is expected to select a young lady to court) he demands as punishment, that she pretend he is courting her for his Godmother as he cares for her very much ( And it must be for the rest of the season) and then they can separate.LET THE GAMES BEGIN !I REALLY ENJOYED THIS THE INTERACTION BETWEEN PRUDENCE AND AIDEN IS GREAT.HEARTBREAKING IN PARTS - HOT IN OTHERS?I RECEIVED AN ARC COPY",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paula",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 22, 2024",
                "reviewTitle": "Hot and steamy",
                "reviewText": "Prudence and Aiden while leaving close to one another have never meet yet her kind heart leads her to take on members of the ton on his behalf when they accuse him of being cursed. This act of kindness leads to there falling in love and having the happy ending all people wish for.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 1, 2024",
                "reviewTitle": "Prudence and Aiden",
                "reviewText": "I love how Prudence is brave enough to stand up to Aiden, she is perfect for him.He believed he is cursed but is in fact a sweet and kind man. Falling in love with each other during their fake courtship was never the plan. Grab a copy to find Prudence and Aiden happily ever after",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}