{
    "remaining_requests": 909,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Grandmothers-Shadow-heartbreaking-unputdownable-historical-ebook/dp/B0CT629ZGT",
    "body": {
        "name": "My Grandmother’s Shadow: An utterly heartbreaking unputdownable historical novel based on a true story",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Grandmothers-Shadow-heartbreaking-unputdownable-historical-ebook/dp/B0CT629ZGT",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81VUovttznL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Devorah Shafrir Keret",
            "link": "https://www.amazon.com/Devorah-Shafrir-Keret/e/B0CKRTN7JZ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 35,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "One woman’s search for answers unfurls into a riveting multi-layered family saga, perfect for readers of Jean Grainger and Soraya Lane.Winter, 1941: Watching the smoke rise over the burning synagogue of the Riga Ghetto, Johanna Friedman’s only concern is keeping her family safe. As she prepares to leave her home, clutching what little possessions she is allowed to carry, her thoughts meander to a simpler time before the war – and a secret name, one she rarely recites out loud, forever embedded in her heart.Present day. Devorah was never allowed to ask about her mother’s repressed past, until her mother agreed to show her a hidden drawer containing her secret history. Devorah unravels the story of the amazing women who have shaped her legacy: the one who raised her mother as her own – and the one her mother never knew.Inspired by the true story of her maternal lineage, Devorah Shafrir Keret weaves a haunting, unforgettable saga of brave, broken women spanning a century of secrets and triumphs, unfaltering love and incredible loss, and the generation-spanning power of family.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CT629ZGT"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 4, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2938 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 270 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,373 in Kindle Store (See Top 100 in Kindle Store) #4 in Jewish Historical Fiction #6 in Historical European Fiction #8 in Historical Biographical Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 35 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Emily roth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH27NABC2Z5IEIZMB57HMNIL4IPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JBXSZVCNO7XY?ASIN=B0CT629ZGT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars A Masterpiece That Transcends Time: A Must-Read!",
                "reviewText": "Prepare to embark on an extraordinary literary journey with my grandmother's shadow , a true masterpiece that transcends the boundaries of time and genre. From the first page to the last, this enchanting work of art captivates the reader's imagination, leaving an indelible mark on the literary landscape.Author Devorah Shafrir Keret has crafted a narrative so rich, so spellbinding, that it effortlessly transports readers into a world where every word is a brushstroke painting vivid landscapes and every chapter unfolds like a carefully orchestrated symphony. The storytelling prowess on display here is nothing short of awe-inspiring.The characters are more than mere ink on paper; they are living, breathing entities that will linger in your thoughts long after you've closed the book. Each protagonist is meticulously developed, displaying a depth and complexity that adds layers of meaning to the overarching narrative. It's rare to find a book that so seamlessly blends character-driven storytelling with a gripping plot, but [Author Name] achieves this with finesse.The thematic richness of my grandmother's shadow is equally impressive. Themes of love, loss, resilience, and the human spirit are woven into the fabric of the story, creating a tapestry that resonates with readers on a profound level. The author tackles societal issues with a deft touch, offering insightful commentary that is both thought-provoking and relevant.The prose itself is a work of art. Devorah Shafrir Keret's writing is lyrical, evocative, and exquisitely crafted. Each sentence is a carefully chosen gem, contributing to the overall brilliance of the narrative. The author's ability to paint emotions with words is unparalleled, evoking a spectrum of feelings that will leave you breathless.Beyond its literary merits, my grandmother's shadow boasts impeccable pacing. The narrative unfolds at a perfect cadence, keeping readers on the edge of their seats while allowing moments of reflection. The plot twists are unexpected and masterfully executed, leaving you desperate to uncover the next layer of the story.In a market saturated with mediocrity, my grandmother's shadow stands tall as a shining beacon of literary excellence. Whether you're a seasoned reader or someone seeking an unforgettable introduction to the world of literature, this book is a must-read. It has the potential to become a timeless classic, a work that future generations will cherish and dissect for its brilliance.Don't miss the opportunity to immerse yourself in the magic of my grandmother's shadow. Purchase your copy now and experience the sheer brilliance of Devorah's storytelling. This is more than a book; it's an odyssey, a literary gem that will leave an indelible mark on your soul.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dean braun",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWRS5XNIB6TZPKBXO4HZBUWM7YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QMTOG6SSJC20?ASIN=B0CT629ZGT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Very emitional",
                "reviewText": "As well as historically correct. Just as real life stories are, it was impossible to predict what would be next. So good to hear the granddaughter of a Jewish woman who was both Jew and Catholic as she said it was a worthwhile task to find out what happened to her grandmother and that her mother seemed to find some peace, even in her dementia, in the thought that her mother did care.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NJEMJ50",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDDUYUOUFGANBK5DAYTGDUY77MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FK2361711KOA?ASIN=B0CT629ZGT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars A MUST READ FOR WOMEN!",
                "reviewText": "Since I was adopted, I completely understand one's need to find their roots, the chain of their ancestral history. This is a beautiful story about a family search that goes back prior to the holocaust in Germany and Israel. It is beautifully written, and can't be put down, once started. Take this beautiful journey. You won't regret one moment of it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sara Perez Ramos",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWPH3WYWPJ4WOODNNXUBF7YPG3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y4ATEIVFWU7B?ASIN=B0CT629ZGT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars What stroke me is the author's ability to blend historical events with a gripping narrative",
                "reviewText": "I'm a sucker for stories that transport me to another time, and Keret did it with finesse. The vivid portrayal of the past, combined with characters that felt incredibly authentic, made the novel a captivating experience. It's that perfect balance of history and storytelling that I absolutely love.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tonygol",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTBLGR6UV3HVDB3GHXNVTJ66J2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BFJ6AWXVZAWI?ASIN=B0CT629ZGT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars A Masterpiece",
                "reviewText": "This is easily the best book I've read over the past 30 years. Without spoiling it for the readers of this review, let me just say the author is super-talented and expertly weaves the story of her mother's family during the Holocaust and her quest to uncover the hidden family secrets. This is a true story, backed by archived documents from Latvia and Germany. I couldn't put it down and read it all the way to the end. Amazing job by the author. Highly recommended!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4ZHHYZMWY7GLUDBTNGXFF5FFDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6WNFVJU2KFCI?ASIN=B0CT629ZGT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars A fascinating story",
                "reviewText": "I read eagerly and could not put down the book \"My Grandmother's Shadow\" for a moment, it written with the skill of a veteran writer even though it is her first book.It is a fascinating story about the painful history of the writer's family and the human stories that take place in its shadow. Reading the book was a fascinating experience for me and its story continues to accompany me in my thoughts. Thanks to the writer for sharing her experiences and feelings.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reut brosh ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFR4LVTTY4J7DGOGMYQA2UQ2A55Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M8KWJFZW49VT?ASIN=B0CT629ZGT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book!!!",
                "reviewText": "Very interesting story, well written. I highly recommend it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B. Feinberg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3QZH4VKIFTD2JPNGM7YOBG4DDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OSAID658EGIA?ASIN=B0CT629ZGT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Delving into Past Mysteries to Discover Truth at Its Core",
                "reviewText": "My Grandmother's Shadow is an historical novel unlike any other I've read. The author writes from the vantage point of the present and methodically peels back layer after layer of family history against the backdrop of the Holocaust. As a young child, Devorah realized that she knew nothing about her mother's family, and every time she asked questions, she came up against a brick wall. Ultimately, as she grew into adulthood, she was able to discover a past that was unlike anything she could have imagined.My Grandmother's Shadow is fact-based fiction from Devorah's decades long search. This story is intensely compelling because the truths that are revealed take the reader beyond a story line and into the emotional landscape of three generations and shifting geography. Devorah is at the heart of the story because she persists in weaving together the details that seed her most authentic identity. The characters are human and relatable, the plot takes unexpected twists and turns, and the conclusion feels more like a new beginning than an ending. I heartily recommend this book for readers who savor the wonder of life stories and their legacies.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susanne Gebhardt",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 15, 2023",
                "reviewTitle": "Great insights into European-Jewish fate",
                "reviewText": "Great insights into European-Jewish fate....... Renate Price-Jahn, Germany. An authentic, fascinatingly written book , full of suspense starting in Riga. Lithania, then Leipzig, Germany, ending in Israel. From early childhood Devorah was puzzled by her mother's secret background. At seventeen she insisted to know her roots. Her mother pointed at a draw full of documents. Thus, together with Devorah, we learn about the horrific challenges her grandmother had gone through. Immensely exciting and informative, about suffering, love, reconciliation and human achievements.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 29, 2023",
                "reviewTitle": "Captivating book. I highly recommend reading!",
                "reviewText": "This book is hard to put down and very moving. I read it almost in one go. It is such a fascinating plot with an easy-to-read flow. It kept me curious, caught up, and thoroughly involved in this dramatic and sad story. The book is an incredible family saga, written from the point of view of the chain of three women of three generations of one family, inspired by the true historical story of the writer’s family over generations. It’s a lot about love, loss, and abonnement, about family secrets and layers of searching for truth and resolution.The book also provides an authentic glimpse into the complex and tragic life of Jewish people in Europe during World War 2, brought here so vividly to life, intertwining gently a wealth of accurate historical background. However, it is still an easy read as it gets the reader into the unique experiences, thoughts, and feelings of the three fascinating and complex women telling the story, and not put the historical tragedies and the holocaust as its focus.I truly recommend it. It is an excellent read if you enjoy historical fiction and family saga dramas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}