{
    "remaining_requests": 840,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Reluctant-Countess-Would-Be-Wallflowers-Novel-ebook/dp/B09TKYYZHD",
    "body": {
        "name": "The Reluctant Countess: A Would-Be Wallflowers Novel",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Reluctant-Countess-Would-Be-Wallflowers-Novel-ebook/dp/B09TKYYZHD",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81XIAvcH-mL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Eloisa James",
            "link": "https://www.amazon.com/Eloisa-James/e/B001H6U948/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2152,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09TKYYZHD"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Avon (November 29, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 29, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5190 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 380 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 006313957X"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#36,623 in Kindle Store (See Top 100 in Kindle Store) #411 in Women's Historical Fiction #810 in Regency Historical Romance #868 in Regency Romances"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,152 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "How to Be a Wallflower Wilde Child My Last Duchess My American Duchess Say Yes to the Duke ✓ ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aed99ab8-5782-45fc-80e8-012e7e7f3f2f.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b426e763-4f0c-4c26-b053-d7bc07c32eb5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d8faa7b7-6fb1-43e0-b859-41b201fafc23.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5cc48756-cbfc-4a54-920e-00e017da7068.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba7ed33a-f702-41dd-98f5-af3260909ca3.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/361fbff5-5a35-4cd1-8cc6-f1a473f9ed6f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c380d20-1faf-4820-9b22-155ac4a5a78a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffe4405f-791c-4a30-84c9-e0e460b0ef9b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/be806cd2-8d55-4579-8699-d29867579f04.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "M. Morgenson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWY7L46BAQC3THT5KPO5WAKCD3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q3ATAYNTTDZB?ASIN=B09TKYYZHD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2022",
                "reviewTitle": "5.0 out of 5 stars Sit back and enjoy the ride",
                "reviewText": "I always wait with great anticipation for an Eloisa James novel. And lately, they have been a breath of fresh air as much for what they are not, as for what they are. They are excellently written and beautifully edited. I don’t have to stop and try to parse misstated meanings or malaligned metaphors, or words that clearly do not mean what the authors think they mean. It is so easy on my English Lit majors mind to be able to just sink into a delightful world of the author’s creation and not be rudely jerked out of it periodically. And the historical accuracy is such that one feels at home in the setting. The details are exquisite without encumbering the story. And all this doesn’t even address the content of the story. I love that the author digs deep for her characterizations, not merely skimming the surface, and invests one into the characters. Yasmin and the Earl have a palpable attraction and seeing them learn about each other and themselves, exposing their strengths and flaws, and watching them grow as characters throughout as they navigate their society is a pleasure and a delight.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TracyJane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4XZXKYMBCASW7ESD2KPE2G7TQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3O8HR72FZB901?ASIN=B09TKYYZHD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2022",
                "reviewTitle": "4.0 out of 5 stars Keep an open mind, because based on early reviews - I expected to hate the hero and I didn't!",
                "reviewText": "Raised in the French court, Lady Yasmin Regnier is no stranger to gossip, after all, her own mother was Napoleon’s mistress and Yasmin herself was duped by a fortune hunter at the tender age of 16. She learned to hold her head high and ignore the whispers, but when it became too much to bear, she left France and went to live with her English grandfather, the Duke of Portbellow. While the whispers followed her to England, her connections and her beauty ensure that she is not lacking invitations or suitors. But not every man falls at her feet and unfortunately for her that includes the only man who has really piqued her interest, the grumpy Earl of Lilford, who clearly doesn’t approve of her, yet always requests the first waltz, then barely speaks to her as they dance, and then ignores her after they finish. She wonders what it is about the earl that intrigues her so and what will she have to do to make him smile.Giles Renwick, the Earl of Lilford hates that he is attracted to Lady Yasmin, she is completely wrong for him, but she makes him burn in a way that no woman ever has. He allows himself only one dance with her but seethes watching the other men dance and flirt with her, all the while telling himself that she could never be his countess. After the scandals created by his parents, Giles sets himself to a higher standard and would never do anything to tarnish his family name or endanger his younger sister’s reputation. And though she is beautiful, connected, and rich, Lady Yasmin’s reputation and manner are all wrong for him, not to mention his sister, Lady Lydia, clearly despises her and has repeatedly warned Giles to stay away from her. But even knowing all that, Giles can’t seem to walk away and soon finds himself trying to convince a reluctant Yasmin to marry him.As always, Eloisa James delivers another well-written, nicely-paced story populated by wonderful characters. After reading the reviews for this title, I really didn’t expect to like it, but personally, I didn’t find Giles as nasty as he was portrayed in the reviews, that is not to say he wasn’t a first-class jerk to Yasmin, but neither was he the anti-hero I was expecting. Yes, he was condescending. Yes, he was rude and insulting at times. Yes, he allowed himself to be manipulated by his vile sister. But he does see the error of his ways and while he didn’t really grovel, he does apologize. So while it was not perfect, this story kept me turning pages and was filled with emotion, steamyish love scenes – that don’t all end with a satisfied heroine LOL, great secondary characters, a bit of drama, and finally a HEA with TWO epilogues. In the end, I enjoyed the story, but I was left wishing there had been a bit more follow-up with his sister and I am keeping my fingers crossed for a HEA for Silvester, the Duke of Huntington. This is the second book in the series and has ties to “The American Duchess”, but it can absolutely be read as a standalone title.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "janice shanks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIHRNK723YNKS5BB55N6WLJQVDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39DKGWMQ5T2IC?ASIN=B09TKYYZHD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "5.0 out of 5 stars great story",
                "reviewText": "Checked it out from the library but liked it so much that I decided I had to have my own copy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ldowns",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFESJQWFRJ23MY3P56OURU2X3ZVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H9246586NPNQ?ASIN=B09TKYYZHD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Book was in excellent condition! Fast delivery.",
                "reviewText": "Reading pleasure",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXAAFVZ556CQTE6KH52QQPFD5YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JKG60X7C6R68?ASIN=B09TKYYZHD",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 18, 2023",
                "reviewTitle": "3.0 out of 5 stars A sexy romance with likable characters",
                "reviewText": "This was an OK book with likable characters and LOTS of sex scenes. I preferred the first book in the series but did like the situation these 2 characters got in and how the situation was resolved. A nice book to read on a lazy weekend. Has made me interested in the next book in the series, which should be with Silvester and the lady with the freckles and glasses.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheila M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEKDE4QV6FQYX4JVAPAQQCV2D6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UT43DQKNAE07?ASIN=B09TKYYZHD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2022",
                "reviewTitle": "4.0 out of 5 stars Great Addition to the Series",
                "reviewText": "FINAL DECISION: I enjoyed this book because Yasmin is so resilient, and I loved how she stands up for herself despite the approbation of society and even Giles at times. I loved how Giles's love for Yasmin transforms him and how he struggles with his societal expectations. This book manages to be sweet and hot at the same time.THE STORY: Giles Renwick, Earl of Lilford, is undone by Lady Yasmin Régnier. Yasmin is everything he could want in a wife, except that her dress and her behavior, and her history are not what he sees as proper. That makes her ineligible for consideration as his countess, but he can't stop wanting to spend time with her. Yasmin has a past and is determined to be strong in the face of the disapproval of British society and Giles. Giles is too stuffy and judgemental, yet Yasmin finds that Giles constantly exceeds her expectations.OPINION: This book is so much more serious than the initial setup appeared to portend. Yasmin and Giles have to learn to speak to one another about their fears and dreams. There was so much I loved about this book, but I really couldn't stand Gile's sister, who just drove me crazy for the entire book. I understand that she is hurting as well, but being hurt doesn't give one the privilege of hurting others.Despite this, however, I really did love the characters as they worked out their relationship with one another. There was something incredibly romantic about how Giles is completely undone by Yasmin and realizes that he has to change to have what he wants. He begins so judgmental but realizes that he is wrong. So rarely does a hero contemplate his own actions and realize that he was wrong without having an extremely dramatic situation. I ended up loving Giles because he is willing to change to be worthy of Yasmin. Those changes are about mindset and attitude and about his judgments rather than something external to himself. While the reader understands why Giles is the way he is, it is understanding rather than justification.I really loved Yasmin, who has taken the roughest part of life and made something sparkling and joyful for herself. That is why Giles falls for her and why I like her as well. So much in life could have struck her down and destroyed her, and yet she remains positive about so much.I think I really have a thing for the grumpy hero and the ray of sunshine. This book has some of that and yet upends all expectations of that trope. Giles is not as grumpy and reserved as he appears, and Yasmin has depth and real pain in her life.WORTH MENTIONING: I can't wait to read Silvester's book. He is adorable in this one.CONNECTED BOOKS: THE RELUCTANT COUNTESS is the second book in the Would-Be Wallflowers series. The romance here is self-contained, and there is no overarching storyline, so that this book can be read as a standalone. There are appearances, however, by characters from the series.STAR RATING: I give this book 4 stars.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heidi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2JSLEFA4MH42GNI4SDHXC6Y4YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HTL7UVUE296N?ASIN=B09TKYYZHD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Arrived in good conditions",
                "reviewText": "The media could not be loaded. Haven't readBut it came in good conditions. Looks promising",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dc0ec8d7-c6a5-4d69-8c77-d2be612e0f44/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Fernando",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 7, 2023",
                "reviewTitle": "One of her good ones.",
                "reviewText": "I've been a fan of this author for a long time and have many of her books bought over the years. It was nice to go back and read them again. This one too is one of her best.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jane Doe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 26, 2023",
                "reviewTitle": "A 'modernized', and not returnable version of the Regency era.",
                "reviewText": "In boring detail, the story describes the trials and tribulations, the back and forth, the two main characters, the Duke and French beauty Yasmin, had to get through until its predictable and rather soppy end.But none of it contained the fun or humor, promised in the novel's description, except the porn, enlivened by the Dukes spectacular member, reaching from its root up to his navel when aroused, thoroughly fascinating Yasmin, as well as the author, in all probability.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 3, 2022",
                "reviewTitle": "My heart is full!!!",
                "reviewText": "Such a lovely story... I didn't want the book to end! Loved every page... Giles and Yasmin are simply perfect! Must say that Lydia really got on my nerves! But so many interesting characters that I hope we will have the chance to meet in more detail. Simply beautiful! A must read!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mercyferry",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 31, 2023",
                "reviewTitle": "Nothing new.",
                "reviewText": "I have loved Eloisa’s books since I found the desperate duchesses series. This one was so disappointing. The first few chapters were interesting, but too soon Yasmin’s backbone and self respect plunged to the depths. The trope of enemies to lovers has been played out too many times now and I feel Eloisa is becoming as bored of her books as I am. I couldn’t finish the first of this series, the heroine annoyed me too much, but I had hopes that had been a one off and this seemed like it was back on form. I was wrong. Yasmin was a weak as watered water, and the duke, with his magical member and muscled thighs was no different to any of her other ducal heroes. I am fast running out of go to Georgian and regency authors, and I can practically recite my Georgette Heyers. All I want for Christmas is an intelligent regency romance.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sonja Corterier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 12, 2022",
                "reviewTitle": "I couldn't really get into it",
                "reviewText": "Not my cup of tea. Probably a question of personal taste rather than quality. I really hate these premarital sex stuff in historical romance. Back then it was irresponsible to the extreme",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}