{
    "remaining_requests": 981,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Saints-Swallow-Hill-Donna-Everhart/dp/1496733320",
    "body": {
        "name": "The Saints of Swallow Hill: A Fascinating Depression Era Historical Novel",
        "price": "$9.59$9.59",
        "originalPrice": "",
        "rawPrice": 9.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Saints-Swallow-Hill-Donna-Everhart/dp/1496733320",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81qYyfUILxL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Donna Everhart",
            "link": "https://www.amazon.com/Donna-Everhart/e/B01LLQR8QA/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 14262,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for The Saints of Swallow Hill“The distinctive setting of the turpentine camps in the South during the Great Depression will make an imprint on readers, just as the characters of Rae Lynn and Del do. Fans of Sarah Addison Allen won't be able to put it down.” —BooklistPraise for Donna Everhart's Southern Fiction\"Rousing...movingly explores Jessie's struggle with her eating disorder, viscerally describing her twin desires for nourishment and purging in relation to a deep need to define herself...Everhart's story of self-discovery, rife with colorful characters and a satisfying twist, will thrill readers.\" —Publishers Weekly, STARRED REVIEW for The Moonshiner's Daughter\"This riveting novel set in the 1960s will have readers, especially those who enjoy Kaye Gibbons and Anna Jean Mayhew, captivated from the first page.\" —Booklist, STARRED REVIEW for The Moonshiner's Daughter\"Highly engaging and fast-paced with well-drawn out characters...the glimpse into this landscape and the moonshining underground is equal parts eye-opening and fascinating. Everhart handles Jessie's eating disorder with grace and compassion. The book also explores family loyalty and legacy. There's a lot to digest, and all of it makes for a compelling reading experience.\" —The Historical Novels Reviewon The Moonshiner's Daughter\"Reminiscent of the novels of Lee Smith, Kaye Gibbons, and Sandra Dallas, Everhart builds a firm sense of place, portraying the tiredness and hope of a dry southern summer and voicing strong southern women.\" —Bookliston The Forgiving Kind\"Set in 1950s North Carolina, this touching and fearless novel is a coming-of-age story about a young heroine determined to survive and pursue justice out of love for her family.\" —She Reads on The Forgiving Kind\"This story of survival and perseverance is heartbreaking and hard, but the ways the characters in the book choose family and hope lead them on paths they would never expect. Laci brings a bright spot to the family when she uses her fiddle to express her deeper thoughts and feelings while adding a magical component to the family's singing group, The Stampers...Everhart creates a signature style by writing in the voice of the main character, a young Southern girl, telling the story from her perspective. Her voice remains true throughout the novel, successfully engaging the reader.\" —The Missourian on The Road to Bittersweet\"Everhart is a good storyteller and makes her characters and their experiences come alive.\" —Booklist on The Road to Bittersweet\"An adventure story and coming-of-age story wrapped into one satisfying package... Donna Everhart skillfully evokes a harsh landscape and harsh times, squarely placing the reader in Appalachia right along with the family. Wallis Ann's complicated relationship with her sister is well explored and serves as a catalyst for her growth into a mature young woman.\" —Historical Novels Review on The Road to Bittersweet\"With gravitas and heart...Donna Everhart does a deft job of writing about innocence lost.\" —Business Insider, Insider Pick for The Education of Dixie Dupree\"This is a dark, haunting book that will linger with you for days, but despite the heaviness of the book, Dixie is a witty, charismatic burst of energy and sunshine who readers will want to rescue themselves. A remarkable story of the triumph of will, and a great coming-of-age novel.\"—Historical Novels Review on The Education of Dixie Dupree\"[A] harrowing coming-of-age novel set in Alabama...Readers will be drawn to Dixie, who is full of spunk and grit.\" —Bookliston The Education of Dixie Dupree“Please open your heart to Dixie Dupree. With unflinching honesty and a voice that rings with authenticity, she survives the unthinkable. Her story celebrates the resiliency of the human spirit and the triumph of the imagination. An important novel, beautifully written, this is a story to cherish.” —Susan Wiggs, #1 New York Times bestselling author on The Education of Dixie Dupree “Young Dixie Dupree is an indomitable spirit in this coming-of-age novel that is a heartbreaking and honest witness to the resilience of human nature and the fighting spirit and courage residing in all of us.” —The Huffington Post on The Education of Dixie Dupree“In a powerful coming‑of‑age story that pitches southern charm against dark family secrets, the voice of 11‑year‑old Dixie Dupree captivates from the first page to the last.” —Barbara Claypole White, bestselling author of The Perfect Son on The Education of Dixie Dupree About the Author Donna Everhart is a USA Today bestselling author known for vividly evoking the challenges of the heart and the complex heritage of the American South in her acclaimed novels When the Jessamine Grows, The Saints of Swallow Hill, The Moonshiner’s Daughter, The Forgiving Kind, The Road to Bittersweet, and The Education of Dixie Dupree. She is the recipient of the prestigious SELA Outstanding Southeastern Author Award from the Southeastern Library Association and her novels have received a SIBA Okra Pick, an Indie Next Pick, and two Publishers Marketplace Buzz Books selections. Born and raised in Raleigh, she has stayed close to her hometown for much of her life and now lives just an hour away in Dunn, North Carolina. Please visit Donna Everhart online at DonnaEverhart.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 3 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Where the Crawdads Sing meets The Four Winds as award-winning author Donna Everhart's latest novel immerses readers in its unique setting—the turpentine camps and pine forests of the American South during the Great Depression. This captivating story of friendship, survival, and three vagabonds' intersecting lives will stay with readers long after turning the final page.It takes courage to save yourself...In the dense pine forests of North Carolina, turpentiners labor, hacking into tree trunks to draw out the sticky sap that gives the Tar Heel State its nickname, and hauling the resin to stills to be refined. Among them is Rae Lynn Cobb and her husband, Warren, who run a small turpentine farm together.Though the work is hard and often dangerous, Rae Lynn, who spent her childhood in an orphanage, is thankful for it--and for her kind if careless husband. When Warren falls victim to his own negligence, Rae Lynn undertakes a desperate act of mercy. To keep herself from jail, she disguises herself as a man named \"Ray\" and heads to the only place she can think of that might offer anonymity--a turpentine camp in Georgia named Swallow Hill.Swallow Hill is no easy haven. The camp is isolated and squalid, and commissary owner Otis Riddle takes out his frustrations on his browbeaten wife, Cornelia. Although Rae Lynn works tirelessly, she becomes a target for Crow, the ever-watchful woods rider who checks each laborer's tally. Delwood Reese, who's come to Swallow Hill hoping for his own redemption, offers \"Ray\" a small measure of protection, and is determined to improve their conditions. As Rae Lynn forges a deeper friendship with both Del and Cornelia, she begins to envision a path out of the camp. But she will have to come to terms with her past, with all its pain and beauty, before she can open herself to a new life and seize the chance to begin again.“Fans of Sarah Addison Allen won't be able to put it down.” —Booklist",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Kensington (January 25, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1496733320"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1496733320"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.43 x 1.02 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,662 in Books (See Top 100 in Books) #24 in Southern Fiction #178 in Family Saga Fiction #224 in Family Life Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 14,262 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d578f061-92f5-4164-9ffc-1abbfe409e2f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Linda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZKQYTEHKMDCFQ336BWDQE3RFKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CRC780X7SB1P?ASIN=1496733320",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Swallow Hill",
                "reviewText": "At first it was a slow read. But as I read it became very interesting and by the end it was so worth the read. A great love story amongst all the heartache and tragedies. Well worth reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H. Roberts",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4UXTJTYGX5ROLPOPVL2HQ227IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RNACYZCWWDCK?ASIN=1496733320",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars So close",
                "reviewText": "Overall, I enjoyed this book. The character development and imagery were fantastic and I could see the story as I read it. That being said, it felt like it was missing about another 100 pages as there was an abrupt shift and the last four or so chapters felt as though they were disconnected from the rest of the book. The ending lacked the same care of story development as the rest of the book and felt flat in comparison. This was a fantastic read to start the new year, and it was so close to being great, but ultimately is just really good.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDKFJ3JJLYSZQ4UXZ2OGDXDCPTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DQNZ4HFQT2MT?ASIN=1496733320",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars A Gripping Depression Era Story",
                "reviewText": "I couldn’t put this book down. I was startled at times at surprising events. I laughed cried and was sad about the meanness around The swallow Hill camp. But the ending was the sweetest part. Read this book. It’s really a great story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter R. Nichols",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMUHRL4F5MLDUZS5XNVSD2TLOMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X7BACI6KSIX4?ASIN=1496733320",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Sadness and Heart",
                "reviewText": "A very special story, sad for much of it but written with heart, and crowned in heart. Clearly much of the events are true in essence. I found myself angry during much of my reading. Angry that such events could have been allowed to take place. The author, Donna Everhart, writes well, with a mixture of stark portrayal and compassion. I learned about the labor intensive and physically exhausting turpentine industry, and I loved the author's snippet descriptions of the trees and other elements of nature surrounding her story.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZRLOTA3OEYRBITRVFMOJXS5VZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37PZD2QE52DZM?ASIN=1496733320",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Unusual subject",
                "reviewText": "Writing style was a bit slow for me. I will read other books by this author, though. Appreciate author’s interest in historical subjects and also her ability not to “sugarcoat.”",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Owens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4CE4EESHCCNOGMFUVR3HG3AZQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18V0MH3P7WVJ9?ASIN=1496733320",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "3.0 out of 5 stars It’s Okay",
                "reviewText": "I liked the book okay. One of the main characters “Del” seemed like two different people. Beginning like a womanizer and basically someone who does not seem to have morals. Then suddenly he is the most moral person on Earth. I’m not sure why the author needed to bring up his ED issue. Just seemed it could have been so much better with the subject matter and I really liked the historical era. I wanted deeper and better character development of Del. He seemed like two people.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Sparks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTHT65CFNFY67U7YOCDV7QGZWFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SYC6PVH4SJGK?ASIN=1496733320",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Incredible tale",
                "reviewText": "Truly this was a masterful and skilled literary tale of the highest quality. It should be on everyone's reading list.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Patterson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUJROGKG7ID5JX3AQMMI6WQB6QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4MGJ30YR0A0K?ASIN=1496733320",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "4.0 out of 5 stars Hard times",
                "reviewText": "Working through the thirties at a camp where the sap was used to make turpentine was hard. It seems as if you working but never got ahead enough so you could leave the camp. You owed money to the man and the grocery store.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 15, 2023",
                "reviewTitle": "The Saints of Swallow Hill",
                "reviewText": "Good novel,,, if only 1/3 of this is true,it is a horrific industry,,Rae Lynne was married to a man who took too many chances,And refused to seek medical care, she meets Del while working in aturpentinecamp",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grandad bob",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 27, 2023",
                "reviewTitle": "Good read that keeps one interested throughout",
                "reviewText": "Really enjoyed my sort of book well writen, my wife has also read it and feels the same would recommend to other readers",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenny Sayell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 30, 2022",
                "reviewTitle": "Turpentine",
                "reviewText": "I liked finding out what life was like for \"tar heels\". The storyline and charactes were strong, too... an entertaining book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JackiSprat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 25, 2023",
                "reviewTitle": "Turpentine History",
                "reviewText": "What a vivid picture of the rough life during The Depression. I had no idea of the history of the Longleaf Pines and Turpentine production.The story unfolds chapter by chapter with two people Del Reese and Rae Lynn Cobb recounting their experiences working at Swallow Hill. A dilapidated turpentine farm. Two of the men working there are terribly abusive and have no respect for human life or human rights.Del watches out for Rae as best he can until things come to a head one evening.It’ll take all they can do to survive.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 27, 2022",
                "reviewTitle": "unputdownable",
                "reviewText": "I’m sad to have finished this book ..I’ve enjoyed it so much and really feel I know the characters and am reluctant to let them go.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}