{
    "remaining_requests": 974,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Oil-Marble-Novel-Leonardo-Michelangelo/dp/1628729066",
    "body": {
        "name": "Oil and Marble: A Novel of Leonardo and Michelangelo",
        "price": "$14.99$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Oil-Marble-Novel-Leonardo-Michelangelo/dp/1628729066",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Prb0eA8dL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Stephanie Storey",
            "link": "https://www.amazon.com/Stephanie-Storey/e/B01HWB4QUO/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 6473,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 2 mins",
            "FREE delivery Monday, February 26 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Arcade; Reprint edition (June 19, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1628729066"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1628729061"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 14.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20,685 in Books (See Top 100 in Books) #14 in Artist & Architect Biographies #32 in Art History (Books) #80 in Biographical Historical Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 6,473 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Charles Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMSFDF4URKWUW4KYCOGURAQ2VJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V6G9JDAAQ6M?ASIN=1628729066",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2019",
                "reviewTitle": "5.0 out of 5 stars The rich, powerful, and influential beat a path to the famous artist's doorstep.",
                "reviewText": "Oil and Marble, written by Stephanie Storey, published in 2016, is a novel taking place during the years 1499 to 1504, presumably when the artists, Leonardo de Vinci and Michelangelo Buonarroti, most likely crossed paths, which was generally during the time period when they both lived and plied their trades in Florence, Italy. Along with being able to follow two amazing, interwoven story-line threads, about the personal lives of the two artists, the reader is treated to a the gradual unfolding of a fascinating fabric blend, a tapestry of culture, art, and art history. He learns first-hand that what's involved in creating a masterpiece is a vastly different from what goes into making a great classic Bologna sandwich, for example. Back in the 1500's in Italy, the local craftsmen weren't cranking out paintings or statues on anything remotely resembling a Ford mass-production assembly line. Instead, they made them individually, one at a time, and the results were generally considered original works of art. There is a certain amount of genius that went into writing this novel. The author compares and contrasts the personal lives of the two great artists, Leonardo and Michelangelo, as well as the significant features of their two principal art mediums, the oil painting and marble statuary. For me, the riddle of the ages lies in resolving the impetuousness, raw muscular strength, and unbridled passion of youth with the patience, cleverness, and wisdom of old age. You might just as easily compare photography and taxidermy. An unusual comment to make? Suffice it to say that most mid-western people around here would be more inclined to go to a \"Bass Pro\" shop or \"Cabelas\" to see the nature exhibits than to travel the great distances involved in a trip to the \"Metropolitan Art Museum,\" or other such venues, in order to view abstract art they don't understand. By in large, many relate more directly to wild animals in their natural settings, even if the larger, more dangerous animals are stuffed, in my opinion. Plus, they really appreciate seeing live fish in clear-running streams as part of the exhibits, and the aquariums. And the harmless little creatures, such as chipmunks, scurrying around. Similarly, they would have a greater tendency to turn to the local newspaper to see photographs of local athletes in the sports pages and young ladies and gentlemen dressed up in gowns and tuxedos in the society pages, rather than viewing paintings or pottery at an art gallery. Plus, they can always go to a formal or family photograph studio for portraits of their loved ones. As for the artists, themselves, in the novel, I didn't think Leonardo would do anything too incredibly foolish or take unnecessary risks, being the older, wiser, and more established of the two. I half expected Michelangelo would be the one who might get his \"ass kicked\" for making smart remarks to the \"football team\" after school. It is worthy of mention that gossip, rumor, innuendo, speculation, and conjecture often works just as well in a novel, as the truth. Be that as it may, I definitely learned more than a few details about the artists and their subjects that I never knew previously or realized before reading this book. I've finally concluded that a certain fundamental process must be involved in completing the work of any great artist. The famous artist creates a masterpiece. The rich, powerful, and influential beat a path to his doorstep, trying to capitalize on it. The process is plain and simple. Even better, when there's an interesting story to tell, behind the painting or statue. For instance, I see Leonardo searching his entire life trying to discover the perfect photographic mental image for the supreme subject of his art. Perhaps he is deeply in love for the first time in his life, yet harbors serious, lingering doubts and misgivings. At their last portrait meeting, he stares at her for the longest time. Ramona Lisa notices and says softly, \"Why don't you just take the picture. It will last much longer.\" The statement is a form of reality check. \"How true! Your husband would only lock it away in his private library, or put it in a walk-in closet for safekeeping,\" replies Leonardo. He becomes reflective and has gone on the defensive. \"What he enjoys most is how little the painting resembles me, his wife. He already knows that he can easily re-sell the woman of mystery to the highest bidder for a tremendous fortune.\" She is merely being practical, not at all vain, about the investment opportunity. In stark contrast, I see Michelangelo at the unveiling of his wondrous marble statue. He's been thinking, \"I have finally become a highly successful and respectable member of society. Never again shall I be beaten down, bullied, harassed, cajoled, and intimidated. Never again will my character be dragged through the mud, and besmirched.\" His illustrious career has been catapulted into stardom by a mere mortal man carrying a crude sling-shot. When we were kids, we called it a bean-flip. R. Royce observed the lone buffalo standing tall on the ridge. In a moment the statuesque creature would be gone. His instinct was to migrate. Instead, a large-caliber rifle slug hit him broadside. Then another. The rifle report had cracked and echoed. The first bullet caused him hesitate for an instant. The second bullet stopped him in his tracks. He knew immediately from the impacts that he had been seriously injured. He was no doubt grievously wounded. He toppled suddenly and fell heavily sideways onto the tall prairie grass. Dead. He'd been shot once through the heart. Once in the massive shoulder muscle. His eyes clouded over and grew increasingly dull, as he lay where he fell. Soon, a large, dually flat-bed pickup truck with two occupants drove toward the buffalo. They didn't see Royce. They came to claim their kill. He wasn't particularly angry or annoyed. He only wanted to see if the two young cowboys had the required hunting permit. They did. \"Good shot,\" said Travis. \"Expert,\" said Cody. They began to winch the animal carcass onto the heavy-duty flat-bed truck, when Royce walked up out of the trees. \"Greetings, fellows,\" said Royce, friendly like. \"Looks like you bagged yourself quite a trophy.\" \"We definitely won the lottery with this one,\" said Travis. \"Are you the game ranger?\" \"No, just an interested by-stander. Some friends and I are moving part of the buffalo herd from here to a state preserve in Nebraska. They want to increase the numbers to the herd already existing there,\" said Royce. \"Well, you won't be moving this one,\" said Cody. \"We've got the official permit. We're taking the hide to the taxidermist and the meat to Valentine's meat market in Manhattan, near Fort Riley. The rest is going into the freezer for the top-sirloin restaurant in town.\" \"May I see the hunting permit?\" asked Korn, politely. He'd just walked up. We have to protect our own business interests. We wouldn't want anyone to accuse us of rustling, or shooting buffalo without a valid permit.\" \"This is my good friend and business associate, Cornelius Korn,\" introduced Royce. \"Perfectly understandable,\" said Travis. \"He handed him a copy of the serially numbered document.\" \"Thanks,\" said Korn. \"See any other buffalo in the vicinity? We're looking to round up six or eight more.\" \"There's a creek in the valley over the next hill to the west of here. Some of the herd likes to graze near there,\" said Cody. \"None are as big as this one, though.\" \"That's just fine with us,\" said Royce. \"It makes them easier to transport to their new habitat.\" \"Are you driving them, or loading them into semi-trucks for the trip?\" asked Travis. \"No. That's way too slow. We'll put them on military aircraft, either fixed-wing C-130 or C-141; or heavy-lift helicopters.\" \"You're with the military, then?\" asked Cody. \"Independent private contractors,\" said Royce. \"They've given us permission to use their assets and resources.\" \"If you need a job, sometime,\" said Korn. \"you can look us up.\" He handed them each a business card. \"Midwestern Buffalo Wings?\" asked Travis. \"Not to be confused with the restaurant chain often seen advertised on television during football season,\" said Royce.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patricia Ibarra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2QJOD3JXNKFPRNL4ZA353JGBUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19CUZFQOKMWWV?ASIN=1628729066",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "4.0 out of 5 stars The personality of two geniuses",
                "reviewText": "While it is a novel about the dislike that existed between Michaelangelo and Leonardo da Vinci, it involves in-depth research by the author and is based on actual facts. Both artists lived in Florence at the same time. They were fierce rivals in the contest to win the Duccio Stone, a very large marble block perfect for a statue. In this novel we learn how each of these great artists managed to create their greatest works of art, the David and the Mona Lisa. We learn a lot about the way of living in those times and about the character of these geniuses, their families, their aspirations, and their personal issues, and as usually happens with artists, they were certainly never easy to deal with. I felt as I were watching the artists at work.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert P Gelms",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHWGKPST5YZ6CWYDAQP23ENKB2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27X0FXK7ZKNQP?ASIN=1628729066",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2016",
                "reviewTitle": "5.0 out of 5 stars Renaissance Men",
                "reviewText": "BFF…….NOTBy Bob Gelms It would be four years that would change the world of art forever, 1501 to 1504. Those four years in the city of Florence are inspected in a most entertaining way by Stephanie Storey in Oil and Marble: A Novel of Leonardo and Michelangelo. When she writes about history she is right on the money and when she writes of the relationship/competition between the two men, she puts wonderful words in their mouths and brains. This, I guess, you could call an historical novel and I haven’t had this much fun reading a novel in a very long time. The years she covers in the book and the lives of the two men during those years in Florence are really mind-boggling. Both Leonardo da Vinci and Michelangelo Buonarroti were from Florence and for these four years they lived and worked almost side-by-side in their hometown, barely putting up with one another.By all accounts Leonardo was good looking, charming and the life of the party. At 50 years old he was nearing the end of his career. He had achieved fame the likes of which no other artist had come close to. He was the most famous artist in the world and the original model for the concept of Renaissance man. Michelangelo, however, was in his mid twenties and just at the start of his career. He was an arrogant, self-serving and temperamental man who was bursting at the seams to make a name for himself. Michelangelo infuriated Leonardo. For his part Michelangelo detested and admired the old man. Their relationship, if you could call it one, was tempestuous. They both came to Florence in 1501 because the city owned the largest block of white marble ever quarried. City fathers wanted to have a sculpture that would symbolize the city and represent the people of Florence’s commitment to art. Artists from all over Europe applied, but everyone knew the commission would not get past Leonardo, who was favored, or Michelangelo, who had just completed his first major commission for the Vatican, Pieta, the stunning world-famous sculpture of the Blessed Virgin holding her son’s body after he was taken down from the cross. It’s just incredible to think that he carved it when he was 26 years old. The two men went before the city fathers to make their case and the committee awarded the commission to Michelangelo. Leonardo had a meltdown – he himself expected to get the job. After all, that’s why he returned to Florence in the first place. Now this creature, this upstart had somehow stolen it from him. Something had to be done and right away. To save face Leonardo needed a commission and a big one, fast. He was taken with a lady he had seen around town. Actually he was a little fixated on her. Asking around, he found out she was married to a wealthy silk merchant, Francesco del Giocondo. Her name was Madonna, but everyone called her Lisa.Leonardo set up a meeting with Francesco and convinced him to bestow a commission on the great painter to do a portrait of his wife. Da Vinci was a perfectionist and spent a lot of time planning, drawing sketches, mixing his own paint and preparing to, as he confidently told Francesco, “create for you a masterpiece.” He worked for years on it but when it was finally finished Francesco seemed to be underwhelmed. So Leonardo took back the painting, which needed a name. Madonna Giocondo would not do. The contracted form of Madonna is Mona and so the painting became the Mona Lisa. Across town Michelangelo had finished his colossus. It, you may have guessed, was Michelangelo’s David. Historians and artists throughout history view it as the finest sculpture ever created and Michelangelo wasn’t yet 30 years old. It was only his second major commission. The two most famous pieces of art were created in the same town at the same time by two Renaissance men who couldn’t stand one another. Ms. Storey tells a story in the book that I hope is true because something like it is sure to have happened: Pope Julius II sent a representative to the unveiling of David in Florence to gage Michelangelo. David had overwhelmed the crowd as it still does today. The Pope’s emissary made his way to Michelangelo, introduced himself as representing the Pope and told the sculptor that he should clear his schedule because he could very well expect to be hearing from the Pope very soon. “Oh yes, I must ask you, how do you feel about painting a ceiling.”Get this book and read this book. Oil and Marble: A Novel of Leonardo and Michelangelo by Stephanie Storey.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "glenda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5D2AZU5QBVYKRORWNDUA5QKCPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB8IBEW7XQ8AI?ASIN=1628729066",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Interesting novel",
                "reviewText": "Book in excellent shape, delivered on time",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 1, 2023",
                "reviewTitle": "Oil & Marble",
                "reviewText": "Fabulous book beautifully written. A real joy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paulino Estevez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 15, 2023",
                "reviewTitle": "Mis libros sobre todo el de oil and Marble",
                "reviewText": "Libro hermosísimo!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 26, 2022",
                "reviewTitle": "Amazing read!",
                "reviewText": "Loved loved loved this book. I have always been a fan of Michelangelo's work. After this book, I think I can appreciate Leonardo Da Vinci too. For someone who is not an art or history student but enjoy's them none the less, this book did wonders explaining or rather weaving the their life, its eccentricities and life's work in a way that no one can ever forget. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ann Victoria Roberts",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 19, 2021",
                "reviewTitle": "A compelling tale of life & art",
                "reviewText": "Anyone who has an interest in art will find this book a fascinating read. The author has certainly done her research into the lives and backgrounds of both Michelangelo and Leonardo da Vinci, giving them three-dimensional form and completely believable characters. Whether they were really like that in life, no one will ever know, but their story, told in alternate chapters, is a real page-turner, with a truly great ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexander Gardics",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 15, 2021",
                "reviewTitle": "awful",
                "reviewText": "Very bad writing, very contrived, both artists (especially Leo) were depicted as idiots. Such a shame. The writer does not have a sense for giving a realistic character to the protagonists and the invented events and dialogues are clumsy. Even I could do what she does, which tells a lot about her writing. Certain chapters almost made me vomit so I had to stop reading. Has the author ever read any treatise or made any kind of contact with Leo's mind through his notebooks? This book witnesses the fact that she doesn't actually know the person, the character she is writing about. I am not saying that Leonardo should be portrayed as a saint, because saint he certainly wasn't (he had his own weaknesses), but through reading his notebooks we come to realize that his mind was sophisticated, his character subtle. Besides being vegetarian, he even used to buy birds at the marketplace in order to set them free, which is a beautiful picture of the person he was. Overall, the author is definitely not Irving Stone, not even close. I really regret paying money for the book, what a waste...(If you want to have a genuine experience of Leonardo, read his Biography by Walter Isaacson instead, and if you are interested in Michelangelo, I recommend Agony and Ecstasy)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$21.51",
                "sellerName": "GrandEagleRetail",
                "sellerRating": "4.5"
            }
        ]
    }
}