{
    "remaining_requests": 866,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Project-Duchess-Dynasty-Sabrina-Jeffries/dp/1420148559",
    "body": {
        "name": "Project Duchess (Duke Dynasty)",
        "price": "$5.98",
        "originalPrice": "$7.99",
        "rawPrice": 5.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Project-Duchess-Dynasty-Sabrina-Jeffries/dp/1420148559",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "Only 20 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81qVy63TGJL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sabrina Jeffries",
            "link": "https://www.amazon.com/Sabrina-Jeffries/e/B001ILFM1W/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 4025,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Zebra (June 25, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Mass Market Paperback ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1420148559"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1420148558"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 5.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.14 x 0.77 x 6.73 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#86,884 in Books (See Top 100 in Books) #2,833 in Women's Domestic Life Fiction #3,182 in Regency Romances #7,184 in American Literature (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 4,025 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TracyJane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4XZXKYMBCASW7ESD2KPE2G7TQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GIMS9XOL0TZ8?ASIN=1420148559",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2019",
                "reviewTitle": "5.0 out of 5 stars 4.5 Stars rounded up",
                "reviewText": "When Fletcher “Grey” Pryde, Duke of Greycourt’s cousin Vanessa comes to visit him he learns two things, one his aunt is still intent on him marrying Vanessa, much to his and Vanessa’s disgust and two his mother has been widowed yet again. At his mothers’ request, he immediately leaves London and heads out to Armitage Hall.Beatrice Wolfe, is cousin to Sheridan Wolfe, the new Duke of Armitage. She is at the hall helping with the funeral arrangements for her uncle Maurice when Grey arrives and immediately sets her temper off. For his part, Grey is intrigued by the plain speaking Beatrice and would love to argue with her, but he needs to see his mother and get some answers from Sheridan. Beatrice and her brother Joshua live in the dower house, they were orphaned when Beatrice was only 10 and they were taken in by her grandparents, soon after Joshua joined the army and only returned a few years ago, injured and much changed. Beatrice had tried to be helpful to her aunt Lydia (Grey’s mom) and the duchess has decided that Beatrice needs a season and Beatrice hopes to find a husband and finally some security in her life. She is surprised by her reaction to Grey, but is cautious, she has heard rumors of his debauched life and knows better than to pine after a man so far above her in station.His mother is overcome with grief and very happy to see Grey, she wasn’t sure he would come as he has ignored his family in the months since they returned to England from Prussia. His step-father was an ambassador in Prussia and only returned to London when his brother “Armie” died and he inherited the duchy. His mother was married three times and had five children, three of her sons are dukes – Grey, the Duke of Greycourt is her eldest, Marlowe is the Duke of Thornstock and Sheridan is now the Duke of Armitage, she also has a daughter Gwyn (Marlowe’s twin) and Heywood (Sheridan’s younger brother) – with the exception of Heywood who is in the military, they are all at Armitage for the funeral. Grey is happy to see his siblings, but is guarded, he left Prussia when he was only ten to go live with his aunt and uncle in England and the experience left him changed, he doesn’t want love, as it has only ever caused him pain and as much as he would like to embrace his family, his past holds him back. He soon learns that Sheridan doesn’t believe Maurice’s death was an accident and thinks that Beatrice’s brother Joshua killed not only him, but possibly Armie as well. He wants Grey to investigate Joshua, but Grey argues that he would probably get more answers from Beatrice – especially since their mother is grooming her and Gwyn for a debut, Grey says he would get more information helping their mother prepare the girls as he is familiar with the London season.I really enjoyed this story, yes, there are a lot of characters and yes, there is a lot going on, but it is really well done and even with the multitude of characters, it stays on point and Beatrice and Grey are definitely forefront in the story. I loved watching them fall in love and slowly overcome the hurts of their past and learn to trust each other, even when things are not what they seem. The book is filled with witty dialogue, secrets, heartache, steamy love scenes, mystery and a very hard won HEA. The book nicely sets up the series with hints of the other siblings backstories as well as the ongoing mystery of Maurice’s death. I am happy to recommend this book and am eagerly awaiting the next story!!*I am voluntarily leaving a review for an eARC that was provided to me by NetGalley and the publisher.*",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laced",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBLLWAV72DUAZYZT4DKFUPJK7QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HBWL3DAL91IU?ASIN=1420148559",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Ohh! So That’s What He Means!",
                "reviewText": "My first read of a piece in this period. Found myself laughing at the way things were explained and it definitely added to the charm of the book. Glad Grey was able to find happiness, though sometimes his inability to say the right thing had me cringing.This book does have scene of explicit activities, but not in great detail.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nanna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETDCBAJ5EPAB7VW22RM2QOXQWLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YHMNJ6E2P5UF?ASIN=1420148559",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2019",
                "reviewTitle": "5.0 out of 5 stars Romance, steamy love scenes, Mystery, Secrets what more could you want",
                "reviewText": "A great start to other series for Sabrina Jeffries. I have read almost all of her books, and series and this first book was great. Fletcher \"Grey\" Pryde, Duke of Greycourt finds out after a visit from his cousin.That his mother is a widow again. She has been married three times and has five children. Three of her son's are Duke's, one is in the military, and her only daughter is single.Vanessa Pryde is ten years his junior and more like a sister then a cousin. Her mother has been trying for years to set them up for marriage. Both want the opposite to marry someone else anyone else.There is a lot going on in story, lot's of character's both good and bad. The mystery of why his mother's husbands have all died in accidents. The last two close together.Grey and Beatrice get off to a rough start and tempers fly. Grey thinks she is a servant working on the funeral and starts giving her orders. Then finds out she is cousin to his half-brother.As Beatrice and Grey get to know each other, find themselves falling for each other. Grey is also helping his brother try to find out who killed his father. Sheridan thinks it is Bea brother Joshua. He has come home for the war after he was injured. He is a loner and keeps to himself.This is a great story and as I don't want to give anything away, I will just end by saying this haseverything you want in a romance, both Beatrice and Grey are likeable, a mystery, steamy love scenes and a really hard won great ending.... I can't wait for the next book",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Coffeeandbooks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI4NZD3KS44D4DNEVODVWMB55NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CU8G6761YPYK?ASIN=1420148559",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2021",
                "reviewTitle": "3.0 out of 5 stars Goof story",
                "reviewText": "I enjoyed the story of Beatrice and Fletcher, although he's referred to as Grey through out the story. I did get lost in the relationships, though. He's got 4 half siblings, and Vanessa is his cousin but not theirs, so it must be on his father's side. But I wasn't sure about how Beatrice is or is not related. The story states Maurice is her uncle but if it said how I missed it, cause the author was clear these two were not related. But an interesting theory that someone is killing off Grey's mother's husbands. I assume we'll get more as the series continues.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R the bookworm",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 16, 2019",
                "reviewTitle": "Disappointed",
                "reviewText": "I like Sabrina Jeffries, and this is the first time she has let me down. I could not finish the book.Contrived situations , cardboard cutout characters, and wooden dialogue.Enough said.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "john01793",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 6, 2019",
                "reviewTitle": "Great book",
                "reviewText": "Worth reading",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 13, 2023",
                "reviewTitle": "Bea & Grey ❤️",
                "reviewText": "Loved feisty funny fragile Bea first followed not far behind by bossy superior broken Grey.Great tale with interesting side characters I want to know more about & themes to be investigated, to be sure.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D2015",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 2, 2020",
                "reviewTitle": "enjoyable",
                "reviewText": "I enjoyed this novel, it had a different plot from others and a murder mystery.Both Heroine and Hero are decent folk with pasts that keep them guarded but as the plot thickens and unfolds, their romance develops.Enjoyable read and great introduction to other characters in this series",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sadia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 1, 2019",
                "reviewTitle": "Expected better..",
                "reviewText": "I had waited eagerly for this story,it was a disappointment. Erratic, ill placed steamy scenes, no gripping plot. All I wanted was to read a riveting book this author is so capable of creating. I have given it two and a half stars, it doesn't come up to the mark.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}