{
    "remaining_requests": 1019,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Nurses-Secret-Amanda-Skenandore/dp/1496726537",
    "body": {
        "name": "The Nurse's Secret: A Thrilling Historical Novel of the Dark Side of Gilded Age New York City",
        "price": "$9.99$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Nurses-Secret-Amanda-Skenandore/dp/1496726537",
        "soldBy": {
            "sellerID": "AFVOEIWV5KMOU",
            "name": "Books & Etcetera",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=AFVOEIWV5KMOU&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81pA0ppfmUL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Amanda Skenandore",
            "link": "https://www.amazon.com/Amanda-Skenandore/e/B07CK4V2Q5/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Books & Etcetera",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 15895,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 15 hrs 7 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 9 hrs 52 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 14 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Kensington (June 28, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 368 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1496726537"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1496726537"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.95 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,736 in Books (See Top 100 in Books) #25 in Medical Fiction (Books) #226 in Women's Domestic Life Fiction #266 in American Literature (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 15,895 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c4cd96d-0536-45ff-a82b-0694c87d3f1d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9081019b-6648-4d8e-b31d-3149c5b62ca5.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Frank A. RacioppiFrank A. Racioppi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE37WFGY4YKD7UVLMKHS76DZRKJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24AHCER06FO1B?ASIN=1496726537",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2022",
                "reviewTitle": "5.0 out of 5 stars The Nurse’s Secret — Four Genres For The Price Of One",
                "reviewText": "Author: Amanda SkenandoreRating: Four out of Four antiseptic bandagesEase Of Reading: 352 pages. Relax because you’re in the hands of a master narrator. Plenty of narrative balls to juggle with no risk of dropping any of them.When To read: After watching several episodes of Grey’s Anatomy and realizing that the history of medicine and women’s role wasn’t simply groping in one of the many supply closets in the hospital.The Nurse’s Secret is one of those novels that reignites the title and subtitle debate. The title, The Nurse’s Secret, alludes to a medical story or even a romance novel. In reality, the novel is both and so much more. The Nurse’s Secret is indeed a medical tale with a romantic piece. But it is also a sharp commentary on the gross inequality of 1880s America in big cities like New York City.Moreover, the novel pokes its stick at male dominance, female submission, medical ignorance, and the birth of a new medical profession.Author Amanda Skenandore is a historical fiction writer by trade and a registered nurse. Her practical expertise and historical chops steer the novel toward dramatic mastery with a ‘pay no attention to the man behind the curtain” skill.Kensington, the book’s publisher, summarizes the book this way: “Based on Florence Nightingale’s nursing principles, Bellevue is the first school of its kind in the country. Where once nurses were assumed to be ignorant and unskilled, Bellevue prizes discipline, intellect, and moral character, and only young women of good breeding need apply. At first, Una balks at her prim classmates and the doctors’ endless commands. Yet life on the streets has prepared her for the horrors of injury and disease found on the wards, and she slowly gains friendship and self-respect.“Just as she finds her footing, Una’s suspicions about a patient’s death put her at risk of exposure, and will force her to choose between her instinct for self-preservation, and exposing her identity in order to save others.”The narrative pacing is deliberate and descriptively dense, yet the author needs to pace the story carefully because the novel operates on so many levels simultaneously.First, the novel introduces the class struggle of the impoverished in the dark recesses of the Gilded Age in New York City in the 1880s. That stark inequality and outward disgust toward the “street people” infects the entire narrative and the mystery.Second, there are the medical components of the story, and they multiply seamlessly. The reader learns about the Florence Nightingale-inspired nursing school at Bellevue Hospital, where only proper woman with distinguished backgrounds can apply. Again, the class warfare invades. Then the reader watches the subjugation of the female nurses and trainees by the doctors, administrators, and society. In that time and place, doctors are incapable of mistakes and never second-guessed.The author slickly injects Joseph Lister and his germ theory, as the English doctor’s theory of antiseptic care was just beginning to take root in the medical profession after years of being ridiculed and rejected.The author then uses his nursing training with great skill to educate the reader as well as Una and her roommate-nurse trainee Dru. That medical knowledge was then used skillfully to advance the medical mystery and ultimately criminal acts.Third, the novel slow churns a budding romance between a young doctor at the hospital and Una, with the suitor unaware of Una’s true, sordid past. That simmering romance links to the oppression of the lower classes and to male domination in society and in relationships at that time.Finally, there is the journey of the main character, Una. Here, Skenandore paints her brushstrokes of Una with painstaking care, compositional excellence and three-dimensional depth. It’s Una’s voice we hear throughout the novel, and the reader is so meticulously drawn into her world that it’s literary immersion at its best.The Nurse’s Secret enabled me to enjoy a medical history tome, a criminal mystery, a romance novel, a socio-economic tract, a female empowerment tale, and the personal growth of a young woman destined like so many others in 1883 to a short, brutish life. The novel is a showcase for a talented author like Amanda Skenandore, and would be fun for readers in either print, ebook or audiobook versions.",
                "reviewVotes": "152 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51mjPiYOVHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Book Club Member",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVDZINSDI7FQ2X7TNGH57D3X5YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M62LYCVHWW6V?ASIN=1496726537",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2023",
                "reviewTitle": "4.0 out of 5 stars A Thief Masquerades as A Nurse Trainee",
                "reviewText": "This is the second book I've read by Amanda Skenadore. Just like in her other book, The Second Life of Mirielle West, Skenadore presented me with a main character that I didn't like at all, only to slowly redeem her to the point that I was cheering for her to persevere and thrive. In this book, I thought I was going to be reading about a nurse, but the protagonist Una was a professional thief, who picked pockets and pilfered through luggage at the train station to make a living. She was forced to hand over her loot to the boss of a criminal ring, who gave her thieves barely enough money to scrape by. In return, the thieves received police protection, secured by the boss through bribes, in case they were caught. Una made the mistake of secretly keeping a large jewel that she attempted to fence on her own, cutting out the middleman. Shortly thereafter, Una became a murder suspect, but her boss found out about Una's disloyalty and disavowed her. Another suspect fingered Una for the murder to get out of jail herself. When Una escaped, she had no money and nowhere to go where she would not be recognized by \"coppers,\" as Una referred to them. About 22% through the book, Una faked her way into a probationary nurses' training program at a prestigious hospital. Her lifestyle was immediately improved, but Una had no intention of completing the program. She planned to lie low until the ruckus about the murder died down and she could find some way of leaving New York City altogether to start over somewhere else. She had to put up with a naive and overly enthusiastic roommate, who unwittingly helped Una fake her way through exams and procedures. Una had rules for living on the street, one of which was not to have any friends or romantic involvements. Her \"temporary\" stay at the training school tested both of those resolves. An unexpected complication developed when some patients at the hospital died mysteriously of what were ruled to be suicides, but Una began to suspect murders. Suicides and unexplained deaths brought police to the hospital, leaving Una on edge that she would be recognized. Just as Una realized that perhaps she could really pursue a life as a nurse and she had broken her rules about friendships and romance, her true identity was revealed, putting her on the run and disowned by her love interest. Then Una got a clue as to who may have committed the murder of which she herself was accused. With no friends to assist, she followed that clue with the reluctant help of a reporter who had once interviewed her about her life as a thief. A terrifying and shocking scene unfolded with a highly unlikely ally coming to her aid at the very last moment. If you read this book, suffer through the first 20% where there is not a nurse in sight. Skenandore had her reasons and delivered a satisfying ending.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina I. ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3QXW5EO4HCOFO5QOAJPRCLTYVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R250EDCGESV19H?ASIN=1496726537",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars A new view on nursing",
                "reviewText": "I can connect with the author and the main character that nursing wasn’t something I always wanted to do. It’s my third “career” as and adult. And the most frustrating and fulfilling of them all. I enjoyed this glimpse into the early days of nursing and to see the unsuspecting influence it made.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy Garrett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7SVPCWSWQ553HGX4O2GSFDHT2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PGN8AEZWMRZ3?ASIN=1496726537",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "3.0 out of 5 stars It’s ok",
                "reviewText": "This book will never win any prizes for an unprecedented storyline or amazing characters. But it’s not a bad read. It’s a little predictable and a bit smarmy in some places but it’s not a complete waste of time.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel A Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHESFR6LMYJYOVMLQ6GGUMMOLKKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R110ASS6W2JSMK?ASIN=1496726537",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "4.0 out of 5 stars A different book then I normally read but I enjoyed it.",
                "reviewText": "This was a very different book then I normally read but I enjoyed the historical nature of the book. The characters and the storyline.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": " Betsy ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG2W4Z5LR4UVJAFWEBXWFHCJE7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O7U5S826F85N?ASIN=1496726537",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars So accurate and amazing",
                "reviewText": "As a nurse who loves the late Victorian Era of medicine, it was so accurate and I felt like I was there in the book watching it. The author used her skills and history of nursing to create a book you don’t want to put down. I love it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam McGrath ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4XN2RTAHIQFANGWNPYAFMSTBEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGC9GTBEYKVOT?ASIN=1496726537",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Captivating, fun and suspense with every page",
                "reviewText": "This was such a great read! I had a hard time putting it down. I bought this book for a co-worker for Christmas and saw it on Kindle and figured, why not? So happy I did! I really enjoyed this book and I hope you do too!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darcy OH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCMLRML4QUEK63H6PPZPBI6JMKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1K2B7OH3G979P?ASIN=1496726537",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Change title",
                "reviewText": "The title did not do the book justice. Was very interesting historical fiction regarding Bellvue Hospital in NY starting nurse academy. Story moved along at good pace - quick read. This is more than those in nurse/medical field to read.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Becky Smith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 27, 2023",
                "reviewTitle": "A great escape",
                "reviewText": "I loved the medical historical detail. Great mystery and I loved the humor. Una was a great character, I found myself caught up in her story immediately.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Wilkes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 22, 2023",
                "reviewTitle": "Good read!",
                "reviewText": "Good read couldn’t put it down!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mirilou",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 14, 2023",
                "reviewTitle": "fine historical writing",
                "reviewText": "A great insight into the American origins of nursing as a respected profession for women, and early medical practices. As well as a fine if somewhat unlikely romance …",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 19, 2023",
                "reviewTitle": "Entertaining",
                "reviewText": "Kept you in suspense",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shelley Giroux",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 22, 2023",
                "reviewTitle": "captivating",
                "reviewText": "Full of twists and turns, I felt my heart beat manyOf times reading this great book. I highly recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.80",
                "sellerName": "newbooksonly",
                "sellerRating": "5"
            }
        ]
    }
}