{
    "remaining_requests": 863,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/When-Marquess-Falls-Lorraine-Heath/dp/0062496883",
    "body": {
        "name": "When the Marquess Falls",
        "price": "$3.99",
        "originalPrice": "",
        "rawPrice": 3.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/When-Marquess-Falls-Lorraine-Heath/dp/0062496883",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "Only 1 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/51p7X32-lbL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lorraine Heath",
            "link": "https://www.amazon.com/Lorraine-Heath/e/B000APAQ54/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1009,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 29 - March 4 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 28"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b?ie=UTF8&node=23"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Romance-Books/b?ie=UTF8&node=13371"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Avon Impulse (April 18, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Mass Market Paperback ‏",
                "value": "‎ 144 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062496883"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062496881"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 3.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.19 x 0.36 x 6.62 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#88,787 in Books (See Top 100 in Books) #23 in Victorian Historical Romance (Books) #644 in American Historical Romance (Books) #3,232 in Regency Romances"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,009 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ChristiReadsALot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG53XRBF7KLZ3KNTWIAGEYGVV2LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJD18RU30L2TZ?ASIN=0062496883",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2021",
                "reviewTitle": "5.0 out of 5 stars Bittersweet, eternal romance",
                "reviewText": "When the Marquess Falls (previously titled Making Merry with the Marquess) is a novella part of the Hellions of Havisham series. In that series the reclusive Marquess of Marsden is a single parent raising not only his own son but 3 orphaned boys who were his friends’ children. Marsden is referred to as the “Mad Marquess” after holing himself up at his estate after his beloved wife Linnie’s death during childbirth, he even still “speaks to” and “sees” her around the property. Theirs is a love that is eternal and knows no bounds. Reading the series beforehand and knowing Linnie’s fate, I knew this novella would be bittersweet and pull all sorts of emotional punches but I do love those type of reads that break your heart a bit & make you cry, so I was ready.George becomes the Marquess of Marsden at the age of 12 after losing his father. It’s on the day of his father’s funeral that he runs outside to get away and meets 8-year-old Linnie, the baker’s daughter, sitting up in a tree. We also get to see Marsden with his 2 best friends, the Duke of Ashebury and Earl of Greyling (the fathers of the sons Marsden ends up raising in the series trilogy) and it was so bittersweet to see the previous generation of these men together. The 3 friends are known as the Undecided Lords and all end up finding their future wives at a Christmas ball held at Marsden’s estate. The story fast forwards to when Linnie & Marsden are married, then to when she gives birth to their son and passes away after childbirth, to when the 3 boys show up (the scene from book 1 of the series), and to moments throughout the series that Marsden sees/speaks with Linnie.I adored all the little moments sprinkled throughout the book that tie into the previous book...Linnie stating why she would smile for a portrait if she ever had a painting done of her, Linnie saying she can see Marsden with 4 boys (the boys he ends up raising that become the hellions), an old woman telling Linnie she’d have an eternity of happiness but wouldn’t be long for this world. Even going in knowing Marsden & Linnie’s time together was short-lived, this was such a special and bittersweet romance read. Their eternal romance was everything and I pretty much bawled the entire last half of this novella. 🥺😭🥰",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amj",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCDJISA4LVM2ZTNPHQUVZUTOATA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R222DYV7KXNCQR?ASIN=0062496883",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Eternal love story",
                "reviewText": "Emotional, bittersweet, HEA x2.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBIQVUFS46AUG6DOO44HDTFRTLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROW9APLOSECFM?ASIN=0062496883",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Beautiful story",
                "reviewText": "A wonderful ending to this book series. A heart wrenching tale of the greatest love. I hope you believe in ghosts...and love.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CrimsonRoseReads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDKQFDIL6EYTX2ABONOXEVCWKUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLEVAG7SIF4O7?ASIN=0062496883",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2017",
                "reviewTitle": "5.0 out of 5 stars A beautiful love story to conclude The Hellions of Havisham series!!",
                "reviewText": "“To the Marquess of Marsden and the privilege we had of knowing him better than most” - The Duke of Ashbury ( The Viscount and The Vixen )The Hellions of Havisham is my favorite series by Lorraine Heath. Each of the men in these books were raised by The Marquess of Marsden and this lovely novella is the story of George ( the marquess ) and his Linnie. Throughout the Hellions novels you learn that Marsden is mad...made so by his grief following the untimely death of his lifelong friend and wife, Madeline Conner, who dies shortly after giving birth to their son, Killian, Viscount Locksley. The other boys are the sons of George’s friends, The Duke of Ashbury and the Earl of Greyling, who are orphaned after a tragic accident. The novels each show the impact of how the marquess and growing up in the haunted Havisham Hall had on their development but it’s this novella that goes back in time to show George & Linnie’s story that encloses the events of the series in a nice tidy circle. My favorite of the series was The Viscount & the Vixen which is Locke’s story and this gorgeous history of his parents’ story is a must for any fan of The Hellions of Havisham series!! Highly Recommend!!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "avidreader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFDTIFNOE6SYSVKXTRRJNI3Q4BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD7Q3XNJYOO5X?ASIN=0062496883",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2022",
                "reviewTitle": "3.0 out of 5 stars No HEA",
                "reviewText": "This is a prequel to the series involving Locke and his 3 adopted brothers. If you're looking for a happy ending, this book is NOT for you. Not sure why it wasn't marked as a prequel in the store. I would have passed on it. The first part was good, but if I wanted sad I could just watch the news!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Neha Patel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQDK7KKUU5ER3T6OLTFFI6PMN4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O9RF4TN41WAE?ASIN=0062496883",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2017",
                "reviewTitle": "5.0 out of 5 stars Be prepared to weep bitterly...",
                "reviewText": "A heartwarming novella that offers readers a glimpse into the undying love and devotion George, the Marquess of Marsden, had for a local baker's daughter named Linnie. The love they had for each other was eternal and everlasting.George meets Linnie when he is twelve, and she, eight, and he immediately falls for her and knows without a doubt that she is the one he will eventually marry. Unfortunately, reality and its expectations interfere with his plans once he reaches adulthood and he begins to realize his responsibilities. As a result of his more elevated status and her lowly one, George cannot seem to find a way to actually marry her without breaking centuries of tradition as a titled member of society, despite wanting her with a fierceness that threatens to consume his entire body and soul. Will love conquer all?Have tissues handy because this is an intense read that will make you cry your heart out upon its conclusion. I absolutely adored this short love story, and I recommend it highly to adult readers and romantics alike! This novella is a rare gem of heartbreaking honesty and a love so deep and melodious that its soft strains resonate with you long after you have turned the last page. A Definite Must-Read for All Adults!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Estefania P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 4, 2024",
                "reviewTitle": "Historia tierna",
                "reviewText": "Ha sido tan bonita (y triste) como esperaba, me ha gustado mucho ver esa historia de la que solo tenía pinceladas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eliane Bernardes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 17, 2020",
                "reviewTitle": "Maravilhoso/Wonderful",
                "reviewText": "Um dos meus livros favoritos da Lorraine, Ver a história do Marquês e da Linnie foi emocionante. Senti o sofrimento dele quando a Linnie se foi e o reencontro... Simplesmente perfeito.--One of my favorite Lorraine books, Seeing the story of the Marquess and Linnie was thrilling. I felt his suffering when Linnie left and the reunion ... Just perfect.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Just Cory",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 4, 2018",
                "reviewTitle": "Lorraine Heath never disappoints!",
                "reviewText": "Excellent book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol Cork",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 28, 2017",
                "reviewTitle": "Such a beautiful, emotional story that will tug at your heartstrings.",
                "reviewText": "This novella tells the beautiful but bittersweet love story of George, Marquess of Marsden and his beloved Linnie and, having read The Viscount and the Vixen, I knew it was going to be an emotional rollercoaster of a journey.George and Linnie are childhood friends who fell in love and, despite their very different social positions in life, it is obvious they are meant to be together. I admire how George respects and protects Linnie and I can see why he falls in love with her. She is such a lovely person – optimistic, courageous, caring, kind and just plain fun. It wasn’t hard to believe that, in time, she would have won over the Ton.Throughout the series, George has always been considered mad, but often his actions are far from those of a madman, especially in his relationships with his charges and his son. He has not only raised them but helped each one in various ways.Seeing the depth of his love for Linnie, and his intense feelings of grief and despair when he lost her, made me think that perhaps he wasn’t mad at all but suffering from bouts of depression. I like to believe that Linnie did watch over him through the years as she promised, and it was heart-warming to see a kinder, gentler, happier George in The Viscount and the Vixen.The story is so emotionally moving and, even now, thinking about certain scenes brings tears to my eyes. I think it is a testament to Ms. Heath’s writing that she can evoke such strong feelings.I love how she made me believe in an everlasting love that transcends even death and gave me a Happy Ever After which, although unconventional, left me with a tearful smile on my face.Note: I do recommend that you read The Viscount and the Vixen before reading his novella.MY VERDICT: Such a beautiful, emotional story that will tug at your heartstrings.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 6, 2017",
                "reviewTitle": "Nope.. just no",
                "reviewText": "I dislike books with sad endings. I just don't like reading them, it somehow kills the magic of romance n happily ever after for me.Short read but not a good one I'm afraid.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}