{
    "remaining_requests": 776,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ashes-Berlin-Fractured-Book-ebook/dp/B07Z23PW57",
    "body": {
        "name": "From the Ashes: A Gripping Post World War Two Historical Novel (Berlin Fractured Book 1)",
        "price": "$0.99",
        "originalPrice": "",
        "rawPrice": 0.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ashes-Berlin-Fractured-Book-ebook/dp/B07Z23PW57",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81bkxmFvItL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Marion Kummerow",
            "link": "https://www.amazon.com/Marion-Kummerow/e/B00A7S52S0/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2135,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"Well-researched, dramatic, and heartbreaking, this tale is historical fiction at its very best.\" ~ Alexa Kang, USA Today bestselling author of the Rose of Anzio seriesInspired by true historical events, From the Ashes is the unforgettable story of a tortured man, torn between his ideals, the iron fist of Stalinism and the woman he loves.World War II is over, but another battle has just begun…Marlene has no love lost for the Soviet occupying forces, who turn out to be every bit as cruel as the Nazis were. Living in constant fear of the Russian soldiers, she works in a hospital to make ends meet, where she meets Werner, a cold-hearted career politician.Werner, a German émigré to Moscow, returns to his hometown with the highest hopes for a better future. Sent by the communist party to bring freedom, wealth and happiness to the people, he’s soon caught in a moral conflict between loyalty to his party and his conscience.When Marlene criticizes the communist regime, she becomes the target of powerful men. Oblivious to the danger for her own life, she refused to back down, and there’s only one thing Werner can do to save her life: defy the party line.But will he be able to shed decades of indoctrination for the woman he loves? And what will become of him if he does? Because those who speak up against the regime, usually find themselves on a train to Siberia or worse.From the bestselling author of the 'War Girls Series' comes this nail-biting story about Berlin sliding into the Cold War.Readers who loved From the Ashes:\"Once again as with all of Marion Kummerow’s books this author has taken a moment in history which was pivotal in the geopolitical tensions of post-war Europe between the Soviet Union and the Western Powers.\" - Goodreads Reviewer, ⭐⭐⭐⭐⭐\"An excellent read! Gripped my imagination on the first page and never let go... The twists and turns of the narrative will surprise you as will the ending, and you definitely would want to learn what is in store for them and other not less interesting characters who populate this absorbing story in the next book promised by the author. I can’t recommend it highly enough.\" - Goodreads Reviewer, ⭐⭐⭐⭐⭐ Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07Z23PW57"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (November 29, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 29, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1689 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 246 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#69,477 in Kindle Store (See Top 100 in Kindle Store) #89 in Historical German Fiction #276 in Military Historical Fiction #297 in Historical Mystery, Thriller & Suspense Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,135 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alfred Richardson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXYZVA2ZRMB3DUP7QPMAULIXA5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UKASQMQUB4ZZ?ASIN=B07Z23PW57",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars \"...the Great Red Army has only razed to the ground what was already crumbling.\"",
                "reviewText": "I have read several of Kummerow’s novels. She never disappoints. It is hard for me to pick a favourite. I love them all. 'From the Ashes' is certainly no exception. But it does stand out as a highly emotive work that’s reminiscent of Charles Dickens' 'Hard Times' and to a lesser extent, 'A Tale of Two Cities'. In this novel she explicitly addresses social and political injustices. Her thrust is not to entertain but to expose an oppressive yoke around the necks of the German citizens.It is important to me because it illuminates post WWII Germany. It shares insights into the mood of a people and the simmering rage against brutal treatment of dissenters who resisted the imposition of communism. The dissenting Germans had had enough of Hitler and his Nazis and no way would they yield to Stalin and his minions. They were both anti democratic repressive regimes.In 'From the Ashes', Kummerow established for me that the fall of the Berlin Wall was no overnight event. It certainly did not crumble from the breath of one man; nor did any underlying skilful diplomacy lead to its demise. The Berlin Wall was crumbling from day one. Its fall was inevitable and so too was the reunification of Germany. These two events resulted from the German peoples love for freedom and democracy.This really is an amazing novel. It is forceful and direct. Marion spares no bones. It’s a pleasure to be informed through the literary imagination of a wonderful writer such as Marion Kummerow. I can truly say that she has \"open eyes and showed me what it means to defend what you believe in.\"",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carrie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD7CNIDR5LCO3HVMP6GFBQCMIHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FLLZGD0L3HP8?ASIN=B07Z23PW57",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 24, 2022",
                "reviewTitle": "4.0 out of 5 stars Knew the communists were rough but wow.",
                "reviewText": "I learned even more about the hardships the soviets put on Germany after the war and its citizens. I had herd of bits of it but never realized how much they actually had did. I love how Marion Kymmerow includes true historical facts within her novels along with her main characters with their lives and romances",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESQ5IZ2MIMMQV4BZMK37ICZTSFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ACGR0YVN9A8P?ASIN=B07Z23PW57",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Berlin after World War II",
                "reviewText": "This book offers a realistic glimpse into the lives of Berlin occupants following World War II, and it is an amazing view! I gained insight into the political arena during that unstable period of time, and did it while enjoying the entertaining drama of fiction. This promises to be an insightful and riveting series! Great characters!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kerry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJOOJYLZIFUFRKOFAOKBCSB5QUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VSSCPPYP847S?ASIN=B07Z23PW57",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2022",
                "reviewTitle": "3.0 out of 5 stars This was slow reading",
                "reviewText": "This was a red slow going story I did like the characters especially Werner but the ending was horrible not that I wanted them to get together but it is like she was like okay I will just go on the end she just except it and goes on with her life like nothing happens",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Regina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF42IEBC7U2MDLAGFN35VVI6W4VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HVIYV6S4CKV0?ASIN=B07Z23PW57",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2022",
                "reviewTitle": "4.0 out of 5 stars Quick read",
                "reviewText": "I read this in just a couple of days. I found the characters to be relatable. The ending isn't the typical \"and they lived happily ever after\" , a fact that makes this book even better. It is a unique look into the lives of people in the after math of WWII. Well written and researched.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKBBA2O5FB3ZNNH4BD7MIN3JFQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37ZFVX9CB7N56?ASIN=B07Z23PW57",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2019",
                "reviewTitle": "5.0 out of 5 stars I'm hooked!",
                "reviewText": "This is only the first book in Ms. Kummerow’s new series and I’m already hooked! I really enjoyed that it focused not on the usual aspects of the war (which are plentifully represented in literature) but on a subject that isn’t much talked about and which should be - namely, how the Germans coped with losing the war and trying to rebuild their lives under a new administration. Through two main characters, Marlene and Werner (a regular citizen and a representative of the occupying force, respectively), the author shows with brutal honesty how difficult it was for someone to stand up for what is right. Werner was a particularly interesting character; both his inner conflicts and actual, physical conflicts he had to deal with daily while trying to do what’s right for the people, are wonderfully presented. Historical research was meticulous and showed perfectly the hypocrisy of the new occupants of the city, who were just as autocratic and ruthless as the Nazis even though their ideology was called differently. A truly fascinating historical fiction offering an intimate glimpse into post-war Berlin and its inhabitants. Highly recommended!",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marina Osipova",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVJ4YBHF3HMQLEDF7XBKTJQE24A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16PZJID5B4NR5?ASIN=B07Z23PW57",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2020",
                "reviewTitle": "5.0 out of 5 stars An excellent read!",
                "reviewText": "Gripped my imagination on the first page and never let go.With her intensely researched, quickly paced, suspenseful, and engrossing narrative, the author puts us in the post-war Germany under the occupation by four victorious forces. Most of the events unfold in the Soviet sector, bringing to light the accurate account of how Germans reacted to the forced Sovietization, the subject rarely touched in the modern literature.Despite difficult life conditions, there is romance flourishing between two main characters, Marlene and Werner. Their feelings are perfectly interweaved with the then current situation in the country and will keep you turning pages to learn how one influenced each other under the dangerous and controversial circumstances. The twists and turns of the narrative will surprise you as will the ending, and you definitely would want to learn what is in store for them and other not less interesting characters who populate this absorbing story in the next book promised by the author. I can’t recommend it highly enough.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Owl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFLS2QOSN3OU2GDN53HLN4F3OWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R329HY5WJELO9C?ASIN=B07Z23PW57",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2022",
                "reviewTitle": "4.0 out of 5 stars Marion Kummerow. Berlin Fractured series in kindle",
                "reviewText": "I liked the book very much, but was disappointed in the ending. I thought it was a cliffhanger and might have a better ending for Marlene and her soldier in future books, but it didn't.Owl",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lainey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 19, 2023",
                "reviewTitle": "Not an Easy Life in Berlin right after the war",
                "reviewText": "This book was very well-written and makes the reader more aware that life was no better for some after the war was officially over. The sector of Berlin under brutal Russian occupation was very difficult for the German people. Food was rationed and there were no extras, while the French, British, American, & Russian military occupiers had plenty to eat and drink. The people in the Russian sector were bombarded with Communist propaganda. Anyone suspected of speaking out against this would \"disappear.\" Their treatment was just as brutal as the Nazi treatment was of their prisoners. A woman walking alone was at risk of being raped by Russian soldiers. I could really empathize with the developed characters in this story and was captivated to the last page. I will definitely read more books from this author!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vesuvio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 29, 2021",
                "reviewTitle": "A fascinating tale against the backdrop of post war Berlin",
                "reviewText": "I have been meaning to read Marion Kummerow for a long time and finally she rose to the top of my Kindle TBR pile with this book. I knew very little about the chaotic times in Berlin immediately after the war, particularly the Soviets' power grab and vote-rigging. What an interesting story this made. I have visited Berlin twice, first in 1972 when I crossed the Wall at Checkpoint Charlie and then a dramatically different visit in 2006. Reading From the Ashes has made me want to visit again. Kummerow paints a vivid picture of the deprivation and destruction as well as the propaganda, persecution and Sovietisation that went on the Russian sector. I also found the power play between the various nations intriguing. So glad I finally got round to reading this. I'm sure it won't be the last of her books I will read.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A Net In Time",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 18, 2023",
                "reviewTitle": "Good story",
                "reviewText": "I found this to be a good story. left me wanting more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jack drew",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 8, 2023",
                "reviewTitle": "Interesting historical reading..",
                "reviewText": "This novel completed the the ending of the second world war for me and filled in some very interesting gaps , well done. 😎",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jennifer j.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 13, 2020",
                "reviewTitle": "Jennifer Jamieson",
                "reviewText": "Another thrilling read that I couldn’t,t put down.I like the historical fiction of love and suspense and look forward to continuing the story, hoping for a happy ending",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}