{
    "remaining_requests": 836,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Up-Dust-Historical-Testament-Biblical/dp/1540903567",
    "body": {
        "name": "Up from Dust: Martha’s Story (Women of the Way)",
        "price": "$17.93",
        "originalPrice": "",
        "rawPrice": 17.93,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Up-Dust-Historical-Testament-Biblical/dp/1540903567",
        "soldBy": {
            "sellerID": "AD4OCGA82CJ4V",
            "name": "Lower-Christian-Prices",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AD4OCGA82CJ4V&asin=1540903567&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "Only 10 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51GdVjQhtHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51-xwUZylhL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Heather Kaufman",
            "link": "https://www.amazon.com/Heather-Kaufman/e/B01IYLYO0S/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Lower-Christian-Prices",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 67,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 46 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 8 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Christian Books & Bibles",
                "link": "https://www.amazon.com/Christianity-Religion-Spirituality-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=12290"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Fiction-Poetry-Christianity-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172806"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bethany House Publishers (January 23, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1540903567"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1540903563"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.88 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#82,758 in Books (See Top 100 in Books) #59 in Biblical Fiction #251 in Religious Historical Fiction (Books) #503 in Christian Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 67 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/17666bb5-cf70-4b0b-81af-c14adf39e9e7.__CR0,2,1440,445_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ac9126fa-a1b0-441d-a0c4-0ad9ee9f11bf.__CR0,2,1440,445_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2a765429-aee2-4c50-914e-4d6043a993e2.__CR0,2,1440,445_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Babbling Becky LBabbling Becky L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFR45UMTKBMAS62KU5J5E46NGG3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPO1XNXYC6ONJ?ASIN=1540903567",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Kaufmans Martha Becomes 3D for 21st Century Reader",
                "reviewText": "“How can I begin to tell of the many things I have found? Or of the One who found me? I see His hand in my story like a weaver’s shuttle through the warp, steady and sure, pulling here, loosening there, doing the work necessary for beauty. How do I tell of His capable hands, the ones that rescued me?”“Before I can share the many ways I was found, I would have to begin with the day I was lost.”And so, in the prologue, ( I hope you read prologues!) we have the reason for Heather Kaufman’s imagination of Martha’s life long before she ever met Jesus. As with other great Biblical fiction, Kaufman takes a few verses and passages we know of a Biblical individual. These are not changed from Scripture. But where Scripture is silent, the author suggests possible life events that send Martha, Mary, and Lazarus on their life trajectories until they encounter Jesus. “Maybe she or he reacted this way because…” In the meantime, Kaufman’s Martha becomes so real, so human, you will sympathize, you will judge, you will hold your breath as you hold her secrets, and you will wonder how she survived growing up in her father’s house. You will begin to understand a woman’s plight in Jewish society in the first century. Kaufman presents challenging relationships well. Some romantic, some familial, some friend-based. You will sigh, you will cry, you will ask, “Why?” But hopefully, when all is said and done, you will turn to the Biblical story to check out what truth we do know, and you’ll never view Martha or her siblings as 2- dimensional again!I received a copy of the book from the author and publisher, through Celebrate Lit via NetGalley, plus I bought my own ebook. No positive review was required, and all opinions are my own.Notable Quotables:“Yahweh keeps providing beacons of light in your life to guide you when you need it most.”“None of us is worthy. We are all naked and undone before the holiness of God.”“Who can stand before this holy God?”“Those who align themselves with His Son.”“Sometimes love engulfs us suddenly, like a consuming fire.”“…Other times it comes over us slowly, like a sunrise.”",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710SabCvWxL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "AndiT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRTLRV6T3JPNJEXTTAJZBKB5ZKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VJGF43B8ARBR?ASIN=1540903567",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars A Beautifully Told Story of Loss, Healing and Hope",
                "reviewText": "Biblical fiction is one of my favorite genres and I love reading debut authors, so I got a bonus with this book! I have read three books about Martha and while I enjoyed each one I think Ms. Kaufman's is my favorite. It was clear she'd researched Martha, I liked how she showed why Mary was so frustrating to her. It made the story of Martha and Mary more realistic. I have a little brother so I could identify.The pace of the book was perfect. I kept waiting for Jesus to arrive on the scene and was so glad when He did.Ms. Kaufman is an author I will have on my radar and I highly recommend her. If you enjoy biblical fiction I encourage you to pick up this book. You won't be disappointed!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda D Wallace",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHAATD5CZJW3HTQZT453NX6BDYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN9V7PVLC1S7J?ASIN=1540903567",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars A well-crafted novel based on the life of Martha, Lazarus's sister",
                "reviewText": "Up From Dust (part of the Women of the Way series) by Heather Kaufman is a must-read for anyone who likes Biblical fiction. This story focuses on Martha, the sister of Lazarus. The author takes us on a journey from Martha’s life and includes her trials and challenges, the complexities of a female living in Biblical times, and complicated family relationships. Her life-changing encounters with Jesus reflect what is read in the Bible. Kaufman’s easy-to-read writing style and meticulous research help the story have an authentic Biblical era feeling. The ending made me want to throw my fist in the air and shout, “Yes!” I highly recommend this book and cannot wait for her next one in the series. I liked it so much I purchased a copy for a friend.I was provided an advance reader copy by the publisher. I was not required to provide a positive review. All thoughts and opinions are my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lovemybooks2020",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5VC43Y4HQ6U3LSIJQASPKZFXNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE9UCW80TZ9CX?ASIN=1540903567",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Beautiful!",
                "reviewText": "I can’t think of a better way to kick off Lent tomorrow than with this gorgeous Christian book.⁣⁣𝙐𝙥 𝙛𝙧𝙤𝙢 𝘿𝙪𝙨𝙩 by Heather Kaufman is a historical new-testament biblical fiction novel.⁣⁣“A biblical story with a heart for today’s world, pulling out an array of joy and hope, sorrow and loss.”—Mesu Andrews⁣⁣“Taking us on an intriguing journey through heartbreak and healing, Heather Kaufman leads her readers directly to the joy of the empty tomb.”—Connilyn Cossette⁣⁣𝗦𝘂𝗺𝗺𝗮𝗿𝘆⁣Martha of Bethany is no stranger to adversity. After her mother’s untimely death, Martha shoulders the responsibility of raising her siblings—quiet and studious Lazarus, and wild and rambunctious Mary. She finds solace in friendship and the beginnings of first love, but just as Martha begins to imagine a new future, hardship strikes again and her dreams crumble into dust.⁣⁣Ten years later, Martha’s friend pleads for the new teacher, Jesus of Nazareth, to come and heal her husband. When Martha discovers that the carpenter-rabbi is connected to her past, she’s not sure she can trust him with her future. But as he continues to perform miracles, the invitation to believe becomes harder to resist, renewing Martha’s hardened heart, even as she faces an unknown future.⁣⁣Thank you @bethanyhousefiction and @hmkstories for my gifted copy! As a life-long #Christian, I am very familiar with this story in the #bible. The author made this retelling so beautiful and engaging! I really loved it!⁣",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KSargent",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGV5W2BZCMSA3J2D2HA4UDF7DOHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TJ9KKRCN1TMN?ASIN=1540903567",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Exquisite Writing, Master Storyteller",
                "reviewText": "Up from Dust is the best book I’ve read in a long time. The author’s research is astounding. She carefully weaves facts from the time period/culture with her vivid imagination to create a masterful story brought to life by her exquisite writing. I appreciate her commitment to stay true to Jesus, His interactions, and the words He spoke in the Bible. I was completely engrossed while reading, and my heart for Martha is so tender. I smiled and cried and cheered and fumed and cried and smiled some more. I even purchased extra copies for gifts. To state it simply, I loved this book. Book 2 cannot release fast enough! Thank you to Bethany House for providing an advance copy. The opinions expressed here are honest and true.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.71",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            },
            {
                "price": "$17.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}