{
    "remaining_requests": 816,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Lady-of-Rivers-audiobook/dp/B005WOFSG0",
    "body": {
        "name": "The Lady of the Rivers",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Lady-of-Rivers-audiobook/dp/B005WOFSG0",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61Rlfb7lneL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Philippa Gregory",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Philippa+Gregory&search-alias=audible"
        },
        "brand": "Philippa Gregory&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 9394,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Passion. Danger. Witchcraft.... The Lady of the Rivers is number-one New York Times best-selling author Philippa Gregory’s remarkable story of Jacquetta, Duchess of Bedford, a woman who navigated a treacherous path through the battle lines in the Wars of the Roses. Descended from Melusina, the river goddess, Jacquetta always has had the gift of second sight. As a child visiting her uncle, she met his prisoner, Joan of Arc, and saw her own power reflected in the young woman accused of witchcraft. They share the mystery of the tarot card of the wheel of fortune before Joan is taken to a horrific death at the hands of the English rulers of France. Jacquetta understands the danger for a woman who dares to dream. Jacquetta is married to the Duke of Bedford, English regent of France, and he introduces her to a mysterious world of learning and alchemy. Her only friend in the great household is the duke’s squire, Richard Woodville, who is at her side when the duke’s death leaves her a wealthy young widow. The two become lovers and marry in secret, returning to England to serve at the court of the young King Henry VI, where Jacquetta becomes a close and loyal friend to his new queen. The Woodvilles soon achieve a place at the very heart of the Lancaster court, though Jacquetta can sense the growing threat from the people of England and the danger of royal rivals. Not even their courage and loyalty can keep the House of Lancaster on the throne. Henry the king slides into a mysterious sleep; Margaret the queen turns to untrustworthy favorites for help; and Richard, Duke of York, threatens to overturn the whole kingdom for his rival dynasty. Jacquetta fights for her king, her queen, and for her daughter, Elizabeth, for whom Jacquetta can sense an extraordinary and unexpected future: a change of fortune, the throne of England, and the white rose of York. A sweeping, powerful story rich in passion and legend and drawing on years of research, The Lady of the Rivers tells the story of the real-life mother of the white queen. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b?ie=UTF8&node=10177"
            },
            {
                "name": "Biographical",
                "link": "https://www.amazon.com/Biographical-Historical-Fiction/b?ie=UTF8&node=9332127011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "19 hours and 7 minutes"
            },
            {
                "name": "Author",
                "value": "Philippa Gregory"
            },
            {
                "name": "Narrator",
                "value": "Bianca Amato"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "October 18, 2011"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B005WOFSG0"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,018 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3 in Renaissance History Fiction #61 in Biographical Fiction (Books) #101 in TV, Movie & Game Tie-In Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kaitlyn McDonald",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTEUIKW2A2KYBCWCAGYPO2MWZ3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCYG7A5UCYKM1?ASIN=B005WOFSG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing historical fiction writing",
                "reviewText": "She writes about the time periods I'm already interested in with the exact angle that I'm interested in. I can't get enough and I'm so happy these exist. If you are a fan of the show the Tudors or any of the shows that match these books (and like to read) then you will likely love these books.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Courtney Salmon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZRBHATWMMOZ75SQMQGZNOD7CRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KQ4OCMTDVNF?ASIN=B005WOFSG0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "4.0 out of 5 stars engaging",
                "reviewText": "Read this after reading The White Queen (which is 2nd in the series). Great prequel and didn't expect it to start with Joan of Arc. I plan to continue the series to the end.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stacie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXGJL3DXW646XL44LTQR4GVPNPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33V4K17RYKF8P?ASIN=B005WOFSG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Great beginning!",
                "reviewText": "I have to admit, it was difficult to keep names straight, but it's such a good story that I made it work! I felt like I was in the story, watching it all happen. Anything that you think you know about this time frame, dismiss it. Read it for what it is, historical fiction. I've always wanted to read this series and am so happy it's now part of the Kindle unlimited catalog!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chrys",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY77EE3YIR7QAAXMOV4U2LK5CRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28CEPBHOW6JC8?ASIN=B005WOFSG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Very good",
                "reviewText": "I came across this author when I found The Other Boleyn Girl in a random book drop. I had no idea of the other books until I found this one. I loved this story it was very good. I recommend this author and all her works.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDKI64UMX4MKKCXZH6V3ITC7GRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XUI0EX47GAKK?ASIN=B005WOFSG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Best book I’ve read in a long time",
                "reviewText": "I enjoyed every word in this book. Really easy to follow even tho I know how complicated this story actually is which only shows how talented Philippe is.Can’t wait to read more of her books.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBFK7MLAWWXSXP5TRHTLYXQJG6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHPATV4VJVFZN?ASIN=B005WOFSG0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 6, 2014",
                "reviewTitle": "4.0 out of 5 stars I think this book could be retitled, \"Margaret of Anjou: Hell hath no Fury like a Woman Scorned.\"",
                "reviewText": "First, I think I should be clear that the only reason I went looking for anything on the War of the Roses was because of the Song of Fire and Ice (aka Game of Thrones) series by George RR Martin. In an interview he said that a lot of his inspiration for the series came from the War of the Roses.If you like courtly intrigue and medieval power struggles, then this is a novel for you. The whole story will make you very grateful that you did not have to live during the age of feudalism, especially as a woman. Even the author says that she would never ever want to live in any of the courts that she writes about.I think this book could be retitled, \"Margaret of Anjou: Hell hath no Fury like a Woman Scorned.\" This is mostly a book about Margaret of Anjou and her quest for revenge against everyone affiliated with the house of York, with Jacquetta acting largely as a narrator. Part of the book is devoted solely to Jacquetta, her husband(s) and her 14 children but I would estimate that at least 70% of the book is about interaction with Margaret.There is a lot of witchcraft in this book, which is mostly used as a plot device for foreshadowing. Some reviews have complained about the abundance of witchcraft references in the book, but I think they serve two purposes: (1) the foreshadowing of events and (2) to demonstrate how dangerous it was to be a woman who also attempted to have any social power/influence outside of sewing with her ladies. In modern times most people will say that the idea of blaming everything on witchcraft is ridiculous, but in the middle ages there were legitimately a lot of people who believed in witchcraft/magic/witch related superstitions. It's not any more ridiculous to believe in witchcraft than it is for people to believe that they can turn iron into gold and use it to fund their massive armies. However, I do agree there is a lot of overly witchy references, to the point that I half expected the Monty Python witch/floating/ducks float scene to take place in one of the villages.This is a prequel to The White Queen of the same series, and a lot of the witchy foreshadowing references events in The White Queen (about Jacquetta's daughter Elizabeth), so you could read this before The White Queen and catch all the reference later or read it after The White Queen and consider it backstory",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miranda Good",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNIXOQEGSFHFCFDA2TEE4YLIKAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28J3KK8MPJRYC?ASIN=B005WOFSG0",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2013",
                "reviewTitle": "3.0 out of 5 stars Routine Romance",
                "reviewText": "You always know what you're going to get with a Gregory book: easy to read HF set against the background of mostly accurate historical events as seen through the eyes of her characters. This one retells the romance of Jaquetta of Luxembourg and her lifelong love affair with Richard Woodville. These nobles were the parents of Elizabeth Woodville, later bride of Edward IV, but their story ends here long before their daughter's ascent to the throne of England. Most of the narrative relates to their years in the court of the monarchs they served: addled Henry VI and Margaret of Anjou, she deserving of the moniker \"she wolf.\" The fact that Jaquetta had 14 children also gives you an idea as to what a good bit of the story is about. This work is very typical of the romance historical fiction so popular right now. Unfortunately, it suffers from the same problem rife in so many of these books, namely, horrible English grammar. I began dreading running across such sentences as these taken directly from the text: \"I was only a head taller than her now.\" \"I was younger than her when I first did that.\" \"The queen may not be as lucky as me.\" Is it unreasonable to expect professional writers to be proficient in their own language? Are there no longer editors and proofreaders? Did everyone fall asleep during English class? Granted, this is a personal gripe on my part, but I have little patience with published works littered with elementary grammar errors. It is discouraging that such mistakes in print only serve to exacerbate the problem of our eroding knowlege of and interest in proper English. If this is an issue for you too, be forewarned.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karla",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHRQQWGO6WRJNDGCXC5EUG6TNGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CQKDXMCGX53L?ASIN=B005WOFSG0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Paperback books",
                "reviewText": "Gave to daughter with her set.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maxwell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 14, 2024",
                "reviewTitle": "Appears well researched",
                "reviewText": "Light read but entertaining and interesting. Appears well researched with some interesting facts .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Keith Desa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 1, 2023",
                "reviewTitle": "Lady of the rivers.",
                "reviewText": "Excellent!The second book I am reading in the series of THE COUSINS WAR.very well researched and written, like all books by Phillipa Gregory.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie R ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 14, 2021",
                "reviewTitle": "The first novel in the Tudor series is a must",
                "reviewText": "If your a Philippa Gregory fan and interested in the Tudor series, I highly recommend starting with this book first! Captivating and detailed enough to give you all the character context without overwriting trivial details. Excellent prequel to the series to give you context of what happens in the following novels and what the background significance is.Delivery was fast, description accurate and the paperback copy was in pristine shape!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ale Bu.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 10, 2017",
                "reviewTitle": "Muy buenaa lectura.",
                "reviewText": "Muy buena lectura, ligera, entretenida y con algo de historia. Pocos libros mencionan a mujeres y su participación historica, y aqui se muestran de manera realnu creible.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacobi, S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 23, 2018",
                "reviewTitle": "Geschichte bekommt ein lebendiges Antlitz",
                "reviewText": "Die Autorin lässt Geschichte lebendig werden, Gesichter bekommen, Gefühle empfinden. Schreibstil ist auch als nicht Muttersprachler gut zu lesen und es machte Spaß in eine ganz andere Zeit abzutauchen. Eine ungewöhnliche Frau wird lebendig, von der ich sonst nie erfahren hätte. Das nächste Buch liegt bereits auf dem Nachttisch und wird nicht das Letze sein!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}