{
    "remaining_requests": 789,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beautiful-Country-Novel-J-R-Thornton/dp/0062411918",
    "body": {
        "name": "Beautiful Country: A Novel",
        "price": "$10.29$10.29",
        "originalPrice": "",
        "rawPrice": 10.29,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beautiful-Country-Novel-J-R-Thornton/dp/0062411918",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "Only 2 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71zMzygiDQL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "J.R. Thornton",
            "link": "https://www.amazon.com/J-R-Thornton/e/B01EJVQTF0/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 304,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Beautiful Country is, in a word, beautiful. A novel with morality at the center, but absurdity all around.\" - Gary Shteyngart, author of Super Sad True Love Story From the Back Cover Chase Robertson arrives in Beijing as a fourteen-year-old boy still troubled by the recent death of his older brother. He discovers a country in transition—a society in which the dual systems of Communist-era state control and an emerging entrepreneurial culture exist in paradox.A U.S. top-ranked junior tennis player, Chase joins the practices of the Beijing national junior tennis team and is immersed in the brutal, cutthroat world of Chinese sports. It is a world in which gifted children are selected at the ages of six or seven for specialized sports schools where they devote their entire youth to the pursuit of athletic excellence and are paid as professionals by the state. Athletes find themselves compelled to do anything possible to succeed—right or wrong. Those who fail to reach the pinnacle are cast aside and left facing a desperate future without hope.In China, Chase gains access to a culture rarely open to Westerners, and he soon finds himself caught up in secrets. When his closest friend and teammate turns to him for help, Chase is faced with the dilemma of what to do when friendship, rules, and morals are in conflict.“In many ways the quintessential ‘Chimerican’ novel for the millennial generation. Disarming in its candor, addictively readable.”—Niall Ferguson, author of Kissinger: 1923–1968: The Idealist and Civilization“J. R. Thornton has given his lucky readers a compelling story of innocence and experience, of East and West, of sport and pastime. Thornton is a writer of formidable talent and deep heart, and this nuanced and moving novel marks his arrival as a significant new voice in contemporary fiction.”—Bret Anthony Johnston, author of Remember Me Like This About the Author J. R. Thornton graduated from Harvard in 2014 where he studied history, English and Chinese. An internationally ranked junior tennis player, he later competed for the Harvard men’s team and on the professional circuit. As a teenager he lived in Beijing and will return to China in the fall of 2016 as a member of the inaugural class of Schwarzman Scholars. Beautiful Country is his debut novel. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 22. Order within 14 hrs 41 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 41 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“This unsettling book about the moral encounter between America and China is a study of privilege, innocence, and risk. It is a tragedy of manners and a portrait of Beijing -- amplified and torqued and unmistakable.”— Evan Osnos, autor of Age of Ambition, winner of the National Book AwardA coming-of-age story set in modern day China centering on the friendship between an American and a Chinese boy who meet while training with Beijing’s Junior National Tennis Team.Chase Robertson arrives in Beijing as a fourteen-year-old boy still troubled by the recent death of his older brother. He discovers a country in transition; a society in which the dual systems of Communist Era state control and an emerging entrepreneurial culture exist in paradox.A top ranked junior tennis player in the U.S., Chase joins the practices of the Beijing National Junior Tennis Team and is immersed in the brutal, cut-throat world of Chinese sport. It is a world in which gifted children are selected at the ages of six or seven for specialized sport schools where they devote their entire youth to the pursuit of athletic excellence and are paid as professionals by the state. Athletes find themselves compelled to do anything possible to succeed—right or wrong. Those who fail to reach the pinnacle are cast aside and are left facing a desperate future without hope.In China, Chase gains access to a culture rarely open to Westerners, and soon finds himself caught up in secrets. When his closest friend and teammate turns to him for help, Chase is faced with the dilemma of what to do when friendship, rules, and morals are in conflict.A big-hearted debut, Beautiful Country explores a friendship against the backdrop of a quickly changing country.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 0062411918"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Harper Perennial; First Edition (April 19, 2016)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780062411914"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062411914"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 - 17 years"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8.5 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 0.72 x 5.31 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#110,693 in Books (See Top 100 in Books) #625 in Cultural Heritage Fiction #1,857 in Coming of Age Fiction (Books) #27,343 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 304 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BARBARA M. PRICE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFWRSGZUGK4MWYC6GM6LALJMN7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11HCBMCXNDC1L?ASIN=0062411918",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2016",
                "reviewTitle": "5.0 out of 5 stars THE BEST KIND OF STORYTELLING...",
                "reviewText": "What a delight it was to read J.R. Thornton's BEAUTIFUL COUNTRY, a book about a young man's year playing competitive tennis in China with the Chinese youth team. A compelling story about the storyteller's literal and figurative journey in his formative years, I was forced to turn the pages and follow his path.We learn about Chase's personal struggle to accommodate a drastic lifestyle change from prosperous east coaster to living among the simple citizens of Beijing. We read of the challenging food choices, strange sleeping accommodations, difficult friendship formations and how he handles the grueling practices and complicated cultural nuances. We observe his team mates fight to survive in a tough, almost life or death struggle to remain on the team. Chase is challenged to the max as he tries like a warrior, and at the same time is compassionate and tender in his effort to understand his teammates, all in a world where he is both \"deaf and mute\" because the language is so extraordinarily difficult.I learned in many dimensions about a life experience in China and the tough psyche of its people. This book is a must read for anyone who loves a great old fashioned story which cannot be put down. J.R. Thornton truly has a great gift for storytelling and we hope there is lots more to come.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anita Galliher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBSA4S2NY4ZSBYYS35KCEWV2DRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G7D6FIN43V5P?ASIN=0062411918",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 9, 2017",
                "reviewTitle": "4.0 out of 5 stars Depends",
                "reviewText": "Your rating of this book might depend on several things. Beautiful Country is about a 14 year-old boy with an incredible amount of skill at playing tennis who is having a difficult time coming to terms with the death of his brother. Subsequently, his father sends him to China to practice with the Chinese national team for a year. If you like tennis and know a lot about it, you will probably like Beautiful Country. Several times I thought J.R. Thornton added \"A Novel\" to the title to differentiate it from a textbook on Chinese history and culture. The story itself was excellent, but there were times when I wanted to shout \"enough already!\" during all the technical tennis terms and history pontifications. There were also lessons in the Chinese language, complete with the Chinese characters, as if we might be able to replicate them or recognize them again. Much Chinese was spoken with the English translation in parentheses. One minute I loved the book, the next I was sick of it. I guess if I absolutely had to say yay or nay to recommending this book, I would say yay. Just be aware of the trappings that come with it.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BKlafter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESUPCVPVFKOAZGCFTH7SVPIFRWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16OD70IRQ1SOS?ASIN=0062411918",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2016",
                "reviewTitle": "3.0 out of 5 stars A decent effort and interesting take on modern China, but hardly engrossing",
                "reviewText": "I was expecting more based upon the description and the other reviews I read. Having traveled to China a number of times on business I found many of the \"insights\" offered by the narrator to be rather obvious, e.g. heavy pollution in Beijing. As an avid tennis player, I enjoyed the portions that revolved around the tennis training, but those also seemed fairly superficial and truncated. All in all, intriguing and lots of potential, but not quite what I would call engrossing.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tyler ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5BIOBTHNKEF6H5CFYB4677A32A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZR65AI4A8ARW?ASIN=0062411918",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2016",
                "reviewTitle": "5.0 out of 5 stars Transport yourself through the eyes of a young American to a mysterious nation rife with contradictions",
                "reviewText": "As someone who first visited China at the age of 13, the author’s youthful perspective brings me back to the first few days I laid my eyes on the Middle Kingdom. The protagonist paints an accurate picture of the cavernous divide between the classes in China. As the reader, you gain insight into these class differences through befriending Bowen (a junior tennis player who comes from a migrant family) and Mr. and Mrs. Zhang (his host family who have deep connections in the powerful government). This book is perfect for the person looking to revisit their time in China as well as the individual looking to transport themselves to a mysterious nation rife with contradictions.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matelasse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSVXYW45DTFVMAFS6KCW6JUNQEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFEGQJK2E0IX5?ASIN=0062411918",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2019",
                "reviewTitle": "4.0 out of 5 stars A nice, pleasant book to read.",
                "reviewText": "This book was a nice, simply written book about a kid going to China to play tennis for a year at his American father's influence. It is sort of a coming of age story and opens the reader up to life at a tennis camp or school in China. I don't want to spoil it. I think anyone who is interested in tennis, travel and learning about a young boy's inner feelings so far from home, would like this book! No swearing, no sex, just a good story. Easy to read and appropriate for young children and teens.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monica Langley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEY3YPQVMOFT2MGPJ5PNJGD2DSRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VRJI7F6SG2QI?ASIN=0062411918",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2016",
                "reviewTitle": "5.0 out of 5 stars Loved it!",
                "reviewText": "I loved Thornton's \"Beautiful Country!\" I found the characters compelling and the plot fascinating. As a high-school senior studying Mandarin, I appreciated and am impressed by the author's incredible ability to observe and synthesize the nuances of Chinese culture. For example, Thornton's paragraph about the importance of the seating arrangement at the dinner table is a topic which I just studied in my Chinese class this past year. On varsity tennis, I connected with Thornton's realistic drama, emotion, and even technical components of the game. Apart from these topics, \"Beautiful Country\" perfectly captures the complexity of growing up in today's world. I'm recommending J.R. Thornton's book to all of my friends!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "robrrt thoburn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4WFMSUJSA7LYHJK7RCG222FGGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YXA0OHCH3TYZ?ASIN=0062411918",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 13, 2016",
                "reviewTitle": "3.0 out of 5 stars Review",
                "reviewText": "Young.man from wealthy connected father sent to China to learn mandarin, practice with national tennis team and learn about China. While there he likely kept a diary to facilitate writing about the experience. He learned about courage and subtle differences of right and wrong. He gained an appreciation of differences in opportunity and the lack of it despite ones ability.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJVXAFLHDDK2DVYHE56V2EFDSZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WHW9L4FAYKHF?ASIN=0062411918",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 11, 2016",
                "reviewTitle": "4.0 out of 5 stars A young man goes to China to play tennis",
                "reviewText": "I listened to an interview with the author on NPR. The novel was about China and tennis. Two of my favorite topics. This novel is autobiographical and although the writing is good, not great, the story provides a look into China and its people that is well worth reading. I was in Beijing myself during the period that the story takes place. I was there only three weeks, and strictly a tourist but I recognized the authenticity of the writing. We in the western world know so little about China. Reading this book is an opportunity to change that.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mealoaf",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 25, 2016",
                "reviewTitle": "A journey of discovery",
                "reviewText": "Wonderful debut novel. Enjoyed the journey into China from a young man's point of view. Unsettling look into the clash of cultures. Especially liked the boys growth in attempting to understand the differences.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Stephens",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 21, 2016",
                "reviewTitle": "Great read. Promising young novelist",
                "reviewText": "I thoroughly enjoyed this first novel by J.R. Thornton. His personal history and insight gave me a vision of contemporary Chinese life that I was not aware of nor prepared for.At the end of the book, I was surprised?, embarassed? or something like that to realize that it is not autobiographical but rather a novel. The author's actual age and timelines did not mesh but it took me the whole book to come to that conclusion.I found his page on internet (don't we all in the end?) and have enjoyed his short stories. I look forward to new writings by Mr. Thornton.Highy recommendable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.20",
                "sellerName": "Prime Goods Outlet",
                "sellerRating": "5"
            },
            {
                "price": "$9.90",
                "sellerName": "libreprime",
                "sellerRating": "5"
            }
        ]
    }
}