{
    "remaining_requests": 799,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Eyes-That-Do-Not-See/dp/B0C4WZRR1F",
    "body": {
        "name": "Eyes That Do Not See",
        "price": "$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Eyes-That-Do-Not-See/dp/B0C4WZRR1F",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51T8WgpLqlL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51aX7pcDTQL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kent B. Kearney",
            "link": "https://www.amazon.com/Kent-B-Kearney/e/B0CC34KT8G/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 49,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"The book's descriptions throughout are really lovely. From Ireland to the Midwest to homesteading. It paints a beautiful picture of what life, land, families, and people were like at the time.\" \"I think this is a fascinating story that will resonate with many readers.\" \"Fantastic job with the histories in the appendix. They are short but really fill in the gaps for readers wanting to know more of the time period.\" \"It may be about family, but it captures a slice of history many will enjoy reading.\" About the Author Kent Kearney is a writer and a landscape artist who lives with his wife, Denise, in Colorado Springs, Colorado. They have two daughters and one grandchild. He was born in Kearney, Nebraska, in 1946 and grew up on a cattle ranch in Custer County, Nebraska which still includes his great-grandfather's original homestead. Eyes That Do Not See is his first novel about the life of his great-grandfather, an orphan, an Irish immigrant, and Confederate Civil War veteran.In 2017 Kent and his youngest daughter took a trip to Ireland in an attempt to find more information about his great grandfather, Henry Kearney, but were largely unsuccessful. They found little about him but learned a great deal about the history of Ireland. He decided to write his first novel using what little information he had about his great grandfather but using the history of the times he lived in.Kent is a graduate of the University of Nebraska in Lincoln with a degree in Business Administration. After graduation he worked in public accounting and became a Certified Public Accountant. He went into private business in the 1970s and in the early nineties he went to work as the Chief Financial Officer for a manufacturing firm in Kansas and retired from there in 2008."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 42 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Discover the inspiring journey of Henry Kearney, from orphan to pioneer, in 'Eyes That Do Not See' - a tale of human resilience both uplifting and captivating.Henry Kearney is orphaned at age 11 after barely surviving Ireland's famine in this historical novel inspired by the author's real-life great-grandfather. No matter the hardships, Henry refuses to let life defeat him as he continues to move forward with tenacity and grit, never giving up his dream of a better life.From workhouses to steeplechase thrills, Henry survives famine ships and Civil War battlefields with unwavering determination in this absorbing tale that unfolds through the eyes of his descendants through a found journal.Eventually, love finds him amidst the chaos, proving its strength in the darkest times. Finally, he settles on the drought-ravaged treeless plains of 1880s Nebraska, where the back-breaking work of homesteading and building a sod house tests his mettle in a story that portrays the challenges faced by immigrants and the spirit of a nation.For Irish heritage lovers, Civil War enthusiasts, and frontier seekers, 'Eyes That Do Not See' is a must-read. The historical authenticity weaves a breathtaking narrative from start to finish and Henry’s journey will linger in your heart and mind for years to come.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C4WZRR1F"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Grandpa's Publishing (May 10, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 260 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8987609002"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.7 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.65 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#308,984 in Books (See Top 100 in Books) #1,298 in Biographical Fiction (Books) #1,339 in Cultural Heritage Fiction #1,383 in Historical British & Irish Literature"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 49 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lulu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBYBSNLGZRDKGK7OF3GEKZAXI4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKAHSRYGA0V03?ASIN=B0C4WZRR1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2023",
                "reviewTitle": "5.0 out of 5 stars The Story of an Irish Immigrant",
                "reviewText": "Henry Kearney was a child of the Great Potato Famine in Ireland. It was during that time that Henry became an orphan and ended up in one of Ireland's workhouse. But a letter he obtained from his father saved him as he was taken out and by his grandmother and his family. Henry had an incredible life as we read about his journey from Ireland to America. His struggles were many both in Ireland as a horse trainer, working on a family farm and then as luck would have it as an immigrant in America. Knowing nothing about America and being somewhat naïve, we watch as Henry is swindled out of most of his money ($40.00), how the Civil War impacted him and how every skill and experience was valuable as he journeyed through life.The book begins with one of Henry's ancestors finds an old notebook detailing Henry's life It was amazing and even more so since the author was detailing his great-grandfather's life. In this book we are given the history of Ireland during the Potato Famine, we read the Irish struggle during that time as well as what it was like to immigrate to a new land. There are faces on these people, faces you will come to cheer on as you learn their history. From the workhouses to a steeplechase jockey, surviving a famine ship, fighting in the Civil War, finding love, and homesteading in 1880s Nebraska, this is not only Henry's life but a remarkable story. Highly recommended.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trudy Rowe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWGBKFSF3ILXMKHL5E7M7EAPEMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SQOMP1H8QTJE?ASIN=B0C4WZRR1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Read",
                "reviewText": "I found this to be an excellent book from two different aspects. First, I learned a lot about the experience of the Irish during the famine, etc., immigration into the U.S. and other historical events. Secondly, I became invested in the outcome of Henry's journey throughout his lifetime. It is a story of perseverance through an incredible number of circumstances that would derail most individuals.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mags87",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOIQ55BNPQZX7KNFNRLNWCVQCCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ULLCEBAH5FWZ?ASIN=B0C4WZRR1F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Interesting historical story",
                "reviewText": "Eyes That Do Not See tells the life story of Henry Kearney. He grows up in Ireland and immigrates to America in the 1800s, going through various difficulties and struggles along the way.I thought the author wrote with a good eye to detail and captured the way the relationships between friends and family impact people. There was also interesting aspects about history, both Irish and American. I’m glad this author chose to share this story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna Leppold",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXGVAL7PGS4VI7W3VY5NZC5ZOVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OF7WI1GTCQWS?ASIN=B0C4WZRR1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Entertaining, Historical, and so very hard to put down",
                "reviewText": "You can tell this book was a labor of love for the author. It was so captivating; I couldn't put it down. I loved the historical references and the detail of the story of the life Henry Kearney. This book captures the historical horror of the Irish people in their own homeland and how they came to America to find and \"work hard\" to make their dream come true. I especially loved reading it because my great grandparents came to America from Ireland because of hardships in their own homeland, but we were only given bits and pieces of what happened. If I could ask one thing of the author, it would be to write more, the detail and captivating stories in this book was so wonderful. I would love more about the family after this book ends. Or maybe other historical books with this much detail and passion in the stories. Thank you for such a great book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHGGCDCL4HFC2BEC2ZV3J3IWNKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RJFQ6G53YBV2?ASIN=B0C4WZRR1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Great read!",
                "reviewText": "Very interesting book with all the history of the potato famine, so much that I had never known. I don’t think we realize how great we have it today and the struggles our ancestors endured just to put food on the table. Henry Kearney definitely had a tough life but his pursuit to give future generations a better life was what I found so fascinating. Thankful for his wife for being steadfast in journaling for we wouldn’t have had the opportunity to peek inside their world. A must read for history buffs and those with Irish roots.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MK Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQ3YBVTOX2RLQFKMXVGT6OEMY4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F6Z6HH2O5PDF?ASIN=B0C4WZRR1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "5.0 out of 5 stars History lessons also",
                "reviewText": "The history at the end of the whole book. I already knew most of it, but Mr. Kearney was very thorough, so it gave me even more insight into our Irish grandparents' plight. I didn't know anything about the Civil War, so that was also very informative.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Female, Minnesota",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBMNK477DLURS5DTL7O6LLLCK5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R345JH4P35SBP5?ASIN=B0C4WZRR1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 6, 2023",
                "reviewTitle": "5.0 out of 5 stars A daughter’s review",
                "reviewText": "Maybe you think a daughter should not post a review of her father’s book, but I would argue that my review might be one of the most important. I went to Ireland with my dad when the seeds of writing this was first planted. I saw how truly understanding the famine for the first time deeply affected my dad and it became his mission to know his great grandfather’s history. I watched him relentlessly research the famine, horse racing, the civil war and homesteading. He wrote the story for himself and his family. He published it for others to know about that amazing generation of Irish immigrants who escaped the famine only to get caught up in their new country’s Civil War. When I read the book, I felt truly connected to my family history and how lucky I am. If you have Irish in your family tree, I’d encourage you to read this book.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pamelag",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAKBSISUUXWP6J2BBETVUZPKV7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B7L474QDCJJM?ASIN=B0C4WZRR1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2023",
                "reviewTitle": "5.0 out of 5 stars An Irish lads Journey to America",
                "reviewText": "This book is about my great great grandfather written by my uncle that makes it more appealing to me personally. The story tells of the iniquities that immigrants had to overcome for a better life. It has information about Ireland back in the 1800’s and also the Civil War, that gave it historical and personal significance to me. I got to read the first draft to my mom his sister and my husband we all couldn’t wait until it was time to read again.A real page turner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}