{
    "remaining_requests": 738,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Seamstress-Acadie-Historical-Romance-Beginnings-ebook/dp/B0C9RLWP5Y",
    "body": {
        "name": "The Seamstress of Acadie: (A Historical Romance Novel of Fleeing War and New Beginnings Set in 1750's Canada)",
        "price": "$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Seamstress-Acadie-Historical-Romance-Beginnings-ebook/dp/B0C9RLWP5Y",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/816zixgJEbL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Laura Frantz",
            "link": "https://www.amazon.com/Laura-Frantz/e/B001UNZNX0/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 249,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158280011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C9RLWP5Y"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Revell (January 9, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 9, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 11694 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 408 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0800745663"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#88,541 in Kindle Store (See Top 100 in Kindle Store) #317 in Christian Historical Fiction (Kindle Store) #364 in Religious Historical Fiction (Kindle Store) #391 in Christian Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 249 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Rose and the Thistle A Heart Adrift Tidewater Bride An Uncommon Woman A Bound Heart",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/35e16a87-9907-48fa-9094-37db279c3863.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/31c6b53a-5ca2-4048-a7dd-f97d93ea26bc.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6ed9fc42-6a38-4431-a250-6f4f8c291506.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee0934c5-ca8f-4768-8b2a-6935e71c3a85.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/875c4bd4-e2b4-4113-9c98-2c7d2764bdc5.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nicole S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVNZDXSZWDBUVU4AJXNCFBBS52Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U27K6LJ8B7F6?ASIN=B0C9RLWP5Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Another AMAZING Story by Laura Frantz...I Highly Recommend This Book!!!",
                "reviewText": "The Seamstress of Acadie by Laura Frantz made me sad. Don’t get me wrong — I agree with all the critics and reviewers who say that Frantz is a wordsmith and that this is her best book yet. The settings are superbly illustrated. I felt like I was in Acadie and Virginia in the 1750s. I could feel the weather; the intense, frigid winter in Acadie, and the oppressive, humid spring in Virginia. I could smell the smells of the apple blossoms in Acadie, and the chocolate in Esmee’s shop in Virginia. The historical detail is impeccable. I learned so much history I’ve never been taught before. I’ve never heard of Acadie, and the atrocities against these people absolutely broke my heart and made me angry. The characters in this novel are perfectly crafted. Sylvie is a wonderful heroine. She is Loveliness personified. And she is so strong. I don’t know if I could be as strong after having gone through all the nightmares she goes through in this story. Will is the best kind of hero. He is tall, dark, and handsome. He is rugged, intelligent, and capable. If Sylvie is Loveliness personified, then Will is Kindness personified. I loved this about him the most — his deeply kind and compassionate heart. Will would give you the shirt off his back if he knew you needed it. I wish more people were kind like Will. In addition to the main characters being outstanding, Frantz treats us readers to cameo appearances by characters from A Heart Adrift and some of the most endearing secondary characters ever. It was so much fun seeing Esmee and her sister, and Lord Drysdale and Henri Lennox again. And I absolutely loved Henrietta, Nolan, Eve, and Eulalie. Seriously such great characters!If you’ve read this far, you might be asking yourself, “How did this book make you sad? It basically sounds like you loved it.” Well, that’s a good question. I did love this book SO much. It touched my heart deeply and, like all Frantz’s previous novels, will stick with me LONG after the final page has turned. But it did make me sad. I am so sick of the evil in this world. As I was reading The Seamstress of Acadie I couldn’t help but notice the many similarities between our current world today. In this book, the villains are bad. In our world, the villains are equally as bad. In both periods, people are self-focused, self-centered, and self-serving. Kindness is a rarity, not the norm. Seeing people as people is a rarity, not the norm. Stealing, hurting, hating, and mistreating apparently are no biggies. Whatever one wants, one gets. Reading whole scenes in The Seamstress of Acadie felt like reading excerpts from today’s news articles. The clothes, the food, and the amenities may be different in this story, but the heart of the people is the same and it made me really sad. But I won’t stay sad because Frantz ends her story with love and hope, so I will walk away from this story choosing to focus on love and hope rather than all that makes me sad.The Seamstress of Acadie is a seriously outstanding story. It is a story that pulls the reader’s heartstrings. It is a story that teaches reader’s history that should never be forgotten. And it is a story that readers won’t soon forget. I highly, highly recommend this impeccable story. This is a book you do not want to miss.I received an eBook copy of this novel from the publisher, Revell, via NetGalley in order to read and review. I also purchased a copy of this novel in eBook form from Amazon.com on October 4, 2023. In no way has any of this influenced my review. The opinions expressed in this review are my own.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shayla riley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEJCIKZCIIAVI32INZ4HXRJKUNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NQRCJFHBAXNY?ASIN=B0C9RLWP5Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Heartwarmingly Tender Story",
                "reviewText": "“Love begins with a smile, grows with a kiss, and ends with a teardrop.”-AugustineI give ⭐️⭐️⭐️⭐️⭐️⭐️ 6 stars!As the year 1754 is drawing to a close, tensions between the French and the British on Canada’s Acadian shore are reaching a fever pitch. Seamstress Sylvie Galant and her family—French-speaking Acadians wishing to remain neutral—are caught in the middle, their land positioned between two forts flying rival flags. Amid preparations for the celebration of Noël, the talk is of much unrest, coming war, and William Blackburn, the British Army Ranger raising havoc across North America’s borderlands.As summer takes hold in 1755 and British ships appear on the horizon, Sylvie encounters Blackburn, who warns her of the coming invasion. Rather than participate in the forced removal of the Acadians from their land, he courageously resigns his commission. But that cannot save Sylvie or her kin…Relocated on a ramshackle ship to Virginia, Sylvie desperately struggles to pick up the pieces of her life. When her path inevitably crosses once more with William’s, they must work through the complex tangle of their shared, shattered past to navigate the present and forge an enduring future…Oh my, there is is so much to say about this heart-rendering, heartwarming, tender, yet beautiful tale of finding joy from mourning and home in the most unlikely places. @laurafrantzauthor has the keen ability to take the reader on quite the journey of emotions with such real and poignant characters that face real tragedy, deep heartache and also, the joy of finding hope again. The Seamstress of Acadie is a poignant story of love-love of family, of our home, of our intended and of God. It is a story that is hard to put down yet, is also one you want to savor through such beautiful and hard moments. This is a book is worth the read!!!“It was just the two of them in this breathless moment, a simple man and woman who’d somehow fallen in love despite their foremost reservations and intentions.”",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CameraCourt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJYS7R2HKBL2DJDKLBAR7DWX4EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W5U200NGJOSI?ASIN=B0C9RLWP5Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars A bittersweet 18th century tale of romance and true history",
                "reviewText": "The Seamstress of Acadie follows a heroine with fortitude, Sylvie Galant, in a bittersweet 18th century tale that explores heartache and hope in a world upended by true historical events. This novel is part historical fiction in content and part a slow burn, unexpected romance, all tucked into a lush account of the era with themes of grief and longing, hope and home.Frantz’s signature ability to stir emotions with her immersive narrative and poignant prose is unrivaled. The mournful events Sylvie and her family are subject to are heartrending, in direct contrast to the brilliant thread of hope and God’s care that overshadows the heartache. I especially love Sylvie’s relationship and dynamic with her older brother, Bleu, and the role he plays in drawing out the integrity of Will Blackburn for the reader to see.With a slow burn romance worth every moment of the reader’s patient investment, characters Sylvie and Will recognize the refuge they can find in each other as they go from tentative enemies to stilted friends to more. And oh, how Frantz pens the attraction between them! Will is the perfect steady counterpoint to Sylvie’s resourcefulness and strength. Their match reminds me of this time of history itself in a metaphorical way — their relationship representative of the things required to survive this time in early American history: commitment, faith, hard work, and devotion.If you’re a devoted reader of Frantz’s novels, you will notice a few familiar characters overlapping into this story from her previous novel, A Heart Adrift, which takes place during the same timeline. Delightfully, Esmee’s chocolate shop makes an appearance, as do Captain Lennox and Esmee’s sister and brother-in-law .My thanks to the publisher and Netgalley for the review copy. This is my honest review.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}