{
    "remaining_requests": 726,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Just-Like-Heaven-Julia-Quinn-audiobook/dp/B0053ET3Z6",
    "body": {
        "name": "Just Like Heaven",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Just-Like-Heaven-Julia-Quinn-audiobook/dp/B0053ET3Z6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51mkS7qa7TL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Julia Quinn",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Julia+Quinn"
        },
        "brand": "Julia Quinn",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 8689,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Honoria Smythe-Smith is: A) a really bad violinist B) still miffed at being nicknamed \"Bug\" as a child C) not in love with her older brother's best friend D) all of the above Marcus Holroyd is: A) the Earl of Chatteris B) regrettably prone to sprained ankles C) not in love with his best friend's younger sister D) all of the above Together they: A) eat quite a bit of chocolate cake B) survive a deadly fever and the world's worst musical performance C) fall quite desperately in love It's Julia Quinn at her best, so you know the answer is... D) all of the above Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10177"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 57 minutes"
            },
            {
                "name": "Author",
                "value": "Julia Quinn"
            },
            {
                "name": "Narrator",
                "value": "Rosalyn Landor"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 31, 2011"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0053ET3Z6"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,564 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #32 in Regency Romance #368 in Historical Fiction (Audible Books & Originals) #584 in Regency Romances"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Rachel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6ANQN4KJFPBTI6SRACXCYR3LPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R118W0Q0VP7VZI?ASIN=B0053ET3Z6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2013",
                "reviewTitle": "5.0 out of 5 stars Surprisingly close to my personal romance heaven!",
                "reviewText": "I read this quite awhile ago, but I'm only just now remembering to review it. (Suffice it to say that promptness is not my strong suit!)Have you ever realized while reading a book that most of the things you're enjoying abut it will be the very same things that many of your fellow bookworms dislike?! And that's what I love about sites like these: It's so much fun to see how we all have different preferences and pet peeves despite sharing a basic love of reading. So I'll try to sum up why this book really worked for me with the understanding that these may be the *exact* reasons why the book didn't work for others :)1) One consequence of devouring as many romance novels as I do is that you---(or at least I)---get a tad weary with certain traditional 'Alpha' heroes: angry, snarling and vaguely controlling men who have slept with half the females on the continent before being \"tamed\" by our ever so special heroine. Some are amusing, compelling and sexy. Others just start to seem like they're in desperate need of an anger management workshop. Marcus was a delightfully charming change for me: a genuinely kind, shy and smart man. Not yet another 'rake' who's slept with zillions of women or a dissolute, destructive lush who needs to be 'reformed.' Instead of the usual arrogance we get from our heroes, Marcus gives us endearing, quietly witty self-deprecation (though rest assured that he's not a neurotically insecure mess!) He's someone I'd genuinely adore and gravitate to in 'real life', which is certainly not a given for me. If you're among my many fellow book junkies who tend to find Betas dull, though, you probably won't be as pleased with either the hero or the overall book as I was!2) If you're looking for a passionate, sensual, dramatic romance...well, you should probably keep on looking :) Oddly enough, though, that's a large part of why I really liked this one. (I warned you that I have odd taste, right?!) I was feeling weary of intense (melo)drama and endless roller coaster-y conflicts and was instead craving exactly the fun, lighthearted feel that this book provides. And I'm not a big fan of long, frequent and detailed sex scenes, so for me the book's focus on the H/h's rapport rather than their physical connection was an asset. For those who prefer their romances to be very steamy, though, be forewarned that this book has far less sex (and even foreplay) than most current romance novels.3) As alluded to above, the characters in this book are generally...well, they're really nice and likable. And they're not, by romance standards, especially tormented or burdened by conflict and angst. And, fittingly, the storyline doesn't have much angst or conflict either. We get the heroine nursing the hero back to health, which is a trope I confess I'm kind of a sucker for, but there's not much suspense as to the outcome. I can very readily see how this might make for a dull, \"so what?!\" book for many, but for me it made for a charming, enjoyable read. Sometimes I'm in the mood for a rich, layered romance with plenty of substance and conflict, and if that's what you're currently craving, I'd stay away from Just Like Heaven. But if you're feeling like you want to kick off your summer with frothy, amusing sweetness and banter-filled fun, I'd recommend giving this one a chance.Julia Quinn is a talented writer, but her books are quite hit and miss for me. I didn't even enjoy most of the Bridgerton series nearly as much as most. (Blasphemy, I know!) Objectively, I know this probably isn't the 'best' book Julia Quinn has written, but I was so delighted to stumble across a lovable Beta hero and a light, funny and charming read that it's actually among my personal favorites. Happy reading!",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sally M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPFBRLUZXS7HLVG7WAWB2HJHJKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R328L2TRT7GDQI?ASIN=B0053ET3Z6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2011",
                "reviewTitle": "4.0 out of 5 stars A cozy, fun light read",
                "reviewText": "What JQ does better than any other romance author I've encountered, excepting perhaps Lisa Kleypas, is the sense of community. JQ does family and friendship so delightfully, and it's because her heroes and heroines don't, as in so many novels, exist in isolation. She's really built up a ton of her own -- she has a cohesive universe, which is something that attracts me very much. All the stories I like best are those with real, complex worlds, that seem to extend outside of the immediate story. It's not something you get with a lot of romance novels, besides the generic historical world -- but JQ's an author who makes her society feel real and expanded, because of all the interconnections.The Smythe-Smiths have been a running joke in her books for, what, a decade now? But always in the shadows, always side characters, never even getting first names of their own -- till now. Finally we meet the notorious Smythe-Smith girls. JQ, wisely, I think, starts with the 1824 crowd, who are the set featured most prominently in other books -- this is, I believe, the set from Romancing Mr. Bridgerton, where Lady Danbury so wisely keyed in on the misery of the cello player.Honoria Smythe-Smith is not the miserable cello player. She's a cheerfully atrocious violin player. Contrary to popular belief, she's aware that the musicales are insults to the composers and painful to anyone with ears. But she doesn't mind. She participates with good spirit because it's family tradition. It's really sweet of her, and a good indication of just how important family is to her. And that, really, is what's driving Honoria in this book -- the need for family. She's the youngest of five, all of whom are married and out of the house, and she's finding her life a little too quiet and solitary lately. So, she's determined to get married, in her third season out on the market. Little does she know that Marcus Holroyd, a friend of her brother's (who is currently hiding out in Italy after an unfortunate duel), is \"looking after\" her in his absence -- which has thus far meant scaring off all of her suitors. They've known each other since she was six years old, when he visited her brother on school holidays. Suddenly, though, he's starting to feel something other for her than duty, and she's seeing him in a not-precisely-fraternal fashion.I don't know if it's because I'm older and more jaded these days or what, but I've started to become slightly annoyed by the Fourth Date Marriage trope. So I really enjoyed that Marcus and Honoria have known each other forever. I like that the relationship is something that's grown over time, not something that manifests over the space of a weekend. The friendship-to-romance story is a quieter kind of story, and in 'Just Like Heaven', it's quite lovely. JQ's always at her best when she gets to write quick, witty dialogue, and Marcus and Honoria get plenty of it. They banter with such an ease that it's not hard to imagine their continual married bliss, cheerfully teasing each other for decades to come.My only complaint about this book is that I feel like the middle section, where Marcus is ill, drags on a bit too long. I'd have liked to have seen more of them back in London, amongst other people -- since JQ does that so well. I wanted more of Honoria with her cousins, I wanted more out of the conflict with Marcus and Honoria's brother, I wanted drama surrounding Hugh and Ramsgate (perhaps they'll be back in another book?). Instead we got an awful lot of sickbed hurt/comfort inaction, and that's just not so much my thing. I could also do with a bit more heat. JQ's primary weakness, I think, as a romance author is that her books aren't always as steamy as they might be. I'd love it if she started taking a few more risks when it comes to the consummation.The HEA is adorable indeed, especially as Honoria sits down to next year's musicale. Her love for her family is just so palpable in that moment. I feel fairly certain that cousins Iris and Sarah will be getting books of their own, but I'm not sure about the frothiest and most deluded member of this year's quartet, Daisy. I sort of wonder if the 4th will be the governess who has to fill in when Sarah \"takes ill\" at the last minute, Miss Wynter; JQ spent what seems like an inordinate amount of time on her, and that sort of thing tends to be a hint for upcoming importance.Overall, 'Just Like Heaven' is a frothy good read. It isn't knock-out-of-the-park amazing, but it's solid and quite charming. This isn't a book if you're looking for epic plot, sweeping dramatics, or dark psychological complexity, but if what you're after is a warm, cozy read, something to take to the beach with you, or to curl up with while you're drinking a nice cup of tea, 'Just Like Heaven' is just the thing.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 19, 2022",
                "reviewTitle": "Wonderful",
                "reviewText": "I love reading this author",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sams_fantasy_reads",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 31, 2023",
                "reviewTitle": "A great read",
                "reviewText": "A would recommend this book, I have read the other Bridgerton books and like those, this does not disappoint. A great start to the new series, a great mix of plot and character building. A great read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emilia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 7, 2023",
                "reviewTitle": "Too slow",
                "reviewText": "I've read quite a lot from Julia Quinn and I must admit this isn't one of my favourite. The love story between Marcus and Honoria is very sweet, they've known each other since forever, they've been like family really and love simply came natural to them. But nothing significant happened in more than half the book and then, almost at the end, too much happened. It's like 70% of the book is deadly slow and the rest rushes to an hopefully satisfactory conclusion. I liked the end and of course Julia Quinn's fun and witty style, but I really hope the next books in the series are better than this",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 18, 2021",
                "reviewTitle": "Great beginning!",
                "reviewText": "Simple but wonderful, as all Julia's stories. You will want to read more titles of this saga!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna K",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 17, 2021",
                "reviewTitle": "Just like love",
                "reviewText": "I’ve had some troubles getting into this book, especially at the beginning. I was quite overwhelmed with all the different people and conversations at first but as the story continued I was rather smitten with Honoria and Marcus. By the time I overcame my first hesitancy I rather enjoyed Just Like Heaven. And about halfway in the story develops into an even greater story than I initially thought. So don’t let yourself doubt this story at the beginning, it brings more love and joy as the story continues and I am really glad I stuck to this book. I really fell in love with Honoria and Marcus and their beautiful and lovely love story.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}