{
    "remaining_requests": 984,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tuscan-Secret-absolutely-emotional-historical-ebook/dp/B07Q38YX7X",
    "body": {
        "name": "The Tuscan Secret: An absolutely gripping, emotional, World War 2 historical novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tuscan-Secret-absolutely-emotional-historical-ebook/dp/B07Q38YX7X",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81PI7xCj8ML._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Angela Petch",
            "link": "https://www.amazon.com/Angela-Petch/e/B00GSN511Q/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 13649,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Il Mulino. An old crumbling mill, by a winding river, nestled in the Tuscan mountains. An empty home that holds memories of homemade pasta and Nonna’s stories by the fire, and later: the Nazi invasion, and a family torn apart by a heartbreaking betrayal.Anna is distraught when her beloved mother, Ines, passes away. She inherits a box of papers, handwritten in Italian and yellowed with age, and a tantalising promise that the truth about what happened during the war lies within.The diaries lead Anna to the small village of Rofelle, where she slowly starts to heal as she explores sun-kissed olive groves, and pieces together her mother’s past: happy days spent herding sheep across Tuscan meadows cruelly interrupted when World War Two erupted and the Nazis arrived; fleeing her home to join the Resistenza; and risking everything to protect an injured British soldier who captured her heart. But Anna is no closer to learning the truth: what sent Ines running from her adored homeland?When she meets an elderly Italian gentleman living in a deserted hamlet, who flinches at her mother’s name and refuses to speak English, Anna is sure he knows more about the devastating secret that tore apart her mother’s family. But in this small Tuscan community, some wartime secrets were never meant to be uncovered…A stunning tale, inspired by true events, about how the tragic consequences of war can echo through generations, and how love can guide us through the darkest times. Fans of Kristin Hannah’s The Nightingale and The Letter by Kathryn Hughes will be captivated.Readers have fallen in love with The Tuscan Secret:‘Wow!... The writing is magnificent… A story of love, lose, secrets and hope… I have truly fallen in love… A beautiful, touching story that I would recommend to everyone.’ Cooking the Books‘An absolutely gripping story of world War II… You must read this book. You can hardly put it down.’ Goodreads reviewer, 5 stars‘Wow what a story… could not put it down.’ Goodreads reviewer, 5 stars‘Boy what an emotional read… I felt myself welling up and on the verge of tears… written superbly.’ The Ginger Book Geek‘Exquisite writing… If you are a fan of Kristin Hannah's The Nightingale, you cannot miss this one… I highly recommend it.’ Goodreads reviewer, 5 stars‘Angela Petch is astounding… a compelling story… an enthralling experience… Highly recommend this as a must-read.’ Giascribes‘This beautifully woven story had me captivated from the start… I could not help but LOVE the descriptions of Tuscany, the countryside, the people and the food.’ Goodreads reviewer, 5 stars‘This was a beautifully told tale… a perfect read… so wonderfully descriptive I could imagine myself there amongst the breathtaking scenery and tasting the delicious Italian food… exceptional.’ Goodreads reviewer, 5 stars‘I was gripped… The author weaves a magical tale.’ Goodreads reviewer, 5 stars ‘A fabulous historical fiction story… wonderful… Angela Petch is now added to my favourite author list… The rich details of the story are captivating. A must read.’ Goodreads reviewer, 5 stars‘Fantastic read… I loved this book...I would highly recommend.’ Goodreads reviewer, 5 stars‘A wonderful story… I was completely captivated… quite heart-breaking.’ All Things Bookie‘Excellent book!... will grab you and hold onto you long after you put it down.’ Goodreads reviewer, 5 stars‘A captivating story… heart-breaking and compelling.’ Stardust Book ReviewsThis book was previously published as Tuscan Roots. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07Q38YX7X"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bookouture (June 26, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 26, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1683 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 356 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#53,746 in Kindle Store (See Top 100 in Kindle Store) #15 in Historical Italian Fiction #213 in Romance Literary Fiction #438 in Historical Literary Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 13,649 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "P. Blevins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5OZRDARE5O55VBCRBHWGYCO5WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MO009SLTOT0Z?ASIN=B07Q38YX7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2019",
                "reviewTitle": "5.0 out of 5 stars absolutely amazing",
                "reviewText": "The Tuscan Secret: An absolutely gripping, emotional World War II historical novel is by Angela Petch. Although this is a fiction story, many of the things she talks about in this book really did happen. Many of the massacres she talks about are authentic. It is inspired by the stories of her Mother-in-law who fell in love and married an English soldier in 1944 in Italy. Angela also leaves a list of materials she used to create this story.Anna was at a crossroads in her life. She was without a job, without a boyfriend, and her mother had died. At the reading of the will, she had received fifty thousand pounds and a box of papers which would be delivered to her later. Her brother received the family home and her sister her mother’s jewelry. It seemed just right to her as she had always felt left out of the family. Her siblings were so much older than she was. Was she a mistake as her siblings had told her growing up or a special gift as her Mother told her? When she received the box, she found her Mother had left her life story for her. However, it was pieced together in journals, school notebooks, a pillow case and anything else she could write on. Part of it was in English; but the majority was in Italian. How was she to read this? It would take her forever to translate it.She decided to go to her mother’s hometown in Italy and try to learn more about her Italian background. Maybe she could get someone there to translate it. What would she find there?The book is fabulous and well-written. It is definitely one which should be read by those interested in history and love.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gail Thompson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP2PNUZDOVUXKSHGY4ZTUXDZRXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O2UVSN5OG3TW?ASIN=B07Q38YX7X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Tuscany and love",
                "reviewText": "Like other books by Angela Petch this one starts off slowly. It takes some reading to get drawn into the story but once in The Tuscan Secret is hard to put down. It is a well written book with great descriptions of Tuscany, Italian lifestyle, and true love.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFE5JJ4KYAA4DXYN4NRYJNYTEXLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VW5TMVNG95JV?ASIN=B07Q38YX7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2023",
                "reviewTitle": "5.0 out of 5 stars The Tuscan Secret",
                "reviewText": "I love this story line, our families have so much rich heritage. And most people don't think.it's important or we just don't take the time to get it written down.I am blessed that my Paternal parents took the time to write things down. Especially, the fact of their time during WWII, and and further back in their history.So, it is imperative that you can get the 1st hand account's from your family.Thank you for for doing your research.Looking for the next book.I really love how Angela brought in PTST.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G. Wilson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3WABOD3DG7J4UIOYODL6IN2Q4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7KKB3PR7HU6P?ASIN=B07Q38YX7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Captivating from page one!",
                "reviewText": "This story is written with such precise detail that it will captivate your senses. You can see and feel each scene, and you will feel pulled into the story. I could not put this book down. The stories from World War Two need to be told, and this was an example of how to tell them well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLOFXUWV3OUEV35XG4KLXROM43Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DZ0TN9Q6KMSL?ASIN=B07Q38YX7X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2023",
                "reviewTitle": "4.0 out of 5 stars Very interesting Story",
                "reviewText": "This story is not what you might expect from a family with secrets. It is Much more important to explain why people have to take chances even though their family may not want them to.Anna wants to take a trip to Italy to find out where their motherLived.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon Alexander",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3YA4LDHIQQGLEIVC6XY7E3JRZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AKCXG068CPZA?ASIN=B07Q38YX7X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2022",
                "reviewTitle": "3.0 out of 5 stars Decent Story But Awful Writing",
                "reviewText": "I was able to finish the story, but the authors style of writing annoyed me terribly. She was far too explicit in describing sex scenes. I don’t equate romance with porn! She used the Italian word agritourismo CONSTANTLY!!! I really wanted her to just STOP and call it the English name already. The story was good, but she was supposed to be reading a diary. It sounded like a novelist writing a descriptive event and very unrealistic. To finish the story I had to pretend I was just reading the story of two women and not a diary that was supposed to be scribbled on bits and pieces in a box.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Chadwick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGE2W2MOB5ENXT5UFUPS4ZY4EZEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28MS0Z5NTXXQB?ASIN=B07Q38YX7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 3, 2022",
                "reviewTitle": "5.0 out of 5 stars Absolutely mesmerizing.",
                "reviewText": "I loved everything about this book. The characters are richly drawn, the Italian village comes alive in your imagination and the description of the location, houses and local food/meals is exceptionally described. Having owned and operated a Bed and Breakfast, I especially appreciated the attention to detail of the amazing meals. I have long read historical fiction from this time period and this book made it's way to a top spot on my very favorites list. It describes in detail the struggles endured both in Italy and England during the war and the sacrifices made by so many. I look forward with much anticipation to reading the other books by this author. Solid five stars!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scubagrl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVI3O6VTVL46GGUAA7QTB4B5LYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R262IXBZG56YGS?ASIN=B07Q38YX7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Another great book about Tuscany",
                "reviewText": "I’ve enjoyed reading Ms Petch’s stories about Tuscany. Makes me want to start planning a trip and learning to speak Italian! Andiamo!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "yvonne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 20, 2021",
                "reviewTitle": "Wonderfully written and mesmerizing story",
                "reviewText": "I disagree strongly with the bad reviews about this novel and agree wholeheartedly with the great reviews.I love a good history book and gravitate towards World War 2 stories. I could not put this book down. It will now be in my top 10 World War fiction favorites.Character development was fabulous. I fell in love with Anna and her mother Ines. But it wasn't just those two that I fell in love with. Her descriptions of Italy, the countryside and the historical landmarks were wonderful as well. Truly a captivating read. The anguish, pain and horror of the war tore at my heart. A very emotional read. I will definitely seek out more novels by Angela Petch. I am very happy I stumbled across this book and Ms Petch and I am very happy I ignored the bad reviews.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "christine lock",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 15, 2023",
                "reviewTitle": "wonderful",
                "reviewText": "A wonderful story of Italy during the 2nd world war. How it affected the people of Italy and England. But a lovely finale, old ghosts laid to rest .",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 14, 2021",
                "reviewTitle": "a great story",
                "reviewText": "a beautiful story which was diffixult to put down",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Helen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on July 8, 2019",
                "reviewTitle": "An emotional read",
                "reviewText": "A beautiful, tragic story set in wartime Italy and the present day. When Anna's mother dies, she leaves her daughter a set of diaries she wrote when she was younger, with precious details of her life. Anna decides to go to Tuscany to retrace her mother's footsteps and find out more.The author leads us along shaded mountain paths, past abandoned villages decimated by German retaliation, lets us paddle in a cool, refreshing stream that can turn into a raging torrent in the blink of an eye, shelters with us in a decrepit old barn, until we finally reach the old mulino where Anna's mother grew up. Each detail is breathtakingly described, with every scene you are drawn further back into the past and the lives of the people who lived at that time.The two stories, both Anna's and Ines', are slowly revealed, peeling away layers until the bare core remains. There are tears, tragedy, and heartfelt moments that keep you enthralled right to the end. Highly recommend.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Niki Talbot",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 28, 2017",
                "reviewTitle": "Lovely book, but sad.",
                "reviewText": "This book is the classic story of wartime romance, which seems wonderful at the time but which can lead to tragic mistakes. I wonder how many of them truly happened and how many people today do not know the truth about their parents and their youth?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}