{
    "remaining_requests": 938,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/World-Without-End-Ken-Follett-audiobook/dp/B000X1MX7Y",
    "body": {
        "name": "World Without End",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/World-Without-End-Ken-Follett-audiobook/dp/B000X1MX7Y",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/513SMf ZAkL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ken Follett",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Ken+Follett"
        },
        "brand": "Ken Follett",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 37839,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In 1989 Ken Follett astonished the literary world with The Pillars of the Earth, a sweeping epic novel set in 12th-century England that centered on the building of a cathedral and the men, women, and children whose lives it changed forever. Critics were overwhelmed, and readers and listeners ever since have hoped for a sequel. At last, here it is. Although the two novels may be listened to in any order, World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are again at the center of a web of love and hate, greed and pride, ambition and revenge. Three years in the writing, World Without End once again shows that Ken Follett is a masterful author writing at the top of his craft. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Family Saga",
                "link": "https://www.amazon.com/Family-Saga-Genre-Fiction-Books/b?ie=UTF8&node=10163"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "45 hours and 33 minutes"
            },
            {
                "name": "Author",
                "value": "Ken Follett"
            },
            {
                "name": "Narrator",
                "value": "John Lee"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "December 31, 2006"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B000X1MX7Y"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,739 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #32 in Fiction Sagas #134 in Historical Fiction (Audible Books & Originals) #161 in Family Saga Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kevin OHagan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIFVDTPRCSBTP2YTFHUB7FPHQHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VM70IJTVTWHO?ASIN=B000X1MX7Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars captivating",
                "reviewText": "I fell in love with all the characters, from the angelic to the vile. You know you love a book when you actually care what happens to all the characters. Thank you Ken for a magnificent diversion from my everyday life.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sean Curley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI7CRLJBRIL5XIRNVRH6QMUMBIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZRRVCRN5AL90?ASIN=B000X1MX7Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2008",
                "reviewTitle": "5.0 out of 5 stars One of the longest books I've ever read, and excellent.",
                "reviewText": "Those looking for a quick read should look elsewhere, but then, the product description could have told you that. I read most of the text in the course of a day (with a lot of time devoted).This is, of course, a sequel to Ken Follett's 80s classic \"The Pillars of the Earth\"; \"Pillars\" wrapped up its characters stories quite neatly, so Follett wisely decides to keep the setting, 200 years in the future, and trace the development of Kingsbridge. The first novel, set in the Anarchy that followed the death of Henry I, saw the area go from a monastery on a backroad on the edge of being usurped by the town of Shiring to a cathedral town with a bustling population, all under the wise guidance of the visionary Prior Phillip, while the displaced children of the Earl of Shiring struggled mightily to regain their birthright. Since then, the town continued to grow, until the reign of Edward III, but the main characters' sacred blood and institutions have, to a great extent, rotted. While some of the main good characters are in fact descendants of Jack and Aliena, the main line, the holders of the Shiring earldom, mostly seem to have become arrogant jerks typical of their social class (excepting Earl William, partly due to having a good wife); meanwhile, the Kingsbridge priory, which under Phillip was a force for good out to forge a new community and advance the cause of God and civilization, has become hidebound, held in the course of the novel by a series of conservatives liable to quash progress. Both are entirely realistic outcomes, and it's a nice bit of unsentimentalism (actually, there are a couple of elements here that almost feel like Follett cynically commenting on some of \"Pillars\"' more optimistic moments; here, there is also a devout, hardworking monk without selfish motives, but he is ruthlessly sidelined instead of advancing to the priorship through good fortune, as Phillip did). Even the foundations of the cathedral are flawed.Our main characters are two brothers, Merthin and Ralph; Caris, the daughter of a prosperous merchant; and Gwenda, the daughter of a convicted thief. While playing in woods one day, they witness a battle between a knight named Sir Thomas Langley and some footsoldiers of Isabella, Queen-consort of the recently-deceased Edward II of England; Langley trusts Merthin to guard the location of a secret letter (as a sidenote, as an historian, I was absolutely convinced I knew what the secret was (indeed, the characters speculate about it), but I was surprised; well done, Mr. Follett), and then secludes himself in the monastery. Unlike the mystery of Jack's father's death in \"Pillars\", this mystery is pretty slight, but the individual characters' stories are fairly strong.As others have noted, one can certainly see certain character types recurring (some, such as the similar profession and proficiency of Jack and his descendent Merthin, are actually noted in-text). One can line up Aliena and Caris (and, to a certain extent, Gwenda); William and Ralph (although Ralph seems somewhat more sympathetic, although he is ultimately just as vile); Warren Bigod and Godwyn, etc. The last of those is rather interesting, since he initially seems to be a good monk in the style of Phillip in the first book, and is even something of a viewpoint character early on, but he quickly becomes a ruthless obstacle. Merthin and Caris' (extremely) lengthy, (extremely) troubled courtship is very similar to Jack and Aliena's, including each having a sojourn to the continent (apart, in the case of this novel), and lengthy periods where marriage is impossible; Caris has an additional wrinkle, since, like many romance heroines, she isn't sure marriage is what she wants, with this taking on particular significance in an era when women became property (many have noted that there's a lot of 21st century feminism present here, and that's true, to be sure, much as with most modern entertainment). Gwenda (despite some similarities with Aliena) is a very different character than can be found in \"Pillars of the Earth\" however, and she often seems to suffer for it in the narrative (that's on top of all her literal sufferings in the narrative); she doesn't really belong in the same world as Merthin, Caris and Ralph, all ambitious middle-classmen with big dreams success (building England's tallest structure, independence, earldom), while Gwenda, the luckless serf, just wants freehold tenantry (which is as big a dream as most in her class will ever realize). Her narrative coequals reach epic heights and depths; she goes as low, but never gets nearly as high, and she is mostly separate from the lives of Merthin and Caris, the latter nominally being her close friend. Through her, Follett does chronicle a revolution in the land organization of England, brought on by the Black Death.The first book was heavy on cathedral architecture description (something Follett has an evident passion for); there's less of that here, but a lot of talk about bridges, which is actually quite interesting. Follett's writing style is about the same as always, familiar to those who've read \"Pillars\" or any of his past work; as many, many other reviewers have noted, there's a lot of explicit sex (as \"Canterbury Tales\" will tell you, people in Edward II's time were as randy as today), and some very gruesome violence, most notably a graphic description of a man being flayed alive. It's compulsively readable.This is a five-star book; not a five-star in the way that \"The Pillars of the Earth\" was, perhaps, but still an excellent read.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Island",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGDTOOW5MXADGYOZWQKL5B52WZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23922YSR9310L?ASIN=B000X1MX7Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2008",
                "reviewTitle": "4.0 out of 5 stars All My Children",
                "reviewText": "Remember, dear readers, that this book is a novel, a work of fiction. It need not be historically accurate. WWE is truly a soap opera, a grand \"As the World Turns\" story of rather vast proportions. It did go on a bit and probably could have for another 500 pages. I am happy it did not. In fact, I wanted Caris, the main heroine, to commit suicide the one time she thought of it, as she wobbled over the edge of Merthin's excavation site of the tower he was building.Follett may not be Gustave Flaubert or Leo Tolstoy and this work of fiction may not be in the same league as the apparent and greatly over-rated \"classics\" that \"Madam Bovary\" and \"Anna Karenina\" are, but you know something? WWE is actually more interesting and a lot more fun to read! I never got past page 650 of \"Anna\" and I hated everyone and the story in \"Bovary\".Two main things to mention. 1) WWE is a fantastic addition to the spate of anti-religious books (all non-fiction until WWE) to emerge on the literary scene in the past 3 or 4 years. It actually is more effective in generating distaste and disgust at the idiocy and stupidity of the Church (and all Christianity) than Hitchens' \"God Is Not Great,\" or Dawkins' \"The God Delusion.\" It even relegates the brilliant Sam Harris to second place status. While Follett may not have MEANT his book to arouse and reinforce all our latent disgust with Christianity, he nonetheless accomplishes that feat easily and forcefully. He's at his best when indirectly condemning the Church and everything about it by merely describing the conduct of its leaders and followers. WWE is about as anti-Christianity as any novel could be. For that reason alone, I loved it.2. Is Follett homophobic? While he revels in a kind of teen-age superficiality about love and sex with straight people, going into some detail about heterosexual intercourse in astonishing locations and between the most unlikely of couples, he seems embarrassed or downright fearful of equally vivid descriptions of lesbian or gay male love-making. Everyone knows, and everyone back then knew, that homosexuality was as common as it is today, and that homosexuality was a REASON to be a nun, monk or official of the Church. One's conduct was reasonably safe. But Follett, while he alludes repeatedly to homosexuality, just cannot or will not deal with it in any sensible way. What a disappointment. As a gay man, if I have to endure explicit heterosexual sex act descriptions, I expect at the least equal treatment for homosexuals!!! If your female characters often sound and behave like Gloria Steinem, then.........maybe some equal print time for gays? Hmmmmm?I whole-heartedly recommend the book for point #1 above and ask your indulgence for point #2 above. Beyond that, the story, as many of the 200+ reviewers here have stated, really has no point (like the TV soap operas), because the characters create and endure or resolve one after the other of various catastrophes and minor triumphs in their lives. They are trapped into an episodic existence, and Follet passes on that fate to the reader. The minor characters are often more interesting and more complex than the 4 heroes, children you meet on page 1 and whose lives you follow for the remainder of the 1,011 pages. I would give \"supporting actor\" awards to many of the minor characters such as Philippa, while at the same time not nominating any of the principal characters for anything. And yet, their lives command your attention. I was drawn to the utter desolation in their lives, the poverty, disease and their demoralizingly pitiful existence -- yes, even those of high rank -- in or out of the Church.Follett is a master at describing in understandable terms the details of construction and engineering. Overall, There is way too much narrative and way too little dialogue. He gets preachy and repetitive far too often. The town's fate is and growth (as a reflection of civilization) is a better theme to follow than the lives of the main characters. The book was poorly edited. Most of the characters are unlikeable if not disgusting. Few of them learn from experience. Violance and abuse of women is perhaps accurately portrayed for the time. The women, for the most part, are more appealing than the men. But none of the main characters would ever be invited to my home -- in 1342 or 2008. Perhaps the story is an accurate description of life in the 1300s. Perhaps not. It doesn't matter. It is a great, epic soap opera (but not a sequel in power or literary value to \"Pillars\"). But it's a fun, if rather never-ending, read. I read it in a week. Follett remains as one of my favorite authors. But, make no mistake, WWE is not his best work, just as \"Da Vinci Code\" was inferior to Dan Browns better book, \"Angels and Demons.\" Read it and revel in it, as I did, as a beautiful condemnation of the Church and Christianity!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Haley M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4ONOMCZRL66TQ6NUCATQ6HVQQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22RQ5XMFSHY41?ASIN=B000X1MX7Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars a great read and sequel",
                "reviewText": "Reading this was like revisiting a fond destination. Although it’s quite different than the first book and possibly less dramatic and traumatic, it’s a page turner. Ken Follett has done it again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roberta Hastings",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL45N7PQCRBILQMZTMKXDWZVK3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRIRRKVB8F00N?ASIN=B000X1MX7Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars A very good read",
                "reviewText": "This book truly held my interest. I normally get bored with lengthy books but I read the first in the series. Now, I’m on to the third.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jean st.Croix day",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2024",
                "reviewTitle": "Gift",
                "reviewText": "I bought it for a gift, they told me they really enjoyed it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DDA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 21, 2023",
                "reviewTitle": "Llegó íntegro",
                "reviewText": "Excelente libro que voy a regalar para Navidad. Gracias!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teresa Cerveira Borges",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 12, 2024",
                "reviewTitle": "World Without End: 2 (Kingsbridge)",
                "reviewText": "Desde o início a história agarra-nos que não conseguimos largar. É uma continuação dos \"Pilares da Terra\", mas som uma história que mesmo não se lendo o primeiro, não nos perdemos nos meandros da vida em Kingsbridge.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alister McNicoll",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 23, 2024",
                "reviewTitle": "from a non historical person",
                "reviewText": "This book has raised my interest in history. It has a focus on buildings which I am more interested in but the story of how people existed with good and bad attitudes really held my interest.The fact we have just passed through COVID certainly added to the interest.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lsh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 31, 2023",
                "reviewTitle": "passionnant",
                "reviewText": "L’auteur parvient à nous plonger à l’époque du moyen-âge, de la guerre de cent ans et de la peste bucolique. Le rythme est soutenu et le lecteur éprouve de nombreuses émotions au cours des péripéties qui se succèdent. C’est la deuxième fois que je lis ce roman et c’est toujours avec le même plaisir. Je le recommande.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}