{
    "remaining_requests": 779,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shadow-Network-gripping-sweeping-historical-ebook/dp/B0C4XJ5TBS",
    "body": {
        "name": "The Shadow Network: An utterly gripping and sweeping WW2 historical fiction novel for 2024! (WW2 Secret Agent Series)",
        "price": "$2.99",
        "originalPrice": "",
        "rawPrice": 2.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shadow-Network-gripping-sweeping-historical-ebook/dp/B0C4XJ5TBS",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81gO7+faEiL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Deborah Swift",
            "link": "https://www.amazon.com/Deborah-Swift/e/B003OJQT4K/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 21,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "‘A superbly plotted historical drama… highly recommended!’ The Wishing Shelf﻿One woman must sacrifice everything to uncover the truth in this enthralling historical novel, inspired by the true World War Two campaign Radio Aspidistra… England, 1942: Having fled Germany after her father was captured by the Nazis, Lilli Bergen is desperate to do something pro-active for the Allies. So when she’s approached by the Political Warfare Executive, Lilli jumps at the chance. She’s recruited as a singer for a radio station broadcasting propaganda to German soldiers – a shadow network.But Lilli’s world is flipped upside down when her ex-boyfriend, Bren Murphy, appears at her workplace; the very man she thinks betrayed her father to the Nazis. Lilli always thought Bren was a Nazi sympathiser – so what is he doing in England supposedly working against the Germans?Lilli knows Bren is up to something, and must put aside a blossoming new relationship in order to discover the truth. Can Lilli expose him, before it’s too late?Set in the fascinating world of wartime radio, don’t miss Book 2 in the WW2 Secret Agent Series, a heart-stopping novel of betrayal, treachery, and courage against the odds.Readers LOVE The Shadow Network!'A well crafted tale… this book did not disappoint' NetGalley reviewer, ⭐⭐⭐⭐⭐'There is action, mystery and romantic entanglements stirred into the story for a fantastically entertaining read' NetGalley reviewer, ⭐⭐⭐⭐⭐'Deborah Swift never disappoints and The Shadow Network is another winner' NetGalley reviewer, ⭐⭐⭐⭐⭐'A joy to read' NetGalley reviewer, ⭐⭐⭐⭐⭐",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C4XJ5TBS"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ HQ Digital (February 13, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 13, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2110 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 376 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20,344 in Kindle Store (See Top 100 in Kindle Store) #140 in Historical World War II Fiction #219 in War Fiction (Books) #251 in Women's Historical Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 21 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "L Gentry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7E5TZGPOIT7W3UYYOGHCN7WNBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTL9VSGM89FOK?ASIN=B0C4XJ5TBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Fake News...WWII Style",
                "reviewText": "Deborah Swift never disappoints and this newest book is another winner. As always, this author enlightened me about an aspect of World War II, the use of black propaganda by the British in the form of fake radio broadcasts. It was fascinating and quite a production, transmitted to Germany and run by the Political Warfare. The heroine, Lilli Bergen, is a German Jewish refugee in England and a woman of many talents. The villain, Brendan Murphy, her ex-boyfriend in Berlin is an IRA/Abwehr agent who shows up to work the radio broadcasts. The result is a pulse-pounding game of cat and mouse in a tautly written plot that kept me turning the pages faster and faster. I love how Deborah Swift writes historical characters and events into her story, intermingling them seamlessly with the fictional characters and plot.Fake news and the threat of fascism are back with us and parts of this book read eerily like today's headlines even though it was WW II. The following quote hit home for me: \"They have a loyalty to a warped dictator and will stop at nothing to see him succeed. It's not about what's really best for the people, it's about them. Them having the right to dictate what's best for all of us.\" This latest book is excellent and I hope there will be another in the series soon. My thanks to NetGalley for the complimentary ARC. All opinions and the review are entirely my own.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Hagen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYDUPW5DELCZLCEAHGJIPUXK7LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RKPI5UPRAGAE?ASIN=B0C4XJ5TBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Her singing helps to fool the Nazis",
                "reviewText": "If you've ever wanted to yell at a character, \"Don't snoop in that room! The villain is coming!\" I think you'll want to read \"The Shadow Network\" by Deborah Swift. Lilliana Bergen, a German college student, seeks refuge in England after her father is taken by the Brownshirts in 1939. Although Lilliana experienced some vary harrowing experiences, she eventually lands on her feet. A radio network that broadcasts false information to the Germans wants a singer. They've learned about Lilliana's singing talent and offer her the job.Thus begins her career in World War II's fake news industry. Lilliana also finds she's attracted to coworker Neil Callahan, who walks with a cane and is burdened by a dark secret. In addition, both have signed the Official Secrets Act and cannot speak about what their department actually does. Naturally secrets attract people-- dangerous people-- who want to know those secrets, especially during wartime.Deborah Swift has added an excellent set of resources at the end of the book. Even though Lilliana and Neil are not real, many of the events are.I recommend \"The Shadow Network\" and Swift's previous WWII book, \"The Silk Code\" if you like to read about WWII espionage. In addition, Swift has many other historical novels that cover a number of time periods. I've enjoyed all that I've read.Thank you to NetGalley for this advance release copy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trudy D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH76SEDLXAUQKO2JWY7JUT5AJW7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26RA7JZEQ7ONN?ASIN=B0C4XJ5TBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Enjoyable, gripping WW2 story",
                "reviewText": "The Shadow Network was a fun way to learn about what might have happened in WW2. There was enough truth within the story that I knew I would be digging deeper into the Shadow Network. I use historical fiction books to guide me in researching and this story is my new best friend.I use historical fiction to picture what it might have been like for my relatives in England during WW2. I use historical fiction to learn of some of the struggles. Stories like this one humanize the War.The Shadow Network is full of action and suspense. The story centers around a radio station that sends false information to Germany. Total brilliance. They used German POWs and enemy aliens to broadcast and entertain.When a spy works his way into the Shadow Network things get very interesting. There is a man he was supposed to kill. There is a woman he has a past with. He is an IRA member answering the Nazi sympathizers. The question is will he get caught and how?So many twists. So much unexpected. So many Oh Wow moments. All of this made for a very interesting",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}