{
    "remaining_requests": 907,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fraud-Novel-Zadie-Smith-ebook/dp/B0BP66G6B7",
    "body": {
        "name": "The Fraud: A Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fraud-Novel-Zadie-Smith-ebook/dp/B0BP66G6B7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71eECNDd+9L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Zadie Smith",
            "link": "https://www.amazon.com/Zadie-Smith/e/B001D0P4CA/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 2541,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The New York Times bestseller • One of the New York Times 10 Best Books of the Year • One of NPR's Best Books of the Year • Named a Best Book of the Year by Publishers Weekly“[A] brilliant new entry in Smith’s catalog . . . The Fraud is not a change for Smith, but a demonstration of how expansive her talents are.” —Los Angeles TimesFrom acclaimed and bestselling novelist Zadie Smith, a kaleidoscopic work of historical fiction set against the legal trial that divided Victorian England, about who gets to tell their story—and who gets to be believedIt is 1873. Mrs. Eliza Touchet is the Scottish housekeeper—and cousin by marriage—of a once-famous novelist, now in decline, William Ainsworth, with whom she has lived for thirty years.Mrs. Touchet is a woman of many interests: literature, justice, abolitionism, class, her cousin, his wives, this life and the next. But she is also sceptical. She suspects her cousin of having no talent; his successful friend, Mr. Charles Dickens, of being a bully and a moralist; and England of being a land of facades, in which nothing is quite what it seems.Andrew Bogle, meanwhile, grew up enslaved on the Hope Plantation, Jamaica. He knows every lump of sugar comes at a human cost. That the rich deceive the poor. And that people are more easily manipulated than they realize. When Bogle finds himself in London, star witness in a celebrated case of imposture, he knows his future depends on telling the right story.The “Tichborne Trial”—wherein a lower-class butcher from Australia claimed he was in fact the rightful heir of a sizable estate and title—captivates Mrs. Touchet and all of England. Is Sir Roger Tichborne really who he says he is? Or is he a fraud? Mrs. Touchet is a woman of the world. Mr. Bogle is no fool. But in a world of hypocrisy and self-deception, deciding what is real proves a complicated task. . . .Based on real historical events, The Fraud is a dazzling novel about truth and fiction, Jamaica and Britain, fraudulence and authenticity and the mystery of “other people.”",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BP66G6B7"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Press (September 5, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 5, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1848 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 463 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,597 in Kindle Store (See Top 100 in Kindle Store) #5 in Literary Sagas #26 in Mystery, Thriller & Suspense Literary Fiction #47 in Historical Literary Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 2,541 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/43246a87-4c89-4492-946c-1d722475c95b.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/892df26b-905d-4cec-85f2-8773e72650bd.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/88fa4534-481f-4fd0-b58a-7879e06412e1.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. C. B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXIFPEDJFTBAJC6GKJ4XF4M25RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXYBSNQ7G7JVM?ASIN=B0BP66G6B7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Great historical fiction and a fun read",
                "reviewText": "Author Zadie Smith has crafted a great novel by starting with actual historical people like William Ainsworth and Eliza Touchet and doing interesting imaginations about their lives. It's a fun, often amusing read and you learn a lot about the UK in the mid 19th century. One suggestion before you begin to read the novel. Go online and read about the Tichborne Trial and Lady Blessington and her salon. You then will understand and enjoy the novel much more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Henry Lieberg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVMFCPFTBF7RS6MR44CIGORTOEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13CB1DPJUN1GO?ASIN=B0BP66G6B7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars A number of frauds.",
                "reviewText": "The characters from the 19th century are amazingly real, as they are taken mostly from real life. The section set inJamaica seemed a bit outside the story, but a good book nonetheless. 8 stars!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Perez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMAIHV3SEBHYM5W6OIZIQSSDYIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDQDFUCGG5K5Y?ASIN=B0BP66G6B7",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 18, 2023",
                "reviewTitle": "3.0 out of 5 stars Interesting but forgettable",
                "reviewText": "In 1870 a legendary legal case excited Victorian England. Sir Roger Tichborne, claimant to a barony and the Tichborne family fortune, found his way back to England after a prolonged stay in Brazil and having survived a shipwreck on his way home —he was presumed dead for years — that sent him in a circuitous route to New South Wales, then the continent. Despite the claimant bearing little resemblance to the original Sir Roger, his mother, upon meeting him, “knew in her heart” he was her long-lost son. There was a catch however… For years, the mother had posted advertisements all over the world detailing the circumstances of her son’s disappearance, offering a reward to someone who would know his whereabouts. Moreover, there were witnesses attesting that the claimant was indeed a butcher who had visited his family upon his arrival. Was the claimant a fraud or the real deal?Mr. Andrew Bogle, a slave Sir Roger’s late uncle had met while managing the Hope estate in Jamaica and brought to England under his employ, met Sir Roger by accident in New South Wales and, recognizing his family association, accompanied him to England to solidify his claim. Mr. Bogle became a social sensation in his own right because of his inherent honesty and mild demeanor. The public, sometimes at odds with the claimant’s story, chose to believe Bogle’s, but was he a fraud? And, if not exactly so, was he at least guilty of unknowingly leading the claimant?Was slavery the greatest fraud of all? If a man’s inherent right is to be born free, how come slavery, after oiling the cogs of the British empire for centuries, was going to be abolished by an act of Parliament?Another potential “fraud” was novelist William Harrison Ainsworth, contemporary of Charles Dickens whom he counted among his friends for some time before Dickens dropped him like a hot potato. Mr. Ainsworth didn’t have Dickens’s talent by any means, but he had a very savvy research partner who provided ample insights and bibliographic material on the historical periods Ainsworth wrote extensively and aimlessly about. He lacked Dickens’s observational skills and talent to chronicle the struggles of the common people, often preferring stories about the nobility, but at one time a novel of his about a famous outlaw outsold Oliver Twist.The Fraud has a complex writing structure, the story moving back and forth between the 1830s and 1870s when focusing on the Ainsworth family, their relationship with cousin-by-marriage Eliza Touchet, and Mr. Ainsworth’s outings with his famous peers. The account of Mr. Andrew Bogle and his family starts in the late 18th century in Africa and moves to Jamaica—where it focuses for a while on life in the Hope Plantation and England in the 1830s—, New South Wales in the 1950s, and back to England in 1870.I had a hard time thinking about what my rating of this novel would be. It is sometimes amusing, informative, somewhat dense but generally enjoyable, yet overall it is very forgettable beyond the page. It tackles issues such as aging, loneliness, marital neglect, gender politics, pressure to succeed, peer envy, systemic oppression, and the economic, social and moral impact of slavery, but all feels heavy handed rather than organic.I wish Zadie Smith had focused on either the story of Sir Roger/Mr Bogle or William Ainsworth’s story on two separate books, and I wish I had liked The Fraud more, but I have read longer books this year that took me less time to read than I spent reading this one.",
                "reviewVotes": "79 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebecca Feldbusch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMIPWTUPXUG7YTQPHLS2ZQ74WPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EGY1Q1D0R8NW?ASIN=B0BP66G6B7",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "2.0 out of 5 stars Who's the fraud?",
                "reviewText": "I cannot understand how this book became a best seller. The only reason I finished it was for a book club I just joined. Of the twelve well-read people in this group only three liked it. The writing was forced and unnatural. The plot, well there wasn't a plot. The characters were unlikable. The only part I liked was the tale of Bogle and the interaction between the authors. I wouldn't recommend it to anyone.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angelo Giacalone",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXXLP4WS2YI6RPTXOHKVI3ZNOXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5SMDEQXT3LSP?ASIN=B0BP66G6B7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars READ IT SLOWLY.",
                "reviewText": "FRAUD IS ANYTHING BUT IN TERMS OF MS. SMITH'S WRITING. IT IS TO BE SLOWLY SAVORED. ONE CANNOT SKIM THIS NOVEL AND UNDERSTAND IT.I WAS SURPRISED THE GENERAL READERSHIP DID NOT IN GENERAL AGREE WITH THE REVIEWS OF CRITICS, BECAUSE IT IS TRULY A VERY ,VERY GOOD BOOK FILLED WITH KEEN OBSERVATIONS ABOUT THE HUMAN CONDITION AND PERCEPTIVE QUIPS. IT IS AN EXTENDED ESSAY ON WHAT IS JUSTICE, FAIRNESS, TRUTH, AND MEMORY. I HIGHLY RECOMMEND IT.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sacramento reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDURKYPN5HV343Y77HNZWYNMV2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RTXBCEI2RYD9?ASIN=B0BP66G6B7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Brilliant prose but choppy and hard to follow",
                "reviewText": "Zadie Smith's writing is brilliant for its fluency, originality, observations and depth of understanding. But there was not much plot. The novel was composed of several elements that were broken up interspersed with each other and jumped around in time, which was often confusing. There were several compelling characters, but as a whole the work dragged and became a chore to finish. The author should have cut a third of the length.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPTDERKFTU6GLDYTOKMGWFBXMNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24VOIILPIAKH6?ASIN=B0BP66G6B7",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "1.0 out of 5 stars A very long and boggy book",
                "reviewText": "This book was read for a book club. The style reminds me of a mash of Virginia Woolf and Charles Dickens. Two authors I am not really fond of. The book tells the story of Eliza Touchet. Like Virginia Woolf’s Mrs. Dalloway, Eliza in her older age reflects back to her youth. She also participates in watching the Tichborne case and takes her hand at writing after being surrounded by writers.The most interesting section was the reading of Andrew Bogle’s life. Fraud permeates the lives of all the characters. While the book touches on ageism, racism,classism and politics the Victorian style writing will make it a book most modern readers will find tedious to read.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KK Bklyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKOKVUITEE7MWQZPORT3DEFWTSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8U0KW73GLGFA?ASIN=B0BP66G6B7",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "3.0 out of 5 stars interesting, but kind of a slog",
                "reviewText": "I am a fan of Zadie Smith so I was looking forward to this book. But I was disappointed. Ultimately this novel of historical fiction was more historic than novel. I think her technique of weaving in actual text of the times was interesting but by the end it became tedious.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Creuza S",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 10, 2024",
                "reviewTitle": "Otima leitura",
                "reviewText": "Texto dinâmico, erudito,intimista, baseado em fato real do século 19.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "markr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 12, 2024",
                "reviewTitle": "A confusing tale, well written",
                "reviewText": "This is a difficult novel to describe. There is little really by the way of plot - the central story is of a Victorian court case where a man is accused of impersonating a wealthy aristocrat, The secondary story is of a rousing to the once very successful writer Ainsworth , contemporary, friend and rival to Dickens and Thackeray. The book also deals with some weighty matters including slavery, women's rights, poverty. class, racism, and sexuality, amongst others.It can be a confusing book at times, jumping across times and locations, but leaving the impression of a well written novel that must have required considerable research given the basis of truth in the story",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bindu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 11, 2023",
                "reviewTitle": "haven’t enjoyed a book this much in a really long time",
                "reviewText": "I’m still reading this absolute gem of a book. I usually wait until I’ve finished but in this case, felt like I had to share a review because I haven’t enjoyed reading a book this much in a really long time. Please buy this book for yourself and for your friends. You need Eliza touchet’s voice in your head, trust me.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "grace Frankel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 20, 2023",
                "reviewTitle": "The Fraud",
                "reviewText": "Rather confusing and therefore difficult to get into the story .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MMM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 3, 2023",
                "reviewTitle": "Compliqué",
                "reviewText": "Je me suis arrêté en cours de lecture. Je trouvais l'histoire ennuyeuse.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}