{
    "remaining_requests": 769,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Love-Blind-Lynsay-Sands/dp/0062019759",
    "body": {
        "name": "Love is Blind",
        "price": "$7.99 $1.25",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Love-Blind-Lynsay-Sands/dp/0062019759",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/819J4mm4WYL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lynsay Sands",
            "link": "https://www.amazon.com/Lynsay-Sands/e/B001H6N4AE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by glenthebookseller.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1585,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 39 mins",
            "$3.98 delivery Monday, March 4."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "British & Irish",
                "link": "https://www.amazon.com/British-World-Literature-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10016"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Avon; Reprint edition (June 30, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Mass Market Paperback ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062019759"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062019752"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.19 x 0.96 x 6.62 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#391,686 in Books (See Top 100 in Books) #316 in British & Irish Humor & Satire #3,331 in Humorous Fiction #8,882 in Regency Romances"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,585 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Liz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIEOUA6DAF6QMMOIT5OVLMTEDTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J8ZT7NYL5UIP?ASIN=0062019759",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 8, 2016",
                "reviewTitle": "5.0 out of 5 stars This book was FANTASTIC!!! I loved the suspense, chemistry btwn H/h, humor, secondary characters and overal feel to the book.",
                "reviewText": "I really enjoyed reading this book! I read some of the bad reviews and don't agree at all with them. I took a chance reading this book because of the descriptors of the book. It paid off! I thought the chemistry between the hero and heroine was great. The suspense and internal conflict of the characters were written very well, so that I could see how the events transpired as they did. I would highly recommend this historical romance that clearly shows you love can make you blind, but that helps in overcoming ones fears.********CAUTION POSSIBLE SPOILERS AHEAD> PLEASE STOP NOW IF YOU DON\"T WANT READ ANY SPOILERS>THANKS**********Hero and heroine meet at a ball. Hero has been badly scarred, in his face, from war injury and is very self-conscious. After he came back from the war he was treated horrible by society, 10 years before. He was basically bullied and had a horrendous event with someone that would have driven me to seclusion as well. The man was hurting and living in fear of even more rejection and humiliation. If anyone has been bullied, or had loved one bullied, you know of the fear that is almost paralyzing that keeps playing in your mind about being humiliated and rejected again. This drives the hero in some of his decisions that some bad reviews mentioned. However, they failed to mention the reason behind these bad decision that to me explained the behavior and made me understand why he did what he did. As you read the book you will read his internal dialogue and descriptors of how he reacts to his fear. He freezes in place, literally runs in fear to hide when he thinks the heroine can see him and will reject him, and feels a lot of guilt about her not having glasses but his inner fears are stronger than his guilt. However, don't doubt the love he has for the heroine. He has had a lot of trauma that has fed into this misconception of himself and will take time for the heroine to help him heal and feel secure in her love.So moving on, he finds out she has hard time seeing and overcomes his fear to go talk to her. He finds her attractive and is being pressured by his mother to settle down. Upon approach they hit it off. He finds himself comfortable with her and attracted. He loves her sweet, easy going personality. He also sees that her decision not to wear glasses is not because she is vain, but because of her horrible step mother. This sets off the beginning of a very entertaining and beautiful courtship. I love the many ideas he devises to get heroine alone so he can court her. He is very caring and sweet. He goes out of his way to please her. He is head over heels in love with her.The reason he has to sneak around is because the step mother is horrible. She treats heroine badly and at the end it is revealed way. It goes with along with the saying you made your bed now sleep in it. So the hero needs to sneak around to be able to court the heroine and does a great job of getting all his family involved. His mother is overjoyed hero has found happiness since he left to the war, and that was more than 10 year ago! So the family works together to help the hero court the heroine and are very welcoming of the heroine when they finally are able to get together.Unfortunately, hero realizes quickly someone is trying to kill the heroine! Everyone assumes she is just being clumsy. Even the bad reviews kept mentioning she has so many accidents that she can be killed from them and they state it is because she does not have her glasses. Well those people skimmed the book because they did not read the part where the hero is scared for the heroine and hires private investigator to help him find out who is trying to kill the heroine. Her \"clumsiness\" can't explain some of those horrible accidents. He has to save her several times and is scare he will lose her. The suspense is great and the final climax scene was more forgiveness than revenge.Heroine was very sweet and forgiving. She sees the beauty of everything and so laid back. She is the type of person that can't hate anyone. She is easily influenced, naïve can also be description, and gullible. It is what makes her cute and loving. Those cheerful and almost ditzy type of people that bring out the best in situation would also describe her. Well I loved her!! She is exactly what the hero needed in his life after all abuse and suffering he went through. He felt so happy around her. She was his light. She was his salvation. I loved their chemistry!!!!Heroine does have an unfortunate incident from her past that actually has caused and continues to cause her problems. It was not her fault but I can see how she was easily manipulated into that incident. The way it is described I can see how a dashing older, war hero, fortune hunter can manipulate feelings of a sweet, innocent, naïve, young girl into running off with him. Heroine did not beat herself up for it. Realized to late he tricked her but in retrospective realized how happy she was that her father did right thing and saved her before it would have been irreversible! I hate when I read books that force heroine to marry or stay married to save face to fortune bad people that trick them. I loved the heroine's father because he loved her and was more interested in saving her as person than what saving face with society. Yes, he went into seclusion to further protect he but he was not going to let her happiness stand in the way of what society thought. Heroine's father loved her and wanted to see her happy more than anything so he pressed charges on the guy and had marriage annulled.I highly recommend this book!!! It is complex, so make sure you read it and don't skim because then you will miss things that make this book great!!! This is a safe read. Hero is loyal and loving from the get go. There is no OW or OM. Hero is heroine's first. The love scenes were very sexual and added to their chemistry. The humor was great. Also, unlike other books by Ms. Sands there is no use of body parts revealed to add comic relief. The humor is very well written in the internal and external dialogue. I really enjoyed this book and would highly recommend it.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Care Vee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG22FIYSUUZ5OT27SFAPSZ34GUCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HAJHHPVQLODT?ASIN=0062019759",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars It was cute!",
                "reviewText": "I won a giveaway for a different story by Sands, and after reading it I wanted to look into other books she has written, leading me to buy this one.It was a cute love story! I like the pacing of this author. I think I read too many slow burns sometime. It’s nice to just have the characters love each other, even if they don’t quite know it at first. I might into her supernatural works next. But I recommend this one for anyone looking for a period lit with a sweet love story and humor.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marilyn Rondeau",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESJ4DADFVN3US6YJTGZHZ7VLYMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y935XMHB6CYS?ASIN=0062019759",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 21, 2006",
                "reviewTitle": "5.0 out of 5 stars Charmingly Delightful",
                "reviewText": "Lady Clarissa Crambray isn't totally blind, but without her spectacles her near-sightedness makes the world around her an entire blur. This condition has caused some very embarrassing moments for Clarissa even though her nasty stepmother has forbidden her to wear them stating that would-be suitors would not find her attractive wearing them. Additionally, a long-ago scandal when she was twelve doesn't help matters in attracting the most eligible of bachelors.Adrian Montfort, the Earl of Mowbray has avoided society since he was badly scarred in the Napoleonic wars. Self-consciousness over his disfigurement added to his reclusiveness but at the urging of his family he now knew he must find a suitable wife. Finding Clarissa to be self-effacing, witty, as well as not being able to see his scars, he arranged to meet her secretly. When another unfortunate `accident' found them compromised a wedding was inevitable, but when Clarissa received her new spectacles would she still feel the same for him? Of course, if Adrian didn't discover who was trying to harm Clarissa, the issue of her spectacles would be moot.*** This was another charmingly delightful read that fans of Lynsay Sands have come to expect from this master wordsmith. The development of both the main characters was pure perfection and they were flawlessly cast together. I could empathize with both their feelings of inadequacy. Adrian, once so handsome the angels would have wept, would naturally feel self-conscious over his facial disfigurement, especially with the incident that occurred with one particularly unfortunate intimate dalliance. Clarissa was developed from the very beginning for the reader to instantly embrace and love. Putting these two dynamic characters together was nothing short of brilliant. In knowing Clarissa couldn't see his scars allowed Adrian to relax enough and discover that she wasn't quite the walking disaster everyone proclaimed. The addition of a bit of suspense in discovering who was trying to kill Clarissa was a bonus, and her forgiving nature towards those that had tried to hurt her only made loving this heroine inevitable. Suffice it to say, Ms. Sands is an author that writes a love story that puts a smile on my face from the beginning to the very end leaving me totally entertained and extremely satisfied.Marilyn Rondeau, RIO - Reviewers International Organization",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lugal78",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6VYYF2T6PHFPCUHMK27WH5KTJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4UXJ1WPWD0V4?ASIN=0062019759",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Love this story!",
                "reviewText": "I loved this story and as a fellow blind as a bat, I felt bad for Clarissa because I know what it’s like to only see blurs when not wearing glasses! The story was funny and you can’t help but love both Clarissa and Adrian. Keep them coming Ms. Sands!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tammy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXWCVP7NXL5UBTYNXFECOOVV3RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z02NDG40GFM8?ASIN=0062019759",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 12, 2023",
                "reviewTitle": "3.0 out of 5 stars OK",
                "reviewText": "This book was just ok.I liked how they met and how sweet Adrian was when he was getting to know Clarissa.But the story got really slow and I found myself skimming some of the pages and Clarissa not being able to see without her glasses got really old .I thought it was cruel Adrian continued to let her struggle without glasses because of his insecurities.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phyllis Lopez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5A2VQHK5WFXYSIDTXBPFGJYG5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R0GSNTJHXPDN?ASIN=0062019759",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2023",
                "reviewTitle": "5.0 out of 5 stars How Could You Not Fall In Love With This Book!",
                "reviewText": "The story of Lady Clarissa Crambrary and Lord Adrian Monfort. This story was magical. Lyndsay Sands is one of my favorite Authors, no matter what she writes about. You feel apart of all her books. Can't wait for her next book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 30, 2022",
                "reviewTitle": "It starts off a bit slow but towards the end it is awesome",
                "reviewText": "Another great book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "priya20",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 2, 2022",
                "reviewTitle": "Good read",
                "reviewText": "Its a good read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beladam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 3, 2020",
                "reviewTitle": "Foi tão maravilhoso!",
                "reviewText": "Fiquei tão feliz de ter lido esse livro. Que casal maravilhoso, que história maravilhosa! Mal posso esperar para ler mais histórias dela!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 27, 2017",
                "reviewTitle": "Effortless fun",
                "reviewText": "This is a sweet funny romance, and pretty entertaining even if it does follow an inevitable Lynsay Sands formula.After short sighted Clarissa loses her glasses she meets scarred war veteran Adrian Montfort. As a romance with Adrian develops Clarissa is afraid he will find her ugly if she replaces her spectacles and Adrian is happy that she can't see his facial scar. In the background a mean stepmother and (this author's standby) a secret assassin flesh out the story.There are slapstick moments as Clarissa stumbles around having accidents in stuffy ballrooms, but it's her frank and engaging personality that provides the best entertainment. This book gets five stars not for originality but for the charm of its heroine and for being such effortless fun to read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anais Caron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 10, 2015",
                "reviewTitle": "Pas bien indiqué",
                "reviewText": "Le commentaire sur le livre avant achat ne prévenait que des page jaune. Le livre était abîmé sur la couverture. Je sais qu'il était d'occasion et donc déjà usé mais il aurait été mieux de prévenir de l'état d'usure avancé du livre en plus du jaunissement des pages.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.15",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            },
            {
                "price": "$8.55",
                "sellerName": "indoobestsellers",
                "sellerRating": "4.5"
            },
            {
                "price": "$8.90",
                "sellerName": "ZiFiti",
                "sellerRating": "5"
            }
        ]
    }
}