{
    "remaining_requests": 830,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Douglas-Bastard-Sequel-Black-Trilogy-ebook/dp/B0968X5V3Y",
    "body": {
        "name": "The Douglas Bastard: A Historical Novel of Scotland (Archibald the Grim Series Book 1)",
        "price": "$4.99",
        "originalPrice": "",
        "rawPrice": 4.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Douglas-Bastard-Sequel-Black-Trilogy-ebook/dp/B0968X5V3Y",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91xWxf2n6YL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "J R Tomlin",
            "link": "https://www.amazon.com/J-R-Tomlin/e/B002J4ME1S/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 894,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0968X5V3Y"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Albannach Publishing (April 26, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 26, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1323 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 185 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#584,995 in Kindle Store (See Top 100 in Kindle Store) #587 in Historical Scottish Fiction #667 in Medieval Historical Fiction (Kindle Store) #1,066 in Medieval Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 894 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Charles Harris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI26DZZIUJ2XVZZGSDIAFWN3HFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R284L4SWI08IES?ASIN=B0968X5V3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent read!",
                "reviewText": "I have become a fan of this series of books. The author weaves the historical with writing that draws you in and makes you feel that you are witnessing a historical event. The battles are exciting and you become one with the action! Well done!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Benny 806",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAB6BFP5BJOWN35AO5ODAV5CQ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CPZ5TRSDRE0N?ASIN=B0968X5V3Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Good book but way too short",
                "reviewText": "This is another excellent book by this author. I have read many of her books and enjoyed them immensely. I am not a big fan of series, although when books are long and can stand alone, they are more tolerable. I am rather surprised how short each book in this series is. I have read through the first two so quickly I actually went online to check the page count and was shocked to see they are all about 200 pages. I am very disappointed as this probably should have been two books at the most. I will finish the series because it is well written and captivating, but will likely not buy into a series in the future that is structured like this one. I would have given it 5 stars otherwise.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Bailey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEISBEL65YQWRW7PHPW677W6WMMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IWANXEYY41UD?ASIN=B0968X5V3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Another Gripping Tale of the Black Douglas Line",
                "reviewText": "Tomlin has returned us to a time when the true king of the Scots was a early teen, waiting in France for his followers still in Scotland to make it safe for his return to claim his crown. it is seen through the eyes of the bastard son of the Black Douglas, and his rise to knighthood through the bloody struggle against Edward's England. Bold jousts, deadly battles, brave victories, and treachous infighting for land, titles, and wealth fill the pages and hold the reader's interest until the end. Book two is a must-read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Becky Hanne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3MAVXGVB6OFLKH4FPQV4DEYRAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FX79XCPYLN2I?ASIN=B0968X5V3Y",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2023",
                "reviewTitle": "3.0 out of 5 stars good but missing an ending",
                "reviewText": "I thought this book was good but it is missing closure. It is an interesting book about Archie Douglas. This time period is fascinating to me.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara Mojica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEH57Y3PUA5IGSQC4I3RN573HTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30SM0PSPD8R35?ASIN=B0968X5V3Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2023",
                "reviewTitle": "4.0 out of 5 stars SCOUNDRALS AND HEROES",
                "reviewText": "An interesting choice for young adults and adults who enjoy medieval history. Narrated from the perspective of a nine year old boy, Archibald Douglas, who is orphaned in fourteenth century Scotland and exiled with the Scottish king to France.It follows the career of Douglas as he passes through the stages of knighthood and eventually returns to Scotland to revenge the king. The author has a lot of experience with nonfiction so there is much attention to historical detail. The language with Scotish inflection is sometimes difficult to follow. Tomlin attempts to remedy that with an extensive glossary.This book is part of a series. Readers who seek a satisfying ending of Book One may be disappointed. For readers who enjoy history with interesting characters and battle scenes, this series will fit the bill nicely.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPOEKSPBDDBV5FKVRNY2JV6Q5MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R89IGGWGQF37C?ASIN=B0968X5V3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars A great series of books.",
                "reviewText": "I bought the first book in the series and quickly bought the 3 remaining books in the series. Very well written and all the books held my interest throughout.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John R. Sheehan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAYLO5YFQAF6AH4GVQE766MAKZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CTHIE09XSLG2?ASIN=B0968X5V3Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Good News - Bad News",
                "reviewText": "There's good news and bad news. The good? The writing is smooth, the author paints pictures efficiently without long descriptive passages, the characters are well-drawn, the plot is both active and within the bounds of real history and there are enough surprises to keep the reader interested and turning pages.The bad news? I admit to a personal bias, but I miss the days when a book was complete. This is book 1, and is written to leave issues unresolved, plot questions unanswered, and in no way does it come to anything resembling a conclusion.Now for some folks, they will be the target audience and will hustle away to buy the next book. I tend to make a note to myself about the author as someone to avoid in the future. This is a common technique these days to boost sales. I understand it - and I really hate it. So - lights and shadows, you have been warned.",
                "reviewVotes": "41 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L D Tanner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSNO6KGKCBLV5XDKBOBIBIE6ZVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQTX0D2X59XIP?ASIN=B0968X5V3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Intriguing Start to Archibald the Grim Series",
                "reviewText": "\"The Douglas Bastard\" by J. R. Tomlin is the first book in the series about Archibald Douglas, the bastard son of James Douglas, during the reign of King David II in 14th Century Scotland. It is a coming-of-age story about Archibald, orphaned as a nine-year-old boy and exiled to France with the young king. Archibald is placed under the care of Sir William Douglas, with whom he returns to Scotland to take back castles and lands from the English, setting the stage for King David's return. Archibald rises in rank from squire to knight and ultimately fights in the disastrous Battle of Neville's Cross, where the king is wounded and captured.Author Tomlin has created an intriguing tale told from the first-person perspective of Archibald as he matures from an idealistic boy to a battle-hardened young man who becomes dishearted by the political machinations of noblemen pledged to fight for the king. Though conditioned to obey his superiors, Archibald sometimes disregards commands and openly questions Sir Williams' brutal act of capturing and murdering a rival, whom the king had appointed as constable of Roxburgh and Sheriff of Teviotdale.Vibrant descriptions of historical events ring true, such as a tournament hosted by the English during a temporary truce. The final chapters vividly describe the gut-wrenching horror of battle at Neville's Cross. Archibald fiercely fights to protect his king, but he soon recognizes the hopeless situation when disloyal commanders and their men retreat and abandon them.For those unfamiliar with the history of Scotland, it may be difficult to grasp how some of the characters are related to each other. The dialogue uses the Scottish dialect, but a glossary that defines the distinct terms is helpful.Those who enjoy reading medieval Scottish fiction should find \"The Douglas Bastard\" to be an intriguing start to the epic saga of the historical figure known as Archibald the Grim.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 5, 2023",
                "reviewTitle": "A great historical read",
                "reviewText": "A great historical read weaving a bit of fiction into the Scottish medieval period. You can't help but love Archie as he grows into the soldier he is to become .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephen ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 16, 2024",
                "reviewTitle": "Good",
                "reviewText": "Love these books",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathie Dunn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 3, 2023",
                "reviewTitle": "A riveting, fast-paced historical adventure",
                "reviewText": "The Douglas Bastard is the first in this trilogy about Archibald Douglas, also called Archibald the Grim, bastard son of Sir James Douglas, the fighting companion and loyal friend of King Robert the Bruce.I've been fascinated by the gripping story of The Black Douglases for decades. A fascinating family that grew in power: bravery in battle, political intrigues, murder plots...The novel starts in France, at Chateau Gaillard, where David, the Scots King in exile, and his court stay during his years away from Scotland. In his entourage is a young man of illegitimate birth, who has just lost his mother. With Sir James Douglas dead fighting the Moors in Spain, he has become an orphan at not even 10 years of age.The young David regards Archie as a friend, so he lets him train with the other young boys at court, something Archie relishes. Not for him letters and learning...When Sir William of Liddesdale arrives, Archie sees his chance at escape and convinces the knight to take him on as squire. To his delight, Sir William agrees, and Archie soon follows him to Scotland, where his training continues. But it doesn't take long until the wilful boy causes trouble, and more than once, Sir William has to show Archie his limits...In Archie, the author has created a wonderful character of his time. Brave, cocky, a fast learner, always listening in the background to political shenanigans and plots, Archie grows up in a harsh, dangerous environment. Often, he joins Sir William on forays to relieve castles of their English garrisons, and on attacks into the north of England where he tends to cause trouble for his lord.All the while, Archie learns about the political machinations, the petty jealousies of the Scots lords, and their own ambitions. He's intelligent, and fast to react to situations. And, in my mind, he's very clearly the man Archibald the Grim was in real life. Bold, assertive, somewhat rash.This first novel is about Archie's teenage years, his growing up at Hermitage castle, finding his feet amongst all the legitimate nobles. He has the confidence to confront anyone who disses his status, claiming (rightly) his descent from one of the great heroes of the first Scottish Wars of Independence.The narrative can be confusing at times, as we have many repeated first names. They weren't too fussy in those days, so we find several Williams, for example. And the complex nature of Scottish noble families means that many share the same surname. But this doesn't distract too much from Archie's adventures.The novel gives us a real sense of the medieval setting. The historical research of the era is impeccable, and the author added a note when the story deviates from history. And I must revisit my old copy of The Black Douglases by Michael Brown, a non-fiction history book the author recommends, too.I really like Archie, and I can't wait to see where the author takes him in Trust and Treason, the next novel in the trilogy.The Douglas Bastard is a fast-paced, adventurous ride across medieval Scotland, showing her continuing fight for independence from an overbearing neighbour, the determined English King Edward III.A highly recommended read for readers of authentic historical fiction, and for all those (like me) who love to read about the Scottish fight for freedom.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marilyn Zechner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 5, 2023",
                "reviewTitle": "mem",
                "reviewText": "Well written and emotional book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Atl Canuck",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 7, 2024",
                "reviewTitle": "better than average read",
                "reviewText": "For me, as a writer, Tomlin catches my attention...above average",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}