{
    "remaining_requests": 982,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/March-Geraldine-Brooks/dp/0143036661",
    "body": {
        "name": "March: Pulitzer Prize Winner (A Novel)",
        "price": "$10.78$10.78$7.10$7.10",
        "originalPrice": "$18.00",
        "rawPrice": 10.78,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/March-Geraldine-Brooks/dp/0143036661",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Zp12ZujHL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Geraldine Brooks",
            "link": "https://www.amazon.com/Geraldine-Brooks/e/B000APM13Y/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Shakespeare Book House and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 6072,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 3 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 17 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Books (January 31, 2006)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0143036661"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0143036661"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 18 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 7.76 x 5.22 x 0.64 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,997 in Books (See Top 100 in Books) #47 in Contemporary Literature & Fiction #186 in Classic Literature & Fiction #532 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 6,072 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e59a9c7b-0a74-4d0c-9e87-6a9652280e49.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bonnie J. Clark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHD4NFYTGKI5U3KM7D3MAFAMWZXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIE56PUN69RR?ASIN=0143036661",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars What an incredible read…",
                "reviewText": "Having read “Little Women” many many years ago, and hardly remembering it, “March” brought back many memories. I felt it most informative and delightful to hear Mr. March’s side of the story. His telling of his absence from his family, in summary fashion brought be make to the March Household. His further narration of the events he encountered during his time of enlistment enlightened me (once again) about the civil war and the horrors of the fight for emancipation of the blacks.I often wondered as I read this first half of this story whether March would ever return to his family. His reunion was, however, as I had expected,. I need not say more or I’d ruin the story for the reader.I’ve read two other books by Geraldine Brooks and I’ve been impressed with all three.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynne M. Spreen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQBLVNKKEY42NRZI6BKV6RURJDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WDTANYVU9YL?ASIN=0143036661",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Well written",
                "reviewText": "In this civil war story, the father of Alcott's Little Women writes back from the battlefield as he talks about his life and his current circumstances. March (he is called by his last name) is an idealistic, gentle man. His wife, as depicted in this story, is a temperamental person, passionate about her work as a stop on the Underground Railroad, but her temper is like a demon living inside her, and she often loses control and wounds people. March talks about his life from single young adulthood to courting his wife to fatherhood and soldier. It's interesting, if gritty. He's in love with his wife, but an old flame, in the form of a redemptive (of course) mixed-race woman, saves him and his wife over and over again. I gave this book high ratings because it was well-written, but March and his wife both annoyed me too much to recommend it.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teresa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVG3AF2OBK2COFCVCHMHTIWXSVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RA32MMCJL3OQ?ASIN=0143036661",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Simply fabulous",
                "reviewText": "I enjoy the writing of Geraldine Brooks so very much. She is fabulous at transporting you to the time period through her words.Simply fabulous!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miriam Ketani",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6EOZROGUJRWAA7JM5NWTFU4G5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10UOIRS1QOF4E?ASIN=0143036661",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2022",
                "reviewTitle": "3.0 out of 5 stars I think the author may have bitten off more than she could chew",
                "reviewText": "The novel is supposed to be from Mr. March's point of view, but there is too much of Bronson Alcott's philosophies and beliefs, with a glob of anachronism. To really learn what the March parents were like, you need to read both parts of Little Women, AND read the follow-up, Little Men. Marmee was nowhere as hot-headed and belligerent as in this book, and she was always doing for others as well as her girls. She was compassionate, not passionate, and although she tells Jo that she is angry every day of her life, the only hint of it is her folding her lips when reading Aunt March's scolding letter that had the money she needed to get to her husband. Father was portrayed in Little Women as a gentle, wise man whose feelings of what is right lead him to give priority to helping his country, even though it means leaving his wife and 4 daughters to manage without him. He is a sage who lifts up his daughters with his wisdom and support. There is not a hint of the tortured soul in Louisa May Alcott's writings that is portrayed in the novel March.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary E. Trimble",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMSMFZQIIGKSIY7PKJGRHXM65GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JW3ICKKDK7MV?ASIN=0143036661",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2022",
                "reviewTitle": "5.0 out of 5 stars I loved this story.",
                "reviewText": "March, a novel by Geraldine Brooks, published in 2006, has as its main character the absent husband and father from the beloved classic novel Little Women by Louisa May Alcott that was first published 138 years earlier, in 1868.March, written in first person in the voice of Robert March, begins by recalling when he was a single young man from the North peddling assorted goods to people in the South. He stops at a plantation and is given lodging as a guest. He meets Grace, an extraordinary young black woman who is educated, unusual at a time when it is illegal to teach a slave to read.Years later March, now forty years old, a scholar and minister, returns to the South as an Army chaplain to aid the Union cause in the Civil War, leaving his wife and four daughters behind. He stays at a plantation that has been ravaged by Union soldiers, the once lovely home trashed, crops burned, livestock and tools confiscated, leaving owners and the now freed slaves without adequate resources to make their livelihood.Although it is now legal to teach Negroes to read, March finds resistance among many in the South. Nevertheless, he endeavors to educate those on the plantation where he stays, carving out letters in the dirt, sharing with the former slaves his meager supplies and food. During this time he writes letters to his beloved family, which is consistent with the previous novel, Little Women. March again comes into contact with Grace under very different circumstances.March is a remarkable novel, steeped in the details of another time. War is always ugly, but even though the concept of emancipation was honorable, the means of obtaining it often caused hardship to those it was meant to save. The novel is beautifully written with descriptive passages: “The heat of late afternoon closed in around us like an animate thing; you could feel it on your skin, warm and moist, like a great beast panting.” I loved this story and am impressed with the concept of a story continuing from another, a classic, written so long ago.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. S. Ven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXTNHYDXANKSJMOUCNSAAJBX4AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7AZJ6QRTYB7F?ASIN=0143036661",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "4.0 out of 5 stars The Companion to Little Women",
                "reviewText": "Historical Fiction. 2006. 320 pages. 2006 Pulitzer Prize. This book is the story of Robert March, the absent father in Louisa May Alcott’s Little Women. March is a minister and abolitionist who witnesses the brutality of slavery when he travels to the south as a peddler during his late teens. He witnesses this brutality and depravity inherent in slavery during this time and becomes an abolitionist. This book portrays March as a very flawed human being who often makes mistakes and is sometimes difficult to understand or even like. Maybe it is this very humanness that makes you keep reading and hoping that he makes a few good choices. Brooks writing is brilliant. She weaves history with Louisa May Alcott’s Little Women seamlessly together so that it is extremely realistic and believable and ultimately a masterful literary accomplishment.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 23, 2022",
                "reviewTitle": "The other side of Little Women",
                "reviewText": "Like the other book (Horse) I read by this former journalist/war correspondent author, in this narrative a historical event/period is experienced in a new and profound way through the personal experiences of a few of its heroic but hitherto unknown protagonists. Here the dramatic event is the American Civil War, portrayed with unspeakable cruelty and pervasive prejudice on both sides. Since it is written in the first person, both the style and the dialgue reported seem to be in keeping with the historical context and the cultural and social background of the characters. Quite a tour de force for the author, who by her own admission has immersed herself in personal letters and journals of the times. Aesthetically beautiful prose and gripping storytelling make it an instructive and satisfying read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "richard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 3, 2022",
                "reviewTitle": "Great condition",
                "reviewText": "For a pre loved book, it was in extremely good condition. Read this book many years ago, and decided to re Read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Beans",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 21, 2020",
                "reviewTitle": "Just ok",
                "reviewText": "I expected more, and probably would have liked it better had it not tried to be connected to Little Women. The moments, phrases directly lifted from that novel felt jarring in this one, taking me a bit out of the story.I did however find it easy to read and interesting to learn about aspects of the Civil War that were completely unfamiliar to me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Les West",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 16, 2023",
                "reviewTitle": "Superb writing: harrowing narrative.",
                "reviewText": "Geraldine Brooks always writes wonderful prose and researches her subjects so thoroughly that the characters and situations she depicts seem astonishingly real.March, like all her works, is superbly crafted.Having said that, the reader should be aware that this book portrays scenes from a brutal war without tempering the horror in any way. If you want to fully appreciate this book you need to be prepared to witness many disturbing incidents.It’s very much worthwhile reading the afterwords to this book, to fully grasp its origins and structure.Very highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paracelsus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 19, 2013",
                "reviewTitle": "Ingenious",
                "reviewText": "Probably no adult who grew up in an English-speaking family is not familiar with Louisa May Alcott's \"Little Women\". Brooks has had the ingenious idea of telling the fate of Father March, who is present in Alcott's book only in his absence. Brooks spins a fascinating story of his experiences during the American Civil War that is hard to put down. I ordered this book after reading and enjoying Brooks's \"Year of Wonders\", and was not disappointed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.78",
                "sellerName": "Kevabooks",
                "sellerRating": "5"
            }
        ]
    }
}