{
    "remaining_requests": 1002,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Childrens-Blizzard-Novel-Melanie-Benjamin-ebook/dp/B088F2ZFDL",
    "body": {
        "name": "The Children's Blizzard: A Novel",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Childrens-Blizzard-Novel-Melanie-Benjamin-ebook/dp/B088F2ZFDL",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/819WDrzZfNL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Melanie Benjamin",
            "link": "https://www.amazon.com/Melanie-Benjamin/e/B002OKJ45G/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 3795,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B088F2ZFDL"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Dell (January 12, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 12, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 6744 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 369 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0593499476"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#46,336 in Kindle Store (See Top 100 in Kindle Store) #61 in Literary Sagas #378 in Historical Literary Fiction #580 in Saga Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 3,795 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/66fbdd9f-4722-4cc8-9570-f4f9151c1b6d.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a668a414-fedd-4294-ad0e-0ddbb275b1ed.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9bcd4598-2e55-40bc-a94f-84aa8beaeabe.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cathryn Conroy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW6562N3JURITICBRTMOQFVZVDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F0RJUU7SWI8X?ASIN=B088F2ZFDL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2022",
                "reviewTitle": "5.0 out of 5 stars Brilliant Storytelling, Exceptional Writing: It Grabbed Me on Page One and Never Let Go!",
                "reviewText": "On the afternoon on January 12, 1888 a blizzard like none anyone had ever experienced before quite suddenly hit the Great Plains, killing hundreds of people and livestock. The morning had been atypically warm for January, so children went to their one-room schoolhouses without their winter coats, hats, and mittens. The blizzard hit just as school finished for the day. This book is the story of what colloquially became known as \"the schoolchildren's blizzard\" because so many of them froze and died on their way home from school that day.Masterfully written by Melanie Benjamin, this is a fictionalized account of a very real event. With a multilayer plot that exposes the best and worst of humanity, the book follows two sisters ages 16 and 18, both schoolteachers, who react very differently to the storm and how they protect the little ones in their charge. One sister is lauded as a heroine, while the other is disparaged as a murderess. One little girl, a child who is so unloved and unwanted that she had been sold as a hired hand to another family who treat her horribly, is caught in the storm with her only friend. How will they survive? And then there is the newspaper reporter, a man who was banished from a big New York City paper to the wilds of Omaha. He stops drinking and pitying himself long enough to venture onto the snowbound Nebraska prairies to report the tragic aftermath of the storm.The real power of the book is the story of what happens to all these characters after the storm. When you get to that part, you won't be able to stop reading.This novel grabbed me from page one and never let go. The brilliant storytelling, finely developed characters, exceptional writing, and extraordinary descriptions of the icy cold, pounding snow, and howling winds almost made me feel I was there. (Yes, when I read this book, I snuggled under a warm blanket. Of course, I did read it in January.)But the best part of the book is the characters, all of whom seemed like real people with all the desires, foibles, hurts, and hopes that humans have. It is this, more than anything, that propels this book into something great.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI5VCHPLUZJDBXZ5BUL2RVDNAEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H3T326RPJMSA?ASIN=B088F2ZFDL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2021",
                "reviewTitle": "4.0 out of 5 stars A fast start, a long finish…",
                "reviewText": "Verdict: A well-written piece of historical fiction that most readers will enjoy. It does a great job of immersing the reader in middle America (the Great Plains) with immigrant homesteaders during and following the blizzard of 1888. There were some pacing and plot issues for me but not enough to not recommend this book.What’s it about? Out on the “godforesaken” plains, two young school teachers are about to dismiss their students for the day when a “terrifying” blizzard arrives without warning. The children are without their heavy coats due to the unusually mild conditions earlier in the day, and the school house is a good distance from their homes. Who wouldn’t want to know what happens next?The story is mostly about Raina and Gerda Olsen, two teenage sisters, who are school teachers in different parts of the Dakota and Nebraska territories. Both are boarding with other homesteaders in order to have a job as a teacher. The book begins quickly with both having to make life and death decisions for themselves and their students when the surprise blizzard arrives. Should they keep the children inside the drafty and poorly constructed one room school houses with the chance of running low on wood for their stoves and freezing to death – or should they send the children home, hoping they won’t get lost in the white-out conditions. The decisions at this moment will impact the survivors for the rest of their lives.Alas, this is also the story of 11-year-old Anette Pedersen, a servant girl, sold by her parents to an uncaring family (who also board Raina, one of the teachers). We follow Anette in her miraculous journey through the blizzard and in its aftermath. Her story is probably the most heart-wrenching in the novel.And it is also the story of Gavin Woodson, a newspaperman from back East who spent the last few years writing highly embellished stories for state boosters and railroads interests to lure northern European immigrants to the “Garden of Eden,” the Nebraska Territory. His is a story of redemption for helping to bring these settlers to a “pitiless land,” and young Anette becomes his vehicle for that redemption.The book is based on a real event and oral histories of survivors. The original storm was called the Schoolhouse Blizzard or the Children’s Blizzard because so many either perished or suffered great injury.The Story (plot and character): The majority of the story is told in third person from various POVs including the teachers Raina and Gerda, newspaperman Gavin Woodson, and the very young servant girl Anette Pedersen.The book starts off with a bang. After a few introductory chapters to set the stage and introduce the characters, the blizzard arrives in the book almost as it is described in real life – a fast, early surprise for the reader! And the plot and pace race through the blizzard as the characters make tough decisions, suffer greatly, and directly face the blizzard’s peril. The author does an excellent job of allowing the reader to see the world through these characters. Their emotions, actions and reactions, and the impact of the social and physical environment on their lives are well done. The characters are brilliantly developed with all the warts and beauty of what you see in real life. The fathers are not all heroes, the mothers are not the protectors of all, and the children have more than simple minds.But then there is the second half of the book. How do you sustain such a story in the aftermath? In a typical tale, we’d build up to the blizzard, and it would likely be the climax. Yet much of this story occurs in the aftermath. We obviously want to know what happens to these main characters (and others). Yet the book almost seems like two stories: the fast-paced, blizzard followed by a drawn-out this-is-what-happened-to-these-folks story. The first half occurs mostly in a matter of hours (days if you include some of the first few introductory chapters) while the second half occurs over years. That cut into my rating a bit but it’s not a huge issue.What’s good about the book? The writing is wonderful – her style of fictional prose seems just right, balancing the plainness of the language and environment of the day with descriptive narrative that places you in the story. In short, it’s not too plain and not too flowery.The setting and plot are nicely woven together. Though the story is historical fiction, the author succeeds in her own stated desire to tell the story behind the story. There’s just enough historical background to help the reader learn about the period and the associated challenges while keeping to the heart of the story. And a blizzard in the heart of America in the 1800s is of great personal interest to me.Characters are well developed, and such as in real life, have all the flaws and goodness we readers can identify with. Though I didn’t closely identify with any one particular character, I think some readers will.What was not so good? As stated above, it felt like two books in one. There were also a few places in the second half of the book where the plot lagged or jumped around a bit. Some readers have stated that the number of characters was an issue; it was not for me.There were also a few spots where the characters seem to act out of period, like they had today’s beliefs and culture. Still not real bothersome….it IS fiction.Bottom line: This is a good read. It gives the reader the fictional opportunity of experiencing the tough life of the homesteaders of the 1880s while throwing in a blizzard to boot. I recommend it.",
                "reviewVotes": "62 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Waters",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEE4BWW4DT6DO3MU36SJ4TTOHT3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KDZ0Z05I5E9F?ASIN=B088F2ZFDL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Melanie knocked it out of the park on this one...",
                "reviewText": "Melanie Benjamin did a great job on this book about a little known tragedy that occurred in the US. The characters and story-line are very engaging and keeps the readers interest throughout. After reading her book, I did some additional reading and found that she was commended for her depiction of the event which is understandable given the quality of her writing. I especially liked the aspect of interweaving the prairie and nature within it as an additional character, I found that aspect like a balm at times that helped the reader understand the beauty that those who lived there experienced.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kazhu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 31, 2021",
                "reviewTitle": "This is going to be a good one",
                "reviewText": "I have only just started this book; maybe about 20% in. So far I am loving the story and the writing style",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Mad One",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 10, 2022",
                "reviewTitle": "Excellent! Read if you loved Little House on the Prairie",
                "reviewText": "Two out of the three members of this household absolutely loved this book, and the third has dementia and swears they already read it (they haven’t) If you love the book synopsis, you will love the book - it lives up to and delivers its full potential and it’s easy to fly through this since it’s both compelling and easy to read and enjoy. I recommend it to people who love the Little House on the Prairie books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vera-Lee Nelson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 13, 2023",
                "reviewTitle": "Interesting",
                "reviewText": "Well written",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vivienne Utriainen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 4, 2021",
                "reviewTitle": "This book is based on an actual event.",
                "reviewText": "The book introduced me to an era and way of life I know little about. Homesteading in western states of the US at the end of the 19th centuryRailways had spent a lot of money putting in lines and stations but the population was so small, they weren't breaking even. To help, the government issued enthusiastic propaganda about the joys of homesteading. Unfortunately, the land was not good and crops fell prey to droughts, extreme heat, locusts etc.Also gives a clear picture of the one room schools, under the leadership of teenage girls.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}