{
    "remaining_requests": 1024,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Four-Winds-Novel-Kristin-Hannah/dp/1250178614",
    "body": {
        "name": "The Four Winds",
        "price": "$10.77$10.77$9.59$9.59",
        "originalPrice": "$18.99",
        "rawPrice": 10.77,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Four-Winds-Novel-Kristin-Hannah/dp/1250178614",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91TM7gPW0uL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kristin Hannah",
            "link": "https://www.amazon.com/Kristin-Hannah/e/B000APANXE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Florida Dealz 4 u and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 149436,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"The Bestselling Hardcover Novel of the Year.\"--Publishers WeeklyBook of the Month Club's Best Book of 2021 Selected for The Texas Library Association's 2022 Lariat Adult Fiction Reading List \"The Four Winds seems eerily prescient in 2021 . . . Its message is galvanizing and hopeful: We are a nation of scrappy survivors. We’ve been in dire straits before; we will be again. Hold your people close.”―The New York Times \"A spectacular tour de force that shines a spotlight on the indispensable but often overlooked role of Greatest Generation women.\"―People\"Brutally beautiful.\"―Newsweek\"Epic and transporting, a stirring story of hardship and love...Majestic and absorbing.\"―USA Today\"Through one woman’s survival during the harsh and haunting Dust Bowl, master storyteller, Kristin Hannah, reminds us that the human heart and our Earth are as tough, yet as fragile, asa change in the wind. This mother’s soul, suffering the same drought as the land, attempts to cross deserts and beat starvation to save her children with a fierce inner strength called motherhood. A timely novel highlighting the worth and delicate nature of Nature itself.\" ―Delia Owens, author of WHERE THE CRAWDADS SING \"A powerful, stirring, wind-swept tale set in Depression-era America that makes your heart break and soar in equal measure. An escape into the past with timely echoes to the present. Kristin Hannah is a classic storyteller and The Four Winds sees her at the top of her game.” -- MATT HAIG, New York Times bestselling author of THE MIDNIGHT LIBRARY\"Wow. I have been left with a bursting heart. Prepare to go on a journey. The story of Elsa and her family will sweep you up on its wings and plunge you to the depths of feeling. This novel is crucial for our times: although set during the Great Depression and the terrible dust bowls, it holds up a mirror to our current world and asks us to look and to understand deeply. It is a story of migration, poverty, prejudice - it shines a light on a crisis that is all too real in today’s world. Yet, it is also a story of love, family, unbreakable bonds, bravery and hope. I will never forget the characters, what they endured and how they hoped and loved. I feel that I will be forever touched by them. I loved this book so much!\" --Christy Lefteri, author of THE BEEKEEPER OF ALEPPO\"The Four Winds by Kristin Hannah is a captivating, heartbreaking tale of a family who will do anything for each other ― and everything to survive. The strength of Hannah’s prose brings the characters to life in a way that will make you unable to tear yourself away from them. You will celebrate their triumphs, mourn their tragedies, and commend their bravery.Through it all, it is easy to feel Hannah’s desire to honor those who lived and fought through this devastating time in history. The Four Winds is also an ode to the strength and ferocity of mothers, and a declaration that sometimes, love is the only thing that holds us together.Above all else, The Four Winds is merely a really good story, one that hits you in all the right places and will keep surprising you until the end.\"―Associated Press\"One woman’s journey exemplifies the hard choices families faced when confronted with survival versus a sense of home.\"―GoodMorningAmerica.com\"Hannah brings Dust Bowl migration to life in this riveting story of love, courage, and sacrifice...combines gritty realism with emotionally rich characters and lyrical prose that rings brightly and true from the first line\"― Publishers Weekly (starred review)\"Outstanding.... [A] rich, rewarding read about family ties, perseverance, and women's friendships and fortitude.\" ― Booklist (starred review)\"The Four Winds is a sweeping epic about an American struggling to keep her family afloat. It feels eerily timely as it highlights the ways women rally during a national crisis.\"―Real Simple\"A heartbreaking but beautiful story of sacrifice, courage, love, and hope. Grab the tissues.\"―The Skimm About the Author KRISTIN HANNAH is the #1 New York Times bestselling author of more than twenty novels, including The Nightingale, The Great Alone, and The Four Winds. A former lawyer turned writer, she lives with her husband in the Pacific Northwest."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 15 hrs 8 mins",
            "FREE delivery March 2 - 11 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 6"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"The Bestselling Hardcover Novel of the Year.\"--Publishers WeeklyFrom the number-one bestselling author of The Nightingale and The Great Alone comes a powerful American epic about love and heroism and hope, set during the Great Depression, a time when the country was in crisis and at war with itself, when millions were out of work and even the land seemed to have turned against them. “My land tells its story if you listen. The story of our family.”Texas, 1921. A time of abundance. The Great War is over, the bounty of the land is plentiful, and America is on the brink of a new and optimistic era. But for Elsa Wolcott, deemed too old to marry in a time when marriage is a woman’s only option, the future seems bleak. Until the night she meets Rafe Martinelli and decides to change the direction of her life. With her reputation in ruin, there is only one respectable choice: marriage to a man she barely knows.By 1934, the world has changed; millions are out of work and drought has devastated the Great Plains. Farmers are fighting to keep their land and their livelihoods as crops fail and water dries up and the earth cracks open. Dust storms roll relentlessly across the plains. Everything on the Martinelli farm is dying, including Elsa’s tenuous marriage; each day is a desperate battle against nature and a fight to keep her children alive.In this uncertain and perilous time, Elsa―like so many of her neighbors―must make an agonizing choice: fight for the land she loves or leave it behind and go west, to California, in search of a better life for her family.The Four Winds is a rich, sweeping novel that stunningly brings to life the Great Depression and the people who lived through it―the harsh realities that divided us as a nation and the enduring battle between the haves and the have-nots. A testament to hope, resilience, and the strength of the human spirit to survive adversity, The Four Winds is an indelible portrait of America and the American dream, as seen through the eyes of one indomitable woman whose courage and sacrifice will come to define a generation. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Griffin (March 14, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 480 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250178614"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250178619"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.45 x 1.2 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#590 in Books (See Top 100 in Books) #1 in 20th Century Historical Romance (Books) #15 in Small Town & Rural Fiction (Books) #35 in Mothers & Children Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 149,436 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KymmLisa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZBGYDOCJNZ3MWESR3ZNKRJDUDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D9RGQ3Y8X1BT?ASIN=1250178614",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2021",
                "reviewTitle": "5.0 out of 5 stars The Great Depression Does Not Make For a Cheery Book!",
                "reviewText": "And she's done it again! Kristin Hannah has a way of taking me on a journey into the past and leaving me with feelings of shock, sadness, anger and more knowledge than I started with, but she's also a master at taking all of that and showing there are those who, with the courage, strength and resiliency to survive, can change their stories in history, even change history itself. Lift themselves up, carry on and show the strength of the pure human spirit when everything around them is in tatters.The Four Winds is not the book for you if you're looking for an easy read that you can just blow through (no pun intended) and say, \"Yeah, that was great.\" No it's a real story of a horrible time in American history. I chose this one to read right away because it dealt with The Great Depression, it seemed especially relative to me right now. What I would call a timely book for these times. As we go through what's being labeled as the worst economic disaster since The Great Depression, I wanted to know what went on to the marginalized people of our nation in the 1930's. Historically it's the underserved, poor and devastated that suffer in times of crisis, we're seeing it happening again and I wonder will we ever learn? What's it going to take? When is enough enough?Elsa Martinelli hasn't had an easy life, her family shunned her, she just wasn't pretty enough to warrant attention from them. But it's her life after marriage that the book concentrates on. Elsa finds herself in a new town, living on a farm with her in-laws within the Great Plains of America, what will soon be called The Dust Bowl after years of drought and failing farms, hungry families, mountains of dust being blown and covering everything in it's wake and little hope for change. She's a farm girl now and calls the Plains her home, but after years of trying to live in a place where the dust is burying them more every year, crops will not grow without water and it's become dangerous for her to stay, Elsa decides to migrate West to California with her daughter and son. A feat that she never dreamed she'd be able to do. They suffer greatly trying to make it across the country in an old, broken down truck, just the three of them. I would think in the 1930's a woman alone, with only her two young children would have to have been the bravest of the brave, the determined few who would do anything to find the American dream!Once they reached the Golden State their hopes and dreams of a new home, friendly neighbors and jobs, soon becomes a real life disappointment. There are no jobs for the thousands and thousands who are like Elsa trying to escape their dire circumstances and continue with their hopes of the American dream. Soon they'll have to settle for a spot in one of the many immigrant tent cities, where Elsa is again challenged to provide for her children as best she can. She finds a job picking cotton, but then goes through the injustice of the greedy owner. Her soul is constantly being chipped away, but she persisted! The residents of California are nothing short of mean and nasty to these immigrants and won't even give them a chance. They are taunted with names, discriminated against at every turn, left to suffer on their own, but Elsa is not giving up. It's so important to her to teach her children what's important in life and try to keep them in school, education will further their dreams for a better future. This will not be an easy task for Elsa, but she's become a tougher than nails kinda gal and doesn't stop trying any more than she'd stop loving her children,After meeting up with an activist/communist who has a heart for the downtrodden and wants to help, she encounters the other side of greed. Someone finally understands the nightmare she and thousands of other families are living through. She's hesitant at first to get involved, after all he is a communist, and during the 30's that was not the label you wanted attached to your name. Elsa's daughter has grown up to be a smart, independent thinker with ideas of her own, I loved to read that teen girls in the 1930's were not that much different from the 1990's when I was going through the hell of a teenage daughter with a strong independent personality who thought she knew it all. Anyway, her daughter sees things as a simple right and wrong conversation, but the realities of surviving are left to her mom, the one whose been particular about how honest she is with her for fear of scaring the kids or allowing them to think they're less than. She's one heck of a mom in a time when trying to care for oneself is hard enough, but to raise strong, resilient children is almost impossible.This will be another book that doesn't leave me soon. Both my parents survived the Great Depression, but for personal reasons never talked much about it. Every once in a while when my dad would tell a story of his childhood I could detect from the settings he used that he was one of the very poor in the 1930's. Little food, torn and outgrown clothes, no jobs, no money and hardship at every turn, but then I listen to stories my mom told and she was of the upper class and didn't go through any of this. I've always wondered how can this be? They lived miles from one another as kids, both of their sets of parents were hard working and caring people, the difference was money. It angers me that those who have are always making the decisions for those who don't . Blame it on capitalism, racism, cronyism or any other ism you can think of, to me it all boils down to a lack of humanity towards your fellow man/woman. When does kindness, caring and assisting those less fortunate come into the conversation? Are we again going to argue over ism's and whose right or wrong, or are we going to say enough is enough and begin treating others like we'd like to be treated, you know the golden rule we all learned as kids!I love Kristin Hannah and the way she can take a story of horrible circumstances and people's struggles and turn them into a need to read novel. Her research is always impeccable and her characters are real people with real problems and desires. Their stories need to be told, even though these are fictional characters, there are millions of everyday people who can relate to Elsa's strength, determination and persistence in her quest to better themselves in a world that's never on their side. The everyman/woman we all want to see make it. Through Hannah's books we get the chance to go back in history, hear the stories and see the resiliency of the human spirit again and again. Some are saying this one is just too depressing, yes it is, but sometimes we need to be uncomfortable in our own skin to have our eyes opened. Maybe because this story is being retold all over the US right now. Greed over need, power over what's good and just. sound bytes over action. This is a timely read and one that needs to be told. I suggest also reading Hannah's acknowledgements in the back of the book, it gave me insight into how she decided to write this one, what her inspiration was and a bit about where she stands on this nation in pain. Yes folks she's done it to me again, I don't cry over books, but this really rocked me. The Four Winds will be blowing through my mind for some time to come. Happy Reading!",
                "reviewVotes": "208 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Winona Cross",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSG6JLKJITDPBPEMSJDZRRN5KOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20VB43LOZ4O1B?ASIN=1250178614",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Family ties, historical about the Dust Bowl",
                "reviewText": "When Elsa, who believes herself to be unattractive and useless in a family that treats her \"less than others\" finally gathers enough courage to sneak out of the house and see what it's like to go someplace other than church she meets a young man and gets pregnant. Her family forces her to marry the boy she doesn't really know.In time the successful wheat farming Martinelli family learns to love her and her children with acceptance and more love she has ever experienced.The Dust Bowl days and years begin near Dalhart, Texas causing hardship that worsens year after year. Elsa finally decides to go to California to start anew with her children after her son develops a lung condition.California is filling up with emigrants day by day. Work is almost nonexistent. Families live in squalor and disease. They are taken advantage of by the wealthy farmers.Eventually, Elsa and her children join others to protest the conditions. Many injuries and deaths occur from violence while continued illnesses, deprivation, and giving up take many lives.Having known families who experienced the dust bowl this book broke my heart and stole it at the same time. Kristin Hannah does her research and it always shows. I gave this book five stars because it is brutally honest with strong characters who think they're weak and poignant attention to emotional detail.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JanS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDLP6MSUVHCOTYBBVJRHWPPTAGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15ZM6SR1590KK?ASIN=1250178614",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "4.0 out of 5 stars Raw honest truth",
                "reviewText": "I devoured this.book and stood with Elsa Martinelli as she struggled with her awkward life and her longing for something better. This novel tells the story like it really was during the 30s dust bowl and massive migration to California where the migrants were sure they could find work and feed their families. The Great Depression took its toll on them all. Then couple that with greed and power and these folks were in for the fight of their lives. I wanted to give this book 5 stars but this author broke my heart when she let Elsa die. I cried with grief and anger at the injustice of it all. If you have strong beliefs and fortitude you will enjoy this realistic Grapes of Wrath story. So powerful.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6L4L3EG3ZM5IFIXRH5ZLWXI5BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK9URFU9WGXUN?ASIN=1250178614",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Really good Historical Fiction",
                "reviewText": "I just finished reading this book for my book club. I am not normally someone who likes Historical Fiction, but found this book so engaging and insightful. The author notes that she did make up the characters and events, but they are based on actual events and things that would have happened during the time frame she is writing about. She also gives a list of historical readings and resources if you would like to learn more about what happened during the time period.I did not know much about the Oklahoma/Texas dust bowl and what it was like for people to travel to California in search of a better life. I was shocked at what it was really like and how we treated our own people that were in search of starting a new life and being able to provide for their families. This book sparked my interest in learning more about the time period. It was a great story that kept me wanting to find out what would happen next. I had a hard time putting it down.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 7, 2023",
                "reviewTitle": "Better than the Nightingale",
                "reviewText": "I gave this novel a try after all the positive accolades. I wasn’t expecting much, but was hoping it would be better than the Nightgale, which was a generous 4/5 for me. This met and exceeded my expectations. It’s much better written, very gripping, with flawed characters that you want to root for. There is so much history and I loved learning what I wasn’t taught in school. The daily hardships of life at that time and in that region were brought to life in such a moving way. The struggles of a single mother were so eloquently developed and described. The dialogues felt real and human. This kind of book makes you appreciate life in the 21st century, and be grateful for all the things we take for granted.To those giving this book a low rating because of the ending: 1) grow up; 2) perhaps you should stick to the Hallmark channel; 3) what better ending than your child achieving what you wished them to be when they were born?You won’t regret reading this one.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniella Gurrea",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 18, 2022",
                "reviewTitle": "Me gusta! Calidad precio perfecto !!",
                "reviewText": "No puedo creer que me salga mas barato un libro importado! y en inglés!!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Cochrane",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 29, 2024",
                "reviewTitle": "The Four Winds - I can't praise this book enough.",
                "reviewText": "Was hooked on this book from the start and it's the only one, out of hundreds I have read, that made me cry. The sheer humanity, love, strength of character and goodness of people, tempered by the greed and wickedness of others. Extremely well written, bringing to life the awfulness of millions of Americans suddenly losing literally everything they had and worked for, including family members, due to the famine caused by years of drought in the early 1930s in the USA. Scarily shows how our lives as we know them can suddenly be ripped from us.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JONAS RIBAS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 31, 2021",
                "reviewTitle": "Dust Bowl",
                "reviewText": "Excelente romance ambientado no período da grande depressão Americana e do Dust Bowl na região do Texas panhandle, abordando o sofrimento e as mudanças dos aspectos sociais, econômicos, educacionais, migratório e de sáude, vivenciados por uma família de moradores daquele local",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lizzie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on April 15, 2023",
                "reviewTitle": "heart-breaking and brilliant.",
                "reviewText": "I’m “hooked” on Hannah’s novels. Her writing is beautiful and full of historical detail. Her books bring imagined pleasures but also an insight of pain and agony when reading about injustice. She is both teacher and politician, bringing smiles and tears in her writing. A must for us all in understanding life.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}