{
    "remaining_requests": 1020,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/All-Light-We-Cannot-See-audiobook/dp/B00IZGQ780",
    "body": {
        "name": "All the Light We Cannot See: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/All-Light-We-Cannot-See-audiobook/dp/B00IZGQ780",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51c8HcK4DML.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Anthony Doerr",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Anthony+Doerr&search-alias=audible"
        },
        "brand": "Anthony Doerr&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 222850,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Winner of the 2015 Audie Award for FictionMarie-Laure lives with her father in Paris near the Museum of Natural History, where he works as the master of its thousands of locks. When she is six, Marie-Laure goes blind and her father builds a perfect miniature of their neighborhood so she can memorize it by touch and navigate her way home. When she is 12, the Nazis occupy Paris and father and daughter flee to the walled citadel of Saint-Malo, where Marie-Laure’s reclusive great-uncle lives in a tall house by the sea. With them they carry what might be the museum’s most valuable and dangerous jewel. In a mining town in Germany, the orphan Werner grows up with his younger sister, enchanted by a crude radio they find. Werner becomes an expert at building and fixing these crucial new instruments, a talent that wins him a place at a brutal academy for Hitler Youth, then a special assignment to track the resistance. More and more aware of the human cost of his intelligence, Werner travels through the heart of the war and, finally, into Saint-Malo, where his story and Marie-Laure’s converge. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b?ie=UTF8&node=10177"
            },
            {
                "name": "Military",
                "link": "https://www.amazon.com/Military-Historical-Fiction/b?ie=UTF8&node=9332129011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "16 hours and 2 minutes"
            },
            {
                "name": "Author",
                "value": "Anthony Doerr"
            },
            {
                "name": "Narrator",
                "value": "Zach Appelman"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 06, 2014"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00IZGQ780"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#169 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Military Historical Fiction #3 in War Fiction (Books) #3 in War & Military Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tigerlily64",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBBRERU7KIN2BV6SCG3BGBP7L4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPWH3MWX0ZU4Q?ASIN=B00IZGQ780",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2015",
                "reviewTitle": "5.0 out of 5 stars A Beautiful And Enlightening World War II Novel",
                "reviewText": "If I could give “All The Light We Cannot See” more than five stars, I would. I read this amazing book on Kindle and listened to it on Audible, as well. BTW the narrator on Audible, Zach Appelman, is really excellent. His ability to pronounce the French and German names, his articulation and his pregnant pauses really added to the reading of this book.Anthony Doerr’s book is simply stunning. Dazzling is a good word for it. I have reviewed many other books and have sometimes said this or that writer writes fluidly and well. I have given five stars to quite a few writers. “All The Light We Cannot See” is a higher level of excellence that not many authors achieve. No wonder Anthony Doerr won the 2015 Pulitzer Prize for fiction with this book!The chapters are short and beautifully written. I could say “beautifully and elegantly painted”; they remind me of a painting. This book is poetic, creative, imaginative and historically enlightening as well. Science and technology, it’s fascination and the power to help or harm, is explored along with the characters’ thoughts and feelings; we learn about their courage or lack of and why they make their individual decisions during the rise of Hitler and on into World War II. The descriptions are incredibly sensitive and vivid. Objects are palpable; I could see and feel them. The book pulled me in so much that I was part of each scene. The poignant images remained with me and made the characters come alive.The author skillfully writes using a juxtaposition of events in the life of a blind French girl, Marie-Laure LeBlanc, and that of a German boy, Werner Pfennig. Towards the end of the book their lives meet.Marie-Laure, the blind French girl, lives with her father in Paris. She became blind at 6 years old due to congenital cataracts. She has developed her other senses, namely, hearing, touch and smell to compensate for her loss of sight. In her imagination, she can see colors when she uses her other senses to explore her world. Her father carves wooden replicas of all the buildings in Paris for her to learn to find her way home by herself. He is a very devoted and loving father and teaches her independence but promises her he will always be there for her and will never leave her. He is the master locksmith at the Museum of Natural History. Marie-Laure, who is a curious and bright child, goes with him to work and studies paleontology, archeology, geology and other branches of science with Dr. Gefford, while her father works.The boy, Werner, lives in an orphanage, “Children’s House” in Zollverein, Germany. The children in the orphanage are very close to starving. A good deal of the population is very poor and not getting enough to eat. When Hitler comes to power, the economy improves dramatically. People are getting more food (meat even) and new appliances. The German population is inundated with radio propaganda. Only state supported German radio channels are allowed. The German population is brainwashed. The people think Hitler is helping them climb out of poverty, build a better society and take pride in their Country again.Yet the future looks bleak to Werner. Nazi officials tell the boys in the orphanage that they will all have to work in the coalmines when they turn 15 years of age. Werner’s father had died in the coal mines, and Werner is not happy with the prospect of being underground in the dark pit of the mines. After finding a broken radio in the city trash, Werner gets it working. His fascination with radios and his skill in fixing them gives him a chance to escape the coal mines and go to paramilitary school. He has a chance to pursue his interest in radio technology and contribute to the new Germany. He visualizes a glorious future. In the attic at the orphanage, Werner and his sister Jutta had listened to foreign radio stations that were illegal under Nazi rule. A French radio station with science lectures fascinated them. How magical it was to hear a voice from afar, transmitted through the air! Jutta liked a program on magnets. Werner liked the program on light. “What do we call visible light? We call it color. But the electromagnetic spectrum runs to zero in one direction and infinity in the other, so really children, mathematically, all of light is invisible.” The radio was a symbol of freedom for them both, the freedom to learn and dream.Before he leaves for school, however, Werner smashes the radio. He does not want anything to interfere with his chance for what he thinks will be a better life. Listening to foreign radio stations is illegal and dangerous. Jutta, a free spirit with a strong moral compass, feels betrayed. She thinks her brother is turning into a cold, brutal Nazi like Hans and Herribert, two older boys in the orphanage who have joined the brown-shirted Hitler Youth. She insists that the broadcasts from the foreign radio stations say the Germans are committing atrocities, just the opposite of what they hear on the state-owned German stations.Werner gets caught up with his study of radios and blocks out the brutality around him at school. Despite his lack of courage to go against the dictates of his German superiors, the reader can see his conflict and the goodness in him that he wants to embrace. His friend, Frederick, a bird-lover and dreamer, is called the “weakest” by the field commander but shows his courage by refusing to participate in the brutal death of a prisoner. Frederick pays for it by being beaten so badly that he becomes no more than a living vegetable.With the invasion of Paris in 1940, Marie-Laure and her father escape to Saint-Malo on the Brittany coast and find refuge with Marie-Laure’s great uncle, Etienne. Again her father observes and measures the buildings of this new city and carves a wooden replica of all 865 buildings. Unfortunately, his efforts cause suspicion, and he is arrested on his way back to Paris on an errand for the Museum of Natural History. He is convicted of “theft and conspiracy” and sent to a prison in Germany. Feeling abandoned but gathering her inner strength, Marie-Laure continues to live with her great uncle, Etienne, and his housekeeper Madame Manec. Madame Manec starts working for the French Resistance and Marie-Laure takes over some of her activities when the housekeeper becomes ill. Upon Madame Manec’s death from pneumonia, Etienne gets his courage up and joins the French Resistance.Werner finds himself caught up in the brutality with no way to escape. His skill in detecting enemy radio transmissions results in many deaths, some of them innocent civilians. He is haunted by the deaths, especially that of one little girl in Vienna who reminded him of his sister, Jutta. Werner is sent to Saint-Malo to find the source of the radio transmissions of the French Resistance. He finds Marie-Laure’s broadcasts, but does not expose her. He recognizes the radio programs that had inspired him so much as a child. When he hears her voice saying that someone is in her house and is going to kill her, he vows to save her if he can reach her in time. Werner finds her and saves her life. The Americans are bombing the town, but during a lull, he helps her escape Saint-Malo.Intertwined with the lives of our two main characters, Marie-Laure and Werner, fairytale and reality collide. The legend of the “Sea of Flames”, a 133 carat diamond said to be the intended gift of the Goddess of the Earth to the God of the Sea, parallels the calamities the characters experience in their lives. It was said that the person who had the diamond would live forever, but those he loved around him would die. If the stone were returned to the sea, the curse would be lifted. Especially during the bombing of Saint-Malo, Marie-Laure and Werner both draw parallels to their own predicaments and Jules Verne’s “Twenty Thousand Leagues Under the Sea”. Trapped in the basement of the Hotel of Bees in Saint-Malo, Werner listens to Marie-Laure’s broadcasts of the science programs and music that had been recorded by her deceased grandfather. He thinks of Captain Nemo being trapped under the sea in the Nautilus. Werner and his fellow German soldier, Volkheimer, have run out of food and water and have very little air. “Who could possibly calculate the minimum time required for us to get out? Might we not be asphyxiated before the Nautilus could surface?” Are more monsters awaiting them when they do surface?Marie-Laure is trapped in her uncle Etienne’s secret attic room where he had broadcast codes for the French Resistance. Down below is an intruder, the Nazi Sergeant Major von Rumpel. He is there to find the “Sea of Flames” diamond, which her father hid in the wooden house replica of her great uncle’s house. Instead of giving it to the Reich for Hitler’s dream museum in Linz, Austria, he wants to have the enchanted diamond to cure his cancerous tumor. He is dying, and he believes the diamond will save his life. Marie-Laure has not had food for two days and has had no water for one and a half days. She starts to think maybe this Nazi will spare her life if she gives him the diamond. Maybe the curse would end and her father would come back. Not trusting her safety, however, she has a knife handy. She thinks of Captain Nemo when he said to Ned Land, the Canadian harpooner, “But let me tell you that if we’re caught, I’m going to defend myself, even if I die doing it”.There are many levels to this book and much to think about. The reader can get many insights into the human condition and why someone like Hitler could take over Germany and spread his sickness into so many other countries. The book is well researched and taught me a good deal about how it was to grow up in Germany when Hitler came to power. Additionally, I could understand more concretely how it was for the French when France was invaded by Hitler's armies. Good historical fiction brings all these events to life. Anthony Doerr brings a powerful humanism to the events in World War II. He made the characters come alive for me. This is a book to ponder, reread and treasure. The author brings an incredible immediacy to his writing that will draw you in and stay with you, perhaps, forever.",
                "reviewVotes": "273 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SuZReader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6GCJWNAHZD343WBAFMMUJ3I24A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROPPSVSDCFXM6?ASIN=B00IZGQ780",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "4.0 out of 5 stars a wonderful job of capturing and compensations for the loss of vision.",
                "reviewText": "This is the the third book I’ve read in a row about World War II and the pillaging and looting of Europe by the Germans. The others were the nonfiction Monuments Men by Robert M. Edsel and the women’s fiction The Last Masterpiece by Laura Spinelli. Each of them takes a different tack on the subject. Monuments Men is a wide-ranging factual look at the role of the MFAA (Monuments, Fine Art, and Archives) division of the Allied Forces in their attempts to return looted artwork to the appropriate countries. The Last Masterpiece is told in two points of view, focusing on the two primary female characters, a German photographer and an American stenographer, who, though on opposite sides of the war, share a common goal. All the Light We Cannot See fits somewhere in between. It is a more tight view of the war than Monuments Men and somewhat wider in point of view than The Last Masterpiece. I admit I read All the Light We Cannot See prior to seeing the Netflix limited series and ended up feeling the two jarringly different.All the Light We Cannot See deals with Marie-Laure and her father, the locksmith of the Museum of Natural History in Paris. When she goes blind, her father becomes her eyes and teaches her about the world through touch. When Paris is taken by the Nazis, Marie-Laure and her father flee to family in Saint-Malo, carrying the museum’s most famous artifact, a legendary jewel. The other major character is an orphaned German boy, Werner, who is taken early into the German army because of his genius with radios. He spends the war tracking down illegal radio transmissions and his teams kills the broadcasters. Their stories intersect when Werner is sent to track down an illegal radio in the vicinity of Saint-Malo. A third character is Sgt Major Reinhold von Rumpel, a gem appraiser drafted by the Reich to examine pillaged jewels. He has an added reason for seeking the jewel Marie-Laure’s father carried from the museum: he believes in its ability to make its owner immortal.The prose here is delightful, tender. Doerr does a wonderful job of capturing Marie-Laure’s blindness and her compensations for the loss of her vision.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2024",
                "reviewTitle": "Heartbreakingly beautiful",
                "reviewText": "This book stays with you; the words mining your thoughts, echoing in your heart. The forces and fears that shape a life, the bravery in choosing humanity , the resilience and true grit simmering just below what is viewed as disability. And the crushing, suffocating truth that there are no victors in war, no life escapes untouched.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Airi S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 28, 2023",
                "reviewTitle": "Lindíssimo",
                "reviewText": "Um dos melhores livros que li na vida. Poético, lindo, devastador. Vale muito a leitura.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "irma dickinson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 21, 2021",
                "reviewTitle": "MAGNÍFICO!",
                "reviewText": "Lo que se dice un libro bien escrito. Bello, triste, pero esperanzador. La puesta en escena muestra una investigación histórica a fondo. IRMA DICKINSON",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "teresa A. Dorn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 6, 2023",
                "reviewTitle": "Excellently crafted love story",
                "reviewText": "All the light we cannot see is an excellently crafted story. Each character holds his/her own and comes alive on the pages. Their stories blend, entangle, then disentangle in the midst of chaos.This is a special story about love; the kinds of love we leave to one side: paternal love, friendships, love of community and nation, but most especially the love of our fellow humans and how it can transform our lives. Memorable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anuradha GuptaAnuradha Gupta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 29, 2020",
                "reviewTitle": "This is the story of an interrupted childhood, broken families, and shattered dreams.",
                "reviewText": "\"So how, children, does the brain, which lives without a spark of light, build for us a world full of light?”War stories have a way into the heart that none others have. More than 8 decades and counting, World War II never ceases to be astonishing when it comes to writing stories about it, more when it becomes the center of human life. Having recently watched the documentary about the war, I was keen on picking up novels based on it and this one came highly recommended by my online readers’ group.All The Light We Cannot See by Anthony Doerr is the story of the blind Marie-Laure, the self-doubting Werner Pfenning, and the scared old Etienne LeBlanc. Living in places miles away from each other, their lives intertwine in a manner that is beautifully ugly.Open your eyes and see what you can with them before they close forever.At the age of 6 years, Marie-Laure lost her eyesight, irreversibly. Living with her locksmith father in the city of Paris, she soon learns to navigate the city with the help of the proportionate city model that her father makes for her. Accompanying him to his workplace, the Natural History Museum, she gels up with the researchers and professors there, learning from them their art and work. In the time she is by herself, she reads novels in braille which her father gifts her on her birthdays.Miles away, the young Werner and his little sister Jutta live in the Children’s House with many other children who have become orphans, listening to the radio broadcast of a science program for kids. Smart and inquisitive, Werner has a talent that makes him popular in his neighborhood, and soon he is being sent to the military school. There, he learns to hone his skills and use them when the time arrives.In the seafront town of Saint-Malo, Etienne finds himself amidst the war again, this time not as a soldier but a shelterer of his nephew and his young pre-teen daughter who, one day come knocking at his door, all the way from Paris seeking refuge. 20 years and he couldn’t get over the Great War, and this second one has come to haunt him again.Time flies (or rather crawls with all the horrors around) and the lives of these three people which collide in a manner no one could have imagined. Amidst the atrocities that the marauding armies commit, in Germany occupied France, these people try to survive, save and see another day.How do you ever know for certain that you are doing the right thing?Let me begin by saying this, war stories leave you with a heartache you never knew existed. Although it is a fictional tale set during the second world war, the emotions are as real as they could get. Beginning with the characters, there aren’t many characters, primarily the three, Marie-Laure, Werner, and Etienne, whose lives the story focuses on and the others come in and go. While Marie-Laure’s character was shown to grow beautifully, embracing her condition and adjusting to the new society post-occupation, Werner, on the other hand, remained the same throughout the years in the book, the same self confused boy and then, a young man. Even Etienne managed to break out of his reverie and embrace the situation as well as he could. Of the other characters which I thought were remarkable were Marie-Laure’s father, Frau Elena, Volkheimer, Madame, and Jutta. Others didn’t make much sense to me, especially the disillusioned Von Rumpel.This is a slow read, extremely slow at the beginning, tedious to labor through, I really thought of giving it up for the sharp and short sentences that Doerr wrote, but hung on because it felt it will serve its purpose well. Things did improve when I reached halfway, but I still was frustrated every now and then flipping between years which were almost always left on cliffhangers. Doerr made it suspense at a snail’s pace with his fabricated subplot about a diamond and the curse it held. There was also a hint of realism, with the invasion, also came admiration. The shiny boots, the crisp uniforms, the greed to get more to survive better than the rest of their townsfolk and countrymen of occupied France, the Resistance, the normalcy that everyone tried to bring by going about their daily work, coming to terms with vanishings, and natural and violent deaths, and the hope of liberation.The beauty of this book isn’t in its story or even the way it is told, it is in the details. The lives that get disrupted when war strikes the heart, the emotions of families when they leave the only place they’ve ever known, the dangers that lurk for them at every corner (both sides alike), the predators, the humans who became monsters, the aftermath, all of it is horrific. I had recently watched the documentary of this war, and I could relate to these scenes so much, yet I felt the detachment that one has when they read about things that have happened to others. This story pulled me into two different directions, one part of me wanted to go with Marie-Laure and comfort her for suffering without her father under the Nazi rule, the other wanted me to go and jerk Werner into his senses and let him know his humanity was worth more than everything that he did.This is the story of an interrupted childhood, broken families, and shattered dreams. This book is so hauntingly beautiful, that you would wish it was true yet you don’t want it to be true. Recommended for everyone, one who reads and one who doesn’t, this book is what the war truly did.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/810qoN+p1tL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}