{
    "remaining_requests": 928,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Weyward-A-Novel/dp/B0B1JPVL1F",
    "body": {
        "name": "Weyward: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Weyward-A-Novel/dp/B0B1JPVL1F",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61YPmcTccyL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Emilia Hart",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Emilia+Hart"
        },
        "brand": "Emilia Hart",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 18798,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Long-listed, Barnes and Noble Best New Books of the Year 2023This is a multicast program.\"A spellbinding story about what may transpire when the natural world collides with a legacy of witchcraft.\"—Sarah Penner, New York Times bestselling author of The Lost Apothecary\"Narrators Aysha Kala, Helen Keeley, and Nell Barlow are a magical, moving trio. Their emotional and expressive performance of the parallel narratives ranges from touching and timid to tense and twisting.\"—Library JournalI am a Weyward, and wild inside.2019: Under cover of darkness, Kate flees London for ramshackle Weyward Cottage, inherited from a great aunt she barely remembers. With its tumbling ivy and overgrown garden, the cottage is worlds away from the abusive partner who tormented Kate. But she begins to suspect that her great aunt had a secret. One that lurks in the bones of the cottage, hidden ever since the witch-hunts of the 17th century.1619: Altha is awaiting trial for the murder of a local farmer who was stampeded to death by his herd. As a girl, Altha’s mother taught her their magic, a kind not rooted in spell casting but in a deep knowledge of the natural world. But unusual women have always been deemed dangerous, and as the evidence for witchcraft is set out against Altha, she knows it will take all of her powers to maintain her freedom.1942: As World War II rages, Violet is trapped in her family's grand, crumbling estate. Straitjacketed by societal convention, she longs for the robust education her brother receives–and for her mother, long deceased, who was rumored to have gone mad before her death. The only traces Violet has of her are a locket bearing the initial W and the word weyward scratched into the baseboard of her bedroom.Weaving together the stories of three extraordinary women across five centuries, Emilia Hart's Weyward is an enthralling novel of female resilience and the transformative power of the natural world.A Macmillan Audio production from St. Martin’s Press. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10177"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 51 minutes"
            },
            {
                "name": "Author",
                "value": "Emilia Hart"
            },
            {
                "name": "Narrator",
                "value": "Aysha Kala, Helen Keeley, Nell Barlow"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 07, 2023"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0B1JPVL1F"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#930 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #48 in Historical Fiction (Audible Books & Originals) #72 in Women's Fiction (Audible Books & Originals) #171 in Historical Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Shaila Shodean",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKTP2XHNKTT256ZOBZ5PNTRT3IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R96Y4CE9AD27Q?ASIN=B0B1JPVL1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Powerful and magical",
                "reviewText": "I do believe I’ve found one of my favorite books of the year! Weyward by Emilia Hart is a powerful and magical novel told from three POVs in three time periods.1619: Altha is on trial for witchcraft in connection with the death of a local farmer. She has a way with plants, but has to be careful who she trusts with her healing skills.1942: Violet is kept isolated in a manor house, denied the education her brother receives, or even the opportunity to visit the local village. No one speaks of her dead mother and the only clues she has are a necklace and a strange word etched into the baseboard of her room.2019: Kate flees London and her abusive partner for an overgrown cottage left to her by a great-aunt she barely knew. As she tries to heal, she notices a strange connection to the natural world.I could not love this book more. The gorgeous writing, strong narrative voice, beautiful setting, connection between the women, system of magic, and an incredibly compelling story. I was completely swept up in each of their stories, loved all equally, and could not put this book down. Read if you loved The Change, The Familiars, or Once Upon a River.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MrsLeif",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFD5AHZ6V6TZ5AIY542YTX62QMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHB01YIT5Q96T?ASIN=B0B1JPVL1F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Great atmospheric writing!",
                "reviewText": "Three women. Three mistreated women are all linked by their resilience and ability to learn to survive in a world that is not friendly to them.in 1619, Altha Weyward is a teenager. Her mother has passed, she doesn't know her father and she is fighting for her life. She has been accused of witchcraft and killing a neighbor with her powers. How is she able to endure it?In 1942, Violet Ayres wanted more than what she was allowed. She craves knowledge. She wishes she could be like her brother and be able to learn what he is. Yet, she is told that marriage and having kids is her only purpose. Her father is unyielding and her mother has passed, rumored to have gone crazy. Then two things happen, one involving finding out about the Weywards' past, the other one, a traumatizing event that will change her future.in 2019, Kate Ayres is running away from his abusive partner. She runs to Weyward Cottage, a place she inherited from her great-aunt Violet. Little by little, she wants to know more about her great-aunt and her ancestors. What she learns baffles her but at the same time, it empowers her.Great writing combined with a realistic atmospheric setting made Weyward a winning novel for me. I liked all 3 women and was hoping for a good outcome for all of them. The narrators, Aysha Kala, Helen Keeley, and Nell Barlow only augmented the experience.Cliffhanger: No4/5 Fangs",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENXOD5MRCOMYE3WL2D2YV5ENR7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W9VSAQ7ZQ3XJ?ASIN=B0B1JPVL1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Generational impacts",
                "reviewText": "The story starts a bit slow as each woman, in her time, is introduced, but soon the pacing evolved. The concept, of three women, interwoven over centuries by common ancestry and gifts is solid. I connected with each character and thought the trials and rewards each encountered were appropriate. The underlying message of women with power and strenght was appreciated too. I would look for more stories from this author which is the best endorsement I can think of. Plus anytime I stay up late, two hours past my \"bedtime\" to finish a book is a positive endorsement of the story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cece Owens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVPIK5SJWLV2VCNT5YMWLDLD3UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28CRF5A5QJTVL?ASIN=B0B1JPVL1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "It's a love letter to women. It's sisterhood and empowerment wrapped up into a self-fulfilling bow. We are powerful because we are. I loved reading this story of ancestors and family moving through the ages to protect one another. It reminds me of Practical Magic by Alice Hoffman except for one amazing difference. The women are not the curse. They are suffering because of the actions of men attempting to control and use their weyward ways. I really am giddy seeing the true villains get their due and not seeing it turned back onto the women as if they are less than because of some blimey git and his lust. Great story. It is now one of my faves and I will put it in my list of classics to reread every so often. To the weyward in us all. Blessed be.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Private",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHAQX4C3HKZF7G6X7XJN6SXUU3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33902CN3OLL2F?ASIN=B0B1JPVL1F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "4.0 out of 5 stars Thought Provoking",
                "reviewText": "The style of this book following the lives of three women in three generations of time confused me at first. Something kept drawing me back, and once I caught on to the relationship of these women to each other and what their lives meant, I couldn’t put it down.How can something as gentle, powerful, smart and capable as a woman have been gifted a place on an earth so strongly dominated by the whims of so many cruel and self absorbed men? This book has provoked contemplation as to how women have had to fight for basic freedoms and dignity - what makes our politicians so weak and corrupt - how the natural world can save us if we don’t destroy it first.Beyond the thoughts still roaming through my head, this book was a great read and I’d recommend it to any open minded adult.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V. Myers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFU2VFJCUGZI6DO2OVERQWQI76HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F8KTUMN9JNSL?ASIN=B0B1JPVL1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Beautiful and hopeful",
                "reviewText": "Normally I am not a fan of books written in the present tense. For some reason, most of them feel disconnected and I have a hard time engaging. That was absolutely not the experience I had when reading Weyward. I didn't even notice the tense until about 25% in. Told in three separate POVs, each character had a distinct voice and they were so interesting. I love how they are tied together across time through the family line and how each of them makes such an impact on the next. Violet is such a wonderful, charming character. Kate could easily have come across as an annoying victim of her own making yet she is strong and resilient and I found myself rooting for her from the beginning. Altha was very well written and her character seems to reflect her time period well. Beautifully written and very quick to read because it was so immersive. My only complaint would be that most of the male characters are treated in a pretty poor light - small minded, abusive and unlikeable. I understand why this was the case in this scope of the story but it was something that stood out to me. Overall, loved this book and give it 5 stars. I'm so glad I read it and will be looking for more books by this author.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 31, 2023",
                "reviewTitle": "couldn’t put it down",
                "reviewText": "A story for all women. Strength and bonds through the ages we are all tied together in the magic. Fantastic",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lizbeth FragosoLizbeth Fragoso",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 7, 2023",
                "reviewTitle": "Beautiful hard cover edition",
                "reviewText": "It arrived very fast. It's hard cover but not as heavy as i feared which is nice. The dust jacket feels a little weird to the touch (i guess because it's plastic) but the shiny details of the bugs and the title are lovely. Can't wait to read it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7133pWUK0DL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61n63FpzZXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71kp4poiLFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ndja-7PFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61NMpfKwXYL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nathalia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 19, 2023",
                "reviewTitle": "Lindo",
                "reviewText": "O livro é lindo, mas ainda não li.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julie Vessigault",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 25, 2023",
                "reviewTitle": "women's fights, women's rights and women's pride",
                "reviewText": "\"The connections between and among women are the most feared, the most problematic, and the most potentially transforming force on the planet.\"I am crying writing this review because of how powerful, poetic, haunting and empowering this story was. This is a story of women's fights, of women's rights and women's pride. I recommend this to every single woman on this planet.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 20, 2023",
                "reviewTitle": "Beautiful and passionate book.",
                "reviewText": "A story encompassing generations of women of the same family. How they are connected, in their struggles and self discovery. How a woman is never lonely or dependent.A beautiful journey. A must read for everyone. Not only women. Loved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}