{
    "remaining_requests": 750,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Great-Alone-Novel-Kristin-Hannah/dp/1250229537",
    "body": {
        "name": "The Great Alone: A Novel",
        "price": "$7.98",
        "originalPrice": "",
        "rawPrice": 7.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Great-Alone-Novel-Kristin-Hannah/dp/1250229537",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41kWRgO3C2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51wiILGV5rL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kristin Hannah",
            "link": "https://www.amazon.com/Kristin-Hannah/e/B000APANXE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 145908,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ St. Martin's Griffin; Reprint edition (September 24, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 576 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250229537"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250229533"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL720L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.15 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.35 x 1.5 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#123 in Books (See Top 100 in Books) #12 in Family Life Fiction (Books) #18 in Mothers & Children Fiction #29 in Women's Domestic Life Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 145,908 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Great Alone: A Novel",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/57cec81a-33a8-4e27-8bb5-b39462e1b240._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3691f92b-f25d-4fed-84bf-fb2d861193af._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/114d394c-4f5e-49ba-bf3e-3accb3e5a37b._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/57cec81a-33a8-4e27-8bb5-b39462e1b240._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3691f92b-f25d-4fed-84bf-fb2d861193af._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/114d394c-4f5e-49ba-bf3e-3accb3e5a37b._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/33b30d35-08c1-4636-87d8-e0f926c501c5._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0571fed2-ecb3-4897-ba39-3d90abcb5261._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1a70a204-6103-4f4e-bf2b-aeefa7d1dad2._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWZFNY3ZI2MEPUG5NMXJJZNL4EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKR8A0FSX93DN?ASIN=1250229537",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 25, 2018",
                "reviewTitle": "5.0 out of 5 stars a sad portrait of a woman who tolerates abuse",
                "reviewText": "I was captivated from this novel from the beginning. So many factors are involved: Broken people with broken souls; family abuse; a sad portrait of a woman who tolerates abuse; the effects of abuse on a child; the tragedy of a Viet Nam Vet's post-war mental breakdown of his once good soul. For me, however, the most poignant and educational factors were the descriptions of a wild, desolate, beautiful Alaska in the 1970's. And the stories behind the characters involved who lived there - and played vital roles to the main characters. The tension is palpable. The story is mesmerizing, soulful, heartbreaking, suspenseful. It's one of those rare novels that had me breaking my rule of reading only at bedtime...I had to find out 'what's happening next?\".If the following passages do not whet the appetite, I don't know what will:\"Two kinds of folks come up to Alaska, Cora. People running to something and people running away from something. The second kind-you want to keep your eye out for them. And it isn't just the people you need to watch out for, either. Alaska herself can be Sleeping Beauty one minute and a bitch with a sawed-off shotgun the next. There's a saying: Up here you can make one mistake. The second one will kill you.\"\"Even her laugh seemed at home here, an echo of the bells that tinkled from wind chimes in front of the shops.\"\"Leni stared down at the sea, rolling inexorably toward her. Nothing you did could hold back that rising tide. One mistake or miscalculation and you could be stranded or washed away. All you could do was protect yourself by reading the charts and being prepared and making smart choices.\"\"She was sweating hard, scooping a bucket of water from the creek, slopping it across her boots, when night fell. And she meant FELL; it hit hard and fast, like a lid clanging down on its pot.\"\"Dad's intentions were good, but even so, it was like living with a wild animal. Like those crazy hippies the Alaskans talked about who lived with wolves and bears and invariably ended up getting killed. The natural-born predator could seem domesticated, even friendly, could lick your throat affectionately or rub up against you to get a back scratch. But you knew, or should know, that it was a wild thing you lived with, that a collar and leash and a bowl of food might tame the actions of the beast, but couldn't change its essential nature. In a split second,, less time than it took to exhale a breath, that wolf could claim its nature and turn, fangs bared.\"\"A girl was like a kite; without her mother's strong, steady hold on the string, she might just flat away, be lost somewhere among the clouds.\"\"Fear and shame she understood. Fear made you run and hide and shame made you stay quiet, but this anger wanted something else. Release.\"\"There it was: the sad truth. Mama loved him too much to leave him. Still, even now, with her face bruised and swollen. Maybe what she'd always said was true, maybe she couldn't breathe without him, maybe she'd wilt like a flower without the sunshine of his adoration.\"\"Everyone up here had two stories: the life before and the life now. If you wanted to pray to a weirdo god or live in a school bus or marry a goose, no one in Alaska was going to say crap to you. No one cared if you had an old car on your deck, let alone a rusted fridge. Any life that could be imagined could be lived up here.\"\"It made Leni feel as if she were a coil of rope drawn around a cleat with the wind pulling at it, tugging, the rope creaking in resistance, slipping. If the line wasn't perfectly tied down, it would all come undone, be torn away, maybe the wind would pull the cleat from its home in fury.\"\"There were a lot of bumper stickers like that out here, deep in Alaska's wild interior, far from the tourist destinations of the coast or the majestic beauty of Denali. Alaska was full of fringe-ists. People who believed in weirdo things and prayed to exclusionary Gods and filled their basements with equal measures of guns and Bibles. If you wanted to live in a place where no one told you what to do and didn't care if you parked a trailer in your yard or had a fridge on your porch, Alaska was the state for you.\"\"The farther away you got from civilization, the stranger things got. Most people spent one dark, bleak, eight-month winter in Fairbanks and left the state screaming. The few who stayed-misfits, adventurers, romantics, loners-rarely left again.\"\"Sometimes you had to go backward in order to go forward.\"\"He hadn't realized how time could unspool the years of your life until for a second you were fourteen again, crying from a place so deep it seemed to predate you, desperate to be whole again.\"\"Time was not something she usually paid much attention to. On the homestead, the bigger picture mattered-the darkening of the sky, the ebbing of the tide, the snow hares changing color, the birds returning or flying south. That was how they marked the passage of time, in growing seasons and salmon runs, and the first snowfall.\"\"After that and all the way home, he said nothing, which should have been better than yelling, but it wasn't. Yelling was like a bomb in the corner: you saw it, watched the fuse burn, and you knew when it would explode and you needed to run for cover. Not speaking was a killer somewhere in your house with a gun when you were sleeping.\"\"Love and fear. The most destructive forces on earth. Fear had turned her inside out, love had made her stupid.\"\"Five out of every thousand people went missing in Alaska every year, were lost. That was a known fact. They fell down crevasses, lost their way on trails, drowned in a rising tide. Alaska. The Great Alone.\"\"Someone said to me once that Alaska didn't create character; it revealed it.\"\"This state, this place, is like no other. It is beauty and horror; savior and destroyer. Here, where survival is a choice that must be made over and over, in the wildest place in America, on the edge of civilization, where water in all its forms can kill you, you learn who you are........You learn what you will do to survive. That lesson, that revelation, as my mother once told me about love, is Alaska's great and terrible gift. Those who come for beauty alone, or for some imaginary life, or those who seek safety, will fail. In the vast expanse of this unpredictable wilderness, you will either become your best self and flourish, or you will run away, screaming, from the dark and the cold and the hardship. There is no middle ground, no safe place; not here, in the Great Alone.\"The physical descriptions throughout the novel are ethereal...you can touch and feel and see what the author paints for you.I think the author did an exquisite job with this novel - my one-time journey through Alaska will never be forgotten.",
                "reviewVotes": "77 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2OXPFWNTY3DBRYVZEW23NBIIZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SDCVXL84WWOG?ASIN=1250229537",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Spectacular!",
                "reviewText": "I just closed the book and am sobbing. The Great Alone is spectacular. The characters in this novel are by far the best I’ve had the pleasure to read about and not just the main ones, the supporting characters are equally as developed, interesting and loved by me (Large Marge, I’m talking about you).Lenis life is far from easy. Her father was a POW in the Vietnam War and has since struggled with mental illness. He drags his family to an isolated piece of land in Alaska leaving them with a small community of about 30 people and his demons. This tiny group of people end up being Lenis lifeline. We see Leni traverse abuse, love, fear, loss and so much more. The relationship between Leni and her mother Cora is complex. On one hand, they are “peas in a pod” and on the other hand Leni is forced to be the rational adult, considering their safety at every turn, which seemed unfair. Nevertheless, their love for one another is undeniable.Matthew Walker. My God. What a guy. Everything that can go wrong does for him but he is such a light. There is such strength in his softness. The story around him and Leni is devastating yet tender. My heart broke for them but it was slowly pieced back together. I loved them and I loved this book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristin A. Whitmore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3YTC7HB7GBN576ZAO3SXOHDM2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PYMF8QPEB5V2?ASIN=1250229537",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "4.0 out of 5 stars my first Kristin Hannah book and I’ll read another",
                "reviewText": "It definitely kept me turning the pages, and while I laughed a little here and there, I shed some tears also. I did find myself skimming though, especially toward the end when I wanted to get to the end of the story. I’ve read some books where I want to savor every word and this one wasn’t that way and I’m not really sure why a book makes me want to rush to the end and not savor every word, but that’s why I gave it a 4 and not a 5. I will read another Kristin Hannah book. Her writing, and the way the story moves me felt very similar to how I’ve felt reading many of Jodi Picoult’s books.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colleen Noyes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFRY4IHKYY2R5U7SYKMJRYN523A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R138IX1QTTBXCK?ASIN=1250229537",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars The Great Alone by Kristin Hannah",
                "reviewText": "Look, I’m not gonna lie here. I don’t even know how to put into words what I just read and the 8000 emotions still going through my body. This is the first book I have read by this author and I had no idea what to expect although I had heard she had many great books. It just happened that this book was the one chosen by my book club, and man what a powerful book and story told in a unique, poignant, beautiful, emotional way.This book will take you on one of the most incredulous journeys you have ever been on. Starting in the 1970s this story begins about a family where the husband has come home from Vietnam and how he is so different than the man who went to Vietnam. What you find throughout the story is that it is about so much more than this one family and the hidden secrets that they have, the things that they endure and more importantly, the things that they survive. You learn about Alaska, and all of its beauty that radiates every day. You are drawn in to feel the darkness that happens in Alaska and what that means not just for this family, but for everybody who lives in the community. You are shown just how important community can be and what other people are willing to do when they believe in something.Kristin Hannah does an exquisite job of making you feel everything that everybody is feeling. You will find yourself holding your breath on the edge of your seat, waiting to see what comes next. The story has long, lasting love, all the love, Young love, it showcases the love between parents and children in multiple ways in multiple generations, and how there can be so many different outcomes and scenarios.You will find yourself wrapped up in so much loss, but not always the type of loss you think may be coming. Some may be loss of a person, some may be loss of hope, of faith, of a relationship, the lengths that some people will go to in the name of love are breathtaking, painful, and shocking.I can only imagine which each person felt throughout this book, and how that affected every choice that they made. You discover that there are always consequences to whatever choice you make sometimes good sometimes bad, but you have to live with that. From chapter 26 to the end of the book in itself is some of the most incredible heart wrenching written words I have ever read in my life. If all of this authors books are like that, I can only imagine months filled with tears. I cried so hard and uncontrollably for the last several chapters that my poor husband had no idea what was going on. While this book is long, I implore you to stick with it and finish it because it is a literary great novel that I hope will someday be made into a movie or a TV series.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ReeseG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 31, 2024",
                "reviewTitle": "Obsessed!",
                "reviewText": "I’m actually obsessed with this book and can’t put it down. If you are looking for a good read and want to get lost in your book, this is the one! highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Genevieve Drean",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 3, 2024",
                "reviewTitle": "An amazing read",
                "reviewText": "I am 60 years young & there are only 2 books in my life that once I’ve got to the end, I have felt like turning right back to page 1 and reading again- this is one of them. A book that will both transport you and transform you. Each character is fully formed, believable and flawed. Kristen Hannah understands real human beings and your sympathies for the cast of characters shifts allegiances as events unfold. No fairy tale ending but realistic resolutions. A few surprising twists ensure the story stays as unpredictable as life tends to be. The harsh but beautiful landscape depicted is as much of a presence in the book as any human. I am so glad that I’ve discovered this author- I can’t wait to devour her other stories. Highly recommended.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jackey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 29, 2023",
                "reviewTitle": "A decent read",
                "reviewText": "The book is well written and the author manages to make us imagine and even visualize the expanse of the Alaskan landscape. Also, the protagonist and her father are well defined characters. With Cora, though, the writer fails to give us a true character: she is flat, pathetic, with no backbone. A victim of the worst kind. The plot, too, is not particularly interesting. Something could have been improved.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 4, 2023",
                "reviewTitle": "Beautiful wild Alaska.....",
                "reviewText": "Loved it....lived it....was one of them through their journey....a very different read and experience....Alaska is the main hero of this book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Enrique Lopez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 4, 2018",
                "reviewTitle": "The Great Alone - Comentarios",
                "reviewText": "Me parece una excelente novela. Los horrores de la guerra se reflejan en un ex combatiente en Vietnam, emocionalmente dañado, que desahoga sus sufrimientos con violencia hacia su esposa, en el inmenso, oscuro y helado terrritorio de Alaska en los años 60 - 70.El desarrollo de la historia es estrujante, ya que no se avista un alivio al sufrimiento de la hija adolescente y su madre. El desenlace se mezcla con una historia de amor que complica la situación de una forma inextricable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}