{
    "remaining_requests": 958,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Heaven-Earth-Grocery-Store-Novel/dp/B0BPTKTBB2",
    "body": {
        "name": "The Heaven & Earth Grocery Store: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Heaven-Earth-Grocery-Store-Novel/dp/B0BPTKTBB2",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51rgs7X2 RL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "James McBride",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=James+McBride&search-alias=audible"
        },
        "brand": "James McBride&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 29942,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "AN INSTANT NEW YORK TIMES BESTSELLER A NEW YORK TIMES NOTABLE BOOK NAMED A BEST BOOK OF THE YEAR BY NPR/FRESH AIR, WASHINGTON POST, THE NEW YORKER, AND TIME MAGAZINE ONE OF BARACK OBAMA'S FAVORITE BOOKS OF 2023“A murder mystery locked inside a Great American Novel . . . Charming, smart, heart-blistering, and heart-healing.”—Danez Smith, The New York Times Book Review“We all need—we all deserve—this vibrant, love-affirming novel that bounds over any difference that claims to separate us.”—Ron Charles, The Washington PostFrom James McBride, author of the bestselling Oprah’s Book Club pick Deacon King Kong and the National Book Award-winning The Good Lord Bird, a novel about small-town secrets and the people who keep themIn 1972, when workers in Pottstown, Pennsylvania, were digging the foundations for a new development, the last thing they expected to find was a skeleton at the bottom of a well. Who the skeleton was and how it got there were two of the long-held secrets kept by the residents of Chicken Hill, the dilapidated neighborhood where immigrant Jews and African Americans lived side by side and shared ambitions and sorrows. Chicken Hill was where Moshe and Chona Ludlow lived when Moshe integrated his theater and where Chona ran the Heaven & Earth Grocery Store. When the state came looking for a deaf boy to institutionalize him, it was Chona and Nate Timblin, the Black janitor at Moshe’s theater and the unofficial leader of the Black community on Chicken Hill, who worked together to keep the boy safe.As these characters’ stories overlap and deepen, it becomes clear how much the people who live on the margins of white, Christian America struggle and what they must do to survive. When the truth is finally revealed about what happened on Chicken Hill and the part the town’s white establishment played in it, McBride shows us that even in dark times, it is love and community—heaven and earth—that sustain us.Bringing his masterly storytelling skills and his deep faith in humanity to The Heaven & Earth Grocery Store, James McBride has written a novel as compassionate as Deacon King Kong and as inventive as The Good Lord Bird. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10177"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "12 hours and 21 minutes"
            },
            {
                "name": "Author",
                "value": "James McBride"
            },
            {
                "name": "Narrator",
                "value": "Dominic Hoffman"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 08, 2023"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BPTKTBB2"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in African American Literature #1 in Historical Fiction (Audible Books & Originals) #2 in Black & African American Literature (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "switterbug/Betsey Van Horn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFC4L6YCFUMKPSTZP4E4DS6E2PPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R308PJJW8KGZ1?ASIN=B0BPTKTBB2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 26, 2023",
                "reviewTitle": "5.0 out of 5 stars It does move heaven and earth for the reader",
                "reviewText": "James McBride is an accomplished saxophonist/jazz musician. I knew that going into the book. (Oh, digression--did you know that he also played with the band, The Remainders? That’s a band with other writers like Amy Tan, Dave Barry, Barbara Kingsolver, Stephen King, Maya Angelou and several others who played for charity and fundraising). Anyway, I mention his musicianship because I see it all over the pages of The Heaven and Earth Grocery Store.This is the first book I’ve read by McBride (definitely more to come), so pardon my schoolgirlish, giggly first crush for the way that his writing lifts me up, how his words and characters opened my heart, only to break it, and then put it back together in a most absolute and tender way. James McBride is a kind, gentle soul, and his writing reflects this—his ability to bring the world together in a novel. He honors humanity. We are all connected, and this author compels that naturally from his characters. Now, how great is that, yeah?I want to put this in your hands and promise you a magnificent reading experience. It starts off in a shaggy dog kind of way, with an ensemble of characters, several who possess whimsical names like Fatty, Big Soap, Monkey Pants, Dodo. And their names fit flawlessly to their nature. The story starts with a 1972 prologue—a human skeleton is found in an old abandoned well, and then the body of the story begins in 1936 in Pottstown, Pennsylvania, a place called Chicken Hill, where Jews, immigrants, and Black folks lived side by side, sometimes in harmony, other times in discord, but here’s the thing—the goodness of people, the kindness of their hearts—that is what ultimately rises to the top.For the story to unfold, there has to be some sinister aspects, too—aren’t we still fighting the fight of ignorance, bigotry, corruption, meanness? But, in the McBride world, well, we also follow the long stretch of yarn as it wends around this way and that, through streets and backyards, dirt roads, onto hills and a shul and a church, through tunnels and a dance hall. And The Heaven and Earth Grocery Store.I don’t need to rehash the plot, but there are a few fun facts about this book worth mentioning in a review. Such as, there are an abundance of characters introduced early on, and then again later on, before the plot actually launches. That’s the shaggy part. We don’t get to the plot too quickly—instead, Mcbride takes his time, builds the characters. They are already leaping off the pages by the time the plot rolls in.There are subplots, too, but in the end, they all weave their chords and come together. McBride may slow your roll at first, but it’s a winning bonanza of breadth and depth, from the smallest detail to the broadest design. Scenes that seem initially inconsequential become key notes later on.Early on, we meet the arresting Jewess, Chona. Chona is an unforgettable female protagonist—I’m keeping her in my journal of best. female. characters. ever. She is handicapped with a limp—but her limp doesn’t stop her strength of purpose, her fierce dignity, her bounteous benevolence, her gentle grace, and her consummate integrity. You will fall in love with her, just like Moshe, the theater and dance hall owner, did. Moshe and Chona dared to welcome change and inclusivity to their part of the world.At this time, in the 1930s, Black people were almost exclusively cast in menial jobs. But Moshe books Black jazz bands to play at his theater, and successfully includes all tribes together at the dance hall, who “frolicked and laughed, dancing as if they were birds enjoying flight for the first time.” Chona runs the grocery store, and extends credit to anyone who can’t afford to pay; she rarely keeps a record of their debt. The Heaven and Earth Grocery Store may lose money, but it is rich in goodwill and kindness.Back to this being like a musical book—a jazzy book. Jazz music conjures that raspy, soulful, edgy flavor, blended from a mix of cultures and harmonies. McBride embraces those diverse, insistent, zingy, soul-stirring rhythms and blues into the narrative threads of his novel. I can hear the swing and the chase, the boogie and the blues, the sounds that go everywhere at once and jelly roll the story within a complex set of fusion and feelings. It’s also just a damned good story!The narrative pulls you here and there, up and down, and when you meet Dodo, the sweet and barely teenaged deaf kid, your protective instincts will wrap yourself around him and never want to let him go. And, when Dodo meets Monkey Pants—well, this right there—the heart of the novel that will break you in pieces.At times, I had a wellspring of tears—not just for joy or anguish. Sure, comedy and tragedy fill these pages. But McBride’s natural humanity and gentle nature is the colossal, phenomenal heart of the book. The author steps aside, he doesn’t ever intrude. The core of the narrative are the characters. Their cacophony becomes a coda for living large.This tale made me want to be better, to do better, to open my eyes to all the missed connections, to fix the broken chords and forge new ones, and seek eternally to strengthen them. We are humanity, we are the essential substance to add love to the world, one modest good deed at a time. That is The Heaven and Earth Grocery Store.",
                "reviewVotes": "736 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Perez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMAIHV3SEBHYM5W6OIZIQSSDYIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM5FV0TIB5U6I?ASIN=B0BPTKTBB2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "4.0 out of 5 stars Assured, Propulsive, Scathing writing",
                "reviewText": "In the neighborhood of Chicken Hill, Pottstown, Pennsylvania, in June 1972, police found a skeleton, wearing a gold chain with a mezuzah, at the bottom of a well, next to a lot that had been torn down a day earlier to make way for a new neighborhood. They visited the home of the only Jew left on Chicken Hill, on account of the mezuzah; his home stood on the site that almost half a century earlier had been the local synagogue. Because of this, he was deemed a suspect, though he would never face charges. He skipped town almost immediately, and days later the neighborhood was reduced to rubble by a devastating hurricane.Forty-seven years earlier, in 1925, young theater-manager Moshe Ludlow bet the little money he had saved on hiring a famous musical act to play at his small venue. Jews from all over the Northeast came to dance and frolic. Moshe recovered his investment many times over. He married Chona Yakov, the brilliant daughter of the local rabbi, and settled in Chicken Hill, which was then a vibrant community home to Blacks and Jews. As years went by, most affluent Jews moved downtown. Chona refused to move out. Moshe and Chona owned a two-story building that housed the neighborhood’s only store on the first floor, The Heaven & Earth Grocery Store, and their home on the second floor. The store was a losing business on account of Chona’s kindness, but it was a regular hangout spot and neighbors loved it.Over the next twelve years, Chicken Hill, and the world at large, undergo seismic changes—the local KKK chapter gains popularity, Nazism rises in Europe, and America’s immigrants begin to question their new way of life. Among all these social changes, Chicken Hill’s inhabitants undergo personal upheavals as well, but their sense of community remains strong despite the adversities that come their way.The Heaven & Earth Grocery Store is a novel in three parts and an epilogue, told by an omniscient narrator, about the ups and downs of a community between the years 1925-1936, in an ever-changing world. It touches on several themes, such as racial politics, inequality, sexual violence, disability, sense of community and belonging, friendship, and karmic justice.The first thing that struck me as I settled into the story was McBride’s assured, propulsive, scathing writing. Despite being an ensemble kind of story, each individual character shines thoroughly, so the reader gets to know each character’s motivations, inner life, idiosyncrasies. I haven’t been that crazy about an ensemble cast of characters as I was with these. The curmudgeons in the story are some of the most sympathetic people in it.The Heaven… is by no means a happy novel; there are weighty issues and sadness overload, but they are treated so compassionately and so beautifully that the reader will root for these underdogs.",
                "reviewVotes": "53 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carolyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNVPNDLSLJK7CTCRWDQ55HQXXWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16LA0V0KW6KKC?ASIN=B0BPTKTBB2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Touched me deeply",
                "reviewText": "McBride is a great novelist. I’ve now read a third book by him, but this is the one I will not forget. It touched me very deeply. I will abstain from rehashing the plot, which many have done here and instead just say that the book is character driven and that the characters are compelling, even when you don’t like them. The dialogue is believable, and the book is not at all predictable—you don’t find yourself knowing how it will end at any point. Some readers may have a problem with some of the lengthy passages of social criticism or the overlong sentences (sometimes a full page), and I really don’t know what McBride was after here, other than to suggest a rhythm, but if you just go with it you will have a memorable experience. The book is about love and community and Tikkun Olam—making the world a better place. The best praise I can give it is that I would love to read it again soon.Bravo, James McBride!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacquie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2024",
                "reviewTitle": "The Heaven and Earth Grocery Store",
                "reviewText": "This book hits real life issues with humour and tragedy. There are lots of layers to this book but at the end of the day it shows us that not only do we need each other, but everything we do and say impacts someone else, whether we know it or not.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "angela arnone",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 4, 2024",
                "reviewTitle": "A learning curve",
                "reviewText": "Worth battling on even through some of the longest, most confusing sentences I've read for a while.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 20, 2024",
                "reviewTitle": "A joy to read",
                "reviewText": "A joy to read from start to finish. This author is gifted and as soon as I started reading it, I knew it was a book I'd remember for a long time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pamela Ferner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 6, 2024",
                "reviewTitle": "Moving, compelling, phenomenal!",
                "reviewText": "Gripped me from the first words to the last. I read a review of this book - a one star-review - said that nothing happens and there are too many characters. Whoever wrote that review does not understand a great piece of literature. This book is a fantastic work - and grabbed me from the get-go and never let up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WritingMachine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 19, 2023",
                "reviewTitle": "Uncharacteristically underwhelming",
                "reviewText": "For the first quarter of the book, something is off about The Heaven and Earth Grocery Store especially when compared to to the author’s last two novels, The Good Lord Bird and Deacon King Kong, both masterpieces in their own right. Whatever it is, this new novel marks the very first time that I am underwhelmed by a James McBride text, a writer otherwise known in my personal circle as my very favorite novelist, bar none (shout out to Chimamanda Ngozi Adichie though, she’s up there). And I have to admit: I had a hard time getting past the long winded first quarter of the read for the author’s writing is uncharacteristically dull and uninspired; his trademark humor which is simply glorious in Deacon King Kong (one of the most memorable books I have ever read) makes me frown here; his descriptions are saturated with useless explanations as if it were a paper being written about a novel instead of the novel itself. Simply said, the first quarter of the book is a head scratcher and I wonder if the publisher has something to do with it… Afterwards though, both the writing and the story pick themselves up and eventually, seemingly out of nowhere, appears the real James McBride (albeit unevenly) with his plethora of memorable characters such as Dodo and Chona. Still, overall, most of the affair seems somewhat forced and strangely edited. Maybe it is what comedians refer to as “bombing” on stage; not the worst but a not so good day at the office by one of the greatest novelist I have ever read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}