{
    "remaining_requests": 915,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Truth-About-Dukes-Rogues-Riches-ebook/dp/B085XX5PF7",
    "body": {
        "name": "The Truth About Dukes (Rogues to Riches Book 5)",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Truth-About-Dukes-Rogues-Riches-ebook/dp/B085XX5PF7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81XpP7XbisL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Grace Burrowes",
            "link": "https://www.amazon.com/Grace-Burrowes/e/B004FR6YMM/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1813,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A new duke and a woman with a secret in her past get a second chance at love in this delightful and charming Regency romance from the New York Times bestselling author of the Windham series.Robert Rothmere is hiding a past no duke should have endured, but he's not hiding it well enough. Sooner or later, his enemies will learn that he spent years locked away at a private asylum. To get their hands on his wealth, they'll try to send him right back to his worst nightmares. If Robert is to foil their schemes, he needs to marry a perfectly proper, blessedly boring, deadly dull duchess, immediately -- and he knows exactly which quietly delightful lady he'd love to entrust with that role.Lady Constance Wentworth has cultivated a reputation for utter forgettability. She never speaks out of turn (in public), never has a daring thought (that she admits aloud), and never comes close to courting scandal . . . as far as anybody knows. Her path crossed Robert's years ago, though, and she's never forgotten the extraordinary lengths he traveled to keep her safe when she hadn't a friend in the world. She longs to be his demure duchess . . . but little does he know that to marry her would be utter madness. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B085XX5PF7"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Forever (November 10, 2020)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 10, 2020"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3013 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 401 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#60,742 in Kindle Store (See Top 100 in Kindle Store) #345 in Historical British & Irish Literature #467 in Historical Regency Fiction #756 in Saga Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,813 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3GTJ3VKK772NIXRCG764TRCELA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DOZNSTPPMO2C?ASIN=B085XX5PF7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars enjoyed the book",
                "reviewText": "enjoyed the book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ellen C. Ziegler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3R2ZHVEN3C5YPEAWWZ4JV3QIOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G594PO10IYR9?ASIN=B085XX5PF7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2020",
                "reviewTitle": "5.0 out of 5 stars Really wonderful love story.",
                "reviewText": "When I read Althea and Nathaniel’s story I found Constance intriguing because I knew there had to be more to her reason for wanting to be a wallflowers. I thought what did her father do to her? He was an abusive drunk to all his children. And of course Robert had been horribly abused by his father and then at the “asylum” where he was basically tortured for being epileptic. These two people grew to love each other because they understood each other’s pain and as a result they both overcame their fear. But it was the sweetness and gentility shown to Constance by Robert that really made me love him too. And there is a scene where Constance sticks up for herself at a wedding breakfast that literally had me a blubbering idiot. I like a book that pulls my heartstrings, that makes me do enraptured by the relationship and characters that when the reach the top of the mountain it makes me cry to see their pain but cheer their victory. This is a lovely book. One of the best I have read in a long time... now about her brother Stephen... can not wait to see what he does for Miss Abbott...",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGESNS63ZA75DBGCK2X2434Y3HOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14PZCJ2A6MN78?ASIN=B085XX5PF7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2022",
                "reviewTitle": "4.0 out of 5 stars Good Historical Romance",
                "reviewText": "My rating for The Truth About Dukes, by Grace Burrowes: 4 stars.I have read a lot of Grace Burrowes books, and she is a talented writer. While this book, and the other books in this series are not quite as good as some of her earlier books -- they are still very good.The books in the Roques to Riches series should be read in order, beginning with My One and Only Duke, because each book builds on information that is revealed in the earlier books. The books would not be as enjoyable if the reader wasn't aware of earlier information that had been revealed.I liked this book a great deal, and absolutely adored the developing romance between Constance and Robert. Both of them had very sad pasts, when they were treated horribly by their fathers, so they had a lot in common. I absolutely love that Constance wasn't bothered at all by Robert's illness. In that time period, many people considered him to be mentally incompetent, but Constance never did.I was glad that Robert immediately tried to help Constance with her problem, even though he knew that his mental competence would probably be questioned. I also liked that they found a solution to both of their problems, and that their families supported/helped them do that.The romance between Constance and Robert was sweet -- their conversations were sometimes a bit funny and often endearing. I thought they were really good together. I won't give spoilers, but I also liked that they were able to best the people who were determined to ruin Robert.My only complaint about this book was that it seemed a bit unnecessarily wordy, and also a bit too long. Some of the detail of the plot could have been left out, and the story would not have suffered.My rating system is below.1 star -- Hated it, or did not finish. I usually only give this rating if some of the content is truly objectionable to me, like if one of the main characters does something really awful, and gets away with it.2 stars -- Didn't like it. This rating usually means that I thought the writing wasn't very good, the editing was terrible, I didn't like the characters, or it had other major flaws.3 stars -- I liked it, but had some minor issues with it. This rating means that there were minor editing issues, the story needed more character development, it was just too unrealistic, or had some other fairly minor issue. The majority of books I read get this rating – I do not consider it a bad rating.4 stars -- I liked it a lot. This is a high rating for me, and I rarely give a higher one.5 stars -- I loved it, and will probably read it again. Very few books are good enough to get this rating from me. The ones that do are usually classics.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mainer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFN46QCWOY4QQNPYEOM3DPXNOPXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PK87XYJUMWYY?ASIN=B085XX5PF7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2021",
                "reviewTitle": "5.0 out of 5 stars Wonderful story",
                "reviewText": "This is one of those books I wish I could give more stars to. I'm a huge fan of Ms. Burrowes, but this story was unique in such a wonderful way among historical romances.Robert Rothmere was put into an asylum as a boy by his father because of his epilepsy. Rescued years later by his brother, he is now the rightful and reclusive Duke of Rothhaven. His neighbor is Lady Constance Wentworth who he knows from his years in the asylum (no spoilers).Robert struggles to deal with an unfamiliar world, one where he could be shamed at any moment due to a seizure. Constance has her own issues and these two damaged people find solace and love with each other. It's lovely writing about two interesting characters, different in many ways from the typical Regency H/h, a book I thoroughly enjoyed.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L.O.D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHTIFCW6JR246OUNOYW62Y6WGLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCTNXIH4DEN0L?ASIN=B085XX5PF7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2020",
                "reviewTitle": "5.0 out of 5 stars I loved it!",
                "reviewText": "I always like Grace Burrowes books , but some of them I LOVE and this is one of those.Robert and Constance are wonderful as a couple. You also get the rest of the family which is a plus.The story line is very Interesting , upsetting and lovely , I could not go to sleep last because I needed to finish it to see how they would get their HEA, so today I have rabbit eyes 😳. I highly recommend the truth about Dukes!If you have not read the previous books, you should at least No. 4. I",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary K.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AER56KQW2GS45UKFUEPCLRCQ5ARA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MI3BM916225P?ASIN=B085XX5PF7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2020",
                "reviewTitle": "5.0 out of 5 stars A delightful novel from start to finish",
                "reviewText": "I can rarely say anywhere near enough good about a Grace Burrowes novel because they are so splendid. The Truth About Dukes is yet another example of the beautiful writing of this amazing author. Her prose is simply lyrical and her characters are people you would be delighted to know. By the same token, however, there is always more to her romances than meets the eye. There is always a touch of mystery, an unexpected twist, or an unusual occurrence that demands eventual explanation. Grace Burrowes has created yet another such novel, and it is delightful from start to finish.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claire Kilpatrick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSMAU5I6E5GGTG3H77AUYHQV5HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9S1VARLO5HD7?ASIN=B085XX5PF7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2022",
                "reviewTitle": "4.0 out of 5 stars Another Wentworth saga.",
                "reviewText": "I enjoyed Constance’s story. As it was also Robert’s story the book was quite busy. I thought having 2 goals kept the pace of the novel moving at a good speed. I have enjoyed all the books in the Wentworth family story. I now have Steven’s story to read. I can’t wait!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tabby1249",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUGZMUYC6ACA733MBXXNZBRTE4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2K3T74NC64473?ASIN=B085XX5PF7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2020",
                "reviewTitle": "5.0 out of 5 stars Well done",
                "reviewText": "This is one of those books that I had to put down from time to time because the tension and my concern for the characters became a bit too much.I’ve read a lot of Grace Burrows’ work and she has occasionally disappointed me but I am happy to report that this is not one of those times. All of the elements of a satisfying story were there: interesting plot, wonderful characters, good pacing, tension and release, a believable HEA.Overall, a cracking good read.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annabel ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 1, 2022",
                "reviewTitle": "brilliant! couldn’t put it down!",
                "reviewText": "Grace Burrows is a brilliant writer, though no one needs my opinion on that.This series has been, and is engaging, heart stopping and mesmerizing in it’s content and characters. This book impressively imparts grace through the love story of a wallflower portrait artist, searching for the daughter she adopted away years before, who loves a gentleman Duke afflicted with epilepsy.Though set in a time when the disease garnered ‘demonic possession ‘ as its diagnosis, the tenants that stigmatize the disease are graciously presented and normalized. I don’t think I have cheered for a hero and heroine as much as I have for these two, who graciously hoped for the best but planned to accept the worst. That central story is set amongst quirky, scheming and loving family members, friends and villains. The book is full!Brilliant writing. I’ll read the next book, and then probably come back to this one, just for it’s wisdom and humor. Well done Ms. Burrowes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nora H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 11, 2022",
                "reviewTitle": "Loved it!!",
                "reviewText": "I’ve read all the books in the series so far. Absolutely love them all and recommend. Very well written with a good sense of humour. Cannot wait to start the next one. Lord Stephen is quite promising!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie McLean",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 11, 2020",
                "reviewTitle": "Riveting!",
                "reviewText": "I really enjoyed Robert and Constance’s engrossing journey of discovery, learning much about how epilepsy was regarded and treated (or mistreated) during this period.It’s a harrowing tale of determination and decency that triumphs over greed and jealousy.This is an unforgettable story, difficult to put down and very well written. The finale is superb!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sorin Cohn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2022",
                "reviewTitle": "Tender love and perseverance solving doings of evil",
                "reviewText": "Grace Burrowes captivâtes with her love of strong principled characters dedicated to goodness in the face of unspeakable evil. Humour, love and masterfully woven suspense make Grace’s books impossible to put down even if one needs to sleep or eat.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 20, 2021",
                "reviewTitle": "The truth indeed",
                "reviewText": "Fabulous Grace ... once again your storytelling is wonderful . Thanks for writing so that I can have many enjoyable hours of reading",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}