{
    "remaining_requests": 752,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Eagle-Dragon-Novel-Rome-China-ebook/dp/B01MSEAC3I",
    "body": {
        "name": "The Eagle and the Dragon, a Novel of Rome and China (Novels of Ancient Rome Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Eagle-Dragon-Novel-Rome-China-ebook/dp/B01MSEAC3I",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81ZEbZ0yVNL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lewis F. McIntyre",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_ebooks_1?ie=UTF8&field-author=Lewis+F.+McIntyre&text=Lewis+F.+McIntyre&sort=relevancerank&search-alias=digital-text"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1426,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B01MSEAC3I"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Lew and Karen McIntyre Authors LLC; 1st edition (February 2, 2017)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 2, 2017"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 9714 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 554 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,992 in Kindle Store (See Top 100 in Kindle Store) #6 in Historical Chinese Fiction #1,605 in Action & Adventure Fiction (Kindle Store) #2,352 in Historical Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,426 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Derf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMUGF5NBDP6UB4F7OVLVSXLFSJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VQ9W0OJR4GAD?ASIN=B01MSEAC3I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Really good read",
                "reviewText": "It’s a very well done history/travel novel with interesting characters and a good mix of action and plot twists. There are a few, but only a few sections that are tedious.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sherry Christie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJP5I6ZI6YDXTBC7ONV5BAMEWBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DTE7T11AOD0E?ASIN=B01MSEAC3I",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2017",
                "reviewTitle": "4.0 out of 5 stars Romans Go to China",
                "reviewText": "This novel reminds me of the leather-bound Age of Explorers histories I used to read for term papers -– voyages to the African empire of Prester John, and so on. In “The Eagle and the Dragon,” the author’s conceit is that descendants of Roman soldiers captured by Parthians after the 53 BC battle of Carrhae return to Rome 150 years later, accompanying an ambassador from the Chinese Emperor. A group of adventurous Romans – feisty Senator Aulus Galba, patrician tribune Gaius Lucullus, and his faithful centurion Antonius – embark on a voyage back to China, carrying gifts for Trajan’s eastern counterpart and hoping to acquire precious trade goods. The story follows them on their sea voyage to China, a trip beset by pirates, unfriendly locals, and ambassador Ming’s bad behavior toward his concubine Marcia, one of the Roman umpty-great-granddaughters. Murder at the Chinese court forces them to make a daring escape from prison and struggle across the breadth of Asia to return to Rome, pursued by the Emperor’s forces and treacherous Parthians.It’s a humdinger of a story, accompanied by mini-maps in every chapter or so that show the reader where our heroes are. Mr. McIntyre’s awesome amount of research and/or prodigious imagination allow him to pack interesting detail into the escapades, such as a sketch of the imperial palace and a description of dining with friendly Xiongnu nomads. I wish he’d resisted the impulse to make Antonius sound like Alfred Doolittle (“Not enough room ter turn around without hitting yer messmate though… beggin’ yer pardon, sir”), but maybe that won’t bother other readers. A worthy addition to the Age of Fictitious Explorers bookshelf.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindy Irish",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2OVYNS42ATLKSFS54PQR5UWL2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VNLFY6GZEPWK?ASIN=B01MSEAC3I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent work",
                "reviewText": "I have read many Roman stories but this book was an adventure worth taking I will most definitely recommend it as a must read for anyone interested in Roman history. Thanks",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William Lowe Ball",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSKQ23WNW746KBVUAWF43MSOADQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ERNIHIF7RZ20?ASIN=B01MSEAC3I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "5.0 out of 5 stars An Excellent Historical Novel",
                "reviewText": "Difficult to put down once you start reading! Travel, historical and political conditions in the time frame this story is set in are accurately portrayed. Highly recommend this book for those interested in historical novels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDA5B74XGIZIBFLLB4CXXALFKUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9W7UE3C7FDYH?ASIN=B01MSEAC3I",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2023",
                "reviewTitle": "3.0 out of 5 stars Roman Marco Polo",
                "reviewText": "The overall content of this book is it depicts the travel and events of a romanized Marco Polo adventure which ends better. Note Romans (ancient Italians), similar events wit added characters. Added content along moral and religious lines.Big hang up for me he portrait Antonio’s a career soldier with the education of a scholar yet Popeye the Sailor’s speech and full character thus contrasting character teaits",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kirk Alexander",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWFCLUVY7FX7FSFFL6RI3MWSEAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RWOI347DM1W7?ASIN=B01MSEAC3I",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2023",
                "reviewTitle": "4.0 out of 5 stars FunFunFun!",
                "reviewText": "This is an epic. A rip roaring adventure with plenty of action, suspense, and just the right amount of romance. The author paints vibrant pictures of exotic settings peopled with truly memorable characters. As a lover of Roman history and someone who has spent a considerable amount of my adult life in China, I found the situations, and their settings both convincing and compelling. A real page turner. Can’t wait for McIntyre’s next book!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Norm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLHRLWCOPSD5ON6FOHEYK23B2RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCHNXEVLB3LCK?ASIN=B01MSEAC3I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2023",
                "reviewTitle": "5.0 out of 5 stars This is a great read!",
                "reviewText": "I seldom give five stars so this is an exception. What makes this tale noteworthy is the continuity of the story. Every step of the plot is believable. I am impressed with what must have been a great deal of research. The maps helped a lot and I followed along in my atlas, as well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Don",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7GS5AYGCM2IMAO4LZNAYVTYX4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P45X1DQA6YBS?ASIN=B01MSEAC3I",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 28, 2023",
                "reviewTitle": "5.0 out of 5 stars An exciting adventure. A full story. Great characters facing many obstacles. Also Danger, Love etc",
                "reviewText": "You will start in Rome, go to China, and return to Rome. What could happen to envoys of two emperors trying to get to know each other and connect in trade. A LOT ! ! !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julie Whitley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 20, 2022",
                "reviewTitle": "an epic tale",
                "reviewText": "I became thoroughly engaged in this historical fiction story of the epic journey of Antonius, Gaius and Aulus as they planned their diplomatic mission to the court of the Emperor of China. Many challenges and adventures came their way both heading east and their escape west. Along the way, they made firm friends and brief enemies. I’m glad to have been along for the ride. I learned a great deal about the times and conditions in which they lived and found it all fascinating.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Weltenbummler57",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 7, 2023",
                "reviewTitle": "When is the next book coming out",
                "reviewText": "Very entertaining. Good book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jannert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 5, 2017",
                "reviewTitle": "I'll be reading this one again. A thoroughly enjoyable journey!",
                "reviewText": "I recently finished the Cato and Macro series of books by Simon Scarrow, set during the time of Emperor Claudius, and I was eager to read more about the historical Roman empire. I was hoping to find something a little less 'military,' so I put “Rome historical novel” into the Amazon search box. The Eagle and the Dragon came up.Its premise looked interesting—descendants of a lost Roman legion return to Rome from China, and get sent back by Emperor Trajan to establish diplomatic and trading ties with the Han Empire. The ‘look inside’ portion of the book drew me right in, right away. So I bought it. I couldn’t have made a better purchase.This is the kind of deeply immersive read I’ve been searching for for ages. I would describe this book as ‘rich.’ It’s rich with characters whom I became very fond of (even the ones I hated …there are a couple of nasty but totally believable baddies in this book!) The lush and varied settings are enriched by thoroughly-researched detail that underpins the characters and action, but never overwhelms the story.Mr McIntyre is a master storyteller. He knows exactly how to drip-feed information to the reader without showing off his scholarship. His many characters and different settings are all introduced in small increments and developed carefully, so they stick. He is an expert at creating nuanced characters who become real people to us, very quickly. He is a man who can write believable female characters as well as the majority of the male characters this tale demands. He understands politics and diplomacy, and how differing personalities make these situations work—or can screw them up. And he serves up a cracking plot, which keeps pages turning and suspense building.The scope of the story is huge. The journey from Rome to China via the sea route, and a return trip from China to Rome via the Silk Road is a classic journey that even today would take a long time to make. Back then, it took several years, and was anything but safe and secure.On the way our main characters suffer physical and mental hardships, experience threats to their lives and livelihoods, see and learn about many different cultures while ‘life happens’ to them along the way. Relationships and friendships are formed—some unlikely—and some are eventually broken. Trust gets repaid, and trust also gets betrayed. Some characters live, some characters die during the journey. Most of these people develop new skills and acquire confidence in themselves. Some get their faiths tested many times. Things they believed at the outset of the journey are not necessarily what the survivors believe at the end of it.And, as an added bonus, much of Mr McIntyre's storytelling is accomplished with humour. Most of his characters—both main and secondary—have a sense of humour, according to their various personalities, and this makes the story sparkle. Mr McIntyre’s dialogue is always lively, can be droll, and is always a joy to read.I fell in love with this highly original book, and found it hard to put down. I intend to read it again. I guess I can’t give it a higher personal compliment that that.I look forward to many more books from Mr McIntyre.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 28, 2023",
                "reviewTitle": "nice adventure",
                "reviewText": "Keeps one from putting the book down . Really different adventure novel and many twists and turns. Have fun reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Iphidaimos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 29, 2022",
                "reviewTitle": "A good yarn.",
                "reviewText": "The story is good if a little predictable and spun a nice yarn about the otherwise largely unknown but very real contact between Rome and China. A good first novel from the author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}