{
    "remaining_requests": 850,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Legacy-Longdale-Manor-Carrie-Turansky-ebook/dp/B0BW14246P",
    "body": {
        "name": "The Legacy of Longdale Manor: (An English Split-Time Christian Historical Romance Novel)",
        "price": "$10.99",
        "originalPrice": "",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Legacy-Longdale-Manor-Carrie-Turansky-ebook/dp/B0BW14246P",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81AvthMmZ1L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Carrie Turansky",
            "link": "https://www.amazon.com/Carrie-Turansky/e/B001H6SNK0/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 142,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Two women--a century apart--embark on a journey to healing, faith, forgiveness, and romance.In 2012, art historian Gwen Morris travels to England's Lake District to appraise the paintings and antiques of an old family friend, hoping to prove herself to her prestigious grandfather. While at Longdale Manor, she meets David Bradford--the owner's handsome grandson--who is desperate to save the crumbling estate by turning it into a luxury hotel. When Gwen stumbles upon a one-hundred-year-old journal and an intricately carved shepherd's staff similar to one in a photo of her parents, she's left searching for answers.In 1912, after her father's death, Charlotte Harper uncovers a painful family secret she can only confess to her journal. She and her family travel to the Lake District to stay on a sheep farm, hoping eventually to find a home with Charlotte's grandfather at Longdale Manor, but old wounds and bitter regrets make it a difficult challenge. As Charlotte grows closer to shepherd Ian Storey and rebuilds her shattered faith, she must decide whether she will ever trust in love again.Praise for The Legacy of Longdale Manor\"This novel will stir your faith--and your desire to visit England's Lake District!\"--JULIE KLASSEN, bestselling author \"Turansky opens the door of Longdale Manor and invites readers to explore the secrets hidden inside.\"--MELANIE DOBSON, award-winning author\"A beautiful book to warm and lift the heart.\"--CATHY GOHLKE, Christy Hall of Fame author",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158280011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BW14246P"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bethany House Publishers (September 26, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 26, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4772 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 351 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0764241052"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#236,207 in Kindle Store (See Top 100 in Kindle Store) #435 in Historical Christian Romance Fiction #699 in Christian Historical Romance #3,331 in Religious Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 142 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "A beautiful hand-carved shepherd’s staff is one of the items Gwen Morris finds at Longdale Manor that leads her to believe she is on the right path to finding her missing father. Photo credit: Wren Country Sticks",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b270ef96-8e37-414c-a6b3-f05ebdaa61a0.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "England’s Lake District is a region known for its breathtaking natural beauty with shimmering lakes, quaint villages, and rugged mountain, or fells as they’re called by the locals. It has become a haven for nature lovers, adventure seekers, and those looking for a peaceful getaway. After visiting there, I knew I wanted readers to experience this lovely setting in one of my novels. The Legacy of Longdale Manor takes place at a lovely estate on the shores of Derwentwater, not far from Keswick. Photo credit: James Armes",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62a3ec6a-60b1-4faf-8b6c-b22101356a1c.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bc84df90-7a3b-427d-a8ad-2d0ec9e9c98a.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b8dcc29-77dc-487d-ab5f-94132c28d939.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0fd8c043-c948-4a85-af03-339ca90e0a94.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1378a471-c1e5-4048-a985-d5797bf38430.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b270ef96-8e37-414c-a6b3-f05ebdaa61a0.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62a3ec6a-60b1-4faf-8b6c-b22101356a1c.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Goofy Grammy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWJF7UZDGDUA7CR4RMSUFTGSACQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13VDNXHKLIXCD?ASIN=B0BW14246P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "5.0 out of 5 stars A wonderful story",
                "reviewText": "The thing that impressed me the most was forgiveness. How forgiveness affects the person who is doing the forgiving almost as much as the one forgiven.This is a great read. It has so many beautiful pictures well described, of the beautiful Lake District in England.I love your books Carrie.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura Hartness",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFORLWR65PGXGPY3ROZXBZ6YVZEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14TIZTRKTH5RF?ASIN=B0BW14246P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "4.0 out of 5 stars Sweet, Pastoral Read",
                "reviewText": "Carrie Turansky is a successful author in the world of Christian publishing, but \"The Legacy of Longdale Manor\" is my first exposure to her work. Fans of the writings of Julie Klassen, Erica Vetsch and Katherine Reay will find a similar approach to historical fiction through the lens of a Christian worldview. Turansky presents characters who are likable, yet flawed. They are damaged, but not beyond repair. Like myself and many with whom I am acquainted, they face disappointments, loss, and are sometimes hurt by those around them. \"The Legacy of Longdale Manor\" is a dual-timeline novel, but the themes of love, forgiveness and reconciliation echo back and forth across the century in which it inhabits.In the early 20th century, a Christian family faces the type of scandal which is still occurring today. The Harpers endure the loss of the family patriarch, and a secret sin is revealed. This husband, father and preacher was more flawed than they had ever imagined. How does one reconcile the hypocrisy of a Christian leader with their successful ministry and love of family? How does a now fatherless and husbandless family move on, with almost no resources to survive? As the main focus of this narrative thread, daughter Charlotte must navigate the tumultuous waters of grief, disappointment and betrayal. Her journey leads her through lessons of faith which teach her about forgiveness, healing and trusting. The issue of trust becomes most apparent as she begins to know shepherd Ian Storey. He seems like a kind, trustworthy young man, but certain issues bring doubt to Charlotte’s mind. She must not only learn to forgive her late father, but she must also come to trust in others again. The words of a local minister summarize a major theme of \"The Legacy of Longdale Manor\":“Jesus lays this choice before us. We can give our burdens and troubles into His care and live each day with the peace of Christ ruling in our hearts. Or we can hold on to the pain and wrongs done to us and harbor a troubled heart that hardens and grows bitter over time, stealing our joy and draining our days of the full life He wants us to enjoy.” (p. 152)Like Charlotte Harper, another young woman struggles with similar issues in Turansky’s tale. In the novel’s alternate timeline, Gwen Morris of the 21st century has also faced pain, disappointment and family secrets. In 2012 she finds herself at Longdale Manor, trying to rebuild her damaged career while also wrestling with difficult family issues. She becomes friends with her Longdale clients, and as they work together to maintain and stimulate the legacy of this large estate, secrets are unearthed. Like Charlotte, Gwen is given the opportunity to grow in her faith through the exercise of forgiveness. While she might not struggle with the issue of trust as much as Charlotte, she does grow in that regard as well. The life lessons and matters of faith that both women address across the century are timeless and will continue to resonate throughout human history.\"The Legacy of Longdale Manor\" was a delightful, light read, while at the same time addressing the difficult issues of Christian hypocrisy, disappointment and loss. The content does bring up adult matters, but the writing is squeaky-clean. If readers are looking for something with a bit of an “edge”, this is not the book for you. However, if you’d like a historical fiction title that is firmly set in the Christian worldview, with sweet romance and (mostly) happily-ever-afters, this might be a good match. As mentioned earlier, these characters are flawed. However, Longdale Manor is very family-friendly and has excellent messages for those who may be harboring bitterness or disappointment. The words of Charlotte Harper’s journal are good advice for us all:“I’ve learned forgiveness is just as much for my benefit as it is for the other person. It’s like giving up my right to hurt someone back and letting God handle the justice of the situation as He thinks best.” (p.333)Forgiveness does not excuse the hurt that was caused, nor does it erase the consequences of the wrong committed. It does lead to a process of healing, however. This theme is seen multiple times throughout \"The Legacy of Longdale Manor.\" Through that recovery, Carrie Turansky's characters not only find more peace in their hearts, but they are able to find sweet, romantic love as well. The Great Shepherd would be pleased with that restoration, as He is the author of love and healing itself.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roberta",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7U3HW5SQOYXZGHM62TXHOK77MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DFZZWBUWP6OB?ASIN=B0BW14246P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Lessons on Forgiveness",
                "reviewText": "The past brings hope and healing to the present through a journal written in the early 1900’s. Themes of love, faith, forgiveness, and family are woven through this story covering two different time periods in the beautiful Lake District of England. I thoroughly enjoyed reading this on a recent trip and didn’t want to put it down!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBZSG6ECOPBVAQ6X4LQ5ILGDYGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MBH91PIZYMP8?ASIN=B0BW14246P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Page turner",
                "reviewText": "Every book I have read by Carrie Turansky has intrigued me and held my interest. I love how she portrays her characters. The dual timeline kept me engaged and trying to figure out how to connect the dots.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIXZSUOSECMWCMUEGH3BQXQCM3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LV5PX99CJRWV?ASIN=B0BW14246P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Such a Sweet Story!",
                "reviewText": "I love the double time period point of view in books! It’s so fun to read about the differences between the ages. What are the people doing in the different years? What has changed in the landscape, technology, culture? The Legacy of Longdale Manor splits the time periods so well! The transitions flow seamlessly, and I love how they connect (sorry, no spoilers here).The characters make this book, for sure! The 1912 characters of Charlotte Harper with her family and Ian Storey with his family bring the era to life. Charlotte is such a relatable character. She can be stubborn and quick to jump to conclusions, but she has a good heart and wants what is best for her family and friends. I loved watching her journey and growth in this book. Ian is a complex character. He is also relatable. I loved learning about his faith and devotion to his family.The 2012 characters of Gwen Morris and David Bradford are just as relatable and did a great job of bringing the story into more current times. Gwen has suffered great loss in her life and is trying to find herself. She, like Charlotte, also likes to jump to early conclusions, which sometimes causes her more heartache. David seems like a great, down-to-earth guy who is just trying to figure things out and do what is best. I love the devotion he has to his grandmother. He falters at times but learns from his mistakes and tries to do better the next time.One of my favorite parts of reading is going on adventures to different places. The Legacy of Longdale Manor takes place in London and Manchester, England. I need to go see this Lake District they keep raving about! Ms. Turansky does a great job of describing the town, the lake, the mountains (or fells), and the feelings around keeping it beautiful and pristine.I liked the story lines in each of the time periods and felt like Ms. Turansky did a good job of bringing them together. At the end of the book, I was left with a few questions, and one of the questions was quite important to the story. However, I did receive an ARC (Advanced Reader’s Copy) of the book, and it may have been fixed in the final draft.Christianity and faith are not brought up a lot in a lot of books today, and I appreciated learning about each of the character’s faith journeys. There is everyone from a traveling preacher to a recent college graduate who questions her faith. They pray over their meals, go to church, and discuss their faith. I loved the honesty in it as some questioned their faith and grappled with themselves or others not living up to the standards they thought they should. Faith is a journey, and each of us is at our own place on that journey. It’s helpful to remember that, and to give each other grace and love.If you’re looking for a beautiful story set in a beautiful place, The Legacy of Longdale Manor is for you! You won’t be disappointed! It’s heartfelt and deals with tradition, loyalty, love, fatherhood, faith, forgiveness, and hope.Content Rating: PG-13• Profanity: None• Intimacy: None (Some romantic kissing.)• Violence: NoneAge Recommendation: YA+",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Ledesma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGQPWKXWTDSSP2IOL7SRQGDDHQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TDR1EGU6V65K?ASIN=B0BW14246P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2023",
                "reviewTitle": "5.0 out of 5 stars A gentle break from the world",
                "reviewText": "I love Carrie’s style of writing because she’s taking me on a little break from the real world and bringing me to a beautiful estate, with interesting characters and a mystery to be solved. I especially enjoy the weaving of faith into the story, since we all have struggled at times (or will struggle) with trying to figure out what God’s greater plan is!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}