{
    "remaining_requests": 775,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Pillars-of-Earth-Ken-Follett-audiobook/dp/B000X1MX7E",
    "body": {
        "name": "The Pillars of the Earth",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Pillars-of-Earth-Ken-Follett-audiobook/dp/B000X1MX7E",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51dmIEgId2L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ken Follett",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Ken+Follett&search-alias=audible"
        },
        "brand": "Ken Follett&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 48454,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The Pillars of the Earth tells the story of Philip, prior of Kingsbridge, a devout and resourceful monk driven to build the greatest Gothic cathedral the world has known...of Tom, the mason who becomes his architect - a man divided in his soul...of the beautiful, elusive Lady Aliena, haunted by a secret shame...and of a struggle between good and evil that will turn church against state, and brother against brother. A spellbinding epic tale of ambition, anarchy, and absolute power set against the sprawling medieval canvas of 12th century England, this is Ken Follett's historical masterpiece. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Family Saga",
                "link": "https://www.amazon.com/Family-Saga-Genre-Fiction-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10163"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "40 hours and 56 minutes"
            },
            {
                "name": "Author",
                "value": "Ken Follett"
            },
            {
                "name": "Narrator",
                "value": "John Lee"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "December 31, 2006"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B000X1MX7E"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#940 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #13 in Fiction Sagas #39 in Family Saga Fiction #49 in Historical Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Rip",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZV5BW4S7DNGIINO7JJLYNCVTBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NEAL3WNHEW4Y?ASIN=B000X1MX7E",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Stupendous.",
                "reviewText": "I remember my mom reading this book and loving it. Then I remember the miniseries coming out, and I thought, “Oh! Ian McShane!” I didn’t watch it. Then I forgot about it for about a decade and a half.I saw it at my local library and checked it out in my usual attitude of “Of course I’m gonna read this and the other four books I checked out in the next 3 weeks!” I had a little pocket money, so I ordered it on Amazon when the time came to return the library book and admit for the thousandth time that I don’t have nearly as much time to read as I used to.Holy $#¡¥ am I glad I did.This book is tremendous. The detail, the readability, the huge time arc of the plot, and, most importantly , the characters.The characters drive the story. I know that’s a cliche , but I don’t care; the characters in this story are brilliant. Tom Builder, Prior Phillip, William Hamleigh, Aliena, Jack, Ellen, Martha, and more. Even the supporting characters are interesting and clearly have their own motivations, even if Follett swings between thumbnail sketch and staying mum about those motivations.I won’t wax too much about this book. It would take too many words, and Pillars of the Earth is already full of them. 973 pages in the paperback edition to be precise. I know that most people aren’t necessarily interested in a book that gives Lord of the Rings a run for its money in the length department, and I, as a fan of long books, am hardly unbiased. But it is worth it. You’ll miss meals reading this thing.Two points I want to make:1) This book avoids (mostly) one of the major pitfalls of historical fiction. The people in the story seem like they are actually from the Middle Ages, rather than being moral and philosophical transplants from the modern age. This is the Achilles heel of writers like Bernard Cornwell (whom I’ve read and enjoyed) and (I’m told) Phillips Gregory. The story may be fun or compelling, the detail may be solid and accurate, but the characters don’t seem like they are actually from the period. Scratch the surface, and they turn out to be a 20th/21st century citizen mentally, rather than a person from that “foreign country” called the past.Follett doesn’t do that. Or, at the very least, by the time he may have around page 600, I didn’t care.2) A warning: dovetailing with point number 1, there are parts of this book that are VERY difficult to read. When it comes to fiction, I’m a fan of sex and a fan of violence. But the unfortunate reality of the Middle Ages (and history and life in general) was that the two were often combined. Those of us that are lucky have never had to deal with this. But, even more so in innumerable areas of the past, this is a reality, and Follett does not shy away from it. One instance early in the book had me put it down and walk away. I came back, because, again, it is a spectacularly written and told story, but there are parts that will make your stomach turn. You have been warned.All told, this book is incredible. The building of the fictional Kingsbridge cathedral reflects the sheer amount of effort, ingenuity, and, most importantly, time it took to build these structures.Don’t believe me? Look up Salisbury cathedral on an image search and ask yourself: “How, seriously HOW, was this built back then?” This novel will tell you a story about that.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETM5X4E37ZRAB6XYXYKWVYNUOVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39BETPKFN14YG?ASIN=B000X1MX7E",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars One of my favorite books ever",
                "reviewText": "A friend recommended this book to me, and being a history buff, I thoroughly enjoyed reading this fictional account of early England. I have since bought the entire set of the Kingsbridge series, and all are page-turners.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jen42",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLG5XPK4MI7ODYOVZ532X3ZNR4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HU3QSC4DCF6Q?ASIN=B000X1MX7E",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Do you like breasts? Well, Ken Follett does, and he is here to tell you about it.",
                "reviewText": "Young breasts, flat breasts, full breasts, ripe breasts, large breasts... they are all featured as main characters here. 17 year old boy character fixating on his crush's breasts? Understandable. But then both the male characters and Ken Follet take every excuse to further fixate on breasts. There really are good facets to this book (more below), and when I was nearly done I thought, Well, at least I won't have to keep reading about breasts constantly. Then one of the last passages is an old man musing fondly on all the changes her breasts have undergone throughout the years. I nearly threw my Kindle out the window. This kind of book is where the \"she breasted breastily abreast the breastway\" quote comes from. The sex scenes are really excruciating.Okay, so other issues? Well, first off (this isn't a main issue but it irked me) is that Villain Woman has really bad skin. This is all anybody thinks about when they look at her. This is basically how she's described. I kept thinking, okay, we're in the Middle Ages and people are freaked out about a woman's acne? Because the Middle Ages were all about regular cleansing and moisturizing? Anyway, the cliche of bad people having bad skin is very lazy. The villains were lazily written too. The main one, William, just rapes and kills everyone and seems like he'd cheerfully skin a nun if given the chance. No complexity. Tom, one of the good guys, has no complexity either, unless you count him being a genius architect and a complete moron about everything else.So why four stars? Well, the historical research is incredible, especially considering it was written in 1982 before you could ask ChatGPT to tell you what happened. And the plot, despite all the frustrations of stock characters and rampant breasts, is really good. It's gripping and page-turning and you want to see what on earth is going to happen. The writing is okay. It's written like a thriller, which he also writes, and it's simple and straightforward. Some of the sentences struck me as poorly worded, but overall it's not a glaring issue.I should also note that I read his most recent Kingsbridge books and there are a lot fewer breasts. In a good way.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCWJRHWLVFYNTDW3ZOBHCY55CYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13ZDBRF4PJ8HZ?ASIN=B000X1MX7E",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars History Isn't Dull",
                "reviewText": "As a reader of many works of historical fiction, Ken Follett is one of my favorite scribblers.As a huge fan of The Century Trilogy, I had passed up the Kingsbridge series any number of times. A big mistake on my part. Don't make it.Super character development, heroes and villains, intrigue and action. Don't miss it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Thomas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCF567WZELAEKEG4KOHB64NCDKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ94F3IUZ7051?ASIN=B000X1MX7E",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book!",
                "reviewText": "This book literally made me stay awake at night. The characters were described well and the story was gripping. It was beautifully written and I would live to see a live action version on the big screen.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 10, 2024",
                "reviewTitle": "good historical read",
                "reviewText": "The architectural detail was made interesting as it was woven into the lives of three dimensional characters. It is a long read, but satisfying",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thais",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 29, 2023",
                "reviewTitle": "Livro ótimo",
                "reviewText": "Um espetáculo de leitura. Interessante, difícil parar de ler.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Perliux",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 18, 2022",
                "reviewTitle": "Absorbing!!",
                "reviewText": "I loved how the story grow as you keep reading it.For some people, this book sounds like a soap opera, but for me, the details in each description from a place to a person, are amazing.I enjoyed it much, but I have to admit it was a little difficult to hook up at first. As the pages changed and the characters began to appear, I loved how all stories floated around Kingsbridge town and the cathedral.I do recommend reading this but in English, especially if you are not a native speaker. It has a lot of rich vocabulary.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Farhad Shawkat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 11, 2024",
                "reviewTitle": "Historical Fiction at it's best",
                "reviewText": "Can’t believe I waited this long to read this. Easily one of the best books I have ever read, the plot – someone really wants to build a cathedral in the Middle Ages– seems deceptively simple and dull. What is presented to the reader is historical fiction at its best. The book is close to perfection, I can’t think of anything that I would criticise or wish to change, though a couple of trigger warnings might help for a few people – this is about life in the medieval times after all.The plot, the story, characters, political intrigue, love, betrayal, lust for power, it’s all there, and it’s all happening. A surprisingly fast read, which could still take a while to read, given it’s over a thousand pages. And still leaves you wanting more.If you’re apprehensive about starting a series, don’t worry, this can easily be read as a standalone. The next book is set in a later time period, so you can stop here and get a complete story. And what a tale Ken Follett has written. A work of fiction with very real characters you will end up caring deeply for.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 6, 2024",
                "reviewTitle": "Capolavoro",
                "reviewText": "Il capolavoro di Follett da leggere in lingua originale. É uno di quei libri che dá dispiacere quando finisce",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}