{
    "remaining_requests": 885,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Librarian-Spy-Novel-World-War-ebook/dp/B09CMRX8C6",
    "body": {
        "name": "The Librarian Spy: A Novel of World War II",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Librarian-Spy-Novel-World-War-ebook/dp/B09CMRX8C6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81A8B7aJXNL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Madeline Martin",
            "link": "https://www.amazon.com/Madeline-Martin/e/B00R8OGFN2/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3042,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09CMRX8C6"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Hanover Square Press (July 26, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 26, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1509 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 410 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,682 in Kindle Store (See Top 100 in Kindle Store) #20 in Historical World War II Fiction #20 in World War II Historical Fiction (Books) #53 in Women's Literary Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,042 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Last Bookshop in London The Librarian Spy The Keeper of Hidden Books More historical fiction by Madeline Martin ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fa276a7c-25e8-442b-9cfe-f0605ecfc5c4.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0acd0d36-4383-4317-a790-55f7e8fdd593.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2fe00220-a8da-4c14-b93f-115c39f00a9d.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8acbc1c8-0039-4795-b0c2-f419311a9710.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cf27015d-4024-482a-9ecb-72a0bdb13638.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c8f234cd-6df9-4145-9061-735de5e98ecc.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPOJ6IZCV2NVNO2KHF6DHXW3OKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZE0LN9FRL36M?ASIN=B09CMRX8C6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Superb!",
                "reviewText": "1943, two women on parallel paths that converge.Helene/Elaine was a young woman in Lyon, France, working as a printer for the Resistance, attempting to disseminate the truth about nazi occupation and the horrors inflicted on the citizens of France.Ava was an American librarian sent to Lisbon, Portugal, to provide microfiche of all newspapers, magazines and pamphlets to the government in order to study the enemy and determine what actions they might be planning.Enter a Jewish mother and child seeking freedom, needing to get out of Lyon and to her husband in the USA.Elaine posted a coded message in the underground newspaper. Ava, while photographing to microfiche said newspaper, notices that the normally error-free paper contains 58 errors, unheard-of in the past.As Ava seeks to decode the message, Elaine continues to struggle under nazi occupation and continue her vital work with the Resistance.In our current time we take for granted that we will have our morning coffee or tea, as well as bread for toast, and soap with which to wash. During nazi occupation and rationing, the citizens under nazi rule where subjected to hardships beyond our imagination, yet they persevered to survive. Elaine's struggle brings this to life.Spoiler alert .... pleasant ending.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elaine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6R2FD7PBVSJPNQLH4RNJIZJOEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CVLQ91JRVHQ3?ASIN=B09CMRX8C6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "4.0 out of 5 stars Spy",
                "reviewText": "Very eye opening what the men and woman went through in this time. What they were able to Sneak out in the every day life under the police and the nazi. Never under estimate a woman when she wants to help someone free themselves.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. T. Thomas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZTAXY65MT5JTX7TRMB4LC43NAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBK2BENR877NL?ASIN=B09CMRX8C6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars A Character-Driven Novel With A Page-Turning Plot!",
                "reviewText": "What a lovely and dynamic and enthralling novel! The author leveraged perfectly-drawn characters with real WW 2 drama and tension with the perfect plot! I cared about these characters, aspects of the story were historically new to me, and interesting, and the pacing and tension kept me reading way too far into the after-midnights! WW2 is a rich mother load of stories, and as long as they are as well-written as The Librarian Spy, I will read forever. Ms. Martin is a masterful writer who can capture the essence and colorations of a person and the elusive realities of inexplicable concepts of humanity and inhumanity amidst crucial points in human history.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TracyJane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4XZXKYMBCASW7ESD2KPE2G7TQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROLF18OJFELJC?ASIN=B09CMRX8C6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2022",
                "reviewTitle": "5.0 out of 5 stars An emotional and gripping story of war and hope",
                "reviewText": "Helene Belanger lives in occupied Lyon, France, and longs to join the Resistance, but her husband Joseph, who fought in the Great War is adamantly opposed, which leads to a fight and Joesph storming out. It has been two days and he has not returned, Helene is worried, she cannot go to the police as they are in with the Gestapo, and even Joesph’s best friend Etienne is missing. She is debating her options when there is a knock at her door and a woman looking for a man named Pierre, she is frantic, she is Jewish and needs new ID papers and Helene soon realizes that her husband is the man she is looking for and gives the woman her own papers. She then sets out to find Etienne for answers, but he finds her when she is stopped by the Nazi patrol asking for her papers. Etienne gives the man papers, proclaiming her to be Elaine Rousseau. Etienne takes her back to his flat and Helene learns the awful truth, her husband is part of the Resistance and has been captured. At that moment, Helene is no more and Elaine is born, Elaine who will stop at nothing to save her husband and annihilate the Nazis. She begins to work for the Resistance by delivering and later printing anti-Nazi tracts. It is how she meets a young Jewish woman named Sarah and her son Noah, Sarah’s husband Lewis is in America, she stayed behind to tend to her sick mother, thinking that she would be safe. But now she is being hunted and has no way to get a visa or even a flight to the States. Despite being told to leave it be by her superiors, she can’t ignore Sarah’s plight, with so much loss in her life, she needs to help them and sends a coded message in the Resistance’s publication “Combat”.Ava Harper is a librarian working in the Rare Book Room at the Library of Congress when she is asked to join the war effort by working for the Office of Strategic Services, gathering publications that may contain covert information on the Nazis. She would have to relocate to Lisbon, Portugal, a trip that she is not keen on making, but when she is reminded that her brother Daniel and many other soldiers fighting in the war need this intel, there is no way she can decline and makes the move to Lisbon. She is trying to settle in but soon learns that spies abound in Lisbon, and feels somewhat adrift. But luckily, an experienced British agent intervenes and takes her in under his wing and soon she is making her own contacts with other agents and the many refugees seeking asylum in neutral Portugal. She falls into a routine of collecting papers and magazines each day from around the world, and it is in the French paper “Combat” that she finds a coded message begging for help in extricating a young Jewish woman and her child from occupied Lyon and reuniting them with her husband in America. And even though her job is to simply collect data, there is no way Ava can ignore this cry for help. And so begins a joint collaboration to save Sarah and Noah from under the noses of the Nazis.When I first read the blurb for this book, I was sure I wouldn’t like a story with two protagonists' POVs, but couldn’t have been more wrong! The imagery and the attention to historic detail are outstanding and the writing is practically flawless. I was sucked in from the first page and could barely read the words fast enough to satisfy my need to know what would happen next. Be warned and have your tissues at the ready, because war is ugly and cruel, and this book doesn’t shy away from the horrors, nor does it sugarcoat the egregious acts perpetrated by the Nazis. But even with the death, destruction, and malice running rampant, there are moments of joy, comradery, and even love, that save this book from becoming a dark, depressing read. I loved this story and can’t recommend this powerful and emotional story highly enough.",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Waterside Lucy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERSBXUONEBBTU6A4JH3K6IZSHPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QHMFX2C4LUZA?ASIN=B09CMRX8C6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Very good",
                "reviewText": "I’ve read many novels set during WWII and the heroes and heroines who risked their lives and endured hardships we can never fully appreciate. Unfortunately the two main characters of this story were just OK. The story was told in such a matter-of-fact way I never bonded with these two ladies. I’m not sure what was missing but it was just sort of flat for me. It was still very good. I would recommend it. But there are other stories out there that just rip your heart out without being gory or sensational.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V. Green",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2CMPMNRON7CAQG2H6TROALVP6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GIHEN0XKQ796?ASIN=B09CMRX8C6",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2022",
                "reviewTitle": "3.0 out of 5 stars slow and frustrating",
                "reviewText": "I bought this book because I love historical fiction, especially WW2 stories, and because it had great reviews. I was disappointed with it. It took halfway through the book for the story to pick up speed. A really great book, I cannot put down and will read late into the night… but I found myself thankful when a chapter was over so I could take a break. The overall story was interesting but the pace was off. Also, I got the feeling that the author sat with a thesaurus coming up with as many adjectives as possible. Not every noun needs an adjective! I was frustrated with the wordy descriptions - sometimes less is more. Not one of my better purchases unfortunately.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "calgal66",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGC74G2AXD633SM5PXF444YEZZFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R127XO533WUPR5?ASIN=B09CMRX8C6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars A story for book lovers!",
                "reviewText": "It’s amazing to me how the generation of people who lived during WW2 collaborated to overcome the horrors inflicted on so many. The 2 main characters live in different worlds yet through words come together. What a wonderful story of perseverance, love, resistance, friendship and patriotism. Excellent story!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "texwill7",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFM4XTQW5XOP77KRU3KIDCHIVVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ATV1577WL5JC?ASIN=B09CMRX8C6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars outstanding well researched, heartfelt saga of World War III in France and Portugal",
                "reviewText": "I was on the edge of my seat all the time, never knowing what was gonna happen, which is the usual thing with Madeline Martin books. It was like living there during that time. Thank you!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DONNA SMITH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 14, 2024",
                "reviewTitle": "Excellent book",
                "reviewText": "Nothing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jools",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 15, 2023",
                "reviewTitle": "An edifying and riveting read!",
                "reviewText": "“From the New York Times bestselling author of The Last Bookshop in London comes a moving new novel inspired by the true history of America’s library spies of World War II.”This was a very edifying read for me as it portrays yet another side of the war (WW2) which I knew little about…ie: the real roles and sacrifices made by these librarians and printers, and how huge a part coded messages had to play.Ava’s job as a senior librarian at the Library of Congress is everything she ever dreamed of. She loves her role amongst the old tomes passionately, their words are music to her senses.But when she is offered a secret position in Lisbon by the US military posing as a librarian whilst secretly gathering intelligence to be used in coded messages, she feels duty bound to go and do her bit for the war effort.At the same time Elaine (or Hélène) has begun an apprenticeship at a printing press in a warehouse in occupied France which is secretly run by members of the Resistance.The job is very dangerous as the Nazis hold a very prominent presence in Lyon and are especially committed to finding and destroying the printing press which they know is being worked by members of the Resistance to inform the allies of their movements through coded messages….their commitments knows no limits!Both of these women (among several others and many men) played vital roles and paid high prices in this particular war effort.Both women made sacrifices and suffered greatly in their own differing ways.This was a gripping story of extremes in love, loss, grief and unfathomable hardship and suffering.It is an important story which deserves telling.I took my time reading this one because there are several parts to this story and I wanted to absorb each one fully, it did make a difference when it all started to merge into the bigger picture which all came together very well.I’m so glad that these true stories are being researched and written about now, and I take my hat off to this author and to others who are doing this work.It will surely better educate people about the horrors and atrocities that were inflicted upon so many innocent and unassuming people during WW2, as well as service men and women…Lest We Forget.5⭐️s",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juni",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 10, 2022",
                "reviewTitle": "I am only about 2/3 through this book",
                "reviewText": "I am not crazy about the way each chapter goes back and forth to Ava in Portugal and Elaine in France. Other than that the storyline is good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isabella23",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 21, 2022",
                "reviewTitle": "I don’t HATE it .. but",
                "reviewText": "It was £10 on Amazon for the paperback (yet) and I’m not sure it’s worth it. I just don’t get why writers feel they have to use long, rarely used words when a simpler word would do - it’s not enjoyable and sometimes it’s plain boring. I think she’s trying too hard.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 30, 2022",
                "reviewTitle": "A very interesting novel based on real facts taking place during World War II in Portugal.",
                "reviewText": "I loved reading this book and could not put it down. I have read plenty of books on World War II but this one is written on a very different aspect It is a page turner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}