{
    "remaining_requests": 921,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Horse-Novel-Geraldine-Brooks/dp/0399562974",
    "body": {
        "name": "Horse: A Novel",
        "price": "$14.24",
        "originalPrice": "",
        "rawPrice": 14.24,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Horse-Novel-Geraldine-Brooks/dp/0399562974",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/815WEuzDn5L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Geraldine Brooks",
            "link": "https://www.amazon.com/Geraldine-Brooks/e/B000APM13Y/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 36677,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for Horse:“Brooks’ chronological and cross-disciplinary leaps are thrilling . . . [Horse] is really a book about the power and pain of words . . . Lexington is ennobled by art and science, and roars back from obscurity to achieve the high status of metaphor.”—The New York Times Book Review “[A] sweeping tale . . . fluid, masterful storytelling . . . [Brooks] writes about our present in such a way that the tangled roots of history, just beneath the story, are both subtle and undeniable . . . Horse is a reminder of the simple, primal power an author can summon by creating characters readers care about and telling a story about them—the same power that so terrifies the people so desperately trying to get Toni Morrison banned from their children’s reading lists.” —Maggie Shipstead, The Washington Post“In her thrilling new novel Horse, Geraldine Brooks moves back and forth between the 19th century and the near present with the same practiced ease she displayed in her 2008 epic People of the Book . . . Brooks [has an] almost clairvoyant ability to conjure up the textures of the past and of each character’s inner life . . . Her felicitous, economical style and flawless pacing carries us briskly yet unhurriedly along. And the novel’s alternating narratives, by suspending time, also intensify suspense.”—Wall Street Journal “Every character is carefully and believably explored, including Lexington, the horse, an excellent racehorse and one of the best sires, ever, whose closest relationship is with his enslaved caretaker and exercise rider, whose insights into Lexington are spectacular. There is plenty of drama, given the era (1850s), but Brooks handles it perfectly. She also reveals a lot about racing art and biological science. Best horse book I’ve ever read, including all of my own.” —Jane Smiley, The New York Times Book Review“[A] deft novel . . . create[s] a picture of the artistic, athletic, and scientific passions that horses can inspire in humans.”—The New Yorker “Horse isn’t just an animal story—it’s a moving narrative about race and art.”—TIME“[Horse is] set in contemporary times as well as the antebellum era and during the Civil War, but every story line is so pertinent to the issues of the day.” —Beth Macy, bestselling author of Raising Lazarus, in The New York Times“A thrilling story about humanity in all its ugliness and beauty . . . while the historic detail in the book is impressive, it’s the fictions filling in the blanks where Brooks’ genius truly shines . . . The care with which Brooks crafts each character’s voice is a plea to look past the categorical labels and legends with which we describe each other, to truly see the individual. Paired with a compelling plot, the evocative voices create a story so powerful, reading it feels like watching a neck-and-neck horse race, galloping to its conclusion—you just can’t look away.” —Oprah Daily “A confident novel of racing and race . . . with tender precision, Horse shows us history in flux . . . the book returns the Australian-American novelist to the terrain that won her a Pulitzer Prize with March, her 2005 tale of the war-absent father from Little Women. She brings the same archival confidence and sensory flair to the antebellum racetrack.”—The Guardian “This is historical fiction at its finest, connecting threads of the past with the present to illuminate that essentially human something . . . Calling all horse girls: This is the story of the most important racehorse you've never heard of, but it's also so much more than that.”—Good Housekeeping “A testament to the intelligence and humanity of animals, a stinging rebuke of racist and abusive humans, and a study of how the past gets recorded, remembered, and remade . . . anyone who ever grew up loving horses, anyone who dearly loves an animal, will find a cornucopia of riches in this novel.”—Boston Globe“This heart-pounding novel about a famous antebellum champion thoroughbred named Lexington and his talented, enslaved trainer circles two tracks, one historical, one contemporary, to highlight the ongoing scourge of racism in America.”—Christian Science Monitor“Brooks is an accomplished writer . . . [She] has a talent and passion for research that is fully expressed here—she writes beautifully about the anatomy of horses and the delicate work of ‘articulating’ their skeletons, arranging every bone in its proper place. The descriptions of 19th-century horse racing, when the animals were bred differently and raced much longer tracks, are thrilling.” —The Atlantic “Horse mingles the past with the present, and history melds with well-informed invention . . . Brooks crafts an exceptionally sensitive portrayal of an enslaved groom and his special bond with Lexington.”—Smithsonian Magazine “Horse glows . . . engrossing, masterful . . . Brooks makes each setting come alive . . . [N]ot the least of the lessons of Horse is an understanding of the redemptive power of art.”—St. Louis Post-Dispatch“[F]ew authors can claim the range of Geraldine Brooks . . . What truly sets her work apart from many others, however, is the rigorous and extensive nature of her research [...] which shines through on every page. Readers will not only enjoy Brooks’s well-told tales but will also likely learn something new along the way . . . The end result is a deliciously dense, character-rich exploration of the world of horse racing that still manages to make some stinging observations about the modern-day state of race in America.”—Paste“[Y]ou won’t be able to contain yourself while reading this elegant story about three generations of people inspired by the story of America’s greatest racehorse . . . This is a novel about love, anger, passion, and justice—unbridled and bursting.”—LitHub “Brooks is such a sharp pleasure to read . . . her research is meticulous, but she wears it lightly. And she writes supple, vigorous prose . . . she sees a universal condition that transcends the boundary lines of time and place . . . in short, she operates one of the best time machines around.”—Garden & Gun“With exceptional characterizations, Pulitzer Prize–winner Brooks tells an emotionally impactful tale . . . [The] settings are pitch-perfect, and the story brings to life the important roles filled by Black horsemen in America’s past. Brooks also showcases the magnificent beauty and competitive spirit of Lexington himself.” —Booklist (starred review)“Brooks probes our understanding of history to reveal the power structures that create both the facts and the fiction . . . [She] has penned a clever and richly detailed novel about how we commodify, commemorate, and quantify winning in the United States, all through the lens of horse racing.”—Library Journal (starred review)“[A] marvelous novel. Brooks structures the book like a mystery . . . Through Jarret's story, the author reveals the unique and indispensable role Black trainers and jockeys played in the pre-Civil War South . . . Equestrian or no, readers will appreciate Brooks's invitation to linger awhile among beautiful and graceful horses, to see the devotion they engendered in her characters.”—Shelf Awareness“A fascinating saga based on the true story of a famous 19th-century racehorse . . . Brooks’s multiple narratives and strong character development captivate, and she soars with the story of Jarret.”—Publishers Weekly“[Brooks] demonstrates imaginative empathy [...] and provides some sardonic correctives to White cluelessness . . . Brooks skillfully [...] demonstrate[s] how the poison of racism lingers. Contemporary parallels are unmistakable . . . Strong storytelling in service of a stinging moral message.” —Kirkus Reviews (starred review) “[A] sweeping exploration of racial injustice.” —Electric LiteraturePraise for Geraldine Brooks: “Brooks is a master at bringing the past alive . . . in [her]skillful hands the issues of the past echo our own deepest concerns: love and loss, drama and tragedy, chaos and brutality.”—Alice Hoffman, The Washington Post“[Brooks] makes a masterly case for the generative power of retelling . . . [her] real accomplishment is that she also enables readers to feel the spirit of the place.”—The New York Times“There’s something bordering on the supernatural about Geraldine Brooks. She seems able to transport herself back to earlier time periods, to time travel. Sometimes, reading her work, she draws you so thoroughly into another era that you swear she’s actually lived in it. With sensory acuity and a deep and complex understanding of emotional states, she conjures up the way we lived then . . . enrapturing.”—The Boston Globe About the Author Geraldine Brooks is the author of the Pulitzer Prize-winning novel March and the international bestsellers The Secret Chord, Caleb’s Crossing, People of the Book, and Year of Wonders. She has also written the acclaimed nonfiction works Nine Parts of Desire and Foreign Correspondence. Born and raised in Australia, Brooks lives in Massachusetts. Excerpt. © Reprinted by permission. All rights reserved. THEO Georgetown, Washington, DC 2019 The deceptively reductive forms of the artist's work belie the density of meaning forged by a bifurcated existence. These glyphs and ideograms signal to us from the crossroads: freedom and slavery, White and Black, rural and urban. No. Nup. That wouldn't do. It reeked of PhD. This was meant to be read by normal people. Theo pressed the delete key and watched the letters march backward to oblivion. All that was left was the blinking cursor, tapping like an impatient finger. He sighed and looked away from its importuning. Through the window above his desk, he noticed that the elderly woman who lived in the shabby row house directly across the street was dragging a bench press to the curb. As the metal legs screeched across the pavement, Clancy raised a startled head and jumped up, putting his front paws on the desk beside Theo's laptop. His immense ears, like radar dishes, twitched toward the noise. Together, Theo and the dog watched as she shoved the bench into the teetering ziggurat she'd assembled. Propped against it, a hand-lettered sign: FREE STUFF. Theo wondered why she hadn't had a yard sale. Someone would've paid for that bench press. Or even the faux-Moroccan footstool. When she brought out an armful of men's clothing, it occurred to Theo that all the items in the pile must be her dead husband's things. Perhaps she just wanted to purge the house of every trace of him. Theo could only speculate, since he didn't really know her. She was the kind of thin-lipped, monosyllabic neighbor who didn't invite pleasantries, much less intimacies. And her husband had made clear, through his body language, what he thought about having a Black man living nearby. When Theo moved into Georgetown University's graduate housing complex a few months earlier, he'd made a point of greeting the neighbors. Most responded with a friendly smile. But the guy across the street hadn't even made eye contact. The only time Theo had heard his voice was when it was raised, yelling at his wife. It was a week since the ambulance had come in the night. Like most city dwellers, Theo could sleep right through a siren that Dopplered away, but this one had hiccuped to sudden silence. Theo jolted awake to spinning lights bathing his walls in a wash of blue and red. He jumped out of bed, ready to help if he could. But in the end, he and Clancy just stood and watched as the EMTs brought out the body bag, turned the lights off, and drove silently away. At his grandmother's house in Lagos, any death in the neighborhood caused a flurry in the kitchen. As a kid visiting on school holidays, he'd often been tasked with delivering the steaming platters of food to the bereaved. So he made a stew the next day, wrote a condolence card, and carried it across the street. When no one answered the door, he left it on the stoop. An hour later, he found it back on his own doorstep with a terse note: Thanks but I don't like chicken. Theo looked down at Clancy and shrugged. \"I thought everyone liked chicken.\" They ate it themselves. It was delicious, infused with the complex flavors of grilled peppers and his homemade, slow-simmered stock. Not that Clancy, the kelpie, cared about that. In the no-nonsense insouciance of his hardy breed, he'd eat anything. The thought of that casserole made Theo's mouth water. He glanced at the clock in the corner of his laptop. Four p.m. Too early to quit. As he started typing, Clancy circled under the desk and flopped back down across his instep. These arresting compelling images are the only known surviving works created by an artist born into slavery enslaved. Vernacular, yet eloquent, they become semaphores from a world convulsed. Living Surviving through the Civil War, forsaking escaping the tyranny of the plantation for a marginalized life in the city, the artist seems compelled to bear witness to his own reality, paradoxically exigent yet rich. Awful. It still read like a college paper, not a magazine article. He flipped through the images on his desk. The artist confidently depicted what he knew-the crowded, vibrant world of nineteenth-century Black domestic life. He had to keep the text as simple and direct as the images. Bill Traylor, born enslaved, has left us the only A movement across the street drew his eye up from the screen. The neighbor was trying to move an overstuffed recliner. It was teetering on its side on the top step as she struggled to keep a grip on it. She could use help. He did a quick personal inventory: Shorts on, check. T-shirt, check. Working in his un-air-conditioned apartment, Theo would sometimes spend the whole day in his underwear, forgetting all about his dŽshabillement until confronted by the quizzical gaze of the FedEx guy. He reached the other side of the street just as gravity won, prising the chair from her grip. He jumped up the step and body-blocked it. Her only acknowledgment was a grunt and a quick lift of her chin. She bent down and grabbed the underside of the chair. Theo hefted an armrest. Together, crabwise, they shuffled to the curb. The woman straightened, pushing back her thin, straw-colored hair, and rubbing her fists into the small of her back. She waved an arm at the ziggurat. \"Anything you want . . .\" Then she turned and ascended the steps. Theo couldn't imagine wanting anything in this sadness-infused pile of discards. His apartment was sparsely furnished: a midcentury-modern desk and a Nelson sofa acquired at a thrift store. The rest of the available space was filled mostly with art books, shelved on scavenged planks and milk crates he'd spray-painted matte black. But Theo, the son of two diplomats, had been raised by the commandment that bad manners were a mortal sin. He had to at least pretend to look. There were some old paperbacks stuffed into a beer carton. He was always curious about what people read. He reached down to check the titles. And that was when he saw the horse. JESS Smithsonian Museum Support Center, Maryland 2019 Jess was seven when she dug up the dog. He'd been dead a year. She and her mum had buried him with ceremony, under the flowering red gum in the backyard, and they'd both cried. Her mother wanted to cry again when Jess requested large Tupperware containers for the bones she'd just exhumed. Generally, Jess's mother was the kind of parent who would let her daughter set the house on fire if she thought it could teach something about carbon and oxygen. But she was stricken with a stab of anxiety: was digging up a beloved pet and macerating its corpse a sign that your child had psychopathic tendencies? Jess tried her best to explain that she'd dug up Milo because she loved him, and that's why she had to see what his skeleton looked like. Beautiful, as she knew it would be: the swoop of the rib cage, the scoop of the eye sockets. Jess loved the interior architecture of living things. Ribs, the protective embrace of them, how they hold delicate organisms in a lifelong hug. Eye sockets: no artisan had ever made a more elegant container for a precious thing. Milo's eyes had been the color of smoky quartz. When Jess touched a finger to the declivities on either side of his delicate skull, she could see those eyes again: the kind gaze of her earliest friend, avid for the next game. She grew up on one of the dense streets of liver-brick bungalows that marched westward with Sydney's first growth spurt in the 1900s. Had she lived in a rural place, she might have exercised her fascination on road-killed kangaroos, wombats, or wallabies. But in inner Sydney, she was lucky to find a dead mouse, or perhaps a bird that flew into a plate-glass window. Her best specimen was a fruit bat that had been electrocuted. She found it on the nature strip under the power lines. She spent a week articulating it: the papery membrane of the wing, unfolding like the pleated bellows of an accordion. The metatarsal bones, like human fingers, but lighter-evolved not to hold and grasp, but to fan the air. When she was done, she suspended it from the light fixture in her bedroom ceiling. There, stripped clean of all that could readily decay, she watched it fly forever through endless nights. Over time, her bedroom became a mini natural history museum, filled with skeletons of lizards, mice, birds, displayed on plinths fashioned from salvaged wire spools or cotton reels, and identified with carefully inked Latin tags. This did not endear her to the tribe of teenage girls who inhabited her high school. Most of her classmates found her obsession with necrotic matter gross and creepy. She became a solitary teen, which perhaps accounted for her high place in the state in three subjects when the final public exam results were published. She continued to distinguish herself as an undergrad and came to Washington on a scholarship to do her master's in zoology. It was the kind of thing Australians liked to do: a year or two abroad to take a look at the rest of the world. In her first semester, the Smithsonian hired her as an intern. When they learned she knew how to scrape bones, she was sent to do osteo prep at the Museum of Natural History. It turned out that she had become extremely skilled from working on small species. A blue whale skeleton might impress the public, but Jess and her colleagues knew that a blue wren was far more challenging to articulate. She loved the term \"articulate\" because it was so apt: a really good mount allowed a species to tell its own story, to say what it was like when it breathed and ran, dived or soared. Sometimes, she wished she'd lived in the Victorian era, when craftsmen competed to be the best at capturing movement-a horse rearing required an absolute balance in the armature, a donkey turned to scratch its flank demanded a sculptor's sense of curvature. Making these mounts had become a craze among wealthy men of the time, who strove to produce specimens dedicated to beauty and artistry. Contemporary museums had scant place for that. Mounting bones destroyed information-adding metal, removing tissue-so very few skeletons were articulated. Most bones were prepped, numbered, and then stored away in drawers for comparative measurement or DNA sampling. When Jess did that work, her nostalgia for the craftsmanship of the past faded, overtaken by her fascination with the science. Every fragment told a story. It was her job to decode them and help scientists extract the testimony from each fossilized chip. The specimens might have come to the museum as the product of dumb luck or the result of days of exacting scientific endeavor. A hobbyist might have stumbled upon a mammoth's tibia uncovered by the lashings of a winter storm. Or a paleontologist might have collected a tiny vole's tooth after weeks of painstaking soil sifting. Jess made her labels on a laser printer and included GPS coordinates for where the specimen had been found. Past curators left a more personal mark, their handwritten cards in sepia-toned ink. Those nineteenth-century preparators had plied their craft ignorant of DNA and all the vital data it would one day yield. It thrilled Jess to think that when she closed the drawer on a newly filed specimen, it might be opened in fifty or a hundred years by a scientist seeking answers to questions she didn't yet know how to ask, using tools of analysis she couldn't even yet imagine. She hadn't meant to stay in America. But careers can be as accidental as car wrecks. Just as she graduated, the Smithsonian offered her a four-month contract to go to French Guiana to collect rainforest specimens. Not many girls from Burwood Road in western Sydney got to go to French Guiana and bounce through the rainforest with scorpion specimens pegged across the jeep like so much drying laundry. Another offer followed: Kenya, to compare contemporary species on Mount Kilimanjaro with those gathered by Teddy Roosevelt's expedition a hundred years earlier. At the end of that trip, Jess was packing her few possessions, ready to go home to get on with what she still considered her real life, when the Smithsonian offered her a permanent position, managing their vertebrate Osteology Prep Lab at the Museum Support Center in Maryland. It was a brand-new facility and the job vacancy was unexpected. The manager who had designed the lab had been struck down by a sudden allergy to frass, the soft, dusty excrement of dermestid beetles. Those beetles were the preferred and best means of bone cleaning, so being unable to work with them without breaking into hives signaled the need for a change of occupation. The Smithsonian's nickname was \"the Attic of America.\" Support was the attic's attic: a sprawling twelve miles of storage that housed priceless scientific and artistic collections. Jess had thought she wouldn't want to work out in the suburbs, far from the public face of the museum. But when she walked down the vast connecting corridor known as \"the street,\" linking the zigzag of metal-sheathed, climate-controlled buildings in which all kinds of science took place, she knew she'd arrived at the epicenter of her profession. After her interview she and the director walked across a verdant campus flanked by the botany department's greenhouses. He pointed out a newly built storage pod, looming windowless above the greenhouses. \"We just opened that one, to house the wet collection,\" he said. \"After 9/11, we realized it wasn't prudent to have twenty-five million biological specimens in combustible fluids crammed in a basement a couple of blocks from the Capitol. So now they're here.\" The Osteo Prep Lab was farther on, in a building of its own, tucked off at the edge of the campus nearest the highway. \"If you get, say, an elephant carcass from the National Zoo, it's pungent,\" the director explained, \"so we sited your lab as far from everyone else as possible.\" Your lab. Jess hadn't thought of herself as ambitious, but she realized she badly wanted this responsibility. Inside, the lab gleamed: a necropsy suite with a hydraulic table, a two-ton hoist, double bay doors large enough to admit a whale carcass, and a wall of saws and knives worthy of a horror movie. It was the largest facility of its kind in the world, and a far cry from her makeshift lab in the laundry room on Burwood Road. She loved working there. Every day brought something new in a flow of specimens that never stopped. The latest arrival: a collection of passerines from Kandahar. The birds had been roughed out in the field, most of the feathers and flesh removed. Jess's assistant, Maisy, was bent over the box of little bundles, carefully tied so none of the tiny bones would be lost. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 56 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“Brooks’ chronological and cross-disciplinary leaps are thrilling.” —The New York Times Book Review “Horse isn’t just an animal story—it’s a moving narrative about race and art.” —TIME“A thrilling story about humanity in all its ugliness and beauty . . . the evocative voices create a story so powerful, reading it feels like watching a neck-and-neck horse race, galloping to its conclusion—you just can’t look away.” —Oprah DailyWinner of the Anisfield-Wolf Book Award, the Dayton Literary Peace Prize, and the Dr. Tony Ryan Book Award · Finalist for the Chautauqua Prize · A Massachusetts Book Award Honor Book A discarded painting in a junk pile, a skeleton in an attic, and the greatest racehorse in American history: from these strands, a Pulitzer Prize winner braids a sweeping story of spirit, obsession, and injustice across American historyKentucky, 1850. An enslaved groom named Jarret and a bay foal forge a bond of understanding that will carry the horse to record-setting victories across the South. When the nation erupts in civil war, an itinerant young artist who has made his name on paintings of the racehorse takes up arms for the Union. On a perilous night, he reunites with the stallion and his groom, very far from the glamor of any racetrack. New York City, 1954. Martha Jackson, a gallery owner celebrated for taking risks on edgy contemporary painters, becomes obsessed with a nineteenth-century equestrian oil painting of mysterious provenance. Washington, DC, 2019. Jess, a Smithsonian scientist from Australia, and Theo, a Nigerian-American art historian, find themselves unexpectedly connected through their shared interest in the horse—one studying the stallion’s bones for clues to his power and endurance, the other uncovering the lost history of the unsung Black horsemen who were critical to his racing success. Based on the remarkable true story of the record-breaking thoroughbred Lexington, Horse is a novel of art and science, love and obsession, and our unfinished reckoning with racism.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Books (January 16, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 464 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0399562974"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0399562976"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.05 x 0.93 x 7.74 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#421 in Books (See Top 100 in Books) #2 in Animal Fiction (Books) #91 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 36,677 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca1c4f98-c442-4d79-9ebf-2739f7062483.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7bbda7c5-1d40-4863-9825-a52538d9ca9c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4a47d6f-1083-4a11-a684-f8347fda456b.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marianne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2ATWVCVBT2PNZNGMYI2PUHQKBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RJMLV48JAGS6?ASIN=0399562974",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Brilliant!",
                "reviewText": "A fictional portrayal of an extraordinary championship horse whose life began in the antebellum South (1850) and ended during the Reconstruction era (1875). It is a brilliant work with poignant moments enhanced by a cast of historical characters reimagined by the author. But the most affecting are the fictional ones such as the Black groom, Jarret, who symbolizes the abusive treatment endured by the enslaved. Spiritually bound to Darley, later known as Kentucky, he was fully involved in his care from birth to death. It was not unusual for slaves to groom, train and serve as jockeys, some even earning enough to buy their manumission. After the Civil War they were pushed out of the lucrative jockey trade by White jockeys who wanted the action for themselves. Jarret with his skills as groom and trainer was able to buy his freedom and finally chose to live in Canada where he was able to vote.The present day characters, Jess and Theo, with their deepening relationship unify all the related themes of “Horse“ giving structure to the multilayered plot. Jess, a specialist in human and animal anatomy, is preparing Kentucky’s skeleton retrieved from the Smithsonian’s “”attic” so it can be viewed in a museum setting. Theo, an Oxford educated writer with a Nigerian mother and White father, straddles two cultures - not altogether comfortable in either. A painting of a horse and his groom discarded by his neighbor led him to the eventual discovery that it was a painting of Kentucky by a famous artist during the mid-nineteenth century.The ending is not an easy one. We are left to contemplate Theo and his vulnerability in a risky situation, one he was ill- prepared for. It is also difficult to visualize Kentucky in his present form as a skeleton - I would rather think of him as that special living horse who sired many champions like himself.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUGRMNST7S7BZM3LEBNNNEJVO7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUZNJWFVSAO47?ASIN=0399562974",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars So many story lines",
                "reviewText": "This novel fools us into thinking it is about a horse. It is about so much more. In tracing the life and times of the thoroughbred champion Lexington, we are left to reflect on the role of slavery in the economic and social development of the United States, the fallacy that the most armed citizenry in the world makes Americans safer, the lingering racism behind a culture of police brutality leading to the murder of innocent people, the world of thoroughbred horse racing with its pageantry and color as well as its dark underbelly that uses and abuses both man and horse.Two thumbs up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4XHK7AZDNLOISPIAFIPZ5I4ISA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IBGZKKGS7UEY?ASIN=0399562974",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "4.0 out of 5 stars compelling read on horses and racism",
                "reviewText": "Brooks shares a beautiful story of the love between a boy who is a slave and his horse growing up in Kentucky! The readers learns a great deal about race horsing before the Civil War in the South and how slaves contributed to the success of this business for their owners. The two parallel intertwined stories connecting the past from the present was well done with how racism in American Culture continues to be a dominant theme.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anthony Conty",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3H3Y3UJAO5C4R5DBDJYGZVUI7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NBDEI7885ZA1?ASIN=0399562974",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Sweeping yet Contemporary",
                "reviewText": "\"Horse\" by Geraldine Brooks goes back and forth from 1850 to modern-day D.C. when art historians discover paintings of a beautiful horse with a rich history in the racing arena. The enslaved and the wealthy receive the same reverence and advanced vocabulary. The part of the story in 2019 shows us how art historians try to interpret the backstory of a horse specialist's work, and the reader receives the actual tale. The pace is deliberate and will turn off certain audience members, but hang in there. There is much to learn.The book has layers so that it can reach a variety of readers. Jarrett, an enslaved person who grooms the famous horse, shows how hard it is to write about the enslaved in a politically correct manner. Writing their lives as too pessimistic and too optimistic will tick off opinionated jerks. In terms of author challenges, writing about sports is even more complicated. If the athlete triumphs, it is predictable. If they lose, it is depressing. Jarrett's horse, Darley, shows how Jarret's plight as a free Black man changed drastically when the white men figured out his skill and temperament with the equine beings in the area.\"Slow Burn\" can eliminate several potential readers, but the experienced may care about characters before they even decide to like the book. Jarrett will win you over with his class and grace. The rules that define his existence come off as cruel but primarily arbitrary. In a world where people would stop at nothing to get the most out of their athletes, it seems odd that the tenets connected to slavery kept a master like Jarrett from working his magic with his horse, Lexington. Pride is a dangerous thing.You reach the novel's halfway point and realize that much more must happen. Jarrett's role as groom shows that a lot goes into a racehorse's success. In a world where we question the conditions in which competitive horses grow, we have Jarrett to remind us of the pure wishes of some in the trade. Having seen the celebration groups at the Kentucky Derby, you seldom see them struggling with last-minute preparations. The owner, the groom, and the jockey sweat the small stuff even when victory appears imminent.\"Horse\" has so many parts that it could be several novels. A novel with enslaved people that only reaches the Civil War in its last quarter allows for much character development. Brooks has skills, however. You are immersed in the world that she created enough to follow along. In the end, I was amazed by how well everything came together. The art historian receives a critique that he only studied works that showed the enslaved in a positive light without showing the horrors. Brooks managed to do both well. Just be prepared to have two different opinions about two emotionally unique storylines.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melodie Bennett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW5XWZJ6OGH54C7MI2L4QLS7JCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32JZLC9ENK9MF?ASIN=0399562974",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Horse",
                "reviewText": "This book is a stunner! Meticulously researched with well developed characters, the author has interwoven history with recent events seamlessly. I found myself thoroughly immersed in the story and yet again a student of American history. Just when I think I know quite a bit of history, an author like Geraldine Brooks takes me back to school. And I go joyfully.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy D. Solomon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWCHUHZ727SKGNAWLJJ23MZOREA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AVB2JH27KK3S?ASIN=0399562974",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Marvelous book. Marvelous writer.",
                "reviewText": "This is one of the best books I have ever read. Ms. Brooks is brilliant. I'm surprised I hadn't discovered her before. If you like good writing, read this book. If you are interested in historical fiction, the period around the Civil War and have any interest in horses, museum conservation, journalism, racism, or just plain life, read this book. It's remarkable and you will love it. My entire book group - a bunch of well-read, intelligent women - loved it. You also don't have to be a woman to love this book. Do yourself a favor: read this book.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tony",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL2GBJLLUYOOOKKLEUYNGD634UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5SL5YKH83GWO?ASIN=0399562974",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Horse",
                "reviewText": "Another hit by Geraldine Brooks. Well researched and well written. A most interesting blend of topics and settings. Horse racing, art, racism, Civil War history. Brooks successfully pulls them all together",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marsha Zinberg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 12, 2024",
                "reviewTitle": "Meticulous research and a gripping story",
                "reviewText": "Brooks is a first-rate storyteller",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin Hayden",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 12, 2023",
                "reviewTitle": "Brilliant read",
                "reviewText": "It took me some pages to get into it but then it was WOW. I really enjoyed the storyline and history of this book. We can see that it was based on real characters and a true story but the twists and turns kept me hooked.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana Blake",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 9, 2023",
                "reviewTitle": "…it’s not just about the horse!",
                "reviewText": "Brooks sets out to make a point and does so very eloquently.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stuart Dewey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 18, 2023",
                "reviewTitle": "A wonderful tale wound about some nasty history",
                "reviewText": "I could not put this book down. I realised as I read just how little I knew about the American civil war to say nothing of horse breeding and racing. Truly one of the very best books I have read. Congratulations Geraldine, a masterpiece!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 19, 2022",
                "reviewTitle": "For lovers of history, horses, and hope",
                "reviewText": "A gripping narrative of race and horselore in America from civil wartime enslavement to contemporary police targeting of young black men, told from the perspective of its protagonists who are not always given a voice. The harsh reality of the lucre that drives horse racing runs parallel to the story of an incredible relationship between a champion thoroughbred and his gifted young black trainer. The contemporary scene lays bare the painful awareness a young woman gains of her own fears and prejudices which are the result of systemic racism in America. Despite the tragedies, this novel is also a beacon of hope, for the possibility of love and of positive societal change. A final observation: the technical detail honed for describing the world of horses, and the study of art and anatomy is truly impressive.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}