{
    "remaining_requests": 849,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Captive-Bride-Johanna-Lindsey-ebook/dp/B00512LSIK",
    "body": {
        "name": "Captive Bride",
        "price": "$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Captive-Bride-Johanna-Lindsey-ebook/dp/B00512LSIK",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/510PBBrhlyL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Johanna Lindsey",
            "link": "https://www.amazon.com/Johanna-Lindsey/e/B000AQ2U98/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 713,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The irresistible call of adventure brings lovely Christina Wakefield to the alluring Arabian desert. But fate imprisons her after she encounters Sheik Abu, the strikingly handsome though arrogant adventurer, whom she had known in England as Philip Caxton.Once Christina had rejected Philip's fervent offer of marriage. But now she is to be his slave -- desperate for the freedoms denied her...yet weakened by her heart's blazing desire to willingly explore her virile captor's most sensuous cravings. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00512LSIK"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ HarperCollins e-books (June 7, 2011)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 7, 2011"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1037 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 388 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#327,086 in Kindle Store (See Top 100 in Kindle Store) #660 in Historical Erotica (Kindle Store) #1,514 in Historical British & Irish Literature #1,579 in Enemies to Lovers Romance eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 713 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SLK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGATLU6HRQZSCLHGGOQMOZ3EXKOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQD55E7YMP2QD?ASIN=B00512LSIK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2013",
                "reviewTitle": "5.0 out of 5 stars Classic Lindsey - Bodice Ripper for Sure!",
                "reviewText": "Phillip is the classic Lindsey hero and I adore him! That being said, this is my personal opinion and the ladies that do not enjoy a rough hero and a pretty much non-consensual relationship with semi-forced sex and spanking may want to steer clear of this book. I have read many of the reviews here and I'm uncertain as to why 'usual' Johanna Lindsey readers are all up in arms over Captive Bride. If you don't enjoy the sense of being transported to the time and place and how women were mostly likely really treated back in that time then please, refrain from buying her books because I promise you there are many more like this. If you don't enjoy bodice rippers I 100% understand that and respect your choices, you in turn should respect the women that enjoy them for what they are - a sexual fantasy. This is most certainly a non-consent relationship book and I'm sure the run-of-the-mill woman reading this novel isn't thinking, \"gee I wish I could get kidnapped, beaten and then raped and orgasm against my will in real life!\" Let's have a little sense of reality here. We're here, we're reading a book. I don't go onto horror book pages and vote down people that enjoy horrors just because I find it disgusting (and extremely disturbing) someone could enjoy that.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUD2GQQHRN46A2LKYGJ7IDY6BGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMOMHK7SA4HD7?ASIN=B00512LSIK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 2, 2014",
                "reviewTitle": "5.0 out of 5 stars Captive Bride",
                "reviewText": "This book is a love story and it was a book I bought 30 years ago I guess. Anyway, it had come apart from being read so much and being old. I checked and it was available on my kindle so I got it. I don't have to worry about it coming apart there. It is about a girl who is beyond beautiful and knows it. She is smart and particular about her company but that doesn't stop the man who wants her and takes her. It is about her struggle and acceptance and love. A very enjoyable book that I think you would find enjoyable too. Johanna Lindsey is a great writer and definitely a romantic writer.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQLEURWITWJ6MIKO4VEHDKQTUVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14M333VG3FO24?ASIN=B00512LSIK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2012",
                "reviewTitle": "4.0 out of 5 stars Well worth the time and money",
                "reviewText": "I've been a fan of Johanna Lindsey and her early novels specifically for a while now. \"Captive Bride\", \"Fires of Winter\", \"A Pirates Love\", and \"Paradise Wild\" are rare finds in today's selection of romance novels where all you can find is fluff with no substance to hold your attention. This is not to say that \"Captive Bride\" doesn't have its flaws because it does and the multitude of negative reviews are not completely untrue. To anyone considering purchasing this book understand a few points before you judge it too quickly or harshly. To start off, this was Lindsey's first book published back in 1977. During that generation it was much more acceptable to write a \"bodice ripper\". If you look at other books written during this time period you will see similar character types and more historically correct actions and beliefs. Books written in this time period often featured the dominant male personality and the more submissive female. Why? Simple, because this is how people acted in past eras. Captive Bride takes place in the 1800s, in Cairo, Egypt primarily. The hero Phillip has lived for years with the Arabs and has taken to acting like they do, immersed in their culture. So to think that Christina will never be beaten for showing disrespect is an absurd notion. Additionally his restraint in not simply raping her is uncommon for this time and shows the goodness in his character. I'm sorry this this offends you, but if it does try reading books published more from this decade, which are politically correct in place of being historically accurate. Now to why I gave it four stars. As I previously stated this was Lindsey's first book, and it does show. This is not to say that it was not an enjoyable read, because in the aspects of original plotline, likable character, and historical accuracy it hits the mark and holds your attention throughout the novel. However, there were multiple occasions where I wished the editor would have worked with Lindsey a little more. The character's dialogue at times was dramatic and over the top, and occasionally was contradictory. Additionally the characters would flip between emotions too quickly and leave me feeling unsatisfied with how the ordeal went down. Both main characters would jump to rage only to have that anger quenched less than a page later. It just didn't flow correctly in that sense.Overall this is still an engaging book, and as long as you don't mind the historical accuracy then you are in for a treat. The pace moves quickly and the book holds your attention the entire way through.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ejoke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG2LRDDUMFDJLC7UBJ4KQWVSK4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1867C2M5GTCY4?ASIN=B00512LSIK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2010",
                "reviewTitle": "5.0 out of 5 stars I actually liked it",
                "reviewText": "I beg to differ to some of the comments that have been made about this book, I definitely agree to the fact that some of the characters were a bit to the extreme, with all the abuses Tina went through, Philip should definitely do time, but it is a romantic novel written in the 70s to prove male dominance, which is slowly deteriorating in our society as a result of women liberation and women wanting to act or take the position of men, i hate all JL books where the women were defiant and were bellicose, because sometimes we need the men in charge.I would definitely recommend this book to all my friends who are romance fricks",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shirley L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPYCHNOMGOYD7DDMS2LPV6DKMIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LV0VQEO49UEG?ASIN=B00512LSIK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 20, 2014",
                "reviewTitle": "5.0 out of 5 stars AWESOME, WONDERFUL always INTRIGUING",
                "reviewText": "This woman can write stories that literally enrapture and captivate..Her books are AWESOME!!..been awhile since I read this book but, I am quite sure it was good ,ah yes I just looked it up and remember the love story, I knew why I gave it 5 stars :) Johanna Lindsey, is another of the inspired writers to get involved with her books ..She has so many to mention by name but each one is full of adventure ,Love,and a determined woman who will find her man OR the Man who will get HIS woman :) and his/her piece of Happily ever after..this woman 's books also shout out ...READ, READ, READ..I LOVE her books.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ScotWitch",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 31, 2014",
                "reviewTitle": "Saved my relationship.",
                "reviewText": "This book is amazing.I never knew that Arab sheikhs drank wine from goat skins, nor did I know that the phrase \"rape me against my will, oh please don't rape me against my will\" could be employed so often in the early chapters of a non-consensual erotic romance. Truly, utterly incredible, for the way it has improved my sex life. My lover and I have a drinking/erotic sex game we play using it. He dresses up as the aforementioned Sheikh, and I in harem pants and he commands me to read a page at random. Every time I hit an unnecessary adverb, he get to chose which item of clothing I remove. To spice things up, I have the option of substituting the clothing item for taking a shot of high-test tequila.What literary merits this book might have I do not know, but I must thank Ms Lindsey for saving my relationship. We were headed for the doldrums that no amount of kinky feckery to Christian Grey's Spotify playlist could aid.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philia Libri",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 30, 2010",
                "reviewTitle": "Exotic-dramatic",
                "reviewText": "Christina Wakefield ist 17 Jahre alt und hat einen großen Wunsch: Endlich einmal möchte sie London erleben. Ihr Bruder, der einzige Verwandte, der ihr geblieben ist, kann ihr keinen Wunsch verwehren und so reisen die beiden in die Stadt. Dort bekommt die außergewöhnlich schöne Christina mehr männliche Aufmerksamkeit als ihr lieb ist und auch den einen oder anderen Heiratsantrag.Doch ein Mann fasziniert sie ebenso, wie er sie abschreckt: Philip Caxton, dafür bekannt, nicht gerade höflich mit seinen weiblichen Bewunderinnen umzugehen, weiß auf den ersten Blick, dass Christina die Frau seines Lebens ist. Doch die hat anderes im Sinn, als ein Heiratsangebot anzunehmen, dass Philip am zweiten Tag ihrer Bekanntschaft ausspricht! So einfach lässt sich Philip Caxton allerdings nicht abwimmeln.Noch in der selben Nacht erreicht Christinas Bruder John eine Nachricht der Royal Army, er habe sofort nach Ägypten aufzubrechen. Christina, die es leid ist, wieder ein Jahr von ihrem Bruder getrennt zu sein, besteht darauf, mitzukommen. Kaum einen Tag in Kairo, wird Christina von Fremden aus ihrem Zimmer verschleppt und durch die Wüste zu einem Camp gebracht. Und dort steht niemand anderes als Philip Caxton vor ihr, auch bekannt als Sheik Abu. Erst wehrt sie sich verzweifelt gegen seine Aufmerksamkeiten, doch lange kann sie dem willensstarken und überaus attraktiven Halb-Ägypter nicht widerstehen...Rezeption:Johanna Lindsey ist ja wahrlich keine Unbekannte in der Welt der Historical Romance. In Captive Bride entführt sie den Leser in die exotische Welt Ägyptens und direkt in eine ebenso verführerische wie dramatische Liebesgeschichte.Christina ist jung, wunderschön und äußerst stur. Ihr fällt es schwer, sich damit abzufinden, dass Philip alles mit ihr machen kann, was er will - schließlich ist er Herr dieses Camps und Sklaven sind so alltäglich, dass niemand auch nur im Traum daran denken würde, Christina zu helfen. Die Enge des Zelts, in dem Christina gemeinsam mit Philip lebt, macht es ihr unmöglich, ihm auszuweichen oder gar zu ignorieren. Wider willen kommt Christina Philip näher und entdeckt auch eine zärtliche Seite an ihm. Sie weigert sich allerdings einzugestehen, dass sie für ihren schönen Entführer etwas anderes als Hass empfindet.Am Anfang nimmt man Christina die Rolle nicht ganz ab - sie behauptet zwar immer wieder, Philip zu hassen, dennoch gibt sie sich nach einigem Wehren Philip leidenschaftlich hin. Das hält aber - glücklicherweise - nicht lange an, denn schon bald merkt man, woher Christinas zwiespältige Gefühler rühren. Wie viele Opfer, die enführt und vergewaltigt werden, kann Christina nicht anders, als sich dafür zu schämen, dass sie Leidenschaft empfindet, wenn Philip sie berührt und den Sex mit ihm sehr genießt.Philip, 33 Jahre alt, weiß so gar nicht, was er davon halten soll, dass Christina zwar ständig mit ihm streitet, sich gegen ihn wehrt, aber seine Aufmerksamkeiten mehr als willig annimmt. Vor allem versteht er nicht, weshalb sie nach dem Liebesakt weinen muss - er ist nun mal nicht der einfühlsamste Mann. Gewohnt, sich alles zu nehmen, das er haben will, hat er sich noch nie viele Gedanken darüber gemacht, wie Christina sich dabei fühlen könnte. Allerdings entwickelt er einen äußerst starken Beschützerinstinkt Christina gegenüber und ist alles andere als begeistert, wenn er sie bestrafen muss, weil sie etwas getan hat, dass im Camp als Beleidigung aufgefasst werden muss. Von Heirat möchte er nun nichts mehr wissen - schließlich hatte Christina ihre Chance in England. Er hält sie als seine Mätresse, behandelt sie aber besser, als Frauen es in diesem Land gewohnt sind.Nach einigen Monaten gewöhnt sich Christina an ihr neues Leben, schließt Freundschaft und beginnt sich einzugestehen, dass sie Philip nicht mehr so hasst, wie sie es zu Anfang getan hat. Sie begegnet ihm mit deutlich weniger Angst und freundet sich mit Philips Vater an, der am Sterbebett liegt. Der ist begeistert von der jungen Schönheit und genießt ihre Besuche sehr.Als Christina dann von einem rivalisierenden Stamm gestohlen wird, gibt es für Philip kein Halten: Er eilt ihr zur Rettung hinterher und erkennt, dass er sie nicht nur begehrt, sondern auch liebt. Auch Christina entdeckt ihre wahren Gefühle, doch beide sind zu unsicher, um dem jeweils anderen ihre Liebe zu gestehen.Ohne dramatische Szenen geht es natürlich auch hier nicht. Die Liebenden werden mehr als nur einmal Opfer von Intrige und Verrat und wissen bald nicht mehr, ob die Leidenschaft, die Liebe, die sie geteilt haben, wahr ist. An diesen Stellen möchte man nur gern zu den Charakteren gehen, sie schütteln und ihnen entgegenschreien, dass sie nicht so dumm sein sollen, und endlich ihre Liebe gestehen sollen. Aber was wäre so eine Geschichte ohne Dramatik? Davon gibt es in Capitve Bride jedenfalls mehr als genug. Mich machen diese Stellen ja ganz verrückt, weil ich nicht verstehen, weshalb man die Charaktere, die es bis dahin schon nicht leicht hatten, noch weiter quälen muss. Doch natürlich wäre es nicht so spannend, wenn sie sich einfach verliebten, heirateten und glücklich wären.Da fährt Lindey mit deutlich stärkerem Geschütz auf und macht es beinahe unmöglich, das Buch aus der Hand zu legen. Ich konnte nicht akzeptieren, dass die beiden sich so dumm aufführen und musste unbedingt herausfinden, wie es weiterging - und das bis 3 Uhr morgens. Dann aber habe ich das Buch glücklich zur Seite gelegt und bin lächelnd eingeschlafen.Eine historische Liebesgeschichte die sich sehen lassen kann. Spannend, leidenschaftlich und dramatisch präsentiert sich Capitve Bride dem Leser und wird die verschiedensten Emotionen auslösen...Einen Punkt Abzug gibt es für den etwas holprigen Anfang der Beziehung Philips und Christinas und die etwas zu offensichtlichen Stolpersteine.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ann",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 18, 2013",
                "reviewTitle": "Excellent Read",
                "reviewText": "Wow what a fantastic read the emotions that she goes through from being a spoilt child she grows in to a woman who has found love but not where she expected to find it. this story really makes you feel as it is you in the story. A wonderful story for women to read while hubby or whoever is down the pub with their mates........ Enjoy ladies I know I did several times .................Oooooh loverly",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. Rock",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 12, 2012",
                "reviewTitle": "For her 1st",
                "reviewText": "For Johanna's first book, i'd have to say that this isn't THAT bad and is a lot better than some of the other reviews had me thinking it would be. Obviously as it was her 1st book the sex scenes haven't been prefected and I felt that the most intimate parts moved too fast and jumped around a bit. The chemistry was still there though, as was the romance. I wanted to hit the male lead for being so pigheaded and arrogant during the whole novel but he won me over in the end. I'd also like to note that this is no where near as bad as her books in recent years.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nijole Sileikiene",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 7, 2019",
                "reviewTitle": "Everything in time",
                "reviewText": "Enjpyed while reading",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}