{
    "remaining_requests": 1000,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Name-Ona-Judge-absolutely-historical-ebook/dp/B0B3S55J3J",
    "body": {
        "name": "My Name Is Ona Judge: An absolutely gripping historical novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Name-Ona-Judge-absolutely-historical-ebook/dp/B0B3S55J3J",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71ZaOQn5NrL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Suzette D. Harrison",
            "link": "https://www.amazon.com/Suzette-D-Harrison/e/B001K8I954/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1306,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "New Hampshire, 1796. “My name is Ona Judge, and I escaped from the household of the President of the United States. I was the favored maid of George and Martha Washington, but they deemed me a slave and thought me property, and I hear ten dollars is offered as reward for my capture. Now I must write the truth that I have lived, and tell my story…”Chincoteague, Virginia, present day. Rain soaks Tessa Scott as she runs from her car to the old, vine-covered property she has been called to survey. She’s too busy to accept a new job, but doing this favor for the grandmother of her childhood sweetheart delays a painful decision she must make about a future with her controlling boyfriend.But when Tessa finds a tattered journal carefully hidden inside the house’s ancient fireplace, the tragic story of how Ona was ripped from her mother’s arms to live and work in the palatial Mount Vernon, and the heart-shattering betrayal that led her to risk her life and run, has Tessa spellbound. Could discovering this forgotten scandal at the heart of her nation’s history force her to confront her own story? As she races to reach the final page, will anything prepare her for the desperate moment when Ona’s captors find her again? Will it inspire Tessa to take ownership of her own life and set herself free?A completely heartbreaking tale of love, loss and redemption, based on an astonishing true story from the founding of America. Perfect for fans of Before We Were Yours, Marie Benedict and America’s First Daughter.What readers are saying about Suzette D. Harrison:⭐⭐⭐⭐⭐ “If I could increase the ratings on this I would… I was literally blown away by this story… I can’t see anything surpassing this. I need more books like this.” Read Along with Sue⭐⭐⭐⭐⭐ “My, My, My and Wow, just Wow!!… What an excellent and amazing story!… Whew!!… Hallelujah!! This is an awesome book!!” Geri’s Things⭐⭐⭐⭐⭐ “23 hours. I devoured this book in 23 hours. It’s been a long time since I’ve felt so consumed by a book… This book destroyed me in the very best way… I will absolutely be recommending this book to EVERYONE!” Netgalley reviewer⭐⭐⭐⭐⭐ “WOW! Deserves 10 stars… Touched my soul… I laughed, cried, cussed.” Goodreads reviewer⭐⭐⭐⭐⭐ “Where do I start? For the first time, I am left speechless after reading a book. Speechless because the narrative just grabbed me by my core… I laughed, but mostly cried… Five stars.” Goodreads reviewer⭐⭐⭐⭐⭐ “Wow, I can’t possibly do this book justice in a review, I’m not going to even try—read it, it’s AMAZING!… A fantastic five stars from me!” Goodreads reviewer⭐⭐⭐⭐⭐ “I loved it so much… By the end of the book I was crying because of how great this story was. This story touched my heart so much.” Goodreads reviewer⭐⭐⭐⭐⭐ “I was hooked from the very first page… Be prepared to laugh, cry, and find that your mouth is unexpectedly dropping open!… A MUST-READ!” Goodreads reviewer⭐⭐⭐⭐⭐ “I was completely blown away by this beautiful story… I felt so many emotions… I laughed, cried, got angry, forgave, loved and so many more… Thank you for putting this book in front of me. I am so very grateful… Will stay with me forever.” Book Reviews For U⭐⭐⭐⭐⭐ “Heartbreaking, amazing book that I honestly think will stay with me for the whole of my life!” NetGalley reviewer⭐⭐⭐⭐⭐ “Compulsively readable… I couldn’t put it down… Fast-moving narratives kept me turning the page well past my bedtime.” Stacks and Stitches⭐⭐⭐⭐⭐ “Have some tissue close at hand.” Redheaded Book Lady",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B3S55J3J"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bookouture (September 6, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 6, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1653 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 322 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#27,846 in Kindle Store (See Top 100 in Kindle Store) #24 in Black & African American Historical Fiction (Kindle Store) #168 in U.S. Historical Fiction #227 in Historical Literary Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,306 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Justmari",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEF2U6RWOJCV3ZY5DSWWR3BQRWKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LMFTXIPI8QKG?ASIN=B0B3S55J3J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars So Heart Breakingly Beautiful",
                "reviewText": "I usually read romance but I was drawn to the strong woman on the cover. It felt like I needed this story in me on however I could get it. I let a lot of my duties go undone while reading this emotionally draining sometimes stop of pain and suffering at its worst. I couldn’t imagine my childhood being taken so harshly without my parents permission either way. I cried for so many reasons while going back and forth from here to there felt like my emotions were all over the place and I had to catch myself. It just felt so real for me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Key",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMJO6F4NPQ5VYEIB5IB2TJ2BIDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LD9JYUKCMTP?ASIN=B0B3S55J3J",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "4.0 out of 5 stars First time read by this author and I love it",
                "reviewText": "My thoughts💫This was my first book by this author, and I really enjoyed the story of Ms. Ona A Judge. Oney as they called her was a slave fk the Washington family she escaped when she found out she would be given to their granddaughter who was always so mean to her. The Washington's kept Ona and others enslaved, by moving them from the free state of Philadelphia back to Mount Vernon every six months. This book also introduces Ona's present day family who found her diary. Of you like historical fiction I'd highly recommend this one .",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tyra Tee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGN4VZA3QSCVWFPN27B34W4M3VEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FPL0KNRWNU2S?ASIN=B0B3S55J3J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars AMAZING!",
                "reviewText": "I don't have sufficient words to describe how amazing this book is. Hands down-the best book I've ever read in my life! I felt as though I was apart of Ona's life and felt everything she experienced. This story sent me on an emotional rollercoaster that I didn't want to end. I laughed, felt anger and cried a several times. Bravo to the author!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wanda Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHC2UG7NFG6HTWIJQHQWA7KQ6TRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OKPMMUJH41J3?ASIN=B0B3S55J3J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars The best novel ever",
                "reviewText": "Suzette this was a pager turner book. It's the kind of book to start your year off. The things my ancestors went through for freedom. I really enjoyed the book and will recommend reading and learning our history. Thanks for sharing it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gate",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAXA4D5FKXLAB6ETN473SLRP4EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15HNJQHXAK9KF?ASIN=B0B3S55J3J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars An Amazing Woman",
                "reviewText": "I have read 3 of Suzette Harrison’s historical novels and this one is my favorite. Ona Judge is one amazing woman, in life, and in the legacy she left.Read this book……if it doesn’t move you I will be amazed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chitown Bookworm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGH2MCM3JR6B2TA3IKXFUZNSWTNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AU9J6M24YAEY?ASIN=B0B3S55J3J",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Precious Memories",
                "reviewText": "The inhumanity of slavery and the drive and hope of a better life is front and center in the story. The ignorance of well-meaning slave owners who haven't got a clue what its like to be looked at as property is driven home as well. Good read for the historical fiction reader.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joyauburn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK5CS53ON3QRI2AZPBK3LTSN3JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO8SRYA6J8SU4?ASIN=B0B3S55J3J",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2022",
                "reviewTitle": "3.0 out of 5 stars more about Ona Judge",
                "reviewText": "The description of everyday life on Mt. Vernon was detailed and educational. Suzette Harrison captured Ona’s feelings, worries, lust for freedom, and life as a young innocent girl born into slavery. The description of the Washingtons was enlightening and told from the prospective of a slave. This part of the book was excellent, and I would have liked to have read more of it. The story about Tessa was boring and way too detailed. I felt it detracted from Ona. Could have been much shorter. I skimmed through most of it. Disappointed with this part of the book.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C.J.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLK3GE7PQVO4S4ABSAXSDV4R5ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IAFA876MKDBV?ASIN=B0B3S55J3J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing story",
                "reviewText": "An amazing story of a woman's struggle to maintain her dignity, her family, and her soul.I came across this story accidently and started to read it. I love historical novels and couldn't put it down. Although I assumed there was some small truth in the story it read as if it was 100% real and as far as I'm concerned it was.Suzette, thank you for helping this 71 year old white woman receive a small glimpse into the life as a slave, however difficult it is to be seen and felt!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 7, 2023",
                "reviewTitle": "She persisted, she resisted, she found her voice",
                "reviewText": "Heartbreaking and joyous at the same time. A story of resilience, wit, resourcefulness, persistence in the face of deception, inhumane or unjust treatment. It is also a story of community, sacrifice, family and hard fought for freedom to choose. Beautifully evocative and engagingly written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 13, 2023",
                "reviewTitle": "My Name Is Ona Judge - A poignant tale of a woman's courage",
                "reviewText": "Based on a true story of a young slave who escaped from the household of President George and Martha Washington. This is an incredible heart-breaking and heart-warming story of love, loss, bravery, resourcefulness and determination.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jemma gibson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 26, 2022",
                "reviewTitle": "Decent read",
                "reviewText": "Good read, but lacked the graphic grit, this topic needs to explain how harrowing these times really were. The Book of Night Women is a more daunting a read, that if you like plain trues.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 15, 2022",
                "reviewTitle": "Couldnt put it down. A great read",
                "reviewText": "Loved the book will now follow author and look forward to reading any other of her books",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liz Kelly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 28, 2023",
                "reviewTitle": "Good... But the same characters as 'Girl at the back of the bus'",
                "reviewText": "I read this book immediately after reading Suzette Harrison's 'Girl at the back of the bus' - that book blew me away, so I was keen to read more. 'My name is Ona Judge' was definitely a good read, but the characters and their struggles very closely mirrored those in 'Girl at the back of the bus', which for me tainted the read throughout. Read in isolation, I'd probably rate as 5 starts.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}